{"id":101350,"no":33,"title":"Page 33","content":"That was my cover story for the Night Watch – in the highly unlikely event that we had one of the other side\u0027s agents among us. As far as I know, that\u0027s something that\u0027s only happened once or twice in the entire history of the Watch, but you can never tell. . . Might as well let everyone think Boris Ignatievich had fallen out with his old girlfriend.\n There was a plausible reason, a good one. A hundred years of imprisonment in his office, without any chance to assume human form, partial rehabilitation, but with the loss of most of her magical powers. That was more than enough reason to take offence . . . And at least the story relieved me of the need to play the part of the boss\u0027s girlfriend, which would have been going just too far.\n I walked down to the third floor, thinking things through as I went. I had to admit that Olga had made things as easy for me as she could. She\u0027d put on jeans today, instead of her usual matching skirt and jacket or dress, and trainers instead of high heels. Even the light perfume she\u0027d used wasn\u0027t overpowering.\n I knew what I was supposed to do now, I knew how I was supposed to behave. But even so, it was still hard. Hard to turn into the modest, quiet side corridor instead of going toward the door.\n And into the past.\n They say hospitals have their own unforgettable smell. And of course they do. It would be strange if the mixture of bleach and pain, sterilising unit and wounds, standard-issue sheets and tasteless food didn\u0027t have some kind of smell.\n But where do schools and colleges get their smell from?\n Not all subjects are taught on the Watch\u0027s own premises. Some are easier to teach in the morgue, at night – we have our contacts there. Some are taught out in the field, some abroad. During my training, I spent time in Haiti, Angola, the USA and Spain.\n But there are still some lectures that can only be given in the Watch\u0027s own building, securely sealed off from its foundations to its roof by magic and protective spells. Thirty years ago, when the Watch first moved into this building, they set up three small rooms, each for fifteen trainees. I still don\u0027t know what most influenced that decision – the optimism of my colleagues or the fact that the space was available. Even when I was in training – and that was a very good year – one room was enough for all of us, and even then it was always half-empty.\n Right now the Watch was training four Others. And Svetlana was the only one we could be certain would join us and not prefer an ordinary human life.\n It was deserted here, deserted and quiet. I walked slowly along the corridor, glancing into the empty teaching rooms, which would have been the envy of even the best-equipped and most prosperous university. A laptop on every desk, a huge TV projector in each room, shelves of books . . . If only a historian could have seen those books.\n But historians never would see them.\n Some of the books contained too much truth. Others contained too many lies. Humans couldn\u0027t be allowed to read them, for the sake of their peace of mind. Let them carry on living with the history they were used to.\n The corridor terminated in a huge mirror that covered the entire end wall. When I casually glanced into it I saw a beautiful young woman swaying her hips as she strode along the corridor.\n I staggered and almost fell: Olga had done everything possible to make things easy for me, but even she couldn\u0027t change her own centre of gravity. As long as I forgot the way I looked, everything was more or less normal, the motor reflexes took over. But the moment I saw myself from the outside, things slipped out of sync. Even my breathing changed, and the air felt different as it entered my lungs.\n I walked up to the last door, a glass one, and peered through it cautiously.\n The class was just finishing.\n Today they\u0027d been studying everyday magic, I knew that the moment I saw Polina Vasilievna standing by the demonstration stand. She\u0027s one of the oldest members of the Watch – to look at, that is, not by her actual age. She\u0027d been discovered and initiated when she was already sixty-three. Who could have guessed that an old woman who earned her living by telling fortunes with cards during those wild years after the war actually possessed genuine powers? Quite considerable powers too, although only in a narrow field.\n \u0027And now, if you need to smarten up your clothes in a hurry, you can do it in a moment. Only don\u0027t forget to check first how much strength you have. Otherwise the result might be embarrassing.\u0027\n \u0027And when the clock strikes twelve, your carriage will turn into a pumpkin,\u0027 the young guy sitting beside Svetlana said loudly. I didn\u0027t know him, this was only his second or third day of training, but already I didn\u0027t like him.\n \u0027Precisely,\u0027 Polina exclaimed delightedly, even though she heard the same witticism from every group of trainees. \u0027Fairy tales lie just as much as statistics do, but sometimes you can find truth in them.\u0027\n She took a neatly ironed tuxedo off the desk. It was dapper and elegant, a little old-fashioned. James Bond must have worn one like it.\n \u0027When will it turn back to rags again?\u0027 Svetlana asked in a practical tone.\n \u0027In two hours,\u0027 Polina told her briskly. She put the jacket on a hanger and hung it on the stand. \u0027I didn\u0027t put much into it.\u0027\n \u0027And what\u0027s the longest you can keep it looking good?\u0027\n \u0027About twenty-four hours.\u0027\n Svetlana nodded and suddenly looked in my direction – she\u0027d sensed my presence. She smiled and waved. Now everyone had noticed me.\n \u0027Please come in,\u0027 said Polina, bowing her head. \u0027This is a great honour for us.\u0027\n Yes, she knew something about Olga that I didn\u0027t. All of us knew no more than one part of the truth about her; probably only the boss knew everything.\n I went in, trying desperately to make my walk a little less provocative. It did no good. The young guy sitting next to Svetlana, and the fifteen-year-old youth who\u0027d been stuck in the preliminary class for six months, and the tall, skinny Korean, who could have been thirty or forty – they all watched me.\n With very definite interest. The atmosphere of mystery that surrounded Olga, all the rumours, and above all the fact that she was the boss\u0027s lover from way back – all provoked a distinctly noticeable response from the male section of the Watch.\n \u0027Hello,\u0027 I said. \u0027I hope I\u0027m not interrupting?\u0027\n I was trying so hard to get my phrasing right, I forgot to control my tone, and my banal question came out sounding languidly mysterious, addressed to every single person there. The spotty-faced kid couldn\u0027t take his eyes off me, the young guy swallowed, and only the Korean maintained some semblance of composure.\n \u0027Olga, did you have an announcement for the students?\u0027 Polina asked.\n \u0027I need to have a word with Sveta.\u0027\n \u0027Then class dismissed,\u0027 she declared. \u0027Olga, please do call in some time during class. My lectures are no substitute for your experience.\u0027\n \u0027Certainly,\u0027 I promised generously. \u0027In three or four days.\u0027\n Olga could make good on my promises. I had to take the hits for her carefully cultivated sex appeal.\n Svetlana and I walked towards the door. I could feel three pairs of greedy eyes drilling into my back – well, not exactly my back.\n I knew that Olga and Svetlana had become close. I\u0027d known since that night when Olga and I had explained to her the truth about the world and the Others, the Light Ones and the Dark Ones, about the Watches and the Twilight, since that dawn when she had held our hands and walked through the closed door into the field headquarters of the Night Watch. Sure, Svetlana and I were closely linked. Destiny held us together in its firm grip, but only for the time being. Svetlana and Olga were just friends – it wasn\u0027t destiny that had brought them together. They were free.\n \u0027Olya, I have to wait for Anton,\u0027 said Svetlana, taking hold of my hand. It wasn\u0027t the gesture of a younger sister clutching her elder sister\u0027s hand, looking for support and reassurance. It was the gesture of an equal. And if Olga allowed Svetlana to behave as her equal, then she really did have a great future ahead of her.\n \u0027Don\u0027t bother, Sveta,\u0027 I said.\n Again there was something not quite right in the phrase or the tone. Svetlana gave me a puzzled look, and it was exactly like Garik\u0027s.\n \u0027I\u0027ll explain everything,\u0027 I said. \u0027But not right here. At your place.\u0027\n The new defences at her apartment were the best there were – the Watch had invested too much energy in its new member to lose her now. The boss hadn\u0027t even argued about whether I could confide in Svetlana, he\u0027d only insisted on one thing – it had to happen at her place.\n \u0027All right.\u0027 The surprise was still there in Svetlana\u0027s eyes, but she nodded in agreement. \u0027Are you sure it\u0027s not worth waiting for Anton?\u0027\n \u0027Absolutely,\u0027 I said, quite sincerely. \u0027Shall we take a car?\u0027\n \u0027Aren\u0027t you driving today?\u0027\n Idiot!\n I\u0027d forgotten that Olga\u0027s favourite mode of transport was the sports car the boss had given her as a present.\n \u0027That\u0027s what I meant – shall we drive?\u0027 I asked, realising I must seem rather foolish.\n Svetlana nodded. That puzzled look in her eyes was getting stronger.\n At least I knew how to drive. I\u0027d never been tempted by the dubious pleasure of owning a car in a megalopolis with lousy roads, but our training had included all sorts of things. Some things had been taught the ordinary way, some had been beaten into our heads by magic. I\u0027d been taught how to drive like an ordinary human, but if I suddenly happened to find myself in the cabin of a helicopter or a plane, then reflex responses I couldn\u0027t even remember in an ordinary state would kick in. At least, in theory they ought to kick in.\n I found the car keys in the handbag. The orange sports car, with its top down, was standing in the parking lot in front of the building, under the watchful eye of the security guards.\n \u0027Will you drive?\u0027 asked Svetlana.\n I nodded without saying anything, then got into the driving seat and started the engine. I remembered that Olga always took off like a bullet, but I didn\u0027t know how to do that.\n \u0027Olga, there\u0027s something wrong with you,\u0027 said Svetlana, finally deciding to say what was on her mind. I nodded as I drove out on to Leningrad Prospect.\n \u0027Sveta, we\u0027ll talk when we get to your place.\u0027\n I\u0027m no racing driver. We were driving for a long time, a lot longer than we ought to have been. But Svetlana didn\u0027t ask any more questions, she just sat there, leaning back in her seat and looking straight ahead. Maybe she was meditating, or maybe she was trying to look through the Twilight. Several times in the traffic jams, men tried to flirt with us from their cars – always the most expensive ones. At first I just found it annoying. Then it started to seem funny. By the end I wasn\u0027t reacting to it any longer, just like Svetlana.\n \u0027Olya, why did you make me come away? Why didn\u0027t you want me to wait for Anton?\u0027 Svetlana suddenly asked.\n I shrugged. I was sorely tempted to answer: \u0027Because he\u0027s sitting right here beside you.\u0027 The chances were pretty small that we were being observed. The car was protected by spells too, I could sense some of them, and some of them went beyond the level of my powers.\n But I restrained myself.\n Svetlana hadn\u0027t done the course on information security yet, it comes three months into the training. I think it would make good sense to put it in earlier, but a specific programme has to be designed for each individual Other, and that takes time.\n Once Svetlana had been through that ordeal, she\u0027d know when to keep quiet and when to speak. They just start feeding you information, strictly measured, in a specific sequence. Some of what you hear is true, and some of it\u0027s false. They tell you some of it quite freely and openly, and some of it under a terrible oath of secrecy. And some of it you find out \u0027accidentally\u0027, by eavesdropping or spying.\n And then everything you\u0027ve learned starts to ferment inside you, making you feel pain and fear, pushing and straining so hard to break out you think your heart\u0027s going to burst, demanding some immediate, irrational reaction. In the lectures they tell you all sorts of nonsense you don\u0027t really need to know to live as an Other, while the most important training and testing is taking place in your soul. \n","sourceLink":"https://allnovel.net/the-night-watch-watch-1/page-33.html","bookId":2623,"book":{"id":2623,"title":"The Night Watch (Watch #1)","description":"Storyline: \n Night Watch (Watch, #1) \n This epic saga chronicles the eternal war of the “Others,” an ancient race of humans with supernatural powers who must swear allegiance to either the Dark or the Light. The agents of the Dark – the Night Watch – oversee nocturnal activity, while the agents of the Light keep watch over the day. For a thousand years both sides have maintained a precarious balance of power, but an ancient prophecy has decreed that a supreme Other will one day emerge, threatening to tip the scales. Now, that day has arrived. When a mid-level Night Watch agent named Anton stumbles upon a cursed young woman – an uninitiated Other with magnificent potential – both sides prepare for a battle that could lay waste to the entire city, possible the world. With language that throbs like darkly humorous hard-rock lyrics about blood and power, freedom and responsibility, Night Watch is a chilling, cutting-edge thriller, a pulse-pounding ride of fusion fiction that will leave you breathless for the next instalment.\n \n","cover":"https://allnovel.net/images/the-night-watch-watch-1.jpg","author":"Sergei Lukyanenko","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-night-watch-watch-1.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 9:59:54 PM"}}
