{"id":101356,"no":39,"title":"Page 39","content":"\u0027Because you\u0027re the only who has the moral right to do it. You\u0027re the one under threat. You\u0027re only protecting yourself. For anybody else, handing over a Light One, even if he is purely acting on instinct, self-taught and misguided, would be too much of a shock. You\u0027ll survive it.\u0027\n \u0027I\u0027m not so sure.\u0027\n \u0027You will. And remember, Anton. You\u0027ve only got tonight. The Day Watch have no reason to drag things out. They\u0027ll bring a formal charge against you in the morning.\u0027\n \u0027Boris Ignatievich!\u0027\n \u0027Now remember. Remember who was in the restaurant. Who followed the Dark Magician out to the lavatory?\u0027\n \u0027Nobody,\u0027 Svetlana put in. \u0027I\u0027m sure of it. I kept looking to see when he would come out.\u0027\n \u0027That means the Maverick was waiting for the Dark Magician in there. But he had to come out. Do you remember? Sveta, Anton?\u0027\n Neither of us said anything. I didn\u0027t remember. I\u0027d been trying not to look at the Dark Magician.\n \u0027One man did come out,\u0027 said Svetlana. \u0027He was kind of. . .\u0027\n She thought about it.\n \u0027Ordinary, absolutely ordinary. An average man, as if someone had mixed a million faces together and made an average one. I just caught a glimpse and forgot him straight away.\u0027\n \u0027Remember now,\u0027 the boss demanded.\n \u0027I can\u0027t, Boris Ignatievich. He was just a man. Middle-aged. I didn\u0027t even realise he was an Other.\u0027\n \u0027He\u0027s an elemental Other. He doesn\u0027t even enter the Twilight, just stays right on the edge. Remember, Sveta! His face or some distinctive feature.\u0027\n Svetlana rubbed her nose with her finger.\n \u0027When he came out and sat down at his table, there was a woman there. A beautiful woman with dark blonde hair. It was dyed. And she was upset about something. She was smiling, but her smile looked wrong. As if she wanted to stay, but they had to leave.\u0027\n She started thinking again.\n \u0027The woman\u0027s aura. You remember it. Let me have the image!\u0027 the boss exclaimed, speaking more loudly and in a different tone. Of course, no one in the restaurant heard him, but for a brief moment the expressions on people\u0027s faces distorted and a waiter carrying a tray stumbled and dropped a bottle of wine and two glasses.\n Svetlana shook her head sharply. The boss had put her in a trance as easily as if she was an ordinary human. Her pupils opened wide and a pale, thin, glimmering rainbow connected their two faces.\n \u0027Thank you, Sveta,\u0027 said Boris Ignatievich.\n \u0027Did I manage it?\u0027 the girl asked, surprised.\n \u0027Yes. You can consider yourself a seventh-grade magician. I\u0027ll confirm that I tested you in person. Anton!\u0027\n This time I looked into the boss\u0027s eyes.\n A brief jolt.\n Streaming threads of an energy unknown to ordinary humans.\n An image.\n No, I didn\u0027t see the face of the Maverick\u0027s female companion. I saw her aura, and that\u0027s worth far more. Blue and green layers intermingled like ice-cream in a glass, a small brown spot, a white streak. A fairly complex aura, not easy to forget, and essentially quite attractive. It upset me – she loved him.\n She loved him and she was feeling hurt about something. She thought he didn\u0027t love her any more, but she was still holding on and she was prepared to keep going on like that.\n By following this woman\u0027s trail I would find the Maverick. And hand him over to a tribunal – to certain death.\n \u0027No!\u0027 I said.\n The boss gave me a pitying look.\n \u0027She\u0027s not guilty of anything. And she loves him, you can see that.\u0027\n That dismal music was still whining in my ears, and nobody there took any notice of my cry. I could have rolled around on the floor and dived under people\u0027s tables – they\u0027d have just lifted their feet up and carried on with their curries.\n Svetlana looked at us. She\u0027d remembered the aura, but she hadn\u0027t been able to interpret it. That\u0027s a grade six skill.\n \u0027Then you\u0027ll die,\u0027 said the boss.\n \u0027At least I\u0027ll know what for.\u0027\n \u0027Have you thought about the people who love you, Anton?\u0027\n \u0027I don\u0027t have any right to do that.\u0027\n Boris Ignatievich grinned wryly:\n \u0027A hero! Oh, what great heroes we all are! Clean hands, hearts of gold, feet that have never trodden in shit. Have you forgotten the woman who was taken out of here? And the crying children, have you forgotten them? They\u0027re not Dark Ones. They\u0027re ordinary people, the ones we promised to protect. How long do we spend on getting the balance right for every operation we plan? I may curse our analysts every moment of the day, but why are they all grey-haired by the age of fifty?\u0027\n It felt like the boss was striking me across the face. He was lecturing me just as I\u0027d lectured Svetlana so recently, with absolute confidence.\n \u0027The Watch needs you, Anton. It needs Sveta. But it doesn\u0027t need some crazy psychopath, no matter how well intentioned he might be. It\u0027s easy enough to take a little dagger and start hunting Dark Ones in back alleys and lavatories. Without thinking about the consequences or weighing up the guilt. Where\u0027s our front line, Anton?\u0027\n \u0027Among ordinary people.\u0027 I lowered my eyes.\n \u0027Who do we protect?\u0027\n \u0027Ordinary people.\u0027\n \u0027There is no abstract Evil, you have to understand that! Its roots are here, all around us, in this herd that carries on chewing and having a good time only an hour after a murder. That\u0027s what you have to fight for. For people. Evil is a hydra with many heads, and the more of them you cut off, the more it grows! Hydras have to be starved to death, don\u0027t you see? Kill a hundred Dark Ones, and a thousand more will take their place. That\u0027s why the Maverick is guilty. And that\u0027s why you, Anton, and no one else, will find him. And make sure he stands trial. Either voluntarily or forcibly—\u0027\n The boss suddenly broke off and rose abruptly to his feet.\n \u0027Let\u0027s go, ladies.\u0027\n I\u0027d never seen him behave like that. I leapt up and grabbed my handbag – an automatic reflex response.\n The boss wouldn\u0027t get jittery without good reason.\n \u0027Quickly!\u0027\n I suddenly realised I needed to visit the place where the unfortunate Dark Magician had met his end. But I didn\u0027t say a word. We moved towards the exit so fast the security guards would have been sure to stop us, if only they could have seen us.\n \u0027Too late,\u0027 the boss said quietly, right beside the door. \u0027We were talking too long.\u0027\n Three people walked into the restaurant as if they were sliding through the door. Two well-built young men and a woman.\n I knew the woman. It was Alisa Donnikova, the witch from the Day Watch. Her eyes widened when she spotted the boss.\n She was followed by two barely perceptible silhouettes moving through the Twilight.\n \u0027Would you wait a moment, please?\u0027 Alisa said in a hoarse voice, as if her throat had suddenly gone dry.\n \u0027Begone!\u0027 The boss made a swift gesture with one hand, and the Dark Ones were forced aside, towards the walls. Alisa leaned over hard, trying to resist the elastic wall of force, but her powers weren\u0027t up to it.\n \u0027Zabulon, I summon you!\u0027 she cried.\n Well, well! The witch must be a real favourite of the Day Watch boss if she had the right to summon him.\n The other two Dark Ones emerged from the Twilight. I identified them at a glance as warrior magicians of the third or fourth grade. Of course, they were absolutely no match for Boris Ignatievich, and I could give the boss a hand, but they could drag things out.\n The boss realised that too.\n \u0027What do you want?\u0027 he asked threateningly. \u0027This is the time of the Night Watch.\u0027\n \u0027A crime has been committed,\u0027 said Alisa, her eyes blazing. \u0027Here, not long ago. One of our brothers has been killed, killed by one of. . .\u0027 She stared hard at the boss, then at me.\n \u0027One of. . . ?\u0027 the boss asked expectantly. The witch didn\u0027t take the bait. If she\u0027d been foolish enough to level an accusation like that at the boss, with her status and at the wrong time, he would have splattered her across the wall.\n And he wouldn\u0027t have paused for a moment to wonder if such a step was reasonable or not.\n \u0027One of the Light Ones!\u0027\n \u0027The Night Watch has no idea who the criminal is.\u0027\n \u0027We officially request assistance.\u0027\n So. Now we had nowhere left to retreat. A refusal to render assistance to the other Watch was as good as a declaration of war.\n \u0027Zabulon, I call on you!\u0027 the witch cried again. I was beginning to hope that maybe the Dark leader couldn\u0027t hear her or was tied up with something important.\n \u0027We are willing to collaborate,\u0027 said the boss. His voice was like ice.\n I glanced back into the dining area, over the shoulders of the magicians – the Dark Ones had already surrounded us, clearly intending to keep us by the door – and what was happening in the restaurant was quite incredible.\n People were stuffing themselves.\n They were chewing so loudly it sounded as if there were pigs at every table. Their eyes were glazed, their fingers clutched knives and forks, but they were raking up the food with their hands, choking on it, snorting and spitting it out. A respectable-looking middle-aged man who\u0027d been dining sedately in the company of three bodyguards and a young woman was gulping wine straight from the bottle. A smart-looking young man – a yuppie type – and his pretty girlfriend were fighting over a plate, spilling the thick, orange sauce over themselves. The waiters were rushing from table to table, flinging plates, cups, bottles, braziers and dishes at the diners. . .\n The Dark Ones have their own methods of distracting outsiders.\n \u0027Were any of you present in the restaurant when the murder was committed?\u0027 the witch asked triumphantly. The boss paused before he answered.\n \u0027Yes.\u0027\n \u0027Who?\u0027\n \u0027My companions.\u0027\n \u0027Olga, Svetlana,\u0027 said the witch, devouring us with her eyes. \u0027Was there not also present another Night Watch agent, whose human name is Anton Gorodetsky?\u0027\n \u0027Apart from us, there were no other members of the Night Watch present,\u0027 Svetlana said quickly, perhaps too quickly. Alisa frowned.\n \u0027A quiet night, isn\u0027t it?\u0027 said a voice from the doorway.\n Zabulon had answered the summons.\n I looked at him in despair, realising that a supreme magician would not be taken in by my disguise. He might not have recognised Ilya as the boss, but the old fox wouldn\u0027t be caught out by the same trick twice.\n \u0027Not so very quiet, Zabulon,\u0027 the boss said simply. \u0027Call off your minions, or I\u0027ll have to do it for you.\u0027\n The Dark Magician still looked exactly the same, as if time had stopped, as if the icy winter hadn\u0027t finally given way to a warm spring. A dark suit, a tie, a grey shirt, old-fashioned, narrow shoes. Sunken cheeks, dull eyes, short hair. \n","sourceLink":"https://allnovel.net/the-night-watch-watch-1/page-39.html","bookId":2623,"book":{"id":2623,"title":"The Night Watch (Watch #1)","description":"Storyline: \n Night Watch (Watch, #1) \n This epic saga chronicles the eternal war of the “Others,” an ancient race of humans with supernatural powers who must swear allegiance to either the Dark or the Light. The agents of the Dark – the Night Watch – oversee nocturnal activity, while the agents of the Light keep watch over the day. For a thousand years both sides have maintained a precarious balance of power, but an ancient prophecy has decreed that a supreme Other will one day emerge, threatening to tip the scales. Now, that day has arrived. When a mid-level Night Watch agent named Anton stumbles upon a cursed young woman – an uninitiated Other with magnificent potential – both sides prepare for a battle that could lay waste to the entire city, possible the world. With language that throbs like darkly humorous hard-rock lyrics about blood and power, freedom and responsibility, Night Watch is a chilling, cutting-edge thriller, a pulse-pounding ride of fusion fiction that will leave you breathless for the next instalment.\n \n","cover":"https://allnovel.net/images/the-night-watch-watch-1.jpg","author":"Sergei Lukyanenko","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-night-watch-watch-1.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 9:59:54 PM"}}
