{"id":84897,"no":24,"title":"Page 24","content":"\\n\\n A tear grew in my eye and slowly trickled down my cheek. I was certain it had very little to do with John the Baptist and more to do with Mike the asshole, but I let the painting be the reason I was overwhelmed.\\n\\n Luce looked down on me with a soft smile. He wiped my tear. I smiled back, \"Thank you for showing me this.\"\\n\\n He nodded, \"No, thank you.\" He pointed, \"Do you want to see another amazing one? The ability of the painter is remarkable.\"\\n\\n I nodded. He pulled me gently to a dark painting with a man lost in his own reflection.\\n\\n \"Narcissus.\" I read. It was older than the one before. It looked as if it was mocking vanity maybe, like the man was stuck staring at himself.\\n\\n We walked, not speaking, just taking everything in. There was a stone archway that looked like a reproduction, sculptures, paintings, and carvings. They started to blend into each other until we reached the tapestries. They were like rugs held on looms high in the air. The art made of thread was impressive in both size and detail. I felt like a different person with Luce. Someone who could be quiet inside of herself and just appreciate the things around her.\\n\\n We linked our fingers into each other\u0027s at some point, walking like lovers in Rome, people we weren’t. He pulled me out another door to a long corridor of arches. It was so big, and yet, ornate. I felt like I could be that backpacking student who was seeing everything before her life started.\\n\\n He walked us to a column and pressed my back against it, looking down on me. My heart was in my throat. He ran a hand down my cheek, \"You are so beautiful.\"\\n\\n I swallowed hard, \"I can\u0027t do this. I\u0027m so sorry, Luce. I am still recovering from something.\"\\n\\n \"France?\"\\n\\n I winced and nodded.\\n\\n \"He\u0027s engaged.\"\\n\\n I looked down at his waist, \"I know. I made a mistake coming here. My sister and his best friend back home, they bought me the ticket to come see him and set it up. I didn’t know he was engaged.\"\\n\\n He lifted my chin, \"You deserve someone so much better than a man who would even look at a gold digger like Daniela.\"\\n\\n I laughed, \"I think I drove him to Daniela, unfortunately. France is the greatest guy in the world, but he makes terrible choices when he\u0027s upset.\"\\n\\n Luce smiled, \"We will get a gelato and you will tell me this terrible story of the breaking of Mike France.\"\\n\\n I laughed, \"Deal.\"\\n\\n I linked my arm into his and pointed at the pillars, \"If we\u0027re both still single in six months, can I get a rain check for that pillar kiss?\"\\n\\n He laughed, \"Yes. But I don’t think I can wait six months.\"\\n\\n I laughed harder, feeling the blush taking over my face.\\n\\n Sunday Night\\n\\n Daniela passed me a hot chocolate, which to Italians is a thick and delightful thing you dip your biscotti into. You didn’t drink it, so much as savor it, with baked goods. She dumped some Frangelico into both our small cups and winked at me, \"It\u0027s good.\"\\n\\n It turned out, it was pretty hard to dislike her.\\n\\n She was sweet. I saw the money grubbing she did, but she was no different than the girls I had always hung out with. She was like a soul sister to me, really.\\n\\n My life had been spent in pursuit of a man to marry me and buy me expensive things and get me into the right circles—oh and love me.\\n\\n Daniela looked excited as we waited for the teams to hit the ice.\\n\\n \"So you watch a lot of hockey?\"\\n\\n I shook my head, \"No. Not so much.\"\\n\\n She frowned, \"But you\u0027re American.\"\\n\\n I laughed, \"I\u0027m more of an after-party sort of girl.\"\\n\\n She nodded, \"The after-parties are fun. That is where I met Mike.\"\\n\\n I grimaced, \"Yikes. They are usually pretty nasty. One time when Mike and I were about nineteen, he came home for Christmas from wherever the hell he was. We went to a party and one of the guys he was teammates with, came up and asked me to take his wife out for a smoke. I smoked at the time. So I asked her to come with me. She was excited someone was even talking to her. I had my smoke and she got into a conversation with another girl. I left her there on the deck and went back inside to go to the washroom. I opened the door to find her husband screwing some random chick in the washroom. I closed the door and went back out onto the deck. He came out about twenty minutes later and wrapped his arm around her, like nothing had happened. I learned then, the difference between puck fucks and wives. I also lost a lot of respect for the players.\"\\n\\n I dipped my biscotti and took a bite. She looked disturbed, \"That doesn’t happen now though?\"\\n\\n I shook my head, \"It happens every day. Why do you think there are so many divorces with sports players? They are surrounded by adoring fans who want to give them everything and anything they could possibly want.\" I wrinkled my nose, \"That\u0027s why Mike is still single. His best friend Will is the same. He won\u0027t marry until he knows he is almost done with the game.\"\\n\\n She swallowed hard. I felt the tiniest bit of remorse, but it was washed down with the delicious biscotti and the vision of the players as they skated out onto the ice. They looked sexy in their gear.\\n\\n The anthems were sung and the announcer got the game going. The puck dropped and it was on. I didn’t realize how much I did enjoy watching hockey until it was the second period. I was out of my seat screaming as Mike was on a breakaway. He scored. Daniela and I hugged each other and jumped up and down in our heeled boots.\\n\\n The game ended with a win, Italy over Germany 6—3. We waited in the seats for a few minutes. The game was over and the box was quiet.\\n\\n She finally touched my hand, \"I want you to know I love him. I know he is like a brother to you, and you watch out for him and worry. But you don’t have to. I adore him.\"\\n\\n I smiled, it was the fake plastic one my mom taught me, \"I\u0027m glad.\" I wasn’t. I was dying inside, but he had chosen to be with her, even when I had professed my love for him. Even when I had flown to Rome. Even when he saw the sash and knew the truth.\\n\\n He had chosen her, and if I wanted him to still be my France, I had to accept his wife.\\n\\n She stood, \"We can wait downstairs in the heat.\"\\n\\n The box we were in was warm enough, but I could sense the awkwardness coming from us both and agreed. We walked with only the sound of our heels clicking on the floor. I had bought myself boots with Luce. He had showed me where the Italians buy their footwear, all designer but discounted. I had gotten a pair of grey A. Testoni platform, knee-high boots for three hundred euros. It was a steal. The pair I had gotten the last time I was in Rome had cost me eight hundred. They were a mixture of leather and suede.\\n\\n Daniela nodded at them when we got downstairs, \"Those are beautiful.\"\\n\\n I smiled, \"Thanks. I went shopping with Luce.\"\\n\\n She smiled wide, \"He is a beautiful man.\"\\n\\n I nodded, \"Yikes. He is trouble, I can tell. Smooth and sweet and dresses well. He scored three of the goals.\"\\n\\n \"He\u0027s going to Boston to play too. When the owners came to speak with Michael, they saw him play. Offered him a huge contract too.\"\\n\\n I frowned, \"How old is he?\"\\n\\n \"Twenty-four.\"\\n\\n I bit my lip, \"Oh.\" He was four years younger than I was. \"I wonder why he never got scouted when he was young?\"\\n\\n Her eyes widened, \"He was in a terrible accident. He has a huge scar on his leg. He was in rehab for it for two years. He was drafted as a young man, but he never made it to America. Now he\u0027s older and still playing just as well, if not better. They want him now.\"\\n\\n I sighed, \"That facial hair and confidence definitely make him look older.\"\\n\\n She nudged me, \"He is not too young for you. Besides, that is an Italian way. Older woman, younger man. Very common.\"\\n\\n I could count the days to my 29th birthday. Five years older. What was I thinking? She had me distracted from France. She was good. Too good.\\n\\n I wanted to hate her and destroy her, but I couldn’t.\\n\\n The group of the foreigners came from the dressing room together. They had to stop and sign autographs. Girls were crying and kissing cheeks and making a spectacle. Daniela tried to look stoic, but I could see the annoyance on her face. I had created the doubt that now sat in her eyes.\\n\\n France came over to us, looking confused. Daniela wrapped her arms around him. He hugged her to him, but I could see the way he wasn’t all in. He was half-assing the hug.\\n\\n Tex grinned at me, \"Ready to drink some wine, Jack?\"\\n\\n France made a face but I ignored him and nodded, \"I am if you are.\"\\n\\n Luce walked up, inspecting my boots, \"They look lovely.\" I almost melted into his green eyes. I nodded, \"Thanks for helping me pick them out.\"\\n\\n He cut Tex off and looped my arm into his, \"Tell me about this obsession you have with wine.\"\\n\\n I let him lead me out to the cab. Some of the Italians on the team were joining our group suddenly. Tex nudged me, \"We invited the team.\"\\n\\n I nodded, \"Okay.\"\\n\\n France sighed, \"Red wine tasting as our after-party?\"\\n\\n Daniela poked him, \"I think it\u0027s a marvelous idea.\"\\n\\n He glanced down at her, maybe catching the glare of doubt in her eyes, and shrugged, \"Whatever.\"\\n\\n When we got to the hotel, Romeo had a magnificent spread. He had red wines, white wines, and blush wines set up at three separate tables. He was grinning from ear to ear as we walked in.\\n\\n \"Ms. Croix, welcome to our wine tasting. I have selected, what we here at the Boscolo Aleph, consider our best wines. Some are top shelf and others are surprisingly good for their cost level and popularity.\"\\n\\n There was a member of the hotel staff at each table to pour the wine and discuss it.\\n\\n Daniela\u0027s face was glowing, \"This is a smart after-party.\"\\n\\n France glared at me, \"Leave it to you to wreck my last night with the guys.\"\\n\\n I stuck my tongue out at him, \"We aren’t even close to even.\"\\n\\n Luce was hovering over me, \"Which should I taste first?\"\\n\\n I turned my back on France and took Luce\u0027s arm, \"White.\" We strolled over to the table to taste the best whites I had ever had. \\n\\n","sourceLink":"https://allnovel.net/the-long-way-home/page-24.html","bookId":1890,"book":{"id":1890,"title":"The Long Way Home","description":"Storyline: How lucky can one girl get? \\n Just ask Jacqueline Croix. \\n She has it all. \\n The right fiancé, money, looks, and connections. \\n But everything comes at a cost. \\n Sometimes that cost is looking the other way when the imperfections of your world start to show themselves. \\n When something happens she can\u0027t look away from, she ends up drunk in a Chanel dress at a pity party on the beach in SC. \\n There on the beach, she finally sees the cost of having everything is too high. \\n Luckily, Jacqueline has one thing most girls like her do not, somewhere to run when she leaves it all behind. \\n That somewhere happens to be to the open arms of the New York Rangers\u0027 right wing, Mike France. \\n He has always been there through thick and thin, waiting for his chance to make her his. \\n But how do you go from being best friends to lovers, when you know all the dirty details?\\n","cover":"https://allnovel.net/images/the-long-way-home.jpg","author":"Tara Brown","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-long-way-home.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 5:02:35 PM"}}
