{"id":84911,"no":38,"title":"Page 38","content":"I closed my eyes and let him try to convince me to take my clothes off. It was my beach, after all. Saturday Night - The Wedding It felt like Italy. I took my glass of wine and walked onto the back deck, overlooking the other villa and the sea. I sat under a lit tent and watched the waves. \"This is it, Jacqueline. You did it.\" I smiled at Luce as he sat in the chair next to me. He held his wine glass up to me. I clinked it. \"To new beginnings.\" I glanced back at the girl he had brought, \"She is beautiful.\" He nodded, \"Inside and out.\" \"Best kind.\" We sat in silence. It wasn’t awkward with him like it could have been. We understood each other too well. He knew every minute of the journey I had been on and vice versa. \"Do you think you will head back to Rome after the harvest?\" I smiled, \"I do. I think we are planning a little excursion. Stanley wants to stay on and help out. He\u0027s not loving retirement. I am in the process of building him a caretaker\u0027s house. So he will be able to hold down the fort. After the harvest and the processing, we will be done by October.\" \"Have you considered ice wine?\" I wrinkled my nose, \"No. I think it\u0027s gross. I can\u0027t get into it. My sommelier, Sandy, wants me to—but blech.\" He laughed. Brandi came out onto the deck. She sat next to me, sipping her wine slowly, \"Some view, sis.\" I nodded, \"It is. I got lucky with this place.\" She laughed, \"No, you never. You got exactly what you deserved.\" She looked stunning in her wedding gown. Luce held his glass out for her, \"We all have.\" I clinked my glass with theirs and sat back to enjoy the view. \"I\u0027m pregnant again.\" I coughed on my wine a little as Luce snatched the wine from her hand. She laughed, \"It\u0027s cranberry juice.\" I choked for a second, \"Wh-wh-what?\" She smiled like I had never seen before, \"Yup. Just over a month we figure.\" I shook my head, \"Wow, so soon? Abby is only a year.\" She nodded, \"I want them close so they\u0027ll play like you and I did.\" It made me smile. We had played. She had been my friend more than she had ever been my sister. I had assumed that was what sisters were, friends who slept over. Luce handed her back the glass after checking; he knew her well enough. He held his glass up again, \"Congratulations.\" I clinked my glass again, \"Yes, congratulations to you all. The wedding was stunning and the baby will be an amazing addition.\" She gushed, \"I know. Thanks again for the wedding. It was perfect, with none of our old friends. Just what I wanted. Will is up for contract this year so wherever he ends up, I will get a fresh start.\" I smiled, \"I know. This place has been like a retreat. If he ends up somewhere sucky, you know you can always live here.\" She gave me a smile, \"I can\u0027t live without him, J.D.\" I looked back at Mike talking with Sal and Arthur, \"I know that feeling.\" He gave me a shitty grin when he saw me looking at him. My mom walked past him. I jumped up, \"Excuse me.\" I ran over to her. I grabbed her hand. She gave me a look of shock and annoyance. I wrapped my arms around her, \"Thank you.\" She hugged me back, \"We can fix all of the things we left broken for so long, Jacqueline. I do love you very much.\" I nodded into her shoulder, \"I know you do. I love you too, Mom.\" I hoped my dad was watching. The whole wedding was a hit and the photographer got hundreds of shots for our portfolio for the bridal magazines. Experiencing the Italian villa wedding in the US was economical and easier. No passports and foreign planners. Just me, Mom and Muriel. God help them. I put the last of the dishes into the staff kitchen and thanked everyone. I turned and walked back to my house, excited to crawl into bed and sleep for a week. When I got to the house, it was dark. Everyone had gone to bed, eager to sleep for a week too. I opened the door to our room, stopping when I saw the lanterns lighting the way out to the porch. I walked out to the deck, then stopped, stunned by what I saw. The entire yard was filled with lanterns that were lit and glowing bright. Mike was on the deck holding a lantern. I looked at the lights everywhere, \"Mike?\" He dropped to his knees, \"I never got to ask the right way. Jacqueline, will you do me the honor of being my home and my heart forever and ever?\" I nodded, feeling the emotion and exhaustion starting to blend. He let go of his lantern and in his hand was a ring box. He lifted the ring and placed it on my finger. The diamond sparkled in the lights. He stood and kissed me softly before turning to the lights in the yard. \"She said yes!\" The lanterns all sailed from the hands of the people I hadn’t seen. They sailed up around the yard and out to the ocean. It was an amazing thing to see. I pointed, \"Is that going to burn my vineyard?\" He laughed, \"They burn out fast. And Stan said the wind was going out to sea so we were good to go.\" He kissed my head, \"I have a bunch of guys with hoses on standby.\" The crowd below erupted as the lights filled the sky for a second and then sailed away and went out. Mike wrapped his arm around me and waved to the people below. I saw my mother waving like a madwoman. I looked at the diamond on my finger, \"Is it colored?\" He nodded, \"You already had a white one, I figured mine could be a different color.\" I laughed, \"I love it.\" He reached behind me to a box and passed it to me, \"I have one more surprise.\" I frowned as I opened the box. Inside was the dress, CHANEL. She was alive and well. I pulled her from the box, \"How?\" He smiled, \"I stole it from your mom’s and took it to the store. I explained that I needed another one, but I wanted it a little different.\" I let her fall open and noticed the weight difference right away. She was a gown. In the light I could see the flowers and the gathered fabric. She was stunning. The flower petals moved in the wind. I shook my head, \"I have no words.\" He kissed my forehead, \"Good. I have something else in mind.\" I put her back in the box carefully as he waved goodnight to our family and friends below. I placed CHANEL on a chair and turned to see Mike closing the drapes. \"Thank you.\" He shook his head, \"No, thank you.\" \"How did I get so lucky to find someone like you?\" He turned and grabbed my hands, pulling me to the bed, \"You didn’t find me, Jack. You made me this way. You make me better.\" I shook my head, \"Mike, that’s all you.\" He kissed me on the shoulder as he pulled my shirt off and tossed it on the floor, \"No, Jack. You make me want to try.\" I closed my eyes and savored those words. The End.","sourceLink":"https://allnovel.net/the-long-way-home/page-38.html","bookId":1890,"book":{"id":1890,"title":"The Long Way Home","description":"Storyline: How lucky can one girl get? Just ask Jacqueline Croix. She has it all. The right fiancé, money, looks, and connections. But everything comes at a cost. Sometimes that cost is looking the other way when the imperfections of your world start to show themselves. When something happens she can\u0027t look away from, she ends up drunk in a Chanel dress at a pity party on the beach in SC. There on the beach, she finally sees the cost of having everything is too high. Luckily, Jacqueline has one thing most girls like her do not, somewhere to run when she leaves it all behind. That somewhere happens to be to the open arms of the New York Rangers\u0027 right wing, Mike France. He has always been there through thick and thin, waiting for his chance to make her his. But how do you go from being best friends to lovers, when you know all the dirty details?","cover":"https://allnovel.net/images/the-long-way-home.jpg","author":"Tara Brown","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-long-way-home.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 5:02:35 PM"}}
