{"id":84878,"no":4,"title":"Page 4","content":"\\n\\n When I woke up, he was sleeping too. Both our seats were back. I looked at his messy, dark hair and beard, and smiled. He looked homeless. I lifted a hand and ran my fingers through the beard. He moaned and shook his head, “That’s sleep assault. It’s a sex crime.”\\n\\n I laughed and tried not to sigh when he grinned. He was handsome, but he was more. He was comfortable and sweet and fun and mine. He was always mine.\\n\\n He opened a dark eye, “Run away with me.”\\n\\n I nodded, “Okay. One day, I swear.”\\n\\n He pointed, “I’m holding you to this.”\\n\\n I narrowed my gaze, “Would you ever want kids? Like if you got married?”\\n\\n He smirked, “Are you asking me to impregnate you?”\\n\\n I shook my head, “Not even close. Just curious. I think I want kids one day, maybe. I don’t think Phil does though.”\\n\\n He laughed, “Yeah, I want kids. I actually thought Denise and me might have kids last year. When we broke up, it hit me that I’m twenty-eight, I want that, and I’m running out of time. The older guys on the team who are having kids and whatever, they all seem exhausted and stressed. They keep telling me not to do it, not to settle down, but I want it. I just don’t want to be forty when I finally have a kid.”\\n\\n The smile that crossed my lips was fake and hateful. I hated the idea of him with anyone but me, and yet, I never chose him. I yawned, “I need to go home.”\\n\\n He put a finger to my lips, “No yawning. I still have to fly to SC tonight.”\\n\\n “Why?”\\n\\n “Gotta get the summer house ready for summer. The whole family starts arriving at the end of June. They stay the whole damned summer. So I told the boys we’ll have an impromptu party there in two nights for the end of the season and then I may head on vacation before summer training.”\\n\\n I frowned, “It’s almost the end of June now.”\\n\\n “I know. I don’t have a lot of free time. I have a couple weeks off and then it’s summer training and shit.”\\n\\n I smiled, “Okay. I still need to go home.”\\n\\n He leaned forward, making the awkward moment where we wouldn’t kiss again and brushed his lips against my cheek, “Thanks for the uncomfortable nap.”\\n\\n I wrapped my arms around his neck, holding him to me, “Thank you for making me feel safe again.”\\n\\n He moaned into my neck, “You can’t say shit like that. That’s not fair. You’re getting married; you gotta keep that locked up or start putting out.”\\n\\n I laughed into his neck, “You’re nasty.”\\n\\n He pulled back, shooting me a shit-eating grin, “I’m serious. You and me together are hot. You remember the first time?”\\n\\n I rolled my eyes, “We were fifteen, I barely remember.” That was a lie. I recalled every detail of the first time it happened. I recalled the millions of times it nearly happened and the few it had since then. I remembered everything about him. The weight of his muscled body on top of mine was still my go-to fantasy when Phil was on top of me.\\n\\n He looked hurt, “You remember. What about the time, when I came back from Los Angeles and you were practically engaged? Worst summer of my life.”\\n\\n I winced, “You know the choice I had.”\\n\\n He ran a finger along my jaw line, “I know you had a choice, Jack. You chose the wrong thing.”\\n\\n I nodded, “I know, France.” I pulled back and smiled, “I still need to go home.”\\n\\n He made a happy sound and smiled wide, “I like it when you accidentally call me France. Makes me remember you before you and the Xanex and Phil the douche.”\\n\\n I swatted him, “I meant Mike.”\\n\\n “Sure you did.” He sat his seat up and started the car. He looked too big to be in my car. He wiggled and shot me a look, “This is a shit car. Next time we take a beach nap, we do it in my truck.” When he was sleepy his South Carolina accent was thicker. No matter how long he had been away from it all, he was still a country boy.\\n\\n “Okay. Your seats are comfier anyway.”\\n\\n His lips curled into a sly grin, “They feel better on your back than bucket seats.”\\n\\n “Not going to happen.”\\n\\n His voice changed to a low tone I took seriously, “You’re not the kind of girl I’d fuck in my truck anyway.”\\n\\n “Gross.”\\n\\n He laughed and drove back to his place. We got out at the same time. He wrapped around me, “Say hi to Phil for me.”\\n\\n I laughed, “Say hi to the puck fucks for me.”\\n\\n He pulled me back, giving me a stern look, “I don’t like it when you swear. It’s like my fantasy of you being all classy and shit is ruined. Then you become the tree-climbing little slob you were when we were little.”\\n\\n “I love you.”\\n\\n He nodded, “If you need me, call.”\\n\\n I got in the car and drove to Muriel’s to check on her.\\n\\n Her maid answered with a wary look. It was late in the evening and she had, no doubt, been caring for Muriel for hours.\\n\\n “Hi, is she in?”\\n\\n She nodded, “She‘s upstairs. She isn’t well.”\\n\\n I sighed, “I know. I’m the one who paid the server to bring her home a few hours ago.” I walked past her and up the grand staircase. I knocked on the huge door, “Muriel. It’s Jacqueline.”\\n\\n She didn’t respond. I opened the door to the room, squinting in the dim light to find her. The room was massive, but I saw her instantly. She was curled in a ball in the corner of the room, tucked in by the large windows with thick curtains drawn.\\n\\n I closed the door and walked over quietly, “Muriel are you okay?”\\n\\n She didn’t move.\\n\\n I dropped to my knees next to her, taking her hand in mine.\\n\\n She sniffled, “I always suspected something was going on. I never imagined anyone else did though. I thought he was careful and that was why I couldn’t prove it. I didn’t know everyone knew. I didn’t know my children knew.”\\n\\n My heart hurt for her. I squeezed her hand.\\n\\n She continued, “My daughter came to me two weeks ago and told me her best friend’s husband was cheating on her. She looked me in the eyes and said, don’t worry Mom, I told her to keep her chin up and act like she didn’t know. That’s what you did and everyone still respected you.” she sobbed.\\n\\n I bent forward, wrapping around her.\\n\\n “That is the example I gave my child. I taught her to turn a blind eye to the fact people cheat and that the appearance of happiness was what was important. I never taught her that her self-worth was larger than a man.” She looked up at me, “I had none, so why would she think she deserved any?”\\n\\n Tears streamed down my cheeks, “Muriel, you are worth a million of him. She sees the loving person you are.”\\n\\n She shook her head, “I kicked him out. I need my children to see that no one deserves that kind of life and disrespect. I just wish I had chosen love. Back then, you just didn\u0027t choose love like that. It was frowned upon. And now I see it all, but I am too late. My kids will never understand real love because no one has showed it to them.”\\n\\n I nodded, “Of course they see it. I’m sure they do. I do.”\\n\\n She shook her head, “I am tired of this world. I am tired of being the Muriel everyone expects me to be. I am tired, Jacqueline. Do you know that feeling?”\\n\\n I nodded, “I do.”\\n\\n She looked down, “If I died today there is no one who would care, not truly. There is no one whose heart would be smashed and broken into a thousand pieces. I have no love, Jacqueline. No one loves me. Do people even matter if no one loves them? I feel like a tree falling in the forest and no one is around to hear it.”\\n\\n I hugged her tight, “I am here. I would be devastated. This will pass, trust me. He is a shit and not worth the pain you are feeling.”\\n\\n She laughed, “It isn’t just him. He was the icing on the cake. It is everything. Every minute of my life has been a lie.”\\n\\n She hugged me back and sobbed into me. I held her until she fell asleep. I left the room with her unconscious on the plush carpet and found the maid in the kitchen, “You can\u0027t leave her alone. I’m scared she might hurt herself.”\\n\\n She nodded, “I know, me too. She is distraught. Has been for days.”\\n\\n “I have to go home, but if you need me to come back here, I’m in her cell phone under Jacqueline Croix and Phil Bernard.\"\\n\\n She nodded, “I know Ms. Croix.”\\n\\n “Thank you.”\\n\\n “Have a good night.”\\n\\n I winced, “You too. I hope she’s okay.” I left with a sick feeling in my stomach and a hole in my heart.\\n\\n Monday\\n\\n The car door slipped from my fingers, slamming. I winced and looked up at the huge brick house, hoping Phil didn’t hear it. He hated it when I slammed the door.\\n\\n A smile slipped across my lips, thinking about the way his dark eyebrows would knit together and he would keep talking, even though the slam annoyed him. He refused to allow anything to stop him from talking. The disapproving look was funny, most of the time. But not when he gave it to strangers. Then it was him being uppity. It was unattractive on him.\\n\\n My eyes scanned the windows as I slipped the bags from the trunk. I needed to start bringing those green recycling bags in the trunk to make it look like I was bringing in groceries from the markets that didn’t deliver. Not that I ever went to them. I hoped he missed the large white letters saying CHANEL on the black bag, as I hurried across the courtyard and up the stairs. He deserved whatever therapy shopping I did.\\n\\n We had spent the entire night avoiding each other. He was adamant I was imagining things between him and Eleanor, and I was positive he had already done something to destroy the love I had worked hard to try to have for him. It wasn’t a strong love it was forced. Forced love couldn’t be saved if the marriage was tested. We would become roommates like our parents. I could sense us already on that road and our wedding was two weeks away. I had done my duties with the caterers and florists. The wedding planner had everything under control. My bridal shower was over with and the bachelor and bachelorette parties were completely planned. I deserved some real shopping. Shopping where I got something I desperately wanted. When I touched the dress, I knew—she was special. I called her CHANEL and adored every thread and seam. \\n\\n","sourceLink":"https://allnovel.net/the-long-way-home/page-4.html","bookId":1890,"book":{"id":1890,"title":"The Long Way Home","description":"Storyline: How lucky can one girl get? \\n Just ask Jacqueline Croix. \\n She has it all. \\n The right fiancé, money, looks, and connections. \\n But everything comes at a cost. \\n Sometimes that cost is looking the other way when the imperfections of your world start to show themselves. \\n When something happens she can\u0027t look away from, she ends up drunk in a Chanel dress at a pity party on the beach in SC. \\n There on the beach, she finally sees the cost of having everything is too high. \\n Luckily, Jacqueline has one thing most girls like her do not, somewhere to run when she leaves it all behind. \\n That somewhere happens to be to the open arms of the New York Rangers\u0027 right wing, Mike France. \\n He has always been there through thick and thin, waiting for his chance to make her his. \\n But how do you go from being best friends to lovers, when you know all the dirty details?\\n","cover":"https://allnovel.net/images/the-long-way-home.jpg","author":"Tara Brown","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-long-way-home.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 5:02:35 PM"}}
