{"id":107254,"no":21,"title":"Page 21","content":"Grace gazed at the spot on her cast where the new plaster covered the precious ring. “This? It hurt for a while, but now it feels fine.”\\n\\n Beatrice was beside herself. “That’s not what I asked! How dare you run off on us in the middle of a war? Who do you think you are?”\\n\\n Grace took a deep breath. The past two days had been the most difficult of her life, and she knew that there were many others ahead. She felt the weight of her wonderful and terrible family settling on her slim shoulders, and the answer to her sister’s angry question suddenly became obvious.\\n\\n “I know exactly who I am. I’m Grace Cahill.”\\n\\n AMY and DAN CAHILL PRESENT\\n\\n Jude Watson\\n\\n Windchill stuck at zero.\\n\\n Check.\\n\\n Piles of dirty snow on sidewalks.\\n\\n Check.\\n\\n Math test tomorrow.\\n\\n Check.\\n\\n Complete lack of preparation for test.\\n\\n Check.\\n\\n Social Studies Boredom Level: Ten.\\n\\n (Sigh). Check.\\n\\n Dan Cahill’s Existence: Situation Normal!\\n\\n Dan tried to focus. Ms. Zapata’s mouth was moving, but the words were a blur of sound. Occasionally, something poked through, like Etruscans. Once, bloody battle got his attention until he lapsed back into boredom again.\\n\\n He’d been trapped in social studies for about a hundred hours. Okay, forty-two minutes and thirteen seconds. It was the last class of the day, and it was so fascinating he could hardly stay asleep. He stared out the window at the slate-gray February sky and tried not to yawn.\\n\\n Back in September, in the middle of the Clue hunt, if he’d thought about being in social studies class again? It would have seemed like heaven on a stick compared to getting chased, double-crossed, and almost killed by his relatives. When he and Amy had touched down at Logan Airport after their adventure, they’d both cheered. They couldn’t wait to get back to their lives. They couldn’t wait to be just like this: bored out of their minds.\\n\\n They’d just made one major miscalculation. They’d forgotten how boring being bored could be. Why hadn’t Dan remembered Ms. Zapata’s nickname? Everyone called her Ms. Zzzzz because she put her students to sleep.\\n\\n The funny thing was, Dan had actually experienced what Ms. Zapata was now droning about. He’d been to Egypt. He’d felt the heat and tasted the dust. He’d felt a thrill slipping down the dark Nile in a boat past the Valley of the Kings.\\n\\n Ms. Zapata made it sound like she was reading instructions on how to install a dishwasher.\\n\\n Just then a word floated out through the buzz saw of Zapata-speak: Nefertari. Dan tuned back in.\\n\\n “... the most beautiful tomb in Egypt,” Ms. Zapata was saying. “You probably know the queen because there’s a famous bust of her.”\\n\\n A photo flashed on-screen.\\n\\n Dan raised his hand. “That’s Nefertiti,” he said. “Different queen.”\\n\\n Ms. Zapata frowned. She looked at her notes. “You could be right, Dan. Uh … let’s move on.”\\n\\n Another slide flashed on-screen. “Now, this is the inner chamber of the tomb, where she was laid to rest.”\\n\\n Dan’s hand rose again. Ms. Zapata closed her eyes.\\n\\n “Actually? That’s the side chamber.”\\n\\n “Really.” Ms. Zapata’s lips pressed together. “And how do you know this, Dan?”\\n\\n “Because …” Dan hesitated. Because I was there. Because I was locked inside the tomb with an ex-KGB spy, so I got to know it pretty well.\\n\\n “Especially since the tomb is closed for conservation,” Ms. Zapata said.\\n\\n Yeah. But we had this connection to an Egyptologist? Except he turned out to be a thief and a liar, so we captured him. I came this close to smashing him with a lamp….\\n\\n Everyone was looking at him. Dan didn’t know what to say, and that never used to happen. He’d been back at school for four months, and the story for their five-week disappearance was that he and Amy had to take care of family matters after their grandmother’s funeral. Nobody was supposed to know that they’d been chasing Clues all over the world. Nobody was supposed to know that he’d been locked in a tomb. Or been shot at, buried alive, and almost blown up.\\n\\n “I guess I saw it somewhere,” he mumbled.\\n\\n Ms. Zapata tried not to look pleased. “Let’s try and remember not to make claims that aren’t true, shall we?” She let the moment hang there as everyone twisted in their seats to look at Dan. He knew they were waiting for him to be Dan The Man, to snap back a comment that would be funny but not disrespectful enough to get him in huge trouble.\\n\\n “Sure,” he said.\\n\\n Triumphantly, Ms. Zapata turned back to her notes. His classmates swiveled around again, disappointed that Dan hadn’t caused Ms. Zapata to turn that awesome magenta color she did when she was aggravated.\\n\\n Four months ago, he and Amy had thought it would be easy just to go back to their old lives. But it hadn’t been easy. Dan knew that he’d changed. He didn’t know how, exactly — he just knew he was different. It wasn’t a kick anymore to contradict his teachers or make the whole class laugh.\\n\\n Maybe it was the lack of sleep. Sometimes his nightmares scared him so bad he had to sleep with the lights on. He couldn’t seem to connect with his old friends. He couldn’t seem to care about the cool things he did before, like comic books and video games and the chances of the Red Sox taking the Series next season.\\n\\n He’d become a loner. Which meant, in the world of middle school, he was tipping on the scale straight down toward Loser.\\n\\n When the bell rang, he popped up quickly and scurried out the door. He made for the exit and didn’t breathe freely until he hit the cold February air.\\n\\n Amy’s school was four blocks away, and they always met halfway, in front of a coffee bar. After school, if it was a good day, there would be a cinnamon roll left at the coffee bar. There was a loading zone in front so that Fiske or Nellie could park the car temporarily and wait if they had to.\\n\\n It was a Wednesday, so it would be Fiske today. Nellie, their other guardian, had an afternoon class at Boston University. They usually heard Fiske before they saw him because of all the horns blowing as he cut across traffic. Fiske must have gone to the NASCAR School of Driving. He said that Boston traffic was a challenge and he was its master.\\n\\n Amy was always worried that he’d get a ticket. That was his sister. If she didn’t worry about stuff that didn’t matter, he’d have to check her pulse.\\n\\n When they got back to Boston, he and Amy wanted everything the same, including moving back into their apartment. But now that Fiske and Nellie were their legal guardians, it wasn’t too long — barely a couple of weeks — before they all realized it wasn’t going to work. The apartment was just too small.\\n\\n Fiske had the perfect solution. They moved out to Attleboro, to the guest house on their grandmother Grace’s property. Fiske devoted himself to the plans for rebuilding Grace’s mansion, which a fire had almost completely destroyed. But the guest house was perfect, with a big country kitchen and room enough for all of them. Dan had a bedroom overlooking a field and an oak tree. Amy had a room with a canopy bed. Saladin had a window seat overlooking the garden. It had been easy to settle in.\\n\\n Especially since they were now massively rich. In addition to the two million they’d received for finding their ancestor Gideon’s serum, it turned out that Grace had left the rest of her estate to them in trust. Which basically meant that they were something close to bazillionaires. It was a weird feeling. He and Amy could probably get driven to their old schools in a limousine every day, but they knew they weren’t limousine people.\\n\\n They had no idea how to be rich.\\n\\n “Snack time,” Dan said as he approached his sister. “Fiske isn’t even in sight. He’s probably going a hundred in a fifty-miles-per-hour zone as we speak.”\\n\\n Amy peered down the street. “He could be here any minute.”\\n\\n “C’mon, Amy, cinnamon rolls are calling us.” Dan put a hand near his ear. “Do you hear? ‘Amy? Dan?’” he squeaked. “‘Come and get my sugary, sticky goodness!’”\\n\\n Just then he noticed that Amy had that look, as though she wanted the street to buckle and split so she could fall right in. Dan saw the cool crowd from her school hanging at a table in the front. So that was why she didn’t want to go in. Evan Tolliver was at the head of the table. Dan sighed. Evan, the human computer, was Amy’s dream crush. Whenever Evan was near, she got her stutter back.\\n\\n “Oh, excuse me, I didn’t notice Luke Skywalker,” Dan said. “Or is it Darth Vader?”\\n\\n “Shhh,” Amy said. Her cheeks were red. “He’s coming.”\\n\\n “You mean Evan Tolliver himself is about to set his foot on the sidewalk? Did you bring the rose petals?”\\n\\n “Cut it out, dweeb!” Amy said fiercely.\\n\\n “Hi, Amy,” Evan said from behind her.\\n\\n Amy’s color went from summer rose to summer tomato. She shot Dan a look that told him he was in serious trouble.\\n\\n “Hey, Evan,” he said. “I’m Amy’s little brother, Dweeb. Great to meet you, man.”\\n\\n Amy turned so that she was blocking Dan from Evan. “H-hi, Evan.”\\n\\n “Wow, I’m glad I saw you. Did you pick a topic for your English paper yet?” Evan asked. “I’m sorta freaked about it.”\\n\\n “Really? I’ve got a couple of ideas, but …”\\n\\n Dan decided it was a terrific time to hit the mute button that sat ever ready in his head whenever Amy started to talk about school.\\n\\n Just then he heard a honk and looked over at the line of cars waiting to turn the corner. A motorcycle was weaving through traffic, trying to cut over to the right lane. As Fiske accelerated and made the turn, the motorcycle cut off a delivery truck to follow him. When Fiske pulled over to the curb, the motorcycle pulled in behind him and its rider got off the bike.\\n\\n The rider was one Big, Scary Harley Dude. He wore leather leggings, a leather jacket, leather boots, and there were probably leather eyes behind his small, round sunglasses.\\n\\n “Uh, Amy?” Dan said, still looking at Scary Harley Dude, who was slowly taking off his helmet. He had a mass of black curls, but that didn’t lessen his epic badnews vibe. Not one bit.\\n\\n The Dude took his time strolling toward Fiske. Just to prolong the agony, Dan guessed. Fiske hadn’t seen him yet.\\n\\n He leaned over the passenger seat and waved at Dan. Dan gestured wildly at Scary Harley Dude. The guy had been tailing Fiske, no question. Misunderstanding the gesture, Fiske shook his head and pointed to his watch.\\n\\n Meanwhile, Amy was still trying to get out a sentence. “... was thinking that m-maybe …”\\n\\n “AMY!”\\n\\n The guy was almost at the open driver’s side window. Dan jerked his head toward him and widened his eyes at Amy. They’d been through enough almostkidnappings, attacks with lethal intent, and encounters with the crazy to have a pretty good instinct about things.\\n\\n Amy squinted as Scary Harley Dude reached for something at his belt and leaned in toward Fiske. Fiske turned and finally saw him, and they saw fear on his face…. \\n\\n","sourceLink":"https://allnovel.net/vespers-rising-the-39-clues-11/page-21.html","bookId":1547,"book":{"id":1547,"title":"Vespers Rising ( The 39 Clues #11)","description":"Storyline: Vespers Rising (The 39 Clues #11) \\n The Cahills aren\u0027t the only family searching for the Clues. . . . \\n The Cahills thought they were the most powerful family the world had ever known. They thought they were the only ones who knew about Gideon Cahill and his Clues. The Cahills were wrong. \\n Powerful enemies --the Vespers-- have been waiting in the shadows. Now it\u0027s their time to rise and the world will never be the same. In Vespers Rising, a brand new 39 Clues novel, bestselling authors Rick Riordan, Peter Lerangis, Gordon Korman and Jude Watson take on the hidden history of the Cahills and the Vespers, and the last, terrible legacy Grace Cahill leaves for Amy and Dan.\\n","cover":"https://allnovel.net/images/vespers-rising-the-39-clues-11.jpg","author":"Rick Riordan","type":"Adventure","source":"allnovel","link":"https://allnovel.net/vespers-rising-the-39-clues-11.html","creation":"Oct 5, 2019 8:57:41 AM","modification":"Oct 5, 2019 11:04:28 PM"}}
