{"id":25619,"no":23,"title":"CHAPTER XXIII. WHAT THE CAPTAIN’S CHEST HELD","content":"“You may lower down that signal, Haywood,” said Hawkson, after I had watched the long skipper disappear in the darkness. \\n\\n \\n\\n Glancing aloft, it was too dark to see what signal he meant, so I hesitated, knowing all our bunting was generally hauled down at sunset. \\n\\n \\n\\n “That pennant flying from the gaff,” said Hawkson, noting my slowness. “That’s been flying all afternoon for Mr. Gull on the Desertas. Signal agreed on to call him in. We’re bound out to-morrow, but didn’t have to tell the whole island about it.” \\n\\n \\n\\n I went to the spanker-boom and sought the signal halyard. Then I hauled down the pennant, which I remembered noting during the day, but gave no particular thought. Rolling it up, I started forward to turn in when Hawkson stopped me. \\n\\n \\n\\n “I wish you would keep a lookout aft there,” said he, “I’m going below and turn in a bit, and 199I want to be called when the old man comes aboard. Get your supper from Heligoland, and then lay aft until the gig comes alongside.” \\n\\n \\n\\n On reaching the forecastle, I noticed Heligoland eye me sharply, then he brought forth a piece of paper folded squarely and sealed on the corners in very fine style. \\n\\n \\n\\n I wondered at this, for I had not received a note from any one for a long time. Looking askance at the Norwegian, I slowly tore it open, and spread it forth under the forecastle lamp. At first I could make little out of it, for it was a scrawl and somewhat blotted. Then I finally made out the name Richards at the bottom of it, and started in to read it afresh. \\n\\n \\n\\n “My dear friend Heywood,” it went, “when you get this note, I will be off the ship. There won’t be any use looking for me until I choose to turn up, but you will see me again before long. I wanted you to go with me, but it couldn’t be fixed. If you take care not to get killed, maybe I can help you live a bit longer. \\n\\n Peter Richards.” \\n\\n \\n\\n The letter was somewhat ambiguous, but Richards was something of a scholar, having been a mate and an officer on a man-of-war, so I thought that it was perhaps simply a way he had of saying good-bye. 200I knew he intended to jump the ship, and supposed, of course, he would not think of such a thing without taking me in his confidence. Here he had gone, and he made no excuse, save that it could not be fixed. I swore at him for fully a minute, and then Heligoland asked what it was. As he could not read any language, let alone English, it was safe to tell him the first thing that happened not to bear in any way upon the case. He seemed satisfied. \\n\\n \\n\\n At eight bells I had eaten a bad meal cooked by the Norwegian sailor left in charge, and betook myself aft to the quarter-deck. The night was quite dark, and the lights on the shore twinkled brightly, sending their reflection streaming seaward over the oily swell that rolled in gently upon the sand. There was little wind, barely enough to feel, and I lounged over the taffrail until I found myself dozing. \\n\\n \\n\\n It was close to two bells when I was roused by a peculiar sound in the lazarette beneath me. There was a noise as of some one sawing gently, and this was followed by a scraping like that caused by dragging something heavy across the deck. \\n\\n \\n\\n While I rested half upon the rail, with my eyes fixed upon the lazarette hatch, I became aware of the sound of voices in the water astern, coming from seaward. Soon I distinguished the gentle 201rippling of water from a boat’s stem, and heard Mr. Gull’s voice tell his men to take in their sail. \\n\\n \\n\\n “Don’t seem to be any one on deck,” he growled, surlily, as the boat came under the counter directly beneath me. \\n\\n \\n\\n “Give me your painter,” I said, quietly, reaching over for it, and then, as it was tossed up, taking it forward to the mizzen lanyards, where I proceeded to make it fast. \\n\\n \\n\\n While doing this, I became aware of two men standing on the taffrail, carrying a heavy chest, which they were balancing upon the rail while bending on a line to it. At first I thought they were from the boat alongside, but instantly remembered the height of our quarter above the rail of the small boat, and knew no one could have climbed up so quickly. \\n\\n \\n\\n “Stand from under,” growled one, whose voice sounded very like that of the red-headed villain Martin had taken into his drunken confidence aboard the brig. Then the chest disappeared over the rail, and the other man quickly caught a turn with the line about a belaying-pin, to ease it off. I was now close beside them, and had no difficulty in recognizing the silent one as the Guinea we had met in the brig that morning. \\n\\n \\n\\n “Over with you!” growled the fellow who had first spoken. “Don’t be all night about letting that 202go,” and, suiting his action to his words, he sprang upon the rail and dropped over. \\n\\n \\n\\n “What the blazes is this?” roared Mr. Gull from below, as the chest landed in his boat. \\n\\n \\n\\n The fellow saw me as he slipped over the rail, and flung his knife at my face, the blade just grazing my cheek. Before I could recover myself, both the men had cleared the side and had dropped below. I rushed to the rail and peered over. Below there were fierce oaths and the sound of a desperate struggle, and in an instant several voices roared out for the watch on deck. Mr. Gull could be heard and dimly seen cursing and grappling with a man who strove to get over the boat’s stern into the water, while a black mass of men struggled in the boat’s bottom, yelling and cursing wildly in a strenuous combat. \\n\\n \\n\\n The sudden uproar aroused Hawkson, who came bounding up the companion, with a cutlass in one hand and pistol in the other. \\n\\n \\n\\n “What’s the row?” he bawled, making to the side. \\n\\n \\n\\n “You may search me,” I answered. “Looks like a lot of lunatics below there.” \\n\\n \\n\\n “Shore grog, I reckon. I’ll string that Martin up for this, an’ give Jones a dozen--Break away there, you blackguards, an’ come aboard, or I’ll fire into ye,” he bellowed, levelling his pistol. \\n\\n \\n\\n 203“Hold on!” I cried. “It’s Mr. Gull and his men.” \\n\\n \\n\\n “Mr.--what?” he asked, peering over. “Sink me, if it ain’t! What’s the matter below there? D’ye want any help?” \\n\\n \\n\\n At that moment a shadow shot out of the gloom, and we saw a boat swing quickly alongside of the one already fast to us. \\n\\n \\n\\n “Now, then, cut loose there,” drawled the voice of the long skipper, and instantly the blackness was streaked with flashes, as the weapons rang out. \\n\\n \\n\\n Then some of our men began clambering aboard by the painter in the mizzen, while Hawkson roared and fired his pistol at the new boat. \\n\\n \\n\\n Bawling for men to follow, we slid down the lines still trailing over the stern, but, before we could reach the boat beneath, it was pulled from under us, and then we were left hanging over the black water. By the time Hawkson and I climbed back on deck, the scuffle below had ceased, and the long skipper was bawling out a hoarse farewell from the darkness seaward, and being answered by Mr. Gull from his boat in fitting terms. \\n\\n \\n\\n When lanterns were brought out, it was seen that several of our men were seriously hurt, and lay upon the pile of provisions in the boat. The chest had disappeared, and was evidently in the possession of the skipper of the Yankee brig. At this, 204Hawkson plunged below, and came up a few minutes later with the news that the barque’s treasure-chest was missing, and that she must consequently be made ready for sea at once. \\n\\n \\n\\n The affair was now perfectly plain. Our men were nearly all ashore, and it was impossible to get them before morning. The long skipper had put a couple of men in the chest, sent them aboard, and they had worked the treasure-chest on deck, mistaking Mr. Gull’s boat for their own, which they had evidently arranged to have on hand at the appointed time. But for the last part of the game, everything would have gone quietly. The empty slop-chest, with its large lock, was the only evidence, besides some wounded men, to show that we had been boarded and robbed in the most approved pirate fashion. \\n\\n \\n\\n We stood about, gazing at the empty chest with its lock, which was put on to guard against inquisitive persons opening it before the men within desired to come out. Forgetting entirely that we were within the sacred precincts of the captain’s cabin, Hawkson stood gazing at the affair lying open before him, swearing at the tricky skipper who had so easily hoodwinked him, and apparently lost as to the best method of regaining the chest. \\n\\n \\n\\n Suddenly the sound of voices came down the companion, and the noise of a boat bumping alongside. 205He sprang to the poop, cutlass in hand, ready-to repel boarders, and the rest followed in his wake, all armed now and in a temper for business. \\n\\n \\n\\n We arrived just in time to meet Captain Howard and Hicks, who climbed up the ladder to starboard, and were on their way aft followed by Watkins, the steward. \\n\\n \\n\\n Mr. Gull had already started to explain matters, and tell how he had been overpowered, but our formidable appearance caused the old fellow to draw his cutlass and stand on guard. \\n\\n \\n\\n “What’s this mean? D’ye dare mutiny?” he roared, and it was some moments before Hawkson could explain that mutiny was our last thought, but that our principal desire was to meet the long trader and his crew. I was afraid I would suffer from suspicion in the affair, but Mr. Gull told how he sent me forward with his painter to make it fast in the mizzen, and nothing was said to me about the matter. \\n\\n \\n\\n “Allen carried most of the specie ashore the day after we came in,” I heard Hicks say to Mr. Gull. “There was nothing of any value in that chest, but, as it’ll be dead calm all night, we’ll have a try at him to-morrow if he’s in sight. He won’t get far, and, if we only had all hands here, we could board him where he lays.” \\n\\n \\n\\n Howard, after seeing that everything was all 206right aboard, and that Mr. Gull had brought a ton or more of goat meat, went below, while we rove a tackle and unloaded the stuff on deck, the men hurt in the fracas being allowed to turn in. \\n\\n \\n\\n It was nearly midnight before the rest of us went into the forecastle, which now somewhat resembled a hospital, and I stretched out in my pew, wondering what would become of Mr. Curtis and Miss Allen if the barque sailed in the morning with our trader aboard. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1923/55284.html","bookId":884,"book":{"id":884,"title":"The Black Barque","description":"简介： When I struck the beach in Havre, the war with England had turned adrift upon that ports dock heads a strange assortment of men. Many had served in either the American or English navy, and many more had manned French privateers and had fought under N...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1923","creation":"Aug 1, 2019 12:23:47 AM","modification":"Aug 1, 2019 12:23:47 AM"}}
