{"id":71049,"no":12,"title":"Page 12","content":"Lie. “You’ve got a serious case of bedhead.” “You oughta talk. Your hair looks like you stuck your hand in a bug zapper,” he shot back. She reached for the ponytail holder on the nightstand and began to twist her unruly hair into a messy bun. “Better?” But Chase’s eyes weren’t on her makeshift hairdo. His gaze was firmly glued to her breasts shifting beneath the tight tank top. He swallowed hard. But he didn’t look away. Aha. So the cowboy was a breast man. She’d live in cleavage-enhancing shirts if it’d make him rethink his “just friends” mindset. “Maybe we oughta get dressed,” Chase suggested, staring at her nipples. “In long sleeves. It appears to be cold in here.” Damn smartass man. “Good idea,” Kane said. “We’ll be in the kitchen.” She’d forgotten Ginger and Kane were in the room. Chase set his feet on the floor and scooped up his clothes. He muttered, “I don’t remember getting undressed.” “Me either.” He squinted at her over his shoulder. “I take less time in the bathroom so I’ll go first.” “Fine.” Soon as she heard the bathroom door close, she jumped up. Ooh. Too fast. Made her woozy. She slipped on a pair of Capri-style yoga pants and her Santa Clara community college sweatshirt. As she passed the bathroom, she paused. Her mouth tasted like ass. The shower was running and Chase probably wouldn’t notice if she just popped in and grabbed her toothbrush and toothpaste. Ava turned the door handle. Unlocked. She slowly pushed the door open and came face-to-face with a completely nude Chase. Her eyes followed the dark line of hair—his treasure trail—stopping when she hit the mother lode. Wow. Chase was aroused. And well hung. Very well hung. “Jesus, Hollywood. Do you not understand privacy at all?” Rather than reminding him the door had a lock, she said, “I need my toothbrush.” He stomped closer, which caused his dick to jump against his belly. “Get out.” “God, Chase, relax. It’s just a penis. And here’s a newsflash for you. I’ve seen other penises, so it’s no big deal.” Such a liar, Ava. “It’s a big deal to me,” he snarled. “Get the fuck out of the bathroom and wait your turn.” “Let me grab my toothbrush and toothpaste and I’ll go.” “Get your eyes off my junk and you’ll see that I have your toothbrush and toothpaste in my hand.” Oh shit. She raised her gaze only high enough to see, yes indeed, Chase was holding her oral hygiene supplies. She snatched them from him and exited the bathroom. The door slammed behind her. She heard the lock click and some pretty choice swear words. She stopped outside the kitchen upon seeing Kane and Ginger in a private moment. His lower back rested against the counter with the front of Ginger’s body pressed to his. He had one hand fisted in her hair as he kissed the side of her neck and he’d jammed his other hand in the back pocket of her jeans. Everything about the way they were entwined together screamed love, not just lovers. Despite Ava’s joy that Ginger found a man who loved her so completely, Ava felt a smidgen of jealousy. Would she ever find that total love and acceptance for herself? She cleared her throat and the couple parted. Kane grinned unrepentantly. “I tend to get carried away when I have alone time with my beautiful wife.” “I imagine,” she said distractedly, staring at the section of skin where Ginger’s blouse had slipped down. “Since when do you have a tattoo?” Ginger’s fingers brushed her left shoulder. “I got it after the twins were born.” “What is it?” “The McKay brand.” Ginger rolled her eyes. “Oh, don’t look so appalled. It’s not a symbol of ownership. It’s become a tradition for the women who marry into the McKay family.” “Who started the tradition?” “Keely. When she was the only McKay girl. After she married Jack Donohue, she insisted that he, like the other spouses who married into the family, should be tattooed with the McKay brand. Jack refused—not surprising if you knew Jack—and insisted Keely tattoo his initials on her body, since she was no longer a McKay.” “How’d that work out?” “Keely had India put Jack’s initials below the pair of lips tattooed on her butt.” Kane shook his head. “And Jack thought once they were married she’d become docile. That girl is about as tame as a mountain lion.” Ava grinned. “I knew I liked her. Now if you’ll step aside, I need to use the sink.” Kane squinted at her. “What?” “It’s weird. Watchin’ you on TV you always look so much smaller. I forget how tall you are in person.” “I look short on Miller’s Ridge because my costar, Alex Summers, is six foot six. He’s the first man who makes me look petite.” But he’s not the first guy who made me feel small. Dammit. No negativity today. After she washed her face and brushed her teeth, Ava started a pot of coffee. A jolt of caffeine would lessen the pounding in her head. She stared out the window, lost in thought, and only roused herself when she heard Chase join Kane and Ginger’s conversation about other McKay family members. Ginger sidled up next to her. “Sorry about the Chase mix- up.” “It’s okay. I didn’t give you a choice. And I really do appreciate you guys letting me crash here.” “Have you figured anything out?” She gave Ginger a wry look. “Besides that I’m never drinking Maker’s Mark again?” “Smartass.” “Actually, I’m shooting things that interest me with my video camera. Don’t know what I’ll do with any of it, but that’s the whole point. Trying to figure some of this out. Who I am when I’m not in Hollywood. What I want to do when I go back, right?” “Right. I hope you’re not factoring Chase into your plans for the time you’re here.” Ginger dropped her voice. “Chase is a great guy for the most part. A little too self-involved to the McKays’ liking. But they’re all so damn proud of him they’ll forgive his neglectful behavior. That said, Ava, do not get mixed-up with him. Woman trouble follows him everywhere and you don’t need that after what you’ve dealt with lately.” “Is Kane giving Chase the same advice? Don\u0027t get mixed up with Ava because man trouble follows her everywhere?” “Shit, Ava, I didn’t mean—” “No need to worry because nothing is going on between us. I swear. We’re just friends. We had a blast hanging out yesterday. And to be honest, Chase understands better than anyone what I’ve gone through with the press since he’s gone through the same thing.” Ginger seemed surprised by Ava’s observation. “I hadn’t thought of it that way.” “That’s because you still see me as the clueless seventeen-year-old girl who stumbled into your law office by mistake.” “That’s where you’re wrong.” Ginger bumped Ava with her hip. “While you’re contemplating life and your place in it…do something about that chip on your shoulder, eh?” Ava laughed. But it felt forced, not that Ginger noticed. “So, tell me all about the McKay brood.” Kane and Ginger were enamored with their offspring but clearly exhausted. Maddie’s temper was a testament to her red hair. Hayden had christened the corkscrew tufts on Maddie’s head her “mean curls” and lamented the fact Paul was a climber and constantly pulled the chess board to the floor. Since Ginger’s father lived with them, he was a big help to keeping some semblance of order in the house. But the way they described it, it sounded more like a zoo. “Oh, before I forget, Ava, did you leave your car parked out front yesterday?” Ava looked at Kane. “Only for about five minutes. Why?” “Chase’s brother Ben passed by and wondered if someone was staying here. He called this morning, so I had to tell him you were in town, but to keep it quiet.” Kane looked at Chase when he opened his mouth. “I told them about Ava to cover your ass, cuz, so no complaints from you. But I suggest you keep your truck outta sight.” Kane stood and held his hand out to Ginger. “Come on, Red. I need your help checkin’ that gate before we head home.” Ginger looked confused. “What gate?” “You know, the gate we talked about on the way over here?” “Oh. Oh! That gate.” She blushed. “Ah, sure. I’d be happy to help.” Ginger paused at the door. “If you need anything, call.” “Will do.” As soon as the door shut, Chase snickered. “Fixin’ a gate, my ass. Kane is fixin’ to have his way with his wife in his pickup.” “Is ‘gate’ some kind of country euphemism for sex?” “Nope. But I believe our bein’ in their love nest has forced them to get creative for their marital activities.” She really had no response for that. “Ever done it in a pickup, Hollywood?” “No.” Don’t ask. “Have you?” Chase’s I-can-rock-your-world grin turned her knees weak. “I was born and raised in Wyoming. Never had any vehicle that wasn’t a truck…so what do you think?” “I think imagining you and me fogging up the windows and rocking the wheels until the suspension squeaks isn’t helping get sex off my brain.” Ava set her coffee cup on the table. “My turn in the bathroom.” He yelled, “Don’t forget to lock the door.” Doubtful he saw her flip him off. Later that evening, they were playing a rousing game of Go Fish when headlights swept the kitchen window. “Were you expecting someone?” Chase said.","sourceLink":"https://allnovel.net/chasin-eight-rough-riders-11/page-12.html","bookId":2692,"book":{"id":2692,"title":"Chasin\u0027 Eight (Rough Riders #11)","description":"Storyline: Chasin\u0027 Eight (Rough Riders #11) The chase is on… Rough Riders, Book 11 Bull rider Chase McKay has finally landed in a pile too big to charm his way out of. Caught with his pants down, he finds himself bucked right off the PBR tour until he can get his act together. Hollywood actress Ava Dumond became the tabloids’ favorite target when her longtime boyfriend was outed as gay. Now she wants a place to lay low and a chance to prove to herself that she can satisfy a red-blooded man between the sheets. The sexy, rugged cowboy she finds holed up in her Wyoming hideaway seems like the answer to her every fantasy. But Chase has sworn off women. Forever. Or at least a month. Whichever comes first. When they take to the road to get Chase more hands-on bull riding experience, they have every intention of keeping their hands off each other. But the two headstrong stars quickly end up riding a hot and heady rodeo circuit all their own—until the press gets wind of their affair. When the dust clears and the lights of the paparazzi fade, are they ready to give up chasing the dream for a chance of finding forever?","cover":"https://allnovel.net/images/chasin-eight-rough-riders-11.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/chasin-eight-rough-riders-11.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:18:12 AM"}}
