{"id":71078,"no":41,"title":"Page 41","content":"\\n\\n “What? Why?” Recognition lit her eyes and a secretive smile appeared. “Really, Chase? Right now?”\\n\\n “Yep.”\\n\\n “But I’m all sweaty. Can’t I take a shower first?”\\n\\n He growled, “No. Seeing your hot, bendy body stretched out over that ball does it for me in a bad way.” Using a single rough-edged fingertip, he leisurely traced the waistband of her yoga pants, low on her hips. But not nearly low enough. “Take. Them. Off.”\\n\\n She stood and peeled the stretchy black fabric down her legs. She began to remove her bra, but he said, “Leave it. Same position you were just in. Arched over the ball, hands on the floor behind you, feet on the floor, legs spread.”\\n\\n With effortless grace, Ava returned her body to its previous pose.\\n\\n Goddamn she was beautiful like this. Not just her bared body, but also her willingness to cede control to him. His hands skated up the outside of her thighs, still trembling from her workout. Or were they trembling in anticipation? He palmed her hips and squeezed, stopping to stroke the sensitive sweep of flesh between her hipbones until goose flesh dotted her torso.\\n\\n “This is weird. I can feel you but I can’t see you.”\\n\\n Flattening his hands, Chase mapped her quads, his thumbs dragging along the inside of her thighs. He gripped her knees and lowered his head, placing his mouth on her.\\n\\n Ava sighed.\\n\\n Chase licked her slowly, savoring the salty tang of her sweat mixed with the musky sweetness of her pussy. That was the extent of his attention at first, his tongue created a repetitive path over the pink slit, from the wet entrance to her sex to the top of her mound. Each pass made her wetter, made that intimate flesh plumper, made her breathing more labored. Made him hotter. Harder.\\n\\n He fucking loved this. He could spend hours, right here, testing her stamina, his control, and seeing how many times he could make her come with just his mouth.\\n\\n His hands caressed her outer thighs up to where her leg became the curve of her ass. He loved this hidden, highly sensitive crease, loved that stroking it while lapping her pussy caused Ava to clench her ass cheeks and moan.\\n\\n And still he feasted on her sex. Nipping, suckling, easing back to blow on her wet skin. With the stiffened tip of his tongue, he rimmed her pussy, from her entrance to her clit and back down the other side.\\n\\n “Chase.”\\n\\n “Mmm?”\\n\\n “Blood is rushing to my head.”\\n\\n “That’s what I love to hear when I’m eating my fill of this sweet, hot cunt.” He shoved his tongue inside her until his teeth pressed into her flesh.\\n\\n “Oh God.”\\n\\n Chase slid his thumb into her pussy the same time he jammed his tongue in deep. Fucking her with both. Trying to keep her still after she’d begun bumping up her hips, which set the ball bouncing. But then she started thrashing too.\\n\\n “Ava, darlin’, hold still.”\\n\\n “I can’t. Please. I’m close.”\\n\\n Keeping his thumb pressed in her clenching channel, he used his index finger and other thumb to separate the skin concealing her clit. Once he’d exposed that swollen pearl, he flicked it with his tongue. No respite. No mercy. As soon as her abdomen and thighs went taut, he sucked directly on it.\\n\\n Ava detonated. A hoarse cry split the air. Her body vibrated as her orgasm rocked through her and the blood-engorged tissues pulsed against his mouth.\\n\\n Primal satisfaction roared inside him.\\n\\n When she shuddered, her wail reverberated through the plastic ball. He wanted to do it again. And again. Bathe in her juices as he swallowed climax after climax. He kept nuzzling her, caressing her, gorging his senses on everything—her taste, her scent, the feel of her body, the sound of her passion.\\n\\n Her hands stroking his scalp brought him back to earth.\\n\\n Whoa. He’d never lost himself like that before. He’d hit hazy white space of after orgasm bliss many times, but he’d never reached it by giving pleasure rather than receiving.\\n\\n Chase lifted his head, meeting her passion-glazed gaze, knowing his own eyes were closer to animal than man.\\n\\n Ava’s shaking fingers lovingly followed the shape of his face. From his scalp, over his forehead to the ridge of his eyebrows. Then down the slope of his nose and the jut of his cheekbones to the broad angle of his jaw.\\n\\n He stood, bringing her to her feet, teasing her succulent mouth with flirty kisses. After toeing off his running shoes, he shucked his athletic shorts. “Know another yoga pose that drives me out of my mind with lust?”\\n\\n “What?”\\n\\n “Downward dog.” He scraped his teeth along the cord in her neck, right by her racing pulse. “Maybe I oughta call it downward doggie style. Assume the position.” He released her and snatched a condom and the lube from the nightstand.\\n\\n When he turned around, condom on and slicked up, and saw Ava’s perfect ass in the air, he wanted to smack it. Bite it. Bury his cock in it.\\n\\n Moving in behind her, his greedy gaze pursued the long, strong line of her spine. Resting her body weight on her hands caused the muscles in her triceps and biceps to stand out. His finger forged the same path as his eyes, but slipped past the sexy dimples above her ass, past her tailbone. Down the cleft of her ass. The tip of his finger swirled over the tight rosebud. “Another time, I’m taking your ass like this. Clutching these sweet cheeks as I’m pounding into you. Think you could hold the position, Ava Rose? While I’m fucking your ass hard?”\\n\\n “Yes.” She arched, lifting her head.\\n\\n Chase reached his ultimate destination, the entrance to her pussy. Oh yeah, Ava was still wet. He widened his stance, rubbing his stiff shaft up the slit of her sex, once, twice, three times, before plunging his cock in to the hilt.\\n\\n He hissed at the immediate hot clasp of her vaginal walls and the suctioning pull as he retreated. Her innermost flesh stayed pliant as he rammed back in.\\n\\n Chase closed his eyes for a moment, enjoying every single sensation. Sweat dripping down his back. Ava’s taste still lingering on his tongue. His racing heart that sent blood sizzling through his veins. The feel of her firm butt cheeks beneath his fingertips. The cushiony mat beneath his feet. The sheer ecstasy at having this woman naked and willing any time he wanted. Any place. Any way.\\n\\n “Chase? You okay? You sorta stopped moving.”\\n\\n “Just taking a breather before this.” He surged into her. Slam. Withdraw. Slam. Withdraw. Slam.\\n\\n She emitted a sexy groan.\\n\\n He noticed Ava hadn’t lifted her head. “Tell me what it looks like from that angle,” he asked, not missing a single stroke.\\n\\n “Hot as hell. No wonder you love to take me from behind, if this is what it looks like.”\\n\\n “Oh yeah.” Chase picked up the pace, his hands slippery on her damp skin. “It’s a fucking turn on to bury my dick so far inside you it looks like we’re one person.”\\n\\n “Pretty poetic, McKay. God! Do that again.”\\n\\n “This?” He swiveled his hips when his cock was fully seated.\\n\\n “Yes! Dammit, I’m done.”\\n\\n She came again. Her body shaking, but she held position.\\n\\n Which sent him soaring into the abyss. Pulse after pulse of his cock emptying set his limbs to quaking. His eyes rolled back in his head and pleasure swamped him.\\n\\n When she groaned and said, “I’m getting a cramp,” he roused himself from that happy place and pulled out.\\n\\n She rolled up and gave him a contented look.\\n\\n He grinned back at her. “You know, Hollywood. This yoga stuff ain’t half bad.”\\n\\n Chapter Twenty\\n\\n If the first two weeks they were together had been about friendship, the last two weeks had been about sex.\\n\\n They still couldn’t get enough of each other. They’d spend all day traveling. Then they’d fall on each other the second they were alone. Usually in their motel room, since Chase wasn’t much on public displays of affection. But when that bedroom door closed? It was almost as if her body became an extension of his—their bodies were never apart for very long, whether in rest, in sleep or in passion.\\n\\n The passion between them…one for the record books. Ava had never been in such an explosive sexual relationship. She’d known Chase’s sexuality was an innate part of him, but she’d never understood it was such an innate part of her too.\\n\\n Yet, for as addictive as their lovemaking had become, the friendship part of their relationship hadn’t changed. They never ran out of things to talk about. Silly things. Serious things. She never had to guess Chase’s feelings on anything. He threw them out boldly and without apology. The silences between them weren’t awkward, demanding conversation.\\n\\n What she wouldn’t give for some silence right now. Total silence. She sighed.\\n\\n “That’s about the fifteenth time you’ve sighed in the last five minutes. What’s wrong now?”\\n\\n Rather than let it go again, she snapped, “Do you have to eat those stupid sunflower seeds every damn time we get in the truck?”\\n\\n Chase said, “Yup,” then spit the spent seeds into his discard cup.\\n\\n Rattle the bag. Fill his mouth with seeds. Crack the seeds. Spit out the empty shells. Repeat. Sometimes for six hundred miles.\\n\\n It drove Ava fucking insane.\\n\\n Sure, it was Chase’s truck. But if she had to listen to Mr. Chipmunk Cheeks enjoying his nuts for the next three hours, she might do something rash, and rude, and violent to his nuts.\\n\\n Needing a distraction, she flipped on the radio, scrolling through static until she found a station that played decent music. Her bare toes tapped in time to Lady GaGa’s “Poker Face” as she resituated herself and her laptop.\\n\\n Click. Off went the radio.\\n\\n Ava didn’t demand he turn it back on. She just reached over and did it herself.\\n\\n “Shut that shit off,” Mr. Chipmunk Cheeks said around a mouthful of seeds.\\n\\n “I’m listening to it.”\\n\\n “You wanna hear music, listen to your damn iPod.”\\n\\n “I told you my ear buds broke, but you couldn’t be bothered to stop so I could pick up a new pair. So deal with it.”\\n\\n He sighed with utter exasperation. “You can have the radio on if you find a country music station.” \\n\\n","sourceLink":"https://allnovel.net/chasin-eight-rough-riders-11/page-41.html","bookId":2692,"book":{"id":2692,"title":"Chasin\u0027 Eight (Rough Riders #11)","description":"Storyline: Chasin\u0027 Eight (Rough Riders #11) \\n The chase is on… \\n Rough Riders, Book 11 \\n Bull rider Chase McKay has finally landed in a pile too big to charm his way out of. Caught with his pants down, he finds himself bucked right off the PBR tour until he can get his act together. \\n Hollywood actress Ava Dumond became the tabloids’ favorite target when her longtime boyfriend was outed as gay. Now she wants a place to lay low and a chance to prove to herself that she can satisfy a red-blooded man between the sheets. The sexy, rugged cowboy she finds holed up in her Wyoming hideaway seems like the answer to her every fantasy. \\n But Chase has sworn off women. Forever. Or at least a month. Whichever comes first. \\n When they take to the road to get Chase more hands-on bull riding experience, they have every intention of keeping their hands off each other. But the two headstrong stars quickly end up riding a hot and heady rodeo circuit all their own—until the press gets wind of their affair. When the dust clears and the lights of the paparazzi fade, are they ready to give up chasing the dream for a chance of finding forever?\\n","cover":"https://allnovel.net/images/chasin-eight-rough-riders-11.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/chasin-eight-rough-riders-11.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:18:12 AM"}}
