{"id":71042,"no":5,"title":"Page 5","content":"\\n\\n Puff, puff. “How soon would you need to leave?”\\n\\n “First thing tomorrow. That’d give me time to figure out a way to slip the tabloid guys who are determined to be the first to report my suicide.”\\n\\n Her father chuckled. “People are idiots if they believe you’re still despondent over that cocksucker Jake.”\\n\\n “I’m hoping out of sight, out of mind will cure lingering curiosity.”\\n\\n “You really doing okay, Ava Rose?” he asked gruffly. “You’ve been awful damn scarce since this whole thing went down.”\\n\\n Switching her phone to her other ear, Ava rested her elbows on the railing. “The last thing I wanted was you guys getting swamped by my shit storm.”\\n\\n “Well, honey girl, that’s what family does—sticks together and flips the world the bird. I’ll remind you that your mother and I’ve been through a shit storm or two in the thirty years we’ve been married. We’re tougher than you give us credit.” Puff, puff. “Far as I know, your mom doesn’t need the plane tomorrow. So I’ll call and arrange it.”\\n\\n “Thanks, Dad.”\\n\\n “Keep in contact. You’re a big girl and all that, but we worry, okay?”\\n\\n Guilt swamped her. Her justification for shutting her family out was only partially true. They’d never understood her pursuit of a show business career, and when she failed so publicly in that career and her personal life, she felt like an embarrassment and a disappointment. “Okay. Love you.”\\n\\n “Love you too. Be safe, be well and—”\\n\\n “Give ’em hell,” she finished and hung up.\\n\\n “I love the Dumond family motto,” a dry, female voice intoned behind her.\\n\\n Ava turned toward Hannah, her friend/personal assistant/gal Friday. “Hey, Han. I didn’t know you were here.”\\n\\n “I gathered that. Now what’s this bullshit plan about you hiding out in some godforsaken Western state?”\\n\\n “Not like it’ll be permanent. Just seeing the sights.”\\n\\n “For how long?”\\n\\n “I don’t know.”\\n\\n “Who are you going with?”\\n\\n “No one. Just me.”\\n\\n Hannah lifted one eyebrow in her usual imperious manner. “Oh really? That’s surprising.”\\n\\n “Why?”\\n\\n “Because you never go anywhere by yourself, Ava. Never.”\\n\\n Ava bristled. “I do too go places by myself. I went to lunch by myself today.”\\n\\n “No, you met your agent for lunch.” She raised her hand, stopping Ava’s protest. “And please don’t think that driving four miles to lunch in your car counts as by yourself.”\\n\\n Shoot. Hannah knew her too well. “I went to Madrid by myself last year.”\\n\\n “You flew to Madrid by yourself last year, in your parents’ plane. As soon as your Manalos hit Spanish soil you had a translator, a stylist and a driver.” Hannah cocked her head. “Come to think of it, that is a small entourage for you.”\\n\\n “Fuck off,” Ava said crossly.\\n\\n Hannah laughed. “I make your schedule, so I know where you’ve been and where you’re going better than you do.”\\n\\n Maybe that was another part of the problem. Her decisions were all laid out for her. She hadn’t done things for herself…well, ever. In addition to Hannah, she employed a housekeeper, a groundskeeper, a personal trainer, a stylist, a publicist, a part-time chef, a financial planner, an agent…and the list went on. Made her head spin. She curled her hands into fists by her sides and said, “Stop.”\\n\\n “Stop?” Hannah asked, alarmed. “Stop what? Stop you from doing this?”\\n\\n “No. I need to stop. All of this. I need to stop being Ava Cooper. I need to know if Ava Dumond is capable of taking care of herself, because it’s obvious Ava Cooper can’t.”\\n\\n Hannah was dead silent. Then she smiled. “I know I should be worried about job security with your sudden identity crisis, but I’m not.”\\n\\n “Good. So you’re not going to try and talk me out of this?”\\n\\n “No. Besides, I know you’ll be back by the first week in August.” Hannah’s eyes narrowed. “You are scheduled to start filming the new Lynch movie in Mexico that week. And given that the contracts were signed before this shit went down with the movie studio and Jake, you absolutely cannot fuck that up, Ava.”\\n\\n “I know.”\\n\\n “Do you?” Hannah pressed. “You know there’s no warning when the casting director calls you in for a reading, so you’ll need to be someplace where you can hop a plane at a moment’s notice.”\\n\\n “Relax. I doubt I’ll be gone that long. I just need a break.” She watched the frown lines deepen on Hanna’s forehead. “Are you rethinking that job security comment?”\\n\\n “No. Since getting far away from here is your idea, I believe it’s something you need to do. I just want you to be careful.”\\n\\n Ava hugged her. “I will. Thank you. You are the best, Han.”\\n\\n “You’re welcome. Now will you at least let me help you pack and plan?”\\n\\n She shook her head. “I need to do it all on my own. Like regular people do.”\\n\\n “With the exception of flying commercial like regular people do,” Hannah inserted.\\n\\n “Extenuating circumstances.” Ava allowed a sheepish look. “Ah, can you tell me where I keep my suitcases?”\\n\\n “Under the bed in the guest bedroom. I’ll grab them.”\\n\\n As Ava flipped through her closet, she was torn. What to bring for clothes? Comfy. Casual. Weather appropriate. Did she own anything fitting that description?\\n\\n Hannah set the luggage on the floor by the closet door. Ava’s gaze strayed to the large duffel bag she’d never used. If she had to haul her belongings everywhere by herself, she’d need a manageable bag. She grabbed the gray duffel. “I’m taking this one.”\\n\\n “Ava. You can’t even get your shoes in that.”\\n\\n “Ava Cooper can’t get her shoes in that. Ava Dumond travels light.”\\n\\n “I need a glass of wine,” Hannah said wearily.\\n\\n “Help yourself.” As Hannah left the room, Ava yelled, “Oh, on your way back from the kitchen, will you grab the box of condoms from the main bathroom?”\\n\\n Hannah poked her head back in. “You don’t care about packing shoes, but you’re packing condoms?”\\n\\n “Yep. I’m gonna find me a hot man and offer him unlimited, anything-goes sex—no strings, no regrets, just lots of getting naked and getting loose.”\\n\\n “So you’re setting out to prove Ava Dumond is a sleazy ho-bag?”\\n\\n “If that’s what it takes to get my sexual confidence back where men are concerned? Then yes.”\\n\\n “Forget a glass of wine, I’m bringing back the whole damn bottle.”\\n\\n Ava laughed. Let her Wild West adventure begin.\\n\\n Chapter Three\\n\\n Chase could barely keep his eyes open. Disoriented, he slowed his truck to a crawl on the gravel road, braking at the cattle guard that denoted the turnoff to Kane’s place.\\n\\n He parked by the deck and stumbled out of his truck, taking a moment to stretch his legs and adjust the crick in his neck. But anticipation of falling face-first into a puffy mattress and sleeping a solid twelve hours put a spring in his step.\\n\\n Once he’d unearthed the key and unlocked the door, he slipped inside the dark trailer and caught a whiff of flowers. Probably from cleaning supplies.\\n\\n Too tired to shower, Chase stripped to his boxer-briefs in the living room and wandered to the kitchen sink to wash off the worst of the road grime. Rather than flipping on the lights, his fingers trailed along the hallway wall for guidance as he headed toward the back bedroom.\\n\\n The bedroom door was closed. With as hot as it’d been, the room would be stuffy, but he was too damn whipped to even open a window. He flopped on the mattress and stretched out, but his arm connected with something solid. And warm. And soft.\\n\\n And moving.\\n\\n Chase leapt out of bed the same time the high-pitched shrieking started.\\n\\n He fumbled with the light, blinking against the sudden brightness. He kept blinking because he didn’t trust what he was seeing. There was a nekkid woman in his bed. A nekkid, pissed-off woman who’d jumped up and struck a Jackie Chan martial arts pose.\\n\\n “Back off, perv! I have a black belt in taekwondo and I will fuck you up if you take another step toward me.”\\n\\n Chase raised his hands in surrender, trying really, really hard to keep his eyes on hers. “Whoa, there, crouching tiger. Let’s just take this down a notch.”\\n\\n “Bet you’d like that, fuckface.”\\n\\n Fuckface? Christ. Just his luck he’d come across another psychotic woman. “Maybe you oughta tell me why you broke in.”\\n\\n “I didn’t break in, you moron.”\\n\\n “Hey, enough with the name-callin’,” he snapped. “Maybe I oughta call the deputy and let him deal with your lyin’ ass.”\\n\\n “Hey, enough with the name-callin’,” she mimicked flawlessly. “Go ahead and make the call.”\\n\\n Dammit. He had no guarantee Cam was on duty tonight. And did he really want to try and explain…this?\\n\\n “Hah! Called your bluff, didn’t I?” she sneered.\\n\\n “Yeah, honey pie, you sure did. I’m just wondering if the rash of shit I’ll get from my cousin—who is the deputy I’d call—is worth the hassle at two o’clock in the fuckin’ mornin’.”\\n\\n She dropped her hands and studied him. “Wait a second. Your cousin is a local deputy?”\\n\\n “Yes.”\\n\\n “What’s his name?”\\n\\n “Cam McKay.”\\n\\n “Oh fuck me. You’re one of the two hundred McKay men Ginger always talks about.”\\n\\n That startled Chase. “You know Ginger?”\\n\\n “Who do you think invited me to stay here?”\\n\\n “Well, we have a problem because my cousin Kane said I could stay here.” As Chase tried to stay focused on her eyes, he realized something about this woman was very familiar. His gaze wandered. Drool-worthy tits. Tiny waist. Curvy hips. Long legs. \\n\\n","sourceLink":"https://allnovel.net/chasin-eight-rough-riders-11/page-5.html","bookId":2692,"book":{"id":2692,"title":"Chasin\u0027 Eight (Rough Riders #11)","description":"Storyline: Chasin\u0027 Eight (Rough Riders #11) \\n The chase is on… \\n Rough Riders, Book 11 \\n Bull rider Chase McKay has finally landed in a pile too big to charm his way out of. Caught with his pants down, he finds himself bucked right off the PBR tour until he can get his act together. \\n Hollywood actress Ava Dumond became the tabloids’ favorite target when her longtime boyfriend was outed as gay. Now she wants a place to lay low and a chance to prove to herself that she can satisfy a red-blooded man between the sheets. The sexy, rugged cowboy she finds holed up in her Wyoming hideaway seems like the answer to her every fantasy. \\n But Chase has sworn off women. Forever. Or at least a month. Whichever comes first. \\n When they take to the road to get Chase more hands-on bull riding experience, they have every intention of keeping their hands off each other. But the two headstrong stars quickly end up riding a hot and heady rodeo circuit all their own—until the press gets wind of their affair. When the dust clears and the lights of the paparazzi fade, are they ready to give up chasing the dream for a chance of finding forever?\\n","cover":"https://allnovel.net/images/chasin-eight-rough-riders-11.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/chasin-eight-rough-riders-11.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:18:12 AM"}}
