{"id":71098,"no":61,"title":"Page 61","content":"\n Quinn? Yes.\n Ben? Yes.\n His folks? Absolutely.\n And probably any other McKay relation he called.\n They were just that way. They might fight like cats and dogs, but when it came down to it, family was everything. And he would do everything to reclaim his place in his family.\n “Chase?”\n “I’m here. Just figuring the logistics. If I leave now, I can be there by noon tomorrow. Is that early enough?”\n “You’re really not gonna compete in the final round and you’re coming home?” Ben said with total shock.\n “Hard to believe, but yeah. I’ve realized there are more important things than those eight seconds I spend on the back of a bull. I ain’t gonna be the one who lets Mom and Dad down.”\n Ben was very quiet.\n “What?”\n “You have changed. I’m looking forward to seein’ you. Drive safe.”\n Immediately after Chase hung up he called Elroy.\n “You’d better not be calling me to bail you outta jail, McKay,” Elroy barked.\n “Good morning to you too, sunshine. I’ll keep this brief. I have a family emergency in Wyoming and I’m taking off right now.”\n “Wait. Hold on. You’re leaving Wichita? Chase. Did it escape your notice that you’re in first place?”\n “No, it didn’t, trust me. But it can’t be helped.”\n Elroy sighed. “You’re looking at your first event win in over a year. On your first tour stop after the suspension. How can you walk away from that?”\n “My family needs me.”\n “That puts us in a helluva bind, especially after the stuff you spewed on live camera tonight.”\n “Not my problem. I said my piece, I meant what I said and I won’t issue a retraction. If the PBR wants to add a disclaimer that I spoke on my own behalf, and not on behalf of the organization, that’s fine.”\n “You sure you’re not making a calculated move? Leaving abruptly to build the buzz? And adding to the speculation you’re involved with Ava Cooper since she wasn’t at the event with you?”\n Chase counted to twenty before he spoke. “That bullshit PR spin stuff is suited for your devious mind, Elroy, not mine. I’d rather get on a bull tomorrow afternoon, win the event and pick up a big, fat check than spend twelve hours in my truck driving home to deal with family issues. As far as Ava, she’s not a topic of discussion. Ever.”\n Elroy laughed. “The one time you’ve actually got a decent hook-up that could be worth great press for months to come, you’re telling me…no?”\n “I’m telling you fuck no.” Chase hung up. He stopped at the first convenience store and loaded up on Rockstar Energy drinks and sunflower seeds. When he saw the bag of red licorice he automatically threw it in the pile, like he always did, only realizing when he reached the truck his licorice-eating copilot wasn’t there.\n It’d be a long goddamn drive without her.\n No, it’ll be a long goddamn life without her.\n Chapter Thirty-One\n Chase pulled into Ben’s driveway at eleven a.m. Ace and Deuce greeted him with wagging tails, bumping into his knees expecting to be petted.\n Ben opened the door and the dogs beat him inside. “Coffee’s on.”\n “Good.” He adjusted his duffel. “Lemme shower and I might feel almost human.”\n He was down to one clean pair of jeans and one clean shirt. Maybe Ben would let him throw in a couple loads of laundry. The last time he’d washed clothes was with Ava,\n During the drive he’d rehearsed everything he wanted to say to her. And he’d say it to her face. In California, depending on what shook loose from this family meeting.\n Ben sat at the enormous bar, staring into a mug of coffee. Chase poured himself a cup and joined his brother.\n “So you honestly have no idea what’s goin’ on?”\n “No. But I’m thinkin’…wouldn’t it suck if Dad found out he has cancer right after he retired?”\n “Yeah. My thoughts ran along those same lines.”\n They drank their coffee in silence.\n “So you and Ava Cooper, huh?”\n “Seems impossible, don’t it?”\n “Not really. I knew you were done for when you listed all the great things about her and then swore you weren’t gonna drag her to bed the first chance you got.”\n Chase looked up. “Not banging her is an indicator of…?”\n “Come on, brother, say the word. Love. You’re in love with her.”\n “No lie.”\n “Does she know?”\n “I told her. But that was before I freaked out and said some stupid shit. Then she said stupid shit back and I left to rejoin the PBR.”\n “How long ago was this?”\n “What day’s today?”\n “Sunday.”\n “It all went to hell on Tuesday. Damn. Seems longer than that.”\n “Time to cool off is rarely a bad thing.”\n When Ben retreated, Chase looked around. That’s when he noticed two items on the far edge of the bar. A short-handled whip and a collar with a chain attached. What the fuck did Ben use those for? Did he even want to know?\n Hell yes he wanted to know.\n So when Ben returned, Chase said, “What’s up with the whip and collar?”\n “What?”\n Chase pointed. “Over there. Did you forget to put away your bondage toys when you finished with them?”\n Ben went very still.\n “Come on, Ben. I was joking.”\n He relaxed. “I know. Guess it’s a good thing I didn’t leave out the leather restraint straps and the caning set. That really would’ve made you look at me funny.”\n Chase stared at him because it didn’t seem Ben was joking. And how could he rattle off that type of S\u0026M stuff anyway?\n The dogs barked and Quinn stepped inside. “Hey. You guys ready?”\n “Ready as we’ll be, considering we’re goin’ in blind.”\n The drive to their parents’ house was filled with nervous chatter. They pulled up behind a Lexus with South Dakota plates.\n “I thought this was supposed to be a family only meeting?” Chase said.\n “It is. Let’s go.”\n Quinn led the way into the ranch house they’d grown up in. Their parents sat side by side at the dining room table, across from a guy who seemed familiar, but also ill at ease.\n “Hello, boys,” their mother said. “Have a seat. Would you like coffee?” When she began to get up, Dad curled his hand over hers. “It’s okay, Vi. They know where the coffeepot is.”\n Quinn offered the man his hand first. “Quinn McKay.”\n The man stood. “Gavin Daniels.” He shook hands as Ben and Chase introduced themselves.\n Dad cleared his throat. “I—we—appreciate you comin’. Didn’t mean to be so cryptic, but this ain’t something that can be said over the phone.”\n “Just be straight with us. Is he your doctor or something?” Ben asked. “He came here to help you break the bad news about whatever is wrong with one of you?”\n “No. There’s nothin’ wrong with either of us. We’re both in better health than we’ve been in a long while. This is about him.”\n Chase noticed his parents still held hands.\n “This is gonna come as a shock, so I’ll just say it straight out. Gavin is our son. Your brother. Not half brother, but full-blooded brother.”\n No one moved. No one seemed to breathe in the crushing silence.\n “Forget the goddamn coffee. Break out the whiskey,” Ben said.\n Almost as if their father had expected it, he pulled out a bottle of Jameson and six shot glasses. And holy fuck, he poured Mom a shot of Irish too. Then he kissed her cheek. “Vi, darlin’, go ahead. It’s more your story to tell than mine.”\n “You mean my secret to tell.” His mother, his sweet, practical, sometimes judgmental mother, tossed back the whiskey without batting an eyelash. “I won’t drag out the details. You boys never knew my father, God rest his soul, and I’m grateful. For being a man of God, Elmore Bennett wasn’t a nice man. He ruled his home with the Bible in one hand and a hickory switch in the other.\n “I fell in love with your father when I was fifteen years old. I had to see him on the sly because my father believed the McKays were no good. Long story short, I got knocked up at age sixteen. I was scared to death to tell my mother. But I did, and she immediately went to my father. He flew into a rage, called me every horrible name because a preacher’s daughter wasn’t supposed to get pregnant, especially by a McKay. He swore I’d be eternally damned if I tied myself and a child to that heathen family. To save face, his and mine, he told everyone he’d sent me to finish high school at a Christian academy in Colorado, when in truth, he shipped me off to an unwed mother’s home.\n “I’ll admit to being a brainwashed during my time there. I never considered keeping my baby. My pregnancy was a source of shame. Baby gone, shame gone.” She sent Gavin a pleading look. “Please understand times were different back then.”\n Gavin nodded and drained his shot.\n “I had a healthy boy. Then they whisked him away to his adoptive parents. I never knew the details of where he ended up. My folks never spoke of it and I didn’t tell a soul.”\n “Not even Dad?” Quinn asked.\n She shook her head. “When I came back to Wyoming, four years later, it was if Charlie and I hadn’t been apart. We still loved each other and we married right away. How could I tell him we had a three-year-old son? I’d made the choice to give the baby a better life; there was no going back. No tracking the boy down and taking him from his adoptive parents. I could never do that…” Her voice caught.\n Dad leaned over and murmured to her. It took a minute or so for her to regain control.\n Chase picked up his shot and his stomach protested when the whiskey hit. \n","sourceLink":"https://allnovel.net/chasin-eight-rough-riders-11/page-61.html","bookId":2692,"book":{"id":2692,"title":"Chasin\u0027 Eight (Rough Riders #11)","description":"Storyline: \n Chasin\u0027 Eight (Rough Riders #11) \n The chase is on… \n Rough Riders, Book 11 \n Bull rider Chase McKay has finally landed in a pile too big to charm his way out of. Caught with his pants down, he finds himself bucked right off the PBR tour until he can get his act together. \n Hollywood actress Ava Dumond became the tabloids’ favorite target when her longtime boyfriend was outed as gay. Now she wants a place to lay low and a chance to prove to herself that she can satisfy a red-blooded man between the sheets. The sexy, rugged cowboy she finds holed up in her Wyoming hideaway seems like the answer to her every fantasy. \n But Chase has sworn off women. Forever. Or at least a month. Whichever comes first. \n When they take to the road to get Chase more hands-on bull riding experience, they have every intention of keeping their hands off each other. But the two headstrong stars quickly end up riding a hot and heady rodeo circuit all their own—until the press gets wind of their affair. When the dust clears and the lights of the paparazzi fade, are they ready to give up chasing the dream for a chance of finding forever?\n \n","cover":"https://allnovel.net/images/chasin-eight-rough-riders-11.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/chasin-eight-rough-riders-11.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:18:12 AM"}}
