{"id":73497,"no":11,"title":"Page 11","content":"In and out Bride breathed, as quietly as possible. There was a window, but it was closed, blocking out the night\u0027s symphony of racing cars, pedestrians braving the streets, and criminals hiding in corners. The deeper she maneuvered through the apartment, the weaker Aleaha\u0027s scent of sky and pine became and the stronger Devyn\u0027s, like sun-dried sheets and rain. Damn it! Her grip tightened on her daggers. A halfway strong grip, too, now that she\u0027d eaten. Well, some. As before, she\u0027d kept down the first few sips but had thrown up the rest. Mind on the task at hand. You more than anyone know the price of inattention. That\u0027s how those policemen had caught her sneaking inside those mansions all those years ago. That\u0027s why she\u0027d had to hide Aleaha. Why she\u0027d lost Aleaha. Okay. So. Time to regroup. Aleaha had been here, but she hadn\u0027t stayed for long. Ten minutes, tops. Was little Devyn not as skilled a lover as he clearly liked to believe? Was he a slam-bam-thank-you type? Bet there was a piece of furniture here. A bed. Proof of his priorities. There was a fire in Bride\u0027s blood, burning her veins, scorching each of her organs. A fury that had nothing to do with the thought of Devyn sleeping with her friend and everything to do with her friend\u0027s future happiness. Really. Clearly Devyn was the kind of guy who left only heartbreak in his wake. That fury also poked and prodded at that molten, thorny place inside her, the place her powers were buried, the intense heat of its flames making her anger seem comprised of ice. She had to stifle a pained moan. She knew better than to let herself become too worked up. When she did, those flames spread and those thorns grew branches, each destroying her bit by bit. If she wasn\u0027t careful, she would soon be praying for death. I\u0027m calm. I\u0027m happy. After all, I found Devyn. She would finally get to gloat. Remaining smashed against the wall, Bride angled her body and peeked down the hall. Empty. Darkness. Silence. Devyn\u0027s scent—stronger than ever. There were two doorways. As she breathed deeply, her heart pounding erratically in her chest, she tiptoed forward. He was here. He had to be. She passed the first doorway, giving the bedroom only a cursory glance. Empty, as well. Finally she reached the farthest entrance and paused. The door was closed. Was Devyn inside? Sleeping, holding some little tramp in his arms? Waiting for her? She\u0027d warned him, told him she would- be coming for him, and he was obviously a warrior, used to strategy and battle. He was even working for AIR in some capacity. An agent, perhaps? He was daring enough. Nervousness joined the lingering thrums of fury. Lord, she\u0027d picked a hell of a target. One that could lock her away or kill her, no questions asked, she thought, a cold sweat beading over her skin. You knew the consequences. You came here anyway. Don\u0027t wuss out now. Answers are worth any risk. He had to be expecting her, had to know she\u0027d find him again. So how should she do this? Bust inside, knives at the ready? Sneak inside and try to catch him unaware? There was no time to reason it out. In the snap of fingers, her mind separated from her body, her limbs no longer hers to command. Of their own accord, her fingers released their grip on the blade hilts and the weapons thumped to the ground. One of her arms reached out and pressed the button that opened the door. Her feet moved one in front of the other, forcing her to enter the darkened space. He was awake, and he was controlling her. She\u0027d known this could happen, but had come anyway. Worth the risk, she reminded herself, gritting her teeth and trying with all her might to petrify her muscles and lock herself in place. If only she could fight past the thorns and the flames to see what other abilities were buried inside her, rather than waiting every few years for one to spring up on its own. She suspected the others were strong, stronger than Devyn\u0027s, desperate to explode, to overtake her. But she just couldn\u0027t get to them, even now, when they probably would have saved her. \"You certainly took your time,\" a familiar voice said huskily. Without a rustle of clothes or a single movement, the overhead light switched on, golden beams chasing away the shadows. \"Black becomes you, pet. It\u0027s like you\u0027re enveloped by storm clouds.\" And there he was. Sitting in a plush leather chair in the far corner, Devyn was relaxed, sipping a glass of amber liquid. His dark hair was mussed, as though he\u0027d run his hands through it a few times. His eyes, the exact color of his drink, glittered dangerously. Like her, he wore a black T-shirt and black pants. A large king-size bed was the only thing between them. A bed with black silk sheets and velvetcovered chains attached to the head and footboards. Her jaw clenched even as her nipples hardened, her mind momentarily lost in the naughty things that had probably happened in that bed. Oh, no you don\u0027t. She would not allow her body to ready. He\u0027d think her desire was for him. And it wasn\u0027t. Really. \"Where\u0027s Aleaha?\" Her voice trembled, mortifying her to her soul. \"I know you\u0027ve been with her.\" He finished off his drink. \"Please. Have a seat.\" With a tilt of his chin, he motioned to the bed. \"We have much to discuss.\" Rather than force her to obey, he released his hold on her. \"You\u0027re not going to compel me to do it?” “Now that would be rude, wouldn\u0027t it?\" Devyn, her freeze \u0027em and leave \u0027em guy, was concerned with being rude. Laughable. But she had something he wanted, so of course he would play the I\u0027m-your-friend card. Her eyes widened. That\u0027s right. She had Nolan. She was in control right now. No need for her powers, after all. Smiling smugly, she sauntered to the bed and plopped onto the edge, facing him. His gaze fell to her lips, and he inhaled sharply. Was he thinking of kissing her? \"I want them all over me,\" he said. Holy hell. The answer to her question: yes. \"The chains are a bit much, don\u0027t you think?\" she said, ignoring his comment but unable to hide her breathlessness. \"It\u0027s not like they could keep me down if I decided to leave.\" It was a reminder of her victory over him, meant to put him in his place. He didn\u0027t back down. \"True.\" Nor did he sound concerned. \"I have a feeling you\u0027ll willingly lock yourself up, though.\" She would have snorted, but couldn\u0027t quite manage it. If ever there was a man who could convince a woman to play kinky bondage games, it was probably this one. But no matter what, she couldn\u0027t give herself to Devyn. The moment she did, he would lose interest in her. His kind always did. And she needed his interest. It would, hopefully, keep him malleable during their negotiations. What makes you think he\u0027s truly interested in you, anyway? I\u0027ve already had a vampire, he\u0027d once said, as though the thought of bedding another bored him. Maybe his interest in chaining Bride up and ravishing her stupid was feigned. Intended to soften her. \"Aleaha,\" she said. Her friend was the main reason she was here; she wouldn\u0027t forget. \"Where is she?\" \"Does the name Macy Briggs mean anything to you?\" he asked, once again ignoring her. Was he serious? \"Macy Briggs the model?\" \"She doesn\u0027t model anymore, but yes.\" \"No. Should it? Oh, wait. Let me guess. She\u0027s one of the women you screwed that day.\" The last lashed from her, harsher than she\u0027d intended. \"I thought you couldn\u0027t recall their names.\" \"Sheathe the claws, darling. I\u0027ve had a model and wasn\u0027t impressed. Macy isn\u0027t my type, so no, I haven\u0027t had her.\" \"How sad for you.\" One day a woman needed to put this man in his place. Grind up his heart and scatter the pieces all over New Chicago. The female population would be the better for it. I would be better for it. \"So tell me, did you fuck Nolan?\" Again, he didn\u0027t sound concerned. That... irritated her. But only because it meant he didn\u0027t want her as she\u0027d supposed, so she wouldn\u0027t be able to use his desire against him. Really. \"No. Near death isn\u0027t my type.\" \"That\u0027s good. Did he bleed on you? Spit on you?\" \"No.\" \"You\u0027re sure?\" She laughed without humor. \"I think I\u0027d remember.\" Unless she\u0027d been asleep when he\u0027d done it. Her shoulders sagged. \"Why?\" \"You\u0027ll catch his disease if you come into contact with any of his bodily fluids.\" A shudder rocked her. Whether Devyn was telling the truth or not didn\u0027t matter. Just the thought of possible contamination had her vowing to keep her distance from the imprisoned otherworlder. She\u0027d never been sick a day in her life, true, but that didn\u0027t necessarily mean she was immune to everything. \"Tell me where he is.\" Finally, emotion. White-hot anger, barely leashed. Devyn didn\u0027t care about her escaping his clutches or who she slept with; he only cared about where she\u0027d placed his enemy. \"You never should have taken him. You placed yourself and everyone around you in danger.\" She had no loved ones, no family or friends. \"Don\u0027t worry. I\u0027ll tell you where he is. After.\" One of his. brows arched in question, but he didn\u0027t look surprised by her announcement. After all, she\u0027d already warned him. \"After what? I bed you?\" \"Please,\" she said dryly. \"Now you\u0027re begging. We\u0027re on the right track.\" She gritted her teeth, that burning pain flickering in her chest. Stay calm. \"After you\u0027ve taken me to Aleaha. After you\u0027ve answered my questions about vampires. After you\u0027ve apologized for leaving me immobile on that street. Only then will I tell you where Nolan is.\" Now his brow crinkled adorably. Wasn\u0027t fair! Everything he did was a seduction. A temptation. \"One, if you want to see your friend, you\u0027ll pay my price. Two, why would you want answers about vampires from me? I\u0027m not a vampire. And three, I never apologize.\" Deceptively casual, Bride leaned back on her elbows, placing her hands near her waist, where she\u0027d stashed several other blades. \"One, you\u0027ll take me to Aleaha or you\u0027ll never see Nolan again. I shouldn\u0027t have to repeat that one over and over. Nor should I have to tell you that I will not be paying you anything. Two, because you\u0027ve clearly met a vampire before, and I haven\u0027t. And three, we\u0027ll see about that.\" Not surprisingly, he ignored everything she\u0027d said. \"I like this new pose.\" His hot gaze perused her, lingering on her breasts, between her legs, perhaps imagining licking her, sucking, biting. Or was that just wishful thinking on her part, idiot that she clearly was? When his eyes locked with hers again, his pupils were dilated, black overshadowing amber. Perhaps not so wishful, after all. \"Lovely. Stay just ... like ... that.\" Then he shrugged. \"Or don\u0027t. Whatever.\" Argh! First he\u0027d seemed to want her. Then he hadn\u0027t. Then he had. Now he didn\u0027t again. Which was it? \"Let\u0027s start with the easiest. The vampires. Who are they and where do they live?\" He traced a fingertip over the seam of his lips, and her entranced gaze followed the movement. Her own lips even puckered, suddenly wanting to press into his. \"You\u0027ve truly never met one?\" \"No,\" she said raspily. How was he affecting her this way? Making her crave things she shouldn\u0027t? \"I haven\u0027t.\" \"That means you were raised here.\" Attention never leaving her, he set his now-empty glass at his feet and straightened. \"Interesting.\" By \"here,\" did he mean New Chicago? Had vampires simply settled in another state? \"Yes, I was. I\u0027ve never left New Chicago.\" \"A new twist.\" He scrubbed two fingers over his stub-bled jaw, the very picture of intrigued male. \"Perhaps we can trade information.\" \"Men must like that game.\" Nolan had wanted to play, too. \"Good thing for you, I\u0027m all for it, as long as you don\u0027t ask me about the otherworlder.\" \"Oh, I won\u0027t, pet. There\u0027s no need. Not anymore.\" Leaning forward, Devyn tossed something at her. \"You\u0027ll simply bring him to me.\" Bride caught it by reflex alone and held it up to the light. A necklace. Obviously cheaper than Nolan\u0027s with dull, scratched metal links and a scuffed emerald stone hanging from the center. Breath froze in her throat, frosting up her lungs. \"This belongs to Aleaha.\" She knew because she\u0027d stolen it and given it to her one Christmas. \"I know.\" Her lashes lifted, and she leveled a piercing glare at her tormentor. \"You have her.\" A statement, not a question, laced with disbelief, fear, and grim expectation. \"Oh, yes. But the question is, what am I going to do with her? Which in turn raises another, more important question. What am I going to do with you?\" CHAPTER 7 Devyn had relished his words, every last one of them, eager to watch Brides reaction to them. What was he going to do with her? Anything he wanted. First, Brides mouth floundered open and closed, not a sound leaving her. Then she pushed out a heavy breath, as if she were trying to calm herself down. Then she narrowed her eyes at him, murderous intent glowing in their emerald depths. \"Where is she?\" Bride demanded. Gone was any hint of her earlier breathlessness. Breathlessness that could have sprung from desire ... or anger. \"We\u0027ll get to that,\" he said smoothly. She wound the links around her neck, the motions jerky. \"What have you done with her?\" Devyn kicked his feet out, crossing them at the ankles. Why, I sent her to a motel room fifteen miles from here, where she has been watching another room for any sign of you. \"Again, we\u0027ll get to that. I believe I once mentioned that I only converse while naked.\" Those lush red lips parted on a gasp, and he almost laughed. He\u0027d known he would enjoy this, but the depth of his enjoyment surprised him. She was everything he remembered, yet so much more. Beautiful, witty, and oh, so charming. She was also a fighter by nature. Proof: she\u0027d hunted him down. Twice. Proof: she\u0027d captured Nolan when he and Dallas had been unable. Proof: she sat on the edge of his bed, the chains surely taunting her, but she didn\u0027t run away.","sourceLink":"https://allnovel.net/seduce-the-darkness-alien-huntress-4/page-11.html","bookId":1769,"book":{"id":1769,"title":"Seduce the Darkness (Alien Huntress #4)","description":"Storyline: Seduce the Darkness (Alien Huntress #4) SHE HAS A BODY MADE FOR TEMPTATION...AND A KISS TO DIE FOR. The war between otherworlders and humans changed Earth beyond recognition. It also saved Bride McKells\u0027s life. Before, the gorgeous vampire was a target for every fanatic with a stake and a crucifix. Now, she\u0027s free to roam the streets -- and desperate to find others of her kind. One man claims to have the answers she seeks. Devyn, King of the Targons, is a warrior and a womanizer, and he makes no secret of how much he wants Bride -- and how dangerous he could be to her in every way. An avid collector of women, Devyn easily seduces human and otherworlder alike. Until now. Not only does Bride resist him, but she leaves Devyn feeling something entirely new...a bone-deep need bordering on obsession. Her blood is the key to curing a vicious alien disease, but helping Bride uncover her origins will compel her to choose between electrifying passion and a destiny that could tear her from Devyn\u0027s side forever.","cover":"https://allnovel.net/images/seduce-the-darkness-alien-huntress-4.jpg","author":"Gena Showalter","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/seduce-the-darkness-alien-huntress-4.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:27:31 AM"}}
