{"id":73503,"no":17,"title":"Page 17","content":"\\n\\n Then the otherworlders had begun arriving, seeming to appear out of nowhere. Panic had spread far and wide, and her crime had been forgotten. As a \"human,\" she belonged; she was someone to protect, no matter her past.\\n\\n No human had left home without a weapon of some sort, and Bride had watched innocent otherworlder after innocent otherworlder gunned down. But what no one had known was that some humanoid races had been here a while and had already integrated themselves into society. They\u0027d taken exception to the murders of their brethren and started fighting back.\\n\\n What terrible, dark years those had been. Hardly anyone had had a home; they\u0027d all been destroyed in fires, raids, and bombings. Money hadn\u0027t mattered; there\u0027d been nothing to buy. Not everyone had been equipped for such a life, and some had died from the elements. The too-cold winters, the too hot summers. Bride had spent years living that way and had thrived.\\n\\n When a treaty was reached between the species, rebuilding happened fast, humans and otherworlders working together. Not fully trusting each other—that might not ever happen—but using each other\u0027s skills and resources to get the job done.\\n\\n \"You going to stand there all morning?\"\\n\\n Slowly she turned, facing the cell. Nolan stood at the bars, his fingers tight around the metal, a grin on his beautiful face. Her jaw dropped in shock. Yes, he was beautiful. His skin was tan, no hint of gray, no sores. And he glowed. His cheeks had filled out and were no longer sunken. His eyes were bright, like shining silver stars.\\n\\n That apple scent wafted from him. With the realization, a tempting question drifted through her mind: if he smelled like apples, how delicious would he taste? Her gums actually throbbed as her fangs lengthened, sharpened. She was halfway to the cage before she caught herself. He\u0027s diseased. You can\u0027t drink him.\\n\\n Maybe I could. I\u0027ve never been sick. Not worth the risk, remember?\\n\\n Damn it! Another vampire would have known whether or not she could catch such an illness. Most movies and books claimed it was impossible. They also claimed vampires exploded in the sun, and she never had. So what was fact and what was fiction?\\n\\n \"I\u0027m alone all night, bored out of my mind, dripping with energy, and finally you show up but you won\u0027t say a word.\" There was a pout to his voice now. \"This is a new form of torture, right?\"\\n\\n Bride found her voice, forcing the words past a slightly swollen tongue. \"You look good.\" Understatement of the year. His beauty actually rivaled Devyn\u0027s, though he didn\u0027t make her heart race.\\n\\n \"I feel good.\" He grinned, and it lit his entire face. \"Better than I\u0027ve felt in years, actually.\"\\n\\n So. Her blood had helped him. What else had it done? Defeated his disease, or just muted it for a while? Had it turned him? Again, another vampire would have known. I hate being the lone wolf. Or rather, lone fang. \"Any unusual cravings?\"\\n\\n His brow wrinkled in confusion, as if he couldn\u0027t follow the thread of the conversation. \"Like what?\"\\n\\n Like blood. \"Have you wanted to drink something you wouldn\u0027t normally want to drink?”\\n\\n “I\u0027m still lost.\"\\n\\n \"Never mind.\" If he began craving blood, she\u0027d know it. He would stare at her neck, sweat when he couldn\u0027t get closer to her pulse; he would pale.\\n\\n What would Devyn think of this development? Would he and his agents want to study her? Poke and prod her? Poke and prod Nolan?\\n\\n \"Thank you for once more not shouting for help and bringing my neighbors rushing inside,\" she said. Before, he hadn\u0027t wanted to be mobbed. In his former condition, he wouldn\u0027t have survived.\\n\\n Like this, he could have charmed his way free. That he hadn\u0027t was a blessing.\\n\\n He snorted. \"Why would I want them to release me? I want more of that wine you gave me. And no, that\u0027s not an unusual craving. I love wine. But this wine ...\" He closed his eyes as if just the thought was ecstasy. \"My stomach settled the moment I downed it. What kind was it? What brand?\"\\n\\n \"Uh, it\u0027s just a little something I make myself. I\u0027m almost out, so let\u0027s hold off on more for a while.\" Bride slouched forward and flopped onto her couch, keeping Nolan\u0027s cell in view. He\u0027d been by himself and on his best behavior, so she owed him. If he wanted company, she would be his company, no matter how fatigued she suddenly was.\\n\\n \"What do you put in it?\"\\n\\n \"Can we not talk about that right now? I feel like I\u0027m dying.”\\n\\n “You hurt? That why you\u0027re covered in blood?\"\\n\\n Oh, shit. The blood. She\u0027d forgotten about it. No wonder the few people she\u0027d passed on the streets had given her weird looks. She needed to wash it off, but standing seemed like an impossible dream. Her thighs were shaking, the muscles bunched and knotted. Too much adrenaline crashing, she supposed, and not enough neck sucking.\\n\\n \"I\u0027m not hurt. Just tired.\"\\n\\n \"I take it you found Devyn,\" Nolan said hopefully. \"Yes.\" Her eyelids fluttered closed, open.\\n\\n He clapped, a smile lifting the corners of his lips. \"Wow. I didn\u0027t think you\u0027d do it. Hurt the otherworlder, I mean. But look at you. Covered in the blood of your enemy. I\u0027m misty-eyed. Honest.\"\\n\\n Wait. What? He thought she\u0027d killed Devyn? \"I found him, but I didn\u0027t hurt him. This isn\u0027t his blood. Someone tried to abduct me, and Devyn actually helped me neutralize him.\"\\n\\n A moment passed in silence. Then Nolan popped his jaw, irritation replacing his joy. \"He helped you?”\\n\\n “Yes.\"\\n\\n \"So now you think he\u0027ll never hurt you, right?”\\n\\n “No, of course not.\" Maybe. \"I recognize that look.\" His tone was grave. \"You\u0027re smitten.\"\\n\\n \"I\u0027m not smitten.\" She was, she really was. \"That\u0027s ridiculous.\" Devyn might have pissed her off by forcing her to strip in front of him, but he\u0027d also rushed to her rescue.\\n\\n Why had he done that? she wondered for the thousandth time. She\u0027d taken Nolan from him, outsmarted him in front of his friend Dallas, and threatened to cut off his balls if he hurt Aleaha. Yet still he\u0027d come, still he\u0027d decapitated her enemy. Because she was the only one who knew where Nolan was, as he\u0027d claimed? No, couldn\u0027t be. He wouldn\u0027t have killed Tom like he had if he\u0027d only wanted Nolan\u0027s location.\\n\\n She didn\u0027t understand him. He was a seducer and a warrior, charming yet callous, self-involved yet kind. Back at the apartment, he could have forced her to lie on that bed, spread her legs, and welcome him inside, but he hadn\u0027t. He\u0027d given her the sweetest of kisses, the gentlest of touches, and sent her on her way.\\n\\n Why? He didn\u0027t care about her. She was one of a thousand, perhaps a million, to him. A novelty. Forgettable. Right?\\n\\n I want to be more to him. The desire drifted through her, and she laughed bitterly. What the hell? No way. No damn way would she allow herself to care for him and dream of the impossible. Enjoy him, yes. She owed him three kisses, and she would give them to him. Because she was honorable, not because she craved them more than her next breath. But give him more than that? Hell, no. She valued herself a little too much to willingly be used and discarded.\\n\\n \"Bride?\"\\n\\n She blinked and pulled her hazy focus to Nolan. \"Yes?\" He sighed. \"Thought you\u0027d fallen asleep.\"\\n\\n Fallen into stupidity, more like. \"Almost. Like I said, I\u0027m tired. If you want to keep me awake, tell me something interesting. Like how you were able to bypass Devyn\u0027s mind control of your body.\"\\n\\n A calculating gleam filled those silver eyes, making them sparkle like diamonds. \"Give me another glass of that wine, and I\u0027ll tell you.\"\\n\\n Argh! \"What happened to waiting till tomorrow?”\\n\\n “That was your dumb idea.\"\\n\\n She dragged herself up, stumbling along the way to the kitchen, and prepared him another glass. She was only able to squeeze a handful of drops from her palm. After she\u0027d passed the concoction over, she flopped back on the couch, her fatigue a thousand times worse. \"God, I don\u0027t even have the strength to smack you for making me move,\" she muttered.\\n\\n Nolan downed every drop of the wine, then licked the bottom of the cup. \"So. Good.”\\n\\n “Don\u0027t forget what you owe me.\"\\n\\n \"Very well. I told you that the disease inside me is alive. Well, it\u0027s able to learn and study and change to best defend itself. When the disease is most active, I\u0027m weak and it\u0027s in control of me. During the battle in the alleyway, it somehow rewired my energy molecules, for lack of a better explanation. They were sporadic and swirling, so Devyn could never lock on them and force me to his will.\"\\n\\n Bummer. No way would she allow herself to be infected just to beat Devyn. \"Feel like sharing some details about your previous captivity?\" Because, if she wasn\u0027t careful, the same thing would happen to her. God, what had she gotten herself into?\\n\\n \"Sure, why not? Beats sitting here in silence.”\\n\\n “How long were you locked up by AIR?\"\\n\\n He shrugged. \"About a month. Maybe longer. Hard to keep track of day and night when you aren\u0027t allowed outside.\"\\n\\n Bride maneuvered to her side, resting her hands under her cheek. \"Are there others like you?”\\n\\n “Not here. Not any longer. AIR killed them.”\\n\\n “And yet they saved you.\"\\n\\n \"Like I told you before, I know when and where my queen will land, so to speak.\" He eased onto the cot and peered over at her.\\n\\n \"Do you love her?\" No. Wait. \"You\u0027ve never been in love.\"\\n\\n Shame darkened his eyes before he lowered his lashes, blocking the emotion. \"I despise her. She is the one who infected me.\"\\n\\n \"Why help her, then? You\u0027re putting the people on this planet at risk for someone you hate.\"\\n\\n \"I know.\" Whisper soft. \"But the ... thing inside me will not allow me to betray her. Even the thought of it causes pain a thousand times worse than any I\u0027ve ever known.\"\\n\\n Like the thorns and fire inside her? \"If AIR ran tests on your blood and found a cure, would you help them over your queen?\"\\n\\n He was shaking his head before the last word left her mouth. \"It cannot be studied. Were I to cut myself right now, I would bleed, but the disease would stay inside of me because another host is not nearby.\"\\n\\n \"Oh.\"\\n\\n \"Yes. Oh. Finding new hosts is the only way to keep it from building up inside of my own body.\"\\n\\n She could hear the regret and torture in his voice. He hated what he was, what he did. \"I know you want to fall in love before you die, but is that a strong enough reason to place the whole world in jeopardy?\"\\n\\n \"I could kill myself, yes.\" He laughed bitterly. \"But that wouldn\u0027t stop my queen from coming. That wouldn\u0027t stop her from creating others like me. Wouldn\u0027t stop your world from crumbling. So why not live while I can?\"\\n\\n Good point, in a twisted way. \"All right. Well. Think of it this way. To love a woman is to condemn her to the same death you will one day suffer.\"\\n\\n \"I know.\" Again, whisper soft.\\n\\n Yet he still planned to do it. Selfish bastard.\\n\\n \"I don\u0027t want to talk about love anymore,\" he said. \"Tell me what happened between you and Devyn. He wants me back, I know he does. What did he ask you to do with me?\"\\n\\n She sighed. \"I\u0027m supposed to take you to the pier tomorrow night—wait, I guess that would be tonight, since it\u0027s already sunrise—and trade you for my friend.\" If she worked the situation right, Aleaha might be sitting with her on this very couch by the end of the day.\\n\\n Nolan laughed, and this time there was genuine amusement in the undertones. \"A setup, no doubt.\"\\n\\n \"I agree.\" Why else wouldn\u0027t Devyn have tailed her? He\u0027d let her go so easily, without fighting for her location. That seemed completely out of character. Not that she knew everything about him. But the intensity of his determination to get what he wanted wasn\u0027t hidden. It was there, etched into every sensual line in his face.\\n\\n \"Are you going to take me?\" Nolan asked.\\n\\n \"I honestly don\u0027t know what I\u0027m going to do.\" And she had very little time to figure it out. But she would. And she would win.\\n\\n Devyn leaned back in his chair, gazing up at the ceiling, lost in thought. When Bride had called him, he\u0027d heard the panic in her voice and gone running. He\u0027d decided to kill her pursuer even before he\u0027d learned the man\u0027s purpose. He\u0027d wanted her safe, no matter the cost. But when he\u0027d learned Tom\u0027s purpose, rage had bloomed inside him, eating at any mercy he might have harbored.\\n\\n He\u0027d had no right to feel that way. In the past, he\u0027d frequented slave auctions with a wad of cash and a grin. And he hadn\u0027t been undercover or on a mission. Oh, no. He wanted to sample a morsel from every race, and sometimes buying a female was the only way to acquire something new. But the thought of the proud Bride on display... standing on a platform, naked for all to see ... to touch ...\\n\\n His teeth ground together. Was this how possessive men acted and thought? If so, why was he thinking and acting this way? It made no sense. He was a hedonist who adored variety. Yes, Bride challenged him more than any other. Yes, Bride exuded all that sparkling energy. She was resourceful, a fighter, a survivor, powerful, and had he mentioned witty? She was flirtatious and sarcastic. And strong. She\u0027d been covered in the human\u0027s blood, staring at his open wounds with naked desire in her eyes, wanting to drink him dry, but she had resisted. Hadn\u0027t even licked her lips clean.\\n\\n But surely, despite all of that, he would desire someone else soon. Surely his interest in Bride would fade rather than continue to grow. As it was, he could hardly wait to see her again.\\n\\n Because of the small, nearly imperceptible tracker he\u0027d planted on her bra, he\u0027d been able to follow her movements on his computer. He\u0027d known where she was when she called him. He\u0027d headed out immediately, even though he\u0027d needed her to confess where she was. Otherwise, smart girl that she was, she would have suspected the tracker and removed it. She\u0027d gone in circles for half an hour and would have lost a tail if she\u0027d had one. Eventually, though, she had gone home. Now he had her current location. An apartment a few blocks from Dallas\u0027s. \\n\\n","sourceLink":"https://allnovel.net/seduce-the-darkness-alien-huntress-4/page-17.html","bookId":1769,"book":{"id":1769,"title":"Seduce the Darkness (Alien Huntress #4)","description":"Storyline: Seduce the Darkness (Alien Huntress #4) \\n SHE HAS A BODY MADE FOR TEMPTATION...AND A KISS TO DIE FOR. \\n The war between otherworlders and humans changed Earth beyond recognition. It also saved Bride McKells\u0027s life. Before, the gorgeous vampire was a target for every fanatic with a stake and a crucifix. Now, she\u0027s free to roam the streets -- and desperate to find others of her kind. One man claims to have the answers she seeks. Devyn, King of the Targons, is a warrior and a womanizer, and he makes no secret of how much he wants Bride -- and how dangerous he could be to her in every way. \\n An avid collector of women, Devyn easily seduces human and otherworlder alike. Until now. Not only does Bride resist him, but she leaves Devyn feeling something entirely new...a bone-deep need bordering on obsession. Her blood is the key to curing a vicious alien disease, but helping Bride uncover her origins will compel her to choose between electrifying passion and a destiny that could tear her from Devyn\u0027s side forever.\\n","cover":"https://allnovel.net/images/seduce-the-darkness-alien-huntress-4.jpg","author":"Gena Showalter","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/seduce-the-darkness-alien-huntress-4.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:27:31 AM"}}
