{"id":73492,"no":6,"title":"Page 6","content":"\\n\\n \"Can you believe the balls on this guy?\" Dallas muttered. They were on opposite sides of the alley, yet Devyn heard him as if he\u0027d spoken directly beside him. They were both wearing sweet little headsets that allowed them to communicate quietly and privately no matter the distance between them.\\n\\n They were dressed in black from head to toe, and even though Devyn knew his friend\u0027s exact location, he had trouble making him out in the sea of red and shadow.\\n\\n Helped that clouds covered the moon, and the closest streetlights offered only a minimal glow.\\n\\n \"Yeah, I can. I\u0027d be doing the same thing.\" He spoke in a whisper so low not even the wind could pick it up.\\n\\n \"No, you wouldn\u0027t. If he screws her, she\u0027ll die. You\u0027re pretty fucked in the head, but you wouldn\u0027t knowingly kill a woman.\"\\n\\n Not necessarily true. Many times during his marriage he\u0027d imagined cutting his wife\u0027s heart out with a spoon and eating it in front of her. \"Can I approach him now?\" Devyn couldn\u0027t wait to finish off the Schön. He wanted to be looking for the vampire, and that he wasn\u0027t ... \"Huh, huh, huh? Please.\"\\n\\n \"Worse than a child.\" Dallas sighed. \"I told you. That\u0027s not how AIR works. There are too many civilians around. We can\u0027t protect them and take Nolan. We have to wait for backup.\"\\n\\n \"AIR can suck it. How much longer before we get to give up on backup? \u0027Cause at this rate, they\u0027ll never get here. The pimp is almost done giving the price list. Nolan\u0027s growing impatient, and very soon he\u0027s going to lead the female inside, where we\u0027ll have to involve a shitload of other civilians. We have to take him here.\"\\n\\n Would have been easier if at least one of the others had arrived, yes. Devyn didn\u0027t mind admitting that. Breean could move faster than the eye could see. Mishka was stronger than ten men combined. Kyrin could heal with a drop of his blood, and Mia was just plain mean. Eden and Macy, well, they were good soldiers, but Devyn preferred them as eye candy. But damn it, this inactivity was driving him insane.\\n\\n Of course, none of the other agents would have been necessary if Devyn\u0027s own ability worked on the Schön. Unfortunately, there were some people that were immune to his telekinesis, able to move normally when he attempted to control them with his mind.\\n\\n It was strange, though. Most that had been raised here on Earth, no matter their race, he could lock on and control. Outside of Earth, it was iffy. Their energy frequencies were usually too jumbled.\\n\\n \"Someone should be here,\" he griped. \"What the hell is holding them up? You made the call half an hour ago.\"\\n\\n \"What do you want to bet Mishka\u0027s the culprit? She wants Nolan alive.\"\\n\\n \"Then she should be here to save him from our wrath.\"\\n\\n \"She would be, if she thought we were competent. To her, you\u0027re a slut and I\u0027m a bad shot.\"\\n\\n \"Right on both counts.\" Devyn\u0027s lips curled into a smile. It had been the last time they\u0027d battled a Schon that Dallas had turned on Mishka, squeezing off a few rounds in her direction. Yes, he\u0027d wanted to kill her, thinking he would be saving Jaxon from her evil intentions, as his vision had led him to believe. That\u0027s when he\u0027d hit Jaxon instead. \"Doesn\u0027t matter, though. We have to act. Nolan\u0027s pale, unsteady on his feet, and perfect for plucking.\"\\n\\n \"If we fail...\"\\n\\n \"We won\u0027t.\"\\n\\n \"You\u0027re not the psychic in this relationship. If he opens fire on civilians, our heads are gonna roll.\"\\n\\n \"And that would be a damn shame, pretty as I am. Give me a minute and let me see if I can move people away from us.\" Pissed him off that he hadn\u0027t thought of this sooner. He blamed Bride. Damned red nipples.\\n\\n Devyn propelled mental fingers out of the alley and down the connecting streets, grabbing onto every pulse of energy he could and commanding each body they belonged to, to perform the same act: turn north and keep moving one foot in front of the other.\\n\\n Pulling the strings of that many humans tired him, but he fought through the lethargy until they were a good distance away. \"Done. No civilians will be hurt in the making of this war zone.\"\\n\\n \"You\u0027re scary, you know that?\" Dallas said with quiet affection.\\n\\n \"I know. It\u0027s hardly fair to others that I\u0027m a triple threat. Pretty and talented.”\\n\\n “That\u0027s only two, moron.\"\\n\\n \"I thought it\u0027d be rude to mention my cock.\"\\n\\n Dallas chuckled. \"All right. Here\u0027s the deal. Despite Mishka\u0027s belief, I\u0027m the better shot, so I\u0027ll do the firing. You and Mr. Happy just sit there and look pretty.\"\\n\\n A given. But he would be wearing heat-sensitive goggles just in case Dallas missed and Nolan did his invisible thing and tried to run. \"Next time at least try and challenge me.\"\\n\\n Dallas uttered another of those raspy chuckles. \"Oh, and before I forget, I think you should stun him rather than kill.\"\\n\\n \"Planned on it,\" Dallas said.\\n\\n That was good; they were agreed. But ... \"Why not kill?\" Devyn knew why he wanted the little shit alive but frozen, but he doubted his reasons were the same as his friend\u0027s.\\n\\n Dallas didn\u0027t like to show it, but killing bothered him.\\n\\n Devyn could tell. The knowledge was always there, dulling the light in those baby blues. That was\\n\\n why Devyn had wanted Dallas only to stun. When the bastard was immobile, Devyn could move in and finish him off.\\n\\n Still not a drop of the Schön\u0027s blood could be spilled. Not without causing that pandemic. So he\u0027d have to content himself with something simple, like stomping on the guy\u0027s trachea.\\n\\n \"I mean, we both know it needs to be done,\" he added when there was no reply. \"We even agreed to do it. I\u0027ve been looking forward to it.\" Did his eagerness mean he had a skewed sense of right and wrong? No. Something needed to be done about the Schön\u0027s treachery, before it was too late, and to Devyn, taking his life would be the same as taking out the trash. \"Why?\" he repeated.\\n\\n \"Mishka, man. I still remember those tears ... I was thinking we could take him in and have Mia gas him.\" Since Jack Pagosa, the iron-fisted ruler of AIR, had retired a few weeks ago, Mia had taken his place and now called the shots.\\n\\n \"I don\u0027t think so. Too big a chance for another escape.\" Just as Devyn reached up to pull his goggles over his eyes, he saw Nolan stiffen. Sniff the air.\\n\\n Both he and Dallas stopped breathing, suspended in an oh-shit moment of internal begging. Please don\u0027t disappear and run. Please, please don\u0027t disappear and run.\\n\\n A moment passed. Nolan remained just as he was.\\n\\n \"I\u0027m pretty sure he\u0027s on to us. Initiating battle ... now.\" Dallas fired, blue beams lighting up the alley.\\n\\n The prostitute, tired-looking and dirty, screamed and fell to her ass. The pimp broke into a mad dash out of the alley and never looked back. Nolan was smarter, though, even sick as he clearly was with his grayish skin and sunken eyes, and dove to the side, the beams soaring just over his shoulder.\\n\\n \"Mishka was right,\" Dallas breathed, already firing again. \"I\u0027m bad.\"\\n\\n Again, Nolan rolled out of the way, his body twisting unnaturally. This time, he withdrew his own pyre-gun and started hammering at the trigger. Good thing Devyn had moved the innocent out of the way. The otherworlder\u0027s beams were yellow, which meant he was shooting to kill. One touch from them and flesh would melt, muscle would turn to ash, and bone to lava.\\n\\n Not everyone would be as lucky as Dallas and have an Arcadian swoop in to the rescue.\\n\\n Devyn dropped to the ground, finally jerking the goggles in place. His vision tunneled to pitch, then two slashes of red became visible in front of him. Nolan and the girl. He kept his gun on stun. If the girl was human, it wouldn\u0027t affect her. If she was alien, she would freeze in place for about twenty-four hours, able to see and hear everything around her but unable to move. No fun, but better than dying.\\n\\n He fired at both slashes. One, he hit. One, he missed. Didn\u0027t take a genius to realize he\u0027d hit the girl. She scrambled behind a Dumpster, even though the beam had knocked her back against the wall, absorbing into her body. She was human, after all. That might add a few complications. Humans tended to throw fits about this kind of thing, whereas aliens didn\u0027t want to make waves and draw attention to themselves. Especially where AIR was concerned.\\n\\n \"Shit, man,\" Dallas panted through the earpiece. \"This is bad.\"\\n\\n \"I know.\" How the hell was Nolan able to anticipate the timing and direction of the beams and move before they nailed him? That was not a skill the otherworlder had possessed the last time they\u0027d fought him.\\n\\n Dallas continued to fire, though his shots were all over the place, as if he didn\u0027t know where to aim. Nolan must have gone invisible. With the goggles, it didn\u0027t matter. Devyn saw his every move. Watching him was like watching a fluid, lethal dance of ducking, rolling, and gliding.\\n\\n \"Twelve o\u0027clock,\" he instructed the agent.\\n\\n Dallas aimed, fired. Missed as Nolan again dodged. Over and over they repeated the process. Devyn supplied the coordinates, Dallas fired, and Nolan darted safely away. Dallas couldn\u0027t wear his goggles while Devyn wore his, because someone had to keep an eye on real life.\\n\\n \"What now?\" Dallas demanded. \"Do we approach?\"\\n\\n \"Not yet. Fast as he\u0027s moving, he\u0027s not winded enough and could dart past us. We\u0027d lose him along the city streets. Right now he\u0027s feeling pinned, and that\u0027s to our advantage.\"\\n\\n Nolan stopped at the side of the building, his elbows jerking back and forth as though he were pulling on a door. He was, Devyn realized. Probably hoped to escape the area without having to rush the agents aiming at him.\\n\\n \"He\u0027s trying to open a door.\"\\n\\n \"I already melted the ID pad,\" Dallas shouted. \"It\u0027s not gonna open, Nolan, no matter what you do. So why don\u0027t you just surrender peacefully and come with us?\"\\n\\n \"I need a woman, and you weren\u0027t giving me any,\" the otherworlder growled as he zigzagged through the cramped space. \"I\u0027ll die if I go back.\"\\n\\n Whaaa. Had Nolan always been such a whiner? AIR\u0027s cells were well lit. The otherworlder hadn\u0027t been stripped and shoved into a cold, black hole. Hadn\u0027t been denied all sensory perception. \"We can\u0027t let you run wild.\"\\n\\n Dallas must have been following the sounds of the alien\u0027s hoarse inhalations, because his shots were mere inches from their target. \"You infect people. Innocents.\"\\n\\n \"I didn\u0027t pick an innocent this time. I picked a woman who\u0027s already dying.”\\n\\n “Yeah, and how many people would she have taken with her if you\u0027d infected her?\" Dallas asked. \"No more than she already was.\"\\n\\n \"But those people would have infected more, and the people they infected would have infected more.\"\\n\\n \"Try and run, I dare you.\" Devyn narrowed his focus on the backside of the alien\u0027s glowing red form. Maybe, if he aimed at a piece of him rather than trying to nail him in the center, he\u0027d actually hit the center if Nolan dodged the right way. A lot of ifs, but worth a chance, at least, \u0027cause damn. He was losing, and he hated to lose. \"The closer you are to us, the harder it will be to dodge us\"— he hoped—\"and we all know it.\" Kind of.\\n\\n Nolan paused, teetered to the left, as if he knew another shot was coming.\\n\\n Devyn squeezed the trigger, angling the barrel of the gun at the last second. Finally. Contact. Nolan slammed into the wall and slid to his ass, the beam soaking into his side. But there wasn\u0027t time to congratulate himself on a job well done. Nolan didn\u0027t freeze. He shook his head and pushed to his feet. How. The. Hell?\\n\\n \"Damn it!\" Devyn was the one to curse this time. \"It didn\u0027t work. Stun has never not worked.\" He glanced over at his friend, seeking guidance. What should he do? But rather than ask, he sucked in a breath. Where there should have been only one red light, one body, there were two lights. Two bodies. And he couldn\u0027t tell which one was Dallas. Who the hell?\\n\\n He ripped off the goggles, stilled. Only one body greeted him. Dallas\u0027s. His friend was looking at Nolan, firing one shot after another, and hitting the otherworlder dead center in the chest.\\n\\n The otherworlder had given up on invisibility and was looking down at his own body in wonder, as if he couldn\u0027t believe he was withstanding stun either.\\n\\n Devyn drew the goggles back over his eyes, focusing just behind Dallas. Once again, there were two slashes of red, indicating two people. One seemed to be inside the wall.\\n\\n Again, he tore the goggles off. Again, only Dallas was visible. Another invisible Schön? No, couldn\u0027t be. They couldn\u0027t become part of an object. Could they?\\n\\n He was afraid to freeze whoever it was, afraid the man—or woman?—would be killed or stuck in the wall for twenty-four hours, and Devyn would have to wait to get to him. Or her. More than that, a dead person couldn\u0027t answer questions, and Devyn suddenly had a million.\\n\\n More than losing, he hated mysteries.\\n\\n \"No matter what I do, keep your attention on Nolan. Also, move away from the wall,\" he told Dallas quietly. \"You\u0027ve got a shadow.\"\\n\\n \"Need cover?\" Dallas inched to a stand and eased to the center of the alley. \"Please.\"\\n\\n \"Let\u0027s talk about this, Nolan,\" his friend said to the otherworlder to mask Devyn\u0027s actions. \"Surely we can work something out.\"\\n\\n \"Yeah, like my death.\"\\n\\n \"You\u0027re the one who escaped.\"\\n\\n \"I told you. It was that or die. I\u0027m not ready to die, damn it!\"\\n\\n With Dallas out of the way and approaching Nolan, Devyn inched toward the wall. Strangely enough, the red light seemed to be coming toward him, as well. Keeping his gun trained with one hand, he once again shoved his goggles out of the way with the other. Sure enough, the wall was moving. \\n\\n","sourceLink":"https://allnovel.net/seduce-the-darkness-alien-huntress-4/page-6.html","bookId":1769,"book":{"id":1769,"title":"Seduce the Darkness (Alien Huntress #4)","description":"Storyline: Seduce the Darkness (Alien Huntress #4) \\n SHE HAS A BODY MADE FOR TEMPTATION...AND A KISS TO DIE FOR. \\n The war between otherworlders and humans changed Earth beyond recognition. It also saved Bride McKells\u0027s life. Before, the gorgeous vampire was a target for every fanatic with a stake and a crucifix. Now, she\u0027s free to roam the streets -- and desperate to find others of her kind. One man claims to have the answers she seeks. Devyn, King of the Targons, is a warrior and a womanizer, and he makes no secret of how much he wants Bride -- and how dangerous he could be to her in every way. \\n An avid collector of women, Devyn easily seduces human and otherworlder alike. Until now. Not only does Bride resist him, but she leaves Devyn feeling something entirely new...a bone-deep need bordering on obsession. Her blood is the key to curing a vicious alien disease, but helping Bride uncover her origins will compel her to choose between electrifying passion and a destiny that could tear her from Devyn\u0027s side forever.\\n","cover":"https://allnovel.net/images/seduce-the-darkness-alien-huntress-4.jpg","author":"Gena Showalter","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/seduce-the-darkness-alien-huntress-4.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:27:31 AM"}}
