{"id":80834,"no":42,"title":"Page 42","content":"“You’re not my friend,” I said simply. “You’re a sick fucking son of a bitch with way too much time on his hands. Don’t you have any drugs to sell or fingers to cut off?”\n “Oh, nasty, nasty Eden. Sorry! I mean Ellie. Can I still call you angel? It would make things easier.”\n “You call me that one more time and I’m hanging up.”\n “You won’t hang up on me,” he said quickly. “I have something here of interest to you. To both of you. Angel.”\n That did it. I was about to hang up when I heard a muffled cry in the background. The cry of a child. I felt like a chunk of ice got lodged in my throat and was slowly filling up my chest.\n “What is that?” I cried out pitifully. Camden took a step closer and I put my hand out to stop him. I needed to keep him away from this, I needed to be sure. “Javier?”\n “Sorry, angel. I was just adjusting something here. You know you really hurt me with that whole cutting off fingers remark. I would never do that to a child.”\n Oh no. Oh fucking no. Say it wasn’t true.\n “You wouldn’t…” I threatened, feeling so fucking helpless.\n “I just said I wouldn’t. But his mother on the other hand? I have no problems with that. Hey, do you mind putting Camden on the phone for a minute? I have something I’d like to tell him.”\n I took in a deep breath through my nose, trying to figure out a way to spare Camden from this pain.\n “Now, my bella,” he commanded. “Before I grow impatient. I’ve had a rough few days and I really don’t want to take it out on someone. Especially when a little boy is watching. What’s his name again? Ben? Is it Ben? Why don’t you put Camden on so I can ask him.”\n I couldn’t look at Camden. I couldn’t prepare him for it. I silently held the phone out for him and huddled down in the chair after he took it.\n “Javier,” Camden greeted tersely. “What do you want?”\n I didn’t have to listen to know what was being said. I could tell in the heaviness that rolled into the room like an incoming fog. I could feel Camden’s heart come through as he gasped in horror.\n “If you fucking dare lay a finger on them…” Camden began, then trailed off. He was choking on his anger, his body tense and ready to strike at something we couldn’t get at. We were in the cage now and Javier was poking a stick through the bars.\n “You’re disgusting,” he muttered in response to whatever Javier was saying. “I won’t play your games.”\n Suddenly the phone was thrust in front of my face. “It’s for you,” he said to me, his eyes cold.\n I took the phone. “Yes?”\n “Angel,” Javier began, “your new boyfriend needs to learn a lesson or two in compromise. I suppose you’re not the best teacher though, are you? We could have compromised, you and I. We could have come to an understanding back then. You didn’t have to leave me.”\n “What do you want?” I asked, ignoring him. Camden was pacing back and forth across the room, totally enveloped by this madness.\n “I want to make a deal. And I think you’re smart enough to take it.”\n My nerves felt electrified, prickles surging through my body. “I’ve made too many deals.”\n “I know you have. Did you know you’re running with a fugitive? Did you know there are some pretty bad people out there looking for him? I mean, I’m not putting myself down here but goodness, angel, they seem worse than I am. You know the types. Liars with no remorse.”\n I heard Sophia cry out in the background. The grip on the phone tightened. “Get to the point!”\n “Oh, now you’re seeing the hurry. Good, good. We’re always best when we’re on the same page, you and I. Now, your Camden. Is he your Camden now? We’ll see about that soon. But I digress. Your Camden is in some very bad trouble with some very bad people. He stole a bunch of their money. Sounds familiar, doesn’t it? The men want it back. They’d kill to get it back. But don’t worry, I took care of it.”\n I hesitated. “How?”\n “I paid them off. I gave them the money they wanted, and in exchange they gave me Sophia here and…Ben? Was it? You know I never did ask Camden, and Sophia here, well she can’t exactly talk.” I could almost hear him smile. He called into the background, “Hey son, can you tell me your name?”\n Ben started crying in response. I wanted nothing more than to reach through the phone and strangle the life out of Javier. “You asshole,” I seethed.\n “Back to the name calling, are we? No matter,” he said. “I have them now. I will return both of them to Camden, if Camden gives me you. Why, I’ll even pay him the reward money. That’s not a bad deal you know. Fifty thousand dollars and his ex-wife and child back? That’s like winning the lottery in some countries.”\n “How can I trust you?” I asked.\n “I guess you can’t,” he said. “But you know I never break my promises.”\n “And you promise that everything will go as planned? Nothing funny?”\n He laughed. It struck a nerve somewhere, a feeling I didn’t ever want to feel again. “You know I’m not very good at being funny. I promise. I don’t care about this whore here and her fat little kid. I certainly don’t care about the walking tattoo. I just care about you. I want you, angel, and I won’t rest, won’t leave you alone, until I have you. You do understand, don’t you? You do realize how fucking long I’ve been looking for you!” He screamed those last words causing my heart to race and the phone to come away from ear. He rarely got this mad, and when he did…everyone was in danger. I had to make sure Sophia and Ben were okay.\n “I do, I understand. I’ll do it,” I told him. At that moment Camden grabbed my arm and whipped me around, yelling, “What the fuck are you doing, Ellie!?”\n But it was too late. The plan was already in motion. The deal had been made.\n Javier spoke quickly as I kept the phone to me, fighting off Camden. “Remember, if he messes this up, he loses both of them. And then he’ll lose you. Meet me at his tattoo shop in three hours.”\n I eyed the time on the phone. It was noon. We could be there in two and a half. “How do you know I’ll make it there on time?”\n “I know you’ll figure out a way. And I know you’re close. I can feel you. I always have.”\n The phone went dead. The fuzziness rang in my ear. I gingerly hung it up and stuck it in my pocket. I raised my head, shoulders back, and looked Camden in the eye. He was about to kill someone.\n “What the hell did you do, Ellie?” he cried out.\n “I’m getting your son and ex-wife back,” I said. “You want to pretend like it wasn’t going to happen?”\n “We have to get the cops. I have to call my dad,” he said, pacing again.\n “No. We can’t involve them. You know we can’t. He didn’t have to whisper ‘and come alone’ on the phone for me to know how serious he is. We have to go now, and you’ll get them back. I promise you.”\n He grabbed me by the arm, more harshly than he probably meant to. He was on the verge of freaking out. “I can’t let you go with him.”\n “I won’t go with him,” I said. “He just wants to see me, to talk to me, that’s all.”\n “They’re going to take you away,” he said.\n I looked him straight in the eye. “I won’t let them.” I grabbed his hand and held it, hard. “But we have to focus on Ben right now, okay? Let’s make sure he and his mom are safe first. Then we’ll deal with me.”\n I let go and started packing. “Come on, we can’t argue about it. If we’re not there in three hours…” I wasn’t about to finish that sentence. I didn’t need to.\n In three hours we’d be back in Palm Valley, dust returning to dust.\n CHAPTER TWENTY-THREE\n We didn’t speak much to each other during the drive, as the rolling green hillsides dissolved into the craggy desert. The moment we hit the I-10, it felt like we were coming home. I felt like I finally had a home. It’s too bad home had never felt so frightening.\n I felt so bad for Camden, my heart more occupied with his than with my own. It was easier that way. I didn’t want to think about what I was going to do or what was going to happen to me afterward. I just wanted Camden to be okay, for his family to be back together with him. I hoped Sophia wouldn’t hold it against him, I hoped, even though it hurt my heart to think this way, that she’d forgive him. After all, they had a son together. If anything, their relationship desperately needed to be repaired, more than ours had.\n I couldn’t believe how easily her brothers had handed her over to Javier, their own sister and nephew. I supposed there was a chance that Javier lied—that he never paid them off with the money we stole, that he kidnapped Sophia and Ben in the night. But here’s the funny thing about Javier. As much as I despised him, as immoral of a human being that he was, he rarely lied. And he was right, he always kept his promises. I didn’t have to admire him for it, but it was the truth.\n That was the only reason I felt a bit of peace as I sat back in the passenger seat of Jose. The only reason why I had some hope for them. I knew Camden, Sophia, and Ben would walk away from this and with the fifty thousand dollars. Camden had the chance to really start over, to become Connor Malloy for good. And, after the way her family had treated her, I wouldn’t be surprised if Sophia and Ben would join him.\n Which reminded me. I brought out my notebook and tore a piece of paper out.\n “Camden,” I said, trying to write on the dash as he took the exit for Palm Valley. “I’m writing down all of Gus’s contact info. You’ll need him for your IDs and if you ever get into any trouble.”\n “What are you talking about, Ellie?” he asked, voice shaking. “If there’s any trouble, you’re the one calling Gus because you’ll be with me.”\n “You know we have to be ready for any situation,” I said, avoiding his eyes. I folded the piece of paper, leaned over, and stuck it in the pocket of his cargo shorts. “If you want to be a good con artist, you’re going to have to start thinking that way too.”\n “Ellie,” he warned.\n “He’s an ex-LAPD officer and he lives close by,” I went on. “He knows people, he knows everything, and he’s always on my side, you got that? He’ll be on your side, too.”\n He gripped the wheel. “I don’t like this,” he said, shaking his head, his jaw tense.\n “I don’t think we’re supposed to like this,” I told him. “That’s the point.”\n “If you try anything stupid…” he said.\n “Me?” I asked, managing a smile. “You’re the one I’ll have to keep an eye on so you don’t go all Dirty Harry on him.”\n “Some guys deserve the Dirty Harry,” he muttered. \n","sourceLink":"https://allnovel.net/sins-needles-the-artists-trilogy-1/page-42.html","bookId":2732,"book":{"id":2732,"title":"Sins \u0026 Needles (The Artists Trilogy #1)","description":"Storyline: \n Sins \u0026 Needles (The Artists Trilogy #1) \n Ellie Watt is used to starting over. The daughter of a grifting team, Ellie spent her childhood being used as a pawn in her parents\u0027 latest scam. Now she’s much older, wiser and ready to give her con artist life a rest. But returning to the dry desert town of Palm Valley, California means one more temptation than she bargained for – Camden McQueen. Once known as the high school weirdo, Camden is bigger and badder than the boy he used to be and a talented tattoo artist with his own thriving business. Ellie’s counting on Camden still being in love with her but what she’s not counting on is how easily unrequited love can turn into obsession over time. When Camden discovers Ellie’s plan to con him, he makes her a deal she doesn’t dare refuse, but her freedom comes with a price and it’s one that takes both Ellie and Camden down a dangerous road.\n \n","cover":"https://allnovel.net/images/sins-needles-the-artists-trilogy-1.jpg","author":"Karina Halle","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/sins-needles-the-artists-trilogy-1.html","creation":"Oct 5, 2019 8:59:19 AM","modification":"Oct 5, 2019 4:28:36 PM"}}
