{"id":100632,"no":19,"title":"Page 19","content":"I read runes for another two hours, looking up periodically to find either Raphael or Christian watching me. I ignored both of them, as well as the two men Christian posted on either side of the aisle. There were just no words to adequately express my disgust with either overprotective, pigheaded, domineering man. Individually, I could have dealt with them; working together, they were almost impossible to conquer.\\n\\n Almost.\\n\\n \"Are you done here?\" Raphael asked as I was tucking away my stones.\\n\\n I started to glare at him, then realized he was looking at me with a strange expression on his face. \"What is it? Is something wrong?\"\\n\\n He sighed and waited for me to finish putting things away, then took my hand and steered me toward the long lawn. \"Yes, something\u0027s wrong, something is very wrong, but unfortunately, I find myself in a position - \"\\n\\n I had a sudden premonition of what he was going to say.\\n\\n \" - of needing to ask you for help.\"\\n\\n \"Yes,\" I said immediately, squeezing his hand and all but jumping up and down with the warm glow of pleasure that filled me. He needed me! He wanted my help! He finally acknowledged the fact that I was the one who was put on this earth to aid him in his greatest hour of need.\\n\\n \"You don\u0027t even know what I want you to do,\" he answered, pulling me to a halt behind the aura photography booth. His lovely eyes were grim.\\n\\n \"I don\u0027t care, I\u0027ll do it.\"\\n\\n \"It\u0027s dangerous - \" He ran a hand through his curls, then shook his head. \"Hell, what am I doing? It\u0027s too dangerous for you, I can\u0027t ask you to put yourself in that sort of a situation.\"\\n\\n \"Yes, you can. Raphael, I trust you. I know you\u0027ll keep me safe no matter what I have to do.\"\\n\\n He stared at me for a moment, then took my face in his hands. \"Baby, I wish there were another way, but - \"\\n\\n \"I\u0027ll do it, I\u0027m happy to, honest.\"\\n\\n \"There\u0027s no time to come up with another plan - \"\\n\\n \"I\u0027ll do it, Raphael, I\u0027ll do it! Do you hear me? I\u0027LL DO IT!\"\\n\\n \" - and Bartos feels that you are the key... I know he\u0027s right, but still - \"\\n\\n \"I\u0027ll make a very good key,\" I promised. \"I\u0027ll be the best damned key there ever was. Let me help you, please!\"\\n\\n He looked me straight in the eyes, indecision mingling with regret and love in his face. He kissed me, hard and fast, his mouth gone before I could respond. \"I need you to help trap Tanya\u0027s murderer.\"\\n\\n My legs went a bit weak at his words. \"Anything, Bob, I\u0027ll do anything you need me to do. Um... this wouldn\u0027t involve guns, would it? Because I don\u0027t like guns, and I don\u0027t know how to shoot one.\"\\n\\n He turned us toward the long lawn, where the main stage was set up. \"No guns. You have to do everything I say, exactly as I tell you.\"\\n\\n I saluted him. \"Aye-aye, mon capitaine.\"\\n\\n \"I\u0027m serious, Joy. If you do anything, anything that I don\u0027t instruct you to do, I\u0027ll pull you out. Do you understand?\"\\n\\n \"I\u0027m your woman,\" I reassured him. \"I won\u0027t even breathe without your express permission.\"\\n\\n He sighed again and nodded to Bartos as we passed him. \"I don\u0027t like it, but... hell. Paal and Christian\u0027s men will stay with you until it\u0027s time to bring you to the caves.\"\\n\\n Excitement rippled through me at the thought. Here I was, madly in love with a dashing spy and he needed my help to catch a killer. Could life get any better?\\n\\n It could, as a matter of fact. Raphael stopped at one side of the stage, his thumb rubbing gently on my wrist. I smiled secretly to myself. Now he would tell me everything, now he would bare his soul and take me wholly and completely into his confidence, proving without a doubt that he trusted me with his life.\\n\\n \"Paal will bring you to me after the magic show,\" Raphael said before turning to speak a few words with Henri. Then he left - he just left, walked off without even a glance back at me.\\n\\n So much for trust.\\n\\n By the time I stopped glaring at Raphael\u0027s disappearing figure, the crowd was gathering to sit on the ground before the stage. It was a low wooden structure about two feet off the ground, ringed with large black speakers used later by the bands, and backed by an area of draperies hung on a metal frame. Roxy had told me how much she enjoyed Dominic\u0027s magic act, saying it was surprisingly professional, much better than the phony vampire act he put on. Since I couldn\u0027t shake the two watchdogs who stuck to me like glue, and because I wanted to tell Roxy the latest news, I searched the crowd until I spotted her, following her to the spot near the stage she had staked out earlier.\\n\\n I whispered the plan to her, then spent several long minutes rehashing my feelings for Raphael until Roxy finally had enough.\\n\\n \"Be quiet. Dominic is going to do this really cool disappearing trick. He goes into a glass box, it fills with smoke, and when it clears, he\u0027s gone. Then they do the smoke thing again, and voil¨¤! He reappears. It\u0027s really great. I can\u0027t figure out how he does it, since the box is made of glass and they twirl it around on stage so you can see all the sides.\"\\n\\n \"Hrmph.\" I sat with my arms crossed and pouted slightly. I\u0027d much rather talk about Raphael than watch some silly magic act.\\n\\n \"I wonder if he\u0027s going to do what he did last night?\"\\n\\n \"What\u0027s that?\" I asked, toying with the brooch Christian had lent me.\\n\\n \"Dominic went into the box, and Milos came out of it. I didn\u0027t know Milos was a magician, but he did some pretty amazing things after that. You should see what he does with three eggs - \"\\n\\n Onstage a couple of the fair workers wheeled out a large glass cube that rested on a dolly. Dominic did a little patter about the powers gained from his time studying the black arts.\\n\\n I turned to Roxy, puzzled by what she said. \"What do you mean, Milos is a magician? He was on the stage with Dominic? That can\u0027t be! Raphael said Tanya was killed right before he found her - her body was still warm. I know, I touched her.\"\\n\\n \"I don\u0027t follow you,\" Roxy said, her attention still on Dominic as he explained the illusion to come.\\n\\n \"Try this: If Milos was on stage doing a magic trick, he couldn\u0027t have killed Tanya.\"\\n\\n Slowly her head turned to look at me. \"If he didn\u0027t, who did?\"\\n\\n A wave of gooseflesh ripped down my arms and back as I looked back at the stage. \"It couldn\u0027t be... \"\\n\\n \"Oh my God,\" she breathed, her eyes huge.\\n\\n I watched as Dominic strutted across the stage, tall and elegant in stark black with a red ruffled shirt. He flashed his fangs, playing up his vampirism to the crowd. He was working them like a veteran of the stage, teasing and playing with them until they yelled out their excitement.\\n\\n \"Dear Lord, it must be him. I always thought he was joking when he insisted he was a vampire. I mean, it was just all too ludicrous, what with those fake teeth and all. But what if he believes it? What if he really, really believes he\u0027s a vampire?\"\\n\\n Another wave of chill hit me. I gathered up my skirt and stood as the crowd yelled at something Dominic said. \"I have to go tell Raphael. He thinks the murderer is Milos. I\u0027m willing to bet you he doesn\u0027t know that Milos finished the magic show last night!\"\\n\\n Roxy tugged at my skirt, trying to pull me back down. \"Joy - \"\\n\\n \"The perfect volunteer!\" Dominic bellowed from the stage, leaping into the crowd and heading straight for me, his hand held out. \"Mon ange, if you will assist me?\"\\n\\n \"What?\"\\n\\n \"He was asking for volunteers, you fool. Too late - he\u0027s got you now,\" Roxy muttered.\\n\\n \"What? What?\" I stared stupidly at the hand Dominic held out for me. I didn\u0027t want to touch him - he was a murderer! The crowd started cheering.\\n\\n \"Come, mon ange,\" Dominic said with a full-fanged smile. \"Assist me. It will be over quickly, I assure you.\"\\n\\n I wondered if he had said the same thing to Tanya. Dominic grabbed my hand and started hauling me back through the crowd. I debated accusing him there on the spot of Tanya\u0027s murder, of screaming for help, or of kicking him until he let me go so I could run to Raphael. In the end, I decided that it was better to not make him suspicious, so I made no complaint when he jerked me onto the stage and dragged me over to the glass box.\\n\\n He kept a hold on my hand while he helped me into the box, doing a spiel about his powers and how I would be sent to the underworld to await his command to return. It was a bit creepy, considering Tanya. As he turned to close the lid on the box, he hissed, \"Do not fear, mon ange. As soon as the smoke fills the outer layer, the trap will open and you will escape. Crawl under the stage to the rear. Antonio will be waiting for you there.\"\\n\\n \"Crawl? I\u0027m supposed to crawl?\" I asked as he closed the lid, getting a little panicky at the thought of being shut into a box with a bunch of smoke. I crouched in the box, my head pressed up against the top of it, the lights and the crowd blurring a little through the thick glass. Dominic waved his arm dramatically, and the box began to fill with smoke, obscuring my vision.\\n\\n That was when I realized what he was talking about. The part I was sitting in was insulated, a box within a box, made of double-paned glass. The smoke filled a thin space between the two layers of glass, no doubt making it look as if I were sitting in the middle of the smoke, when in fact I wasn\u0027t. As soon as my vision outside the box was completely obscured, the floor beneath my knees gave, and I dropped down to a small space under the stage. The skirting around the edges of the stage kept me from seeing anyone, but I could hear the crowd. They roared with laughter at something Dominic was doing, no doubt misdirecting their attention so they wouldn\u0027t notice the box wobble as I dropped. I wadded up my skirt and crawled forward on my belly when I saw a bit of light flashing at the rear, muttering to myself about ruining my lovely skirt just so Dominic could impress his audience.\\n\\n Antonio, Dominic\u0027s assistant, helped me out from under the stage through another trap in the curtained-off area. Antonio pulled on a gruesome rubber mask, saying, \"Stay here until you hear Dominic announce that he\u0027s brought back a demon from the underworld instead of you. Then you can go out into the crowd.\" Then he dived under the stage and headed for the box.\\n\\n \"like hell I will,\" I muttered, and peered out of the curtained area. My watchdogs must have been waiting patiently up front for me to return, because there was no one around the back. I slipped out and started hunting for Raphael, keeping well away from the audience around the stage.\\n\\n I spotted Henri on the far side of the grounds, zipping up his pants as he emerged from a portable toilet.\\n\\n \"Henri, where\u0027s Raphael?\" I asked as I raced up to him.\\n\\n He frowned. \"Aren\u0027t you supposed to be at the magic show? I thought Raphael said you were there. It\u0027s not over yet, is it?\"\\n\\n I almost danced with impatience. \"Forget the magic show. I have to find Raphael. It\u0027s very important. Where is he?\"\\n\\n \"He won\u0027t like knowing you\u0027re not at the magic show,\" Henri pointed out.\\n\\n \"He will when he hears what I have to tell him. Where can I find him?\"\\n\\n \"He said you were going to stay with Paal. Raphael\u0027s not going to be happy that you left without him.\"\\n\\n Friendly puppy or no friendly puppy, I wanted to throttle him. \"Henri,\" I said with a smile that would do a shark proud. \"Do you remember what I did to Christian in the west garden?\"\\n\\n His hand moved protectively to his groin as he nodded vehemently.\\n\\n \"Good. I don\u0027t want to have to do this, but if you don\u0027t tell me where Raphael is, I\u0027ll do the same to you.\"\\n\\n His eyes opened wide. \"He\u0027s down in the cave,\" he answered quickly, his voice thick.\\n\\n \"The cave? Already? Thanks, Henri. Wish me luck.\"\\n\\n I took off like a hound after a hare, dodging around people, heading away from the festival along the graveled path that curled around the bottom of the abyss, ending at the entrance to the cave. Since the caves were only going to be open for a couple of hours around midnight, there weren\u0027t many people on the path, and those were mostly made up of couples lip wrestling.\\n\\n I raced down the path toward the cool, dark entrance of the cave, large pools of yellow from the sodium lights strung overhead eating at the blackness within. There was no one at the entrance, but I could hear voices from inside. I listened for a moment, but other than guessing one of the voices was Raphael, couldn\u0027t determine whom he was talking to, or where they were in the cave. Noises tended to carry a long distance in there. I plunged in, trotting down the path, ignoring the scenic views and signs describing the various sights.\\n\\n \"Thank God I was here before,\" I said to myself as I paused at a junction in the path. The public tour continued around a bend to the left that led to the boat dock. To the right was a dirt path that according to the sign led to a maintenance area. I held my breath and listened. The low rumble of Raphael\u0027s voice echoed from the right. I started down the path, pausing for a moment, then sprinting down the path when a woman\u0027s voice answered him.\\n\\n The path was badly lit, with lights distant and far between. I stumbled over debris and rocks a couple of times, but managed to keep from falling. As I rounded a bend in the path, I almost slammed into Raphael.\\n\\n \"What the hell?\" I yelled, staring in appalled horror at him.\\n\\n He stood close to a woman, his mouth almost in her hair as his rotten, stinking, cheating hands moved under the back of her sweater.\\n\\n \"You bastard!\" I bellowed, my words echoing down the walls of the cave. Their heads snapped around at the sound, identical expressions of surprise on their faces. The woman was about six inches shorter than me, had a slight figure, and a pretty heart-shaped face with long, curly hair that I wanted to tear off and stomp all over.\\n\\n Raphael had the nerve to look annoyed. \"Joy! What are you doing here?\"\\n\\n \"OH!\" I screamed, fury battling with the pain of his betrayal. I doubled up my fist and punched him right in the tattoo. He grunted and let go of the hussy he was holding to grab his stomach. \"You cheating, lying bastard! No wonder you didn\u0027t want me down here until later! I never want to see you again. NEVER!\"\\n\\n I spun on my heel and raced back the way I came, stumbling and tripping over rocks because I couldn\u0027t see through the tears. Suddenly the tears dried up as fury took the upper hand. How dare Raphael put his hands all over another woman? He was mine, dammit, and I wasn\u0027t going to let him get away with that. It was time he understood one or two things. I turned around to go back and slammed right into him.\\n\\n \"Dammit, woman, will you stop and let me explain?\" I would have fallen but for the strong hands grabbing my arms.\\n\\n \"Don\u0027t you dare yell at me, you beastly man! You complete and utter rotter! You can\u0027t touch anyone else, do you hear me?\" I struggled against Raphael, but knew it would do no good. He pushed me against the smooth limestone wall of the cave, his body pressed against me as I fought him. He pinned my lower half back with his legs, his hands clamping down on my head, holding me in place.\\n\\n \"She\u0027s a policewoman,\" he said, breathing heavily. \"Christ, baby, did you have to hit me?\"\\n\\n \"You\u0027re despicable,\" I gasped. \"Using your position to corrupt an innocent woman. You should be hung by your toes. And your balls. Both. At the same time!\"\\n\\n \"Listen to me, Joy,\" he said, his breath fanning around my face. God help me, I was in love with a two-timing bastard, and even when I caught him with his hands all over another woman, he could still melt me with his touch. I sobbed anew at my own body\u0027s fickleness. \"Kyra is a policewoman. She\u0027s one of Bartos\u0027s people. She\u0027s here to do a job for me, that\u0027s all.\"\\n\\n I didn\u0027t want to hear him, didn\u0027t want to listen to any of his outrageous lies. \"I don\u0027t believe you,\" I said.\\n\\n \"What have I ever done to make you think I\u0027d be interested in another woman?\" he said, more calmly this time, his eyes hot with desire and love.\\n\\n \"I... \" I didn\u0027t have an answer. Behind him the woman appeared, pulling her sweater down. She asked Raphael in German what was going on. Just the sight of her renewed my fury. \"She\u0027s a policewoman, huh? You had your hands all over her. Under her sweater. Exactly what sort of a job is she doing for you?\"\\n\\n \"Kyra, show Joy your back.\"\\n\\n \"I don\u0027t want to see her back! I am not into threesomes!\" I said indignantly, wondering how I could have been so wrong about him.\\n\\n He rolled his eyes and repeated his order. The woman shot me a sour look and turned around, pulling up her sweater as she did. Snaked across her back was a flesh-colored cord, leading down to a thin black box about the size of a credit card. The cord and box were taped on with white surgical tape.\\n\\n \"She\u0027s a policewoman,\" Raphael repeated. \"I was wiring her so we can record anything said to her. I was not fondling her. She\u0027s our backup in case our suspect doesn\u0027t take the bait - namely, you.\"\\n\\n He took his hands from my head and stepped aside as Kyra murmured that she would be checking with Inspector Bartos before taking her position outside the cave. Raphael said he\u0027d be out shortly, then looked back at me, speculation in his eyes.\\n\\n \"Somehow I always had the idea that if you ever caught me straying, you\u0027d do more than just hit me in the belly.\"\\n\\n \"I didn\u0027t happen to have a castrating knife handy.\" I glared at him. \"But I can assure you that if I did, you\u0027d be singing soprano now. Policewoman, Raphael? Why do you need a backup policewoman? And why aren\u0027t you wiring me? Just what exactly are you doing?\"\\n\\n \"Trying to catch a murderer. You know that. I was going to wire you before we sent you out,\" he replied, stepping closer to me, an odd smile toying with his lips. \"You\u0027re jealous.\"\\n\\n \"Well, of course I\u0027m jealous,\" I frowned, poking him in the chest. \"You\u0027re mine, and you\u0027re not allowed to put your hands on any other woman\u0027s back. Those are the rules, and I expect you to follow them.\"\\n\\n \"Aw, baby,\" he growled in that low, sexy voice that never failed to melt my bones. It did now, too. Raphael grabbed me as my legs started to give way, pressing me up against the wall again, his hands next to my head, holding me prisoner. \"I\u0027m flattered that you\u0027re jealous, but you should know by now that no other woman could begin to compare with you. You\u0027re all I want.\" His teeth teased my ear, his breath steaming my skin, starting the familiar inferno of desire deep inside me.\\n\\n I slid my hands under his leather jacket and sweater, stroking my fingers across the muscles of his back, taking his groan into my mouth, mating it with my own moan of pleasure as he ruthlessly plundered my mouth.\\n\\n \"You make me so hot,\" he said as he kissed a wet, steaming path down my neck. \"How can you think anyone else can do this to me?\"\\n\\n He ground his hips against me. He was aroused, very aroused. I slid my hands down to investigate, smiling to myself as he groaned again, this time louder, his groan repeating itself in an endless echo of pleasure. My fingers worked quickly to free him, so I could feel his heat, feel his need and know it was all for me. I pushed his underwear aside and sighed when I found him, hot and hard, velvet over steel. I bit his tongue and whimpered against his mouth as his hands slid into my bra, wanting to feel him deep inside me where our heartbeats would merge to one wild tempo of passion.\\n\\n \"Raphael,\" I cried desperately, stroking his hot length, driven half mad by overwhelming desire stirred by his taste and his scent and his touch, knowing he wanted me as much as I wanted him.\\n\\n \"I know, baby, I know. This is going to have to be quick. I\u0027m not going to be able to last long.\" He pressed me against the wall, blanketing me in his heat as he wrapped his hands around my thighs and settled them around his hips. I locked my heels around him, kissing him frantically, our teeth clinking together as I nipped at his lips and tongue until he gave me what I wanted and allowed me to suck his tongue into my mouth. I tasted blood as I swirled my tongue around his, moaning as his fingers teased a fiery path up my thighs.\\n\\n I pulled my mouth from his just long enough to say, \"Underwear,\" before licking the drop of blood that welled up from his lip. His fingers stroked the satin of my underwear, then with a jerk they were gone, literally ripped off me.\\n\\n \"Dear God,\" I whispered as I felt the hot tip of him enter me. \"No one\u0027s every ripped my underwear off before. That\u0027s just so... mmmrowr!\"\\n\\n \"Baby, I can\u0027t wait,\" he all but sobbed into my neck as he sank into me.\\n\\n \"Don\u0027t wait,\" I answered, mindless to everything but the exquisite feeling of oneness that our joining brought.\\n\\n He cupped his hands under my behind, his breath hot on my neck, then with a grunt of possession slammed into me, thrusting so deep he knocked the breath from me. The wall of the cave was cold behind me, but he made me burn so hot I came close to leaving scorch marks on it. He nibbled my ear and neck as our bodies strained against each other, craving that moment of completion when we were transported past mere physical pleasure. His hips thrust and withdrew, his pace quickening with our breath. I slid my fingers through his curls and arched forward against him, close, so close to the end of our race.\\n\\n \"Raphael!\" I screamed just as he bit my neck, his roar of ecstasy matching my own, the two indistinguishable as they echoed around us.\\n\\n We stood like that for an eon, our bodies still joined, his heartbeat deep inside me matching my own, our breaths mingled, ragged, as he held me securely in his arms, still pressed against the wall.\\n\\n \"Ah, baby, I hurt you,\" he said, his voice thick with satisfaction mixed with concern. His lips were warm on my neck, his tongue a silky caress. \"I bit you too hard. You\u0027re bleeding.\"\\n\\n I tipped my head back so I could see his beautiful face, untangling my fingers from his hair to touch a raw spot on his lip. \"I bit you, too. If you were a Dark One, this would be the final step of Joining.\"\\n\\n One sable brow rose in question.\\n\\n \"A blood exchange.\" I smiled at his look of disbelief, and allowed him to lower my legs to the ground. Raphael tucked himself away, and I was just shaking my skirt down when a sharp sound started at one end of the cave and rolled past us, building in noise.\\n\\n Someone was applauding.\\n\\n \"Christ,\" Raphael snarled, turning around as he did up his pants, blocking me with his body. I sent up a silent prayer that whoever it was hadn\u0027t seen us in action as I tucked my blouse back into my skirt, making sure it wasn\u0027t bunched up anywhere before peeking over Raphael\u0027s shoulder.\\n\\n \"Mon ange, I knew you had passion, but you surpass my expectations. Such fire! Such zest! I particularly enjoyed how your body arched against Raphael\u0027s at le petit mort. I believe we would have been well mated.\"\\n\\n Oh my God, it was Dominic! And he had watched us! My skin crawled with revulsion even as anger surged within me. How dare he taint something wonderful and beautiful between Raphael and me with his slimy foulness? What we did was private, between the two of us, and although we might have celebrated our love in an inappropriate place, that still gave him no right to intrude. I hit the back of Raphael\u0027s shoulder, more than a little surprised that he wasn\u0027t roaring with anger at the invasion of our privacy, but it wasn\u0027t until I stepped around him to give Dominic a piece of my mind that I saw why he was so still.\\n\\n Dominic was pointing a very large gun at us. Next to him stood a silent Milos.\\n\\n \"What are you doing here? You were doing your magic show!\" I sputtered.\\n\\n \"All good things, ma ch¨¨re, must come to an end,\" Dominic said with one of his showy bows before waving the gun toward Raphael. \"Sadly, that includes you as well as the curious Mr. St. John.\"\\n\\n I glanced at Raphael. He looked like Dominic was boring him to death. I felt better immediately.\\n\\n \"You will both come with me now, Raphael in front, mon ange nearest me. Milos will follow. We will proceed that way to the boats, yes?\"\\n\\n \"Boats?\" I asked, scooting closer to Raphael. He didn\u0027t move a muscle, just watched Dominic with eyes so dark they were almost brown. \"You want to go for a boat ride now? I thought we were going to do that later? I\u0027m a bit busy now, so maybe I\u0027ll take a rain check on that. Raphael and I were... uh... just... um... \"\\n\\n Dominic snickered. \"Mon ange, it was quite apparent what you and Raphael were doing. Now, if you are quite finished, the boats are waiting.\"\\n\\n Milos eyed me coldly and turned to say something to Dominic. I used the opportunity to glare at Raphael. He raised his eyebrows at me.\\n\\n \"Well, you could help!\"\\n\\n \"I thought you wanted to be the one to help me,\" he said mildly, apparently unconcerned that we were held at gunpoint by a deranged madman who thought he was a vampire, and his equally cold-blooded accomplice.\\n\\n \"That was then. This is now. I\u0027d appreciate it if you did something.\"\\n\\n \"Like what?\"\\n\\n I pinched his arm. \"Save us!\"\\n\\n \"Ah. How?\"\\n\\n I threw up my hands in disgust. \"You\u0027re the one who has the gun!\"\\n\\n Milos and Dominic both stopped whispering and looked at us.\\n\\n \"I don\u0027t have it on me,\" Raphael told them.\\n\\n They didn\u0027t believe him. Dominic waved me to the side, his gun a few feet away from my breast while Milos patted Raphael down. Once they determined he was gunless, Dominic gestured me toward the way I had come earlier.\\n\\n \"As to your question, our boat ride must be canceled,\" he said, reaching for me. I slid away and ran for Raphael. \"It is a shame, but you will have instead the most tragic accident when you are shot by mistake. I, of course, will be saddened that you were killed in an attempt to stop Raphael from strangling you, but what am I to do?\" He shrugged. \"The police will have their murderer - a dead one - and I will mourn the loss of mon ange ch¨¦ri. All will end well.\"\\n\\n \"You\u0027re going to kill us?\" I don\u0027t know why I was surprised after seeing what he\u0027d done to Tanya. Maybe both of them did it, I certainly wouldn\u0027t put it past Milos, what with the unwholesome look of excitement in his eyes. \"Why? What have we ever done to you?\"\\n\\n \"It is so,\" Dominic answered my first question. \"Raphael has been too diligent in his investigation into our alibis for the murders of the women Milos and I have enjoyed. We cannot allow him to interest the police in our matters. Already he has gone too far. He almost caught me last night, before I was able to dispose of dear Tanya\u0027s remains to my satisfaction. I was not able to leave the damning clues as I had wanted.\"\\n\\n \"My rune stone,\" I said, seeing again the image of a purple stone in Raphael\u0027s hand.\\n\\n \"It would have worked if St. John had not followed us,\" Milos said, his voice cold and emotionless.\\n\\n \"But... but... why? Why did you kill her?\"\\n\\n Milos and Dominic exchanged a small, very chilling smile. \"We are Vampyr. It is what we do.\"\\n\\n \"You\u0027re no more a vampire than Raphael is,\" I snorted.\\n\\n Milos gestured toward me, prompting Raphael to note, \"Baby, never mock a man who\u0027s holding a loaded Glock on you.\"\\n\\n I pursed my lips and edged closer to him. Milos did not look in the least bit sane. \"I see your point.\"\\n\\n Raphael\u0027s hand brushed my hip as he reached behind him.\\n\\n \"You will come this way now,\" Dominic ordered.\\n\\n I hate being pushed around. \"Just a second. If you\u0027re going to kill us, the least you can do is admit everything in the best detective-story manner. I think you owe us that much.\"\\n\\n Dominic smiled; his fake fangs didn\u0027t look nearly as amusing as I\u0027d found them in the past. The beastly things glinted wickedly in the dull sodium lights. Raphael\u0027s arm slowly moved alongside me, then stopped. I prayed he had a weapon in it. Something lethal.\\n\\n \"I, too, read detective stories,\" Dominic replied. \"If you expect us to admit to our sins in hopes you will miraculously escape, you are bound to be disappointed.\"\\n\\n \"You did murder Tanya and all those other women, though.\"\\n\\n Milos muttered to Dominic. He held up his hand and looked hard at Raphael. \"Our dear Raphael knows the answer to that question.\"\\n\\n \"Yes, I do,\" Raphael drawled. \"The French police almost had you after you killed that prostitute in Paris, but unfortunately\" - his lips twisted wryly - \"I was pulled from the case.\"\\n\\n \"What? You knew it was the two of them all the time? Why didn\u0027t you do something?\"\\n\\n Raphael ignored my question, his eyes bright as they watched Dominic. \"Someone bribed a technician to destroy the forensic evidence needed to convict you, Milos. Without it, the French detectives I was assisting could not bring any charges.\"\\n\\n \"Just who are you?\" I asked him.\\n\\n \"Enough talk!\" Dominic snapped. \"You will walk ahead of me, mon ange.\"\\n\\n I couldn\u0027t believe I ever thought Milos was creepy. Dominic standing there with a gun calmly discussing our murders was by far the creepier of the two.\\n\\n \"Kill them now,\" Milos said as he turned to leave. \"I will return to the festival and keep the inspector busy.\"\\n\\n \"What?\" I shrieked.\\n\\n \"I would gag her before you shoot her,\" Milos tossed over his shoulder as he left. \"She will struggle more that way.\"\\n\\n \"I won\u0027t!\" I snarled, then quickly threw myself out of the way as I screamed, \"Let him have it, Raphael!\"\\n\\n Dominic looked at the slim black recorder held in Raphael\u0027s hand.\\n\\n \"Oui,\" he said, holding out his own hand. \"Let me have it, Raphael.\"\\n\\n I glared at the love of my life. \"I thought you had a knife or something, not a tape recorder.\"\\n\\n \"I seldom carry weapons,\" he said mildly. As Dominic approached him to grab the recorder, Raphael\u0027s foot shot out and cracked across Dominic\u0027s knee. Raphael threw himself on Dominic as the latter went down, both men struggling for possession of the gun. I danced around the pair of them, looking for something I could use to brain Dominic, and had just settled on a large rock when a hand grabbed my skirt and jerked me backward.\\n\\n The sharp prick of steel through my blouse kept me from moving.\\n\\n \"Drop the gun,\" Dominic gasped behind me, his hand tightening on my arm. \"Very good. Now kick it toward me.\"\\n\\n Raphael did as he was ordered.\\n\\n I glared at him. \"Even Dominic has a knife, Bob!\"\\n\\n \"Do not start with me now, woman.\"\\n\\n I snorted. He raised a brow at me in a wordless demand for silence, then held his hands up. \"Let her go, Dominic. She doesn\u0027t know anything. I haven\u0027t told her about my investigations, nor why I joined the fair.\"\\n\\n \"You can say that again,\" I muttered with another pointed look at him.\\n\\n \"Joy, this is no time to bait me,\" Raphael answered as Dominic released me to pick up his gun.\\n\\n \"Oh really?\" I gestured toward Dominic. \"There\u0027s a mad-man standing there with a gun pointed at us, explaining how he plans on murdering us, and you don\u0027t think now is the time to talk? When do you want to talk? While he\u0027s shooting us?\"\\n\\n \"You will stop this discussion now and march before me,\" Dominic ordered in his best bossy voice.\\n\\n \"You know full well that I had my reasons for not telling you what I was doing - \"\\n\\n \"Right, you\u0027re a spy.\"\\n\\n His eyes glittered dangerously at me. \"I am not a spy.\"\\n\\n \"Yes, you are, you\u0027re a spy, and you joined the fair because you knew Dominic and Milos were the murderers. Roxy and I figured it all out.\"\\n\\n \"You must stop now and walk in single file before me,\" Dominic demanded in a louder tone of voice.\\n\\n \"You and Roxy are not entirely right.\"\\n\\n \"But we\u0027re partially right, which means you\u0027re a spy!\"\\n\\n \"I am not a spy.\"\\n\\n \"Well, I know that story Dominic told me isn\u0027t true. I certainly don\u0027t believe you went to prison for raping some woman!\"\\n\\n \"Now, it is now we will be marching. St. John, you will proceed first.\" Dominic took a step nearer me and waved his gun at Raphael.\\n\\n \"Perhaps you would care to explain why you\u0027ve been trying to protect me from the police if you knew the story was untrue?\" Raphael answered me with a decidedly disgruntled look on his face.\\n\\n I shook my finger at him. \"I wasn\u0027t trying to protect you from that, you great lummox, I was trying to keep the police from arresting you because you were a spy and couldn\u0027t tell them who you really were.\"\\n\\n \"I AM NOT A SPY!\"\\n\\n \"I will not be ignored! You will do as I say. NOW!\"\\n\\n \"Ha!\" I said, raising my chin to glare at Raphael. \"If you\u0027re not a spy, what are you? You admitted you\u0027re investigating the murders. You\u0027re not a policeman because you\u0027re not Czech, and there is no international police force that works through... different\" - the words came to a stop as I stared at him - \"countries. What\u0027s in Lyon?\"\\n\\n Raphael\u0027s jaw tightened as his eyes closed for a moment.\\n\\n \"YOU WILL STOP SPEAKING NOW AND... Lyon?\" Dominic stopped bellowing to approach us warily, his eyes narrowed as he held the gun on Raphael. \"Lyon, mon ange, is where you can find the headquarters of Interpol. How very interesting I suddenly find this conversation. Interpol... of course. That would explain so much.\"\\n\\n \"Interpol?\" I asked Raphael. \"You\u0027re with Interpol? Like a detective?\"\\n\\n He ignored me, keeping his eyes on Dominic.\\n\\n Dominic stared back at him. \"The only thing I do not understand is how you knew I would hire you in Marseilles. Your record - which I assume now was false, yes? - was not one that would lend itself to employment.\"\\n\\n \"I assumed that in your case, a history of violence toward women would act as a reference rather than a deterrent,\" Raphael answered, his eyes boring a hole through Dominic\u0027s head. He had let go of my hand, but I could tell his muscles were tense with anticipation. I suspected he was waiting for Dominic to get close enough that he could jump him. I know that was my plan.\\n\\n \"You know me well,\" Dominic acknowledged, then waved the gun toward the entrance to the main cave. \"You will please do as I say now before I am forced to shoot your kneecap.\"\\n\\n \"Ha!\" I snorted, much braver than I felt, stepping carefully down the path. Raphael moved behind me, but Dominic stopped us and ordered him to go first.\\n\\n \"I will keep our fiery one here where she is safe, yes? With her as a hostage, I am assured that you will not try to act the hero again.\"\\n\\n \"Where is your gun?\" I whispered to Raphael out of the side of my mouth as he moved past me to take the lead.\\n\\n \"In my trailer,\" he answered just as quietly.\\n\\n I glared at him. \"Some detective you are. No knife, no gun. I bet you\u0027re going to be drummed out of Interpol for this.\"\\n\\n \"I\u0027m not a detective, I\u0027m a liaison,\" he answered, giving me another warning look. \"And you\u0027re closer to the truth than you know.\"\\n\\n I followed behind him, Dominic holding one of my hands twisted behind my back.\\n\\n \"Should have taken care of him when I had the chance,\" I grumbled to myself as we entered the cool air of the main cave.\\n\\n Dominic told Raphael to go to the right, toward the boat dock. I honestly think if Dominic had pointed the gun at him, Raphael would have disarmed him, but with the cold barrel of the gun resting on the back of my neck, Dominic was right - I was a hostage for Raphael\u0027s compliance.\\n\\n As we passed the entrance, the sound of footsteps on the wood pathway reached us. \"Stand there, against the wail,\" Dominic hissed, pushing me to Raphael. \"Do not move from there or I\u0027ll kill her.\"\\n\\n He backed up a few feet, one eye on us, the other watching to see who would come along the curved pathway. The footsteps were growing louder.\\n\\n \"This doesn\u0027t look good,\" I told Raphael as I hugged him tightly. His arms squeezed the breath right out of me. \"I think I\u0027m going to call for help.\"\\n\\n \"No one can hear you this deep in the cave, Joy.\"\\n\\n \"Christian will,\" I said, tracing a finger along his eyebrows. \"I\u0027ve just found you, Interpol Bob. I\u0027m not going to lose you now.\"\\n\\n \"The police know I\u0027m here,\" he said quietly. \"Christian can\u0027t do anything to help us.\"\\n\\n \"He can. I know you don\u0027t believe me, but he can hear my thoughts. If I tell him we\u0027re in danger, he\u0027ll come to help us.\"\\n\\n Raphael\u0027s arms tightened around me. \"Christian wouldn\u0027t be able to help us even if he knew we were here.\"\\n\\n \"Raphael - \"\\n\\n \"I won\u0027t let Dominic hurt you, baby.\"\\n\\n \"You have to have faith in me,\" I told him, deliberately repeating his words, and then turning to lean into him.\\n\\n Milos popped around the corner, gesturing with a small black pistol. \"Police. They\u0027re everywhere. I\u0027ve locked the gates to the entrance, but it won\u0027t take them long to reach the exit. We have to go now.\"\\n\\n Christian, I closed my eyes and called out mentally, not sure if I was reaching him. I know you don\u0027t want to answer me, but we need you. We\u0027re in terrible trouble, and Raphael doesn\u0027t have a gun.\\n\\n Immediately he was there, filling my mind with his calm presence. Beloved, you are distraught?\\n\\n I opened my eyes and looked at Milos and Dominic, willing Christian to see them as they gestured with their guns while discussing the best way to kill us and escape.\\n\\n I will come, his beautiful voice resonated in my head.\\n\\n \"Christian is on his way,\" I told Raphael, ignoring the disbelief in his eyes. \"But I\u0027ve always been a person who believes in being proactive. I think we ought to try to make a break for it.\"\\n\\n \"That would not be wise, mon ange,\" Dominic said directly behind me, the cold barrel of the gun pressed between my shoulder blades.\\n\\n \"Oh, what do you care? You\u0027re going to kill us in a minute or two anyway,\" I snapped, wiggling my shoulders in an attempt to dislodge the gun.\\n\\n \"We have modified our plans,\" Milos told me as he passed, his gun pointed on Dominic. He nodded at the nearest red and white tourist boat. \"It seems we have need of you alive. For the moment. Get in.\"\\n\\n Raphael crossed his arms and didn\u0027t move a muscle.\\n\\n Dominic prodded me with the gun. \"You as well, mon ange.\"\\n\\n \"No,\" I said, my eyes on Raphael. If I was going to be killed, I wanted the last thing I saw to be him.\\n\\n But I really didn\u0027t want to be killed.\\n\\n Dominic pressed the gun harder into my neck until I flinched with the pain. Raphael\u0027s hands tightened on his arms, and I thought sparks were going to come flying from his eyes, but he didn\u0027t move. I smiled at him and hoped he saw the love and admiration in my eyes.\\n\\n \"Get in the boat, Joie,\" Dominic said, grabbing my arm.\\n\\n What worked once might work twice, I figured. I blew Raphael a kiss, then lunged in the direction Dominic was pulling me, throwing him off balance. His gun slid out of his fingers and bounced on the wooden dock. I slammed my foot down on his, then brought my knee up into his groin. As he screamed and doubled up, I plucked the brooch from my blouse and stabbed him in the eye with it.\\n\\n \"Ew!\" I squealed at the sensation of soft, squishy eyeball on my fingers, and jerked my hand away. Dominic screamed as he fell to the dock, one hand clutching his eyes, the other on his groin. I spun around to help Raphael, but he had disarmed Milos in one smooth move that sent the gun flying into the water, and Milos crashing into the nearest boat. There was an ugly thud when his head cracked against one of the wooden seats. He didn\u0027t move after that.\\n\\n \"Are you all right?\" Raphael asked as I raced over to where he was checking on Milos. \"Where\u0027s the other gun?\"\\n\\n I looked back over my shoulder. Dominic was still writhing and wailing on the edge of the dock. \"It must have gone into the water as well. Is he dead?\"\\n\\n \"No, just unconscious. Come.\" He grabbed my hand and pushed me toward the nearest boat. \"Get in. I\u0027ll get you out of here, then come back for the two of them. There\u0027s nowhere they can go with the police at either end.\"\\n\\n I put on the brakes. \"No.\"\\n\\n He frowned down at me. \"Joy, don\u0027t be obstinate. I know you want to help me - \"\\n\\n \"No, it\u0027s not that. I get seasick. I didn\u0027t think I would on a quiet river like this, but I did the other day. I\u0027ll walk; you take the boat.\"\\n\\n He sighed and grabbed my wrist again, hauling me toward the narrow path that ran the length of the river. \"I have never in my life met a woman who is so contrary and argumentative,\" he said.\\n\\n \"Yes, but you love that about me,\" I answered, suddenly feeling incredibly happy. We had escaped! We were going to be together! We would have a deliriously happy life together - once I made Raphael understand he was never to keep anything from me again. \"Go on, say it, you know you want to.\"\\n\\n He stopped long enough to pull me up to his chest. \"Yes, I love you, you maddening woman. You\u0027re stubborn and obstinate and resistant to any form of common sense, but I love you more than I had ever thought possible, and no one is going to take you away from me.\"\\n\\n His lips were closing on mine when a noise behind us made the hair on my neck stand on end.\\n\\n \"How touching,\" Dominic rasped as he staggered toward us, blood streaming from one eye. I must have broken a toe or two when I stomped on him, because he was limping heavily. I assume the kick to his noogies hadn\u0027t done him any good, either, because he was walking hunched over like an old man. The gun he held clutched in one hand made any satisfaction in his condition moot, however.\\n\\n \"He must have been lying on it,\" I said apologetically to Raphael.\\n\\n \"You,\" Dominic spat, his mouth twisted in a snarl. The madness in his eyes was clear now. I wanted to cling to Raphael, but knew he had a better chance of disarming Dominic if I backed off a bit. I sidled away, Dominic\u0027s eyes blazing at me. \"You have laughed at me, and mocked me, and spurned my attentions for those of him - \" He waved the gun at Raphael, then suddenly fired.\\n\\n \"NO!\" I screamed, lunging for Raphael, but Dominic was faster than he looked. He slammed the gun into my face, sending me flying backwards. I crashed into the wall and lay numb for a few seconds, too stunned to do anything but wait for the burst of pain to reach my brain. It hit and left me gasping and retching as I dragged myself to my knees.\\n\\n \"Raphael.\" I knew the pathetic whimper was mine, but it didn\u0027t seem to belong to me any more than the haze of pain that nearly blinded me. All that mattered was that I get to Raphael. I crawled toward Dominic as he stood above a silent and still Raphael, pointing the gun at his chest and ranting in a high, insane voice.\\n\\n \"No one will doubt my power now. No one can. They laughed at me just as you laughed at me, but now I will be vindicated. AH will fear my power and know me to be the true master of the dark! I will take my place with the great ones, and they too will bow down before me. I will rule the dark world, become what I was meant to be. No longer will I be burdened with this mere mortal\u0027s body. I will be invincible!\"\\n\\n \"I am afraid there can be only one way to be rid of your human body, but as you are determined to do so, I will be happy to oblige you.\" Christian\u0027s voice was like a cool drink of water on a hot summer day. He appeared out of the shadows, walking toward Dominic, the power and deadly menace surrounding him making the air crackle. His eyes had changed, had deepened in their blackness if that was possible, allowing a glimpse into the endless torment that held him in its eternal grip.\\n\\n I used the distraction to scoot closer to Raphael, praying with all my might that he was still alive. Red stained his left side, spreading across his stomach.\\n\\n \"Oh my God,\" I sobbed, touching him gently, unsure of what I should do to stop the bleeding. I didn\u0027t want to press on the wound if it would make it worse. \"Oh, God, Raphael, please don\u0027t die. I need you. Please don\u0027t die.\"\\n\\n His eyes opened at the sound of my voice. They were dulled with pain and anger, but they were his lovely, lovely eyes and I wept all the harder to see them. I pressed his hand to my lips and started repeating every prayer I knew.\\n\\n Dominic cried out and stepped backward as Christian stalked him. The hairs on the back of my arms stood on end as I watched, unable to look away, unable to tear my eyes from the terrible weapon of retribution that Christian had become.\\n\\n \"You wished to see the great ones? Behold! I have touched eternity. I have walked the earth in darkness only, never to know the warming touch of the sun upon my flesh, never to have a family, a lover, friends. I have lived in silent torment wishing I had the strength to end the nightmare of my existence, but failing because I am cursed to live damned and shunned, an abomination to every living thing. Do you still wish to join me, little mortal?\"\\n\\n \"Joy.\" Raphael was trying to prop himself up. \"Help me up, baby.\"\\n\\n \"Don\u0027t move,\" I told him. \"You\u0027ll make the bleeding worse. Should I be pressing on it? Will it hurt you if I do? Oh, God, Raphael, you\u0027ve been shot!\"\\n\\n He pulled himself up into a sitting position, panting with the effort, his beautiful eyes glazed with pain. \"Have to protect you.\"\\n\\n \"No, my darling, you don\u0027t have to. Don\u0027t move anymore, you\u0027re making it worse! Just sit still. Christian is here. He\u0027ll take care of Dominic.\"\\n\\n \"That\u0027s who... have to... protect you,\" he gasped, his face pale with the strain.\\n\\n Dominic screamed something in a language I didn\u0027t understand. I put my hands on Raphael\u0027s shoulders to keep him from moving, and glanced over to where Christian was backing Dominic against the wall. Teeth, long and sharp, flashed in Christian\u0027s mouth. He stalked his victim as a panther would an insignificant rodent, slowly, without wavering, sure of the outcome.\\n\\n Evidently, Dominic was sure as well, for he suddenly raised his gun and began firing at Christian. The noise of the gun being fired in the large open chamber was deafening, each gunshot echoing until I had to cover my ears to keep from screaming.\\n\\n A terrible, high-pitched shriek ripped through the echoes, setting new ones bouncing off the walls, rippling through the air in one long, endless cry of death. When the noise stopped, I opened my eyes. Christian held Dominic a good two feet off the ground, one hand closed around his neck, his head tilted at an unnatural angle. With a flick of his wrist Christian sent Dominic flying. He hit the wall and slid down it like a soggy rag doll.\\n\\n I gagged. Raphael tried to move, but I held him down.\\n\\n \"Don\u0027t move, my love. Oh, God, the stain is getting bigger. How long will it take the police to come around the other end? Raphael, please don\u0027t try to move!\"\\n\\n His hands were tight on my waist as he tried to shove me aside. A shadow fell over the two of us.\\n\\n I looked up, tears streaking my cheeks. \"Christian, can you help him? Please, will you help him? He\u0027s been shot, and I don\u0027t know what to do. Please help us.\"\\n\\n Christian held his hand out for me, his face closed and impassive. I thought he wanted me out of the way so he could help Raphael, but when he pulled me to my feet, he didn\u0027t take my place. He just stood holding me.\\n\\n Raphael snarled and tried to shift himself. \"She\u0027s mine, Dante.\"\\n\\n \"No! Stop him! Raphael, you\u0027re going to kill yourself if you keep trying to move!\" I struggled against Christian, but the arm he had around my waist was like steel. He looked from Raphael to me, his eyes deep wells of suffering. One finger traced the welt on the side of my face where Dominic had struck me with the gun, a drop of blood clinging to his finger. He looked at it for a moment, then brought it to his lips.\\n\\n \"I have allowed this to go on long enough. It is at an end.\"\\n\\n I looked in his eyes and knew he would do nothing to help Raphael.\\n\\n Unless I bargained for that help.\\n\\n \"Please help him,\" I cried, my lips trembling as more tears spilled down my cheeks. Raphael grunted with pain as he tried to get to his feet. I held my hands out to him, but Christian would not let me move. \"Please,\" I begged. \"I love him so much, Christian. Don\u0027t do this to me; please don\u0027t make Raphael suffer.\"\\n\\n By some miracle of willpower, Raphael dragged himself to his feet, one hand clutching his side as he panted, leaning drunkenly against the cave wall. \"You can\u0027t have her,\" he said, his voice low and rough. \"She\u0027s mine.\"\\n\\n Blood seeped up from between his fingers. I moaned at the sight of it, and willed Raphael to look at me.\\n\\n \"I love you,\" I told him. \"I always will. Nothing will ever change that.\"\\n\\n He lurched away from the wall toward us, but was slammed backward when Christian lifted his hand.\\n\\n \"Leave him alone, God damn you!\" I shrieked, and turned to pummel Christian.\\n\\n \"He already has, Beloved.\"\\n\\n I looked back at Raphael. He was slumped against the wall, bright red smeared against the light-colored stone behind him, his body shaking with the effort to stay upright.\\n\\n \"She\u0027s... my... love,\" he said, his eyes on me. \"Not yours. Never.\"\\n\\n \"Come with me, Beloved.\" Christian\u0027s voice was like velvet sliding on my skin. \"I will make you forget him. I will give you everything you want. I will be everything to you.\"\\n\\n Raphael took a step away from the wall. With a flick of his eyes, Christian sent him flying across the room.\\n\\n \"NOOOOO!\" I screamed. Raphael lay halfway across a bench, his belly and chest bright with blood. He raised himself up on one arm, his head hanging, blood dripping from a cut on his temple.\\n\\n I closed my eyes, unable to bear seeing him hurt, then turned in Christian\u0027s arms. \"I will come with you.\"\\n\\n \"No, baby.\"\\n\\n I ignored Raphael\u0027s low cry, watching as Christian\u0027s eyes flared to life.\\n\\n \"I will come with you and live with you for however long you want me to, but you have to save Raphael first. You have to save him and let him go and promise never to harm him.\"\\n\\n Christian\u0027s eyes searched mine.\\n\\n \"You have to save him now, and swear to me that you won\u0027t ever do anything to hurt him. Ever.\"\\n\\n \"Baby, don\u0027t leave me,\" Raphael called hoarsely to me, sliding down the bench to the floor. I sobbed while my heart shattered into little pieces, my nails biting into my palms as I watched the man that I loved die.\\n\\n \"You would do this for him?\" Christian asked. \"You would give him up?\"\\n\\n \"So that he might live? Yes. I would do anything for that.\"\\n\\n \"I won\u0027t let you go.\" Raphael\u0027s words were the merest whisper, but they cut through my heart like a razor. I didn\u0027t look at him. I couldn\u0027t look at him. There was no way I could save him unless I gave myself to Christian, unless I bartered myself for Raphael\u0027s life.\\n\\n Christian\u0027s eyes narrowed. \"Everything you\u0027ve said, every protestation and objection you\u0027ve made - you say to Join with me will damn you; you would risk damnation for him? Would you sell yourself for his life?\"\\n\\n \"In a heartbeat,\" I answered. \"He is more precious to me than life. Please, Christian. Help him before it\u0027s too late.\"\\n\\n Christian stood silent for a moment, then released me and walked over to where Raphael lay. When Raphael tried to raise his hands, Christian squatted next to him, placing a hand on Raphael\u0027s side.\\n\\n \"He is dying.\"\\n\\n A moan slipped out of my lips, fresh tears burning down my cheeks. \"Save him,\" I begged.\\n\\n He placed both hands on Raphael\u0027s side for a few moments, then brushed his thumb across Raphael\u0027s forehead, leaving a long bloody smear. Raphael twitched, then slid the rest of the way off the bench, onto the floor.\\n\\n I watched, a silent scream of anguish so deep there was no end to it building inside me. He was dead.\\n\\n With him died my heart.\\n\\n \"I feel your pain, Joy, but you allow yourself to suffer needlessly. He is not dead, simply resting. I sent him to sleep so his heart would slow down. I cannot correct all of his injuries, but I have repaired enough of the damage that he will recover with medical attention.\"\\n\\n My relief at his words was so great that I dropped to my knees, my arms wrapped around my waist.\\n\\n \"Thank you,\" I said, my eyes on Raphael\u0027s still form, unable to say anything else. \"Thank you.\"\\n\\n He walked over to me and held out a hand. I looked up at him, unwilling to take it, but knowing I had to keep my part of the bargain. \"Do we have to go now? Can\u0027t I stay with him just a little longer? Just until an ambulance comes for him?\"\\n\\n Christian took hold of each arm and hoisted me to my feet. He held one of my hands in his, rubbing Raphael\u0027s blood off my fingers. \"With you as my Beloved, I would see to it that you lived in eternal happiness, untouched by any of the emotions which trouble mortal man.\" He glanced over to Raphael, then raised my hand to his lips. \"Tell him for me, please, that for the first time in a very long life, I truly find myself envying a human.\"\\n\\n I stared at him for a moment as the full meaning of his words sank in. He wasn\u0027t going to take me. He was sacrificing himself for us. I knew that Christian honestly believed he was giving up all hope of his salvation. I blinked back more tears, then pressed my lips to his in a gentle promise. \"I swear to you that I will find her. I will find your true Beloved. You won\u0027t have to spend the rest of eternity alone.\"\\n\\n He set me aside gently, a faint mocking smile curving his lips. \"This once I will not object to help from a human.\" He looked at me intently before making a courtly bow. \"Be happy, Beloved.\"\\n\\n I met his dark gaze, filled with longing and resignation and despair.\\n\\n \"I\u0027ll find her,\" I promised, then turned and ran to Raphael.\\n\\n I didn\u0027t see Christian melt into the shadows of the cave, but heard his beautiful voice as it echoed back to me. \"I will hold you to your promise. I, too, wish to know what it is like to be loved above all else.\"\\n\\n The words reached me as I knelt over Raphael, one hand holding his, the other stroking his face. His skin was warm, his pulse was slow but steady, his long brown lashes resting peacefully on the taut skin of his cheeks.\\n\\n \"I love you, Bob,\" I whispered to him.\\n\\n His fingers tightened around mine as voices from the far side of the cave echoed down to us, calling to find out if we were all right. The police had finally arrived.\\n\\n \"Love you, baby,\" he murmured.\\n\\n High in the night sky a beautiful voice etched into the heavens the song of a brave warrior and a beautiful maiden, and their love so true it could not be destroyed, not even by death itself.\\n\\n I smiled at my warrior as I waited for help to arrive. \\n\\n","sourceLink":"https://allnovel.net/a-girl-s-guide-to-vampires-dark-ones-1/page-19.html","bookId":2190,"book":{"id":2190,"title":"A Girl\u0027s Guide to Vampires (Dark Ones #1)","description":"Storyline: A Girl\u0027s Guide to Vampires (Dark Ones #1) \\n All Joy Randall wants is a little old-fashioned romance, but when she participates in a \"Goddess evoking\" ceremony with her friend, Roxy, Joy finds out her future true love is a man with the potential to put her immortal soul in danger. At first the ever-practical Joy is ready to dismiss her vision as a product of too much gin and too many vampire romances, but while traveling through the Czech Republic with Roxy, Joy begins to have some second thoughts about her mystery lover because she is suddenly plagued by visions of a lethally handsome stranger. Then, when she and Roxy attend a local GothFaire, Joy meets Raphael Griffin St. John, head of security, and she becomes even more bewildered because the dark and dangerous Raphael seems too close to her dreams for comfort.\\n","cover":"https://allnovel.net/images/a-girl-s-guide-to-vampires-dark-ones-1.jpg","author":"Katie MacAlister","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/a-girl-s-guide-to-vampires-dark-ones-1.html","creation":"Oct 5, 2019 8:58:26 AM","modification":"Oct 5, 2019 6:54:15 PM"}}
