{"id":100633,"no":20,"title":"Page 20","content":"To: Joyful\n From: Roxanne Benner\n Date: November 5, 2003\n Subject: I\u0027m baaaaaaaaaack!\n Hi Joy (and Raphael)! I\u0027m back home, and boy do I have a lot to tell you! You\u0027re not going to believe what happened to me after I left Germany... but I\u0027m going to tease you and make you wait for it. Are you waiting? Am I driving you nuts? Good. Now you know how it feels. Hahahahahah!\n I\u0027m glad to hear you guys made it to London OK. What\u0027s Raphael\u0027s apartment... sorry, FLAT look like? \u0027Roomy and near a big park\u0027 doesn\u0027t tell me much. Take pictures.\n And speaking of him, I\u0027m happy the tattoo wasn\u0027t touched when they dug that bullet out of his gut. A scar you can live with, but if that tattoo was ruined... well, I\u0027m just glad it\u0027s not. How long will it be before you know if Interpol is going to throw him out of the organization for going off on his own to find the vampire murderers? I can\u0027t believe they yanked him off the case in the first place. I mean, didn\u0027t he have Dominic and Milos pegged all along? It wasn\u0027t his fault if someone messed up the evidence; he knew it was Dominic, they should have listened to him, not forced him to take a leave of absence. Is he still in denial about Christian, or has he finally given in and admitted that there are Dark Ones? Must be tough living with an infidel unbeliever. Still, all\u0027s well that ends well, eh? You got your man, Inspector Bartos has Milos locked up safe and sound, and I got... heee! Nope. Not going to tell you yet. Waiting, waiting, waiting...\n OH! I got an e-mail from Christian! Who knew Dark Ones were Internet savvy? He said he was going to send me a sneak peak at Book Thirteen, and was even going to name a heroine after me. Too cool, huh? I hope you\u0027re doing everything you can to find his Beloved, although I don\u0027t have a clue how you\u0027re going to go about it. Maybe you should put an ad in a London paper asking to interview single women? Or how about this - write a book about vampires so steamy that it will bring Christian\u0027s Beloved out of the woodwork. I even have a title for you: A Girl\u0027s Guide to Vampires. Brilliant, huh? Yeah, I know. I should be in marketing.\n Work is the same old same old, no fun without you, but I\u0027m not crying in my coffee. Want to know why? Ha! I just bet you do. Keep waiting. That\u0027s a hoot what your mom said about Bradley, BTW. I always said he was no good. I hope they take his license away. There\u0027s just no excuse for drunk drivers! Can we say LOSER? Sure we can!\n Rats, it\u0027s after five. I have to go. I\u0027m flying out to Rio tonight. RIO! As in, de Janeiro! You\u0027re dying to know why, aren\u0027t you? OK, I\u0027ll spill, but only because you\u0027re my best friend, even if you did leave me to shack up with a guy halfway around the world. You\u0027ll notice I\u0027m not screaming about this. Why, you must be asking yourself, would dear sweet old Rox be so calm and collected?\n I\u0027ll tell you why - Captain Richard Blaine. That\u0027s captain as in airline captain. Richard was deadheading on the flight home from Frankfurt, and sat next to me, and we talked, and I spilled my screwdriver on him, and one thing led to another, and... well... let\u0027s just put it this way: Miranda is two for two, Joyful.\n Can I have my condoms back, please?\n Will e-mail you when I get back from the land of sun and samba. Kisses and hugs to the big guy!\n Roxy the no longer pure \n","sourceLink":"https://allnovel.net/a-girl-s-guide-to-vampires-dark-ones-1/page-20.html","bookId":2190,"book":{"id":2190,"title":"A Girl\u0027s Guide to Vampires (Dark Ones #1)","description":"Storyline: \n A Girl\u0027s Guide to Vampires (Dark Ones #1) \n All Joy Randall wants is a little old-fashioned romance, but when she participates in a \"Goddess evoking\" ceremony with her friend, Roxy, Joy finds out her future true love is a man with the potential to put her immortal soul in danger. At first the ever-practical Joy is ready to dismiss her vision as a product of too much gin and too many vampire romances, but while traveling through the Czech Republic with Roxy, Joy begins to have some second thoughts about her mystery lover because she is suddenly plagued by visions of a lethally handsome stranger. Then, when she and Roxy attend a local GothFaire, Joy meets Raphael Griffin St. John, head of security, and she becomes even more bewildered because the dark and dangerous Raphael seems too close to her dreams for comfort.\n \n","cover":"https://allnovel.net/images/a-girl-s-guide-to-vampires-dark-ones-1.jpg","author":"Katie MacAlister","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/a-girl-s-guide-to-vampires-dark-ones-1.html","creation":"Oct 5, 2019 8:58:26 AM","modification":"Oct 5, 2019 6:54:15 PM"}}
