{"id":72999,"no":25,"title":"Page 25","content":"Everyone in the class scribbled notes. Suddenly Emma felt a buzz inside her bag. She inched her fingers into the purse until she felt the iPhone’s smooth sides. Anything would be a welcome distraction from Mrs. Frost’s obsessive retelling of Medea. Something about the forcefulness of the English teacher’s literary interpretations made Emma wonder if Mrs. Frost had had a less than faithful husband. “Miss Mercer?” a voice snapped. Emma looked up and saw Mrs. Frost standing right over her desk. She waved her tattered copy at Emma. “Drop the phone right now, or I take it for the rest of the year.” Emma raised both empty palms in the air. “I surrender.” Everyone giggled. Fortunately the bell rang right then, and English was the last class of the day. Emma fled into the hall, checking the iPhone screen for who had called. Even after all this time, even knowing what she knew, she still carried around a tiny seedling of hope that the incoming message might be from Sutton. But it was just an email from Sutton’s mom. FINAL BIRTHDAY PARTY MENU was the subject. Emma scanned the list of crudités, appetizers, and desserts. LOOKS FINE, she began to write back, but then she noticed carrot cake cupcakes on the list. Carrot cake had always grossed her out—the raisins in the cake mix made her think of gerbil poop. MAKE THEM RED VELVET INSTEAD, she tapped on the screen. The halls swarmed with students emptying out their lockers and kids in sports uniforms rushing to games. A knot of girls Emma didn’t recognize stood in the corner near the trophy case, whispering. Emma glanced quickly around the hall, her heart jumping whenever she saw blond hair that looked like Laurel’s or a willowy frame like Madeline’s. She’d avoided Sutton’s friends and her sister all day, claiming she had a photography project to work on at lunch—“Photoshopping unibrows on yearbook portraits again, Sutton?” Charlotte had joked—and ignoring their snarky texts and IMs. The idea of facing them right now made her skin itch. Why would Laurel have been wearing Sutton’s locket? And how come Madeline had taken that picture? Was it like some kind of trophy? Emma ducked into the girls’ bathroom to splash some water on her face. Just as she reached for a paper towel, a hand touched her shoulder. Emma yelped and turned around. “God.” Nisha stood next to her at the sink, shielding her face with her hand. “Jumpy much?” Emma turned back and shakily twisted on the tap. “Oh. What’s up?” Nisha raised a piece of hair behind her ear. “Did you forget already?” “Forget what?” Nisha placed her hands on her hips. She stared at Emma with disdain. “Decorating the lockers? The thing all captains do at the start of every year?” Emma blinked. How was she supposed to know that? “Uch.” Nisha made a frustrated noise at the back of her throat. “You know, some of us can’t do all of the work by ourselves. Some of us have college applications to fill out.” Emma shot up. Whoa. “I want to go to college,” she said indignantly. “I want to go to USC.” Nisha paused for a moment, as if waiting for the punch line. Then she burst out laughing. “That’s the funniest thing I’ve heard all day.” She shoved open the bathroom door and started down the hall toward the sports locker room. Emma followed. Nisha walked briskly. Her ponytail swished back and forth, and her hands were clenched into tight fists. They darted down the stairs and whizzed past Jason and Kendra, the pimply couple who were always making out in the little alcove under the risers. As they passed, Emma noticed that Jason’s hand had disappeared up Kendra’s shirt. Nisha strode into the sports locker room, marching past the girls changing into swimsuits, fencing uniforms, and cheerleading skirts and heading straight into a small private office. Stacks of construction paper, Crayola markers, brightly colored sand, and stickers occupied most of a wide, dented table. A pot of red glitter had tipped over, spilling tiny sparkly shards all over the floor. It made Emma think of fairy blood. Twenty-five individual name tags, one for each girl on the tennis team, had been laid out in the middle of the table. Brooklyn Killoran’s name was in pink bubble letters and surrounded by shooting-star stickers. A black piece of construction paper displayed Isabella McSweeny’s name in glow-in-the-dark paint. Nisha had drawn flowers sprouting out of each of the letters in Laurel’s name and a loopy scribble around the border. And then Emma noticed Sutton’s tag, her name written in plain font on a white square. There was no glitter or puff paint or stickers that said YOU GO, GIRL or ACE! It could’ve been a name tag on a jail cell. “I’m basically done.” Nisha picked up the name tag closest to her, one for a girl named Amanda Pfeiffer. “But you can help hang these on the lockers, if you think you can handle that.” “When did you make them?” Emma asked. “Over the weekend.” Nisha flicked a piece of glitter off her wrist. “Why didn’t you ask me to help?” Nisha stared at Emma for a moment, and then let out a shrill witch laugh. “As if I would ask you to help me with anything.” She yanked a name tag off the table, sending a few crayons to the floor. As Nisha walked down the tennis aisle, Emma noticed that tiny specks of red fake blood from last week’s prank still covered the walls, lockers, and floor. Nisha stood squarely on top of one patch as she pinned her own name tag—drawn out of interlocking tennis rackets—on her locker door. Emma bit her lip. “I’m sorry about what we did last week.” Nisha moved calmly to the next locker and hung up Bethany Howard’s name tag. “Whatever,” she said airily. “You didn’t deserve it,” Emma went on. She wanted to add that perhaps she didn’t deserve Nisha sticking her with a child-sized tennis uniform last week, but maybe that was pushing it. Nisha ripped off a new piece of masking tape, then whipped around to face Emma again. Her eyes were wild. “Your stupid fake blood ruined my favorite tennis fleece.” She pointed hard at Emma’s chest. “It was my mom’s fleece. I had to throw it away because of you.” Emma took a step away, flattening someone’s mouth guard with her shoe. But as Nisha stood there, seething, Emma realized there wasn’t just anger in her voice. There was pain. With her shoulders hunched and her mouth puckered, Nisha looked small and young. Emma wondered how Nisha’s mom had died. It was the kind of question Old Emma would have asked. So many foster kids had lost parents. And even though she could never be sure what had become of Becky, sometimes Emma felt as though she was one of those kids. Sometimes, although it made her feel guilty to admit it even to herself, she wished Becky had died, because that would have meant she hadn’t chosen to leave Emma. I felt my own guilty pang, for all that I obviously had in my life but seemed to have taken for granted. There had been loss all around, but death hadn’t seemed like something that could touch a girl like me. How wrong I was. Sighing, Emma picked up Sutton’s drab name tag and taped it to her outer locker door. It looked pathetic next to the other bright, cheery name tags on either side. After a moment, she pulled the handle and looked at the contents of Sutton’s tennis locker again. The shiny varsity jacket hung from a hook. An empty bottle of Propel water lay crumpled at the bottom. There was a balled-up pair of gym socks on the upper shelf, crusted over with sweat. Emma wished she could tell Nisha she’d lost her mom, too. Nisha ripped off more tape and silently hung up more signs. Emma went to shut the locker, but then she paused. Something bulged in the front pocket of the varsity jacket. After a moment, she reached in and pulled out a large folded paper napkin. On the inside was a note written in sloppy, boyish handwriting: Hi Laurel! And then there was a drawing of a smiley face with googly drunk eyes and a lolling tongue holding a frothy mug of beer. It was signed Thayer. “What’s that?” Emma whirled around. Nisha stood right beside her, her Altoid breath icy on Emma’s neck. Emma moved to fold up the napkin before Nisha could see it, but Nisha’s eyes had already narrowed, reading the words. “So you steal your sister’s mail, too?” Emma blinked hard. “I . . .” Nisha shook her finger at Emma. “I heard Laurel was ready to kill you for what you did.” “Kill me?” Emma repeated. She thought of the picture of Laurel wearing Sutton’s necklace on Madeline’s iPhone. Nisha watched her carefully. A tiny sparkle stuck to her cheek glinted in the overhead light. “Don’t play dumb, Sutton. You knew Laurel had a thing for him.” Emma blinked. But before she could say anything more, Nisha spun on her heel and walked back to the office, leaving a trail of red glitter in her wake. And leaving Emma and me reeling, desperate to know more. Chapter 24 DOESN’T EVERY GIRL THINK HER SISTER WANTS TO KILL HER? On Thursday, after yet another terrible tennis practice, Emma sat on Sutton’s bed with a notebook and pencil on her lap. Top story, she wrote. Sister Tries to Track Down Twin’s Murderer. Too Intense for Words. She dropped the pencil on the mattress and shut her eyes. She’d hoped writing this out like a news headline might put it in perspective, make it seem more normal. Nothing about this was normal though. Instead she wrote another list about Sutton’s friends and the potential motives each of them had to kill her. She’d probably composed ten versions of the same list so far, scrawled on notebooks, crumpled in trash cans, written in shorthand on Sutton’s iPhone, which was somehow the most ironic of all. The problem was, every single member of the Lying Game had motives—Charlotte because Sutton had stolen Garrett. Laurel because Sutton . . . well, she’d done something to Thayer. Had that same something pissed off Madeline, too? Emma’s old cell phone bleeped from its hiding spot under the bed. She set the notebook aside and reached down to retrieve it. After using a new iPhone, her BlackBerry struck her as old and banged-up. It was like seeing a stray mutt on the street after spending time only with shiny show dogs. Alex had sent her a text: EVERYTHING OKAY IN SISTER LAND? SURE, Emma replied. She didn’t even itch from lying anymore. She and Alex had texted a few more times during the week, and Emma hadn’t revealed a single thing about what was really happening. As far as Alex knew, Emma was staying with the Mercers while she and Sutton got to know each other, just like a fairy tale. A note pinged back into Emma’s inbox immediately: WHAT ABOUT THE STUFF YOU STASHED IN THE STORAGE LOCKER? YOU GOING TO GET IT, OR DO YOU WANT ME TO SHIP IT TO YOU? Emma flopped back on the bed and scrunched up her face. She had no idea what to do with that stuff in the locker—especially the money. CAN LEAVE IT THERE FOR NOW, she wrote back. Just then, the bedroom door slowly opened. Emma wheeled back on the bed, shoving the BlackBerry under a pillow. Laurel appeared in the doorway. Mrs. Mercer stood behind her, a laundry basket in her arms. “Whatcha doin’?” Laurel asked, walking into the room.","sourceLink":"https://allnovel.net/the-lying-game-the-lying-game-1/page-25.html","bookId":2393,"book":{"id":2393,"title":"The Lying Game (The Lying Game #1)","description":"Storyline: The Lying Game (The Lying Game #1) I had a life anyone would kill for. Then someone did. The worst part of being dead is that there\u0027s nothing left to live for. No more kisses. No more secrets. No more gossip. It\u0027s enough to kill a girl all over again. But I\u0027m about to get something no one else does--an encore performance, thanks to Emma, the long-lost twin sister I never even got to meet. Now Emma\u0027s desperate to know what happened to me. And the only way to figure it out is to be me--to slip into my old life and piece it all together. But can she laugh at inside jokes with my best friends? Convince my boyfriend she\u0027s the girl he fell in love with? Pretend to be a happy, care-free daughter when she hugs my parents goodnight? And can she keep up the charade, even after she realizes my murderer is watching her every move? From Sara Shepard, the #1 New York Times bestselling author of the Pretty Little Liars books, comes a riveting new series about secrets, lies, and killer consequences. Let the lying game begin.","cover":"https://allnovel.net/images/the-lying-game-the-lying-game-1.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-lying-game-the-lying-game-1.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:26:03 AM"}}
