{"id":73000,"no":26,"title":"Page 26","content":"Heat rose to Emma’s cheeks. “Have you ever heard of knocking?” Laurel’s face fell. “Sorry.” “Be nice, Sutton,” Mrs. Mercer scolded. She marched over to Sutton’s chest of drawers and dropped a stack of clothes next to the TV. Among them was Emma’s striped dress. Emma wanted to thank her—she hadn’t had anyone wash clothes for her in years—but she had a feeling this was probably something Mrs. Mercer did for Sutton all the time. Laurel remained after Mrs. Mercer padded out of the room. Emma smoothed her hair behind her ears. Adrenaline coursed through her veins, and her hands began to tremble. All she could think of was that picture of Laurel wearing Sutton’s necklace. “What do you want?” she asked. “I wanted to know if you were ready to get mani-pedis at Mr. Pinky.” Laurel clasped her hands at her waist. “If you still want to go, that is.” Emma gazed blankly at the white-and-pink egg chair in the corner. It was still covered with the bikinis and socks Sutton had left there before she died; Emma hadn’t had the heart to move any of it. After Nisha’s elusive comment last night, she’d logged into Sutton’s Facebook account and searched Laurel’s page once more. Emma had figured Laurel and Thayer were friends, but she hadn’t guessed that Laurel had a crush on him. As she looked back at the pictures though, it was obvious. In all the group shots, Laurel stood next to Thayer. In a shot where Thayer laughed at something with Charlotte, Laurel lurked in the background looking at Thayer. A YouTube link showed Thayer and Laurel dancing a tango at a school formal. When Thayer dipped Laurel low, Laurel had a delighted, enchanted smile on her face. It was a smile of someone who wanted something more than just friendship. But in May, a month before Thayer allegedly ran away, the Wall messages between the two of them abruptly stopped. There were no more pictures of Laurel and Thayer together. It was as though something—or someone—had forced them apart. Don’t play dumb, Sutton, Nisha had said. You knew she had a thing for him. And there was the entry in Sutton’s journal from May 17: L is still ruined over T. Pull yourself together, bitch. He’s just a guy. T obviously stood for Thayer. There were no easy answers, though. It wasn’t as if anyone had written what exactly had happened. And it certainly wasn’t like I remembered. I hoped I hadn’t done something to hurt my little sister, but I really didn’t know. Emma watched Laurel as she picked up a bottle of perfume from Sutton’s dresser and sniffed the top. She smiled pleasantly, as if she didn’t have a mean cell in her body. Then Emma thought about the crane Laurel had placed at Emma’s plate last week. Maybe she was jumping to conclusions. Just because Nisha said Laurel would kill her didn’t mean she actually had. It’s just something people say. And maybe there was a good reason Laurel was wearing Sutton’s locket in that picture on Madeline’s phone. The same locket that now hung around Emma’s neck. “Let me put on jeans,” Emma decided. Laurel smiled. “Meet you downstairs.” Just as she was halfway across the room to the door, Laurel paused and widened her eyes at something on the bed. “What’s that?” Emma followed her gaze and panicked. Her notebook lay face-up on the mattress. Scrawled across the top sheet were the words Girl Strangled in Mansion. Thinks Friends to Blame. She grabbed for the notebook and covered it with her hand. “Just a project for school.” Laurel paused for a moment. “You don’t do projects for school!” She shook her head and walked out of the room. But before she stepped down the stairs, she cast one more glance at Emma. From where I watched it was hard to tell if it was questioning . . . or something more. Mr. Pinky was a small salon tucked into the foothills, in a complex that also contained an organic yogurt shop, a holistic cat daycare, and a place that advertised ULTRA-CLEANSE COLONICS! LOSE FIVE POUNDS IN MINUTES! in the front window. At least Laurel hadn’t dragged her there. The salon was part upscale spa, part Star Trek. All the nail technicians wore formfitting jumpsuits that were supposedly trendy, but Emma thought they looked ready to board a starship and fly the whole salon to the Crab Nebula. Emma and Laurel plopped down on a sleek gray couch to wait. “So are you ready for your party?” Laurel pulled ChapStick out of her bag and smeared it over her lips. “I guess,” Emma lied. More RSVP cards had been waiting in Sutton’s bedroom when she came home from tennis today. All of them said things like Can’t wait! and The party of the year! “You’d better be.” Laurel nudged her in the ribs. “You’ve been planning it for long enough! So has Garrett told you what he’s getting you yet?” Emma shook her head. “Why? Has he told you?” Laurel’s smile broadened knowingly. “Nah. But I’ve heard rumors. . . .” Emma pinched a handful of fabric on the couch. What was the big deal with Garrett’s present? Nail dryers hummed across the room. The smell of polish remover and aloe hand lotion filled the air. Emma reached into her bag and touched the napkin from Thayer. Her stomach streaked with nerves. She’d intended to bring it up at the end of the manicures, but she couldn’t wait any longer. “Laurel?” Laurel looked up and smiled. Emma placed the napkin on the empty cushion between them. “I found this in my tennis locker.” A wrinkle formed between Laurel’s eyes as she gazed at Thayer’s drunk smiley face. Her fingers worked a tiny hole in her jeans. There was a sharp rip, and the hole suddenly, forcefully, split open. “Oh,” she whispered. “I’m really sorry.” Emma’s voice shook. “I don’t know how it got there.” It wasn’t technically a lie. Laurel balled the note in her hands and stared blankly at the rainbow-colored bottles of nail polish on the shelf. Emma gripped the arm of the couch hard. Would Laurel explode? Scream? Come after her with nail scissors? “No biggie,” Laurel finally said. “It’s not like I don’t have a million notes exactly like that from Thayer in my room.” Then she calmly pulled out her iPhone and checked her email. “Do you miss him?” Emma blurted. Laurel continued to tap her iPhone. “Of course.” Her voice didn’t rise or dip. It was as though they were talking about the differences between creamy peanut butter and crunchy. Then she nodded at the Snapple bottle Emma had taken from the Mercer fridge. “Mind if I have some?” Emma shrugged, and Laurel took a long sip. As soon as she set the bottle back on the coffee table, her shoulders began to convulse. Her head jerked back, and she tipped over on the couch. She clutched her throat and stared at Emma with frightened, bulging eyes. “I . . . can’t . . .” Emma shot to her feet. “Laurel?” Laurel made a choking sound, flopped once, and went limp. Her blond hair fanned out on the couch cushion. Her right hand spasmed. “Laurel?” Emma shouted. “Laurel?” She shook her shoulders. Laurel’s eyes were glued closed. Her mouth hung open limply. The iPhone she’d been holding slowly released from her grip and clonked to the carpet. “Help!” Emma called out. She bent down and listened for breathing. No sounds escaped from Laurel’s lips. She pressed her fingers to Laurel’s wrist. It felt like there was a pulse. “Wake up,” she urged, shaking her. Laurel’s head bobbed like a rag doll. Her chunky silver bracelets jangled together. Emma leapt to her feet and looked around. A black girl stared at them from a pedicure chair across the room, Vogue in her lap. A small Spanish woman rushed over. “What’s the matter with her?” “I don’t know,” Emma said frantically. “Is she pregnant?” the woman suggested. “I don’t think so. . . .” “Hey.” The Spanish woman jostled Laurel’s arm. “Hey!” she yelled in her face, slapping her cheek. Emma put her ear to Laurel’s mouth again. The mouth-to-mouth unit of the babysitter training class she’d taken in sixth grade rushed to her mind. Did you pinch the nose then breathe into the mouth, or the other way around? Then something cold and wet touched her earlobe. Emma pulled back in alarm. Was that . . . a tongue? She stared at Laurel’s face. And then, suddenly, Laurel’s eyes popped open. “Boo!” Emma screamed. Laurel exploded with giggles. “I totally had you! You thought I was dead!” The lady made a tsk sound with her tongue. “You had all of us! What’s wrong with you?” She stormed away, shaking her head. Emma sat back up. Her heart felt like a flag flapping crazily in the wind. Laurel adjusted her T-shirt, color rising to her cheeks. “You’ve taught me well, sis. But I never thought I’d get you with something so easy!” And then she stood, slid her purse over her shoulder, and cruised to the wall of nail polishes to choose the color for her manicure. Emma stared at Laurel’s straight, slender back, her head spinning. That certainly was an innovative way to change the subject from Thayer. But something unsettled her, too. A girl whose older sister did something to ruin her chances with her crush didn’t just shrug it off with a laugh and a prank. If someone had done that to Emma, she’d tell them off. Fight back. Retaliate. And then Emma raised her head. The hot lights above scorched her scalp. She could think of one reason Laurel might not be angry anymore. I thought it at the exact same time, too: Maybe Laurel had already gotten her revenge. Chapter 25 A LATE ADDITION TO THE GUEST LIST “I’d like to solve the puzzle, Pat,” a constantly smiling soccer mom said on TV. The screen switched to a shot of the Wheel of Fortune board. All of the letters of THING had been filled in except for one. “Picking fresh flowers?” Triumphant music played as Vanna turned the final letter. Soccer mom jumped up and down, ecstatic that she’d won nine hundred dollars. It was late Thursday evening, and Emma was watching a Wheel rerun on the Game Show Network from Sutton’s bed. Wheel of Fortune usually calmed her down. It reminded her of watching it with Becky on the tattered La-Z-Boy—she could almost smell the Burger King takeout and hear Becky calling out the answers and critiquing Vanna’s sequined ball gown. But now all Emma could think of when she saw that wheel on the screen was how it seemed like a metaphor for her life—a wheel of chance. Risk or reward. One twin getting the good life, one twin getting the bad. One twin dying, the other twin living. The living twin choosing either to go after the person she was almost certain had killed her sister . . . or slip quietly away. Laurel killed Sutton. The thought flashed into her mind every couple of seconds, giving her a fresh scare each and every time. She felt positive it was true. All signs had pointed to Charlotte before, but now Laurel seemed like the only answer. When she got home from the nail salon, she’d searched for more clues, and too much connected: Sutton’s Facebook account was on Autofill, which meant Laurel could’ve sneaked into Sutton’s room, logged in, found the message from Emma, and written an eager note back, summoning Emma here. And then there was the SUTTON’S DEAD note Laurel had found on her car. Besides the bit of pollen on the corner, the paper didn’t have any creases, folds, or dirt marks like it should have if Laurel had really dug it out from under a windshield wiper. And Emma hadn’t actually seen the note on Laurel’s car—who was to say Laurel hadn’t lied about someone leaving it there? She just as easily could have pulled it out of her bag.","sourceLink":"https://allnovel.net/the-lying-game-the-lying-game-1/page-26.html","bookId":2393,"book":{"id":2393,"title":"The Lying Game (The Lying Game #1)","description":"Storyline: The Lying Game (The Lying Game #1) I had a life anyone would kill for. Then someone did. The worst part of being dead is that there\u0027s nothing left to live for. No more kisses. No more secrets. No more gossip. It\u0027s enough to kill a girl all over again. But I\u0027m about to get something no one else does--an encore performance, thanks to Emma, the long-lost twin sister I never even got to meet. Now Emma\u0027s desperate to know what happened to me. And the only way to figure it out is to be me--to slip into my old life and piece it all together. But can she laugh at inside jokes with my best friends? Convince my boyfriend she\u0027s the girl he fell in love with? Pretend to be a happy, care-free daughter when she hugs my parents goodnight? And can she keep up the charade, even after she realizes my murderer is watching her every move? From Sara Shepard, the #1 New York Times bestselling author of the Pretty Little Liars books, comes a riveting new series about secrets, lies, and killer consequences. Let the lying game begin.","cover":"https://allnovel.net/images/the-lying-game-the-lying-game-1.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-lying-game-the-lying-game-1.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:26:03 AM"}}
