{"id":73001,"no":27,"title":"Page 27","content":"Laurel had been at Charlotte’s sleepover, too. She’d slept next to Emma in Charlotte’s cavernous bedroom, which would’ve made it easiest for her to see when Emma had gotten up for a drink. She could’ve crept downstairs and strangled Emma with Sutton’s locket. And speaking of that locket, there was the photo of Laurel wearing the locket on Madeline’s phone. It looked identical to the one that now hung around Emma’s neck.\n They looked identical to me, too. I thought about the memories I now possessed. How I had flown off the handle so quickly and thrown her copycat necklace into the darkness. Laurel’s shattered expression. Then I thought about those hands grabbing me and shoving me into the car. The trunk had been tiny and cramped, probably about the size of Laurel’s Jetta.\n But I kept returning to the flickering memory of Laurel and me giggling together at the La Paloma pool. Holding hands. Friends. What had driven us apart? Why hadn’t I tried to rekindle that relationship? I didn’t want to believe Laurel could’ve murdered me. And what about the shock of red hair I’d seen through my blindfold when the assailant pulled me from the trunk? Had my eyes been playing tricks on me?\n Emma rose from the bed and started pacing around the room. She didn’t have any solid proof yet, but the snuff film had to be from the night Sutton died. It made sense. Maybe when Laurel pulled the blindfold off Sutton’s head and discovered she wasn’t dead, she’d wrapped the necklace back around her sister’s neck and finished the job. Maybe the actual murder happened after the video ended. . . . If only the video were still online—it would be enough to make the police believe that what Emma was telling them was true. And how had that video gotten online anyway? Why would the killer post something that would seal her own doom?\n Unless of course Laurel posted it online to attract Emma. Maybe she somehow knew that her adopted sister had a twin. And maybe she knew the video would reach Emma . . . and Emma would reach out. It had worked.\n Emma placed her palms against the smooth white walls. Muffled music sounded from Laurel’s bedroom next door. For all Emma knew, Laurel could be inside her room right now plotting what to do next. She walked over to the TV and shut it off. All of a sudden, it felt dangerous to linger so close to the killer. She felt like a prisoner in this room—a prisoner in her dead sister’s life. She yanked the door open and started down the stairs. Just as she was about to pull open the front door, someone cleared his throat behind her. “Where are you going?”\n Emma turned. Mr. Mercer sat in the office off the foyer, tapping away on a netbook. There was a Bluetooth earpiece in his ear. “Uh, out for a walk,” Emma said.\n Mr. Mercer peered at Emma over his glasses. “It’s after nine. I don’t like you wandering around outside alone in the dark.”\n The corners of Emma’s mouth jerked into a smile. Foster parents never cared when she came and went. They never worried about her safety. Even Becky let Emma walk around at night—if they were staying in a motel, she sent little Emma out to the vending machines to get her Mountain Dew and goldfish crackers.\n Then again, he wasn’t worried about Emma’s safety. He was worried about his daughter, Sutton. Emma couldn’t bear to meet his eyes, knowing that his daughter was far from safe, and it might all be due to his other daughter. Emma had to get the hell out of there. She spied Sutton’s tennis racket leaning against the hall closet and grabbed it. “I need to practice my serve.”\n “Fine.” Mr. Mercer turned back to the computer screen. “But I want you back home in an hour. We still need to discuss the ground rules for your party.”\n “Okay,” Emma called out. She slammed the door and jogged down the center of the street. Everyone had dragged their large green trash cans to the curb, and the air smelled like rotting vegetables and dirty diapers. The farther she got from Sutton’s house, the better—safer— she felt. She stopped at the park, noticing the faintest outline of a familiar figure lying in an X on the tennis courts. Her heart lifted.\n “Ethan?” Emma called out. Ethan shot up at the sound of his name. “It’s Sutton!”\n “Fancy meeting you here.” It was too dark to see Ethan’s face, but Emma detected happiness in his voice. She suddenly felt happier, too.\n “Can I join you?” she asked.\n “Sure.”\n She opened the chain-link gate without jamming quarters into the meter to turn on the lights. The door slammed shut with a bang. She felt Ethan’s gaze on her as she walked to the net and lay down next to him. The court was still warm from the heat of the day and smelled faintly of baked asphalt and spilled Gatorade. The stars above glinted like bits of quartz in a sidewalk. The Mom, Dad, and Emma stars pulsed just below the moon. It was frustrating that even after so much had changed, the stars were in exactly the same place they’d always been, laughing at Emma’s futile struggles on earth.\n Tears welled in Emma’s eyes. Futile struggles was right. All the fantasies she’d concocted in her mind on the bus ride here. All the fun she thought she and Sutton would have as sisters.\n “You okay, Sylvia Plath?” Ethan teased.\n The air had grown colder, and Emma pulled her arms closely into her sides for warmth. “Not really.”\n “What’s up?”\n Emma ran her tongue over her teeth. “God, whenever I see you I’m a complete mental case.”\n “It’s cool. I don’t mind mental cases.”\n But Emma shook her head. She couldn’t tell him what was really going on, no matter how much she wanted to. “It’s my birthday tomorrow,” she said instead. “I’m having a party.”\n “Really?” Ethan propped himself up on one hand. “Well, happy birthday.”\n “Thanks.” Emma smiled in the darkness.\n She tracked a slow-moving jet as it sliced across the night sky. In some ways, this would probably be the best birthday she’d ever had. Most of Emma’s birthdays had been nonevents—she’d spent her sixteenth in the social worker’s office waiting to get reassigned to a new foster home, and she’d spent her eleventh as a runaway with the kids at the campsite. The only real birthday celebration she’d had was when Becky had taken her to a Renaissance fair near where they lived. Emma had ridden Ye Olde Donkey in a slow circle, eaten a giant turkey leg, and made a construction-paper coat of arms in neon green and turquoise, her favorite colors at the time. On their way to the parking lot at the end of the day, Emma had asked if they could do this for her birthday again the next year. But by her next birthday, Becky was gone.\n Emma stared at the sky. A cloud passed over the moon, obscuring it for a moment. “Will you come?”\n “To what?”\n “To my party. I mean, if you’re not busy. And if you want to.” Emma bit her thumbnail. Her heart kicked in her chest. Asking him suddenly felt like a big deal.\n The moon illuminated Ethan’s angular profile. Emma waited patiently for him to decide. If he says no, don’t get upset, she told herself. Don’t take it personally.\n “Okay,” Ethan said.\n Emma’s stomach swooped. “Really?”\n “Yeah. Sure. I’ll come.”\n “Great!” Emma grinned. “You’ll be the only normal person there.”\n “I don’t know about that.” By the way he said it, Emma could tell Ethan was smiling. “I don’t think any of us are normal, do you? I think we all have crazy secrets.”\n “Oh yeah? What’s yours?”\n Ethan paused a moment. “I have a huge crush on Frau Fenstermacher.”\n Emma snickered. “That’s totally understandable. She’s so sexy.”\n “Yeah. I’m super-hot for her.”\n “Well, good luck with that,” Emma said. “I hope you two lovebirds find true happiness.”\n “Thanks.” Ethan shifted positions to lie back down, and his hand bumped hers. Emma stared at their two hands together, the fingers just touching. After a moment, Ethan curled his pointer finger around hers and squeezed once before pulling away.\n Suddenly, in the safe, close darkness, Emma’s insane, dangerous world felt as far away as the stars.\n Chapter 26\n A FACE FROM THE PAST\n Plink. Plink. Plink.\n Hours later, Emma woke from a dreamless sleep and looked around. What was that?\n Plink. She whipped around to the window that faced the front yard. A tiny pebble ricocheted off the glass and plummeted to the ground below. Emma ran to the window and looked down. A figure stood under the large floodlight by the front porch. Emma rubbed her eyes hard.\n “Mom?” she cried.\n She barely felt the stairs on her feet as she whipped down them. The door creaked when she flung it open and stepped into the night. Becky stood in the middle of the driveway next to Laurel’s car.\n I gawked at the woman on the driveway. This was the first time I’d ever seen our mother. She had chin-length, silky dark hair and blue-green eyes. Her body was thin—almost too thin—and she wore baggy jeans with a hole in the knee and a faded T-shirt that said THE CASUAL CLAM RESTAURANT. She would’ve been someone I’d just pass by on the street. I felt no connection to her, no instant bond. It didn’t feel real.\n But when Emma got to Becky, her arms went right through her body. She stepped back, blinking hard. “Mom?” she cried again. She tried to touch Becky, but it was as though she was made of vapor. Emma touched her own face to make sure she was still real. “What’s going on?”\n “It’s not what you think, honey,” Becky said in her gravelly smoker’s voice. “You have to be careful,” Becky added. “You have to be quiet. Things are about to get very dangerous.”\n “W-What do you mean?” Emma asked.\n “Shh.”\n “But—”\n Then Becky stepped forward and pressed her hand over Emma’s mouth. It felt like a real hand to Emma, solid and stable. “You need to do this for me.”\n Suddenly a vision flashed in my brain. I heard that same voice say, You need to do this for me, loud and clear. At least I thought it was the same voice. I wasn’t sure if the voice was speaking to me . . . or to someone else. But just as I was grappling to see this memory, it dissolved.\n All at once, Emma’s eyes popped open.\n She was in Sutton’s dark bedroom once more. The curtains fluttered in the breeze. The glass of water she’d filled before she went to sleep sat on the nightstand. The dream still pounded in her head. She sat up, and her vision cleared. There was a figure standing over her.\n Becky? Emma thought immediately. But this person’s hair was blond, not brown. Her nose turned up at the end, and freckles splashed across her cheeks. Emma stared straight into Laurel’s tourmaline-green eyes. Laurel’s hand clapped tightly over Emma’s mouth.\n “Scream!” I yelled frantically at Emma.\n That was just what Emma did. She kicked the sheets off and whacked her hands at Laurel’s arms. Laurel backed away, an astonished expression on her face. In seconds, the bedroom door opened and the Mercer parents burst inside. Mr. Mercer didn’t have a shirt on. Mrs. Mercer wore plaid pajama pants and a lacy tank top. Drake bounded in, too, emitting a few short, low barks. \n","sourceLink":"https://allnovel.net/the-lying-game-the-lying-game-1/page-27.html","bookId":2393,"book":{"id":2393,"title":"The Lying Game (The Lying Game #1)","description":"Storyline: \n The Lying Game (The Lying Game #1) \n I had a life anyone would kill for. \n Then someone did. \n The worst part of being dead is that there\u0027s nothing left to live for. No more kisses. No more secrets. No more gossip. It\u0027s enough to kill a girl all over again. But I\u0027m about to get something no one else does--an encore performance, thanks to Emma, the long-lost twin sister I never even got to meet. \n Now Emma\u0027s desperate to know what happened to me. And the only way to figure it out is to be me--to slip into my old life and piece it all together. But can she laugh at inside jokes with my best friends? Convince my boyfriend she\u0027s the girl he fell in love with? Pretend to be a happy, care-free daughter when she hugs my parents goodnight? And can she keep up the charade, even after she realizes my murderer is watching her every move? \n From Sara Shepard, the #1 New York Times bestselling author of the Pretty Little Liars books, comes a riveting new series about secrets, lies, and killer consequences. \n Let the lying game begin.\n \n","cover":"https://allnovel.net/images/the-lying-game-the-lying-game-1.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-lying-game-the-lying-game-1.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:26:03 AM"}}
