{"id":100306,"no":18,"title":"Page 18","content":"We construct our days, bit by bit, tenday by tenday, year by year. Our lives take on a routine, and then we bemoan that routine. Predictability, it seems, is a double-edged blade of comfort and boredom. We long for it, we build it, and when we find it, we reject it. Because while change is not always growth, growth is always rooted in change. A finished person, like a finished house, is a static thing. Pleasant, perhaps, or beautiful or admirable, but not for long exciting. King Bruenor has reached the epitome, the pinnacle, the realization of every dream a dwarf could fathom. And still King Bruenor desires change, though he would refuse to phrase it that way, admitting only his love of adventure. He has found his post, and now seeks reasons to abandon that post at every turn. He seeks, because inside of him he knows that he must seek to grow. Being a king will make Bruenor old before his time, as the old saying goes. Not all people are possessed of such spirits. Some desire and cling to the comfort of the routine, to the surety that comes with the completion of the construction of life\u0027s details. On the smaller scale, they become wedded to their daily routines. They become enamored of the predictability. They calm their restless souls in the confidence that they have found their place in the multiverse, that things are the way they are supposed to be, that there are no roads left to explore and no reason to wander. On the larger scale, such people become fearful and resentful - sometimes to extremes that defy logic - of anyone or anything that intrudes on that construct. A societal change, a king\u0027s edict, an attitude shift in the neighboring lands, even events that have nothing to do with them personally can set off a reaction of dissonance and fear. When Lady Alustriel initially allowed me to walk the streets of Silverymoon openly, she found great resistance. Her people, well protected by one of the finest armies in all the land and by a leader whose magical abilities are renowned throughout the world, did not fear Drizzt Do\u0027Urden. Nay, they feared the change that I represented. My very presence in Silvery-moon infringed upon the construct of their lives, threatened their understanding of the way things were, threatened the way things were supposed to be. Even though, of course, I posed no threat to them whatsoever. That is the line we all straddle, between comfort and adventure. There are those who find satisfaction, even fulfillment, in the former, and there are those who are forever seeking. It is my guess, and can only be my guess, that the fears of the former are rooted in fear of the greatest mystery of all, death. It is no accident that those who construct the thickest walls are most often rooted firmly, immovably, in their faith. The here and now is as it is, and the better way will be found in the afterlife. That proposition is central to the core beliefs that guide the faithful, with, for many, the added caveat that the afterlife will only fulfill its promise if the here and now remains in strict accord with the guiding principles of the chosen deity. I count myself among the other group, the seekers. Bruenor, too, obviously so, for he will ever be the discontented king. Cattibrie cannot be rooted. There is no sparkle in her eyes greater than the one when she looks upon a new road. And even Regis, for all his complaints regarding the trials of the road, wanders and seeks and fights. Wulfgar, too, will not be confined. He has seen his life in Mithral Hall and has concluded, rightfully and painfully, that there is for him a better place and a better way. It saddens me to see him go. For more than a score of years he has been my friend and companion, a trusted arm in battle and in life. I miss him dearly, every day, and yet when I think of him, I smile for him. Wulfgar has left Mithral Hall because he has outgrown all that this place can offer, because he knows that in Icewind Dale he will find a home where he will do more good - for himself and for those around him. I, too, hold little faith that I will live out my days in Bruenor\u0027s kingdom. It is not just boredom that propels my steps along paths unknown, but a firm belief that the guiding principle of life must be a search not for what is, but for what could be. To look at injustice or oppression, at poverty or slavery, and shrug helplessly, or worse to twist a god\u0027s \"word\" to justify such states, is anathema to the ideal, and to me, the ideal is achieved only when the ideal is sought. The ideal is not a gift from the gods, but a promise from them. We are possessed of reason. We are possessed of generosity. We are possessed of sympathy and empathy. We have within us a better nature, and it is one that cannot be confined by the constructed walls of anything short of the concept of heaven itself. Within the very logic of that better nature, a perfect life cannot be found in a world that is imperfect. So we dare to seek. So we dare to change. Even knowing that we will not get to \"heaven\" in this life is no excuse to hide within the comfort of routine. For it is in that seeking, in that continual desire to improve ourselves and to improve the world around us, that we walk the road of enlightenment, that we eventually can approach the gods with heads bowed in humility, but with confidence that we did their work, that we tried to lift ourselves and our world to their lofty standards, the image of the ideal.","sourceLink":"https://allnovel.net/the-orc-king-transitions-1/page-18.html","bookId":2187,"book":{"id":2187,"title":"The Orc King (Transitions #1)","description":"Storyline: The Orc King (Transitions #1) An uneasy peace between the dwarves of Mithral Hall and the orcs of the newly established Kingdom of Many-Arrows can`t last long. The orc tribes united under Obould begin to fight each other, and Bruenor is determined to finish the war that nearly killed him and almost destroyed everything he`s worked to build. But it will take more than swords and axes to bring a lasting peace to the Spine of the World. Powerful individuals on both sides may have to change the way they see each other. They may have to start to talk. But it won`t be easy.","cover":"https://allnovel.net/images/the-orc-king-transitions-1.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-orc-king-transitions-1.html","creation":"Oct 5, 2019 8:58:26 AM","modification":"Oct 5, 2019 6:51:28 PM"}}
