{"id":100307,"no":19,"title":"Page 19","content":"Magical horses striding long, the fiery chariot cut a line of orange across the pre-dawn sky. Flames whipped in the driving wind, but for the riders they did not burn. Standing beside Lady Alustriel, Catti-brie felt that wind indeed, her auburn hair flying wildly behind her, but the bite of the breeze was mitigated by the warmth of Alustriel\u0027s animated cart. She lost herself in that sensation, allowing the howl of the wind to deafen her thoughts as well. For a short time, she was free to just exist, under the last twinkling stars with all of her senses consumed by the extraordinary nature of the journey.\\n\\n She didn\u0027t see the approaching silver line of the Surbrin, and was only vaguely aware of a dip in altitude as Alustriel brought the conjured chariot down low over the water, and to a running stop on the ground outside the eastern door of Mithral Hall.\\n\\n Few dwarves were out at that early hour, but those who were, mostly those standing guard along the northern wall, came running and cheering for the Lady of Silverymoon. For of course they knew it was she, whose chariot had graced them several times over the past few months.\\n\\n Their cheering grew all the louder when they noted Alustriel\u0027s passenger, the Princess of Mithral Hall.\\n\\n \"Well met,\" more than one of the bearded folk greeted.\\n\\n \"King Bruenor\u0027s not yet returned,\" said one, a grizzled old sort, with one eye lost and patched over, and half his great black beard torn away. Catti-brie smiled as she recognized the fierce and fiercely loyal Shingles McRuff, who had come to Mithral Hall beside Torgar Hammerstriker. \"Should be along any day.\"\\n\\n \"And be knowin\u0027 that ye\u0027re all welcome, and that ye\u0027ll find all the hospitality o\u0027 Mithral Hall for yerself,\" another dwarf offered.\\n\\n \"That is most generous,\" said Alustriel. She turned and looked back to the east as she continued, \"More of my people - wizards from Silverymoon - will be coming in throughout the morn, on all manner of flight, some self-propelled and some riding ebony flies, and two on broomsticks and another on a carpet. I pray your archers will not shoot them down.\"\\n\\n \"Ebony flies?\" Shingles replied. \"Flying on bugs, ye mean?\"\\n\\n \"Big bugs,\" said Catti-brie.\\n\\n \"Would have to be.\"\\n\\n \"We come armed with spells of creation, for we wish to see the bridge across the Surbrin opened and secure as soon as possible,\" Alustriel explained. \"For the sake of Mithral Hall and for all the goodly kingdoms of the Silver Marches.\"\\n\\n \"More well met, then!\" bellowed Shingles, and he led yet another cheer.\\n\\n Catti-brie moved toward the back edge of the chariot, but Alustriel took her by the shoulder. \"We can fly out to the west and seek King Bruenor,\" she offered.\\n\\n Catti-brie paused and looked that way, but shook her head and replied, \"He will return presently, I\u0027m sure.\"\\n\\n Catti-brie accepted Shingles\u0027s offered hand, and let the dwarf ease her down to the ground. Shingles was quick to Alustriel, similarly helping her, and the Lady, though not injured as was Catti-brie, graciously accepted. She moved back from her cart and motioned for the others to follow.\\n\\n Alustriel could have simply dismissed the flaming chariot and the horses made of magical fire. Dispelling her own magic was easy work, of course, and the fiery team and cart alike would have flared for an instant before they winked into blackness, a final puff of smoke drifting and dissipating into the air.\\n\\n But Lady Alustriel had been using that particular spell for many years, and had put her own flavor into it, both in the construction of the cart and team and in the dismissal of the magic. Figuring that the dwarves could use a bit of spirit-lifting, the powerful wizardess performed her most impressive variation of the dispelling.\\n\\n The horse team snorted and reared, flames shooting from swirling, fiery nostrils. As one, they leaped into the air, straight up, the cart lurching behind them. Some twenty feet off the ground, the many sinews of fire that held the form broke apart, orange tendrils soaring every which way, and as they reached their limits, exploded with deafening bangs, throwing showers of sparks far and wide.\\n\\n The dwarves howled with glee, and Catti-brie, for all of her distress, couldn\u0027t contain a giggle.\\n\\n When it ended a few heartbeats later, their ears ringing with the echoes of the retorts, their eyes blinking against the sting of the brilliant flashes, Catti-brie offered an appreciative smile to her friend and driver.\\n\\n \"It was just the enchantment they needed,\" she whispered, and Alustriel replied with a wink.\\n\\n They went into Mithral Hall side-by-side.\\n\\n Early the next morning, Shingles again found himself in the role of official greeter in the region east of the hall\u0027s eastern gate, for it was he who first caught up with the six adventurers returning from the place Bruenor had named Gauntlgrym. The old Mirabarran dwarf had directed the watch overnight, and was sorting out assignments for the workday, both along the fortifications on the northern mountain spur and at the bridge. No stranger to the work of wizards, Shingles repeatedly warned his boys to stay well back when Alustriel\u0027s gang came out to work their dweomers. When word came that King Bruenor and the others had returned, Shingles moved fast to the south to intercept them.\\n\\n \"Did ye find it, then, me king?\" he asked excitedly, giving voice to the thoughts and whispers of all the others around him.\\n\\n \"Aye,\" Bruenor replied, but in a tone surprisingly unenthusiastic. \"We found something, though we\u0027re not for knowing if it\u0027s Gauntlgrym just yet.\" He motioned to the large sack that Torgar carried, and the rolled tapestry slung over Cordio\u0027s shoulder. \"We\u0027ve some things for Nanfoodle and me scholars to look over. We\u0027ll get our answers.\"\\n\\n \"Yer girl\u0027s come home,\" Shingles explained. \"Lady Alustriel flew her in on that chariot o\u0027 fire. And the Lady\u0027s here, too, along with ten Silverymoon wizards, all come to work on the bridge.\"\\n\\n Bruenor, Drizzt, and Regis exchanged glances as Shingles finished.\\n\\n \"Me girl alone?\" Bruenor asked.\\n\\n \"With the Lady.\"\\n\\n Bruenor stared at Shingles.\\n\\n \"Wulfgar\u0027s not returned with \u0027em,\" the old Mirabarran dwarf said. \"Catti-brie said nothing of it, and I didn\u0027t think it me place to ask.\"\\n\\n Bruenor looked to Drizzt.\\n\\n \"He is far west,\" the drow said quietly, and Bruenor inadvertently glanced out that way then nodded.\\n\\n \"Get me to me girl,\" Bruenor instructed as he started off at a swift pace for Mithral Hall\u0027s eastern door.\\n\\n They found Catti-brie, Lady Alustriel, and the Silverymoon wizards not far down the corridor inside, the lot of them having spent the night in the hall\u0027s easternmost quarters. After a quick and polite greeting, Bruenor begged the Lady\u0027s pardon, and Alustriel and her wizards quickly departed the hall, heading for the Surbrin bridge.\\n\\n \"Where\u0027s he at?\" Bruenor asked Catti-brie when it was just the two of them, Drizzt, and Regis.\\n\\n \"You\u0027re knowing well enough.\"\\n\\n \"Ye found Colson, then?\"\\n\\n Catti-brie nodded.\\n\\n \"And he\u0027s taking her home,\" Bruenor stated.\\n\\n Another nod. \"I offered to journey with him,\" Catti-brie explained, and she glanced at Drizzt and was relieved to see him smile at that news. \"But he would not have me along.\"\\n\\n \"Because the fool ain\u0027t for coming back,\" said Bruenor, and he spat and stalked off. \"Durned fool son of an over-sized orc.\"\\n\\n Drizzt motioned to Regis to go with Bruenor, and the halfling nodded and trotted away.\\n\\n \"I think Bruenor is right,\" Catti-brie said, and she shook her head in futile denial, then rushed over and wrapped Drizzt in a tight hug and kissed him deeply. She put her head on his shoulder, not relenting a bit in her embrace. She sniffed back tears.\\n\\n \"He knew that Wulfgar would not likely return,\" Drizzt whispered.\\n\\n Catti-brie pushed him back to arms\u0027 length. \"As did yourself, but you didn\u0027t tell me,\" she said.\\n\\n \"I honored Wulfgar\u0027s wishes. He was not sure of where his road would lead, but he did not wish discussion of it all the way to Silvery-moon and beyond.\"\\n\\n \"If I had known along our road, I might\u0027ve been able to change his mind,\" Catti-brie protested.\\n\\n Drizzt gave her a helpless look. \"More the reason to not tell you.\"\\n\\n \"You agree with Wulfgar\u0027s choice?\"\\n\\n \"I think it is not my place to agree or to argue,\" Drizzt said with a shrug.\\n\\n \"You think it\u0027s his place to be deserting Bruenor at this time of - ?\"\\n\\n \"This time or any time.\"\\n\\n \"How can you say that? Wulfgar is family to us, and he just left...\"\\n\\n \"As you and I did those years ago, after the drow war when Wulfgar fell to the yochlol,\" Drizzt reminded her. \"We longed for the road and so we took to the road, and left Bruenor to his hall. For six years.\"\\n\\n That reminder seemed to deflate Catti-brie\u0027s ire quite a bit. \"But now Bruenor\u0027s got an army of orcs on his doorstep,\" she protested, but with far less enthusiasm.\\n\\n \"An army that will likely be there for years to come. Wulfgar told me that he could not see his future here. And truly, what is there for him here? No wife, no children.\"\\n\\n \"And it pained him to look upon us.\"\\n\\n Drizzt nodded. \"Likely.\"\\n\\n \"He told me as much.\"\\n\\n \"And so you wear a mantle of guilt?\"\\n\\n Catti-brie shrugged.\\n\\n \"It doesn\u0027t suit you,\" Drizzt said. He drew her in close once more, and gently pushed her head onto his shoulder. \"Wulfgar\u0027s road is Wulfgar\u0027s own to choose. He has family in Icewind Dale, if that is where he decides to go. He has his people there. Would you deny him the chance to find love? Should he not sire children, who will follow his legacy of leadership among the tribes of Icewind Dale?\"\\n\\n Catti-brie didn\u0027t respond for a long while then merely said, \"I miss him already,\" in a voice weak with sorrow.\\n\\n \"As do I. And so too for Bruenor and Regis, and all else who knew him. But he isn\u0027t dead. He did not fall in battle, as we feared those years ago. He will follow his road, to bring Colson home, as he sees fit, and then perhaps to Icewind Dale. Or perhaps not. It might be that when he is away, Wulfgar will come to realize that Mithral Hall truly is his home, and turn again for Bruenor\u0027s halls. Or perhaps he\u0027ll take another wife, and return to us with her, full of love and free of pain.\"\\n\\n He pushed Catti-brie back again, his lavender eyes locking stares with her rich blue orbs. \"You have to trust in Wulfgar. He has earned that from us all many times over. Allow him to walk whatever road he chooses, and hold confidence that you and I, and Bruenor and Regis, all go with him in his heart, as we carry him in ours. You carry with you guilt you do not deserve. Would you truly desire that Wulfgar not follow his road for the sake of mending your melancholy?\"\\n\\n Catti-brie considered the words for a few heartbeats, then managed a smile. \"My heart is not empty,\" she said, and she came forward and kissed Drizzt again, with urgency and passion.\\n\\n \"Whate\u0027er ye\u0027re needin\u0027, ye\u0027re gettin\u0027,\" Bruenor assured Nanfoodle as the gnome gently slid one of the parchment scrolls out of the sack. \"Rumblebelly here is yer slave, and he\u0027ll be running to meself and all me boys at the command o\u0027 Nanfoodle.\"\\n\\n The gnome began to unroll the document, but winced and halted, hearing the fragile parchment crackle.\\n\\n \"I will have to brew oils of preservation,\" he explained to Bruenor. \"I dare not put this under bright light until it\u0027s properly treated.\"\\n\\n \"Whate\u0027er ye need,\" Bruenor assured him. \"Ye just get it done, and get it done quick.\"\\n\\n \"How quick?\" The gnome seemed a bit unnerved by that request.\\n\\n \"Alustriel\u0027s here now,\" said Bruenor. \"She\u0027s to be working on the bridge for the next few days, and I\u0027m thinkin\u0027 that if them scrolls\u0027re saying what I\u0027m thinkin\u0027 they\u0027re saying, it might be good for Alustriel to go back to Silverymoon muttering and musing on the revelations.\"\\n\\n But Nanfoodle shook his head. \"It will take me more than a day to prepare the potions - and that\u0027s assuming that you have the ingredients I will require.\" He looked to Regis. \"Bat guano forms the base.\"\\n\\n \"Wonderful,\" the halfling muttered.\\n\\n \"We\u0027ll have it or we\u0027ll get it,\" Bruenor promised him.\\n\\n \"It will take more than a day to brew anyway,\" said Nanfoodle. \"Then three days for it to set on the parchment - at least three. I\u0027d rather it be five.\"\\n\\n \"So four days total,\" said Bruenor, and the gnome nodded.\\n\\n \"Just to prepare the parchments for examination,\" Nanfoodle was quick to add. \"It could take me tendays to decipher the ancient writing, even with my magic.\"\\n\\n \"Bah, ye\u0027ll be faster.\"\\n\\n \"I cannot promise.\"\\n\\n \"Ye\u0027ll be faster,\" Bruenor said again, in a tone less encouraging and more demanding. \"Guano,\" he said to Regis, and he turned and walked from the room.\\n\\n \"Guano,\" Regis repeated, looking at Nanfoodle helplessly.\\n\\n \"And oil from the smiths,\" said the gnome. He drew another scroll from the sack and placed it beside the first, then put his hands on his hips and heaved a great sigh. \"If they understood the delicacy of the task, they would not be so impatient,\" he said, more to himself than to the halfling.\\n\\n \"Bruenor is well past delicacy, I\u0027m guessing,\" said Regis. \"Too many orcs about for delicacy.\"\\n\\n \"Orcs and dwarves,\" muttered the gnome. \"Orcs and dwarves. How is an artist to do his work?\" He heaved another sigh, as if to say \"if I must,\" and moved to the side of the room, to the cabinet where he kept his mortar and pestle, and assorted spoons and vials.\\n\\n \"Always rushing, always grumbling,\" he griped. \"Orcs and dwarves, indeed!\"\\n\\n The companions had barely settled into their chambers in the dwarven hall west of Garumn\u0027s Gorge when word came that yet another unexpected visitor had arrived at the eastern gate. It wasn\u0027t often that elves walked through King Bruenor\u0027s door, but those gates were swung wide for Hralien of the Moonwood.\\n\\n Drizzt, Catti-brie, and Bruenor waited impatiently in Bruenor\u0027s audience chamber for the elf.\\n\\n \"Alustriel and now Hralien,\" Bruenor said, nodding with every word. \"It\u0027s all coming together. Once we get the words from them scrolls, we\u0027ll get both o\u0027 them to agree that the time\u0027s now for striking them smelly orcs.\"\\n\\n Drizzt held his doubts private and Catti-brie merely smiled and nodded. There was no reason to derail Bruenor\u0027s optimism with an injection of sober reality.\\n\\n \"We know them Adbar and Felbarr boys\u0027ll fight with us,\" Bruenor went on, oblivious to the detachment of his audience. \"If we\u0027re getting the Moonwood and Silverymoon to join in, we\u0027ll be puttin\u0027 them orcs back in their holes in short order, don\u0027t ye doubt!\"\\n\\n He rambled on sporadically for the next few moments, until at last Hralien was led into the chamber and formally introduced.\\n\\n \"Well met, King Bruenor,\" the elf said after the list of his accomplishments and titles was read in full. \"I come with news from the Moonwood.\"\\n\\n \"Long ride if ye\u0027ve come just to break bread,\" said Bruenor.\\n\\n \"We have suffered an incursion from the orcs,\" Hralien explained, talking right past Bruenor\u0027s little jest. \"A coordinated and cunning attack.\"\\n\\n \"We know yer pain,\" Bruenor replied, and Hralien bowed in appreciation.\\n\\n \"Several of my people were lost,\" Hralien went on, \"elves who should have known the birth and death of centuries to come.\" He looked squarely at Drizzt as he continued, \"Innovindil among them.\"\\n\\n Drizzt\u0027s eyes widened and he gasped and slumped back, and Catti-brie brought her arm across his back to support him.\\n\\n \"And Sunset beneath her,\" said Hralien, his voice less steady. \"It would appear that the orcs had anticipated her arrival on the field, and were well prepared.\"\\n\\n Drizzt\u0027s chest pumped with strong, gasping breaths. He looked as if he was about to say something, but no words came forth and he had the strength only to shake his head in denial. A great emptiness washed through him, a cold loss and callous reminder of the harsh immediacy of change, a sudden and irreversible reminder of mortality.\\n\\n \"I share your grief,\" Hralien said. \"Innovindil was my friend, beloved by all who knew her. And Sunrise is bereaved, do not doubt, for the loss of Innovindil and of Sunset, his companion for all these years.\"\\n\\n \"Durned pig orcs,\" Bruenor growled. \"Are ye all still thinkin\u0027 we should leave them to their gains? Are ye still o\u0027 the mind that Obould\u0027s kingdom should stand?\"\\n\\n \"Orcs have attacked the Moonwood for years uncounted,\" Hralien replied. \"They come for wood and for mischief, and we kill them and send them running. But their attack was better this time - too much so for the simplistic race, we believe.\" As he finished, he was again looking directly at Drizzt, so much so that he drew curious stares from Bruenor and Catti-brie in response.\\n\\n \"Tos\u0027un Armgo,\" Drizzt reasoned.\\n\\n \"We know him to be in the region, and he learned much of our ways in his time with Albondiel and Sinnafain,\" Hralien explained.\\n\\n Drizzt nodded, determination replacing his wounded expression. He had vowed to hunt down Tos\u0027un when he and Innovindil had returned Ellifain\u0027s body to the Moonwood. Suddenly that promise seemed all the more critical.\\n\\n \"A journey full o\u0027 grief is a longer ride by ten, so the sayin\u0027 goes,\" said Bruenor. \"Ye make yerself comfortable, Hralien o\u0027 the Moon-wood. Me boys\u0027ll see to yer every need, and ye stay as long as ye\u0027re wantin\u0027. Might be that I\u0027ll have a story for ye soon enough - one that\u0027ll put us all in better stead for ridding ourselves o\u0027 the curse of Obould. A few days at the most, me friends\u0027re tellin\u0027 me.\"\\n\\n \"I am a courier of news, and have come with a request, King Bruenor,\" the elf explained, and he gave another respectful and appreciative bow. \"Others will journey here from the Moonwood to your call, of course, but my own road is back through your eastern door no later than dawn tomorrow.\" Again he looked Drizzt in the eye. \"I hope I will not be alone.\"\\n\\n Drizzt nodded his agreement to go out on the hunt before he even turned to Catti-brie. He knew that she would not deny him that.\\n\\n The couple were alone in their room soon after, and Drizzt began to fill his backpack.\\n\\n \"You\u0027re going after Tos\u0027un,\" Catti-brie remarked, but did not ask.\\n\\n \"Have I a choice?\"\\n\\n \"No. I only wish that I were well enough to go with you.\"\\n\\n Drizzt paused in his packing and turned to regard her. \"In Menzoberranzan, they say, Aspis tu drow bed n\u0027tuth drow. \u0027Only a drow can hunt a drow.\u0027\"\\n\\n \"Then hunt well,\" said Catti-brie, and she moved to the side wardrobe to aid Drizzt in his preparations. She seemed not upset with him in the least, which was why she caught Drizzt completely off his guard when she quietly asked, \"Would you have married Innovindil when I am gone?\"\\n\\n Drizzt froze, and slowly mustered the courage to turn and look at Catti-brie. She wore a slight smile and seemed quite at ease and comfortable. She moved to their bed and sat on the edge, and motioned for Drizzt to join her.\\n\\n \"Would you have?\" she asked again as he approached. \"Innovindil was very beautiful, in body and in mind.\"\\n\\n \"It is not something I think about,\" said Drizzt.\\n\\n Catti-brie\u0027s smile grew wider. \"I know,\" she assured him. \"But I am asking you to consider it now. Could you have loved her?\"\\n\\n Drizzt thought about it for a few moments then admitted, \"I do not know.\"\\n\\n \"And you never wondered about it at all?\"\\n\\n Drizzt\u0027s thoughts went back to a moment he had shared with Innovindil when the two of them were out alone among the orc lines. Innovindil had nearly seduced him, though only to let him see more clearly his feelings for Catti-brie, whom he had thought dead at the time.\\n\\n \"You could have loved her, I think,\" Catti-brie said.\\n\\n \"You may well be right,\" he said.\\n\\n \"Do you think she thought of you in her last moments?\"\\n\\n Drizzt\u0027s eyes widened in shock at the blunt question, but Catti-brie didn\u0027t back down.\\n\\n \"She thought of Tarathiel, likely, and what was,\" he answered.\\n\\n \"Or of Drizzt and what might have been.\"\\n\\n Drizzt shook his head. \"She would not have looked there. Not then. Likely her every thought was for Sunset. To be an elf is to find the moment, the here and now. To revel in what is with knowledge and acceptance that what will be, will be, no matter the hopes and plans of any.\"\\n\\n \"Innovindil would have had a fleeting moment of regret for Drizzt, and potential love lost,\" Catti-brie said.\\n\\n Drizzt didn\u0027t disagree, and couldn\u0027t, given the woman\u0027s generous tone and expression. Catti-brie wasn\u0027t judging him, wasn\u0027t looking for reasons to doubt him. She confirmed that a moment later, when she laughed and put her hand up to stroke his cheek.\\n\\n \"You will outlive me by centuries, in all likelihood,\" she explained. \"I understand the implications of that, my love, and what a selfish fool I would be if I expected you to remain faithful to a memory. Nor would I want - nor do I want - that for you.\"\\n\\n \"It doesn\u0027t mean that we have to speak of it,\" Drizzt retorted. \"We know not where our roads will lead, nor which of us will outlive the other. These are dangerous times in a dangerous world.\"\\n\\n \"I know.\"\\n\\n \"Then is this something we should bother to discuss?\"\\n\\n Catti-brie shrugged, but gradually her smile dissipated and a cloud crossed her fair features.\\n\\n \"What is it?\" Drizzt asked, and lifted his hand to turn her to face him directly.\\n\\n \"If the dangers do not end our time together, how will Drizzt feel, I wonder, in twenty years? Or thirty?\"\\n\\n The drow wore a puzzled expression.\\n\\n \"You will still be young and handsome, and full of life and love to give,\" Catti-brie explained. \"But I will be old and bent and ugly. You will stay by my side, I am sure, but what life will that be? What lust?\"\\n\\n It was Drizzt\u0027s turn to laugh.\\n\\n \"Can you look at a human woman who has seen the turn of seventy years and think her attractive?\"\\n\\n \"Are there not couples of humans still in love after so many years together?\" Drizzt asked. \"Are there not human husbands who love their wives still when seventy is a birthday passed?\"\\n\\n \"But the husbands are not usually in the springtime of their lives.\"\\n\\n \"You err because you pretend that it will happen overnight, in the snap of fingers,\" Drizzt said. \"That is far from the case, even for an elf looking upon the human lifespan. Every wrinkle is earned, my love. Day by day, we spend our time together, and the changes that come will be well earned. In your heart you know that I love you, and I have no doubt but that my love will grow with the passage of years. I know your heart, Catti-brie. You are blissfully predictable to me in some ways, never so in others. I know where your choices will be, time and again, and ever are they on the right side of justice and integrity.\"\\n\\n Catti-brie smiled and kissed him, but Drizzt broke it off fast and pushed her back.\\n\\n \"If a dragon\u0027s fiery breath were to catch up with me, and scar my skin hideously, blind me, and keep about me a stench of burnt flesh, would Catti-brie still love me?\"\\n\\n \"Wonderful thought,\" the woman said dryly.\\n\\n \"Would she? Would you stand beside me?\"\\n\\n \"Of course.\"\\n\\n \"And if I thought otherwise, at all, then never would I have desired to be your husband. Do you not similarly trust in me?\"\\n\\n Catti-brie grinned and kissed him again, then pushed him on his back on the bed.\\n\\n The packing could wait.\\n\\n Early the next morning, Drizzt leaned over the sleeping Catti-brie and gently brushed her lips with his own. He stared at her for a long while, even while he walked from the bed to the door. He at last turned and nearly jumped back in surprise, for set against the door was Taulmaril, the Heartseeker, Catti-brie\u0027s bow, and lying below it was her magical quiver, one that never ran out of arrows. For a moment, Drizzt stood confused, until he noticed a small note on the floor by the quiver. From a puncture in its side, he deduced that it had been pressed onto the top of the bow but had not held its perch.\\n\\n He knew what it said before he ever brought it close enough to read the scribbling.\\n\\n He looked back at Catti-brie once more. She couldn\u0027t be with him in body, perhaps, but with Taulmaril in his hand, she\u0027d be there in spirit.\\n\\n Drizzt slung the bow over his shoulder then retrieved the quiver and did likewise. He looked back once more to his love then left the room without a sound. \\n\\n","sourceLink":"https://allnovel.net/the-orc-king-transitions-1/page-19.html","bookId":2187,"book":{"id":2187,"title":"The Orc King (Transitions #1)","description":"Storyline: The Orc King (Transitions #1) \\n An uneasy peace between the dwarves of Mithral Hall and the orcs of the newly established Kingdom of Many-Arrows can`t last long. The orc tribes united under Obould begin to fight each other, and Bruenor is determined to finish the war that nearly killed him and almost destroyed everything he`s worked to build. But it will take more than swords and axes to bring a lasting peace to the Spine of the World. Powerful individuals on both sides may have to change the way they see each other. They may have to start to talk. But it won`t be easy.\\n","cover":"https://allnovel.net/images/the-orc-king-transitions-1.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-orc-king-transitions-1.html","creation":"Oct 5, 2019 8:58:26 AM","modification":"Oct 5, 2019 6:51:28 PM"}}
