{"id":100290,"no":2,"title":"Page 2","content":"One of the consequences of living an existence that spans centuries instead of decades is the inescapable curse of continually viewing the world through the focusing prism employed by an historian.\n I say \"curse\" - when in truth I believe it to be a blessing - because any hope of prescience requires a constant questioning of what is, and a deep-seated belief in the possibility of what can be. Viewing events as might the historian requires an acceptance that my own initial, visceral reactions to seemingly momentous events may be errant, that my \"gut instinct\" and own emotional needs may not stand the light of reason in the wider view, or even that these events, so momentous in my personal experience, might not be so in the wider world and the long, slow passage of time.\n How often have I seen that my first reaction is based on half-truths and biased perceptions! How often have I found expectations completely inverted or tossed aside as events played out to their fullest!\n Because emotion clouds the rational, and many perspectives guide the full reality. To view current events as an historian is to account for all perspectives, even those of your enemy. It is to know the past and to use such relevant history as a template for expectations. It is, most of all, to force reason ahead of instinct, to refuse to demonize that which you hate, and to, most of all, accept your own fallibility.\n And so I live on shifting sands, where absolutes melt away with the passage of decades. It is a natural extension, I expect, of an existence in which I have shattered the preconceptions of so many people. With every stranger who comes to accept me for who I am instead of who he or she expected me to be, I roil the sands beneath that person\u0027s feet. It is a growth experience for them, no doubt, but we are all creatures of ritual and habit and accepted notions of what is and what is not. When true reality cuts against that internalized expectation - when you meet a goodly drow! - there is created an internal dissonance, as uncomfortable as a springtime rash.\n There is freedom in seeing the world as a painting in progress, instead of a place already painted, but there are times, my friend...\n There are times.\n And such is one before me now, with Obould and his thousands camped upon the very door of Mithral Hall. In my heart I want nothing more than another try at the orc king, another opportunity to put my scimitar through his yellow-gray skin. I long to wipe the superior grin from his ugly face, to bury it beneath a spray of his own blood. I want him to hurt - to hurt for Shallows and all the other towns flattened beneath the stamp of orc feet. I want him to feel the pain he brought to Shoudra Stargleam, to Dagna and Dagnabbit, and to all the dwarves and others who lay dead on the battlefield that he created.\n Will Catti-brie ever walk well again? That, too, is the fault of Obould.\n And so I curse his name, and remember with joy those moments of retribution that Innovindil, Tarathiel, and I exacted upon the minions of the foul orc king. To strike back against an invading foe is indeed cathartic.\n That, I cannot deny.\n And yet, in moments of reason, in times when I sit back against a stony mountainside and overlook that which Obould has facilitated, I am simply not certain.\n Of anything, I fear.\n He came at the front of an army, one that brought pain and suffering to many people across this land I name as my home. But his army has stopped its march, for now at least, and the signs are visible that Obould seeks something more than plunder and victory.\n Does he seek civilization?\n Is it possible that we bear witness now to a monumental change in the nature of orc culture? Is it possible that Obould has established a situation, whether he intended this at first or not, where the interests of the orcs and the interests of all the other races of the region coalesce into a relationship of mutual benefit?\n Is that possible? Is that even thinkable?\n Do I betray the dead by considering such a thing?\n Or does it serve the dead if I, if we all, rise above a cycle of revenge and war and find within us - orc and dwarf, human and elf alike - a common ground upon which to build an era of greater peace?\n For time beyond the memory of the oldest elves, the orcs have warred with the \"goodly\" races. For all the victories - and they are countless! - and for all the sacrifices, are the orcs any less populous now than they were millennia ago?\n I think not, and that raises the specter of unwinnable conflict. Are we doomed to repeat these wars, generation after generation, unendingly? Are we - elf and dwarf, human and orc alike - condemning our descendants to this same misery, to the pain of steel invading flesh?\n I do not know.\n And yet I want nothing more than to slide my blade between the ribs of King Obould Many-Arrows, to relish in the grimace of agony on his tusk-torn lips, to see the light dim in his yellow, bloodshot eyes.\n But what will the historians say of Obould? Will he be the orc who breaks, at long, long last, this cycle of perpetual war? Will he, inadvertently or not, present the orcs with a path to a better life, a road they will walk - reluctantly at first, no doubt - in pursuit of bounties greater than those they might find at the end of a crude spear?\n I do not know.\n And therein lies my anguish.\n I hope that we are on the threshold of a great era, and that within the orc character, there is the same spark, the same hopes and dreams, that guide the elves, dwarves, humans, halflings, and all the rest. I have heard it said that the universal hope of the world is that our children will find a better life than we.\n Is that guiding principle of civilization itself within the emotional make-up of goblinkind? Or was Nojheim, that most unusual goblin slave I once knew, simply an anomaly?\n Is Obould a visionary or an opportunist?\n Is this the beginning of true progress for the orc race, or a fool\u0027s errand for any, myself included, who would suffer the beasts to live?\n Because I admit that I do not know, it must give me pause. If I am to give in to the wants of my vengeful heart, then how might the historians view Drizzt Do\u0027Urden?\n Will I be seen in the company of those heroes before me who helped vanquish the charge of the orcs, whose names are held in noble esteem? If Obould is to lead the orcs forward, not in conquest, but in civilization, and I am the hand who lays him low, then misguided indeed will be those historians, who might never see the possibilities that I view coalescing before me.\n Perhaps it is an experiment. Perhaps it is a grand step along a road worth walking.\n Or perhaps I am wrong, and Obould seeks dominion and blood, and the orcs have no sense of commonality, have no aspirations for a better way, unless that way tramples the lands of their mortal, eternal enemies.\n But I am given pause.\n And so I wait, and so I watch, but my hands are near to my blades. \n","sourceLink":"https://allnovel.net/the-orc-king-transitions-1/page-2.html","bookId":2187,"book":{"id":2187,"title":"The Orc King (Transitions #1)","description":"Storyline: \n The Orc King (Transitions #1) \n An uneasy peace between the dwarves of Mithral Hall and the orcs of the newly established Kingdom of Many-Arrows can`t last long. The orc tribes united under Obould begin to fight each other, and Bruenor is determined to finish the war that nearly killed him and almost destroyed everything he`s worked to build. But it will take more than swords and axes to bring a lasting peace to the Spine of the World. Powerful individuals on both sides may have to change the way they see each other. They may have to start to talk. But it won`t be easy.\n \n","cover":"https://allnovel.net/images/the-orc-king-transitions-1.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-orc-king-transitions-1.html","creation":"Oct 5, 2019 8:58:26 AM","modification":"Oct 5, 2019 6:51:28 PM"}}
