{"id":100322,"no":34,"title":"Page 34","content":"Shingles and Torgar stood quietly, staring at Bruenor, letting him lead without question, while an eager Pwent hopped around them. Cordio kept his eyes closed, praying to Moradin - and to Clangeddin, for he understood that the road to battle was clear. For Hralien, there showed only grim determination, and beside him, the bound Tos\u0027un matched that intensity. Regis shifted from foot to foot nervously. And Drizzt, who had just delivered the assessment that battle was soon to be joined, and that the time had come for them to either leave or engage, waited patiently.\\n\\n All focus fell to Bruenor, and the weight of that responsibility showed clearly on the face of the agitated dwarf. He had brought them there, and on his word they would either flee to safety or leap into the jaws of a tremendous battle - a battle they could not hope to win, or likely even survive, but one that they might, if their gods blessed them, influence.\\n\\n To the south, Obould saw Dukka\u0027s force rolling forward like a dark cloud, streaming toward a line of orcs moving west to flank the hills. The clan of the Wolf Jaw, he knew, and he nodded and growled softly, imagining all the horrors he would inflict upon Dnark when his business with Grguch was over.\\n\\n Confident that General Dukka would keep Wolf Jaw at bay, Obould focused his gaze directly to the east, where rising dust showed the approach of a powerful force, and yellow banners shot with red proclaimed Clan Karuck. The orc king closed his eyes and fell within his thoughts, imagining again his great kingdom, full of walls and castles, and teeming cities of orcs living under the sun and sharing fully in the bounty of the world.\\n\\n Kna\u0027s shriek brought him from his quiet meditation, and as soon as he opened his eyes, Obould understood her distress.\\n\\n An orc approached, a zombie orc, holding its head plaintively in its hands before it. Before any of his warriors and guards could react, Obould leaped the low wall before him and charged down, drawing his greatsword as he went. A single swing cleaved the zombie in half and sent the head flying.\\n\\n So it was, the orc king knew as he executed the swing. Grguch had stated his intent and Obould had answered. There was no more to be said.\\n\\n Not so far to the east, a great horn blared.\\n\\n From over the very next ridge came the sound of a skirmish, orc against orc.\\n\\n \"Obould and Grguch,\" Tos\u0027un stated.\\n\\n In the distance to the northeast, a great horn, Kokto Gung Karuck, sounded.\\n\\n \"Grguch,\" Drizzt agreed.\\n\\n Bruenor snorted. \"I can\u0027t be asking any o\u0027 ye to come with me,\" he started.\\n\\n \"Bah, but just ye try to stop us,\" said Torgar, with Shingles nodding beside him.\\n\\n \"I would travel to the Abyss itself for a try at Obould,\" Hralien added.\\n\\n Beside him, Tos\u0027un shook his head.\\n\\n \"Obould\u0027s to be found on them hills,\" Bruenor said, waving his axe in the general direction of the trio of rocky mounds they had determined to be Obould\u0027s main encampment. \"And I\u0027m meaning to get there. Right through, one charge, like an arrow shot from me girl\u0027s bow. I\u0027m not for knowing how many I\u0027ll be leavin\u0027 in me wake. I\u0027m not for knowin\u0027 how I\u0027m getting back out after I kill the dog. And I\u0027m not for caring.\"\\n\\n Torgar slapped the long handle of his greataxe across his open palm, and Shingles banged his hammer against his shield.\\n\\n \"We\u0027ll get ye there,\" Torgar promised.\\n\\n The sounds of battle grew louder, some close and some distant. The great horn blew again, its echoes vibrating the stones beneath their feet.\\n\\n Bruenor nodded and turned to the next ridge, but hesitated and glanced back, focusing his gaze on Tos\u0027un. \"Me elf friend telled me that ye done nothing worth killin\u0027 ye over,\" he said. \"And Hralien\u0027s agreeing. Get ye gone, and don\u0027t ye e\u0027er give me a reason to regret me choice.\"\\n\\n Tos\u0027un held his hands out wide. \"I have no weapons.\"\\n\\n \"There\u0027ll be plenty for ye to find in our wake, but don\u0027t ye be following too close,\" Bruenor replied.\\n\\n With a helpless look to Drizzt, then to all the others, Tos\u0027un gave a bow and walked back the way they had come. \"Grguch is your nightmare, now,\" he called to Drizzt, in the drow tongue.\\n\\n \"What\u0027s that?\" Bruenor asked, but Drizzt only smiled and walked over to Hralien.\\n\\n \"I\u0027ll be moving fast beside Bruenor,\" the drow explained, handing Tos\u0027un\u0027s weapon belt over. \"If any are to escape this, it will be you. Beware this sword. Keep it safe.\" He glanced over at Regis, clearly nervous. \"This will not unravel the way we had intended. Our run will be frantic and furious, and had we known the lay of the land and the orc forces, Bruenor and I would have come out - \"\\n\\n \"Alone, of course,\" finished the elf.\\n\\n \"Keep the sword safe,\" Drizzt said again, though he looked not at Khazid\u0027hea, but at Regis as he spoke, a message all too clear for Hralien.\\n\\n \"And live to tell our tale,\" the drow finished, and he and Hralien clasped hands.\\n\\n \"Come on, then!\" Bruenor called.\\n\\n He scraped his boots in the dirt to clear them of mud, and adjusted his one-horned helmet and his foaming mug shield. He started off at a brisk walk, but Thibble dorf Pwent rushed up beside him, and past him, and swept Bruenor up in his eagerness.\\n\\n They were in full charge before they crested the ridge.\\n\\n They found the fighting to the west of them, back toward Obould\u0027s line, but there were orcs aplenty right below, running eagerly to battle - so eagerly that Pwent had already lowered his head spike before the nearest one turned to regard the intruders.\\n\\n That orc\u0027s scream became a sudden gasp as the helmet spike prodded through its chest, and a lip-flapping head wag from Pwent sent the mortally wounded creature flying aside. The next two braced for the charge, ready to dive aside, but Pwent lifted his head and leaped at them, spiked gauntlets punching every which way.\\n\\n Drizzt and Bruenor veered to the right, where orc reinforcements rushed past the trees and the stones. Torgar and Shingles ran straight ahead off their wake, following Pwent in his attempt to punch through this thin flank and toward the main engagement, which was still far to the north.\\n\\n With his long strides, Drizzt moved ahead of Bruenor. He lifted Taulmaril, holding the bow horizontal before his chest, for the orcs were close enough and plentiful enough that he didn\u0027t even need to aim. His first shot took one in the chest and blasted it backward and to the ground. His second went through another orc so cleanly that the creature hardly jerked, and Drizzt thought for a moment that he had somehow missed - he even braced for a counter.\\n\\n But blood poured forth, chest and back, and the creature died where it stood, too fast for it to even realize that it should fall over.\\n\\n \"Bend right!\" Bruenor roared, and Drizzt did, sidestepping as the dwarf charged past him, barreling into the next group of orcs, shield bashing and axe flying left, right, and center.\\n\\n With a single fluid movement, Drizzt shouldered the bow and drew forth his scimitars, and went in right behind Bruenor. Dwarf and drow found themselves outnumbered three to one in short order.\\n\\n The orcs never had a chance.\\n\\n Regis didn\u0027t argue as Hralien pulled him to the side, still well behind the other six and moving from cover to cover.\\n\\n \"Protect me,\" the elf bade as he put up his longbow and began streaming arrows at the plentiful orcs.\\n\\n His little mace in hand, Regis was in no position to argue - though he suspected that Drizzt had arranged it for his protection. For Hralien, Regis knew, was the one Drizzt most expected to escape the insanity.\\n\\n His anger at the drow for pushing him to the side of the fight lasted only the moment it took Regis to view the fury of the engagement. To the right, Pwent spun, punched, butted, kicked, kneed, and elbowed with abandon, knocking orcs aside with every twist and turn.\\n\\n But they were orcs of Wolf Jaw, warriors all, and not all of the blood on the battlerager was from an orc.\\n\\n Back-to-back behind him, Torgar and Shingles worked with a precision wrought of years of experience, a harmony of devastating axe-work the pair had perfected in a century of fighting together as part of Mirabar\u0027s vaunted watch. Every routine ended with a step - either left or right, it didn\u0027t seem to matter - as each dwarf behind moved in perfect complement to keep the defense complete.\\n\\n \"Spear, down!\" Torgar yelled.\\n\\n He ducked, unable to deflect the missile. It flew over his head, apparently to crack through the back of Shingles\u0027s skull, but hearing the warning, old Shingles threw his shield up behind his head at the last instant, turning the crude spear aside.\\n\\n Shingles had to fall away as the orc before him seized the opening.\\n\\n But of course there was no opening, as Shingles rolled out to the side and Torgar came in behind him with a two-handed slash that disemboweled the surprised creature.\\n\\n Two orcs took its place and Torgar got stabbed in the upper arm - which only made him madder, of course.\\n\\n Regis swallowed hard and shook his head, certain that if he\u0027d followed the charge, he\u0027d already have been dead. He nearly fainted as he saw an orc, stone axe high for a killing blow, close in on Shingles, an angle that neither dwarf could possibly block.\\n\\n But the orc fell away, an arrow deep in its throat.\\n\\n That startled Regis from his shock, and he looked up to Hralien, who had already set another arrow and swiveled back the other way.\\n\\n For there Bruenor and Drizzt worked their magic, as only they could. Drizzt\u0027s scimitars spun in a blur, too quick for Regis to follow their movements, which he measured instead by the angles of the orcs falling away from the furious drow. What Bruenor couldn\u0027t match in finesse, he made up for with sheer ferocity, and it occurred to Regis that if Thibble dorf Pwent and Drizzt Do\u0027Urden collided with enough force to meld them into a single warrior, the result would be Bruenor Battlehammer.\\n\\n The dwarf sang as he cut, kicked, and bashed. Unlike the other trio, who seemed stuck in a morass and tangle of orcs, Drizzt and Bruenor kept moving across and to the north, chopping and slashing and dancing away. At one point, a group of orcs formed in their path, and it seemed as if they would be stopped.\\n\\n But Hralien\u0027s arrows broke the integrity of the orc line, and a flying black panther crashed into the surprised creatures, scattering them and sending them flying.\\n\\n Drizzt and Bruenor ran by, breaking clear of the conflict.\\n\\n At first, that thought panicked Regis. Shouldn\u0027t the two turn back to help Pwent and the others? And shouldn\u0027t he and Hralien hurry to keep up?\\n\\n He looked at the elf and realized it wasn\u0027t about them, any of them. It was about Bruenor getting to Obould, about Bruenor killing Obould.\\n\\n Whatever the cost.\\n\\n Cordio wanted to keep up with Bruenor, to protect his beloved king at all costs, but the priest could not pace the fiery dwarf and his drow companion, and once he noted the harmony of their movements, attacks and charges, he recognized that he would likely only get in their way.\\n\\n He turned for the dwarf trio instead, angling to get into the melee near to Torgar, whose right arm drooped low from a nasty stab.\\n\\n Still fighting fiercely, the Mirabarran dwarf nevertheless grunted his approval as Cordio reached toward him, sending waves of magical healing energy into him. When Torgar turned to note his appreciation more directly, he saw that Cordio\u0027s help hadn\u0027t come without cost, for the priest had sacrificed his own position against one particularly large and nasty orc for the opportunity to help Torgar. Cordio bent low under the weight of a rain of blows against his fine shield.\\n\\n \"Pwent!\" Torgar roared, motioning for the priest as the battlerager turned his way.\\n\\n \"For Moradin!\" came Pwent\u0027s roar and he disengaged from the pair he was battering and charged headlong for Cordio.\\n\\n The two orcs gave close chase, but Torgar and Shingles intercepted and drove them aside.\\n\\n By the time Pwent reached Cordio, the priest was back to an even stance against the orc. No novice to battle, Cordio Muffinhead had covered himself with defensive enchantments and had brought the strength of his gods into his arms, swinging his flail with powerful strokes.\\n\\n That didn\u0027t slow Pwent, of course, who rushed past the startled priest and leaped at the orc.\\n\\n The orc\u0027s sword screeched against Pwent\u0027s wondrous armor, but it hardly bit through before Pwent slammed against the orc and began to thrash, the ridges on his plate mail tearing apart the orc\u0027s leather jerkin and slicing into its flesh beneath. With a howl of pain, the orc tried to disengage, but a sudden left and right hook from Pwent\u0027s spiked gauntlets held it in place like harvest corn.\\n\\n Cordio used the opportunity to cast some healing magic into the battlerager, though he knew that Pwent wouldn\u0027t feel any difference. Pwent didn\u0027t really seem to feel pain.\\n\\n The back of the small clearing dipped even lower, down into a dell full of boulders and a few scraggly tree skeletons. Drizzt and Bruenor rushed through, leaving their fighting companions behind, and with his longer strides, Drizzt took the lead.\\n\\n Their goal was to avoid battle while they closed the ground to the trio of rocky hills and King Obould. As they came up the far side of the dell, they saw the orc king, picking him out from the flames engulfing his magical greatsword.\\n\\n An ogre tumbled away from him then he shifted back and stabbed up over his shoulder, skewering another ten-foot behemoth. With strength beyond all reason, Obould used his sword to pull that ogre right over his shoulder and send it spinning down the side of the hillock.\\n\\n All around him the battle raged, as Clan Karuck and Clan Many-Arrows fought for supremacy.\\n\\n And in truth, with Obould and his minions holding the high ground, it didn\u0027t seem as if it would be much of a fight.\\n\\n But then a fireball exploded, intense and powerful, right behind the highest wall on the hill to Obould\u0027s left, the northernmost of the three, and all of the Many-Arrows archers concealed there flailed about, immolated by the magical flames. They shrieked and they died, curling up on the ground in blackened, smoking husks.\\n\\n Clan Karuck warriors swarmed over the stones.\\n\\n \"What in the Nine Hells...?\" Bruenor asked Drizzt. \"Since when are them orcs throwing fireballs?\"\\n\\n Drizzt had no answer, other than to reinforce his feelings about the entire situation, simply by stating, \"Grguch.\"\\n\\n \"Bah!\" Bruenor snorted, so predictably, and the pair ran on.\\n\\n \"Keep to the high ground,\" Hralien instructed Regis as he led the halfling along to the east. They pulled up amidst a boulder tumble, beside a single maple tree, Hralien sighting targets and lifting his bow.\\n\\n \"We have to go and join them!\" Regis cried, for the four dwarves moved out of sight over the near ridge of the dell.\\n\\n \"No time!\"\\n\\n Regis wanted to argue, but the frantic hum of Hralien\u0027s bowstring, the elf firing off arrow after arrow, denied him his voice. More orcs swarmed along before them from the east, and a darker cloud had formed in the west as a vast army began its approach.\\n\\n Regis cast a plaintive gaze to the north, where Drizzt and Bruenor had gone, where Cordio, Pwent, and the others had run. He believed that he would never see his friends again. Drizzt had done it, he knew. Drizzt had put him with Hralien, knowing that the elf would likely find a way out, where there could be no retreat for Drizzt and Bruenor.\\n\\n Bitterness filled the back of Regis\u0027s throat. He felt betrayed and abandoned. In the end, when the circumstances had grown darkest, he had been set aside. Logically he could understand it all - he was, after all, no hero. He couldn\u0027t fight like Bruenor, Drizzt, and Pwent. And with so many orcs around, there really wasn\u0027t any way for him to hide and strike from points of opportunity.\\n\\n But that did little to calm the sting.\\n\\n He nearly jumped out of his boots when a form rose up beside him, an orc springing from concealment. Purely on instinct, Regis squealed and shouldered the thing, knocking it off-balance just enough so that its stab at Hralien only grazed the distracted archer.\\n\\n Hralien turned fast, smashing his bow across the orc\u0027s face. The bow flew free as the orc tumbled, Hralien going for his sword.\\n\\n Regis lifted his mace to finish the orc first, except that as he retracted his arm for the strike, something grabbed him and yanked that arm back viciously. He felt his shoulder pop out of joint. His hand went numb as his mace fell away. He managed to half turn then to duck, bringing his other arm up over his head defensively as he noted the descent of a stone hammer.\\n\\n A blinding explosion spread over the back of his head, and he had no idea of whether his legs had buckled or simply been driven straight into the ground as he fell face-down in the stony dirt. He felt a soft boot come in tight against his ear and heard Hralien battling above him.\\n\\n He tried to put his hands under him, but one arm would not move to his call, and the attempt sent waves of nauseating agony through him. He managed to lift his head, just a bit, and tasted the blood streaming down from the back of his skull as he half-turned to try to get his bearings.\\n\\n He was back on the ground again, though he knew not how. Cold fingers reached up at him, as if from the ground itself. He had his eyes open, but the darkness crept in from the edges.\\n\\n The last thing he heard was his own ragged breathing.\\n\\n Orc armor proved no match for the fine elven sword as Hralien slid the blade deep into the chest of the newest attacker, who held a stone hammer wet with Regis\u0027s blood.\\n\\n The elf slashed out to the side, finishing the first one, who stubbornly tried to regain its footing, then spun to meet the charge of a third creature coming in around the tree. His sword flashed across, turning the orc\u0027s spear in against the bark and knocking the creature off balance. The tree alone stopped it from falling aside, but that proved an unfortunate thing for the orc, as Hralien leaped out to the side and stabbed back in, catching the creature through the armpit.\\n\\n It shrieked and went into a frenzy, spinning and stumbling away, grabbing at the vicious wound.\\n\\n Hralien let it go, turning back to Regis, who lay so very still on the cold ground. More orcs had spotted him, he knew. He had no time. He grabbed the halfling as gently as he could and slid him down into a depression at the base of the maple, between two large roots. He kicked dirt and twigs and leaves, anything he could find to disguise the poor halfling. Then, for the sake of the fallen Regis, Hralien grabbed up his bow and sprang away, running again to the east.\\n\\n Orcs closed on him from behind and below. More rose up before him, running at an angle to prevent him from going over the ridge to the south.\\n\\n Hralien dropped his second sword belt, the one Drizzt had given him, and threw aside his bow, needing to be nimble.\\n\\n He charged ahead, desperate to put as much ground between himself and Regis as possible, in the faint hope that the orcs would not find the wounded halfling. The run lasted only a few strides, though, as Hralien skidded to a stop, turning frantically to bring his sword around to deflect a flying spear. Swords came in at him from every angle, orcs closing for the kill. Hralien felt the hot blood of his elders coursing through his veins. All the lessons he had learned in two centuries of life flooded through him, driving him on. There was no thought, only instinct and reaction, his shining sword darting to block, angling to turn a spear and stabbing ahead to force an attacker into a short retreat.\\n\\n Beautiful was his dance, magnificent his turns, and lightning-quick his thrusts and ripostes.\\n\\n But there were too many - too many for him to even consider them separately as he tried to find some answer to the riddle of the battle.\\n\\n Images of Innovindil flitted through his mind, along with those others he had lost so recently. He took hope in the fact that they had gone before him, that they would greet him in Arvandor when a single missed block let a sword or a spear slip through.\\n\\n Behind him, back the way he had come, Regis sank deeper into the cold darkness. And not so far away, perhaps halfway to the tree, a black hand closed over Khazid\u0027hea\u0027s hilt.\\n\\n They had intended to follow in the wake of Bruenor and Drizzt, but the four dwarves found the route blocked by a wall of orcs. They came out of the dell to the east instead, and there, too, they met resistance.\\n\\n \"For Mirabar and Mithral Hall!\" Torgar Hammerstriker called, and shoulder to shoulder with his beloved and longtime friend Shingles, the leader of the Mirabarran exodus met the orcs.\\n\\n To the side of them, Thibble dorf Pwent snarled and bit and found within himself yet another frenzy. Flailing his arms and legs, and butting his head so often that his forward movements seemed the steps of a gawky, long-necked seabird, Pwent had the orcs on that side of the line in complete disarray. They threw spears at him, but so intent were they on getting out of his way that they threw as they turned, and thus with little or no effect.\\n\\n It couldn\u0027t hold, though. Too many orcs stood before them, and they would have to pile the orc bodies as thick as the walls of a dwarf-built keep before they could even hope to find a way through.\\n\\n Bruenor and Drizzt were lost to them, as was any route that would get them back to the south and the safety of Mithral Hall. So they did what dwarves do best, they fought to gain the highest ground.\\n\\n Cordio wanted to tap some offensive magic, to stun the orcs with a blast of shocking air, perhaps, or to hold a group in place so that Torgar and Shingles could score quick kills. But blood flowed freely from all the dwarves in short order, and the priest could not keep up with the wounds, though his every spell cast was one of healing. Cordio was filled with Moradin\u0027s blessing, a priest of extraordinary power and piety. It occurred to him, though, that Moradin himself was not possessed of enough magical healing to win that fight. They were known, the clear spectacle of the most-hated enemy in the midst of the orcs, and behind the immediate fighting, the ugly creatures stalked all around them, preparing to overwhelm them.\\n\\n Not a dwarf was afraid, though. They sang to Moradin and Clangeddin and Dumathoin. They sang of bar wenches and heavy mugs of ale, of killing orcs and giants, of chasing dwarf ladies.\\n\\n And Cordio led a song to King Bruenor, of the fall of Shimmer-gloom and the reclamation of Mithral Hall.\\n\\n They sang and they fought. They killed and they bled, and they looked continually to the north, where Bruenor their king had gone.\\n\\n For all that mattered was that they had served him well that day, that they had given him enough time and enough of a distraction to get to the hills and to end, once and for all, the threat of Obould.\\n\\n Hralien felt the sting of a sword across his forearm, and though the wound was not deep, it was telling. He was slowing, and the orcs had caught on to the rhythms of his dance.\\n\\n He had nowhere to run.\\n\\n An orc to his right came on suddenly, he thought, and he spun to meet the charge - then saw that it was no charge at all, for the tip of a sword protruded from the falling creature\u0027s chest.\\n\\n Behind the orc, Tos\u0027un Armgo retracted Khazid\u0027hea and leaped out to the side. An orc lifted its shield to block, but the sword went right through the shield, right through the arm, and right through the side of the creature\u0027s chest.\\n\\n Before it had even fallen away, another orc fell to Tos\u0027un\u0027s second weapon, an orc-made sword.\\n\\n Hralien had no time to watch the spectacle or to even consider the insanity of it all. He spun back and took down the nearest orc, who seemed dumbfounded by the arrival of the drow. On the elves pressed, light and dark, and orcs fell away, or threw their weapons and ran away, and soon the pair faced off, Hralien drawing a few much-needed deep breaths.\\n\\n \"Clan Wolf Jaw,\" Tos\u0027un explained to Hralien. \"They fear me.\"\\n\\n \"With good reason,\" Hralien replied.\\n\\n The sound of battle to the north, and the sound of dwarf voices lifted in song, stole their conversation, and before Tos\u0027un could begin to clarify, he found that he did not have to, for Hralien led their run down from the ridgeline. \\n\\n","sourceLink":"https://allnovel.net/the-orc-king-transitions-1/page-34.html","bookId":2187,"book":{"id":2187,"title":"The Orc King (Transitions #1)","description":"Storyline: The Orc King (Transitions #1) \\n An uneasy peace between the dwarves of Mithral Hall and the orcs of the newly established Kingdom of Many-Arrows can`t last long. The orc tribes united under Obould begin to fight each other, and Bruenor is determined to finish the war that nearly killed him and almost destroyed everything he`s worked to build. But it will take more than swords and axes to bring a lasting peace to the Spine of the World. Powerful individuals on both sides may have to change the way they see each other. They may have to start to talk. But it won`t be easy.\\n","cover":"https://allnovel.net/images/the-orc-king-transitions-1.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-orc-king-transitions-1.html","creation":"Oct 5, 2019 8:58:26 AM","modification":"Oct 5, 2019 6:51:28 PM"}}
