{"id":100325,"no":37,"title":"Page 37","content":"How different might the world now be if King Bruenor had not chosen such a course with the first Obould Many-Arrows,\" Hralien asked Drizzt. \"Better, or worse?\"\n \"Who can know?\" the drow replied. \"But at that time, a war between Obould\u0027s thousands and the gathered armies of the Silver Marches would have changed the region profoundly. How many of Bruenor\u0027s people would have died? How many of your own, who now flourish in the Glimmerwood in relative peace? And in the end, my friend, we do not know who would have prevailed.\"\n \"And yet here we stand, a century beyond that ceremony, and can either of us say with absolute truth that Bruenor chose correctly?\"\n He was right, Drizzt knew, to his ultimate frustration. He reminded himself of the roads he had walked over the last decades, of the ruins he had seen, of the devastation of the Spellplague. But in the North, instead of that, because of a brave dwarf named Bruenor Battlehammer, who threw off his baser instincts, his hatred and his hunger for revenge, in light of what he believed to be the greater good, the region had known a century and more of relative peace. More peace than ever it had known before. And that while the world around had fallen to shadow and despair.\n Hralien started away, but Drizzt called after him.\n \"We both supported Bruenor on that day when he signed the Treaty of Garumn\u0027s Gorge,\" he reminded. Hralien nodded as he turned.\n \"As we both fought alongside Bruenor on the day he chose to stand beside Obould against Grguch and the old ways of Gruumsh,\" Drizzt added. \"If I recall that day correctly, a younger Hralien was so taken by the moment that he chose to place his trust in a dark elf, though that same drow had marched to war against Hralien\u0027s people only months before.\"\n Hralien laughed and held up his hands in surrender.\n \"And what resulted from that trust?\" Drizzt asked. \"How fares Tos\u0027un Armgo, husband of Sinnafain, father of Teirflin and Doum\u0027wielle?\"\n \"I will ask him when I return to the Moonwood,\" the beaten Hralien replied, but he managed to get in the last arrow when he directed Drizzt\u0027s gaze to the prisoners they had taken that day.\n Drizzt conceded the point with a polite nod. It wasn\u0027t over. It wasn\u0027t decided. The world rolled on around him, the sand shifted under his feet.\n He reached down to pet Guenhwyvar, needing to feel the comfort of his panther friend, the one constant in his surprising life, the one great hope along his ever-winding road. \n","sourceLink":"https://allnovel.net/the-orc-king-transitions-1/page-37.html","bookId":2187,"book":{"id":2187,"title":"The Orc King (Transitions #1)","description":"Storyline: \n The Orc King (Transitions #1) \n An uneasy peace between the dwarves of Mithral Hall and the orcs of the newly established Kingdom of Many-Arrows can`t last long. The orc tribes united under Obould begin to fight each other, and Bruenor is determined to finish the war that nearly killed him and almost destroyed everything he`s worked to build. But it will take more than swords and axes to bring a lasting peace to the Spine of the World. Powerful individuals on both sides may have to change the way they see each other. They may have to start to talk. But it won`t be easy.\n \n","cover":"https://allnovel.net/images/the-orc-king-transitions-1.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-orc-king-transitions-1.html","creation":"Oct 5, 2019 8:58:26 AM","modification":"Oct 5, 2019 6:51:28 PM"}}
