{"id":89599,"no":11,"title":"Page 11","content":"I should have driven out to my land and plunged my treacherous body into the chilly pond right then. To hell with the wolves. Though I\u0027d been satisfied, embarrassingly so, I still felt empty, even achy. I knew why. I might have come and it had been great, but I hadn\u0027t done what I really wanted to. Cadotte. Man, was I in trouble. Perhaps if I\u0027d swum until I felt nothing but limp, I wouldn\u0027t have been so distracted all night. However, I doubt anything could have erased his taste from my mouth and his image from my mind. I know that an hour\u0027s worth of pacing did not get rid of the question: Why me? Cadotte certainly hadn\u0027t been dazzled by my charm or my appearance. I wasn\u0027t wealthy, brilliant, or hot. What was he up to? The questions swirled in my head as the mortification swirled in my gut. I\u0027d shared an appallingly intimate moment with a stranger. How was I ever going to look Cadotte in the face again? I wasn\u0027t sure I could, but I\u0027d have to. He hadn\u0027t given me one speck of the information I\u0027d asked for. The memory of my moans and gyrations haunted me all the way to work, which only meant that I had a mood to match Zee\u0027s. The phones were ringing like the church bells on Christmas Eve when I walked into the station. Thankfully Zee triaged better than anyone I\u0027d ever met. She put one call on bold, routed another to the fire department, a third to the clinic, and spoke to the fourth. I\u0027d never make it as a dispatcher. My crisis management skills were heavily weighted to action rather than reaction. \"Two Adam Four, do you copy?\" \"Two Adam Four. I copy and am ten-forty-two.\u0027 \u0027\" \"My ass you\u0027re off duty,\" Zee muttered, though not over the radio for a change. She glanced at me. \"Henry\u0027s been to three fights already tonight. He\u0027s going to love this.\" As everyone in the department knew, Henry - one of our second shift officers - loathed overtime. He had a young wife and no children - yet - though not for lack of trying. \"Ten-seventy-four that,\" Zee continued. \"There\u0027s a ten-ten in progress at the Sportsman.\" \"Another one? What are people drinking? Okay, I\u0027m ten-seventy-six to the Sportsman.\" \"This whole town has gone ape shit,\" Zee muttered. \"You\u0027d think rabid wolves and a school shooting would make people stay home and play nice. Instead, they\u0027re out drinking and driving and fighting.\" She picked up the call on hold. \"Yeah, she\u0027s here now.\" Zee listened. \"I\u0027ll tell her.\" After hanging up, she lit a new cigarette off the stub of her old one and took a deep drag, letting the smoke blow out of her nose on a sigh of contentment. Zee loved her cigarettes nearly as much as she loved me. Or maybe it was the other way around. \"Who\u0027s here?\" I prompted when she continued to smoke and ignore me. \"Who the hell do you think? You see anyone else hanging around?\" Since I was accustomed to Zee\u0027s usual manner of conversation, I didn\u0027t even blink at her words or her tone. \"Someone\u0027s looking for me?\" \"Yeah. That spooky old fart the DNR hired. He\u0027s on his way. You\u0027re supposed to wait for him.\" I flicked a finger at the phones. \"Don\u0027t I have work to do?\" \"Hell, yes. But Clyde said you deal with Dr. Death first.\" \"Peachy.\" I glanced around the office. The second shift hadn\u0027t come back in yet. The rest of the third shift must have already gone out. Zee and I were the only lucky ones in the place. I hated waiting around with nothing to do. I stuck my hand in my pocket and my fingertips nicked the totem. \"I\u0027ll be in the evidence room,\" I said. I could at least put this back where it belonged and get Clyde off my ass. As I walked by Zee, she put down her cigarette and sniffed the murky air. \"Where you been?\" she asked. \"Home. Where else?\" \"You smell funny.\" How she could tell with cigarette smoke still swirling around her snowy white hair I have no idea. But Zee had always had the nose of a bloodhound. I wondered what she\u0027d be able to smell if her senses hadn\u0027t been depleted by nicotine. I lifted my arm and sniffed underneath. \"No, I don\u0027t.\" \"Aftershave,\" she announced. I blushed. I couldn\u0027t help it. Strange, though. I hadn\u0027t smelled any aftershave on Cadotte. Only that scent that was his alone - earth, air, forest, man. \"What are you up to, girl?\" Since I rarely had reason to blush, my heated cheeks must stand out like the flash of a searchlight on the night of a new moon. Zee glared at me suspiciously. \"Nothing but my job, Zee.\" She snorted and I had a hard time not joining her. If my job involved letting William Cadotte put his mouth all over me, the number of applicants for my position would be greater than ravaging mosquitoes on a muggy summer night. I escaped from the front office before Zee pried more out of me. Not that I was easy - prior evidence to the contrary - but Zee was even more bullheaded than I was. She\u0027d pick at me until I cracked or she got enough information to come to her own conclusion. I wouldn\u0027t really mind if Zee knew. In fact, I\u0027d like to talk to her about what in hell was wrong with me. But Clyde was another story. Since his relationship with Zee was as close as or even closer than mine was, telling her would be the same as telling him. I\u0027d lose my job, or at the least my involvement with this case. When Clyde had told me to stay away from Cadotte, he hadn\u0027t just been whistling Dixie. Sighing, I slipped into the evidence room. I made my way to the shelf where I\u0027d left the bag of junk that comprised the evidence from Karen Larson\u0027s accident. It wasn\u0027t there. I didn\u0027t panic right away. Just figured I was on the wrong shelf. My mind wasn\u0027t exactly focused. I put the totem into my pocket and searched the room. There wasn\u0027t a lot there. My evidence certainly wasn\u0027t. I began to feel uneasy. I remembered putting the bag on the second shelf, along with the signed note from Cadotte. I got down on my knees and crawled around. Nothing. I needed to report this to Zee and then to Clyde. The evidence room wasn\u0027t Fort Knox, but it was secure enough for Miniwa. I\u0027d had to use my key to get in here, and only officers had keys. If we took evidence out of the room for any reason, we made a notation in the evidence log. The evidence log! I smacked myself in the forehead and grabbed the book off the desk next to the door. Quickly I spun through the pages, expecting to see a familiar name scrawled in the margin next to my scribbled listing of Karen Larson\u0027s evidence. Not only was there no name; there was no scribble. Hell, there wasn\u0027t even a page. I opened the book as far as the spine would allow. I couldn\u0027t see a shred of paper. Either someone was very good at ripping pages out of books, or I was nuts and I\u0027d never recorded anything at all. I had to go with the first option, even though that made no sense. Who would want a bag of glass and plastic? Unless... I patted my pocket, felt the hard ridge of the totem against my thigh. Had the culprit been looking for something else entirely? Cadotte had said that whoever the totem belonged to would be wanting it back. Then why not just ask? Unless the owner had good reason not to be recognized as such. And if it wasn\u0027t the owner, then what possible good could the totem do them? I was more confused than ever. I couldn\u0027t prove I\u0027d brought in the evidence. Couldn\u0027t prove the evidence had disappeared. Clyde was going to have my head when he found out. He was already pissed at me for letting Cadotte keep the icon. But it was lucky I had or we\u0027d have lost that, too. One thing I knew, I wasn\u0027t leaving the totem here to disappear along with everything else. For now the stone was safe right where it was.","sourceLink":"https://allnovel.net/night-creature-blue-moon-nightcreature-1/page-11.html","bookId":2088,"book":{"id":2088,"title":"Night Creature: Blue Moon (Nightcreature #1)","description":"Storyline: Blue Moon(Night Creature series book 1) Miniwa, Wisconsin is under siege, but not by the usual summer tourists. The area\u0027s normally shy wolf population has begun stalking human prey, and their victims have been disappearing...or worse. Something is happening in the woods. Something brutal and primitive... Officer Jessie McQuade has seen plenty in her years on the force-but nothing as intriguing as the gorgeous, naked man she encounters while tracking a rogue wolf. Professor Will Cadotte is a Native American activist. He\u0027s also the only man capable of distracting Jessie from her work. And for a cop, distraction-no matter how pleasurable-can be deadly. It\u0027s against Jessie\u0027s better judgment to accept Will\u0027s help in her investigation, yet she soon finds herself doing exactly that-and more. Will\u0027s dark, penetrating eyes see into a part of Jessie\u0027s soul she never knew existed. It\u0027s exhilarating...and terrifying. Now, as a town\u0027s deepest secrets come to light, no one is safe: not friends, lovers, or strangers. And as Jessie follows a bloody trail to the shocking truth, she\u0027ll have to decide who she can trust when the moon is full...","cover":"https://allnovel.net/images/night-creature-blue-moon-nightcreature-1.jpg","author":"Lori Handeland","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/night-creature-blue-moon-nightcreature-1.html","creation":"Oct 5, 2019 8:58:19 AM","modification":"Oct 5, 2019 5:36:14 PM"}}
