{"id":89610,"no":22,"title":"Page 22","content":"I fell asleep with my hand still on his face. I\u0027d been exhausted when I got home. Incredible sex had given me a second wind, but there was only so much a girl could take.\\n\\n When I awoke we were both under the sheets. Someone, not me, had drawn the heavy curtains. I glanced at Cadotte. God, he was beautiful.\\n\\n His skin was smooth and dark, darker still against my plain white sheets. I wondered what he\u0027d look like with long hair. The shorn ends curled just a little, making my fingers itch to twine between them. His earring twinkled against the warm flesh of his neck.\\n\\n I remembered kissing that neck a few hours ago, being startled by the cool metal brushing my lips. When he\u0027d trailed his mouth all over my body, the earring had tickled me here and there, adding a new dimension to every embrace.\\n\\n His hand covered my hip. My eyes jumped from his earring to his face. He smiled. \"Morning.\"\\n\\n I waited for the usual morning-after embarrassment to descend. Before it could, he shifted closer and kissed me. Just a gentle brush of his lips against mine and then he pulled back. Something between my belly and my heart stuttered.\\n\\n \"I\u0027ll make coffee,\" he said, and then he was gone.\\n\\n I took advantage of the solitude to head for the shower. The totem caught my eye from the dresser. I glanced at the bedroom door through which Cadotte had disappeared. I could hear him banging around in the kitchen, see his shadow flitting against the wall in the hall.\\n\\n I opened a drawer and dumped the wolf on top of my underwear, then scooted into the bathroom and locked the door. I had nothing against sex in the shower - with Cadotte I would probably be agreeable to sex just about anywhere - but right now I wanted to think.\\n\\n What had I done?\\n\\n Had sex. Big deal.\\n\\n Actually it had been. And maybe that was the problem.\\n\\n I knew better than to fall for a guy like Cadotte. He was gorgeous, brilliant, a little bit strange. We had nothing in common. We probably never would.\\n\\n Why on earth he\u0027d wanted me I had yet to figure out. But I couldn\u0027t believe he\u0027d want me much longer. The best way to get out of this without getting hurt was to dump him before he dumped me.\\n\\n This resolved, I returned to my room. The slant of the sun through the windows told me the time was long past noon. I threw on shorts and a shirt, tucked the totem underneath a pile of socks in a drawer, and walked barefoot into the kitchen.\\n\\n Cadotte leaned against the counter, drinking coffee completely naked. He smiled as if he weren\u0027t and poured another cup. My gaze lowered. I could get used to this.\\n\\n He turned and I yanked my gaze upward. Raising a brow, he handed me my coffee. \"Would you like to go out for breakfast?\"\\n\\n The thought of walking into The Coffee Pot with him and ordering breakfast at... 2:00 p.m. was just too much for me. Besides, wasn\u0027t I showing him the door?\\n\\n I took a sip, swallowed, nearly choked with shock. Cadotte made the best coffee I had ever tasted.\\n\\n \"What did you do to this?\" I stared into the cup as if I could find all the answers to life\u0027s mysteries in the swirling black depths.\\n\\n \"A sprinkle of cinnamon mixed with the grounds makes all the difference.\"\\n\\n \"I have cinnamon?\"\\n\\n \"In the back of the cabinet. Yes.\"\\n\\n \"Hmm. Wonder where that came from.\" I took another sip.\\n\\n \"Breakfast?\" he reminded me.\\n\\n \"I... can\u0027t.\"\\n\\n The same emotion that had flickered in his eyes when I\u0027d refused to meet him for dinner returned.\\n\\n \"Why not?\"\\n\\n More coffee. That\u0027s what I needed. I gulped half the cup, let the heat bubble in my empty stomach.\\n\\n \"Because.\"\\n\\n Same lame excuse I\u0027d used the last time. Unfortunately, it didn\u0027t work this time.\\n\\n \"Because I\u0027m good enough to fuck but not to eat breakfast with?\"\\n\\n I spilled coffee on my shirt. \"What?\"\\n\\n Having a serious conversation with a naked man was a new experience - and downright difficult. I kept getting distracted by the way his skin shone in the sunlight.\\n\\n \"I may not be from here, but I know how small towns work. If it got out you were screwing an Indian, there\u0027d be trouble.\"\\n\\n I was silent. There would be, but not the way he thought. I sighed.\\n\\n \"Will, I - \"\\n\\n He set his empty cup on the counter with a click and crossed the floor so fast he was crowding into my space before I knew he was coming. He captured my cup, set it aside, and took my hands.\\n\\n \"Don\u0027t,\" he whispered. \"Why can\u0027t we just enjoy each other like we did last night?\"\\n\\n I frowned. \"You want to do it again?\"\\n\\n He slid his fingers into my hair. \"And again and again and again.\"\\n\\n I hadn\u0027t expected that. Still, why risk my career on something that would never last?\\n\\n He kissed me, his tongue teasing mine, his lips soft and warm. He tasted of coffee and cinnamon. I wanted to drink him in and keep him with me forever.\\n\\n Lifting his head, he remained close enough that his breath mingled with mine. \"Does this have to be complicated? I want you, Jessie. You want me. Let\u0027s just keep doing what we\u0027re doing. Okay?\"\\n\\n When a gorgeous naked man asks you something like that, what else are you supposed to say but -\\n\\n \"Hell, yes.\"\\n\\n We ended up back in bed, but before things could get good, the phone shrilled. Why had I ever plugged it back in?\\n\\n \"Don\u0027t answer,\" Cadotte whispered against my belly. The warmth of his breath trailed along the moistness left by his tongue. I shivered and forgot all about the phone.\\n\\n Until my machine clicked in and Clyde\u0027s voice came out. \"Jessie, you\u0027d better get over to the hospital.\\n\\n We got trouble.\"\\n\\n I sat up, nearly knocking Cadotte off the bed in the process.\\n\\n \"Your victim from last night died.\"\\n\\n I dived for the phone. \"Clyde?\"\\n\\n \"Sorry. I didn\u0027t mean to wake you.\"\\n\\n \"You didn\u0027t. I was just - \" I glanced at Will. \"Never mind. What\u0027s going on?\"\\n\\n \"Mel. He died. Cherry is screaming blue murder. Said you told them to give him the vaccine and now he\u0027s dead. She\u0027s threatening lawsuit. It\u0027s a total goat fuck.\"\\n\\n I blinked. Goat fuck was Zee\u0027s favorite term. Things must be very bad.\\n\\n \"I\u0027ll be right there.\"\\n\\n I hung up. Cadotte kissed my hip. \"Problem?\"\\n\\n \"Oh, yeah.\"\\n\\n \"Can you tell me about it?\"\\n\\n I considered and decided that I could. The incident last night, and whatever had happened at the hospital since, would be public record soon enough. I filled him in.\\n\\n He lay on the bed with his arm beneath his head and stared at the ceiling with a frown, I got up and pulled my uniform out of the closet.\\n\\n \"I don\u0027t like the sound of this,\" he murmured.\\n\\n \"You, me, and the rest of the Miniwa Police Department.\"\\n\\n My gaze on the floor - my bra and underwear must be around here somewhere - I didn\u0027t see him get off the bed. I didn\u0027t hear him, either. The guy moved more quietly than a wolf.\\n\\n \"Here.\" I glanced up. He held what I was looking for in one hand.\\n\\n I slipped into my panties. Why I didn\u0027t feel embarrassed I wasn\u0027t sure. Maybe Cadotte\u0027s ease with his own nakedness was starting to wear off on me. Although I doubted I\u0027d be walking bare-assed in the woods anytime soon.\\n\\n I was struggling with the hook on my bra when his hands covered mine. \"Let me.\"\\n\\n As I stood in front of the mirror, my eyes met his. He hooked the clasp, lowered his head, and kissed my shoulder; his earring brushed my skin. His hand slid across my belly - dark against light, slim against round. We were so different - and maybe that wasn\u0027t so bad.\\n\\n My mind skittered away from the thought. \"I\u0027ve got to go.\"\\n\\n He stepped back. \"I know. Is it okay if I shower?\"\\n\\n \"Sure. Just don\u0027t scare the hell out of me when I come home. Next time I might kill you.\"\\n\\n \"You and what army?\" he threw over his shoulder.\\n\\n I laughed. Not only did I want his body, but I liked his mouth - and not just on me.\\n\\n Opening my sock drawer, I slammed it shut when Cadotte stuck his head out the bathroom door. \"We should meet when you get done. I\u0027ve got some ideas I\u0027m going to check out today.\"\\n\\n \"Don\u0027t you have a little thing called class to go to?\"\\n\\n \"It\u0027s Saturday.\"\\n\\n Huh. Where had the week gone?\\n\\n \"You don\u0027t have to help me.\"\\n\\n \"I want to.\" He tilted his head. \"Maybe we should work together on this, Jessie. It couldn\u0027t hurt.\"\\n\\n Clyde would hurt me if he found out about it. But right now, Clyde was the least of my worries.\\n\\n \"I don\u0027t know how much you can help, since you think I\u0027m chasing werewolves.\"\\n\\n \"You are.\"\\n\\n I made an aggravated sound and threw up my hands. \"Cadotte, you are certifiable.\"\\n\\n \"Maybe.\" He didn\u0027t appear concerned. \"What time will you be home?\"\\n\\n \"Morning most likely. Seven-thirty?\"\\n\\n \"I\u0027ll be here.\"\\n\\n He shut the door and the sound of the shower came shortly after. I waited another minute, opened the drawer, felt for the totem, then slipped it over my head and beneath my shirt.\\n\\n What could it hurt for Cadotte to research his delusion? Who knows, he might even turn up something useful. \\n\\n","sourceLink":"https://allnovel.net/night-creature-blue-moon-nightcreature-1/page-22.html","bookId":2088,"book":{"id":2088,"title":"Night Creature: Blue Moon (Nightcreature #1)","description":"Storyline: Blue Moon(Night Creature series book 1) \\n Miniwa, Wisconsin is under siege, but not by the usual summer tourists. The area\u0027s normally shy wolf population has begun stalking human prey, and their victims have been disappearing...or worse. Something is happening in the woods. Something brutal and primitive... Officer Jessie McQuade has seen plenty in her years on the force-but nothing as intriguing as the gorgeous, naked man she encounters while tracking a rogue wolf. Professor Will Cadotte is a Native American activist. He\u0027s also the only man capable of distracting Jessie from her work. And for a cop, distraction-no matter how pleasurable-can be deadly. It\u0027s against Jessie\u0027s better judgment to accept Will\u0027s help in her investigation, yet she soon finds herself doing exactly that-and more. Will\u0027s dark, penetrating eyes see into a part of Jessie\u0027s soul she never knew existed. It\u0027s exhilarating...and terrifying. Now, as a town\u0027s deepest secrets come to light, no one is safe: not friends, lovers, or strangers. And as Jessie follows a bloody trail to the shocking truth, she\u0027ll have to decide who she can trust when the moon is full...\\n","cover":"https://allnovel.net/images/night-creature-blue-moon-nightcreature-1.jpg","author":"Lori Handeland","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/night-creature-blue-moon-nightcreature-1.html","creation":"Oct 5, 2019 8:58:19 AM","modification":"Oct 5, 2019 5:36:14 PM"}}
