{"id":89591,"no":3,"title":"Page 3","content":"As it turned out, he was right. I didn\u0027t find that wolf or any other.\n The woods were strangely empty that night. I chalked it up to the brightness of the moon and my less than graceful manner of crashing through the underbrush. But later I wondered.\n Hell, later I wondered a lot of things.\n Like who was that unmasked man? He\u0027d learned my name but never offered his. And I\u0027d had little opportunity to ask.\n I\u0027d stepped from the clearing, searching once more for a trace of the trail, and when I glanced back he\u0027d disappeared as suddenly as he\u0027d appeared. Logically I knew he had gone inside - rude as that was without a good-bye - still, I never heard the creak of a porch board or the click of the door.\n I moved on, but when the sun came up and I was still empty-handed, I returned to the scene of, the accident. Someone had towed Miss Larson\u0027s oversize vehicle away, leaving the glass, plastic, and blood behind. Peachy.\n I rousted Zee on the radio.\n \"Damn, girl. Where have you been? I was gonna send out the cavalry pretty soon.\"\n \"I\u0027m fine. Didn\u0027t Brad tell you where I was?\"\n \"Off in the woods, alone in the night. You nuts?\"\n \"I had a big gun.\"\n \"Someday, Jessie, you are gonna meet someone smarter and meaner than you.\"\n \"Someday,\" I agreed.\n \"I take it you didn\u0027t find what you were lookin\u0027 for.\"\n The stranger\u0027s face, and everything else, flashed through my mind. I\u0027d found something better, but I wasn\u0027t going to tell Zee that. As she informed anyone who would listen, she was old; she wasn\u0027t dead.\n She\u0027d want more details about the man than I could comfortably give.\n \"The wolf is gone,\" I answered. \"Why wasn\u0027t this scene secured like I asked?\"\n \"Things got a little busy here. Domestic dispute, bar fight.\"\n \"The usual.\"\n \"Damn straight. I didn\u0027t have anyone free to secure anything but their own ass. What difference does it make anyway? You don\u0027t have a major crime scene being contaminated. It\u0027s an accident plain and simple.\"\n I\u0027d learned early on that nothing was plain or simple. My gaze swept over the glass and skid marks. Not even this.\n \"Have you talked to Brad about the victim?\" I asked.\n \"Yeah. He stayed with her until she left, but - \"\n \"Left?\"\n \"You don\u0027t have to shout.\"\n \"How could she leave? She was bitten by a wild animal. She needs rabies shots.\"\n \"Only if she\u0027ll take them. And she wouldn\u0027t.\"\n \"Why not?\"\n \"The clinic didn\u0027t have the serum. They could get it from Clearwater, but it would have taken several hours. She refused.\"\n \"That makes no sense.\"\n \"Since when does anything make sense?\"\n Zee had a point. I tried to raise Brad on the radio and got no response. I dialed his cell phone, but he didn\u0027t answer. A glance at my watch revealed the shift had changed ten minutes ago. Brad was nothing if not prompt. My opinions on that would have done Zee proud.\n The sun was up; I was tired. Working third shift had made me a vampire of sorts, unable to sleep when everyone else did, unable to stay awake when the world was alive.\n Despite my exhaustion, and the fact that overtime was a no-no, I vowed to hunt down Brad later and find out what he\u0027d learned from Miss Larson. Right now I\u0027d head to the clinic and talk to the doctor. See if I could find Miss Larson and have a word with her - if she wasn\u0027t foaming at the mouth yet.\n But first... I glanced from my squad car to the glass and plastic still on the pavement. First I got to clean up the mess.\n I sketched the scene, measured the skid marks, then swept the remains of the accident into a transparent bag and carried my prize to the side of the road. Holding it up, I jiggled the sack. Something caught my eye.\n I reached inside and withdrew a thin rawhide strip. I\u0027d seen them used as necklaces, usually on men, sometimes teenage girls. If there\u0027d been a jewel or a charm threaded onto this one, it could be anywhere.\n I jiggled the bag again but saw nothing else unusual. So I walked the center line and found what I was searching for several feet ahead of where the SUV had skidded to a stop.\n Leaning down, I picked up a carved onyx figure of a wolf, what the Ojibwe referred to as a totem. As I stared at it the image wavered and shifted. Cool air shot down my sweaty back, making me shiver. I shook my head. For a moment, the wolf\u0027s face had appeared almost human. I definitely needed some sleep.\n Had the totem been here last night? Or for weeks, perhaps months? What did it mean? To whom did the icon belong? Did it even matter?\n I shrugged and dropped the evidence into the bag. I had enough questions to keep me busy most of the morning. Any more could wait for tonight.\n My visit to the Miniwa Clinic was not very enlightening. The on-call doctor was young, earnest, and as exhausted as I was. He\u0027d been on duty for forty-eight hours. I was glad I hadn\u0027t been brought in bleeding at hour number forty-seven.\n \"I cleaned the wound, though the officer who brought the victim in had done a decent job of it.\"\n I made a mental note that Brad had been listening in first-aid class. Good boy.\n The doctor rested his forehead on one palm and closed his eyes. When he swayed, I grabbed his arm, afraid he was going to tumble face-first onto the floor. \"Doc? Hey! You okay?\"\n \"Sorry. It\u0027s been a long night - or three.\"\n I made sympathetic noises. Why the medical community insisted on pushing physicians to their physical, emotional, and mental limits was beyond me. Did they believe the doctors who survived the training could then survive anything? Probably.\n \"Miss Larson,\" I reminded him.\n \"Oh, yeah. I treated her like a dog bite victim. Four stitches, antibiotic. Minor really.\"\n \"Why did she leave?\"\n \"She had to work.\"\n \"Is she a brain surgeon?\"\n Confusion flickered over his pale face. \"I\u0027m sorry?\"\n \"Her work couldn\u0027t wait? What if the wolf was rabid?\"\n \"The chances of that are slim, Officer. Rabid animals tend more toward bats or the rodent family - mice, squirrels.\" He paused, considered a moment, continued. \"Or stray cats. Nasty things. You definitely need rabies shots if you get bit by a stray cat.\"\n I didn\u0027t plan on getting bit by any stray cats, since it would be an ice-cold day in Miami before I touched one. However, information is always welcome.\n The doctor shook his head. \"It\u0027s highly unlikely that a wolf is carrying rabies.\"\n \"Doesn\u0027t mean she\u0027s in the clear.\"\n \"No. But she has the right to refuse treatment.\"\n \"And if she starts gnawing on a co-worker, does she have the right to sue you?\"\n He winced at the word sue, an occupational hazard, I\u0027m sure. \"You\u0027re like a dog with a bone on this.\"\n Dog? Bone?\n I waited for him to snicker, but he was either too tired to get his own joke or he was amusement-challenged. Maybe a little bit of both.\n \"I like all my ends neat and tidy,\" I continued. \"Call me anal. Everyone else does.\"\n His lips never twitched. Definitely amusement-challenged.\n \"You can follow up.\" He scribbled on a notepad. \"Here\u0027s her address and place of business.\"\n Karen Larson\u0027s home was located just off Highway 199.\n Huh. That huge car had screamed tourist. Getting out of her vehicle to check on an injured wolf shouted moron. If she wasn\u0027t a temporary resident, she was at least very new. Until folks had lived here for a winter they always thought they needed huge tires to roll over the huge snowdrifts.\n Her address explained her presence on the highway. It did not, however, explain why she was driving home alone at 3.00 a.m. on a weeknight. Maybe I was nosy, but little details like that bugged me.\n Perhaps that was why I\u0027d become a cop. It gave me license to snoop.\n I glanced at the doctor\u0027s chicken scratch again. Miss Larson was a teacher at Treetop Elementary.\n Though some schools finished before Memorial Day weekend, others, like ours, continued classes nearly all the way through June. This was a direct result of the state lawmakers and their brilliant idea that schools should begin after Labor Day in order to make the most out of the tourist season. None of them ever seemed to understand that this only cut several weeks off the other end of summer.\n Since Miss Larson had been so all-fired concerned about work - I glanced at my watch - and she should be there by now, I headed in that direction, too.\n My decision was a sound one. By the time I reached Treetop Elementary, there was a whole lot of screaming going on.\n I was the first officer on the scene. Probably because everyone was more interested in getting out of the building than dialing 911, although sirens in the distance assured me someone had phoned in an emergency.\n I wasn\u0027t on duty, but what the hell? People running, children screaming, call me silly, but the situation called for a cop.\n I parked my squad car at the curb, radioed in my location, then got out and pushed against the tide of bodies leaving the building. Once inside, I searched for someone in charge. As no one was volunteering, I snagged the arm of the nearest adult. At my touch she shrieked, causing several of the children around her to burst into tears.\n Their behavior made me edgy. Had the nightmare of a school shooting reached the north woods? Though I didn\u0027t hear any gunfire, that didn\u0027t mean there hadn\u0027t been any.\n \"What happened?\" I demanded, none too nicely.\n \"I-I don\u0027t know. Down there.\" She jabbed her free hand back the way she\u0027d come. \"Screaming. Crying. Shouting. They said evacuate calmly. Then everyone ran.\"\n Which didn\u0027t sound good. Typical, but not good.\n I released her, and she ushered the few stragglers onto the lawn.\n The school had gone eerily silent. I should probably wait for backup, but if there was a gunman inside I didn\u0027t plan to let the little bastard do any more damage than he\u0027d already done.\n Honestly, if every child who\u0027d ever been teased or tormented grabbed a weapon, none of us would have survived our school years. What was going on in the world that made kids believe it was all right to solve their troubles with a gun? But then again, who was I to throw stones?\n I drew my service revolver and headed down the deserted hallway.\n The lack of gunfire and the sudden absence of screaming made it difficult for me to locate the source of the problem. I wouldn\u0027t have, except for a slight, nearly undetectable whimper that drifted from a room ahead and to my left.\n A sign on the wall outside the door read, Miss Larson. Third Grade.\n \"Shit,\" I muttered. \"I haft being right.\"\n Having my school shooting scenario go up in smoke should have made me happy. Instead, what I found when I opened the classroom door made me sick.\n Karen Larson wasn\u0027t well. The fairy princess aura had vanished, the air of fragility, too. Her hair hung across her face in sweaty hanks, only partially obscuring her eyes.\n Too bad. Because her eyes reminded me of a man I\u0027d testified against once in an insanity trial. He\u0027d gone to Happy Hill for the rest of his days. But what bothered me more than her appearance was the little boy in her grasp.\n He was probably eight years old and not small by any means. Yet she held him aloft with one hand; his Nikes dangled a foot above the floor. His body was limp, though I could see his chest rise and fall with a steady breath.\n Unconscious. Good. From the appearance of Miss Larson, life was going to get unpleasant.\n \"Put him down.\" I didn\u0027t shout, but I didn\u0027t whisper, either. Calm but firm worked best in almost any situation.\n Miss Larson glanced up. Her mouth was flecked with pink foam. It wasn\u0027t a good look for her.\n Out of the corner of my eye, I glimpsed another body nearby. Larger. Not a child, but a man. Maybe the janitor, or the principal. He wasn\u0027t moving, even to breathe, and there was blood spattered all around. I understood why Miss Larson\u0027s foam was pink. Uck.\n I cocked my gun. My window for playing nice had closed.\n \"Put him down!\" My voice was louder and less calm than before. \"Do it, Karen.\"\n She cocked her head like a dog who had recognized its name somewhere in the jumble of human words.\n I shivered. This was just too weird.\n Things got weirder when she growled at me. Seriously. She did. Flecks of foam flew from her mouth, and there were bloodstains on her teeth.\n I inched forward and she snarled, tugged the limp boy closer, nuzzled his hair, licked his neck. What happened next I\u0027m not certain.\n I would swear to this day that she smiled at me with perfect clarity. As if she were fine, this had all been a mistake. I would also vow, though never out loud, that in the next instant a feral mask descended over her face; the spirit of an animal lived in her eyes.\n She lifted her head, reared back as if to tear out the throat of the child in her arms, and a gunshot thundered through the room.\n I\u0027ll never be able to prove if I imagined the change in Karen Larson or if it was real, because her head snapped back as a bullet took out her brain.\n Thank God the kid was unconscious. Considering the mess, I wish I had been. \n","sourceLink":"https://allnovel.net/night-creature-blue-moon-nightcreature-1/page-3.html","bookId":2088,"book":{"id":2088,"title":"Night Creature: Blue Moon (Nightcreature #1)","description":"Storyline: \n Blue Moon(Night Creature series book 1) \n Miniwa, Wisconsin is under siege, but not by the usual summer tourists. The area\u0027s normally shy wolf population has begun stalking human prey, and their victims have been disappearing...or worse. Something is happening in the woods. Something brutal and primitive... Officer Jessie McQuade has seen plenty in her years on the force-but nothing as intriguing as the gorgeous, naked man she encounters while tracking a rogue wolf. Professor Will Cadotte is a Native American activist. He\u0027s also the only man capable of distracting Jessie from her work. And for a cop, distraction-no matter how pleasurable-can be deadly. It\u0027s against Jessie\u0027s better judgment to accept Will\u0027s help in her investigation, yet she soon finds herself doing exactly that-and more. Will\u0027s dark, penetrating eyes see into a part of Jessie\u0027s soul she never knew existed. It\u0027s exhilarating...and terrifying. Now, as a town\u0027s deepest secrets come to light, no one is safe: not friends, lovers, or strangers. And as Jessie follows a bloody trail to the shocking truth, she\u0027ll have to decide who she can trust when the moon is full...\n \n","cover":"https://allnovel.net/images/night-creature-blue-moon-nightcreature-1.jpg","author":"Lori Handeland","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/night-creature-blue-moon-nightcreature-1.html","creation":"Oct 5, 2019 8:58:19 AM","modification":"Oct 5, 2019 5:36:14 PM"}}
