{"id":19522,"no":17,"title":"CHAPTER XVI FLAX AND HEMP","content":"WHILE listening to what Jacques was saying about wool, Emile examined his handkerchief attentively. He turned it over and over, felt it, then looked through it. Jacques foresaw the question Emile was getting ready to ask him, and he said: \\n\\n \\n\\n “Handkerchiefs and linens are not woolen. Certain plants, cotton, hemp, flax, and not sheep, furnish them; for, you see, I don’t know much about those things myself. I have heard tell of the cotton plant, but have never seen it. And, besides, I am afraid talking to you will make me cut the sheep’s skin.” \\n\\n \\n\\n In the evening, at Jules’s request, they took up the history of the materials with which we clothe ourselves, and Uncle Paul explained their nature. \\n\\n \\n\\n “The outside of hemp and flax is composed of long threads, very fine, supple, and tenacious, from which we manufacture our fabrics. We clothe ourselves with the spoils of the sheep, we make ourselves fine with the bark of the plant. The fabrics of luxury, cambric, tulle, gauze, point-lace, Mechlin lace, are made from flax; the stronger ones, even to coarse sacking, are of hemp. The cotton plant gives us the fabrics made of cotton. \\n\\n \\n\\n “Flax is a slender plant with little delicate blue flowers, and is sown and harvested every year. It is much cultivated in Northern France, Belgium, and Holland. It is the first plant used by man for woven fabrics. Mummies of Egypt, the old land of Moses and the patriarchs, mummies which have lain buried four thousand years and more, are swathed in bands of linen.” \\n\\n \\n\\n Flax \\n\\n \\n\\n “Mummies, did you say?” interposed Jules. “I don’t know what they are.” \\n\\n \\n\\n “I will tell you, my dear child. Respect for the dead is found among all people and in all ages. Man regards as sacred what was the seat of a soul made in the image of God; he honors the dead, but the honors rendered differ according to time, place, customs. We inter the dead and put over the burial place a tombstone with an inscription, or at least a humble cross, divine emblem of life eternal. The ancients burned them on a funeral pile; they piously gathered the bones bleached by the fire and inclosed them in priceless vases. In Egypt, to preserve the cherished remains for the family, they embalmed the dead; that is to say, they impregnated them with aromatics and swathed them in linen to prevent decomposition. These pious duties were so delicately performed that, after centuries and centuries, we find intact in their chests of sweet-smelling wood, but dried and blackened by years, contemporaries of the ancient kings of Egypt, or the Pharaohs. These are what are called mummies. \\n\\n \\n\\n “Hemp has been cultivated all over Europe for many centuries. It is an annual, of a strong, nauseous odor, with little, green, dull-looking flowers, whose stem, of the thickness of a quill pen, rises to about two meters. It is cultivated, like flax, both for its bark and for its grain, called hemp-seed.” \\n\\n \\n\\n “That is the grain, I think,” said Emile, “we give the goldfinch, which it cracks with its beak when it breaks the shell to get out the little kernel.” \\n\\n \\n\\n “Yes, hemp-seed is the feast of little birds. \\n\\n \\n\\n “The bark of the hemp has not the fineness of flax. The fibers of this latter plant are so fine that twenty-five grams of tow spun on the spinning-wheel furnishes a thread almost a league long. The spider’s web alone can rival in delicacy certain linen fabrics. \\n\\n \\n\\n “When hemp and flax reach maturity, they are harvested, and the seeds are separated by thrashing. The next operation, retting, then takes place, its purpose being to render the filaments of the bark, or the fibers, as they are called, easily separable from the wood. These fibers, in fact, are pasted to the stem and stuck together by a gummy substance that is very resistant and prevents separation until it is destroyed by rot. They sometimes do this retting by spreading the plants in the fields for a couple of weeks and turning them over now and then, until the tow detaches itself from the woody part or hemp-stalk. \\n\\n \\n\\n “But the quickest way is to tie the flax and hemp in bundles and keep them submerged in a pond. There soon follows a rot which gives out intolerable smells; the bark decays, and the fiber, endowed with exceptional resistance, is freed. \\n\\n \\n\\n “Then the bundles are dried; after that they crush them between the jaws of an instrument called a brake, to crush the stems into small pieces and separate the tow. Finally, to purge the tow of all woody refuse and to divide it into the finest threads, they pass it between the iron teeth of a sort of big comb called a heckle. In this state, the fiber is spun either by hand or by machine. The thread obtained is ready for weaving. \\n\\n \\n\\n “On a loom they place in order, side by side, numerous threads composing what they call the warp. By turns, impelled by a pedal on which the operator’s foot presses, one half of these threads descends while the other half ascends. At the same time the operator passes a transverse thread in a shuttle through the two halves of the warp, from left to right, then from right to left. From this inter-crossing comes the woven fabric. And it is finished; the garb of the plant has changed masters; the bark of the hemp has become cloth, that of flax a princely lace worth some hundreds of francs by the piece.” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/2039/58030.html","bookId":612,"book":{"id":612,"title":"The Story-book of Science","description":"简介： Of the increasing success and widening popularity of the elementary science series written chiefly in the seclusion of Srignan by the gifted French naturalist who was destined to give that obscure hamlet a distinction hardly inferior to the renown en...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2039","creation":"Aug 1, 2019 12:19:02 AM","modification":"Aug 1, 2019 12:19:02 AM"}}
