{"id":19542,"no":37,"title":"CHAPTER XXXVI THE EXPERIMENT WITH THE CAT","content":"THE wind blew cold and dry. The storm of the day before had brought it on. Uncle Paul took this pretext to have the kitchen stove lighted in spite of Mother Ambroisine’s remarks, who cried out at the unseasonableness of making a fire. \n \n “Light up the stove in summer!” said she; “did one ever see the like? No one but our master would have such a notion. We shall be roasted.” \n \n Uncle Paul let her talk; he had his own idea. They sat down at the table. After eating its supper the big cat, never too warm, settled itself on a chair by the side of the stove, and soon, with its back turned to the warm sheet-iron, began to purr with happiness. All was going as desired; Uncle Paul’s projects were taking an excellent turn. There was some complaint of the heat, but he took no notice. \n \n “Ah! do you think it is for you the stove is lighted?” said he to the children. “Undeceive yourselves, my little friends: it is for the cat, the cat alone. It is so chilly, poor thing; see how happy it is on its chair.” \n \n Emile was on the point of laughing at his uncle’s kindly attentions to the tom-cat, but Claire, who suspected serious designs, nudged him with her elbow. Claire’s suspicions were well founded. When they had finished supper they resumed the subject of thunder. Uncle Paul began: \n \n “This morning I promised to show you, with the cat’s help, some very curious things. The time has come for keeping my word, provided Puss is agreeable.” \n \n He took the cat, whose hair was burning hot, and put it on his knees. The children drew near. \n \n “Jules, put out the lamp; we must be in the dark.” \n \n The lamp put out, Uncle Paul passed and repassed his hand over the tom-cat’s back. Oh! oh! wonderful! the beast’s hair is streaming with bright beads; little flashes of white light appear, crackle, and disappear as the hand rubs; you would have said that sparks of fireworks were bursting out from the fur. All looked on in wonder at the tom-cat’s splendor. \n \n “That puts the finishing touch! Here is our cat making fire!” cried Mother Ambroisine. \n \n “Does that fire burn, Uncle?” asked Jules. “The cat does not cry out, and you stroke him without being afraid.” \n \n “Those sparks are not fire,” replied Uncle Paul. “You all remember the stick of sealing-wax which, after being rubbed on cloth, attracts little pieces of straw and paper. I told you that electricity, aroused by friction, is what makes the paper draw to the wax. Well, in rubbing the cat’s back with my hand I produce electricity, but in greater abundance, so much so that it becomes visible where it was at first invisible, and bursts forth in sparks.” \n \n “If it doesn’t burn, let me try,” pleaded Jules. \n \n Jules passed his hand over the cat’s fur. The bright beads and their cracklings began again still stronger. Emile and Claire did the same. Mother Ambroisine was afraid. The worthy woman perhaps saw some witchcraft in the bright sparkles from her cat. The cat was then let loose. Besides, the experiment was beginning to give annoyance, and if Uncle Paul had not held the animal fast perhaps it would have begun to scratch. \n \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2039/58050.html","bookId":612,"book":{"id":612,"title":"The Story-book of Science","description":"简介： Of the increasing success and widening popularity of the elementary science series written chiefly in the seclusion of Srignan by the gifted French naturalist who was destined to give that obscure hamlet a distinction hardly inferior to the renown en...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2039","creation":"Aug 1, 2019 12:19:02 AM","modification":"Aug 1, 2019 12:19:02 AM"}}
