{"id":19573,"no":68,"title":"CHAPTER LXVII SHALL WE KILL THEM BOTH?","content":"UNCLE PAUL went up to his room and came back with a book. \n \n “What I am going to read to you is from a mounted artilleryman, more expert in the art of the pen than in that of the cannon. At the beginning of this century a French army occupied Calabria. Our gunner belonged to it. Here is a letter he wrote to his cousin: \n \n “‘One day I was traveling in Calabria. It is a country of bad people who love no one and have a special spite against the French. It would take too long to tell you why; enough that they mortally hate us and one is sure of a bad time if one falls into their hands. \n \n “‘My companion was a young man. In these mountains the roads are precipices; our horses could hardly climb them. My comrade was in front. A path that seemed to him shorter and more practicable misled us. It was my fault. Ought I to have put my trust in a man of twenty years? As long as daylight lasted we tried to find our way through the woods; but the more we tried the more bewildered we got, and it was pitch dark when we reached a dimly lighted house. We entered, not without suspicion, but what could we do? \n \n “‘There we found a charcoal-burner and all his family at table, to which they immediately invited us. My young man needed no urging. We sat down, eating and drinking, or he at least, for I busied myself examining the place and the countenances of our hosts. They had the appearance of charcoal-burners, but the house might have been taken for an arsenal. It was full of guns, pistols, sabers, knives, cutlasses. It all displeased me, and I saw well that I on my part was equally displeasing to our entertainers. \n \n “‘My comrade, on the contrary, made himself one of the family; he laughed, chaffed with them, and, with an imprudence that I ought to have foreseen, told them at the very first whence we came, whither we were going, who we were. Frenchmen, imagine it! Amongst our most mortal enemies, alone, lost, far from all human aid; and then, to add to our probable ruin, he acted the rich man, promising these people whatever they wished in payment and for the hire of guides on the morrow. Finally, he spoke of his valise, begging them to be very careful of it and to put it at the head of his bed: he said he did not wish any other bolster. Ah! youth, youth, how your immaturity is to be pitied! Cousin, you would have thought we were carrying the crown diamonds!’” \n \n “That young man was certainly very imprudent,” commented Jules. “Could he not hold his tongue, seeing he was in the hands of wicked people?” \n \n “Silence is very difficult for giddy, careless young persons. I will go on: \n \n “‘Supper finished, they left us. Our hosts slept below, we in the upper room where we had eaten. A loft seven or eight feet high, reached by a ladder, was the bed that awaited us—a kind of nest that one got into by crawling under joists laden with provisions for a year. My comrade climbed up alone and was soon asleep, his head on the precious valise; I determined to watch, so made a good fire and sat down by it. \n \n “‘The night had almost passed, quietly enough, and I began to feel reassured, when, just as it seemed to me it must be near daylight, I heard our host and his wife quarreling immediately under me, and, putting my ear close to the fire-place that communicated with the one below, I distinguished perfectly this proposal of the husband: “Well, now, let us see; shall we kill them both?” To which the woman answered: “Yes.” And I heard nothing more. \n \n “‘What can I say? I remained scarcely breathing, my body cold as marble. God! When I think of it! We two all but unarmed against those twelve or fifteen with so many weapons! And my comrade dead with sleep and fatigue! To make a noise by calling him, I dared not; to escape by myself, I could not. The window was not far from the ground, but beneath it two big dogs were howling like wolves.’” \n \n “Poor gunner!” Emile exclaimed. \n \n “And his comrade sleeping like a simpleton!” Claire added. \n \n “‘At the end of a quarter of an hour, which seemed long, I heard some one on the stairs, and through the cracks of the door I saw the father, a lamp in one hand and one of his large knives in the other. He was coming up, his wife following him. I placed myself behind the door as he opened it; he put down the lamp, and his wife came and took it; then he entered, barefoot. From outside she said to him in a low tone, shading the lamp with her hand: “Gently, go gently!” When he came to the ladder, he mounted, knife between his teeth, and reaching the height of the bed on which lay this poor young man, his throat uncovered, with one hand he grasped his knife, and with the other—Ah! cousin—’” \n \n “Enough, Uncle; this story frightens me!” cried Claire. \n \n “Wait—‘And with the other he seized a ham that was hanging from the ceiling, cut off a slice, and went off the way he had come. The door closed, the lamp disappeared, and I was left alone with my reflections.’” \n \n “And then?” inquired Jules. \n \n “And then, nothing more. ‘As soon as it was daylight,’ continued the gunner, ‘the whole family came and awakened us with much noise, as we had requested them. They brought food and served us a very good breakfast, I assure you. Two capons were part of it, one of which our hostess said we must eat, and take the other with us. On seeing them I understood the significance of those terrible words: Shall we kill them both?’” \n \n “The man and woman were discussing whether they should kill both capons or only one for breakfast?” asked Emile. \n \n “That and nothing else,” replied his uncle. \n \n “All the same, the gunner had a bad quarter of an hour for his mistake.” \n \n “Those charcoal-burners were not at all such bad people as I thought at first,” said Jules. \n \n “That is the point I wished to make. Calabria, like all countries, has its good and its bad people.” \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2039/58081.html","bookId":612,"book":{"id":612,"title":"The Story-book of Science","description":"简介： Of the increasing success and widening popularity of the elementary science series written chiefly in the seclusion of Srignan by the gifted French naturalist who was destined to give that obscure hamlet a distinction hardly inferior to the renown en...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2039","creation":"Aug 1, 2019 12:19:02 AM","modification":"Aug 1, 2019 12:19:02 AM"}}
