{"id":77733,"no":12,"title":"Page 12","content":"A smile curved Rutledge’s mouth. “As I recall, Nagarajans have ceremonies for nearly everything. See that an appropriate location is found for them to start as many sacred fires as they like without burning the hotel down.”\n “Yes, sir.”\n Rutledge riffled through the managers’ reports. “What’s our current occupancy rate?” he asked without looking up.\n “Ninety-five percent.”\n “Excellent.” Rutledge continued to peruse the reports.\n In the silence that followed, Jake let his gaze wander over the desk. He saw a letter addressed to Miss Poppy Hathaway, from the Honourable Michael Bayning.\n He wondered why it was in Rutledge’s possession. Poppy Hathaway . . . one of the sisters of a family that stayed at the Rutledge during the London season. Like other families of the peerage who didn’t own a residence in town, they were obligated either to let a furnished house or stay in a private hotel. The Hathaways had been loyal customers of the Rutledge for three years. Was it possible that Poppy was the girl Rutledge had been seen with that morning?\n “Valentine,” the hotelier said in an offhand manner, “One of the chairs in my curiosities room needs to be reupholstered. There was a slight mishap this morning.”\n Jake usually knew better than to ask questions, but he couldn’t resist. “What kind of mishap, sir?”\n “It was a ferret. I believe he was trying to make a nest in the cushions.”\n A ferret?\n The Hathaways were definitely involved.\n “Is the creature still at large?” Jake asked.\n “No, it was retrieved.”\n “By one of the Hathaway sisters?” Jake guessed.\n A warning glint appeared in the cool green eyes. “Yes, as a matter of fact.” Setting the reports aside, Rutledge leaned back in his chair. The position of ease was belied by the repeated tapping of his fingers as he rested his hand on the desk. “I have a few errands for you, Valentine. First, go to the residence of Lord Andover in Upper Brook Street. Arrange for a private meeting between myself and Andover within the next two days, preferably here. Make it clear that no one is to know about it, and impress upon Andover that the matter is one of great importance.”\n “Yes, sir.” Jake didn’t think there would be any difficulty in making the arrangements. Whenever Harry Rutledge wanted to meet with someone, they complied without delay. “Lord Andover is the father of Mr. Michael Bayning, isn’t he?”\n “He is.”\n What the devil was going on?\n Before Jake could respond, Rutledge went on with the list. “Next, take this—” he handed Jake a narrow-bound folio tied with leather cord, “—to Sir Gerald at the War Office. Place it directly into his hands. After that, go to Watherston \u0026 Son, and buy a necklace or bracelet on my credit. Something nice, Valentine. And deliver it to Mrs. Rawlings at her residence.”\n “With your compliments?” Jake asked hopefully.\n “No, with this note.” Rutledge gave him a sealed letter. “I’m getting rid of her.”\n Jake’s face fell. God. Another scene. “Sir, I’d rather go on an errand in east London and be pummeled by street thieves.”\n Rutledge smiled. “That will probably happen later in the week.”\n Jake gave his employer a speaking glance and left.\n Poppy was well aware that in terms of marriageability, she had good points and bad points.\n In her favor: Her family was wealthy, which meant she would have a handsome dowry.\n Not in her favor: The Hathaways were neither a distinguished family nor blue-blooded, in spite of Leo’s title.\n In her favor: She was attractive.\n Not in her favor: She was chatty and awkward, often at the same time, and when she was nervous, both problems worsened.\n In her favor: The aristocracy could not afford to be as particular as they once had been. While the peerage’s power slowly diminished, a class of industrialists and merchants was swiftly rising. Therefore, marriages between moneyed commoners and impoverished nobility occurred with increasing frequency. More and more often, the peerage had to figuratively hold its nose and mingle with those of low origins.\n Not in her favor: Michael Bayning’s father, the viscount, was a man of high standards, especially where his son was concerned.\n “The viscount will certainly have to consider the match,” Miss Marks had told her. “He may have impeccable lineage, but from all accounts, his fortune is waning. His son will have to marry a girl from a family of means. It may as well be a Hathaway.”\n “I hope you’re right,” Poppy had replied feelingly.\n Poppy had no doubt that she would be happy as Michael Bayning’s wife. He was intelligent, affectionate, quick to laugh . . . a born and bred gentleman. She loved him, not in a bonfire of passion, but in a warm, steady flame. She loved his temperament, the confidence that superseded any hint of arrogance. And she loved his looks, as unladylike as it was to admit such a thing. But he had thick chestnut hair and warm brown eyes, and his form was tall and well exercised.\n Once Poppy had met Michael, it had seemed almost too easy . . . in no time at all she had fallen in love with him.\n “I hope you’re not trifling with me,” Michael had told her one evening as they browsed along the art gallery of a London mansion during a soirée. “That is, I hope I haven’t mistaken what might be mere politeness on your part for something more meaningful.” He had stopped with her in front of a large landscape done in oils. “The truth is, Miss Hathaway . . . Poppy . . . every minute I spend in your company gives me such pleasure that I can scarcely bear to be apart from you.” \n","sourceLink":"https://allnovel.net/tempt-me-at-twilight-the-hathaways-3/page-12.html","bookId":1787,"book":{"id":1787,"title":"Tempt Me at Twilight (The Hathaways #3)","description":"Storyline: \n He was everything she\u0027d sworn to avoid. \n Poppy Hathaway loves her unconventional family, though she longs for normalcy. Then fate leads to a meeting with Harry Rutledge, an enigmatic hotel owner and inventor with wealth, power, and a dangerous hidden life. When their flirtation compromises her own reputation, Poppy shocks everyone by accepting his proposal—only to find that her new husband offers his passion, but not his trust. \n And she was everything he needed. \n Harry was willing to do anything to win Poppy—except to open his heart. All his life, he has held the world at arm’s length…but the sharp, beguiling Poppy demands to be his wife in every way that matters. Still, as desire grows between them, an enemy lurks in the shadows. Now if Harry wants to keep Poppy by his side, he must forge a true union of body and soul, once and for all...\n \n","cover":"https://allnovel.net/images/tempt-me-at-twilight-the-hathaways-3.jpg","author":"Lisa Kleypas","type":"Historical","source":"allnovel","link":"https://allnovel.net/tempt-me-at-twilight-the-hathaways-3.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 3:38:00 PM"}}
