{"id":77809,"no":88,"title":"Page 88","content":"It took Harry a long time to answer. In fact, they had nearly reached the house by the time he replied, his voice thick and odd. “You’re concerned for my safety? For . . . me?”\n “Someone has to be,” she muttered, stomping to the front door. “I’m sure I don’t know why it’s me.”\n Poppy reached for the handle, but Harry stunned her by flinging it open, whisking her inside, and slamming it shut. Before she could even draw breath, he had pushed her back up against the door, a bit rough in his eagerness.\n She had never seen him look quite this way, incredulous, anxious, yearning.\n His body crowded hers, his breath falling in swift strikes against her cheek. She saw a visible pulse in the strong plane of his throat. “Poppy . . . Are you . . .” He was forced to pause, as if he were fumbling to speak in a foreign language.\n Which he was, in a way.\n Poppy knew what Harry wanted to ask, and yet she didn’t want him to. He was forcing the issue—it was too soon—she wanted to beg him to be patient, for both their sakes.\n He managed to get the words out. “Are you starting to care for me, Poppy?”\n “No,” she said firmly, but that didn’t seem to put him off at all.\n Harry leaned his face against hers, his lips parting against her cheek in a nuzzling half kiss. “Not even a little?” he whispered.\n “Not the slightest bit.”\n He pressed the side of his cheek to hers, his lips playing with the wisps of hair at her ear. “Why won’t you say it?”\n He was so large and warm, and everything in her wanted to surrender to him. A fine trembling started inside her, radiating outward from her bones to her skin. “Because if I did, you wouldn’t be able to run from me fast enough.”\n “I would never run from you.”\n “Yes, you would. You’d turn distant and push me away, because you’re not nearly ready to take such a risk yet.”\n Harry pressed the front of his body all along hers, his forearms braced on either side of her head. “Say it,” he urged, tender and predatory. “I want to hear what it sounds like.”\n Poppy had never thought it was possible to be amused and aroused at the same time. “No, you don’t.” Slowly, her arms went around his lean waist.\n If only Harry knew the extent of what she felt for him. The very second she judged that he was ready, the moment she was certain it wouldn’t cause their marriage to lose ground, she would tell him how dearly she loved him. She could hardly wait.\n “I’ll make you say it,” Harry said, his sensuous mouth covering hers, his hands going to the fastenings of her bodice.\n Poppy couldn’t control a shiver of anticipation. No, he wouldn’t . . . but for the next few hours, she would certainly enjoy letting him try.\n Chapter Twenty-five\n To the Hathaways’ general surprise, Leo elected to return to London the same day as the Rutledges. His original intention had been to stay in Hampshire the remainder of the summer, but he had decided instead to take on a small commission to design a conservatory addition to a Mayfair mansion. Poppy wondered privately if his change of plan had anything to do with Miss Marks. She suspected they had quarreled, because it seemed they were going to great extremes to avoid each other now. Even more than usual.\n “You can’t go,” Merripen had said in outrage when Leo told him he was heading back to London. “We’re preparing to sow the turnip crop. There is much to be decided, including the composition of the manure, and how best to approach the harrowing and plowing, and—”\n “Merripen,” Leo had interrupted sarcastically, “I know you consider my help to be invaluable in these matters, but I believe that somehow you’ll all manage to drill turnip seed competently without my involvement. As for the manure composition, I can’t help you there. I have a very democratic view of excrement—it’s all shit to me.”\n Merripen had responded with a volley of Romany that no one except Cam could understand. And Cam refused to translate a word of it, claiming there were no English equivalents and that was a good thing.\n After making his farewells, Leo left for London in his carriage. Harry and Poppy were slower to depart, having a last cup of tea, a last lingering glimpse of the green summer-dressed estate.\n “I’m almost surprised you’re letting me take her,” Harry said to Cam after handing his wife into the carriage.\n “Oh, we voted this morning, and it was a unanimous decision,” his brother-in-law replied in a matter-of-fact tone.\n “You voted on my marriage?”\n “Yes, we decided you fit in with the family quite well.”\n “Oh, God,” Harry said, just as Cam closed the carriage door.\n After a pleasant and uneventful journey, the Rutledges arrived in London. To discerning outsiders, particularly the hotel employees, it was clear that Poppy and Harry had acquired the mysterious and intangible bond of two people who had made a promise to each other. They were a couple.\n Although Poppy was happy to return to the Rutledge, she had a few private concerns about how her relationship with Harry would proceed—if perhaps he might slip back into his former habits. To her reassurance, Harry had firmly set a new course, and he seemed to have no intention of deviating from it.\n The differences in him were observed with gratified wonder by the hotel staff the first full day of his return. Poppy had brought back gifts, including jars of honey for the managers and everyone in the front office, a length of bobbin lace for Mrs. Pennywhistle, cured Hampshire hams and sides of smoked bacon for Chef Broussard and Chef Rupert and the kitchen staff, and for Jake Valentine, a sheep hide that had been tanned and polished with smooth stones until the material had been worked into butter-soft glove leather. \n","sourceLink":"https://allnovel.net/tempt-me-at-twilight-the-hathaways-3/page-88.html","bookId":1787,"book":{"id":1787,"title":"Tempt Me at Twilight (The Hathaways #3)","description":"Storyline: \n He was everything she\u0027d sworn to avoid. \n Poppy Hathaway loves her unconventional family, though she longs for normalcy. Then fate leads to a meeting with Harry Rutledge, an enigmatic hotel owner and inventor with wealth, power, and a dangerous hidden life. When their flirtation compromises her own reputation, Poppy shocks everyone by accepting his proposal—only to find that her new husband offers his passion, but not his trust. \n And she was everything he needed. \n Harry was willing to do anything to win Poppy—except to open his heart. All his life, he has held the world at arm’s length…but the sharp, beguiling Poppy demands to be his wife in every way that matters. Still, as desire grows between them, an enemy lurks in the shadows. Now if Harry wants to keep Poppy by his side, he must forge a true union of body and soul, once and for all...\n \n","cover":"https://allnovel.net/images/tempt-me-at-twilight-the-hathaways-3.jpg","author":"Lisa Kleypas","type":"Historical","source":"allnovel","link":"https://allnovel.net/tempt-me-at-twilight-the-hathaways-3.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 3:38:00 PM"}}
