{"id":77812,"no":91,"title":"Page 91","content":"“I’m sorry.” Poppy relaxed against him as he continued to hold her. She closed her eyes. “Damn it,” he said into the loose sheaf of her hair, “I’m so sorry. It’s just that the thought of you having any feelings for Bayning . . . it . . . doesn’t bring out the best in me.” “There’s an understatement,” Poppy said darkly. But she turned in his arms and pressed against him, her hand sliding up to the back of his head. “It tortures me,” he admitted gruffly. “I don’t want you to care for any man but me. Even if I don’t deserve it.” Poppy’s hurt faded as she reflected that the experience of being loved was still very new to Harry. The problem wasn’t a lack of trust in her, it was a result of his own self-doubt. Harry would probably always be possessive where she was concerned. “Jealous,” she accused softly, pulling his head down to her shoulder. “Yes.” “Well, there’s no need for it. The only feelings I have for Michael Bayning are pity and kindness.” She brushed her lips against his ear. “Did you see the engraving on the watch? No? . . . It’s inside the lid. Look.” But Harry didn’t move, didn’t do anything except hold her as if she were a lifeline. She suspected he was too overcome to do anything at the moment. “It’s a quote by Erasmus,” she said helpfully. “My father’s favorite monk, after Roger Bacon. The watch is inscribed,‘It is the chiefest point of happiness that a man is willing to be what he is.’ ” At Harry’s continued silence, she couldn’t help throwing more words into the void. “I want you to be happy, you exasperating man. I want you to understand that I love you for exactly what you are.” Harry’s breathing turned hard and rough. He held her in a grip that would have taken a hundred men to break. “I love you, Poppy,” he said raggedly. “I love you so much that it’s absolute hell.” She tried to suppress a smile. “Why is it hell?” she asked sympathetically, stroking his nape. “Because I have so much to lose now. But I’m going to love you anyway, because there doesn’t seem to be any way to stop doing it.” He kissed her forehead, eyelids, cheeks. “I have so much love for you, I could fill rooms with it. Buildings. You’re surrounded by it wherever you go, you walk through it, breathe it . . . it’s in your lungs, and under your tongue, and between your fingers and toes . . .” His mouth moved passionately over hers, urging her lips apart. It was a kiss to level mountains and shake stars from the sky. It was a kiss to make angels faint and demons weep . . . a passionate, demanding, soul-searing kiss that nearly knocked the earth off its axis. Or at least that was how Poppy felt about it. Harry swept her up in his arms and carried her to the bed. He lowered over her and smoothed the rich tumble of her hair. “I never want to be apart from you,” he said. “I’m going to buy an island and take you there. A ship will come once a month with supplies. The rest of the time it will be just the two of us, wearing leaves and eating exotic fruit and making love on the beach . . .” “You’d start a produce export business and organize a local economy within a month,” she said flatly. Harry groaned as he recognized the truth of it. “God. Why do you tolerate me?” Poppy grinned and slid her arms around his neck. “I like the side benefits,” she told him. “And really, it’s only fair since you tolerate me.” “You’re perfect,” Harry said with heated earnestness. “Everything about you, everything you do or say. And even if you have a little flaw here or there . . .” “Flaws?” she asked in mock indignation. “. . . I love those best of all.” Harry undressed her, his efforts hindered by the fact that Poppy was trying to undress him at the same time. They rolled and struggled with their clothing, and despite the intensity of their mutual need, a few gasps of laughter escaped as they found themselves in a hopeless tangle of fabric and limbs. Finally, they both emerged na**d and panting. Harry hooked a hand beneath her knee, widening the spread of her thighs, and he took possession of her in a forceful plunge. Poppy cried out, quivering in surprise at the power of his rhythm. His body was elegant and strong, claiming her in demanding thrusts. Her br**sts were cupped in his hands, his mouth covering a taut peak, and he suckled her in time to the lunges of his hips. A deep flush came over her, the hard slide of his flesh in hers offering exquisite relief and erotic torment. She moaned and struggled to match his rhythm as ripples of pleasure went through her, stronger and stronger until she couldn’t move at all. And he drank in her sobs with his mouth, making love to her until she eventually quieted, her body replete with sensation. Harry stared down at her intently, his face gleaming with perspiration, eyes tiger bright. Poppy wrapped her arms and legs around him, trying to absorb him, wanting him as close as physically possible. “I love you, Harry,” she said. The words made him catch his breath, shudders resounding through his body. “I love you,” she repeated, and he surged inside her, hard and deep, and found his release. She curled up against him afterward, while his hand played gently in her hair. They slept together, dreamed together, all barriers finally gone. And the next day, Harry disappeared. Chapter Twenty-six For a man who revered schedules as much as Harry, being late was not only unusual, it was akin to atrocity. Therefore, when he didn’t return to the hotel from an afternoon visit to his fencing club, Poppy was more than a little concerned. When three hours had passed and her husband still wasn’t back, she rang for Jake Valentine.","sourceLink":"https://allnovel.net/tempt-me-at-twilight-the-hathaways-3/page-91.html","bookId":1787,"book":{"id":1787,"title":"Tempt Me at Twilight (The Hathaways #3)","description":"Storyline: He was everything she\u0027d sworn to avoid. Poppy Hathaway loves her unconventional family, though she longs for normalcy. Then fate leads to a meeting with Harry Rutledge, an enigmatic hotel owner and inventor with wealth, power, and a dangerous hidden life. When their flirtation compromises her own reputation, Poppy shocks everyone by accepting his proposal—only to find that her new husband offers his passion, but not his trust. And she was everything he needed. Harry was willing to do anything to win Poppy—except to open his heart. All his life, he has held the world at arm’s length…but the sharp, beguiling Poppy demands to be his wife in every way that matters. Still, as desire grows between them, an enemy lurks in the shadows. Now if Harry wants to keep Poppy by his side, he must forge a true union of body and soul, once and for all...","cover":"https://allnovel.net/images/tempt-me-at-twilight-the-hathaways-3.jpg","author":"Lisa Kleypas","type":"Historical","source":"allnovel","link":"https://allnovel.net/tempt-me-at-twilight-the-hathaways-3.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 3:38:00 PM"}}
