{"id":91306,"no":20,"title":"Page 20","content":"Olivia rode on, and the others followed. She reined in at a copse, and they paused behind her. A doe and her young fawn were nibbling on short grasses near the edge, barely visible beneath the canopy of the trees. “Wow!” Joey whispered. “Let’s go around. Maybe they won’t bolt,” Olivia said. They skirted the high pines, giving the doe and her fawn a wide berth. The doe looked up and stared at them. For a moment, her instinct and fear were visible. But she didn’t move. She studied them, then went back to her nibbling. They guided their horses around her. Dustin didn’t see exactly what happened next. He heard something—a whizzing sound in the air. Shiloh let out a snort of terror and reared up. Olivia calmed him quickly, and turned to look at Dustin and Joey. “You okay?” she asked. “Fine,” Joey said. “What was that?” “I don’t know. The world’s biggest bee, maybe.” Olivia was in control, but Dustin saw that she was shaken. He heard rustling. It seemed to come from behind them. He turned Chapparal. The horse could whirl around on a dime—good thing for him at the moment. The trail was narrow here, but led back to the trees. The doe and her fawn were no longer there; they’d obviously been spooked. He kept moving, inspecting the trail on the other side. He didn’t see anything, but when he dismounted, he discovered that the ground had been disturbed and a number of low-hanging branches were broken. He continued to follow the trail, leaving Olivia and Joey behind. He heard Joey call out and paused, wanting to take his investigation all the way to the road—but afraid to leave the two of them alone in the forest where something had, apparently, flown through the air with the speed of a bullet. Had it been a bullet? And had Olivia been a target? Frustrated, he rode back to where Olivia and Joey waited for him. “Nothing,” he said with a shrug. “Weird!” Joey said. “A small bird. That’s what it looked like from here. A dive-bombing bird.” “You saw it?” Dustin asked. “Well, not exactly. I just heard something.... And I thought I saw something whiz by close to Liv and Shiloh—a really fast bird, like I said—but I don’t know for sure. Maybe—” “We’ve got to head back,” Olivia broke in. “I have another session this afternoon.” “Not riding?” Dustin realized his tone was sharper than he’d intended. “No, just in the pasture. A group session.” “We get to stay until five,” Joey said. “Double with me against Sean and Matt at Ping-Pong?” he asked Dustin. “Okay. I’ll hang around,” Dustin said, looking at Olivia. She showed no reaction, and he couldn’t decide whether he was disappointed or relieved. As they rode back, Dustin kept watch on everything around them, still uneasy about the flying object that had whizzed by them all. It hadn’t been the world’s biggest bee. Or a dive-bombing bird. But neither, he thought, had it been a bullet. So what the hell...? True to her word, she allowed Joey and the horses their time to run. Then they returned to the stables. As good “guests,” he and Joey took care of their mounts. Joey was happy to give Trickster the promised apple. Dustin enjoyed watching him with the horse as he assured Trickster that it was much better to have an apple at the end of a ride than munch on lousy grass during it. He was still at the stables when Olivia went out with her next group; he wanted to keep an eye on her. But since she was surrounded by several people, he determined that she was going to be all right. If something was going to “happen” to her it wouldn’t be here—in front of others. Joey was waiting impatiently for him to play Ping-Pong. He decided he might as well oblige now. Matt and Sean were there, too, eager to take them on. Dustin played the game, paying heed to what was going on around him, as well. Sandra Cheever swept by, telling them all, in her usual curt tones, to play fair, and marched into Aaron’s office. He thought he heard the two of them arguing. When he and Joey took the game by a single point, he went to get coffee, trying to listen to what was being said in Aaron’s office. Sandra was speaking heatedly. Aaron was arguing with her in a soft, restrained voice. “Boy, and they’re supposed to be teaching us to get along!” Matt said sarcastically, coming up beside him. Dustin grimaced. “Have they been at it all afternoon?” “No.” Matt frowned. “I don’t think they were here. In fact, I know they weren’t. Aaron showed up about an hour ago and said hello to all of us. That was odd, ’cause usually there’s someone in the office all the time—when it’s open, I mean. Hey, rematch?” “Sure, just give me a minute,” Dustin told him. “I’ll meet you in the games room.” Matt nodded and sauntered off, and Dustin moved closer to the door. “It’s wrong. It’s just wrong!” Sandra Cheever was saying. “Look, it is what it is,” he heard Aaron reply. “Not necessarily,” Sandra said. “You’re going to have to take steps.” He didn’t get a chance to hear any more. Mariah Naughton came breezing in. “Hey, there, Secret Agent Man. I’m thrilled you guys are coming on the camping trip. Liv sometimes comes along, and I love it when she does. I guarantee that you’ll have a good time.” “I hear you tell great ghost stories.” She waved a hand. “Oh, well, the area’s full of them. I don’t tell anything new. You know all about the general, I take it, since you’re from around here.” “I’m certainly familiar with him.” “Nashville has great ghost stories, too!” she said enthusiastically. He nodded in response and she grinned. “Well, I hope we’re giving you the rest and relaxation you were looking for.” “Definitely. I’m falling in love with horses all over again.” “Well, that’s great, but...you have to fall in love with yourself again, too. That’s part of it.” “I’m on my way to finding out what I need,” he assured her. The door to the office flew open. Sandra Cheever burst out, looking somewhat flustered. Seeing the two of them, she regained her composure quickly. “You’re finished with your sessions for the day?” she asked Mariah. “Yes, all done.” “Well, good.” Sandra turned to Dustin. “As soon as Olivia comes in, we’ll close the office.” “Where’s Mason?” Mariah asked. “He had some business in Nashville this afternoon.” Sandra shook her head. “I’m ready to go home! This has been a long day and I’m exhausted.” She turned abruptly and left them. A minute later, Olivia came in. Before she could speak, Aaron hurried out of his office. “Hey, Liv. I’ve got the keys to Marcus’s house, if you want them. You don’t have to take them today, but I was thinking you might want to get those locks changed. Who knows how many keys Marcus might’ve had made to give to friends—or strangers!—who needed a place to stay.” “Thanks, Aaron. I will take them. I—I...think I’ll go by and just take a look at the place,” Olivia said. While she was with Aaron, Dustin sent a text to the office in Virginia, asking for Marcus’s address and directions to his house. He didn’t want to head out with Olivia. But he’d be damned if he’d let her go to that house alone. The Ping-Pong rematch would have to wait. Marcus Danby’s small ranch house really had no historic significance. It was little more than an extended log cabin with only one floor. The front door opened into a small hallway; immediately to the right was the kitchen and beyond that a spacious living-dining area. Marcus had furnished it with quilted throws and handcrafted furniture. There was Native American art on the walls and various sculptures; he’d loved dream catchers and there were a number of them scattered about. Olivia stepped into the living room, switched on a light and looked around. “Marcus?” she said aloud. There was no answer. A fine layer of dust was beginning to form on the furniture and objects. Other than that, it was just as Marcus had left it. Or so it appeared. Olivia glanced at the hall that led to the three small bedrooms. One he’d kept as a guest room, one was an office and one was his own. She walked into the living room and sat on one of the sofas. A quilt—hand-stitched by the grandmother of one of their guests who’d proven to be a success story—was draped over a sofa. The sofa had also been handcrafted by another former guest who’d started a furniture-making business. Marcus had always helped out, not just with his talks and the Horse Farm, but also by supporting those who were trying to make a new life for themselves. She looked at the coffee table, carved from the trunk of an old tree. There were a number of colored pages on it—drawings done by some of the boys who’d stayed at Parsonage House. “So, you’re being a jerk as a ghost, but you were one hell of a good guy, Marcus,” she said. She studied the drawings. She knew the boys were sometimes asked to draw what they saw as the demons of their pasts, and sometimes they were asked to draw what they saw as their futures. She picked up one that Joey had done. It was actually a good drawing. He’d portrayed a gaping black hole with demon eyes and razor-sharp teeth reaching into a sunlit room where he sat at a desk. Emptiness. Joey feared the emptiness of his life, she thought. Hearing a sound behind her, Olivia started, jumping to her feet and whirling around in one motion. It was Dustin. He still wore his casual tweed jacket over a denim shirt and the jeans he’d been wearing earlier. Somehow, she’d known that he’d come. He would come because Malachi had sent him here and because protecting her was part of his job description.","sourceLink":"https://allnovel.net/the-night-is-forever-krewe-of-hunters-11/page-20.html","bookId":2285,"book":{"id":2285,"title":"The Night Is Forever (Krewe of Hunters #11)","description":"Storyline: The Night Is Forever (Krewe of Hunters #11) A Ghost Rider in the Sky? What happened here, on a historic ranch outside Nashville, during the Civil War? And what\u0027s happening now? Olivia Gordon works at the Horse Farm, a facility that assists patients with mental and physical recovery; her specialty is animal therapy. She\u0027s always loved her job, always felt safe...until now. People are dying, starting with the facility\u0027s founder, whose body is discovered in a ravine on the property-site of a massacre in 1862. And before every death, Liv sees a horse and rider, wearing a soldier\u0027s garb, in the night sky.... Warning? Omen? Or clue? Liv calls in her cousin Malachi and his Krewe, an FBI unit of paranormal investigators, to discover the truth. New Krewe member Dustin Blake knows they need Liv\u0027s involvement in the case, yet he\u0027s worried about her safety. Because he and Liv quickly become more than colleagues...and he doesn\u0027t want to lose her to the endless night","cover":"https://allnovel.net/images/the-night-is-forever-krewe-of-hunters-11.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-night-is-forever-krewe-of-hunters-11.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:48:39 PM"}}
