{"id":91321,"no":35,"title":"Page 35","content":"\n “You’re really scaring the hell out of me,” Olivia muttered.\n “There’s more.”\n “What?”\n “Someone had an image of the general on his horse out in the forest. I don’t know much about art, but it’s on some kind of cheesecloth, which, I assume, would make it look ghostly in the right light. Frank Vine was the one to find it. That’s good, because it means he’s bought into our suspicions about what’s going on.”\n “I don’t understand. An artist drew a picture on gauzy cloth—and put it in the forest? Why?”\n “Because if you’re stumbling around at night or in the early morning—when the light’s hazy—you’d think you were seeing the general.”\n “But...wouldn’t you check to see if it was real?” Olivia asked.\n He grinned at her. “No, not most people. Most people would run like hell!”\n Olivia nodded thoughtfully. “Okay, so what would the image of the general in the forest have to do with someone attacking Aaron at the stream? And are you sure Aaron was attacked?”\n He shook his head impatiently. “No, I’m not one hundred percent sure, but anything else is unlikely. Aaron might just happen to have a little wound the size of an insect sting near the base of his neck. And I’ll admit I’m not one hundred percent sure of the connection between those two events—Aaron’s so-called accident and Mariah’s discovery—either.” He shrugged. “Maybe Mariah simply imagined that she heard the general speaking and then happened to wander into the woods where she found an image of him—and the torn-up carcass of a cow. Like I said, it’s unlikely, but...”\n “It is possible,” Olivia said a little stiffly.\n She pulled into her driveway and let out a little cry of dismay. Dustin frowned, looking toward the entry.\n There was a note on the door.\n “The alarm company came and went,” Olivia said. “I forgot all about them.”\n “So did I,” he told her. “Don’t worry. We’ll just reschedule them.”\n “I’d have liked to get the alarm system in today. Funny, I’ve lived by myself for several years and I’ve never been afraid. But now...”\n “Let’s call them right away,” Dustin suggested.\n “And after that?”\n “I have a few other calls to make. And for what it’s worth—I won’t be leaving. But we’ll put some faith in Sammy, too. He does seem to be an excellent watchdog.”\n Sammy was apparently attempting to prove it by barking ferociously. As they got out of the car, the dog bolted past them and went dashing around the house.\n “What is the matter with that dog?” Olivia asked, worried.\n “Dogs are sensitive. He senses that something’s going on,” Dustin answered. He smiled at her. “Hey, come on. You know that. You’re a therapist who works with animals.”\n “Yeah,” she said huskily. “I know he’s not barking for nothing, and that scares me even more.”\n She hurried over to the house, taking the sticker the alarm company had left before opening the door. Sammy came rushing back and swept by their legs as they entered.\n “Want me to call the alarm people?” he asked.\n “I can do it.”\n “Of course you can—but I’m happy to do it. I thought maybe you’d forage through the kitchen and find food.”\n Olivia laughed at that. “Okay, you get on the phone. I’ll look for food.”\n He sat in the living room and put a call through to the alarm company. They were exceptionally pleasant, completely understanding of an emergency and happy to reschedule for later that week.\n He could hear pots and pans and cutlery being moved about in the kitchen, so he went ahead and called the office. He spoke to Jackson Crow first, filling him in, and then he was put through to Malachi, who was eager to hear what was going on.\n “I told Jackson it’s pretty much out in the open now,” he explained to Malachi. “And the local lawman has been okay. I thought he was going to be difficult at first, but he came around. We’re dealing with Deputy Sheriff Frank Vine and Deputy Jimmy Callahan. Vine knows he doesn’t have the manpower to work on this. Oh, the medical examiner is all right, too. I brought him the bits of dart and the pieces of tree bark I took from the woods, and I’m waiting on a report from him now.”\n Malachi put him on hold while he had a quick discussion in the office. A moment later, he was back on the line. “I’m heading out there with Abby, Sloan and Jane. We don’t want to make an announcement or anything like that. We’ll just show up. We should be in by tomorrow afternoon.”\n “Good,” Dustin said. “Let us know when you’re in the vicinity. I’ll keep you posted on where we are.”\n As he ended the call, Olivia walked out of the kitchen. “There’s a casserole in the oven. I’ll be back down in ten. Oh, the guest room is across from mine upstairs. Make yourself at home.”\n He nodded, looking up at her. They were both the worse for wear, but even covered in trail dust with bedraggled hair, Olivia Gordon was...striking.\n “Thanks.” His voice sounded hoarse to his own ears. “Malachi and some of the Krewe will be here tomorrow,” he told her.\n “Really?” She seemed pleased. And yet, he thought, not as pleased as she would’ve been a few days earlier.\n Maybe he’d grown on her.\n “That’s great,” she said. “I mean...considering all the variables.”\n “Yeah, it’s good news.”\n “Not that you don’t know what you’re doing. You obviously do. You saved Aaron’s life this morning,” she said fervently.\n “Anyone with a few courses in emergency medicine could’ve done what I did—and I’m sure that you would have acted if I hadn’t been there.”\n “The thing is you found Aaron. You saved him. Will you excuse me? I’ll be down in a bit.”\n She turned and ran up the stairs. He found his backpack by the door and hiked it onto his shoulders, then followed her up. The door to the left was hers, he knew. He pushed open the opposite door and went into the guest room, where he set his backpack on the bed. He headed into the shower, trying not to think about the fact that she was across the hall.\n Naked.\n While the heat of the water felt wonderful, he didn’t want to tarry. And he didn’t—the hot water lasted a few minutes, and then it went cold. He stepped out, swearing softly, and remembered that while the bathroom was probably fairly new and up-to-date, the house itself was very old. Hot water just wasn’t going to last that long, not with two people showering at the same time.\n He dressed, got his computer from his bag and left the room.\n Sammy lay in the upstairs hallway between the two rooms, as if watching over both of them.\n “You’re a good old boy,” Dustin said, bending to scratch behind the dog’s ears.\n As he made his way down the stairs and into the kitchen, Sammy followed him. Dustin saw a bag of dog treats on the counter and offered him one. “You tried hard, didn’t you? You knew something wasn’t right the day Marcus was killed. I think you went after the killer. But the killer wasn’t really supplied with the customary murder weapons. No gun, no knife. So you were probably whacked with a good-size rock or maybe a branch. But you went up to the killer—close enough to get a walloping—because it was someone you trusted, huh?”\n “Talking to yourself?” Olivia asked, sweeping into the kitchen. Her hair was still damp. She was wearing a casual cotton halter dress and sandals. There was something compelling about her—the naturalness of her movements, her lack of makeup, the tempting scent of her soap.\n “Sammy is an excellent listener.”\n “And you were discussing...?”\n He smiled grimly. “Sammy and me? We were discussing my certainty that someone involved with the Horse Farm is doing this. I think Sammy trusted the person who hurt him.”\n “But if someone at the Horse Farm hurt him, wouldn’t he be afraid of that person now?”\n “Yes—unless the person threw something at him from a distance, maybe as Sammy approached. In that case, it’s possible he never associated the person with the action and the pain it caused him.”\n She walked past him and into the kitchen, pulling a casserole from the oven. “It’s just hamburger and potatoes, with a soup mix and crisp onion topping. Not very gourmet.”\n “I don’t think I’ve ever smelled anything better,” he said.\n Not true. He’d never smelled anything as good as her.\n “I’ll bring it out. There’s a dining table set up in the family room. You can eat and play on your computer at the same time,” she told him.\n She carried the casserole into the spacious back room. The table appeared to date from the early 1800s, and there were heat pads on it for protection. “Agent Blake, have a seat,” she said, placing the casserole on one of the pads.\n He was wondering how she’d managed anything other than the casserole, but she also put out a platter of raw vegetables and dip, along with glasses of sweet tea, plates and silverware.\n He’d opened the computer while she set up.\n She closed it as she joined him. “I’m starving, and I know you are, too.”\n “I am, and we can talk, which is almost as good as staring at a computer screen.”\n “Almost?”\n He was pretty sure he actually flushed. “Sorry. I didn’t mean it that way. It’s just that the facts and figures I need are in the computer.”\n “Where do you think Marcus has been lately?” she asked.\n “I assume he’s off trying to solve his own murder—except that he could help a lot more by hanging around with us.”\n “He never did like camping,” Olivia said. “Strange, because he loved nature so much. He loved a walk or a ride through the hills or along the stream.” She looked away quickly and he realized she was close to tears. You could accept the death of a loved one, but it often took time to really remember the good times and be able to smile and laugh at a memory. \n","sourceLink":"https://allnovel.net/the-night-is-forever-krewe-of-hunters-11/page-35.html","bookId":2285,"book":{"id":2285,"title":"The Night Is Forever (Krewe of Hunters #11)","description":"Storyline: \n The Night Is Forever (Krewe of Hunters #11) \n A Ghost Rider in the Sky? \n What happened here, on a historic ranch outside Nashville, during the Civil War? And what\u0027s happening now? \n Olivia Gordon works at the Horse Farm, a facility that assists patients with mental and physical recovery; her specialty is animal therapy. She\u0027s always loved her job, always felt safe...until now. \n People are dying, starting with the facility\u0027s founder, whose body is discovered in a ravine on the property-site of a massacre in 1862. And before every death, Liv sees a horse and rider, wearing a soldier\u0027s garb, in the night sky.... Warning? Omen? Or clue? \n Liv calls in her cousin Malachi and his Krewe, an FBI unit of paranormal investigators, to discover the truth. New Krewe member Dustin Blake knows they need Liv\u0027s involvement in the case, yet he\u0027s worried about her safety. Because he and Liv quickly become more than colleagues...and he doesn\u0027t want to lose her to the endless night\n \n","cover":"https://allnovel.net/images/the-night-is-forever-krewe-of-hunters-11.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-night-is-forever-krewe-of-hunters-11.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:48:39 PM"}}
