{"id":91325,"no":39,"title":"Page 39","content":"\\n\\n She knew it was.\\n\\n She didn’t cry. Her face, though, was pinched and tight. She was in shock, he thought. Two men she’d worked closely with, two men she saw almost every day, were dead. He wanted to tell her to cry, that it was all right.\\n\\n But she spoke before he could.\\n\\n “Have they informed the others yet?” she asked.\\n\\n “I think someone from the sheriff’s department was calling—trying to reach the Horse Farm to let Sydney and Drew know what happened. I’m sure they’ll try to contact Mason and Mariah, too. They’re going to pick up Sandra now.” He indicated a news van down the street, held back by an officer in uniform. “The media have picked up on it. The police always try to make the first notification.”\\n\\n “Of course. It’s dreadful to hear that something horrible has happened to someone you know via the TV or radio or— They’re going to pick up Sandra? Why? Sandra wasn’t even with Aaron when he...died....”\\n\\n “They have to rattle some cages. They’ll start interviewing everyone now, wanting to know where they were every second.”\\n\\n She nodded. “I’d like to go to the Horse Farm. I just want... I want to tell Sydney and Drew that we’ll do everything in our power.... That we’ll hang in there.” She looked at him. “Dustin, if someone wanted the Horse Farm—I’m the next person in line.”\\n\\n “Yes,” he agreed.\\n\\n “So people can’t be dying for the Horse Farm—I mean, there is no Horse Farm if we don’t have any clients. Any guests.”\\n\\n “I know.” Dustin looked straight ahead as he drove, hardly able to bear her stoicism, her emotional restraint. He knew she had to be suffering and understood that she wasn’t ready to express her grief.\\n\\n When they reached the Horse Farm, Olivia sighed audibly.\\n\\n Drew and Sydney had dragged a couple of feed crates out front. They sat on them—both cradling shotguns as they squinted down the road.\\n\\n Olivia hopped out of the car and approached them. “What the hell are you two doing?” she demanded.\\n\\n “You heard, right?” Sydney asked her thickly. “Aaron—he’s dead.”\\n\\n “In the bathtub,” Drew said. “Electrocuted. They’re saying it was an accident.”\\n\\n “Accident?” Sydney snorted. “Accident, my ass. We should’ve been listening to you a lot earlier, Olivia.”\\n\\n “You saved the poor bastard’s life,” Drew said, shaking his head at Dustin. “And then he goes and takes a bath!”\\n\\n “Who knew bathing could be lethal?” Sydney said dully.\\n\\n Olivia set a hand on his shoulder. “We’re all so sorry,” she said. “I’m going to miss him so much.”\\n\\n “What’s going to happen now?” Sydney asked.\\n\\n “We’ll—we’ll just go on. Somehow, we’ll go on. I’m going to get out a press release saying that we’re closed—in mourning. We’ll reopen in a few weeks,” Olivia said.\\n\\n “Horses have to eat,” Drew mumbled. “I can manage, though. And if you need financial help...”\\n\\n “Thank you.” She gave him a shaky smile. “But I think our operating sheets are pretty good. We can maintain the place for a few months without digging into anyone’s personal funds and if it comes to that—well, we’ll figure it out.” Olivia cleared her throat. “I don’t think the two of you need to sit here with shotguns.”\\n\\n “Yeah. We just need to stay out of bathtubs,” Drew said.\\n\\n “And out of the woods,” Sydney added.\\n\\n “Duck flying needles,” Drew muttered.\\n\\n “And darts,” Sydney agreed.\\n\\n “I have people coming in this afternoon,” Dustin told him. “We’ll get someone to stay here at the Horse Farm. I don’t think either of you is a target, though.”\\n\\n “Maybe someone wanted to kill Marcus to get this place, except that doesn’t make sense because of all the trusts and the nonprofit and...” Sydney’s voice trailed off. He shook his head and began again. “If there had been someone who wanted Marcus dead, logically it would’ve been Aaron. But now Aaron’s dead, and next in line is Olivia...and...”\\n\\n “Is Liv a target now?” Drew asked bluntly.\\n\\n “Maybe. But you don’t need to worry unduly. Some people will believe that what happened to Aaron was an accident. He was alone in his house—there was a deputy stationed outside it,” Dustin explained.\\n\\n “We had to go through this twice—thinking he died,” Drew said. “That isn’t fair.” He glanced at Dustin with a look of resignation on his face. “He’s really dead this time, huh?”\\n\\n Dustin thought about Aaron’s corpse in the bathtub. “He’s really dead,” he said. “I’m sorry. And I’m sure you’re safe enough. You can go into your apartments. Just be aware of whoever’s around. You have plenty of dogs here to bark if any cars drive in.”\\n\\n “Yeah,” Sydney told Drew. “We’ve got all the dogs.”\\n\\n “We’ll still keep the rifles handy,” Drew insisted.\\n\\n “Just don’t shoot each other, okay?” Olivia said, trying to smile.\\n\\n “We’ll solve this thing. Really,” Dustin promised.\\n\\n Sydney looked at him skeptically. “How do you solve accidents, Dustin? How do you solve accidents that happen when no one else is around?”\\n\\n “Someone else was around. And we’ll figure out who. Liv, come on. We’ve got to get to the station.”\\n\\n “You two take care,” Olivia told them.\\n\\n Andrew nodded. “Yep. We’ll take care. And you take care of Olivia, Dustin. Agent Blake. Don’t you let anything happen to her!” he said fiercely.\\n\\n “I’m going to be fine,” Olivia vowed. She let Dustin lead her to the car. He could tell that she was trembling.\\n\\n “You are going to be fine,” he murmured.\\n\\n He drove to the station. She sat beside him, pale and silent.\\n\\n “Olivia?” he said quietly.\\n\\n She turned to him. “I can’t grasp it! I can’t seem to grasp it. Aaron is really dead. I feel...numb. I should hurt more. A friend and a colleague is dead. I cared about Aaron. I just feel...numb.”\\n\\n “You’ll cry in time,” he said. “Being numb right now is probably good. It’s a kind of emotional protection. We still have a ways to go until we get to the end of this case so being numb will help you get through it.”\\n\\n “If I do feel anything...I’m angry.”\\n\\n “Anger isn’t a bad thing, either.”\\n\\n She was silent again until they arrived at the station. A deputy led them down a hall and into an observation area. It abutted an interrogation room with a one-way mirror. While Sandra could only see her own reflection, they could watch her sitting at a table. She looked lost and alone and she’d obviously been crying. For a moment, Dustin wondered if she could be involved in any way. She appeared to be stricken—with grief? Or remorse? She hadn’t been the one to kill Aaron, but did she know who had? Was Sandra’s not being at the house on purpose?\\n\\n Frank Vine opened the door and came in to join them. “Hell, Dustin, do you really think this woman could’ve had anything to do with Aaron’s death? She really looks like she’s been through the wringer.”\\n\\n “Just go in and talk to her, Frank. Ask her if she can imagine why anyone would want to hurt Aaron,” Dustin said.\\n\\n “All right.” He sighed heavily. “You do realize that to anyone else in law enforcement, I’d look like an idiot. An old addict’s dead and a man—who was apparently alone in his house with a cop watching—electrocuted himself in a bathtub.”\\n\\n “But you know that someone’s been running around with drugged darts. That’s a fact,” Dustin reminded him. “Frank, come on. First, Aaron pitches forward into a stream and nearly dies in two feet of water. Then he’s electrocuted in a bathtub?”\\n\\n “The man should have stayed dirty,” Frank muttered as he left them in the observation room and went in to sit across from Sandra.\\n\\n Jimmy Callahan slipped into the room with Dustin and Olivia. He nodded to both of them. “Think this’ll help?” he asked.\\n\\n “We’ve got to try everything,” Dustin told him.\\n\\n Then he grew silent and they all watched Sandra as the interrogation began.\\n\\n Sandra almost pounced on Frank. “Frank, what am I doing in here? This is one of the worst days of my life! It is the worst day of my life. The man I loved is dead, my work is in the toilet—no, it’s already flushed away. Oh, that doesn’t matter. Aaron is dead! And you have me here, treating me like...like some kind of suspect. I need to lie down. I need to be sedated. I want to sleep. I want to forget everything that’s happened. I want to dream that it hasn’t happened.”\\n\\n “Sandra, we believe you may be able to help us,” Frank said.\\n\\n “How?” Sandra dragged her fingers through her hair. “Frank, I wasn’t there. I should’ve been there. But it might not have made any difference,” she added in a low voice, “because I might not have been in the bathroom with him when he did whatever he did. And then you would really have suspected me. I loved Aaron. Oh, the others cared about him, too. We’re a family. We all care about one another. But I loved him. We were going to officially announce that we were seeing each other. We were going to get married, Frank. I was going to be his wife!”\\n\\n Sandra broke down in tears, sobbing hysterically. Frank pushed a box of tissues across the table to her.\\n\\n “I’m sorry, Sandra. I’m very sorry for your loss. But if you loved him, you’ll want to help us.”\\n\\n Sandra nodded, took a tissue and mopped her face. “How can I help in any way? I don’t know what happened!”\\n\\n “Why was Aaron so determined to leave the hospital so quickly?”\\n\\n Sandra waved a hand in the air. “Because he was being Aaron! He’d recovered from his near-drowning, and there was no reason for him to be in the hospital. He didn’t even have a headache, he told me. He was fine and he wanted to go home.” \\n\\n","sourceLink":"https://allnovel.net/the-night-is-forever-krewe-of-hunters-11/page-39.html","bookId":2285,"book":{"id":2285,"title":"The Night Is Forever (Krewe of Hunters #11)","description":"Storyline: The Night Is Forever (Krewe of Hunters #11) \\n A Ghost Rider in the Sky? \\n What happened here, on a historic ranch outside Nashville, during the Civil War? And what\u0027s happening now? \\n Olivia Gordon works at the Horse Farm, a facility that assists patients with mental and physical recovery; her specialty is animal therapy. She\u0027s always loved her job, always felt safe...until now. \\n People are dying, starting with the facility\u0027s founder, whose body is discovered in a ravine on the property-site of a massacre in 1862. And before every death, Liv sees a horse and rider, wearing a soldier\u0027s garb, in the night sky.... Warning? Omen? Or clue? \\n Liv calls in her cousin Malachi and his Krewe, an FBI unit of paranormal investigators, to discover the truth. New Krewe member Dustin Blake knows they need Liv\u0027s involvement in the case, yet he\u0027s worried about her safety. Because he and Liv quickly become more than colleagues...and he doesn\u0027t want to lose her to the endless night\\n","cover":"https://allnovel.net/images/the-night-is-forever-krewe-of-hunters-11.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-night-is-forever-krewe-of-hunters-11.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:48:39 PM"}}
