{"id":91326,"no":40,"title":"Page 40","content":"\\n\\n “Sandra, did you let anyone know when Aaron was going home?” Frank asked.\\n\\n “Yes. No. Well, kind of,” Sandra said.\\n\\n “Who?”\\n\\n “I called the Horse Farm to tell everyone that he was doing well and getting ready to check out.”\\n\\n “Who did you talk to?”\\n\\n “I left a message,” Sandra replied. “No one answered, but I know our group. They wouldn’t have been able to stay away from the farm. Our therapists would’ve gone out to check on Sydney and Drew...who might well have gone into the office.”\\n\\n “Okay, Sandra. The morning you were all camping, where were you when Mariah screamed?”\\n\\n “When Mariah screamed...” Sandra repeated dully.\\n\\n Frank leaned forward. “Sandra, listen. First Aaron falls into the stream and nearly dies. Then he does die at home in the bathtub? Supposedly alone.”\\n\\n “Stop it! Stop it, Frank! I didn’t kill him. I. Wasn’t. There!” she said, enunciating clearly.\\n\\n “You didn’t answer my question. Where were you when Mariah screamed?”\\n\\n “In my tent!”\\n\\n “And right after?”\\n\\n “Outside the tent—running around like an idiot. Watching the boys. Olivia grabbed Drew and went racing toward the sound.”\\n\\n “You loved Aaron, but you didn’t notice he wasn’t at the campsite with you?”\\n\\n “Frank. We were asleep. Suddenly, there’s this high-pitched scream. We jumped up. Aaron could have been peeing, for God’s sake!”\\n\\n “All right, Sandra,” he said quietly. “I’m going to have a deputy take you home. I just have one more question. If you called the Horse Farm and left a message, why did you drop Aaron off and then go there?”\\n\\n She sighed. “Aaron wanted me to. He asked if I’d reached anyone. I told him no, that I’d gotten voice mail. He asked if I’d go check in on Drew and Sydney, tell them he was feeling just fine and that he planned to be in the next morning. I was supposed to say we’d have a powwow so we could work on saving the Horse Farm. Not much hope of that now, huh?” she asked, and started to weep again.\\n\\n When Frank rose, he placed a comforting hand on her shoulder. “Someone’s going to take you home right now. Or would you prefer to go to the hospital? They can fix you up with something that’ll help you sleep.”\\n\\n Sandra sniffled. “Home,” she said. She looked tearfully at Frank. “Yeah, I know. I run the Horse Farm. Where we work with substance abusers. But I have a stash of sedatives at home for when I need them. I...occasionally have problems sleeping. Don’t worry. I never abuse them. I know better than that.”\\n\\n Frank nodded. “Fine. Shall we go?”\\n\\n As Frank rose to open the door for Sandra, Dustin felt his phone vibrate. He reached for it.\\n\\n Both Olivia and Jimmy Callahan watched him.\\n\\n “Sorry,” he murmured. He glanced down at his phone and immediately saw a text message from Malachi.\\n\\n “It’s your cousin,” he told Olivia. “I’m going to have him and the others meet us at your house.”\\n\\n She nodded in agreement.\\n\\n Callahan stepped aside as Frank came in. “Okay, I questioned her like you wanted, but I’m not sure where that got us. Unless it’s a massive conspiracy and both Sydney and Drew are in on it, Sandra can’t have had anything to do with this. What she says is true. She dropped Aaron off and drove to the Horse Farm. He died before she ever got back to the house.” He exhaled with frustration. “So. I questioned a grieving woman in tears. To what end?”\\n\\n “I’m not sure yet, Frank. It might have proven that she had an accomplice,” Dustin said. “Someone could have been in that house—waiting for Aaron. Someone who knew when to be there, because Sandra had told that person when he was leaving the hospital and heading home. And she did make sure that both Drew and Sydney saw her.”\\n\\n “You’re going to have to come up with a hell of a lot more than that.”\\n\\n “I know,” Dustin assured him. “Can you make sure Dr. Wilson calls me when he’s doing the autopsy?”\\n\\n “He’ll be on it this afternoon. I talked to him about thirty minutes ago.”\\n\\n “Thanks. I’ll go over to the morgue in about an hour.”\\n\\n “You should catch him right in the middle of it,” Frank said. “He only had one other body—an old-timer who keeled over eating his oatmeal. He’ll be getting on to this one pretty fast.”\\n\\n Frank turned to Olivia. “Did you see Sandra when you got up yesterday morning at the campsite?”\\n\\n “I practically collided with her when I burst out of the tent at the sound of the scream,” Olivia said.\\n\\n “Did you see her?” Frank asked Dustin.\\n\\n “No. We’d been up during the night,” Dustin said. “I woke up and found Aaron on his way to the women’s tent. He was worried because he didn’t see Mariah—who’d gone to the stream for water. When Mariah came back, half the campers were awake and Sandra was annoyed. She just wanted to get back to sleep. I stayed out by the campfire for a while, waiting to see if anyone got up again. I went back into my tent, and I heard Aaron stirring, but then Mariah screamed and I went chasing after her.”\\n\\n “Sandra was outside when I came out of the tent,” Olivia said. “But Dustin didn’t see her when he ran ahead, a few minutes before I stepped out.”\\n\\n “But she could have come out of the tent just before you did?” Frank asked.\\n\\n “It’s possible, yes,” Olivia agreed.\\n\\n “Sorry to interrupt, but we’ve got to get moving,” Dustin said. “I do want to be there for that autopsy, and we’ve got friends coming to Olivia’s.”\\n\\n “You’re going to make sure I get to know your friends, right?” Frank’s question wasn’t really a question.\\n\\n “You bet,” Dustin promised.\\n\\n Frank nodded. “Stay in close contact.”\\n\\n “We will.”\\n\\n Jimmy Callahan opened the door for them, tipping his hat. “Liv, take care of yourself,” he said quietly.\\n\\n As they left the station and drove to Olivia’s house, Dustin noted that she still looked shell-shocked. He wished he could do something to ease the pain and confusion she must be feeling—and he knew it was only going to get worse once she got over the sense of numbness. It protected her, to some extent, from the full reality of her losses. Still, her whole world had to be reeling.\\n\\n When they pulled into the yard, she let out a yelp of joy, leaping out of the car before he’d turned off the motor.\\n\\n Malachi Gordon stood on the porch. He was with the very tall cowboy agent Dustin had met at the office, Sloan Trent, and two women. He quickly realized that the women were Jane Everett and Abby Anderson. He hadn’t had a chance to meet all his fellow Krewe unit members before he’d gone to Tennessee, but he’d studied some of the information on them. Jane Everett was an artist who had frequently worked with the Texas police before joining the Texas Krewe. Sloan Trent had joined after working with Jane on a situation in Lily, Arizona. Abby Anderson and Malachi were a couple; they’d met when Jackson Crow brought Malachi in on serial killings that had occurred in Savannah.\\n\\n Olivia wasn’t bothering with formality at the moment. She ran over and was lifted into her cousin’s arms to be greeted, hugged and swung around. Introductions were made, Olivia telling the others that she’d heard good things about them. She dug in her pocket for her keys, but even as she twisted the lock, they heard something behind the door, which appeared to move as if someone was trying to open it from within.\\n\\n Inside the house, Sammy began to bark excitedly.\\n\\n “I’ve got it,” Dustin murmured, pushing her aside. The Krewe members instantly went into alert mode, drawing their weapons. Malachi pulled Olivia against the wall as Dustin drew his own weapon and threw open the door.\\n\\n Sammy nearly knocked him over, jumping up with jubilation. Dustin holstered his weapon and stepped inside, greeting the dog and firmly ordering him down. But as he stepped into the entry, he heard excited words.\\n\\n “I did it! I touched the door. I touched the door and it almost moved. I am getting some kind of...some kind of spiritual or ectoplasmic strength!”\\n\\n Marcus Danby had finally decided to make himself known once again.\\n\\n 15\\n\\n Olivia understood why Malachi had changed his life—why he’d stopped working for himself to become part of the Krewe.\\n\\n She’d known plenty of people who would get excited and swear they’d seen General Rufus Cunningham seated atop his warhorse up on a hill.\\n\\n She’d never believed that there were so many people who actually spoke with the dead and that she could sit in her own parlor serving tea to the living while the ghost of Marcus Danby was among them, repeating everything he’d told Olivia and then Dustin. It had been hard, he’d explained to her, to be somewhere. Long conversations wore him out. When he got too tired, he assumed he was in some kind of “ghost sleep” because he knew he faded, and he wasn’t sure where he was. It seemed that he needed to rest in order to gain the strength to manifest himself again. He was thrilled that he’d managed to make it look as if there was someone on the other side of the door; he was heartbroken and disturbed to discover that Aaron Bentley had now joined his ranks. He went from deep sorrow to brightness in a whirl of emotions, astounded that he was facing six people who could see and hear him.\\n\\n Dustin told the other Krewe members and Marcus everything that happened during the camping trip and what had occurred so far that day. Malachi listened gravely, then asked, “The deputy sheriff in charge, Frank Vine, he’s really come around? He’s ready to have us here?”\\n\\n Dustin nodded. “He wants to meet you all and he’s asked that we keep him in the loop. And the medical examiner is a great guy. He had the fragments of the dart I found analyzed, so they’re all aware that these deaths aren’t accidents at all. It’s been impossible, of course, to have someone on guard everywhere. The deputy should’ve gone in with Aaron this morning. But despite the information about the dart and the fact that Aaron nearly died, I don’t believe anyone thought the killer could possibly be in his house, ready to finish him off.” \\n\\n","sourceLink":"https://allnovel.net/the-night-is-forever-krewe-of-hunters-11/page-40.html","bookId":2285,"book":{"id":2285,"title":"The Night Is Forever (Krewe of Hunters #11)","description":"Storyline: The Night Is Forever (Krewe of Hunters #11) \\n A Ghost Rider in the Sky? \\n What happened here, on a historic ranch outside Nashville, during the Civil War? And what\u0027s happening now? \\n Olivia Gordon works at the Horse Farm, a facility that assists patients with mental and physical recovery; her specialty is animal therapy. She\u0027s always loved her job, always felt safe...until now. \\n People are dying, starting with the facility\u0027s founder, whose body is discovered in a ravine on the property-site of a massacre in 1862. And before every death, Liv sees a horse and rider, wearing a soldier\u0027s garb, in the night sky.... Warning? Omen? Or clue? \\n Liv calls in her cousin Malachi and his Krewe, an FBI unit of paranormal investigators, to discover the truth. New Krewe member Dustin Blake knows they need Liv\u0027s involvement in the case, yet he\u0027s worried about her safety. Because he and Liv quickly become more than colleagues...and he doesn\u0027t want to lose her to the endless night\\n","cover":"https://allnovel.net/images/the-night-is-forever-krewe-of-hunters-11.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-night-is-forever-krewe-of-hunters-11.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:48:39 PM"}}
