{"id":91333,"no":47,"title":"Page 47","content":"\\n\\n “But Marcus Danby deserves justice. You know that.”\\n\\n “I do.”\\n\\n “But...” he began. He didn’t finish. It was almost as if he regretted speaking at all.\\n\\n “But?” she demanded. “Don’t you dare give me a ‘but’ and then go silent!”\\n\\n He looked over at her. For a moment she wished she’d met him under better circumstances. She loved the line of his jaw, the strength of his conviction and inner resolve and, admittedly, she loved lying in bed with him....\\n\\n “Jackson would find a place for you,” he murmured. “Jackson Crow. Working with one of the units. You could even be based in northern Virginia.”\\n\\n She laughed. “Dustin, I know how to fire a tranquilizer gun, but I’ve never held a real firearm in my life. I’m a coward!”\\n\\n “If we didn’t have the sense to be afraid, we’d be worthless. Fear can consume you—or it can make you wary and intelligent about what you do and how you do it. I’m just saying that if you were looking to move...on to something else...”\\n\\n “If the Horse Farm goes under and we’re forced to find homes for the animals and sell the land, I’ll have to,” she said.\\n\\n “It hasn’t happened.”\\n\\n “It is happening.”\\n\\n He squeezed her hand again. “We’ll find the truth, and the truth could repair all the harm that’s been done.”\\n\\n “So far it looks as if our founder died of an overdose and our first-in-command was so off his rocker that he nearly drowned and then managed to electrocute himself in his bathtub. The other alternative—to the average observer—is that one or more people who work at the Horse Farm is a devious, bloodthirsty murderer.”\\n\\n “The truth could still salvage the situation,” he insisted. “Whatever that truth is.”\\n\\n They’d driven off I-40 and taken the back road. She could see the café ahead; the SUV in which Malachi and his team had arrived was parked in the lot.\\n\\n Olivia braced herself to go in.\\n\\n The Krewe agents already had the largest table at the café, the one at the far end, away from the door. As Olivia and Dustin walked through to join them, Delilah was serving a coffee refill to a lone tourist. She returned the pot to the burner and came toward them and, as Olivia had feared, she threw both arms around her in a huge hug. The last thing Olivia felt she could cope with right now was pity.\\n\\n “Oh, honey, I am so sorry. I can’t imagine how hard this is for you—all of you. But Sandra, well, she’s a tough bird, and Mariah and Mason just aren’t as invested... Oh, and poor Drew and Sydney! What will they do? They’ve both given their lives to that place!” Delilah said. “Anyway, I’m so sorry about Aaron! Now,” she added briskly, “what can I get you, love?”\\n\\n “Iced tea would be great, Delilah.”\\n\\n “Same for me,” Dustin said.\\n\\n “Well, this table is just one big group of tea drinkers!” Delilah chuckled. “I have chicken potpie tonight, and if I do say so myself, it’s the best!”\\n\\n “Chicken potpie?” Malachi asked, looking around the table to nods of assent. “We’ll make it easy, Delilah. We’ll all have potpie.”\\n\\n “Why, that is easy!” Beaming, Delilah bustled off to fill their order.\\n\\n “I see you’ve gotten to know her,” Olivia said to the others.\\n\\n Jane smiled. “It’s impossible not to get to know Delilah.”\\n\\n “What did you learn?” Malachi asked.\\n\\n “Aaron bought the drawing of the general,” Dustin said, getting right to the point.\\n\\n “You’re sure?”\\n\\n “I know his handwriting—and I know Horse Farm checks,” Olivia said.\\n\\n “But,” Abby argued, “his buying the art doesn’t mean he put it in the forest during the camping trip. Or even if he did, it might have been a practical joke.”\\n\\n “We don’t play practical jokes,” Olivia said. “Not when we’re dealing with kids who are struggling with addiction or other issues.”\\n\\n “He might have intended it for some other purpose,” Malachi said. “Maybe he bought the artwork and then someone else discovered it—and took it.”\\n\\n “And used his horse?” Olivia asked grimly. “I suppose that if anyone had a motive to kill Marcus, it would’ve been Aaron. And, of course, if anyone had a motive to kill Aaron...people would think it’s me.”\\n\\n “Except,” Dustin pointed out, “by the time it got to you, so much damage would be done to the Horse Farm’s reputation that you really wouldn’t have a motive to kill him—certainly not this quickly.”\\n\\n “Shh,” Malachi warned.\\n\\n Delilah came sweeping down on them with a massive tray. Chicken potpies were served with a large plate of biscuits. Delilah fluttered around the table, making sure they had butter, jam and honey for the biscuits, silverware and iced tea refills. When she was finished, she said, “Olivia, honey, have you heard from that lawyer fellow yet?”\\n\\n Olivia shook her head, feeling a little guilty. “No, I haven’t. I do need to call him.”\\n\\n “Well, I just wanted to let you know. One of my regulars—another attorney fellow who runs back and forth between Nashville and Memphis—was asking me about it. I just wanted you to know that if it comes to selling, which of course I hope it won’t, he’ll buy the place. He’ll meet the price Marcus always wanted so the money could go to his charities. If you have to sell, you let me know.”\\n\\n Olivia forced a smile. “Thanks, Delilah.”\\n\\n “Who is this attorney, Delilah?” Dustin asked.\\n\\n “Name is Henry Whittaker. His main office is in Nashville. I’m sure you can find him easy enough. If not, I’ve got his card somewhere.”\\n\\n She beamed at them again and swept off.\\n\\n “We’ve been thinking about this all wrong,” Dustin said.\\n\\n Olivia gave him a puzzled look. “How do you mean?”\\n\\n “Well, we suspected Aaron might have killed Marcus—because he’d get to be in charge of the Horse Farm. But Aaron’s out of the picture. I don’t think someone wants to kill everyone in order to run the Horse Farm. I think someone wants it to fail.”\\n\\n “But why?” Olivia asked.\\n\\n “That’s what we have to figure out. Sloan, anything on the women today?”\\n\\n “Sandra Cheever never left her house. I followed Mariah to the Horse Farm and she saw both Sydney and Drew, hugged them a lot, cried a little—and then I followed her back to her place. She didn’t leave again. There’s still a deputy watching over Sandra.” He glanced at Olivia. “I called the office in Virginia and had a trace put on your boy Mason’s credit cards. He’s been in Nashville. Last uses were at the Country Music Hall of Fame and then a restaurant on Music Row.”\\n\\n “We can’t solve anything tonight. I say we eat our potpies and get a good night’s sleep,” Malachi told them.\\n\\n “I’m going to take Liv for a drive first,” Dustin said. “I think we should stop in and see the Horse Farm guests who live at Parsonage House.”\\n\\n Olivia nodded. She wasn’t sure what they’d get from the boys, but she agreed that it was a good idea for her, as one of their therapists, to see them. They must be in shock. None of them had been particularly close to Aaron, but they knew him.\\n\\n And now he was dead.\\n\\n As she and Dustin left the diner, Malachi requested the keys to Marcus Danby’s house. Dustin must have discussed the plans with him while she was in the restroom. She found the keys in her bag; as she handed them to her cousin, she asked, “Do you think anyone’s made any attempt to get in there? Is there something they could be looking for?”\\n\\n “We’ll go through whatever papers we can find. Sometimes even a greeting card can be a clue. Or he might have received some other correspondence that didn’t seem significant to him at the time,” Malachi replied.\\n\\n “You don’t think you’re in any danger there, do you?”\\n\\n He shrugged. “I doubt it, but it’s not impossible. Marcus doesn’t understand why anyone would kill him so there’s definitely some unknown factor here. However, Abby and I are both well trained and,” Malachi added with a grin, “we’re armed.”\\n\\n When they’d all said good-night, Olivia and Dustin drove the short distance to Parsonage House. They were greeted by the director, Lance Osterly, a kindly, middle-aged man who still had the look of a pro wrestler—which he’d been at one point in his life.\\n\\n “Liv, good to see you,” he greeted her as he waved them both in. He nodded at Dustin. “And you’re the FBI man, right? The boys talk a lot, you know,” he said with a wink.\\n\\n Dustin offered his hand to Osterly.\\n\\n “I’m sorry about Aaron,” Osterly told Olivia.\\n\\n “I am, too. It’s so strange—I don’t even know how to handle this one,” she said.\\n\\n Osterly shook his head. “The poor guy survives what should’ve killed him, and he still dies in a ridiculous way. The kids have talked of nothing else for the past few days. Anyway, I appreciate that you’re here. Come on—they’re outside on the patio.”\\n\\n Osterly escorted them to a back door, which led to a pool and patio; the pool was covered until warmer weather returned but the patio was pretty with a rock wall fireplace and plenty of seating.\\n\\n “Liv!” Joey was the first on his feet, rushing over to her. She thought of him as a boy, but he wasn’t really; he was an adolescent, taller than her—and awkward, as many young men his age were. She greeted him with a hug. By then, Matt, Sean and Nick had joined them, and she realized that although they were once-upon-a-time tough-guy addicts, now they were scared.\\n\\n “You’re all doing okay?” Dustin asked them.\\n\\n “We’re—we’re in an awful dilemma,” Matt said. “We know we’re okay and everything will be fine, but our parents are acting paranoid.” \\n\\n","sourceLink":"https://allnovel.net/the-night-is-forever-krewe-of-hunters-11/page-47.html","bookId":2285,"book":{"id":2285,"title":"The Night Is Forever (Krewe of Hunters #11)","description":"Storyline: The Night Is Forever (Krewe of Hunters #11) \\n A Ghost Rider in the Sky? \\n What happened here, on a historic ranch outside Nashville, during the Civil War? And what\u0027s happening now? \\n Olivia Gordon works at the Horse Farm, a facility that assists patients with mental and physical recovery; her specialty is animal therapy. She\u0027s always loved her job, always felt safe...until now. \\n People are dying, starting with the facility\u0027s founder, whose body is discovered in a ravine on the property-site of a massacre in 1862. And before every death, Liv sees a horse and rider, wearing a soldier\u0027s garb, in the night sky.... Warning? Omen? Or clue? \\n Liv calls in her cousin Malachi and his Krewe, an FBI unit of paranormal investigators, to discover the truth. New Krewe member Dustin Blake knows they need Liv\u0027s involvement in the case, yet he\u0027s worried about her safety. Because he and Liv quickly become more than colleagues...and he doesn\u0027t want to lose her to the endless night\\n","cover":"https://allnovel.net/images/the-night-is-forever-krewe-of-hunters-11.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-night-is-forever-krewe-of-hunters-11.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:48:39 PM"}}
