{"id":66447,"no":10,"title":"Page 10","content":"TWENTY-FOUR\n REACHER DRESSED AGAIN AND ALL THREE OF THEM TOOK MUGS OF fresh coffee to the living room, which was a narrow rectangular space with furniture arranged in an L-shape along two walls, and a huge flat screen television on a third wall. Under the screen was a rack loaded with audio-visual components all interconnected with thick wires. Flanking the screen were two serious loudspeakers. Set into the fourth wall was an undraped picture window that gave a great view of a thousand acres of absolutely nothing at all. Dormant lawn, the post-and-rail fence, then dirt all the way to the horizon. No hills, no dales, no trees, no streams. But no trucks or patrols, either. No activity of any kind. Reacher took an armchair where he could see the door and the view both at the same time. The doctor sat on a sofa. His wife sat next to him. She didn\u0027t look enthusiastic about talking.\n Reacher asked her, \u0027How old were you when Dorothy\u0027s kid went missing?\u0027\n She said, \u0027I was fourteen.\u0027\n \u0027Six years older than Seth Duncan.\u0027\n \u0027About.\u0027\n \u0027Not quite in his generation.\u0027\n \u0027No.\u0027\n \u0027Do you remember when he first showed up?\u0027\n \u0027Not really. I was ten or eleven. There was some talk. I\u0027m probably remembering the talk, rather than the event.\u0027\n \u0027What did people say?\u0027\n \u0027What could they say? No one knew anything. There was no information. People assumed he was a relative. Maybe orphaned. Maybe there had been a car wreck in another state.\u0027\n \u0027And the Duncans never explained?\u0027\n \u0027Why would they? It was nobody\u0027s business but theirs.\u0027\n \u0027What happened when Dorothy\u0027s little girl went missing?\u0027\n \u0027It was awful. Almost like a betrayal. It changed people. A thing like that, OK, it puts a scare in you, but it\u0027s supposed to have a happy ending. It\u0027s supposed to turn out right. But it didn\u0027t.\u0027\n \u0027Dorothy thought the Duncans did it.\u0027\n \u0027I know.\u0027\n \u0027She said you stood by her.\u0027\n \u0027I did.\u0027\n \u0027Why?\u0027\n \u0027Why not?\u0027\n Reacher said, \u0027You were fourteen. She was what? Thirty? Thirty-five? More than twice your age. So it wasn\u0027t about solidarity between two women or two mothers or two neighbours. Not in the normal sense. It was because you knew something, wasn\u0027t it?\u0027\n \u0027Why are you asking?\u0027\n \u0027Call it professional interest.\u0027\n \u0027It was a quarter of a century ago.\u0027\n \u0027It was yesterday, as far as Dorothy is concerned.\u0027\n \u0027You\u0027re not from here.\u0027\n \u0027I know,\u0027 Reacher said. \u0027I\u0027m on my way to Virginia.\u0027\n \u0027So go there.\u0027\n \u0027I can\u0027t. Not yet. Not if I think the Duncans did it and got away with it.\u0027\n \u0027Why does it matter to you?\u0027\n \u0027I don\u0027t know. I can\u0027t explain it. But it does.\u0027\n \u0027The Duncans get away with plenty, believe me. Every single day.\u0027\n \u0027But I don\u0027t care about that other stuff. I don\u0027t care who gets their harvest hauled or when or how much they pay for it. You all can take care of that for yourselves. It\u0027s not rocket science.\u0027\n The doctor\u0027s wife said, \u0027I was the Duncans\u0027 babysitter that year.\u0027\n \u0027And?\u0027\n \u0027They didn\u0027t really need one. They rarely went out. Or actually they went out a lot, but then they came right back. Like a trick or a subterfuge. Then they would be real slow about driving me home. It was like they were paying me to be there with them. With all four of them, I mean, not just with Seth.\u0027\n \u0027How often did you work for them?\u0027\n \u0027About six times.\u0027\n \u0027And what happened?\u0027\n \u0027In what way?\u0027\n \u0027Anything bad?\u0027\n She looked straight at him. \u0027You mean, was I interfered with?\u0027\n He asked, \u0027Were you?\u0027\n \u0027No.\u0027\n \u0027Did you feel in any danger?\u0027\n \u0027A little.\u0027\n \u0027Was there any inappropriate behaviour at all?\u0027\n \u0027Not really.\u0027\n \u0027So what was it made you stand by Dorothy when the kid went missing?\u0027\n \u0027Just a feeling.\u0027\n \u0027What kind of a feeling?\u0027\n \u0027I was fourteen, OK? I didn\u0027t really understand anything. But I knew I felt uncomfortable.\u0027\n \u0027Did you know why?\u0027\n \u0027It dawned on me slowly.\u0027\n \u0027What was it?\u0027\n \u0027They were disappointed that I wasn\u0027t younger. They made me feel I was too old for them. It creeped me out.\u0027\n \u0027You felt too old for them at fourteen?\u0027\n \u0027Yes. And I wasn\u0027t, you know, very mature. I was a small girl.\u0027\n \u0027What did you feel would have happened if you had been younger?\u0027\n \u0027I really don\u0027t want to think about it.\u0027\n \u0027And you told the cops about how you felt?\u0027\n \u0027Sure. We all told them everything. The cops were great. It was twenty-five years ago, but they were very modern. They took us very seriously, even the kids. They listened to everybody. They told us we could say anything, big or small, important or not, truth or rumour. So it all came out.\u0027\n \u0027But nothing was proved.\u0027\n The doctor\u0027s wife shook her head. \u0027The Duncans were clean as a whistle. Pure as the driven snow. I\u0027m surprised they didn\u0027t get the Nobel prize.\u0027\n \u0027But still you stood by Dorothy.\u0027\n \u0027I knew what I felt.\u0027\n \u0027Did you think the investigation was OK?\u0027\n \u0027I was fourteen. What did I know? I saw dogs and guys in FBI jackets. It was like a television show. So yes, I thought it was OK.\u0027\n \u0027And now? Looking back?\u0027\n \u0027They never found her bike.\u0027\n The doctor\u0027s wife said that most farm kids started driving their parents\u0027 beat-up pick-up trucks around the age of fifteen, or even a little earlier, if they were tall enough. Younger or shorter than that, they rode bikes. Big old Schwinn cruisers, baseball cards in the spokes, tassels on the handlebars. It was a big county. Walking was too slow. The eight-year-old Margaret had ridden away from the house Reacher had seen, down the track Reacher had seen, all knees and elbows and excitement, on a pink bicycle bigger than she was. Neither she nor the bike was ever seen again.\n The doctor\u0027s wife said, \u0027I kept on expecting them to find the bike. You know, maybe on the side of a road somewhere. In the tall grass. Just lying there. That\u0027s what happens on the television shows. Like a clue. With a footprint, or maybe the guy had dropped a piece of paper or something. But it didn\u0027t happen that way. Everything was a dead end.\u0027\n \u0027So what was your bottom line at the time?\u0027 Reacher asked. \u0027On the Duncans? Guilty or not guilty?\u0027\n \u0027Not guilty,\u0027 the woman said. \u0027Because facts are facts, aren\u0027t they?\u0027\n \u0027Yet you still stood by Dorothy.\u0027\n \u0027Partly because of the way I felt. Feelings are different than facts. And partly because of the aftermath. It was horrible for her. The Duncans were very self-righteous. And people were starting to wake up to the power they had over them. It was like the thought police. First Dorothy was supposed to apologize, which she wouldn\u0027t, and then she was supposed to just shut up and carry on like nothing had ever happened. She couldn\u0027t even grieve, because somehow that would have been like accusing the Duncans all over again. The whole county was uneasy about it. It was like Dorothy was supposed to take one for the team. Like one of those old legends, where she had to sacrifice her child to the monster, for the good of the village.\u0027\n There was no more talk. Reacher collected the three empty coffee cups and carried them out to the kitchen, partly to be polite, partly because he wanted to check the view through a different window. The landscape was still clear. Nothing coming. Nothing happening. After a minute the doctor joined him in the room, and asked, \u0027So what are you going to do now?\u0027\n Reacher said, \u0027I\u0027m going to Virginia.\u0027\n \u0027OK.\u0027\n \u0027With two stops along the way.\u0027\n \u0027Where?\u0027\n \u0027I\u0027m going to drop in on the county cops. Sixty miles south of here. I want to see their paperwork.\u0027\n \u0027Will they still have it?\u0027\n Reacher nodded. \u0027A thing like that, lots of different departments cooperating, everyone on best behaviour, they\u0027ll have built a pretty big file. And they won\u0027t have junked it yet. Because technically it\u0027s still an open case. Their notes will be in storage somewhere. Probably a whole cubic yard of them.\u0027\n \u0027Will they let you see them? Just like that?\u0027\n \u0027I was a cop of sorts myself, thirteen years. I can usually talk my way past file clerks.\u0027\n \u0027Why do you want to see it?\u0027\n \u0027To check it for holes. If it\u0027s OK, I\u0027ll keep on running. If it\u0027s not, I might come back.\u0027\n \u0027To do what?\u0027\n \u0027To fill in the holes.\u0027\n \u0027How will you get down there?\u0027\n \u0027Drive.\u0027\n \u0027Showing up in a stolen truck won\u0027t help your cause.\u0027\n \u0027It\u0027s got your plates on it now. They won\u0027t know.\u0027\n \u0027My plates?\u0027\n \u0027Don\u0027t worry, I\u0027ll swap them back again. If the paperwork\u0027s OK, then I\u0027ll leave the truck right there near the police station with the proper plates on it, and sooner or later someone will figure out whose it is, and word will get back to the Duncans, and they\u0027ll know I\u0027m gone for good, and they\u0027ll start leaving you people alone again.\u0027\n \u0027That would be nice. What\u0027s your second stop?\u0027\n \u0027The cops are the second stop. First stop is closer to home.\u0027\n \u0027Where?\u0027\n \u0027We\u0027re going to drop in on Seth Duncan\u0027s wife. You and me. A house call. To make sure she\u0027s healing right.\u0027\n TWENTY-FIVE\n THE DOCTOR WAS IMMEDIATELY DEAD SET AGAINST THE IDEA. IT was a house call he didn\u0027t want to make. He looked away and paced the kitchen and traced his facial injuries with his fingertips and pursed his lips and ran his tongue over his teeth. Then eventually he said, \u0027But Seth might be there.\u0027\n Reacher said, \u0027I hope he is. We can check he\u0027s healing right, too. And if he is, I can hit him again.\u0027\n \u0027He\u0027ll have Cornhuskers with him.\u0027\n \u0027He won\u0027t. They\u0027re all out in the fields, looking for me. The few that remain, that is.\u0027\n \u0027I don\u0027t know about this.\u0027\n \u0027You\u0027re a doctor. You took an oath. You have obligations.\u0027\n \u0027It\u0027s dangerous.\u0027\n \u0027Getting out of bed in the morning is dangerous.\u0027\n \u0027You\u0027re a crazy man, you know that?\u0027\n \u0027I prefer to think of myself as conscientious.\u0027\n Reacher and the doctor climbed into the pick-up truck and headed back to the county two-lane and turned right. They came out on the road a couple of miles south of the motel and a couple of miles north of the three Duncan houses. Two minutes later the doctor stared at them as they passed by. Reacher took a look, too. Enemy territory. Three white houses, three parked vehicles, no obvious activity. By that point Reacher assumed the second Brett had delivered his messages. He assumed they had been heard and then immediately dismissed as bravado. Although the burned-out truck should have counted for something. The Duncans were losing, steadily and badly, and they had to know it.\n Reacher made the left where he had the night before in the Subaru wagon, and then he threaded through the turns until Seth Duncan\u0027s house appeared ahead on his right. It looked much the same lit by daylight as it had by electricity. The white mailbox with Duncan on it, the hibernating lawn, the antique horse buggy. The long straight driveway, the outbuilding, the three sets of doors. This time two of them were standing open. The back ends of two cars were visible in the gloom inside. One was a small red sports car, maybe a Mazda, very feminine, and the other was a big black Cadillac sedan, very masculine.\n The doctor said, \u0027That\u0027s Seth\u0027s car.\u0027\n Reacher smiled. \u0027Which one?\u0027\n \u0027The Cadillac.\u0027\n \u0027Nice car,\u0027 Reacher said. \u0027Maybe I should go smash it up. I\u0027ve got a wrench of my own now. Want me to do that?\u0027\n \u0027No,\u0027 the doctor said. \u0027For God\u0027s sake.\u0027\n Reacher smiled again and parked where he had the night before and they climbed out together and stood for a moment in the chill. The cloud was still low and flat, and mist was peeling off the underside of it and drifting back down to earth, ready for afternoon, ready for evening. The mist made the air itself look visible, grey and pearlescent, shimmering like a fluid.\n \u0027Show time,\u0027 Reacher said, and headed for the door. The doctor trailed him by a yard or two. Reacher knocked and waited and a long minute later he heard feet on the boards inside. A light tread, slow and a little hesitant. Eleanor.\n She opened up and stood there, with her left hand cupping the edge of the door and her right-hand fingers spidered against the opposite wall, as if she needed help with stability, or as if she thought her horizontal arm was protecting the inside of the house from the outside. She was wearing a black skirt and a black sweater. No necklace. Her lips had scabbed over, dark and thick, and her nose was swollen, the white skin tight over yellow contusions that were not quite hidden by her make-up.\n \u0027You,\u0027 she said.\n \u0027I brought the doctor,\u0027 Reacher said. \u0027To check on how you\u0027re doing.\u0027\n Eleanor Duncan glanced at the doctor\u0027s face and said, \u0027He looks as bad as I do. Was that Seth? Or one of the Cornhuskers? Either way, I apologize.\u0027\n \u0027None of the above,\u0027 Reacher said. \u0027It seems we have a couple of tough guys in town.\u0027\n Eleanor Duncan didn\u0027t answer that. She just took her right hand off the wall and trailed it through a courtly gesture and invited them in. Reacher asked, \u0027Is Seth home?\u0027\n \u0027No, thank goodness,\u0027 Eleanor said.\n \u0027His car is here,\u0027 the doctor said.\n \u0027His father picked him up.\u0027\n Reacher asked, \u0027How long will he be gone?\u0027\n \u0027I don\u0027t know,\u0027 Eleanor said. \u0027But it seems they have much to discuss.\u0027 She led the way to the kitchen, where she had been treated the night before, and maybe on many previous occasions. She sat down in a chair and tilted her face to the light. The doctor stepped up and took a look. He touched the wounds very lightly and asked questions about pain and headaches and teeth. She gave the kinds of answers Reacher had heard from many people in her situation. She was brave and somewhat self-deprecating. She said yes, her nose and mouth still hurt a little, and yes, she had a slight headache, and no, her teeth didn\u0027t feel entirely OK. But her diction was reasonably clear and she had no loss of memory and her pupils were reacting properly to light, so the doctor was satisfied. He said she would be OK.\n \u0027And how is Seth?\u0027 Reacher asked.\n \u0027Very angry at you,\u0027 Eleanor said.\n \u0027What goes around comes around.\u0027\n \u0027You\u0027re much bigger than him.\u0027\n \u0027He\u0027s much bigger than you.\u0027\n She didn\u0027t answer. She just looked at Reacher for another long second, and then she looked away, seemingly very unsure of herself, an expression of complete uncertainty on her face, its extent limited only by the immobility caused by the stiff scabs on her lips and the frozen ache in her nose. She was hurting bad, Reacher thought. She had taken two blows, he figured, probably the first to her nose and the second aimed lower, at her mouth. The first had been hard enough to do damage without breaking the bone, and the second had been hard enough to draw blood without smashing her teeth.\n Two blows, carefully aimed, carefully calculated, carefully delivered.\n Expert blows.\n Reacher said, \u0027It wasn\u0027t Seth, was it?\u0027\n She said, \u0027No, it wasn\u0027t.\u0027\n \u0027So who was it?\u0027\n \u0027I\u0027ll quote your earlier conclusion. It seems we have a couple of tough guys in town.\u0027\n \u0027They were here?\u0027\n \u0027Twice.\u0027\n \u0027Why?\u0027\n \u0027I don\u0027t know.\u0027\n \u0027Who are they?\u0027\n \u0027I don\u0027t know.\u0027\n \u0027They\u0027ve been saying they represent the Duncans.\u0027\n \u0027Well, they don\u0027t. The Duncans don\u0027t need to hire people to beat me. They\u0027re perfectly capable of doing that themselves.\u0027\n \u0027How many times has Seth hit you?\u0027\n \u0027A thousand, maybe.\u0027\n \u0027That\u0027s good. Not from your point of view, of course.\u0027\n \u0027But good from the point of view of your own clear conscience?\u0027\n \u0027Something like that.\u0027\n She said, \u0027Have at Seth all you like. All day, every day. Beat him to a pulp. Break every bone in his body. Be my guest. I mean it.\u0027\n \u0027Why do you stay?\u0027\n \u0027I don\u0027t know,\u0027 she said. \u0027Whole books have been written on that subject. I\u0027ve read most of them. Ultimately, where else would I go?\u0027\n \u0027Anywhere else.\u0027\n \u0027It\u0027s not that simple. It never is.\u0027\n \u0027Why not?\u0027\n \u0027Trust me, OK?\u0027\n \u0027So what happened?\u0027\n She said, \u0027Four days ago two men showed up here. They had East Coast accents. They were kind of Italian. They were wearing expensive suits and cashmere overcoats. Seth took them into his den. I didn\u0027t hear any of the discussion. But I knew we were in trouble. There was a real animal stink in the house. After twenty minutes they all trooped out. Seth was looking sheepish. One of the men said their instructions were to hurt Seth, but Seth had bargained it down to hurting me. At first I thought I was going to be raped in front of my husband. That was what the atmosphere was like. The animal stink. But, no. Seth held me in front of him and they took turns hitting me. Once each. Nose, and then mouth. Then yesterday evening they came back and did all the same things over again. Then Seth went out for a steak. That\u0027s what happened.\u0027\n \u0027I\u0027m very sorry,\u0027 Reacher said.\n \u0027So am I.\u0027\n \u0027Seth didn\u0027t tell you who they were? Or what they wanted?\u0027\n \u0027No. Seth tells me nothing.\u0027\n \u0027Any ideas?\u0027\n \u0027They were investors,\u0027 she said. \u0027I mean, they were here on behalf of investors. That\u0027s the only sense I can make out of it.\u0027\n \u0027Duncan Transportation has investors?\u0027\n \u0027I suppose so. I imagine it\u0027s not a wonderfully profitable business. Gas is very expensive right now, isn\u0027t it? Or diesel, or whatever it is they use. And it\u0027s wintertime, which must hurt their cash flow. There\u0027s nothing to haul. Although, really, what do I know? Except that they\u0027re always complaining about something. And I see on the news that apparently ordinary banks are difficult right now, for small businesses. So maybe they had to find a loan through unconventional sources.\u0027\n \u0027Very unconventional,\u0027 Reacher said. \u0027But if this is all about some financial issue with Duncan Transportation, why are those guys looking for me?\u0027\n \u0027Are they looking for you?\u0027\n \u0027Yes,\u0027 the doctor said. \u0027They are. They were at my house this morning. They hit me four times and threatened to do much worse to my wife. And all they ever asked was where Reacher was. It was the same at the motel, apparently. Mr Vincent was visited. And Dorothy, the woman who works for him. His housekeeper.\u0027\n \u0027That\u0027s awful,\u0027 Eleanor said. \u0027Is she OK?\u0027\n \u0027She survived.\u0027\n \u0027Is your wife OK?\u0027\n \u0027A little shaken.\u0027\n \u0027I can\u0027t explain it,\u0027 Eleanor said. \u0027I know nothing about Seth\u0027s business.\u0027\n Reacher asked, \u0027Do you know anything about Seth himself?\u0027\n \u0027Like what?\u0027\n \u0027Like who he is, and where he came from.\u0027\n \u0027Do you guys want a drink?\u0027\n \u0027No, thank you,\u0027 Reacher said. \u0027Tell me where Seth came from.\u0027\n \u0027That old question? He\u0027s adopted, like a lot of people.\u0027\n \u0027Where from?\u0027\n \u0027He doesn\u0027t know, and I don\u0027t think his father knows for sure, either. It was some kind of charity network. There was a degree of anonymity involved.\u0027\n \u0027No stories at all?\u0027\n \u0027None.\u0027\n \u0027Doesn\u0027t Seth remember anything? People say he was ready for kindergarten when he got here. He should have some memories of where he was before.\u0027\n \u0027He won\u0027t talk about it.\u0027\n \u0027What about the missing girl?\u0027\n \u0027That other old question? Lord knows I\u0027m not blind to Seth\u0027s faults, or his family\u0027s, but as I understand it they were cleared after an investigation by a federal agency. Isn\u0027t that good enough for people?\u0027\n \u0027You weren\u0027t here at the time?\u0027\n \u0027No, I grew up in Illinois. Just outside of Chicago. Seth was twenty-two when I met him. I was trying to be a journalist. The only job I could find was at a paper out of Lincoln. I was doing a story about corn prices, of course. That\u0027s all that was in that paper, that and college sports. Seth was the new CEO of Duncan Transportation. I interviewed him for the story. Then we had a cocktail. At first, I was bowled over. Later, not so much.\u0027\n \u0027Are you going to be OK?\u0027\n \u0027Are you? With two tough guys looking for you?\u0027\n \u0027I\u0027m leaving,\u0027 Reacher said. \u0027Heading south and then east, to Virginia. You want to ride along? You could hit the Interstate and never come back.\u0027\n Eleanor Duncan said, \u0027No.\u0027\n \u0027You sure?\u0027\n \u0027I am.\u0027\n \u0027Then I can\u0027t help you.\u0027\n \u0027You helped me already. More than I can say. You broke his nose. I was so happy.\u0027\n Reacher said, \u0027You should come with me. You should get the hell out. It\u0027s crazy to stay, talking like that. Feeling like that.\u0027\n \u0027I\u0027ll outlast him,\u0027 the woman said. \u0027That\u0027s my mission, I think, to outlast them all.\u0027\n Reacher said nothing more. He just looked around the kitchen, at the stuff she would inherit if she succeeded in outlasting them all. There was a lot of stuff, all of it expensive and high quality, a lot of it Italian, some of it German, some of it American. Including a Cadillac key in a glass bowl.\n \u0027Is that Seth\u0027s key?\u0027 Reacher asked.\n Eleanor said, \u0027Yes, it is.\u0027\n \u0027Does he keep his car gassed up?\u0027\n \u0027Usually. Why?\u0027\n \u0027I\u0027m going to steal it,\u0027 Reacher said. \n","sourceLink":"https://allnovel.net/worth-dying-for-jack-reacher-15/page-10.html","bookId":2348,"book":{"id":2348,"title":"Worth Dying For (Jack Reacher #15)","description":"Storyline: \n Worth Dying For (Jack Reacher #15) \n There’s deadly trouble in the corn county of Nebraska . . . and Jack Reacher walks right into it. First he falls foul of the Duncans, a local clan that has terrified an entire county into submission. But it’s the unsolved, decades-old case of a missing child that Reacher can’t let go. \n The Duncans want Reacher gone—and it’s not just past secrets they’re trying to hide. For as dangerous as the Duncans are, they’re just the bottom of a criminal food chain stretching halfway around the world. For Reacher, it would have made much more sense to put some distance between himself and the hard-core trouble that’s bearing down on him. For Reacher, that was also impossible.\n \n","cover":"https://allnovel.net/images/worth-dying-for-jack-reacher-15.jpg","author":"Lee Child","type":"Mystery","source":"allnovel","link":"https://allnovel.net/worth-dying-for-jack-reacher-15.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:00:49 AM"}}
