{"id":91700,"no":27,"title":"Page 27","content":"\n She wanted Sean to come back for her. She wanted to be with him.\n “There’s something wrong with it,” Bartholomew said flatly, crossing his arms over his chest. “Can’t you tell? Both Katie and Vanessa reacted to it—and you should trust Katie’s very acute sixth sense!”\n “Well, genius, you were around when it all happened. You tell me what’s wrong with the trunk!” Sean said. He was aggravated. What was the matter with all of them? It was the find of a lifetime. He wanted to be excited about it. In fact, he realized, he’d been so damned excited, they hadn’t filmed any of it, except when Vanessa had first found the damned thing.\n “I was around at the time, yes. I didn’t run in the same circles as Dona Isabella. I knew that she was a beauty—I saw her in the streets. She was surrounded by servants. She had a grand house. Her husband never came from Spain, and she controlled all his properties here. Now, I did meet Mad Miller, and in my mind, he wasn’t so mad. And Kitty Cutlass…well, if she went crazy and killed a bunch of people, it was only because she was madly in love with Mad Miller. But this trunk…you found it away from the ship?”\n “Not far from the debris field. It wasn’t on coral—or in the remains of the ship. But I don’t know what you think that means. Debris travels. It can spread out for miles—you know that.” Sean paused and looked toward the dock. David and Jay were there; they had called Jaden and Ted, and the couple was coming with their truck to bring the chest back to their place of business. They would study and analyze it and figure out how to open it with the most integrity toward the chest itself and whatever just might be inside. Ted also knew a great deal more about reporting finds to the state and the legal filing that needed to be done.\n “I don’t like it, I don’t like it, I don’t like it,” Bartholomew said.\n “What’s not to like about the possibility of a cache of historical coins?” Sean asked.\n Bartholomew shook his head. “You don’t need to make a fortune. You’re a lucky man. You do what you love for a living, and you make a good living at it.”\n “That from a pirate,” Sean moaned.\n “Privateer,” Bartholomew said irritably.\n “You’re right—I don’t need a hoard of riches. It’s not that, Bartholomew. I believe in learning about the past—I believe in museums. I believe in finding out the truth about what happened, and every little clue gives us something more on that end. What’s bothering you? What do you feel?”\n “I’m a ghost. I don’t feel. Well, not really,” Bartholomew said.\n “You’re certainly ready at all times to give an opinion.”\n “Actually, I do have a…oh, all right, I have a feeling. But I don’t really understand it. Is it Pandora’s box?” Bartholomew asked softly. “I don’t think so. But it is something…that may change things. Does that make any sense?”\n “It may change the way we look at the past,” Sean suggested.\n Bartholomew shrugged. “I think your friend onshore is already counting his riches,” he said.\n Jay stood with David, still gesturing, excited.\n As Sean watched, he saw Ted and Jaden arrive with their truck. A fair group of tourists and locals had formed in the parking lot beyond the restaurant and the docks, all looking anxiously to see what was going on.\n “They’re here!” Jay called, spinning around to make sure that Sean had heard him.\n Sean nodded. David and Jay returned to the boat, hopping onto the deck. Now that it was out of the water, the chest was manageable, just awkward, especially with three of them. But Ted came hurrying from the passenger side of the truck, leaving Jaden to maneuver it as close to the end of the dock as she could.\n “Cool! Cool, oh my God! Cool!” Ted announced, jumping on the deck of the Conch Fritter. “Every man to an edge. We’ll get her to our place. I can’t wait, I can’t wait. I want to keep it in a mist until we see how it will do out of the water. This is amazing. Cool, cool, cool!”\n They hunkered down, the four of them. Between them, the weight didn’t seem that bad. Sean estimated that whatever was actually inside the chest weighed between a hundred and a hundred and twenty pounds.\n They moved easily enough with it—moving quickly. They got it onto a tarp Ted had stretched out over the bed of the truck.\n “Sean, your find, you go with Ted,” David said. “I’ll hose down and secure the Conch Fritter. Then I’ll head straight over.”\n “Sure. I’ll help David,” Jay said without enthusiasm.\n David laughed. “No, go with Sean. Never mind—stay with me. We’ll both get there faster.”\n “Yeah, let’s do it!” Jay said.\n Before Sean could crawl into the cab, Jay was racing back to the Conch Fritter.\n Sean slid in next to Jaden, leaning forward between the driver and passenger seats. She gave him a kiss on the cheek and grinned. “You are on a roll!”\n “Vanessa is on a roll. I have no idea how she found it,” he said.\n Ted climbed in and slammed the door. “Drive, woman, drive!” he said.\n In a matter of minutes they were back at the shop. They didn’t have to worry about weight or statistics; Ted and Jaden had carts and ramps, and they quickly had it down, still on a tarp, in one of their temperature-controlled rooms where the air was heavy with moisture.\n Jaden and Ted looked over the trunk and discussed the best way to attack it. Obviously, they didn’t have a key, and if they did, the lock was probably too degraded to open with it. They did, however, have a friend who was a locksmith.\n He was called.\n They were going to have to wait.\n If they were going to have to wait, Sean wanted to bring Vanessa back.\n “All right, I’m going to call David,” he told Ted. “I’ll run and grab a quick shower, stop by for Vanessa, and we’ll all meet back here in an hour. How’s that?”\n “An hour?” Ted said. He loved the old, treasure and a mystery.\n “Ted, we have to wait for the locksmith,” Jaden reminded him.\n “We could just need a little oil,” Ted said hopefully. “You know what works wonders? Olive oil, not that I was really thinking about olive oil on this. WD-40.”\n “We’ll do it right. Run on, Sean. I’ll chill some champagne!” Jaden said happily.\n Vanessa told herself that she wasn’t afraid of her own room. She was. She didn’t want to be alone anymore. She just wanted to go back to Sean’s. She’d get the rest of her things later.\n She showered fast, scrubbed her face, towel dried her body and her hair, dressed in an A-line knit dress and sandals and ran back down the stairs. The sun was setting, and it would be dark soon. She was glad she was on Duval Street—and that pirates and wenches and drunken frat boys were plying the sidewalk.\n She headed into the little bar again but ordered a soda. She could still feel the warmth of the whiskey and didn’t want to appear to be as inebriated as the frat boys. It was while she was there, idly sitting on one of the four stools in the place and watching the crowd, that she nearly choked and fell off.\n She wasn’t seeing any kind of an apparition.\n No one dressed in pirate attire.\n To her amazement, Zoe Cally and Barry Melkie, props, costumes, makeup and sound on their ill-fated film, stood in front of the Irish bar, drinking beer, deep in conversation.\n She jumped up and ran across the street. “Hey!”\n Zoe turned to look at her. She was a pretty girl, small and delicate, with large brown eyes and light hair. She smiled, and the smile was bright and welcoming.\n “Vanessa!” Zoe cried with pleasure.\n “Hey, you!” Barry said. He picked her up to give her a huge bear hug. He was a big man, about six foot three and well muscled, in his midthirties.\n Barry set her down, grinning as broadly as Zoe. “This is unbelievable! How cool. We were just talking about you and Jay, and thinking that we should call you.”\n Zoe laughed. “We were talking because we read an advertisement. There are these guys planning a documentary on weird stuff in Key West and environs,” Zoe said.\n “I know, I know!” Vanessa said. She started to speak again, but Zoe interrupted her enthusiastically.\n “Imagine our surprise when they called us!” Zoe said.\n “Hey, let me buy you a beer, Vanessa,” Barry said. “We’ll explain.”\n Vanessa explained how she and Jay were already working with Sean and David. “Sean just called you and my Lord, you got here quickly!” she said.\n Zoe giggled. “We were close. We got here last night.”\n “And guess what? I mean, I think this was all really supposed to happen. I have already called the kids,” Barry said proudly.\n “The kids?” Vanessa said.\n “The kids—our kids, our grad students. You know, both those bozos managed to graduate and get work, can you imagine?” Barry asked.\n Vanessa felt her heart sinking. “You mean Bill Hinton and Jake Magnoli?”\n “Well, of course, what other kids did we work with?” Zoe asked, confused.\n “Vanessa, come on, let me buy you a beer,” Barry said.\n “I—I can’t right now. I’m waiting for Sean,” Vanessa explained.\n “And Jay?” Zoe asked, grinning.\n “And Jay,” she said.\n Zoe smiled. “I am so glad. I’m so glad we were already heading here. This is going to be so important, so cathartic, for all of us. We were there! We saw Travis and Georgia. Vanessa, you of all people must understand how we feel!”\n “Of course,” Vanessa agreed softly.\n “This is an amazing opportunity. We’ve all been ripped apart by nightmares. We’ve all been like zombies since it happened,” Barry said.\n “And you’re happy, right?” Zoe asked. “You want to work with us again? We were all giving our hearts to that project of Jay’s!” \n","sourceLink":"https://allnovel.net/ghost-night-bone-island-trilogy-2/page-27.html","bookId":2287,"book":{"id":2287,"title":"Ghost Night (Bone Island Trilogy #2)","description":"Storyline: \n Ghost Night (Bone Island #2) \n A slasher movie turns real when two young actors are brutally murdered on a remote island film set. Their severed heads and arms are posed in macabre homage to a nineteenth-century pirate massacre. \n Two years later, survivor Vanessa Loren is drawn back to South Bimini by a documentary being made about the storied region. Filmmaker Sean O\u0027Hara aches to see how the unsolved crime haunts her\u0026hellip;and Sean knows more than a little about ghosts. \n Lured by visions of a spectral figurehead, Vanessa discovers authentic pirate treasures that only deepen the mystery. Are the murders the work of modern-day marauders, the Bermuda Triangle or a deadly paranormal echo of the island\u0027s violent history? As Vanessa and Sean grow closer, the killer prepares to resume the slaughter\u0026hellip;unless the dead can intervene.\n \n","cover":"https://allnovel.net/images/ghost-night-bone-island-trilogy-2.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/ghost-night-bone-island-trilogy-2.html","creation":"Oct 5, 2019 8:58:33 AM","modification":"Oct 5, 2019 5:51:17 PM"}}
