{"id":91716,"no":43,"title":"Page 43","content":"\n “There’s the outside chance that an islander, dismayed with what they were doing on Haunt Island, lay in wait, and that the murders were because of outrage over making a film based on the massacre,” David said.\n “Yes, there’s an outside chance,” Sean agreed. “I know that Liam ran everything he could on Lew Sanderson, the Bahamian guide who was with them.”\n “The man is squeaky-clean. He’s worked with dignitaries from around the world. He’s a family man, married twenty years, two children, and known for helping out in times of distress, such as doing volunteer road work and clearance after storms. His neighbors love him—he’s an open book, so it seems,” David said. He drummed his fingers on the breakfast table. “I think your idea of matching up people and places over the last two years is a good one, and I know that Liam is on the computer now. It doesn’t seem possible to me that someone could commit such a horrible crime, then go back to a normal life as if nothing ever happened.”\n “That’s my point. And I still say…I don’t know, we’re missing something, and I think it has to do with the why, and if we could just figure that out, we’d discover the who.”\n David leaned back, shaking his head. “Well, there are plenty of theories. First, chalk it up to the Bermuda Triangle. Second, it is called Haunt Island.”\n “We both know that a ghost—or even ghosts—didn’t commit those murders.”\n “Agreed—I’m just throwing out the theories,” David said.\n “Right,” Sean agreed. “Third theory—modern-day pirates, cleverly plotting. They committed gruesome murders and stole a boat and dumped Carlos Roca’s body overboard. But now Carlos Roca has been seen, so that theory is out. Okay, fourth theory. It was Carlos Roca, and he had friends—modern-day pirates—in on it. Fifth theory, Carlos was innocent, and he was hit on the head and is walking around suffering from amnesia. But that’s unlikely, considering the fact that there was an intensive manhunt going on for him after it first happened. Sixth theory—someone on the film crew was in on it with Carlos Roca. That’s why he’s alive and well, it’s how he managed to stay ‘missing’ all this time, and it’s why he seems to be following us now.”\n “We’re still back to why,” David said. “All those people had good careers. What would make a professional with no record whatsoever suddenly commit murder?”\n “That’s something we have to find out,” Sean said. “It’s going to be interesting, though. All of us so close together. And that’s how we’re going to stay. The film crew—or at least the majority of it—wasn’t expecting anything bad to happen. They were working. They were in a place that was a pristine hangout for boaters. There was no reason to expect anything. And we know damned well that bad things happen. So…” Sean hesitated. “Maybe Katie should stay here, in Miami,” he said. “I asked Ted last night…but he wants in.”\n “Katie won’t go back—you know your sister,” David said. “Look, I really think that we’re dealing with cowards here. The whole company wasn’t killed. Travis was probably taken by surprise. And as far as Carlos and Georgia and the boat…well, any way you look at it, it was one man who was the surprise, or was taken from the back in the dark. We’ll be all right. Marty and Jamie are fierce old pirates, we’ve got Liam, you and me. Once we’re on the island, we’ll have perimeter, with one us on guard at all times, maybe two of us. So here’s the thing. We do it or we don’t. And at this point, I say we do it.”\n Sean nodded and called for the check.\n It was a beautiful day for the trip across the straits from Miami to Haunt Island. The boats moved parallel across fairly calm seas, the sky was a pristine blue with only a few puffs of white clouds, and the sun shone down brilliantly throughout the day.\n Seated in the companion seat, Vanessa was glad enough to laze the time away. Marty took the helm several times, and Jay and Sean spent the hours filming the voyage. Sean did a few minutes on the straits, the proximity of the Bahamas to Florida, and how the voyage would have been different in the eighteen hundreds when the wind played such an important role in travel. They pointed out the area where Mad Miller’s pirate ship had supposedly gone down, and Sean gave his calculations on the currents of the time, estimating that the debris field had to extend farther than it had often been presumed.\n Vanessa was roused for a few moments to do a two-minute take on her research regarding Dona Isabella, Mad Miller and Kitty Cutlass, and how they had followed the same path when they had been making the film.\n She was surprised when Sean filmed Jay, asking him about his feelings on the distribution of the film. Jay sounded sincere when he said that he believed that Georgia and Travis would have wanted it shown—they had been actors, after all—and that he hoped they could find the truth, see that the murderer was punished and be able to distribute the film feeling that they had justice and closure at last.\n Jay’s speech seemed heartfelt.\n From her comfortable perch, a warm poncho around her shoulders against the chill of the wind, Vanessa observed Sean’s questions as he interviewed Zoe and Jake, wanting to know everything that had happened on the island the day that Georgia and Travis had been murdered. Jake had been in charge of props, and he explained that it was easy to understand why they had all dismissed Georgia’s fears—any one of them might have played a prank.\n When she had come screaming down the sand, he had been in his little tent, getting ready to come on out and share the champagne.\n Zoe talked about her love of the period costumes and relayed the story about the afternoon when they’d dressed Vanessa up as a deceased Dona Isabella and gotten a bit carried away, forgetting that she was floating in the ocean in heavy materials. She had last seen Travis that afternoon, when they had filmed the scene in which help had come to the island at last. She, too, had been in her tent, pleased with the film and hoping for great distribution and big notches on their résumés for future work.\n Vanessa noted that Bartholomew was silent, watching their destination before them and listening intently to the interviews. He seemed thoughtful.\n They arrived at the island at just about three that afternoon.\n She rose and went aft, watching as they came upon Haunt Island and trying to remember when she had been there last. Now it all seemed such a blur. The island appeared lovely and tropical, totally benign in the bright sunlit day. She had thought she would feel something. She had thought that she’d be afraid. She wasn’t. It was just an island.\n Lew Sanderson was standing at the end of the dock, waiting to greet them. He waved a welcome and caught the ties as the Conch Fritter drew in first. Vanessa hopped to the dock and was enveloped in a huge hug by the big man.\n It felt good.\n The Claddagh pulled into the dockage behind the Conch Fritter. Vanessa and Lew caught her ties, and soon everyone was standing on the dock. Lew greeted those he knew and met those he didn’t, and the next two hours were spent setting up camp on the island. There was nothing terribly rustic about camping on the island; the tents were large, the camp bunks were not uncomfortable, they had an impressive barbecue area and a battery-operated coffeemaker, not to mention that showers could be had back at the boats—they were well supplied.\n By the time all the work was done, they were exhausted, and Vanessa thought that they might have forgotten that terrible things had happened here. They had all seemed to work very well together, hauling boxes and bags to the beach, setting up the tents and then, when all was done, digging a pit and starting a fire on the beach. Sean had brought a good supply of torches as well, and as darkness settled, their area of the beach was still aglow. The sea remained calm and easy and the sound of the waves was lulling. She was amazed to enjoy the glow and the company as they worked together and finally sat down to a meal.\n She, Jay, Sean and Barry had taken turns with cameras during the day, documenting their setup. She forgot that Barry was still filming as dinnertime rolled around—Zoe in charge that night, supervising Bill fondly as she barbecued hot dogs and hamburgers and warmed baked beans in a huge pot, and announcing—with a smile for the camera—that she also had spinach so that they could make certain the meal was healthful. They had to keep up their strength, of course.\n Then they sat by the fire, eating. It seemed relaxed. But Vanessa was aware that five people had subtly been changing an important position throughout the day. Guard duty. As Sean took a seat beside her, she saw that his uncle Jamie was standing at the perimeter of the group, watching the dock, the sea and the foliage. He was wearing a windbreaker, and she thought there was a bulge beneath his arm. Jamie was carrying a gun.\n If there was tension within their group, Lew Sanderson didn’t seem to know it. He entertained them with a Bahamian tale about a talking raccoon, and they all laughed, and then he told them another story, his face dark and mysterious as it was caught in the glow of the fire. “They say we are in the Bermuda Triangle, but long before it had such a name, the people here knew that there was something special about the air. The earth herself is mysterious, and as man has come to learn all about technology and science, he has often forgotten that no matter how far we go, we are dots in the universe, and the universe itself is a mystery. Now, you know, my ancestors who came to these islands came as slaves, and they brought with them a certain magic that belonged to their ancestors. They were open to the world, open to life and death, and aware that all things were not to be seen. Nowadays, we claim that there are underwater forces here. There are the currents, there are the wicked wonders and destruction of the storms and hurricanes that ravage the area. Ah, yes! There are magnetic forces in the earth as well, and they cause confusion, the horizon itself can trick a pilot or a captain. But my people believed that there were gods and devils that dwelled on earth, between the realms of life and death. Forces, for good and for evil. Kiandra, the sea god, once appeared as an ugly thing in need before two sisters. The first spurned him and married a handsome man. The second felt pity, fed him and married him, and went to live with him in his fine kingdom in the sea, bearing many children. The handsome man the sister married proved to be a kishi, an evil devil or demon. She had a child with a human head and a hyena head, and in the end, her husband devoured her. Her spirit remained, evil and bitter, and when Africans came here, many believed that what we call the Bermuda Triangle now was where the first sister’s bitter soul came to dwell and that now, while the sea god Kiandra and his wife seek to save those who travel the sea, the evil sister’s influence can make men crazy, can make the evil dead within the ocean rise and cause all kinds of havoc. There are those who believe that the magnetic forces that cause compasses to spin and ships and planes to go astray are merely the toys of the spirit of the evil sister, and that she teases her prey before she kills, just like a great cat of the sea.” \n","sourceLink":"https://allnovel.net/ghost-night-bone-island-trilogy-2/page-43.html","bookId":2287,"book":{"id":2287,"title":"Ghost Night (Bone Island Trilogy #2)","description":"Storyline: \n Ghost Night (Bone Island #2) \n A slasher movie turns real when two young actors are brutally murdered on a remote island film set. Their severed heads and arms are posed in macabre homage to a nineteenth-century pirate massacre. \n Two years later, survivor Vanessa Loren is drawn back to South Bimini by a documentary being made about the storied region. Filmmaker Sean O\u0027Hara aches to see how the unsolved crime haunts her\u0026hellip;and Sean knows more than a little about ghosts. \n Lured by visions of a spectral figurehead, Vanessa discovers authentic pirate treasures that only deepen the mystery. Are the murders the work of modern-day marauders, the Bermuda Triangle or a deadly paranormal echo of the island\u0027s violent history? As Vanessa and Sean grow closer, the killer prepares to resume the slaughter\u0026hellip;unless the dead can intervene.\n \n","cover":"https://allnovel.net/images/ghost-night-bone-island-trilogy-2.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/ghost-night-bone-island-trilogy-2.html","creation":"Oct 5, 2019 8:58:33 AM","modification":"Oct 5, 2019 5:51:17 PM"}}
