{"id":87359,"no":15,"title":"Page 15","content":"\"They have a fortune in toys in here.\" Lauren ran her hand over the finish of a spanking bench made out of satin smooth cherry wood and gazed around her, amazed at the array of equipment in the large room. Mirrors lined two walls and the ceiling, increasing the sense of size, though the deep woven carpets scattered on the flag stones, as well as the large potted plants and variety of heavy tapestries hung on the stone walls, made the space more intimate psychologically, if not physically. There were two costume rooms, complete with fully stocked makeup tables and wigs, to dress for play. \"Look at this,\" she paused by a carousel horse, molded with a thin faux fur that felt much like the animal it emulated. The bowed head, lifted forelegs and bunched hindquarters spoke of a stallion\u0027s desire to run free. Marcus joined her, slid his hand beneath the horse\u0027s chest. There was the soft hum of a mechanical reaction. Lauren\u0027s eyes widened as a seven-inch erect phallus emerged just below the pommel of the saddle. As she watched in fascination, Marcus demonstrated with a touch of another button the way the phallus would undulate in circles or thrust forward and back. Lauren reached out to it and jumped back with a startled yelp and a laugh as the horse began to rock back and forth in an easy simulation of a canter. The ribbed cock continued to thrust, so it was obvious every rock forward would pull the phallus out, and the rock back would thrust it home. \"Want to give it a try?\" Marcus gave her a wicked grin. \"Wow.\" Lauren looked about her. \"None of it looks -\" \"Cheap? Embarrassing? The rewards of large amounts of money, dearest. You can have sophisticated sex toys that look like works of art, like Chinese netsuke\u0027s, instead of tacky little bare tit statues bobbing on a dashboard. Climb on,\" he urged again. Lauren flushed, but her gaze crept over the horse. Truth to tell, it was all to easy to imagine how it would feel sliding in and out of her tight passageway. The tissues dampened, just from the thought. Marcus gave her a courtly bow. \"It would be my pleasure to see your reaction, but even more, Josh would be overwhelmed by it. Don\u0027t you think?\" Oh, Marcus knew which button to push. She did, too. She ran a hand down the stallion\u0027s back haunch, made note of the velvet and rhinestone straps just above the fetlock joints of the horse\u0027s legs. \"Maybe you should try it, Marcus,\" she murmured, sliding around the backside of the horse to him. \"Face down,\" she trailed her fingers up his bare arm, \"cheek pressed against that broad rump, your wrists strapped to the hind quarters, ankles to his forelegs,\" she directed his attention there. \"And then I can plunge that rubber cock into your ass until you scream and buck like one of your young men would.\" Her body was pressed against his thigh now, and she felt his genitals swell and rise to her words. Marcus lifted a hand to her face, cradling it as she bit his Venus mound lightly, like a cat. \"Ah, Lauren, I\u0027ve forgotten how much fun it is to play with another Dom. Are you offering, my love?\" \"No,\" she grinned. \"Just teasing you. You wouldn\u0027t enjoy being tied up as much anyhow, and I\u0027d rather make Josh hard as granite.\" \"I think you accomplish that just by breathing,\" he said. \"But I agree. Shimmy out of those shorts and let\u0027s see if we can\u0027t give him a good show.\" Taking her clothes off on the beach had somehow been less difficult than here in this quiet room, with just the two of them. She would say that being inside made things seem more civilized, but she could hardly call her surroundings civilized. Something unknown and primitive lived here, encouraging primal behavior. As if sensing her difficulty, Marcus turned his attention to making some adjustments on the horse\u0027s controls so that she was not directly under his gaze. Courtesy from one Dom to another, a consideration neither would have given to a sub. In fact they would have enjoyed watching that sub squirm, self-conscious under their attention but obeying nevertheless, shedding clothes on command. A rueful smile tugged at her lips. No one in the dungeons of the Club had ever accused her of being democratic. Lauren dropped the shorts to the floor, but left on the Brazilian bikini bottoms. She accepted Marcus\u0027s leg up on the horse, since her still tender ankle could not manage the task alone. She was already moist and hot, but she closed her eyes, centering herself, shutting Marcus out for a moment to ease the tension out of her body being caused by her own ridiculous self consciousness. Gay or straight, any man or woman would get turned on by watching another pleasure herself. Marcus would be aroused, not just by watching her, but, as he said, by the thought of how Josh would react to her. The idea fueled her confidence, and she found the phallus by touch, drawing aside the crotch of the bikini bottoms with one fingernail to allow her to lower herself onto the shaft. She drew in a breath at the sensation of the ribbed rubber sliding along the silken walls within. She slowed her descent, drawing her own pleasure out like a tightened bow string. \"Take me up slow,\" she said in a breathless voice. She gazed vaguely in his direction, but her focus was inward. \"Then I leave it to your discretion. I don\u0027t want to go over, though.\" Marcus nodded, reached out, and stroked a hand down her thigh. \"I can smell you, dearest. It\u0027s perfume.\" She smiled absently, dropping her head back and closing her eyes, her inner muscles contracting on the phallus even though it had not begun to move. Marcus picked up the remote to the device and backed away, giving the heat around her the space to expand. He went to one of the high backed carved chairs, obviously left there for the relaxation of the Lord or Mistress of the dungeon as they watched the pleasurable tormenting of their victim. Lauren purred as the shaft began to slowly rotate inside of her. The horse quivered to life, bringing an easy rocking movement that gave the dildo a slight thrust with each rock back. The sleek, faux fur covering made her feel as if it were a horse\u0027s flanks in truth beneath her thighs. There was an increase to the humming, and now she felt a vibration beneath her legs, a rippling like the muscles of the beast, that added to the sensation. Those ripples were being matched from her womb, and she had to clench her inside muscles to keep from helping it along. Instead, she ran her hands over her damp breasts in the bikini top, cupping them in her hands, squeezing, not touching the erect nipples. She knew the moment Josh came in, looking for them. She heard his steps on the threshold; his voice, dying away on the question as to why Marcus had brought her in here. She opened her mouth on a ragged breath and could taste him. She felt as if she could even detect his own unique male scent, as if all her senses were tuned to whatever frequency he traveled. It made her hotter. It made her want him with an ache fiercer than any pain or pleasure she had ever experienced. She could have him or keep building her desire to have him, and both ideas appealed to her. She slid her hands up, the friction of skin on cloth riding the bikini up from the bottom of her breasts, so the undercurves were bared. Her hands traveled from there to her neck, her hair, freeing it from its clip, letting it fall down her back. Her body continued to undulate with the horse, her hips moving in slow circles. The muscles of her thighs contracted as she turned her head to open her eyes and gaze upon him. The greedy desire in his eyes scorched her, shuddered through her body, tightened her grip on the phallus and almost tore a moan from her throat that would have been an open invitation she would not have had the power to revoke. \"Go sit at Marcus\u0027s feet,\" she whispered. \"And don\u0027t even think of touching yourself. Your hands... your mouth,\" she punctuated each word with another circle of her hips, squeezing her breasts in her hands, gripping her nipples and tugging so that she saw saliva gather at the corners of his mouth like a starving wolf, \"your cock... they\u0027re all mine.\" Marcus guided him into a seated position at his feet, for Josh could not tear his eyes from her to watch where he was stepping. Lauren moaned as the control increased the speed of the inserting phallus, which was now glistening with her wetness as it withdrew partway from her and plunged in again. She saw Josh\u0027s eyes on it, knew he wanted it to be his organ, and she reveled in his need, let it drive her even higher. The impact of the vibration pressing against her clit increased on each thrust, and she writhed on her mount. Her ass made a soft, slapping noise on the saddle as her movements became more focused, more intense, skillfully brushing the soft rubber against the place inside that sent an explosion of tiny metallic sparks through her thighs and lower belly, through her breasts. She heard the tender sucking noise that a drenched pussy made. Her attention turned back to Josh. Marcus was stroking her lover\u0027s hair fondly, his gaze riveted on Josh\u0027s face, fascinated with his response. Josh sat rigidly against his knee, like a wild predator waiting to be released to the attack. Her body was begging, calling, but she could be as tough on it as she was on any submissive in a dungeon. She knew the benefit of patience, of waiting. Instant gratification was just that - instant. There was no orgasm as intense as one that you had to work for, work for like a son of a bitch, endure being pleasurably teased and teased ever higher. That was not only her intent with herself, but with Josh. She reminded herself she wanted him to come on command, and he would, if she found that threshold, the teetering edge over which it would take no more than a murmured word to push him over. He looked as if he was close to it now. The look in his eyes was as wild as the spirit of the stallion she rode. In her imagination, she saw herself release him from her thrall. He surged up from his seated position, plucked her off the horse as if she weighed no more than a doll. He would throw her down to the floor, part her thighs and thrust into her with the frenzy of a wild animal, exploding hot and wet inside her. She shuddered at the thought, a soft cry like a dove coming from her lips. She gave Marcus a quick nod and he pressed the controls immediately, slowing the rotation of the phallus. It slid from her, retracting into the pommel. \"Josh,\" she said, her voice like thick cream, \"Bring me one of those hand towels. And don\u0027t you even think about adjusting yourself.\" She knew he was enormous, and derived tremendous pleasure from watching him rise awkwardly to go get the towel. He tried to bring it to her clutched in his hand so it fell in front of his groin. She clucked. \"You know better than that, Josh. I want to see you. Put your hand down, and bring me the towel.\" He swallowed, that delightful red flush creeping over his neck, and he walked toward her, obviously having some difficulty. She licked her lips and teased a groan from him at the sight of her tongue. She took the towel from his trembling hand. Under the heat of his intense scrutiny, she ran soft terry cloth over her wet labia, and then delicately pulled the crotch of the bikini back over herself, adjusting it over her swollen folds, smoothing the wrinkles with the pads of her fingers. The sound he made was so much like a growl that Lauren lifted a startled glance to him. He was very close to her now; so close another step would bring the curve of her belly brushing against his straining cock beneath the denim. \"I have my limits, Lauren,\" he said, low. She knew it, could feel the caged beast hurling against his bars, knew how close he was. But she knew just how hard to push, she always had. It was an art form. Jonathan had teased her with what he never intended to give her, and in hindsight she knew he had given her an unintended gift. He had taught her the difference between torture and teasing, sado-masochism and sexual dominance for pleasure. She wanted to tease Josh, arouse him, make him ache for her, but not deny him, or her, not ultimately. It was a fine line. When emotions got involved, judgment could become clouded, especially when emotions were tied up in shadows of the past. She intended to dispel those shadows, for the both of them. \"Then why don\u0027t you cross that line, Josh?\" she murmured, pressing up to him, sliding her arms around him. \"I\u0027m a little bitty thing, Josh,\" she crooned. \"A man strong like you could overwhelm me in a minute, take your pleasure.\" She drew the word out, sliding it over her tongue like something edible. She nuzzled his neck, put the towel back into his hand. His eyes on hers, he brought the terry cloth to his nose, and weakened her knees. He inhaled her scent, closing his eyes. She was expecting anything. He might snap, lunge and be on her like a wild animal, take her over and leave her no choices to make. Instead, he opened his eyes, the gray irises brilliant in their intensity. \"I\u0027d like to put my nose in the real thing. Mistress.\" She ran her knuckles down the side of his face and he nuzzled them. He sucked one finger into the hot cavern of his mouth and swirled his tongue around it, reminding her vividly of his dexterity in applying the skill elsewhere. Lauren met the sudden mischievous glint in his gaze with a stern one in her own. \"You may kneel, then, and put your nose as close as you wish,\" she nodded. \"As long as you do not touch me in any way.\" He gave her a charming smile she immediately distrusted. He knelt, one knee, two knees as she hooked one leg over the pommel and spread her thighs for him. Marcus was still watching them from his chair, his attention rapt, a palpable presence that heightened the sexual tension in the room. Lauren looked down at the bare brown shoulders, the streaked mane of hair that lay over them. He had a small scar on the left shoulder, maybe from carpentry work. He leaned forward as she studied that scar, and his nostrils flared, taking in her scent. He made a soft, pleasurable sound, and she felt her response leak from her. The bikini did not have a lined crotch, and the bead of fluid slowly rolled down her inner thigh as he watched. He had done no more than breathe on her, heating her like a bellows to a furnace. \"I\u0027d be happy to clean that up for you, Mistress,\" he said, his gaze latched on its course over her skin. She swallowed, and her hands trembled at his soft tone, the need in his face. \"Just the leg.\" She drew in an unsteady breath as his lips caught the bead just above the back of her knee. His hand balanced him on her thigh, his light touch eliciting a scream from her body for more, a scream that got more insistent as his firm lips traveled upward, following the bead\u0027s path. He took his time, sucking her dew off her heated flesh with the leisure thoroughness of a lion cleaning his mate\u0027s pelt. When he reached the upper part of her thigh, his tongue carefully licking just below her crotch, the curve of his skull brushed across her mound with every stroke. Lauren\u0027s body quivered despite her attempt at control. A soft whimper came from her lips. His fingers tightened on her knee, even as his raised gaze communicated understanding. He comprehended, as she did, the desperate need that lay beneath the surface of this game. That was the niggling worry that kept her stepping so carefully. They had no way of knowing if they were lost souls drawn together by desolation or destiny. She was terrified of the answer, but the only way to find out was to let go of fear and take the risk. He shifted his angle. Just a graze of teeth and lips over her quivering clit, his hands sliding up both her thighs. He was showing her what pleasure could be had, the little boy only being a little bit bad... She bit down on a groan and slid her hand down over his hair as his tongue gave her a stronger, more insistent lick through the fabric, the friction rubbing her aroused pussy. Her fingers dug in, held him still. He gazed up at her, playfulness warring with dangerous mutiny in his stormy eyes. If she had only seen desire there, she might have given in at this moment. But she saw the fear. He was scared shitless, just like she was, and he thought he could use her body\u0027s needs to shove her away from the shadows that lurked within him. At heart, people were animals, burrowing in holes with their hurts, never realizing they would die in those holes if they did not summon the courage to drag themselves out and let themselves be healed. A rueful smile curled her lip. Physician, heal thyself. \"Back off,\" she murmured, shifting the smile into an amused disinterest as he obeyed with a reluctance that was echoed in every raging cell of her body. Lauren eased off the horse. Her knees were trembling. Josh reached up from his kneeling position, steadied her. His hand slid down her waist, over her hip, to her thigh, lingering. He leaned forward and pressed a kiss there. His expression was reverent, passionate, eager, fierce, and she had to stifle a groan of need. Did a Dom just know instinctively when the time was right? She hoped so; otherwise she was going to kill them both. \"Stay there, on your knees,\" she ordered, and she put some space between them, gathering her composure. She was too good a Mistress to give away her state of mind, however, so her walk around the room to get a breather was a calculated saunter. She lingered by each sexual device, examined them, ran her hands over soft cuffs, the cold metal of steel bars, the polished wood of a bench. Marcus was watching her, too, his face impassive, but she needed no clues from him at the moment and did not look in his direction. It was a few moments before her body settled enough that she really began to see what was before her, and then she began watching Josh out of the corner of her eye. His gaze was following her, but she noted the tension in those fine shoulders grew more pronounced whenever she lingered at any type of restraint system, anything that would leave the sub helpless to defense against the Dom. A smile curved her lips. Of course. She stopped. \"I want you here,\" she said. It was the dominant piece in the room, a device like a St. Andrew\u0027s cross, only modified into an H design. The shape allowed the captor full front and back access to the captive, with the exception of a couple wide cross pieces that could be adjusted up or down, wherever the captor chose to position them. She turned to face the kneeling man, and her heart broke a little as she saw the uncertainty, the desperation and fear, in his eyes. \"Will you trust me, Josh?\" she said softly. \"Trust me to know when to be kind, and when to be not so kind?\" Would he let her hold the cards until the game was over? She was upping the stakes, and they all knew it. She had crossed the line that was safe for both of their hearts. She was going to challenge him, push him, see how far he would submit to her. She couldn\u0027t look to Marcus for approval or disapproval this time. It was between the two of them. \"I trust you,\" he said at last, his eyes on the ground, as if he was not brave enough to agree while looking at her. His voice was hoarse. \"I don\u0027t know why. I hardly know you. But I do. Completely.\" Then, as if he had given himself a mental slap for cowardice, he jerked his head up, and looked at her. \"I will serve my Mistress\u0027s pleasure,\" he said. Lauren swallowed a fist size lump of jagged glass, almost crying out at the pain, but an amazing thing happened to it once it cleared her throat. It lodged in her heart, where it was warmed by the simple sincerity in his eyes, the devotion in his voice, and every line of his body. The jagged edges melted, and she felt a complete, tender fulfillment. Someone who trusted her, believed in her, willingly gave himself to her to be cherished and who would cherish her in return. It was the Whole she had wanted to give to Jonathan, but the foundation for it had never been there. The rest of it was always hard work, but the underlying current to give it a chance had to be there. Josh and she had had it instantly. Now they just had to wade through the baggage to keep from fucking it up. \"Then you should cast your eyes down,\" she reproved, and came forward. She kissed him on the top of his bowed head, nuzzling his hair. His fingers clutched her calves for a moment, hard. She clucked at him, correcting him, and he removed his hands, bracing them into tense fists on the floor on either side of her feet. \"You need to remember manners,\" she reminded him, and turned, though her heart had tilted at the sheer desperation of his grasp. \"And what is the lady\u0027s wish, now that she has her slave\u0027s compliance?\" Marcus arched a brow at her, rising from his chair. Lauren paused, and glanced back at Josh, taking him in from head to toe. The bare back, the tight ass, the pink undersides of his bare feet. \"Put him there,\" she nodded to the St. Andrew\u0027s Cross. \"I want him spread and cuffed, face forward. Strip him of all his clothes, oill him down.\" Her gaze watched the muscles knot across his tanned shoulders, in response to her silky words. \"I really, really like her,\" Marcus sighed happily. \"Turn around on your knees, Josh. Raise your eyes, and look at me,\" she said. He did, and he did not look as pleased as Marcus sounded. Lauren turned, walked toward the dressing room. She undid her swimsuit, letting it fall to the floor, and then turned, a Betty Gable pose, just giving him a hint of profile. \"Will you obey me, Josh?\" she asked. \"All you have to do...\" she raised a hand, cupped her breast and stroked its curve idly. \"Is say...no.\" His nostrils flared, as if he caught the scent of her from across the room. \"I\u0027ll obey,\" he managed roughly. \"But I\u0027d rather throw you to the floor, spread your legs wide and fuck you until you lose consciousness.\" She nodded, keeping her expression unruffled, though need tightened like a fist in her gut at the dark intent in those gray eyes. \"Maybe you\u0027ll get that chance...if you\u0027re good.\" She smiled. \"Or maybe, if you\u0027re bad.\" She surprised a grin out of him. It eased the tension in his shoulders, and that reassured her. The stress would come back, she knew, as soon as Marcus started following her instructions. She sensed something dangerous down in this dungeon. The setting was almost too perfect; too open to pushing past hard limits, and she hardly knew his soft ones. She put her hand on the dressing room door, then stopped, turned back. \"Marcus?\" Josh had just shed the shorts, and he was naked, vulnerable and beautiful, his back to her. She wanted to go kiss the soft skin between his shoulder blades, run her hand over the small of his back, smack that taut buttock. All in good time. Down, girl. \"Yes, dear lady?\" From Marcus\u0027s amused expression, Lauren decided he was repeating the question. \"I want him blindfolded. A full head mask, if they\u0027ve got one. Ears, nose and mouth open.\" She closed the door again on his nod, ignoring the alarm in Josh\u0027s face.","sourceLink":"https://allnovel.net/holding-the-cards-nature-of-desire-1/page-15.html","bookId":1906,"book":{"id":1906,"title":"Holding The Cards (Nature of Desire #1)","description":"Storyline: Holding The Cards (Nature of Desire #1) Lauren is a successful doctor with a healthy attitude toward sex, unashamed of her proclivities as a sexual dominant. She wants love and a family, but she\u0027s beginning to believe there is no Mr. Right willing to stand by her in sickness and health...and be cuffed, stripped, and smacked with a riding crop. Then her friend Lisette invites her to spend a long weekend on a private island. It turns out Lisette can\u0027t come with her, but Lauren opts to go anyway, with no one for company but Joshua, the island caretaker, and his visiting friend, Marcus. Though both men are beautiful, it is Joshua that catches Lauren\u0027s attention, and not just because Marcus prefers men. Something in Josh\u0027s stormy eyes calls to her. When Marcus facilitates a game of submission and control between the three of them that will last throughout the weekend, Lauren embraces the opportunity. Josh overwhelms her with his willingness to submit to her body\u0027s desires, but her heart wants to get to the secrets behind those eyes. She is going to have to tear down his defenses and make him give her everything. And this is one Mistress who doesn\u0027t take no for an answer...","cover":"https://allnovel.net/images/holding-the-cards-nature-of-desire-1.jpg","author":"Joey W. Hill","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/holding-the-cards-nature-of-desire-1.html","creation":"Oct 5, 2019 8:58:07 AM","modification":"Oct 5, 2019 5:20:29 PM"}}
