{"id":73622,"no":19,"title":"Page 19","content":"Down in the subdivision, the thumping party music stops abruptly. It’s suddenly so silent I can hear my heart pounding in my ears, the quick and panicked sound of my breathing. The woman in front of me shuffles a little closer. “Sutton,” she whispers, and reaches out an arm to stroke my cheek. “Look at you. You’re so beautiful.”\\n\\n I want to jerk away, but I feel paralyzed. Her hands are cold, sandpapery. I can smell her sour breath. “You’re so beautiful,” she says again, the woman who thinks she’s my mother. But she isn’t. She can’t be. My mother is someone else, someone beautiful and soft and tragic. Not this dirty mountain woman, this freak. For whatever reason, my father—or whoever he is—lied to me. Maybe he just wanted to mess with my mind.\\n\\n Finally, my muscles cooperate, and I pull away. “I—I have to go,” I say, climbing to my feet. “My ride’s waiting.”\\n\\n Becky chuckles. “You don’t have a ride.” She’s on her feet in an instant. She’s quicker than I would have expected. “I saw your grandfather drive away.”\\n\\n I blink. “You’ve been watching me?”\\n\\n She nods. “Oh, sweetheart, I’ve been watching you for years.” Her voice is soothing, as if she’s singing a lullaby, but her words are twisted. “I watched you when you were learning to swim, when you were a little girl. Wearing Mickey Mouse water wings for the longest time. I saw when you dyed your hair blond in junior high. I was at the regional tennis meet last year—I saw you play. You’re amazing. And I saw you run off with that boy tonight—Thayer? Is that his name?”\\n\\n The world feels unsteady under my feet. She knows everything. All this time, this weirdo has been a face in the crowd, an unwelcome guest in my life. White anger surges through my whole body. “You had no right,” I hiss.\\n\\n Becky recoils as if I’ve shoved her. “Of course I do. I gave you life.”\\n\\n There’s something so matter-of-fact about the way she says it, that in that moment, I realize she’s telling me the truth. I let the idea wash over me. It just makes me even sicker. “That gives you even less of a right,” I growl. “You watched me instead of caring for me. And now you just show up randomly, in the desert, in the dark, alone, and drop this on me? What the hell is wrong with you?”\\n\\n Becky squares her shoulders defensively. “This isn’t how I planned it,” she pleads.\\n\\n But I’m riled up. I want to hurt her. I want my words to burn. I’m furious at everyone who lied to me—my dad, my mom, and this woman most of all. “You’re no mother,” I spit, the words dropping into the silence with a sizzle, like acid. “You’re a liar, and I hate you.”\\n\\n “You don’t understand,” she whispers.\\n\\n “You’re damn right I don’t understand, and I don’t want to understand,” I say. “I don’t want to see you ever again.”\\n\\n “Don’t you dare say that!” she screams, grabbing my arm.\\n\\n I freeze. No adult has ever screamed at me like that, from the depths of her soul. Now her chest is heaving. She clamps down hard on my wrist and brings her face close. “They only told me there was going to be one of you,” she growls, her mouth within biting distance. “Not two. You weren’t supposed to be here, Sutton. You weren’t supposed to come.”\\n\\n I stare at her. “Who told you?”\\n\\n But she doesn’t answer. “I was so afraid I’d break you. I break everything I touch.” She’s launched back into that chanting, lullaby voice. “But I guess it’s too late. You’re already broken.”\\n\\n “Get off me,” I protest, straining against her, trying to push away. But she’s so much stronger than she looks. Her wiry arms tighten around me until I can’t breathe. “Stop it!” I scream. I can smell the sweat on her body and feel the hard bones under her skin. My gaze searches around me. I see the dark, open mouth of the canyon below.\\n\\n She hugs me tight, but it feels as if I’m being embraced by a snake, squeezed and squeezed and squeezed and then swallowed whole. I wriggle some more. “Let. Go!”\\n\\n But Becky doesn’t let up. “My little girl,” she says close to my ear. I open my mouth wide, trying to gulp some air, but all I get is a mouthful of T-shirt. As her arms clench tighter and tighter, I hear her words once more: You weren’t supposed to be here, Sutton. It’s too late. You’re already broken.\\n\\n My mother is here to kill me, I think in terror.\\n\\n And then the memory evaporates into darkness.\\n\\n 20\\n\\n THE ESCAPE\\n\\n Becky writhed in her hospital bed, her eyes rolling back and her limbs flailing. She let out a keening groan. Emma staggered backward into the hallway. She felt something wet on her arm. Her wrist was dotted with half-moons of blood where Becky’s nails had broken skin. Her cheeks were wet, too—not with blood, but with tears. Something had broken inside of her: The love, the hope, had withered away. Maybe Becky had killed Sutton. It didn’t seem so difficult anymore, to conceive of her mother as her sister’s killer.\\n\\n I trembled from the memory I’d just recovered, fearing she was right. The crushing way Becky had squeezed me, the sad way she’d looked at me, as though saying good-bye for the last time. You weren’t supposed to be here. They told me. She was hearing voices in her head—voices that told her to kill me.\\n\\n Emma watched through the doorway as two nurses and an orderly surrounded Becky’s bed. “Get her strapped down,” said one of them, a middle-aged woman wearing pink-heart-print scrubs. The silvery tip of a needle flashed in her right hand.\\n\\n A hulking, crew-cut orderly leaned over Becky, grunting as he fixed the leather straps around her wrists. But Becky was too quick for him. Like a cat, she slid away from under his grip, sinuous and fluid. When he grabbed her shoulders, she let out a shrill, tortured scream. The orderly glanced over his shoulder. “A little help?”\\n\\n “On it,” the nurse said, dropping the syringe on a tray. She grabbed Becky’s bare feet. Suddenly, there was a horrible crunching sound, and then a scream. The nurse flew back, blood pouring from her nose. It took Emma a second to realize that Becky had kicked her. The orderly’s grip loosened for a split second in surprise, and Becky sprang to her feet. She grabbed the syringe off the nightstand and wielded it like a weapon.\\n\\n “Stay away from me,” she hissed, her voice hoarse and raspy.\\n\\n The orderly raised his palms. “It’s going to be okay, Ms. Mercer. No one’s trying to hurt you.”\\n\\n Becky looked wildly around the room. The nurse was still lying on the ground in a fetal position, clutching her nose. The orderly had taken a few careful steps toward Becky. She held up the needle higher, pointing it at him. “I’ll do it. I swear I will.” The orderly stopped and took a step back.\\n\\n Emma froze. The hallway was empty and quiet. She was the only one here who might be able to intervene, to take Becky by surprise. She couldn’t allow her sister’s killer to escape.\\n\\n Taking a deep breath, she lunged forward and made a grab at Becky, wrapping her arms tightly around her mother’s skinny shoulders. Becky shrieked and threw Emma’s arms off her, body checking her with surprising force. Emma fell to the floor. She scrabbled away as Becky appeared in the doorway, the syringe still in her hand. Becky paused for a moment, staring down at Emma with wide eyes.\\n\\n “Sutton … ,” she whispered, her eyes shifting to just above Emma—to me. Neither Emma nor I knew which of us she was talking to anymore.\\n\\n Emma’s lips parted. She wanted to move, but her limbs hung heavy and useless. Becky leaned toward her for another moment, then spun on her heel and, with a scream, ran toward the stairwell at the other end of the hallway. A confused babble broke out from the social room. One of the ward’s inhabitants yelled, “Run!”\\n\\n “Someone call security!” spat the nurse in pink-heart scrubs, staggering to her feet.\\n\\n She and the orderly rushed past Emma in the hallway. The patients who had been watching TV were shouting, some of them crying and others bellowing curse words. An old man in a nightshirt went running out of his room toward the stairwell in his own bid for freedom. He was pinned by a muscular orderly and wrestled back toward his room. A siren started to whoop through the linoleum halls.\\n\\n “That night at the canyon.” Emma repeated Becky’s words out loud. Just thinking about Sutton’s last night alive had sent Becky into some kind of fit. Had it been guilt she’d seen on her mother’s face, or something more like … excitement?\\n\\n She thought about Mr. Rochester’s wife in Jane Eyre, sneaking into Jane’s room and destroying her things, setting the house on fire. Becky was a madwoman, and the Mercers had tried to hide her away just like Mr. Rochester had hidden his wife. Now, it seemed, she was getting revenge on all of them.\\n\\n I break everything I touch, Becky had said to me at the canyon.\\n\\n “Girly all alone in the hallway?” asked a creaking voice. Just a few feet away stood the leering man from the social room, the one who had winked at her. His stringy hair fell heavily into his face, and the white T-shirt he wore was blotched with stains. He grinned, revealing yellowed and chipped teeth, and started toward her.\\n\\n Emma looked around frantically to see if anyone had noticed him, but the orderlies and nurses were in a froth of activity, running down the hall or yelling into the phone at the nurses’ station. Emma shook her head mutely. He chuckled and stepped close to her. A ripe smell rolled off him. Up close she could see his eyes were almost black. They glittered malevolently.\\n\\n “Girly shouldn’t be alone in a place like this. She’s too sweet. She gets everyone all excited.”\\n\\n Emma’s back was to the wall. His breath was hot and rancid on her face as he leaned toward her. She turned her face to the side, squeezing her eyes shut. She could picture him, his face coming closer and closer toward hers with those horrible teeth bared …\\n\\n “Mr. Silva, please step back. Ms. Mercer needs some space to breathe.”\\n\\n She opened her eyes to see Mr. Silva wobbling in front of her, looking up the hall to where two people had come in off the elevator. Nisha Banerjee strode purposefully toward them, followed by her father. Dr. Banerjee’s white lab coat fluttered behind him like a cape as he hurried down the hall. Mr. Silva took a step back, looking abashed.\\n\\n “I was helping,” he mumbled.\\n\\n Dr. Banerjee gently propelled him up the hallway toward the TV room. “We have the situation under control now, thank you. Go back to your room, please.”\\n\\n Nisha rushed over to Emma. Her eyes were wide, her uniform rumpled. A stray wisp of hair had fallen down her cheek. She looked like she’d been running. “I heard the commotion and went to get Dad. You okay?”\\n\\n Emma nodded mutely. She swallowed, fighting to keep the hot tears just behind her eyes from spilling down her cheeks.\\n\\n Dr. Banerjee turned to the girls. “Nisha, can you please go and page Sutton’s father? He should be in orthopedics.”\\n\\n Nisha gave Emma another searching look, then stood back up and walked briskly away. \\n\\n","sourceLink":"https://allnovel.net/cross-my-heart-hope-to-die-the-lying-game-5/page-19.html","bookId":2397,"book":{"id":2397,"title":"Cross My Heart, Hope To Die (The Lying Game #5)","description":"Storyline: Cross My Heart, Hope To Die (The Lying Game #5) \\n Cross My Heart, Hope to Die is the fifth title in the suspenseful and twisted Lying Game series by Sara Shepard, author of the #1 New York Times bestselling series Pretty Little Liars. \\n Ever since Sutton Mercer\u0027s murderer tricked her long-lost twin, Emma, into coming to Tucson, Emma has been trying to solve the mystery of Sutton\u0027s death. And now someone else is back in town--Becky, Sutton and Emma\u0027s birth mother. As Emma gets closer to discovering what exactly happened the night Sutton was killed, she learns that Becky isn\u0027t all that she seems. Turns out Sutton wasn\u0027t the only Mercer girl with dark secrets. . . .\\n","cover":"https://allnovel.net/images/cross-my-heart-hope-to-die-the-lying-game-5.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/cross-my-heart-hope-to-die-the-lying-game-5.html","creation":"Oct 5, 2019 8:58:41 AM","modification":"Oct 5, 2019 10:27:55 AM"}}
