{"id":73624,"no":21,"title":"Page 21","content":"Ethan had been asking to go for weeks, and after the scene at the hospital the day before, Emma’s need for relaxation had finally outweighed her reluctance to break the rules. Her body ached all over. The stress of the last few weeks had settled around her shoulders like a weight, leaving her back full of knots and her neck sore. The only thing she wasn’t so eager about was traipsing off into the desolate, scary desert, but Ethan was with her. “You ready for this?” Ethan asked as they walked across the parking lot. Emma hugged Sutton’s straw beach bag to her chest. She glanced around, trying to ignore the feeling that she was being watched. Every time she left the house she became hyperaware of all the hiding places around her, all the places Becky could be. “Uh-huh,” she said uneasily. Ethan, who was in a pair of red swim trunks and a T-shirt printed with an old Japanese Godzilla movie poster, grabbed her hand comfortingly. Emma looked around to get her bearings, then led Ethan down a narrow, unlit deer trail. The resort’s lights twinkled occasionally through gaps in the trees, but otherwise it was dark. Scraps of clouds hung in the sky, concealing patches of stars. Emma’s skin felt prickly. “I hate not knowing where Becky is,” she whispered. Emma had filled him in on everything shortly after arriving home last night. Ethan had wanted to come over, but Emma put him off, claiming exhaustion. It was only partially true. She also didn’t want Ethan coming over when Thayer was still in the front yard. She hadn’t mentioned that Sutton’s ex was helping Mr. Mercer out, and she didn’t need Ethan getting all weird and jealous about it. Ethan nodded. “Me, too. But I won’t let her hurt you,” he said firmly, taking her hand. Emma bit down on her thumbnail, remembering the night at the movie studio when the note had appeared on her car. Whoever had left it had been listening to them talk—she was sure of it. That meant the murderer—Becky—knew that Ethan was in on her secret. Would Becky even hesitate to get rid of Ethan if she needed to? The thought ripped through her like a bullet, and she stopped in her tracks. “Promise me that you’ll be careful,” she said urgently. “If you see Becky, don’t do anything brave or stupid. She’s dangerous. And I can’t bear the thought of losing you.” “You won’t lose me,” he said. “It’s going to be okay. As long as we’re together, she can’t hurt us.” Emma swallowed hard. With Ethan’s arms wrapped around her so protectively, she almost felt safe. “Okay,” she whispered. Careful, I thought. You can’t afford to let down your guard. Becky is stronger and smarter than she looks. “Do you want to talk about it?” Ethan asked. “About … suspects? What to do about Becky?” Emma felt a pang of guilt. As much as she needed to focus on the investigation, she had let it consume their relationship. Ethan deserved a night off from playing Nancy Drew. “Let’s just be us for a little bit,” she said, and her heart warmed at the sight of his face lighting up. “Sounds good to me,” Ethan said, kissing her lightly and melting the tension in her limbs. She leaned into him, loving the way their bodies fit together. “Come on,” he murmured, taking a step back and pulling her along the path. The springs were in a small clearing, landscaped with red rocks and lit by floodlights positioned discreetly in the surrounding trees. Steam rose invitingly from the surface. “It’s beautiful, right?” Emma said, turning to Ethan. But he wasn’t looking around, admiring the landscape. Instead he was staring at her so intently that she blushed. “You’re beautiful,” he whispered. She stepped forward silently and touched his cheek, falling under the spell of the still, peaceful evening. Ethan closed his long-lashed eyes, and she traced the line of his jaw, the perfect cupid’s bow of his lips, his cheekbones. He pulled her into his arms and kissed her, more urgently this time. Her lips opened against his as his hand coiled into her hair. All other thoughts were swept from her mind. She ran her hands beneath his T-shirt, up the rigid V of his stomach muscles, before pulling the shirt off over his head. He tugged at the tank dress she’d thrown on over her bikini, leaving it on the ground with his shirt. Their breathing was shallow and quick. She took him by the hand. Slowly, gazing into his eyes, she led him into the springs. The water roiled against her, too hot, almost painful at first. They sat on the stone bench, backs to the side of the pool. “You’re amazing, you know that?” Ethan finally whispered. She rested her cheek over his heart, feeling its strong pulse in his chest. “So are you,” she said. “I’ve never met anyone like you before.” “Guys like me are a dime a dozen,” he teased. “What boy doesn’t love poetry and astrophysics?” She laughed softly, but then his eyes became serious. “Emma, you’re the special one. I can’t believe I’ve found you. I can’t believe you’re mine.” “I’m glad you did,” she murmured. “And I am yours.” He rested his forehead against hers, gazing directly into her eyes. He took a deep breath. “Emma … I love you.” Emma’s lips parted. She pulled back, cupping his face in her fingers. “I love you, too,” she whispered. It was all she’d ever wanted—to be loved, to find someone who understood her. To find someone she could share everything with. They stepped into deeper water. Emma wrapped her legs around Ethan’s waist, and he held her up, carrying her toward the source of the spring, where the water was warmest. She kissed him playfully—his neck, his shoulders, his mouth. His hand traced along the back of her head, moving restlessly in her hair, then drifted downward to find the knot tying her bikini behind her neck. He fumbled with it for a moment before she realized what he was doing. “Wait,” she gasped, catching her breath. She put a hand on his chest. Suddenly she felt exposed, and nervous. Ethan bit his lip. “Sorry,” he said, looking ashamed. He pulled his hands away from her. She stroked a damp curl out of his eyes. “Ethan, I just mean … I want to, but not now. It’s too public.” His eyes darted around the clearing, studying the rocks, the surface of the water—anything but her face. “Too public for … what?” he asked shyly. “What I mean is … do you want to … are you thinking of … I would love to—” “Yes,” Emma interrupted him. “I would love to, too.” She’d been imagining her first time with Ethan ever since they started dating, though she hadn’t been brave enough to confess it until now. She hadn’t known if she was ready either. But now, knowing that he loved her, knowing that she loved him, she was suddenly sure. “I want to share that with you,” she went on. “I’ve never … never done that before.” “Neither have I,” Ethan said. He cupped her chin in his hand, and she looked up into his eyes. “When the time is right, it’ll be special for both of us.” They kissed a little more after that, but slower, without the same frenzy. Between the warmth of the water and the feeling of Ethan’s embrace, Emma had completely relaxed. Overhead, stars shimmered in the clear desert sky. A chorus of crickets serenaded them from the nearby tree branches. This was a perfect idea, Emma thought. To let go of her fear for a few minutes, to forget about all of the heartbreak and fury and terror that Becky brought with her. What would she have done if she hadn’t been able to share any of that with Ethan? But as much as I hoped that Ethan could protect my sister, I was far from certain. Becky was unpredictable and dangerous—and she was out there somewhere in the darkness. If she had tried to run down Thayer that night in the canyon, would she try to get rid of Ethan, too? 23 HELP FROM AN UNEXPECTED SOURCE Ethan’s house was dark when Emma dropped him off. Some of the other homes on the block already had their Christmas lights out, the red, green, and white glowing colorfully against the adobe walls even though it wasn’t even Thanksgiving yet. One family had a herd of fake reindeer on their lawn, complete with a red-nosed Rudolph and a sleigh full of poinsettias. But Ethan’s bungalow was undecorated, even neglected. Paint flaked off the siding, and the porch had one rotten step Emma almost always forgot about. It creaked ominously under her feet. “When can I see you again?” Ethan asked, his arms coiled around her waist. “Tomorrow at school?” she teased. He kissed her on the nose playfully. “Saturday?” he asked, hopeful. “We could rent a movie, or just look at the stars …” Emma smiled. That’s how they had met—Emma caught him stargazing while she was at Nisha’s party, the first night she was pretending to be Sutton. “We have Charlotte’s party, remember?” she said. He wrinkled his nose a little, and Emma laughed. “Come on, Mr. Wallflower, don’t make me face it alone.” Ethan had never been big on parties, but she’d been hoping that getting to know Sutton’s friends better would warm him up to the idea. “For you, anything,” he whispered. He gave her another lingering kiss, and then slipped through the door. She heard the lock snap shut behind him. Across the street, the Catalina Mountains loomed. She couldn’t see it in the dark, but the entrance to the Sabino Canyon recreation area was in sight of Ethan’s porch. Just the thought of it made her skin crawl. It was where she’d waited for Sutton when she’d first come to Tucson, full of anticipation. It was also where her sister had spent the last night of her life. She shivered, feeling as if the canyon itself were watching her, a dark and malevolent presence. She didn’t believe in ghosts, but something about the area felt menacing. Maybe Becky was out there. The sound of footsteps interrupted Emma’s thoughts. She froze, her hand on her car door. Just as she was getting ready to jump in and slam the locks down, Nisha stepped into the light. She was dressed in Hollier High sweatpants and a tank top that showed off her muscular shoulders. Her hair glinted almost purple in the darkness. She wore a pair of tortoiseshell Guess eyeglasses and no makeup. It looked as if she’d been getting ready for bed. “Hey,” Nisha said. “Sorry. I didn’t mean to scare you.” Emma exhaled, then laughed nervously. “You didn’t. I’m just a little on edge, I guess.” “From hanging out with Ethan?” “Yeah—I mean, no, of course not. For other reasons. But yeah, Ethan and I were hanging out.” Just saying his name brought a smile to her lips. Nisha shook her head. “You guys are the weirdest couple of all time.” “Why do you say that?” The motion-sensor light in the Banerjees’ driveway shut off, and they were left in the dark. Nisha cleared her throat. “Sorry. Forget I said it. Anyway, I saw your car and just wanted to make sure everything was okay. I mean, after all the craziness at the hospital.”","sourceLink":"https://allnovel.net/cross-my-heart-hope-to-die-the-lying-game-5/page-21.html","bookId":2397,"book":{"id":2397,"title":"Cross My Heart, Hope To Die (The Lying Game #5)","description":"Storyline: Cross My Heart, Hope To Die (The Lying Game #5) Cross My Heart, Hope to Die is the fifth title in the suspenseful and twisted Lying Game series by Sara Shepard, author of the #1 New York Times bestselling series Pretty Little Liars. Ever since Sutton Mercer\u0027s murderer tricked her long-lost twin, Emma, into coming to Tucson, Emma has been trying to solve the mystery of Sutton\u0027s death. And now someone else is back in town--Becky, Sutton and Emma\u0027s birth mother. As Emma gets closer to discovering what exactly happened the night Sutton was killed, she learns that Becky isn\u0027t all that she seems. Turns out Sutton wasn\u0027t the only Mercer girl with dark secrets. . . .","cover":"https://allnovel.net/images/cross-my-heart-hope-to-die-the-lying-game-5.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/cross-my-heart-hope-to-die-the-lying-game-5.html","creation":"Oct 5, 2019 8:58:41 AM","modification":"Oct 5, 2019 10:27:55 AM"}}
