{"id":74454,"no":29,"title":"Page 29","content":"• talking to strangers\\n\\n • asking strangers for favors\\n\\n • being willing to make a complete fool of myself\\n\\n • letting someone else (gideon) help me\\n\\n It also relies on a number of things beyond my control, including:\\n\\n • the kindness of strangers\\n\\n • the ability of strangers to be spontaneous\\n\\n • the ability of strangers to drive quickly\\n\\n • tiny’s musical lasting more than one act\\n\\n I’m sure it’s going to be a total disaster. but i guess the point is that i’m going to do it anyway.\\n\\n I know i’ve cut it real close, because when gideon and i walk into the auditorium, they’re carrying a swing set onto the stage. and not just any swing set. i recognize that swing set. that exact same swing set. and that’s when the trippiness kicks in, big-time.\\n\\n gideon: holy shit.\\n\\n at this point, gideon knows everything that went on. not just with me and tiny, but with me and maura, and me and my mom, and basically me and the whole world. and not once has he told me i was stupid, or mean, or awful, or beyond help. in other words, he hasn’t said any of the things i’ve been saying to myself. instead, in the car ride over, he said\\n\\n gideon: it all makes sense.\\n\\n me: it does?\\n\\n gideon: completely. i would’ve done the same things you did.\\n\\n me: liar.\\n\\n then, completely out of nowhere, he held out his pinkie.\\n\\n gideon: pinkie swear, no lie.\\n\\n and i hooked my pinkie in his. we drove that way for a little bit, with my little finger curled into his little finger.\\n\\n me: next thing you know, we’ll be blood brothers.\\n\\n gideon: and we’ll be having sleepovers.\\n\\n me: in the backyard.\\n\\n gideon: we won’t invite the girls.\\n\\n me: what girls?\\n\\n gideon: the hypothetical girls that we won’t invite.\\n\\n me: will there be s’mores?\\n\\n gideon: what do you think?\\n\\n I knew there would be s’mores.\\n\\n gideon: you know you’re insane, right?\\n\\n me: this is news?\\n\\n gideon: for doing what you’re about to do.\\n\\n me: it was your idea.\\n\\n gideon: but you did it, not me. i mean, you’re doing it.\\n\\n me: we’ll see.\\n\\n and it was strange, because as we drove on, it wasn’t gideon or tiny i was thinking about, but maura. as i was in that car with gideon, so completely comfortable with myself, i couldn’t help but think that this was what she wanted from me. this is what she always wanted from me. and it was never going to be like this. but i guess for the first time i saw why she would try so hard for it. and why tiny tried so hard for it.\\n\\n now gideon and i are standing in the back of the theater. i’m looking around to see who else is here, but i can’t really tell in the darkness.\\n\\n the swing set stays in the back of the stage as a chorus line of boys dressed as boys and girls dressed as boys lines up in front of it. i can tell this is meant to be a parade of tiny’s ex-boyfriends because as they line up, they are singing,\\n\\n chorus: we are the parade of ex-boyfriends!\\n\\n I have no doubt the kid at the end is supposed to be me. (he’s dressed all in black and looks really moody.)\\n\\n they all start singing their breakup lines:\\n\\n ex-boyfriend 1: you’re too clingy\\n\\n ex-boyfriend 2: you’re too singy\\n\\n ex-boyfriend 3: you’re so massive\\n\\n ex-boyfriend 4: i’m too passive.\\n\\n ex-boyfriend 5: i’d rather be friends.\\n\\n ex-boyfriend 6: i don’t date tight ends.\\n\\n ex-boyfriend 7: i found another guy.\\n\\n ex-boyfriend 8: i don’t have to tell you why.\\n\\n ex-boyfriend 9: i don’t feel the spark.\\n\\n ex-boyfriend 10: it was only a lark.\\n\\n ex-boyfriend 11: you mean you won’t put out?\\n\\n ex-boyfriend 12: i can’t conquer my doubt.\\n\\n ex-boyfriend 13: i have other things to do.\\n\\n ex-boyfriend 14: i have other guys to screw.\\n\\n ex-boyfriend 15: our love has all been in your head.\\n\\n ex-boyfriend 16: i’m worried that you’ll break my bed.\\n\\n ex-boyfriend 17: i think I’ll just stay home and read.\\n\\n ex-boyfriend 18: i think you’re in love with my need.\\n\\n that’s it - hundreds of texts and conversations, thousands upon thousands of words spoken and sent, all boiled down into a single line. is that what relationships become? a reduced version of the hurt, nothing else let in. it was more than that. i know it was more than that.\\n\\n and maybe tiny knows, too. because all the other boyfriends leave the stage except for boyfriend #1, and i realize that we’re going to go through them all, and maybe each one will have a new lesson for tiny and the audience.\\n\\n since it’s going to be a while before we get to ex-boyfriend #18, i figure it’s a good time for me to call the other will grayson. i’m worried he’ll have his phone off, but when i go out to the lobby to call (leaving gideon to save me a seat), he picks up and says he’ll meet me in a minute.\\n\\n I recognize him right away, even though there’s something different about him, too.\\n\\n me: hey\\n\\n me: one helluva show in there.\\n\\n o.w.g.: i’ll say. i’m glad you came.\\n\\n me: me too. because, you see, i had this idea. well, actually, it was my friend’s idea. but here’s what we’re doing. . . .\\n\\n I explain it to him.\\n\\n o.w.g.: that’s insane.\\n\\n me: i know.\\n\\n o.w.g.: do you think they’re really here?\\n\\n me: they said they would be. but even if they’re not, at least there’s you and me.\\n\\n the other will grayson looks terrified.\\n\\n o.w.g.: you’re going to have to go first. i’ll back you up, but i don’t think i could go first.\\n\\n me: you have a deal.\\n\\n o.w.g.: this is totally crazy.\\n\\n me: but tiny’s worth it.\\n\\n o.w.g.: yeah, tiny’s worth it.\\n\\n I know we should go back to the play. but there’s something i want to ask him, now that he’s in front of me.\\n\\n me: can i ask you something personal, will grayson to will grayson?\\n\\n o.w.g.: um . . . sure.\\n\\n me: do you feel things are different? i mean, since the first time we met?\\n\\n o.w.g. thinks about it for a second, then nods.\\n\\n o.w.g.: yeah. i guess i’m not the will grayson i used to be.\\n\\n me: me neither.\\n\\n I open the door to the auditorium and peek in again. they’re already on ex-boyfriend #5.\\n\\n o.w.g.: i better return backstage. jane’s going to wonder where i went.\\n\\n me: jane, eh?\\n\\n o.w.g.: yeah, jane.\\n\\n It’s so cute - there are like two hundred different emotions that flash across his face when he says her name - everything from extreme anxiety to utter bliss.\\n\\n me: well, let’s take our places.\\n\\n o.w.g.: good luck, will grayson.\\n\\n me: good luck to us all.\\n\\n I sneak back in and find gideon, who fills me in on what’s going on.\\n\\n gideon (whispering): ex-boyfriend six was all about the jockstraps. to the point of fetish, i’d say.\\n\\n almost all the ex-boyfriends are like this - never really three-dimensional, but it soon becomes apparent that this is deliberate, that tiny’s showing how he never got to know all of their dimensions, that he was so caught up in being in love that he didn’t really take the time to think about what he was in love with. it’s agonizingly truthful, at least for exes like me. (i see a few more boys shifting in their seats, so i’m probably not the only ex in the audience.) we make it through the first seventeen exes, and then there’s a blackout and the swing set is moved to the center of the stage. suddenly, tiny’s in the spotlight, on the swing, and it’s like my life has rewound and is playing back to me, only in musical form. it’s exactly as i remember it . . . until it’s not, and tiny’s inventing this new dialogue for us.\\n\\n me-on-stage: i’m really sorry.\\n\\n tiny: don’t be. i fell for you. i know what happens at the end of falling - landing.\\n\\n me-on-stage: i just get so pissed off at myself. i’m the worst thing in the world for you. i’m your pinless hand grenade.\\n\\n tiny: i like my pinless hand grenade.\\n\\n It’s funny - i wonder if i’d said that, and if he’d said that, then maybe things would have played out differently. because i would have known that he understood, at least a little. but i guess he needed to be writing it as a musical to see it. or say it.\\n\\n me-on-stage: well, i don’t like being your pinless hand grenade. or anybody’s.\\n\\n but the weird thing is, for once i feel the pin is in.\\n\\n tiny’s looking out into the audience right now. there’s no way for him to know i’m here. but maybe he’s looking for me anyway.\\n\\n tiny: i just want you to be happy. if that’s with me or with someone else or with nobody. i just want you to be happy. i just want you to be okay with life. with life as it is. and me, too. it is so hard to accept that life is falling. falling and landing and falling and landing. i agree it’s not ideal. i agree.\\n\\n he’s talking to me. he’s talking to himself. maybe there’s no difference.\\n\\n I get it. i understand it.\\n\\n and then he loses me.\\n\\n tiny: but there is the word, this word phil wrayson taught me once: weltschmerz. it’s the depression you feel when the world as it is does not line up with the world as you think it should be. i live in a big goddamned weltzschermz ocean, you know? and so do you. and so does everyone. because everyone thinks it should be possible just to keep falling and falling forever, to feel the rush of the air on your face as you fall, that air pulling your face into a brilliant goddamned smile. and that should be possible. you should be able to fall forever.\\n\\n and i think: no.\\n\\n seriously. no.\\n\\n because i have spent my life falling. not the kind that tiny’s talking about. he’s talking about love. i’m talking about life. in my kind of falling, there’s no landing. there’s only hitting the ground. hard. dead, or wanting to be dead. so the whole time you’re falling, it’s the worst feeling in the world. because you feel you have no control over it. because you know how it ends.\\n\\n I don’t want to fall. all i want to do is stand on solid ground.\\n\\n and the weird thing is, i feel like i’m doing that now. because i am trying to do something good. in the same way that tiny is trying to do something good.\\n\\n tiny: you’re still a pinless grenade over the world not being perfect.\\n\\n no, i am a pinless grenade over the world being cruel. but every time i’m proven wrong, that pin goes in a little more.\\n\\n tiny: and i’m still - every time this happens to me, everytime i land, it still hurts like it has never happened before.\\n\\n he’s swinging higher now, kicking his legs hard, the swing set groaning. it looks like he’s going to bring the whole contraption down, but he just keeps pumping his legs and pulling against the chain with his arms and talking.\\n\\n tiny: because we can’t stop the weltschmerz. we can’t stop imagining the world as it might be. which is awesome! it is my favorite thing about us!\\n\\n when he gets to the top of his arc now, he’s above the reach of the lights, screaming down at the audience from the darkness. then he swings back into view, his back and ass rushing toward us in the audience.\\n\\n tiny: and if you’re gonna have that, you’re gonna have falling. they don’t call it rising in love. that’s why i love us!\\n\\n at the top of the arc, above the lights, he kicks out of the swing. he is so goddamned nimble and quick about it, i can barely see it, but he lifts himself up by the arms and pulls his legs up and then just lets go and grabs onto a rafter. the swing falls before he does, and everyone - the audience, the chorus - gasps.\\n\\n tiny: because we know what will happen when we fall!\\n\\n the answer to this is, of course, that we will crash right on our ass. which is exactly what tiny does. he lets go of the rafters, crashes down right in front of the swing set, and collapses in a heap. i flinch, and gideon grabs my hand.\\n\\n I can’t tell whether the kid playing me is supposed to be in character or out of character when he asks tiny if he’s all right. whatever the case, tiny waves the imitation me away, motions to the conductor, and a moment later, it starts - a quiet song, all piano keys spaced far apart. tiny recovers his breath during the intro and starts to sing again.\\n\\n tiny:\\n\\n It’s all about falling\\n\\n you land and get up so you can fall again\\n\\n It’s all about falling\\n\\n I won’t be afraid to hit that wall again\\n\\n It’s chaos up there. the chorus is desperately clinging to the chorus. they keep singing how it’s about the falling, and then tiny steps forward and says his lines over them.\\n\\n tiny: maybe tonight you’re scared of falling, and maybe there’s somebody here or somewhere else you’re thinking about, worrying over, fretting over, trying to figure out if you want to fall, or how and when you’re gonna land, and i gotta tell you friends that to stop thinking about the landing, because it’s all about falling.\\n\\n It’s incredible. it’s like he’s lifting off the stage, he believes in his words so strongly. and i realize what it is that i have to do. i have to help him realize that it’s the belief, not the words, that mean everything. i have to make him realize the point isn’t the falling. it’s the floating.\\n\\n tiny calls for them to bring up the houselights. he’s looking around, but he doesn’t see me.\\n\\n I gulp.\\n\\n gideon: ready?\\n\\n the answer to this question is always going to be no. but i have to do it anyway.\\n\\n tiny: maybe there is something you’re afraid to say, or someone you’re afraid to love, or somewhere you’re afraid to go. it’s gonna hurt. it’s gonna hurt because it matters.\\n\\n no, i think. NO.\\n\\n It doesn’t have to hurt.\\n\\n I stand up. and then i almost sit down again. it is taking all of my strength to stand up.\\n\\n I look at gideon.\\n\\n tiny: but i just fell and landed and i am still standing here to tell you that you’ve gotta learn to love the falling, because it’s all about falling.\\n\\n I reach out my pinkie. gideon takes it in his.\\n\\n tiny: just fall for once. let yourself fall!\\n\\n the whole cast is on the stage now. i see that the other will grayson has snuck on, too, and he’s wearing these wrinkled jeans and a plaid shirt. right next to him is a girl who must be jane, wearing this shirt that says I’m with Phil Wrayson. \\n\\n","sourceLink":"https://allnovel.net/will-grayson-will-grayson/page-29.html","bookId":2712,"book":{"id":2712,"title":"Will Grayson, Will Grayson","description":"Storyline: Will Grayson, Will Grayson by John Green , David Levithan \\n One cold night, in a most unlikely corner of Chicago, two teens—both named Will Grayson—are about to cross paths. As their worlds collide and intertwine, the Will Graysons find their lives going in new and unexpected directions, building toward romantic turns-of-heart and the epic production of history’s most fabulous high school musical. \\n Hilarious, poignant, and deeply insightful, John Green and David Levithan’s collaborative novel is brimming with a double helping of the heart and humor that have won both of them legions of faithful fans.\\n","cover":"https://allnovel.net/images/will-grayson-will-grayson.jpg","author":"John Green","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/will-grayson-will-grayson.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 10:31:00 AM"}}
