{"id":110990,"no":43,"title":"Page 43","content":"\n Will looked as though she’d struck him. Lena cringed and grabbed his hand. “I’m so sorry. I never meant to do it. I never wanted to…”\n He lifted his hand and she flinched. Will froze, then slowly reached out and brushed his fingers under her jaw, tilting her face toward him. “Somebody threatened you?” The words were soft. Dangerous.\n Lena trembled. “I told them I didn’t want anything more to do with it.”\n His brows drew together. “Lena, I ain’t gonna hurt you.” His fingers tightened on her cheeks. “I’m gonna smash someone else’s head into a wall, but I would never hurt you.”\n Relief welled up like a sudden flood. A hot tear leaked down her cheek. “I thought you’d be angry with me—”\n “Christ.” He grabbed her roughly, enveloping her against his chest. “No more secrets ’tween us. Promise?”\n She nodded, breathing in his familiar scent. Her fingers clenched in his shirt.\n “You’re mine,” he murmured. “Foolish plots and all.”\n Stroking the sticky hair off her face, he lowered his head and brushed his mouth against hers. Lena kissed him desperately, clinging to his shirt.\n Behind them someone cleared their throat. “What, precisely, is going on?” Honoria asked.\n They were all four staring at her. Blade examined the situation, his eyes narrowed. “Someone came in here, took one of Charlie’s toys, didn’t they? Took a lock of his hair?”\n Charlie clapped a hand to his head, as though searching for the lack.\n Will took a deep breath. “Lena? You may as well tell ’em. Blade’ll need to know, if we’re to keep the boy safe.”\n Lena slid her hand into his and locked her gaze on Honoria’s. “Promise me you won’t yell.”\n Honoria crossed her arms over her chest. “I wouldn’t want to make a promise I might break.”\n This was the price of keeping secrets. Lena squared her shoulders and told them everything.\n When she’d finished, everyone was looking at her. Honoria’s mouth was a hyphen, but at least she wasn’t screaming.\n “Humanists,” Blade muttered. “Like your father?”\n Honoria nodded sharply. “I assume this has something to do with the cipher-text Will wanted me to decode?”\n Lena breathed a sigh of relief. “Yes. I thought it was only times and dates for them to meet. Information.”\n Her hopeful look died when Honoria’s gaze skittered away. “I tried an auto key cipher, but I couldn’t make heads or tails of it,” Honoria said. “So I asked Leo. His colleague, Lord Balfour, has this wonderful machine, based on one of Babbage’s uncompleted designs. It’s an electro-mechanical rotor cipher machine and—”\n “The message,” Blade interrupted with a slight smile.\n “‘Project Firebird aborted. Suspect sabotage from within, holding off and awaiting orders. Mechanists under hand once more. Await further instructions.’”\n “What does it mean?” Lena asked.\n Honoria shrugged.\n “Firebird,” Will muttered. “The draining factories?”\n “But Ros… Mercury claimed they had nothing to do with that.”\n “Then she lied,” Will said. “Or someone else is sendin’ these messages from the humanist faction.”\n “Bloody politics,” Blade muttered.\n Honoria frowned. “What I want to know is why you kept all of this to yourself. Why didn’t you tell us?”\n “I told you,” Lena stammered. “I didn’t realize—”\n “Not you.” Her gaze speared Will. “You.”\n He glanced at Blade, then away. “I thought I could handle it.”\n Honoria’s eyes narrowed. She looked between the two men. “What’s going on?”\n “Nothin’,” Will muttered.\n Blade stared at her, his arms crossed defensively over his chest. “Will didn’t want me comin’ up against the Echelon.”\n “But you’ve—”\n “I’ve been drinkin’ ’uman blood again,” he said suddenly. “It’s why me CV results ain’t been comin’ down more.”\n Honoria’s jaw dropped in surprise. “But…but why? My vaccinated blood was curing you. If we kept going your CV results might almost negate themselves. You might be completely cured. You might be—”\n “’Uman,” Blade said softly. He looked like a man facing the tumbrel. “It takes away the threat o’ the virus, luv, but it takes me strength, me speed.” His face screwed up. “It’s enough to know I ain’t facin’ the Fade anymore. I can’t afford to be weaker. The Echelon’d be upon us like a pack o’ rabid dogs. Will were tryin’ to prevent that from ’appenin’.”\n Honoria stared at him helplessly, her eyes gleaming with tears. “Why doesn’t anyone tell me these things?” Her hot gaze flashed to Lena. “Am I truly so rabid, so fearful, that you’re all too scared to tell me? I only want what’s best for you. For all of you.”\n Blade let out a sharp breath, as if he’d feared worse. “It ain’t that, luv. I didn’t want to disappoint you. You were so set on a cure.”\n “I’m not irrational,” she said.\n “You’re too rational,” Blade said with a tentative smile. He stroked her fingers and she slowly turned her palm toward him, accepting the touch. Relief flooded his expression.\n “Well.” Honoria let out a sharp breath. “Since we’re so set on spilling our secrets today.” She pressed her hand to her midriff and blurted, “I think I’m with child.”\n The color drained out of Blade’s face. For a moment he looked as he had three years ago, when he stared the Fade in the face. “Honor?” The whisper was a mix of terror and awe.\n Delight swam up inside Lena’s chest. “Are you certain?” she asked, taking her sister by the hands.\n “I saw the midwife yesterday,” Honoria replied, her eyes flooding with tears again.\n Lena hugged her close, happiness surging through her. “You deserve it,” she whispered. “You’re going to be a wonderful mother.” She couldn’t help a rueful grin. “You’ve had plenty of practice at mothering all of us.”\n Esme embraced them both. Over Honoria’s shoulder Lena saw Blade stagger against the armchair. Charlie caught him with a grin. Even Will’s lips curled in a smile.\n “Bloody ’ell,” Blade muttered. “That’s…that’s amazin’.”\n Then he reached out and dragged Honoria into his arms.\n The next day Lena took a deep breath and smoothed the aubergine taffeta over her hips. The girl in the mirror looked like a stranger; corseted and bustled, with elegant feathers in her hair and one of the pretty clockwork brooches she’d designed at her breast. The tiny dragonfly’s brass wings fluttered rhythmically and she knew it would draw the focus off her eyes.\n Will said they’d change, the coppery ring around her pupils gradually taking over. Lena quite liked them. It was a sign that this pretty girl who stared back at her was no longer powerless. No longer prey.\n She smiled and the reflection smiled back at her, teeth slightly bared. Yes. That was better. That was more herself now. She was tired of being afraid, and telling everyone her secrets had taken the last weight off her shoulders. Blade had tightened security on the warren and Charlie was safe and sound now. Nobody would get near him.\n All that remained was to bring this treaty to a close.\n Her eyes narrowed. She was very much going to enjoy ruining the mysterious assailant’s plans.\n “Are you ready?” Leo called, rapping at her opened door. He’d insisted that she accompany him. Not only would it help disguise the rumors about her precise relationship with Will, but the weight of his title would offer further protection. If the mysterious assailant made a move toward her, he’d be waiting. Between he and Blade, they’d both resolved to dig out the traitor.\n “You’ve seen Mrs. Wade to the door?”\n The first thing she’d insisted upon when she returned to Waverly Place the night before. She’d had enough of being manipulated and betrayed. Mandeville had finished the outer casing of the transformational and picked up the interior this morning, professing his sincere apologies, but she felt it would be a long time before she could trust him again.\n “With a reference.” Leo’s dark expression betrayed his curiosity, but he wouldn’t ask. They’d never shared a relationship like that. He’d protected her and guided her through the dangerous waters of the Echelon, but he always held her at a slight distance. Indeed, a distance with which he held the world.\n “Thank you,” she murmured, stretching up on her toes to press her lips to his cheek. “For everything you’ve done for me. For taking me in when I didn’t know what to do with my life.”\n A slight pause. Then an enigmatic lift of his brow as he drew away, a rash of heat curving across his cheeks. “I believe what you’re saying is good-bye.”\n She nodded. “I know where I belong now.”\n “With Will.”\n “How did you—?”\n “Lena,” he said dryly, “there are only so many ways the loupe can be spread. I don’t even want to imagine how you caught it, since you’re my…”\n “Your sister,” she prompted.\n He took a deep breath. “I can never be your brother. Not in public. You know that. This was all I could ever give you.”\n Always so stiff and distant. She smiled mischievously. “You’re going to be an uncle, you know?”\n His gaze dropped swiftly to her midriff, then away.\n “Not me,” she laughed.\n An incredulous expression broke over his oh-so-proper countenance. “Good God. He’s breeding.”\n “He is your brother-in-law,” she reminded him. “With any luck their baby will be just like him.”\n Horror gave way to a calculated expression. “Yes,” Leo murmured. A smile edged over his lips. “That would be justice.”\n He laughed then, the sound of it following them all the way to the carriage.\n Steam carriages disgorged their occupants onto the cobbled courtyard outside the Ivory Tower. Lena gathered her skirts and looked around for Will. The courtyard was a flurry of color, with bright parasols and elegant hats. At a ball, a debutante seeking a protector was expected to wear white. During the day, the vibrant nature of the Echelon sprang to life.\n “Where’s Will?” she mused.\n “I don’t see Blade’s carriage,” Leo murmured. “Perhaps they’re not yet here. Traffic in the streets is rather congested.”\n Her eye caught a conservative group near the stairs. “The Norwegians.” Snapping open her parasol, she straightened. “I’m going to speak to them whilst we wait.”\n “Lena—”\n With a blithe smile she turned and stepped into someone. They collided in a tangle of skirts, and Lena grabbed the other woman’s arm before she could help herself.\n Green eyes widened and Adele looked away sharply. “Pardon,” she murmured, attempting to move past.\n Lena’s fingers tightened. “Don’t. Please, Adele.”\n A pained expression crossed her friend’s face. “I can’t,” she whispered. “My father’s on the verge of signing a thrall contract for me with Lord Abagnale.”\n “That old brute?”\n Adele glanced around. “I can’t be seen with you. You know what they’re like. This is my last chance.”\n “Adele, there are whispers he beat his last thrall to death!”\n Color faded from Adele’s smooth cheeks. “You don’t think I’m aware of that?” She looked away and Lena’s gaze was drawn to the heavy pearl choker that draped her throat.\n “Why are you wearing that?”\n Adele shook her head. “It doesn’t matter.”\n “Tell me.” She reached up, as if to move it, but Adele snatched her fingers and stared at her pleadingly.\n “They think I’m anyone’s game now. Colchester found me alone—”\n “Colchester?” Lena hissed. “What did he do to you?”\n “He said since I liked it so much with Cavendish…I couldn’t stop him. That’s why I need Abagnale. He’s rich and he gives his thralls everything they desire.”\n “That’s to make up for the bruises.”\n “I don’t care.” Adele’s grip tightened. “If he gives me enough, maybe I can pawn it. Maybe I can get enough money to run away. To America. To New York.” \n","sourceLink":"https://allnovel.net/heart-of-iron-london-steampunk-2/page-43.html","bookId":1583,"book":{"id":1583,"title":"Heart of Iron (London Steampunk #2)","description":"Storyline: \n Heart of Iron (London Steampunk #2) \n Lena Todd makes the perfect spy. Nobody suspects the flirtatious debutante could be a sympathizer for the humanist movement haunting London’s vicious blue blood elite. Not even the ruthless Will Carver, the one man she can’t twist around her little finger, and the one man whose kiss she can’t forget…\n \n","cover":"https://allnovel.net/images/heart-of-iron-london-steampunk-2.jpg","author":"Bec McMaster","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/heart-of-iron-london-steampunk-2.html","creation":"Oct 5, 2019 8:57:45 AM","modification":"Oct 6, 2019 12:13:25 AM"}}
