{"id":71510,"no":17,"title":"Page 17","content":"\\n\\n “If you weren’t havin’ fun, you should’ve said something.”\\n\\n “I’m saying something now!”\\n\\n More pissed off than hurt, he loomed over her. “So you’re telling me that all the time we’ve spent together in the last couple of days…has sucked?”\\n\\n She threw her hands up in the air. “I knew you’d take that the wrong way.”\\n\\n “How else am I supposed to take it?” he demanded.\\n\\n “As constructive criticism! As a suggestion that this is not working. When you have dates with other women, what do you do?”\\n\\n He tried to remember his last date. An actual date. Where he picked the woman up, took her to supper or to a movie. He couldn’t remember.\\n\\n It’d been a long time. A damn long time.\\n\\n That’s when Tell realized all his encounters with women in recent years had been hookups. Regardless if he met the chick in a bar, or at a rodeo, or at the poker table. He’d flirt. She’d flirt back. Then they’d be naked, fucking the night away. In the morning, they’d go their separate ways.\\n\\n He didn’t want that with Georgia. He wanted something…real. “Honestly, I don’t even remember my last damn date, so maybe that’s why I’m a little rusty. Why don’t you tell me about your dates?”\\n\\n That strong chin of hers came up. “Most guys at least try to get me in the sack on the first date.”\\n\\n Tell felt the strangest surge of jealousy. “And because I haven’t tried to nail you the first week we’ve been together, there’s something wrong with me?”\\n\\n “Oh, there’s nothing wrong with you. You’re sexy, you’ve got an incredible body and I’ve no doubt you know exactly how to use it. You act like you want me. But there’s no follow-through, just the constant tease. So can you understand why I’d be suspicious that this is a game? Since you couldn’t have me ten years ago when you wanted me, but I want you now, you’re going to lead me on and then change your mind?”\\n\\n His mouth opened to deny it, but part of him feared she was right. If any other woman had been so hot to get naked and wild with him, he would’ve jumped her the first night. But he’d held back with her. Not just one night, but every time they’d been together.\\n\\n Shit. Maybe he was turning this into a game. Despite his mortification, he looked at her. “What do you want from me?”\\n\\n “I can tell you what I don’t want from you. I don’t want to neck with you in your pickup at the local make-out spot and get all hot and bothered. I don’t want to watch you racing around half-naked on a basketball court and get all hot and bothered. I don’t want to sit on your lap after your dart game and get all hot and bothered. I want more because we’re not high school kids anymore, Tell. There’s no reason for us to be worried we’re taking it too far, too fast. My biggest worry is you see me as that purity-ring-wearing virgin and you won’t take it far enough.”\\n\\n Silence.\\n\\n Unable to come up with a clever response, he just said, “I think it’s best if I take you home.”\\n\\n “That’s it? We’re not talking about this?”\\n\\n “You’ve got my tongue so tied up in knots that I’ll just say the wrong damn thing.” He sighed. “Look, it’s obvious I’m an idiot when it comes to this stuff, all right? Can we just go?”\\n\\n After he helped her into his rig, she said, “Such a gentleman.”\\n\\n “That’s who I am, Georgia. And for some reason, you bring out those gentlemanly qualities far more frequently than any woman I’ve met.”\\n\\n She touched his face and he felt as if he’d been zapped by a cattle prod. “Know what’s funny?”\\n\\n “What?”\\n\\n “Your gentlemanly side brings out my inner whore.”\\n\\n Tell laughed softly, appreciating her attempt to lighten the mood. “That right?”\\n\\n “Yes. So no wonder we’re at cross-purposes.”\\n\\n The ride back to her place was mighty quiet, not that he’d expected Georgia to blather on. So her next question surprised him.\\n\\n “Do you remember when you took me home that one time senior year?”\\n\\n Like he could ever forget. Seeing her crying outside the gym, looking so lost and alone. He’d acted on instinct, trying to soothe her, trying to get her to talk to him. It’d shocked him that she had talked about bad choices and no choices. Then she’d asked him for a ride home and climbed in his dirty, piece-of-shit pickup. She’d left the window open and literally let her hair down, allowing all that black silk to flutter in the breeze. Georgia had been so preoccupied that she hadn’t noticed him staring at her. She hadn’t noticed that he’d almost wrecked his damn truck because he’d been staring at her.\\n\\n “Do you know what I wanted more than anything that afternoon? To ask you to keep driving. To drive until we were a long way from Sundance.”\\n\\n “I would’ve said yes. I would’ve taken you anywhere you wanted to go.” He’d ended up on the receiving end of Deck’s fists for that anyway. Getting to spend more time with Georgia would’ve made those bruises a little less painful to bear.\\n\\n Tell pulled up in front of her house. She hadn’t left the light on, so he walked her to the front door.\\n\\n She faced him. “Tell, I—”\\n\\n “I don’t expect you to lie and say you had a great time tonight.”\\n\\n “I didn’t intend to. I want to know where we go from here.”\\n\\n “Are you asking me if I still plan on taking you to the reunion?”\\n\\n “No. I’m asking you if you plan to take me to bed anytime soon.”\\n\\n “Define soon.”\\n\\n “Like right now.”\\n\\n Chapter Nine\\n\\n Georgia watched the muscle in his jaw flex and his eyes darken.\\n\\n His voice was dangerously low when he finally spoke. “Tell me what you want in that explicit detail you’re so fond of.”\\n\\n Don’t chicken out now.\\n\\n She inhaled a deep, slow breath. “Don’t get me wrong, Tell; I’ve liked spending time with you. But I’d really like to know what sound you make when my hand is on your cock. What sound you make when your cock is in my mouth. I want to feel your body on top of mine as you’re fucking me. I want to feel your body behind mine when you’re fucking me. I want to look down and see your face between my thighs. I want to see who Tell is when he stops showing me his fun, flirty, gentlemanly side and starts showing me the intensity I saw that first night you kissed me at the Golden Boot.”\\n\\n He stalked her until her back hit the door. “Think you can handle me when my fun, flirty, gentlemanly side is completely overtaken by a whole different side you haven’t seen?”\\n\\n She raised her chin a notch. “Why don’t try you me?”\\n\\n Then Tell’s hand snaked out and curled around the back of her neck, pulling her so close their noses almost touched. “That’s what you want, Georgia? Hard, fast, hot sex without the niceties?”\\n\\n If his blazing eyes were any indication, she’d awakened the sexual beast inside him.\\n\\n Finally.\\n\\n Her gaze gravitated to his sculpted lips. She wasn’t scared of his no niceties warning, and she said, “Yes.”\\n\\n He smashed his mouth to hers without warning, consuming her in a kiss so blistering hot it nearly melted her brain and started her hair on fire. His hands tightened in her hair, holding her head in place.\\n\\n The kiss went on and on. A ravenous display of heat, raw power and sexual greed.\\n\\n Georgia had never wanted like this. She’d never been wanted like this.\\n\\n His mouth remained fused to hers as his fingers began to undo the buttons on her blouse. Once her shirt hung open, he stroked her damp flesh with rough-skinned fingertips, from the waistband of her skirt, up her belly, between her breasts.\\n\\n He ripped his mouth free from hers. “No more public displays. Let’s finish this inside.”\\n\\n Man. Tell had scrambled her brain so completely she’d forgotten they were in front of her house. She tried to pull her blouse closed, but his hands stayed the movement.\\n\\n “Once the buttons are undone, they’re undone. No goin’ back. We do this my way.”\\n\\n Nodding, she fumbled with the keys to unlock the door.\\n\\n Tell kissed her as he pushed her through the door and locked it. He kissed her as he pressed her back to the wall. He kissed her as he unhooked her bra and played with her nipples.\\n\\n Her hands raced over him, eager to touch him everywhere at once. Bulging biceps, broad shoulders, thick column of his neck—God, too many delicious body parts to choose from. Her fingers tangled in his hair, pulling slightly when his teeth grazed her nipple.\\n\\n He made a growling noise and said, “Don’t. Move.”\\n\\n That terse command made her tremble with anticipation.\\n\\n His mouth reconnected with hers as he slipped his hand beneath her skirt, stroking her over her panties.\\n\\n She gasped when he pushed his finger inside her. He thrust in and out before adding another thick finger, which easily slid into her channel because she was so wet. When he rubbed his thumb back and forth across her clit, she whimpered.\\n\\n His mouth was on her ear. “Come on my hand.”\\n\\n “Tell—”\\n\\n “You want my cock in you? Fucking you like this?” He thrust his fingers in deep.\\n\\n It felt so damn good she moaned, “Yes.”\\n\\n “Then come on my hand.”\\n\\n Georgia didn’t have to tell him she needed him to stroke her clit faster. She didn’t have to tell him to rub the tips of his fingers over the ridge of flesh on the inside wall of her pussy. Tell did that automatically. Perfectly.\\n\\n “I wanna hear you the first time I get you off.”\\n\\n She was so close. And Tell’s harsh panting in her ear really did it for her. Normally she had some warning before an orgasm unfurled, but not this time. This time everything happened in a rush. Her clit pulsed. Her pussy muscles spasmed around his fingers. She dug her nails into Tell’s forearm, just in case he decided to pull away too soon. \\n\\n","sourceLink":"https://allnovel.net/kissin-tell-rough-riders-13/page-17.html","bookId":2694,"book":{"id":2694,"title":"Kissin\u0027 Tell (Rough Riders #13)","description":"Storyline: Kissin\u0027 Tell (Rough Riders #13) \\n She once led him around by a string. Now he\u0027s the one holding the reins. \\n Georgia Hotchkiss swore wild horses couldn\u0027t drag her back to Sundance, Wyoming. So it\u0027s ironic she\u0027s forced to take a rodeo PR job in her former hometown right before her ten-year class reunion. The only thing worse than facing her cheating ex-husband and his pregnant wife? Showing up to the reunion without a date. Fate smiles on her when she runs into her former classmate and current cowboy hottie Tell McKay. With his infectious smile and fun-loving ways not to mention his banging body he\u0027s the perfect solution to her problem. \\n Tell McKay had it so bad for Hot Lips Hotchkiss during high school that he let her run roughshod over him. But he is no longer that easily manipulated boy these days he\u0027s earned a reputation with the ladies that lives up to the McKay last name. He agrees to escort her to the reunion with one stipulation; that Georgia proves she has left behind the goody-goody cheerleader of the past by sharing his bed. \\n Their sexual chemistry flashes so bright, they barely notice that the reunion has come and gone, and now they\u0027re tangled up in another dreaded R word \"relationship.\" But if Tell wants to get the girl this go-around, he\u0027ll have to come up with a whole new set of knots to tie up her heartstrings. \\n Warning: Contains a sweet talkin wild cowboy with a wagon load of crazy-hot sex fantasies and the mad bedroom skills to back up his claims.\\n","cover":"https://allnovel.net/images/kissin-tell-rough-riders-13.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/kissin-tell-rough-riders-13.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:20:01 AM"}}
