{"id":88874,"no":35,"title":"Page 35","content":"\"I know, Master.\"\\n\\n \"Then why are you acting like a petulant child? Maybe you want to be tucked in like a little girl, too? I think it\u0027s way past your bedtime anyway.\"\\n\\n Heat surges into her cheeks at my condescending tone, this kind of humiliation obviously not her thing.\\n\\n \"I\u0027m sorry, Master. It wasn\u0027t my intent to act like that.\"\\n\\n I\u0027m mollified by the raspy quality of her voice, speaking plainly of how much she wants to grit her teeth and curse at me but doesn\u0027t, and slide my fingers back into her, but even before I feel her relax again something else occurs to me. Grabbing her hair with my free hand I wrench her head back so that I can easily growl into her ear, and the suddenly triumphant look on her face just underlines my suspicion.\\n\\n \"You think you deserve some kind of mercy or leniency from me because you\u0027re hurting right now?\"\\n\\n She doesn\u0027t reply, just sinks her teeth into her full bottom lip, but that\u0027s enough of a response for me.\\n\\n \"You manipulative little piece of shit.\"\\n\\n Definitely not the reaction from me she has been hoping for, and I can feel her whole body go rigid with indignation. Even though turning her head must hurt her scalp from the way I\u0027m holding her, she tries to look at me directly, her gaze heavy with need and trepidation alike. We keep up the staring duel for at least ten seconds, then her lids threaten to flutter closed when I resume fucking her with my fingers. I have to admit, the fact that she doesn\u0027t just roll over and plays meek is a turn-on for me, but at the same time I\u0027m starting to resent that double-edged game she thinks she can play with me. I know it\u0027s a very fine line between playful defiance and ungrateful mutiny, but she can\u0027t really learn to hit the right spot without me drawing the lines, right?\\n\\n \"Look at me. I haven\u0027t allowed you to close your eyes.\"\\n\\n Immediately her lids open again and she glares back at me, but from the way her throat constricts convulsively I know she\u0027s trying hard to get a firmer hold on her temper. And as I keep thrusting my fingers into her, her will slowly wins over her temper, her glare soon toning down to a pleading look that is only moderately laced with resentment. Not much of an improvement, but still progress.\\n\\n Placated yet not satisfied, I finally let go of her completely and take a step back, and notice with new amusement how she rolls her shoulders in discontent at the loss of contact between us. Part of me is tempted to just leave her like that and take care of my hard-on myself - or fuck her throat -\\n\\n but while I love indulging my cruel streak, I think she has finally started to learn the lesson, and a little bit of positive incentive might help a lot more than pushing her to her breaking point.\\n\\n I still don\u0027t hurry as I put on a condom and slather my cock with lube, stroking my shaft until I\u0027m fully hard. Bella keeps watching me, her brows knitted as if she\u0027s afraid I will just keep her like this another day, but when I step back up to her and push the head of my dick into her ass without further ado the frown is quickly replaced by a look of bliss. Picking up a leisurely pace I push into her a little more with each thrust, always withdrawing until I\u0027m on the brink of sliding out of her, ending up with slow, deep thrusts that make her whole body rock. Wound up as she is I feel her bear down on my cock very soon, but I keep up the slow rhythm, one hand around her hip, the other on her raised thigh, as much to steady her as hold her in place.\\n\\n \"Do you think I should let you come today?\"\\n\\n I can feel her clench harder around me as she contemplates the idea, but instead of the onslaught of pleas I\u0027ve expected, she holds her tongue. I\u0027m about to bark at her for not answering me when she drops her head, the motion bowing her back enough that for a moment it is pressed flush against my chest. I halt, buried balls deep inside of her, when I hear her voice low and husky as she\u0027s talking more to herself than to me.\\n\\n \"I really don\u0027t want to be so defiant, I don\u0027t want to feel like I\u0027m fighting you every step of the way, but I can\u0027t help it! I am a spoiled little brat, so used to getting what I need in abundance that suddenly deprived of all that I can\u0027t not feel partly rejected and treated unfairly.\"\\n\\n I wonder for a moment if she wants me to stop entirely, or at least step out of playing as she hasn\u0027t used any form of appellation, but when she goes on it\u0027s obvious that neither is the case.\\n\\n \"Master, I\u0027m sorry that I can\u0027t be your meek little slut. Well, at least not the meek part.\" She laughs, a breathless, cut-off sound, and finally she raises her head again, pushing it against my shoulder so that her face is next to mine as she catches and holds my gaze over the mirror. \"I\u0027ve tried, so hard, but I just can\u0027t! If that\u0027s what you want, I\u0027m sorry, but I\u0027m failing by such a long shot, it\u0027s ridiculous. So if you\u0027ll only let me come if I overcome that will to rebel, you can stop right there because I know I\u0027ll never really get there. I can play meek and docile, but I\u0027m not, and I won\u0027t lie to you, Master.\"\\n\\n By the end of that her voice is low and shaking, and it\u0027s obvious that it\u0027s costing her a lot to admit defeat. Yet there is no hint of dejection in her tone\\n\\n - it\u0027s not defiance that\u0027s making her say this, but honesty. And with honesty I can always deal.\\n\\n She is surprised when I turn my head and kiss her cheek softly, but she relaxes when she feels my lips skim over her ear.\\n\\n \"I\u0027m not asking you to be all docile and meek if you don\u0027t feel comfortable with that,\" I tell her, letting my nose continue to caress her jaw. \"Any form of your submission is a wonderful gift to me.\" That paints a smile onto her face, a smile that is still on her lips when I reach up and wrench her head back until she gasps. \"But if you don\u0027t give me what I\u0027m asking from you, I\u0027ll just have to take it, right?\"\\n\\n I don\u0027t wait for my words to sink in but start fucking her with fast, deep thrusts right away that push her hard against the counter, Bella nearly losing her balance except that she can\u0027t slip away with my body pinning her in place. My fingers still twisted in her hair I push her head to the side so that I can scrape my teeth along the side of her neck, then bite into the soft flesh there hard enough for her to cry out - and leave a hint of a mark.\\n\\n Her whole body is tensed up by the time I look at her face again, but her eyes, half closed now, are dark and full of lust, showing me what I want much more than the act of subservience she has been talking about - her true enjoyment of being made to submit to me.\\n\\n That as much as the wonderful sensation of her clenching so hard around my cock makes me come, and I finish with a few last, rough pumps into her. Her whole body is shaking when I sag down on her, forcing her to take part of my weight as well, adding a different kind of physical strain to the one she\u0027s been under for nearly two weeks now. She grunt in turn, the sound turning desperate when she feels my spent cock slip out of her when I pull her raised leg down, and for a minute or so I enjoy watching her war with the knowledge that yes, she will go unsatisfied for yet another day. No longer hiding her struggle I see the emotions run over her face, not for the first time feeling that sense of power that I have over her - and loving every second of it.\\n\\n She grunts again and tries to turn her head away when I kiss her softly, a silent gesture that so many guys use to apologize to their girlfriends when they, once again, didn\u0027t get their needy women off, but she knows that I\u0027m just gloating at her this way, and that doesn\u0027t sit well. But I persist, and eventually she turns her head enough so that I can press my lips against hers, and after a little prodding she lets my tongue in.\\n\\n This way her cry is muffled when she feels three of my fingers push back into her abused ass, but I feel her melt into me a second later. Smirking at her for a moment as I pull my head back I see her smile at me with gratitude, but that is drowned by another yelp when I push her upper body down onto the cold, hard stone of the counter top, forcing her to lose her balance. I hold her securely enough so that it doesn\u0027t matter that she can\u0027t reach the stool anymore, and after a moment of flailing her legs she goes still, thankfully not kicking my shin or knee.\\n\\n \"You like that, don\u0027t you?\" I hiss into her ear, then stop with my fingers deep inside of her to let her calm down enough so she can answer.\\n\\n \"Yes, Master!\"\\n\\n I laugh at her, trying to sound derisive but can\u0027t quite pull it off, and hear her chuckle between two pants. In retaliation I pull my fingers out of her and spank her hard a few times, hard enough to make my palm burn, but her shrieks are definitely worth it. Then I\u0027m back to making her come on my fingers while I lean over over her, my nose only inches away from her face.\\n\\n \"I want you to hold out as long as you can. We both know that you\u0027re so close, and that you can\u0027t win this if I forbid you to come. But because you\u0027ve been such a good little whore these past weeks I won\u0027t be that mean this time. Although if I feel like you\u0027re not trying hard enough not to come, I won\u0027t be so lenient next time.\"\\n\\n Unable to really formulate a response she nods her head frantically, and her whole body seizes up when she tries to fight her impending orgasm.\\n\\n Without a watch it\u0027s hard to tell how long it takes her to lose the fight against herself but it\u0027s longer than I\u0027ve expected, making it obvious that I\u0027m still going too soft on her. When she finally comes it\u0027s with a loud, drawn-out shout, her whole body bucking underneath me. While impressive in its force, I assume that one climax is not everything I can get out of her, and when I just keep on she reaches a second one a minute later. Only when she sags down in herself completely do I stop, leaving her as a shivering, spent mess, half slid down from the counter.\\n\\n She\u0027s still breathing hard when the sound of a door falling loudly into a lock downstairs startles us both, and the deer caught in the headlights look on her face makes me laugh.\\n\\n \"Fuck! Do you think Jazz, ah, heard any of that?\"\\n\\n I have no doubt that that is the case if he got here minutes ago already and just slammed the door now to let us know, but I don\u0027t state the obvious. I don\u0027t even mind him hearing us, as it\u0027s just a way for me to mark my territory, although I don\u0027t think it needs to be marked. My home, my girlfriend I can bang in the bathroom, after all. And because I\u0027m still not quite down from my high I don\u0027t even hide that knowledge from Bella.\\n\\n \"Why, want me to ask him right now?\"\\n\\n \"Don\u0027t be such an ass!\" she grunts in return, then tries to shove me off her, but to no avail. I still enjoy letting her struggle for a while before I pull away.\\n\\n Bella sneers at me before she stalks over to the shower, slamming the door in my face to keep me out. Grinning at her through the hazed over glass I turn around and go back to the sink to clean myself up there instead. Bella is still fussing around in the shower when I\u0027m done treating my tattoo, although from the sound of it she\u0027s no longer under the spray but just keeping the water running until I\u0027m done. Not really intent on angering her for real I finally retreat to the bedroom, although I leave the door ajar so that I can watch her strutting around from the bed.\\n\\n When she finally joins me she seems mollified again, although she still tenses up as if to shove me away when I curl myself around her, spooning her body with my own. In a silent peace offering I kiss her neck where I\u0027ve bitten her, noting that my teeth have barely left a bruise worth being called a hickey. For a moment I\u0027m tempted to suck on her skin until she has one for real but then refrain from acting that childishly. As much as she seems to appreciate certain souvenirs from our play time, \u0027normal\u0027 marks don\u0027t seem to count.\\n\\n A few minutes into my musing, Bella derails my train of thought when she clears her throat.\\n\\n \"Are you going to punish me for that bit at the end?\"\\n\\n \"You calling me an ass?\" I ask, already laughing against her shoulder.\\n\\n She sighs as if my mirth is answer enough, but then nods. \"Yes, that.\"\\n\\n \"Do you think I should?\"\\n\\n The fact that she gives the question some thought makes it easy for me to decide not to go for it, as I feel like we have stopped playing the moment it got apparent that we\u0027re not alone anymore, but I like that she doesn\u0027t just jump to conclusions.\\n\\n \"Not really. But I won\u0027t protest if you think otherwise.\"\\n\\n \"Good.\"\\n\\n \"Good?\" she hedges, then turns around enough so she can steal a glimpse at my face. \"Good as in we\u0027re good and you will let the matter slide, or good as in it\u0027s good I won\u0027t make a fuss if you tan my hide?\"\\n\\n I let a lopsided grin be my answer for a few seconds, but then lean in to kiss her languidly.\\n\\n \"Good as in I\u0027m too tired to do anything now, and tomorrow morning I would probably feel stupid about still insisting on it.\"\\n\\n That makes her laugh and snuggle back into my embrace, although she still makes sure that her shoulder blade isn\u0027t pressed into my chest.\\n\\n \"Does my little admission mean that you won\u0027t go on with pushing my mental boundaries now?\"\\n\\n I shake my head.\\n\\n \"No, unless you want me to?\"\\n\\n \"Not particularly, no. But will that still work? I mean, me not being all meek and selfless and all that shit.\"\\n\\n As usual, her blunt words amuse me to no end.\\n\\n \"There are so many ways to play this game, I don\u0027t think that will be a problem. And I can still keep you hanging dry for weeks at a time whether you grovel for my appreciation or curse me to my face. In face, the latter makes it so much easier for me.\"\\n\\n The way she stays pointedly quiet makes it obvious that she\u0027s only now realizing just how much she\u0027s been playing into my hands with being honest - but when she finally answers with a sigh I know she doesn\u0027t necessarily consider that as a bad thing. Neither do I.\\n\\n \"So what, you\u0027ll now tease me into losing my calm, then you punish me for being a brat and don\u0027t let me come because I haven\u0027t been a good girl?\"\\n\\n \"Pretty much, yes.\"\\n\\n \"I can only repeat myself, you\u0027re such an ass!\"\\n\\n \"I know,\" I chuckle, then rub my crotch over her ass until she\u0027s giggling and I feel my cock start to get hard again.\\n\\n \"There\u0027s no real way I can win this, right?\"\\n\\n \"There\u0027s never a way to win for the sub of the Dom doesn\u0027t let her. You know that.\"\\n\\n Bella nods, then quiets down in a way that\u0027s nearly alarming.\\n\\n \"Something wrong?\"\\n\\n \"No, it\u0027s just -\" she sighs, then shakes her head. \"Nothing. I\u0027ll just have to wait and see.\"\\n\\n \"See what?\"\\n\\n \"How I can handle disappointing you like that.\"\\n\\n My mind grinds to a momentary halt, and it takes me a few seconds to come to the same conclusions as she must have. It has been quite a while since I\u0027ve been on the other side of an arrangement like ours, and I think the fact that things have been going so well between us has let me become complacent about catching any possible pot holes in the road ahead.\\n\\n Nudging her softly at first, I wait for her to look at me again, and when she doesn\u0027t I roll her over so that she\u0027s facing me. Her eyes are fixed on my chest rather than my face, and I nudge her chin up gently until she\u0027s really looking at me.\\n\\n \"Bella, you\u0027re not disappointing me. This game is set up for you to lose, not win, being unable to best me doesn\u0027t mean you\u0027re disappointing me.\"\\n\\n I want to add that as long as she doesn\u0027t deliberately fuck up she won\u0027t be able to disappoint me ever, but I know that I won\u0027t help her by admitting that. I still remember the psychological woes of being an overachieving type of submissive, your own worst enemy.\\n\\n \"But it feels like that, you know? Maybe I\u0027ve gotten too used to trying to get everything right, but -\"\\n\\n I silence her with another soft kiss, this one lingering as she doesn\u0027t seem too intent on continuing to speak. When we finally part she looks a lot less dejected, but doubt is still lurking in her eyes.\\n\\n \"How else should I handle things if not like this?\" I try a different approach.\\n\\n \"Either you excel at bowing yourself to my will, you enjoy submitting to me body and mind and find satisfaction in being selfless. Or you don\u0027t, you like every step to be a challenge, a battle of wills where eventually I force you to give in and yield. If you know a third way, please tell me, but you giving in grudgingly doesn\u0027t leave me with the feeling that you\u0027ve failed me, but instead that I\u0027ve pushed you into giving something to me that you don\u0027t fling away easily. Just two sides of the same coin.\"\\n\\n Although she obviously agrees with me she still mulls things over until she shakes her head.\\n\\n \"Can\u0027t think of any option C here. But I really don\u0027t see us playing in that meek and gentle way. I just love you acting like a mean, domineering bastard too much. And you can never go wrong with hair pulling, down holding, rough sex!\"\\n\\n \"Yeah, for some reason whenever I do that your protest isn\u0027t really all that convincing.\"\\n\\n She laughs at my dry remark, her previously glum mood lifted.\\n\\n \"So, how do we handle it if Jazz really heard us?\"\\n\\n \"We just ignore it and pretend it didn\u0027t happen? I don\u0027t really think he\u0027ll be gloating at us; at least from the way he\u0027s been avoiding us today I\u0027d say he\u0027s trying hard not to appear as a nuisance.\"\\n\\n \"True. Let\u0027s just hope that our attempt at don\u0027t ask, don\u0027t tell works better than it does for the Army. And it\u0027s not as if he doesn\u0027t know how we sound when we fuck.\"\\n\\n That doesn\u0027t deserve an answer and I kiss her good-night without commenting on her abashed look, either, before I close my eyes. Not much I could say to that, as quite frankly, yes, he knows.\\n\\n Chapter 24\\n\\n As usual, I wake up before Bella. A look at the alarm clock at the nightstand tells me that it\u0027s early even for me, only 5:30, but try as I might, I can\u0027t go back to sleep. My whole arm itches, and the only thing I can think of that might distract me from that is waking Bella to pick up where we\u0027ve left off the night before. But I know that she will not really appreciate that - of all the people in the world I have to be madly in love with the worst morning person there is. And as going down on her to pacify her is off limits right now, I decide to let her sleep and jerk off in the bathroom instead.\\n\\n But of course the tatt is itching just as much when I\u0027m done cleaning my hands and cock afterwards, and slathering the skin with lotion only helps so much. Restless and frustrated I slink back into the bedroom and don my running clothes. It\u0027s still dark outside and the heavy November mist is less than inviting, but I have to burn off energy somehow. The sleepy grunt I get in return when I kiss Bella\u0027s shoulder underlines the wisdom of my choice.\\n\\n Until I come face to face with Jazz downstairs I\u0027ve nearly forgotten about him staying over. Or not quite forgotten, more like having been very successful in ignoring that fact. Before I can stop myself I feel my shoulders tense up in expectation of some jibe or other - while he has probably never said anything to Bella when she stayed over at our house, I\u0027ve gotten my fair share of snarky remarks from him, and dealt out at least twice as many myself - but he only mumbles a tired \"Good morning,\" around a spoonful of yogurt. At least now the mystery is solved why he hasn\u0027t eaten breakfast with us the day before, if his behavior today is any indication. \\n\\n","sourceLink":"https://allnovel.net/beautiful-disaster-beautiful-1/page-35.html","bookId":2786,"book":{"id":2786,"title":"Beautiful Disaster (Beautiful #1)","description":"Storyline: Beautiful Disaster (Beautiful #1) \\n INTENSE. DANGEROUS. ADDICTIVE. \\n Abby Abernathy is a good girl. She doesn’t drink or swear, and she has the appropriate number of cardigans in her wardrobe. Abby believes she has enough distance from the darkness of her past, but when she arrives at college with her best friend, her path to a new beginning is quickly challenged by Eastern University’s Walking One-Night Stand. \\n Travis Maddox, lean, cut, and covered in tattoos, is exactly what Abby wants—and needs—to avoid. He spends his nights winning money in a floating fight ring, and his days as the ultimate college campus charmer. Intrigued by Abby’s resistance to his appeal, Travis tricks her into his daily life with a simple bet. If he loses, he must remain abstinent for a month. If Abby loses, she must live in Travis’s apartment for the same amount of time. Either way, Travis has no idea that he has met his match.\\n","cover":"https://allnovel.net/images/beautiful-disaster-beautiful-1.jpg","author":"Jamie McGuire","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/beautiful-disaster-beautiful-1.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:30:15 PM"}}
