{"id":88885,"no":46,"title":"Page 46","content":"\"Yeah, keep squirming like that, you\u0027re getting my cock all hard that way.\"\\n\\n Bella grows still for a moment, then seems to give up, relaxing against me.\\n\\n She stops trying to pry my hand off her face and instead lets her arms drop to her sides almost docilely. Chuckling softly I push my hips into her ass, feeling my cock react to the stimulation, which in turn also draws a low moan from Jazz as the motion propagates well through Bella\u0027s body.\\n\\n \"You\u0027re such a little tease,\" I pick up from him, never stopping sliding my cock against her. \"I think we need to teach you a lesson.\"\\n\\n Bella squeals into my hand when Jazz unceremoniously yanks down her pants and underwear in one go, then shoves up her shirt and bra, leaving most of her body exposed. As I have to shift my grip around her middle anyway to let him do that I switch hands, leaving her just enough time to cry out before my other palm is cutting off the sound for the most part again. Her will to fight renewed Bella keeps pushing at us, but to no avail.\\n\\n She also doesn\u0027t stop when I stroke my free hand down her stomach, then cup her pussy, in one motion both rubbing against her clit and Jazz\u0027s cock.\\n\\n I keep doing that for a while, relishing making them both moan. Jazz in the meanwhile is busy playing with Bella\u0027s tits, only causing her to squirm even more.\\n\\n With my dick all hard against her ass I soon can\u0027t keep this up anymore, and Bella doesn\u0027t even pick up cursing us again when I let go of her face.\\n\\n Letting go of her altogether I pull my own pants down, then push her far enough away from me so that I can move. Grabbing her thighs just above the knee from behind I heave her off the floor, forcing her legs apart in the same motion that makes her sag back against my shoulder. The scream that leaves her lips is most satisfying.\\n\\n Bella thankfully has the sense to stop moving after her bare heel hits Jazz in the arm, and I sag back against the fridge, letting the hard surface help me support her like that. Jazz, ever helpful, steps in and helps me steady her, sliding her legs around until I have them hooked over my arms.\\n\\n \"What now?\" he turns to me, grinning mischievously.\\n\\n \"Now you grab the lube from the coffee table, slick up my cock, and then you help me get it into her squirming little ass. I don\u0027t think I have to tell you what to do with your own after that.\"\\n\\n He chuckles as he\u0027s already letting go of Bella to fetch the bottle still left out from the evening before. Bella turns her head so that her face is pressed against my throat, and I have to laugh again when I feel her teeth scraping over my skin.\\n\\n She\u0027s not too heavy but I\u0027m still glad when Jazz returns, having somehow lost his own clothes on the way. Squirting a liberal amount of lube into his right hand he steps closer to us again, and he smirks a little at my moan when his fingers close around my cock.\\n\\n He\u0027s quick and efficient as he strokes me a few times, then adds still more lube and keeps going, while his eyes keep flitting between Bella\u0027s face and my own. I just love the sensation, both from the anticipation and the fact that he clearly knows more about how to pump a cock than suck it, but I can\u0027t really protest when he lets go of me in the end to add yet more lube to Bella\u0027s anus.\\n\\n When he\u0027s satisfied with the prep work he grabs my cock again, and after a little squeezing guides it to where it belongs. I feel Bella tense a little when I enter her, but she pushes herself down fast enough to show us both that I\u0027m not the only eager one here.\\n\\n As time is somewhat of the essence with my strength not lasting forever Jazz doesn\u0027t dawdle, and a few moments later I feel his cock slide into her pussy. I groan both from that and the lessening of strain when he slips his arms in next to mine to take some of her weight off me, the shift caused by that feeling even more delicious.\\n\\n Neither of us needs a signal as we both start thrusting into her.\\n\\n Coordinating our movements takes a little longer than usual but finally we find the right rhythm, me going in just as he withdraws, which works best for us as it keeps her body mostly level. Bella\u0027s urgent pants and huffs speak about the same language, and once she seems certain that we\u0027re done re-arranging her between us, she reaches out with her arms and pulls both mine and Jazz\u0027s head closer to hers.\\n\\n Eagerly latching on to her neck I tighten my grip on her even more, then slowly withdraw first one hand, then the other, to instead hold her firmly around her waist with my crossed arms over her stomach. As much as that might limit how much I can move, supporting her is more important now, and the strain of the position makes her tighter than usually anyway. Plus, Jazz is doing a good enough job fucking her hard enough for the both of us, the sensation of his cock rubbing against my own making me forget the pain that is starting in my arms, back and legs.\\n\\n Bella screams every time he slams into her, her shouts soon rising in pitch and growing hoarse with need, spurring us both on more. Soon it all gets too much for Jazz and he comes with a loud cry, briefly sagging against Bella and forcing me to stop. She hasn\u0027t regained her senses enough to utter a coherent word yet when he withdraws his cock and pushes his fingers into her instead, using his shoulder against her torso to keep her steady.\\n\\n \"Holy! Fucking! Shit! Please let me! Argh!\" Bella cries out, each of her words accentuating Jazz\u0027s motions, and I\u0027m a step away from climaxing myself when I bark a simple \"Yes!\" at her.\\n\\n Coming together has seldom been such a rush.\\n\\n Even after I put her back onto her own now shaky feet, Bella remains wedged between Jazz and me, happy to kiss every available mouth hungrily seeking hers, and I love coming down together like that, it\u0027s nearly as good as fucking her has been before.\\n\\n That is, until the phone starts ringing, cutting right through our collective post-orgasmic haze.\\n\\n It\u0027s not my cell so I\u0027m instantly relieved that I\u0027m not getting dragged to work right away, but there are not that many people who still call our landline. I\u0027m also very indisposed of the idea of getting the call now, as are the others, not even Bella tries to squirm her way out of our now loose grasp.\\n\\n Whoever is calling is insistent, and after the tenth ring, our answering machine picks up. I can\u0027t say I\u0027m not a little bit weirded out by hearing my mother\u0027s voice just then.\\n\\n \"Bella, Edward, since you\u0027re not picking up the phone I presume you\u0027re either still sleeping, or otherwise occupied upstairs.\" She pauses then pointedly, but resumes in the same neutral tone. \"I\u0027m calling to inform you that I expect you to invite Jasper to the dinner today, if you\u0027ve somehow forgotten to do so already.\" That stressed now. \"I know that the three of you have been going through some rough patches, but he\u0027s still your friend, and I\u0027m obliging you to ask him. Rose and Emmett will be joining us, and Alice will be coming, too, so if he doesn\u0027t want to because of that, I understand, but I would still love to have him with us. I know his family lives several states away and I don\u0027t want him to spend today somewhere alone. And Edward? Don\u0027t steal all the cranberries, you know how much everyone loves Bella\u0027s relish.\"\\n\\n She hangs up then and the answering machine shuts off with a beep, just as Jazz starts to laugh. Bella joins in a moment later, as do I, after a shouted \"That wasn\u0027t me!\" in the general direction of the living room.\\n\\n Our sweaty sandwich disassembles then as we move away from each other to shower and dress again, although Bella only joins us after finishing her cooking alone first. I don\u0027t feel like it\u0027s necessary to extend the invitation to Jazz as he has heard it himself, but he doesn\u0027t comment on it until a few hours later when Bella disappears upstairs to get dressed for dinner.\\n\\n \"Do you think it\u0027s a good idea if I come with you?\"\\n\\n I\u0027m so tempted to tell him that it\u0027s always a good idea if he comes with me, but now\u0027s not the time for jokes like that, and it\u0027s obvious how uncomfortable he is already. Purging my brain of lewd comments I shrug, trying to be honest.\\n\\n \"You have to decide yourself. She\u0027s there, and there\u0027s no way you\u0027re going to avoid her, but I\u0027m sure that my mom will do her best not to let conversations die. If nothing else, she\u0027ll tell her stupid anecdotes of when I was a child, and you always laughed at them in the past.\"\\n\\n \"Yeah, you smearing cranberry sauce all over the new beige carpet when you were five is just too good not to laugh at it. Besides, she\u0027ll probably be occupied cooing over the kid anyway.\" He doesn\u0027t sound too convincing then, and when he looks up at me, there\u0027s a different kind of uncertainty on his face. \"But what I also meant was showing up with you and Bella at the same time. The three of us together, and not gloating or fighting. It kind of does send a message, and no one can accuse either of us of being very subtle and able to hide anything.\"\\n\\n \"Do we have anything to hide?\"\\n\\n I wish I didn\u0027t feel a pang of hurt inside as I say that but at least my voice is steady and as inconspicuous as it gets, and Jazz doesn\u0027t seem to pick up on it. Instead he\u0027s scratching his head, looking a little uncomfortable.\\n\\n \"Maybe we just don\u0027t have anything to advertise?\"\\n\\n Of course he\u0027s right, but that doesn\u0027t change things.\\n\\n \"I think everyone except my parents knows that you\u0027re crashing on our couch, so it won\u0027t be that much of a surprise if we show up together. And you heard my mom, she\u0027ll probably tell everyone that she ordered Bella and me to drag you along, so I think we should be safe.\"\\n\\n He\u0027s still not looking convinced, but then Bella calls for us to get dressed, which concludes out brief discussion. I\u0027m still lost in thoughts when I\u0027m done shrugging into my clothes, but Bella\u0027s unnatural behavior finally draws my attention. She\u0027s still only in her black bra and panties, rifling through her stuff, haphazardly pulling things off a hanger and shoving them back after a moment\u0027s study. Just when I want to ask what\u0027s going on she pulls out a sleeveless black dress and turns to me, her brows furrowed.\\n\\n \"Would this make me look like a slut?\"\\n\\n Again I have to swallow the impulse to say the first thing that comes to my mind – which in this case is a tie between me informing her that I\u0027d love to bend her over and fuck her when she\u0027s wearing only that dress and stay-ups, and telling her that I don\u0027t mind as long as she\u0027s my slut – and immediately shake my head.\\n\\n \"No, of course not, it\u0027s very elegant and classy. But you\u0027d be hopelessly overdressed.\"\\n\\n I pointedly look down at my own gray shirt and dark blue jeans.\\n\\n \"I know!\" she sighs, then goes back to finding something else. Jazz joins us a few minutes later, cautiously sticking his head into the bedroom to see why we\u0027re taking so long. He still doesn\u0027t know, and I wonder if he\u0027s disappointed not to have again walked in on us getting it on.\\n\\n \"Outfit troubles,\" I inform him, and he looks as puzzled as I feel.\\n\\n \"What\u0027s the fuss? It\u0027s just Thanksgiving dinner, I don\u0027t remember anyone ever dressing up for that.\"\\n\\n I shrug, neglecting to mention that last year Bella wore a similar dress to the one that she just showed me, only in pale blue, and I would have loved to fuck her right on the dinner table in it. Sadly she had still been with Mike then, and the only thing blue I had come in contact with had been my balls.\\n\\n Turning to us both now Bella holds up a sweater and cardigan combo that causes Jazz to snort derisively.\\n\\n \"How old are you, eighty?\"\\n\\n She sighs heavily, then keeps on searching. Jazz eyes me askance but I can only shrug, not knowing myself what this is all about. I also don\u0027t really remember anything of her wardrobe that isn\u0027t linked to my mental note of\\n\\n \"needs to be fucked in\", so I\u0027m keeping my tongue about suggestions.\\n\\n Bella eventually gives up and just slips on some dark jeans and a purple blouse, although from the way that outfit accentuates her ass and tits my sentiments haven\u0027t really changed.\\n\\n Bundled into a few more layers against the cold we finally make it to the car and into the light afternoon traffic. Jazz is banished to the backseat to watch the casserole, while Bella keeps the cranberry relish on her lap, as if to fend anyone off who might try to snag a taste. They both seem lost in their own thoughts so I busy myself with humming along to the songs on the radio in an attempt to ignore my own risinganxiety.\\n\\n I\u0027m somewhat tempted to suggest we just keep on driving and avoid the whole possibility for disaster, when at the last traffic light before we reach my parents\u0027 house a familiar vehicle comes to a stop in the lane next to us.\\n\\n Emmett grins at me from the driver\u0027s side, an unfamiliar place for him since Rose never gave up driving until she had the little bundle of joy currently sleeping in her mother\u0027s arms next to him. At her husband\u0027s antics Rose looks up, too, pursing her lips at what I guess is a frown on my face.\\n\\n The light switches to green and Emmett, for once behaving as childish as Rose so often claims that he is, hits the gas to slip into my lane before us.\\n\\n That way we arrive just after them, conveniently spilling all of us together onto the well-tended front steps.\\n\\n There\u0027s the usual greeting, hugging and back slapping, before Rose and Bella both snark at us guys to get the heavy stuff from the cars instead of gossiping. When I pass by her Rose gives me a pointed look as if to silently ask what is going on, but I ignore her, deciding to play dumb instead.\\n\\n Before I can reach the door it already opens, revealing my smiling mother.\\n\\n Never minding that we\u0027re all carrying goods and babies, respectively, she kisses Bella and Rose, then hugs me warmly before she does the same with Jazz and Emmett without even hesitating for a second. Herding us before her she directs us to the kitchen, and after that I have the pleasure of barely receiving a nod from my father. His disapproval is still palpable and he doesn\u0027t even try to hide it – and all that before he could even have found out what new, or not so knew, things I\u0027ve been up to.\\n\\n As accepting as my mother is, he has always felt like any of my actions reflect back on him badly, and being one of the youngest doctors in the history of our state doesn\u0027t do a thing to counteract the oh so obvious flaws adhering to me. His words, not mine, and for once I\u0027m surprised how little I\u0027m caring about his disapproving stare.\\n\\n As always, since the fateful night my parents got to know a lot more than they ever wanted to about their son\u0027s private life this summer, Bella takes it upon herself to run interference, first hugging Carlisle, then plastering herself to my side so that there\u0027s nothing I can do except snake one arm around her waist and let her show everyone just how comfortable she is with me. Whether that\u0027s a conscious action or not I still don\u0027t know, and neither do I care. Only that today I feel a bit of an ass as that leaves Jazz standing on his own with happy couples all around him – the effect only getting ten times worse when suddenly Alice steps out of the dining room, holding hands with an unfamiliar guy.\\n\\n Bella goes still as a statue at my side, and I allow myself a weary if silent sigh. She and Alice have never been the best of friends, and I can only guess what the things Jazz told us yesterday must have done to that fragile bond of female friendship. I myself don\u0027t blame Alice, and the addition of someone to this dinner who probably doesn\u0027t know about what went on between all of us this year actually makes me glad. It also makes me feel like a wuss, but not having this end in a disaster would make for a better day.\\n\\n There\u0027s a moment of awkward silence when every one of the newcomers is taxing Alice and her arm candy, and as this is still my home, even if I haven\u0027t lived here for years, I feel obliged to act a little more civil than I would otherwise do. Extending my hand towards him I offer him a smile.\\n\\n \"Hi, Edward, and this is Bella and Jazz.\"\\n\\n I can\u0027t tell if Alice notices just how fluently I include Jazz, but she doesn\u0027t show it, only smiles back at me after we have completed the brief handshake. He\u0027s a bit older than us, maybe in his early thirties, and not what I would expect her to go for ever. He\u0027s handsome, but more in an academic geek kind of way than the obvious good looks she usually goes for, also dressed the part in conservative dress slacks and jacket, but thankfully no tie.\\n\\n \"Nice to meet you, I\u0027m Nate,\" he introduces himself, his voice a little small with what I gather must be the usual apprehension of meeting his girlfriend\u0027s friends, including parents. His behavior towards Jazz is rather civil, surprising me a bit, and his face positively lights up when he turns to Bella. \"We\u0027ve met already, right? Yesterday, in the book store?\"\\n\\n And suddenly Bella\u0027s strange behavior makes a whole lot more sense.\\n\\n She\u0027s still tense as hell as she clears her throat, then responds with her voice oddly strained.\\n\\n \"Yeah, right, yesterday. Did you find that book you were looking for, on, what was it, the propagation of European Medieval societal hierarchy into the American colonies?\"\\n\\n I follow their exchange with a near sick kind of glee on the inside, while I hope that my pleasant smile on the outside doesn\u0027t look like a shark ready to go for his helpless prey. I seem to be doing a good job except for the long look my mother bestows on me when Bella cuts their conversation short, and with a tense, \"I need to talk to you,\" pulls me back towards the kitchen.\\n\\n We\u0027re barely out of earshot of the others when she stops and turns to me, torn between apologetic cringing and half-hostile defiance.\\n\\n \"So you met Alice\u0027s new boyfriend yesterday, huh?\" I ask succinctly as I lean closer to her, using my height to appear just a tad more intimidating than is probably called for. In turn Bella straightens and crosses her arms over her chest, the line of her jaw clearly defined as she gnashes her teeth.\\n\\n \"Yes, in fact I met Alice and Nate yesterday, just after my meeting with my editor, when I was already running late for my late lunch with Jazz. Bite me!\"\\n\\n We stare into each other\u0027s eyes for a few moments, but she\u0027s the first to look away, her cheeks coloring with a deep blush of discomfort. She starts fidgeting then, and when she makes as if to turn away from me I don\u0027t move, forcing her to either squeeze herself by me or stay where she is.\\n\\n She stays, but when she looks at me again a certain amount of exasperation has replaced part of the defiance.\\n\\n \"Obviously I know about him, no big deal. But maybe now you can better understand why Jazz\u0027s rambled confession made me want to tear his head off, then drag you both into bed with me? She\u0027s so obviously over him, has discarded him like a dishrag, and I couldn\u0027t just ignore that all of a sudden there was no reason left why we shouldn\u0027t re-start what we had, if we wanted that. And before you ask, I didn\u0027t tell either of you asshats because I knew you\u0027d just get your heads shoved even further up your asses if you knew. Don\u0027t even try to deny it!\"\\n\\n I let her stew for a while before I straighten, giving her a little more space.\\n\\n \"I\u0027m not. But if I recall, you\u0027ve had ample opportunity to tell me afterwards.\"\\n\\n She huffs, but then sighs.\\n\\n \"Yes, I had, and I\u0027m sorry I neglected to do so, but I was kind of hoping that she wouldn\u0027t bring him here. I know, I can get quite delusional when I get fucked thoroughly enough.\"\\n\\n I reward that with a grin – not a nice one, but it is obvious that it had the desired effect on her, the way she holds her breath for a moment – then lean in with the intent of kissing her with a silent promise of providing her with more reason for further delusions later, but before I can finish the move I hear my mother clear her throat from the direction of the door. \\n\\n","sourceLink":"https://allnovel.net/beautiful-disaster-beautiful-1/page-46.html","bookId":2786,"book":{"id":2786,"title":"Beautiful Disaster (Beautiful #1)","description":"Storyline: Beautiful Disaster (Beautiful #1) \\n INTENSE. DANGEROUS. ADDICTIVE. \\n Abby Abernathy is a good girl. She doesn’t drink or swear, and she has the appropriate number of cardigans in her wardrobe. Abby believes she has enough distance from the darkness of her past, but when she arrives at college with her best friend, her path to a new beginning is quickly challenged by Eastern University’s Walking One-Night Stand. \\n Travis Maddox, lean, cut, and covered in tattoos, is exactly what Abby wants—and needs—to avoid. He spends his nights winning money in a floating fight ring, and his days as the ultimate college campus charmer. Intrigued by Abby’s resistance to his appeal, Travis tricks her into his daily life with a simple bet. If he loses, he must remain abstinent for a month. If Abby loses, she must live in Travis’s apartment for the same amount of time. Either way, Travis has no idea that he has met his match.\\n","cover":"https://allnovel.net/images/beautiful-disaster-beautiful-1.jpg","author":"Jamie McGuire","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/beautiful-disaster-beautiful-1.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:30:15 PM"}}
