{"id":88893,"no":54,"title":"Page 54","content":"Rose is the only one I feel I can talk to about this, seeing as she\u0027s also hungering for attention and someone to talk to who has the intellectual capacity to at least carry on a conversation. She\u0027s mostly amused but doesn\u0027t laugh at me, but she does give me the only piece of sane advice that she can – hang in and work it out.\n Of course that\u0027s a lot easier said than done, but eventually I reach a point where I decide that I\u0027m not doing anyone a favor by ignoring the one thing I can get resolved without either Bella or Jazz sabotaging me – my friendship with Alice.\n I have to admit, I\u0027m not sure I want to mend things with her when I ring her doorbell and wait for her to buzz me in. The things she said in the past are enough to make me want to cut her out of my life completely without a second chance, if she really believes them. It would be so easy to ignore that \u0027if\u0027 and mentally replace it with an \u0027as\u0027, like Bella does, or try to get over her without wanting to see her ever again, like Jazz, but that\u0027s not my way.\n The more I think about it, the more my mother\u0027s words make sense to me.\n As things aren\u0027t entirely awesome between me and the other two, I decide I might as well give Alice one chance to explain. Knowing her, I don\u0027t even expect an apology, and I don\u0027t dare to hope that, even if everything resolves itself miraculously, our friendship will be as it was before, but I just need to know.\n She doesn\u0027t answer the door and my heart sinks, but I\u0027m too set on this to give up now, so I get my phone out and call her. A wise decision as it turns out, minutes into our phone call. At first she\u0027s wary and sounds cold, but still agrees to meet me later at her place, when she returns from the photo shoot she\u0027s at right now. By the time I hang up, we both sound almost civil, so I try not to panic until I get back to her door three hours later.\n I don\u0027t know what I was expecting, but when I see her standing at the door, holding it open for me, my first reaction is concern. It\u0027s been over two months since I last saw her, and the woman standing there neither resembles the vibrant, immature girl I\u0027ve known for more than half of my life, nor the self-righteous bitch I learned to hate over Thanksgiving. She has gained weight - at least ten pounds - and it actually looks good on her, but her eyes are sunken and surrounded by dark rings, speaking of lack of sleep and other things. I\u0027ve never seen her wear so little make-up or almost ordinary clothes.\n \"Hi,\" I offer as I stop at the door, not knowing what else to say.\n \"Hi,\" she echoes. \"Do you want to come in? I\u0027m only blocking the door to keep Mr. Fibbins from escaping into the wild freedom of the stairwell.\"\n \"Mr. Fibbins?\"\n Before she can answer, a black furry head appears at her ankle, bright green eyes staring at me before the cat gives a demanding yowl. Alice smiles and picks him up, rubbing her face in his fur as she steps aside to let me in. I follow, even more bewildered. Alice and a cat? Unlike many women I know, she\u0027s never liked pets, and I can only imagine what the shedding fur and the claws will do to her design projects.\n Although I\u0027ve been to her apartment more times than I can count, it\u0027s as if I\u0027m stepping into another world. Of course there\u0027s the addition of a cat climbing tree and a few pillows for the furry critter to sleep on, but that\u0027s not the most obvious change. Gone is all the clutter, the tons of useless yet decorative items, leaving the old furniture looking completely different.\n Everything is clean and simple, making our condo look like Ikea exploded in it by comparison.\n \"Alice, what\u0027s going on?\"\n I\u0027m still standing near the closed door, and haven\u0027t even taken off my shoes and coat, but I can\u0027t ignore this a moment longer. It feels as if I\u0027m caught in a David Lynch movie.\n Putting the cat down on the sofa, Alice turns back to me, a flicker of her old self surfacing when she raises her brows.\n \"What do you mean? I\u0027ve redecorated, so what?\"\n \"Redecorated?\" I ask lamely. She nods, but then chuckles sadly, shaking her head.\n \"Not just my flat, though. Do you want coffee? Tea? Soda?\"\n Shaking myself out of my apathy, I ask for coffee, then walk over to the sofa. I sit down opposite the cat, who, ignoring the general weirdness of the situation, is licking his butt. Alice soon returns with two cups of coffee, then, after another trip to the kitchen, a plate of cookies that she puts down on the table between us. Not some fat-free, low carb, no sugar atrocities, but normal, honest-to-God homemade chocolate chip cookies. I watch with even more wonder as she pops one into her mouth, then munches for a second without even batting an eyelash.\n Of course she notices my stare but ignores it, adding sugar to her coffee before she starts spooning the milk foam the top.\n \"How are things at the hospital?\" she asks, idly scratching the cat between his ears. Forcing my bewilderedness to stop messing with my vocal chords I shrug.\n \"Hectic, the usual. We\u0027ve got a new Orthopedic Surgeon; half of the doctors hate her, the nurses love her, and we\u0027re becoming friends fast. Her name\u0027s Zoe Thompson, and she\u0027s from Bristol. England.\"\n \"Oh, the British Invasion is rallying for a new wave,\" Alice jokes, then falls silent, the moment immediately turning awkward.\n \"And you?\" I ask, nearly tripping over my own words.\n \"Hectic, the usual.\" She repeats my sentence again, her smile slowly gaining in sincerity. \"Working with the Brits seems to be a common theme of late. I\u0027m co-designing a new line with a new design label from London.\n Very low-key, off the catwalks, but she\u0027s got great connections to a few Indie bands who we\u0027re trying to convince to do the marketing for us if we give them the clothes for free. Who knows, SplashDump might be the new Kings of Leon in a year or two. And if not, I still get to travel to London every few weeks and listen to awesome music. Things could be worse.\"\n It\u0027s as if I don\u0027t even know the woman sitting there, grinning for a moment with the obvious joy change is adding to her life.\n \"What about your other work, your label?\" I can\u0027t even remember what she called it, but she doesn\u0027t seem to mind my slip.\n \"Sold it.\"\n \"Just like that?\"\n \"Yup. Figured it was a good time, seeing as my assistant was ready to mutiny and defect to a major label, so I offered to let him take over.\n Technically I still own ten percent of it, enough to pay the rent, but he doesn\u0027t even need my okay on any executive decisions besides re-selling the company or kicking me out completely.\"\n \"And you\u0027re okay with that?\" I don\u0027t even try to hide the incredulity in my voice. Her label has been the only thing she\u0027s lived and breathed for since her second year in college, and dumping all that seems just insane.\n \"Do you mind if I excuse myself for a moment? Need to use the bathroom,\"\n I offer lamely, then quickly get up when she just nods.\n \"You know the way. But if you\u0027re looking for any kind of anti-depressants or other psychotropic drugs in my medicine cabinet, I can spare you the trip.\n You won\u0027t find any.\"\n I halt in mid-step, biting my lip at having been caught, but still continue on my way there, although I keep my activities to just taking a piss. When I return, Alice is sporting a half enigmatic, half wry smile.\n \"Found what you were looking for?\"\n \"Toilet paper and soap, yeah, but without the knit doily I nearly didn\u0027t recognize the backup roll.\"\n \"Smartass,\" she snorts, then nibbles on another cookie. Seeing as my stealthy attempt has failed, I go on the offensive.\n \"Not that I disapprove, but why the change? All this -\" I look at the spartan décor around us, \"so doesn\u0027t fit you.\"\n \"Maybe I just didn\u0027t fit the frills anymore?\" she offers, then finishes her coffee and gets up for a refill. I check, she even takes real cream. No wonder she has put on weight, pushing her into the comfortable lower range of what a woman her height should be. When she returns she hauls the cat onto her lap, not reacting to his claws sinking repeatedly into her dark blue jeans.\n \"Do you really want to know?\"\n I nod, then try to be the one to offer the white flag first.\n \"Friends care about what happens in each other\u0027s lives, right?\"\n \"I guess they do,\" she says, but contrary to what I have been hoping for, she sounds sad. Then she narrows her eyes and looks intently at me, the cat all but forgotten. \"Do you realize that I don\u0027t even know what field of medicine you chose? I mean, I know now because I ran into Esme last week and asked her, but you must have told me hundreds of times and I only remembered which hospital you were interning for because your dad worked there for years. Doesn\u0027t that strike you as peculiar?\"\n I don\u0027t really know what to say, but I can guess what she wants to hear.\n \"Alice, you\u0027ve always been a superficial person -\" I can barely censor the need to say \u0027bitch\u0027, \"and about as egocentric as they get. But that\u0027s nothing new, I wouldn\u0027t have been your friend for so long if I hadn\u0027t accepted that, nor would I have shown up here with the expectation of finding anything different.\"\n For a moment she seems ready to cry, but then gets a hold on herself, trying hard to pretend my words didn\u0027t affect her.\n \"Well, guess that means the long version then.\"\n She falls silent for a moment, gnawing on her lip before she resumes talking.\n \"I guess I finally realized that things were not right. With me. All around me.\n To be honest, first I believed everything and everyone else wasn\u0027t right, but eventually a bit of self-reflection started seeping in. After Thanksgiving -\"\n she stops, then swallows but goes on immediately, \"I told Nate that I needed to be alone. I shut myself in, turned the phone off, disconnected the landline. I think I cried for a straight day. Then I fell into some kind of apathy, didn\u0027t sleep, eat, shower, read, watch TV, just sat there and did nothing. I got lonely, then cried again when I saw that I only had three missed calls on my phone, and all of them were from my assistant. I went out to get a cat, for company if you will, but the local pet shop couldn\u0027t tell me the addresses of any of the high class breeders of any of the breeds I was considering. A little desperate at that point, I went to the animal shelter down the street and picked up Mr. Fibbins. He looked so alone but kept hissing at anybody who came close, and I felt an instant connection.\"\n I briefly look at the cat, purring and completely at ease, wondering at just how weirdly in sync they are.\n \"Of course when I got home he just added to the chaos, and when cleaning up after him became too much of a bother I started throwing things away that he broke. And then other things, too, until all the clutter was gone. He only drinks cream so I had to get some, and when the bottles always went bad, I started drinking it, too. Then I ran to the closest supermarket, bought a ton of chocolate, ate it, then made myself puke because I had eaten it.\n Realized that bulimia wasn\u0027t something I needed to drag myself into again, so I forced myself not to puke after the next bar. It tasted really good, even if I cried through most of it.\"\n \"Again?\" I have to interrupt her, suddenly weary.\n Alice offers me a small smile. \"There are things you don\u0027t know about me, either, not just the other way around.\"\n Exhaling loudly, she resumes, her tone once more clinical and flat as she continues with her recount.\n \"Then Christmas, I went to see my family, big mistake. My mother was horrified at the cat hair and the one scratch on the back of my hand, then was scandalized that I was drinking coffee with real cream, and told me I looked unhealthy because I had started to gain weight. I just turned around and called a cab, and spent the night in a hotel at the airport before I caught the next flight home. Then I threw out the remaining clutter, and brought half of my wardrobe to the nearest homeless shelter. Just couldn\u0027t look at it anymore, it had her written all over it, not me.\n \"Because I couldn\u0027t work, either, I went to see some college friends of mine who had moved to London, where I met Cecile, and realized just how much more I loved working with her. Sold my label, as I said, got a new \u0027healthy living\u0027 cook book, then bought a bunch of ten dollar a pair jeans and they were the best ones I had ever had. And ever since then I have pretty much have been working on building the new me.\"\n I take that all in in silence, and I don\u0027t know what to say even when she\u0027s done. While I hung out a lot at her family\u0027s home before they moved to Florida a few years ago, I never realized the amount of tension that must have existed between Alice and her mother that would cause things to blow up like that, but in hindsight it all makes sense. I guess I always thought they were just close, but not in a way that made Alice feel like she had to eventually break away from her.\n \"What about Nate?\" I finally ask when the only other thing I can think to bring up is more likely to cause some nasty bickering.\n \"We broke up. Kind of,\" she sighs, then shrugs. \"I told him I really needed to be alone, he tried to offer me a shoulder to cry on, and I kicked him out, telling him I didn\u0027t need anyone\u0027s sympathy. He still wouldn\u0027t go and I told him that I\u0027m not the woman he thinks I am. He told me that I don\u0027t know that, and that I\u0027m not really like I acted at the dinner. We kept fighting, and he finally left me alone when I promised I would call him once I felt better.\n We\u0027ve been on a few dates since then, but I\u0027m keeping my distance. He still insists that he sees the real me and has fallen in love with her, but how can he see that when I can\u0027t? Guess I\u0027m too weak to cut him free, but he\u0027s old enough to know if he wants to waste his time with a crazy bitch or not. We\u0027ll see, maybe eventually I\u0027ll trust him and believe him, seeing as I can\u0027t see anything clearly anymore.\"\n It\u0027s strange that she sounds more like she\u0027s musing over the topic, detached and trying out possibilities in her head, than talking about her love life. She\u0027s weirding me out, but at the same time I feel like this is the first real conversation we\u0027ve had since\n ever.\n Before I can think of a reply, her gaze turns a little jaded, and she herself pokes the big elephant crammed into the room with us.\n \"So how are things with Bella and Jazz?\"\n No way to avoid that topic now.\n \"Difficult but good.\"\n My answer doesn\u0027t sit well with her, but not for the reasons I expected. She mostly seems as if she\u0027s hurt but not surprised that I don\u0027t go on explaining.\n \"Guess it must be difficult with three people in the mix, when two are sometimes already impossible enough.\"\n I grin in spite of myself, considering how often Bella alone calls me\n \u0027impossible\u0027. Alice keeps looking at me expectantly, so I finally try to add a few more sentences.\n \"True, but the problems we keep bumping into aren\u0027t the ones I\u0027ve been waiting for. It sometimes seems as if we\u0027re deliberately trying to drive each other crazy. And many things explode way more quickly than they used to, and everything escalates, but also diffuses faster. Or maybe that\u0027s just us -\n mope, shout, then make up. You just end up saying things differently to a friend than to someone you love, and the weird mixture we\u0027re cultivating is forming its own dynamic in that spectrum.\"\n She nods as if my words make sense to her, then munches another cookie.\n \"Just how mad are they at me?\"\n I consider what to tell her for a long time, but don\u0027t know what to say in the end.\n \"Why did you say what you said at Thanksgiving?\" I ask her instead, feeling that if I understand her, maybe I can give her a better explanation about how things are between us and her.\n Alice falters for a moment, and for a while I think she is just going to shut me out again and not tell me anything at all, but then she continues anyway.\n \"I really don\u0027t know. I wasn\u0027t really myself, I was in a bad place, everything kept getting worse and worse – and I\u0027m not saying this as an excuse, but as an explanation.\"\n She turns away from me then and looks out the window, her voice again hollow when she resumes.\n \"Things were going bad a long time before that. Even before summer.\n Sometimes I don\u0027t even remember when they were any different. I mean, I didn\u0027t feel like everything was all that bad, I did my thing, tried to be who I thought everyone expected me to be: happy, superficial, exuberant Alice with a killer fashion sense and sage advice for everyone. Pretty stupid, huh?\"\n I don\u0027t reply, but I don\u0027t think she\u0027s really waiting for an answer.\n \"I guess when Jazz told me what you three had been up to, that should have been a wake-up call for me. Not because my three best friends were fucking each other behind my back, I mean, duh, just the spacial arrangements considered that probably shouldn\u0027t have been such a surprise. But it was, because I simply couldn\u0027t wrap my head around it, and my only reaction was to lash out, then try to ignore it. I guess on some level I realized that I had lost any connection I had to you and Jazz because I completely withdrew from you, then tried to fit what I had to into my perfect little world.\"\n The fact that she doesn\u0027t mention Bella isn\u0027t lost on me.\n \"Anyway, I decided to make the best of it, grow up, turn my life around.\n Only that didn\u0027t really turn out so well. Nothing fit, and if I hadn\u0027t been so afraid of being all alone, I would have told Jazz after a month that it wasn\u0027t working. But I couldn\u0027t. I tried to change him, and when that didn\u0027t work I gave up. Guess I was just waiting for everything to blow up in my face again. That\u0027s why I brought Nate to the Thanksgiving dinner, I knew that there wasn\u0027t a chance in hell that could work out. Only then it looked like it really would, so I had to make sure myself that it didn\u0027t.\"\n She falls silent, looking everywhere but at me, before finally she catches my gaze. The pain in her eyes is so palpable that I can\u0027t even feel angry at what she did anymore.\n \"But why? We\u0027re your friends, you could have told us. And if not me or Jazz, maybe Rose? You know that she would have listened, and maybe made you see reason?\"\n \"There was nothing she could have said that would have changed things for me. I didn\u0027t see it all as I see it now, I was so in over my head and so desperate and lost and... see, I can\u0027t even explain it now! But one day I woke up and no one in the whole world understood me anymore, didn\u0027t know who I was, and at the same time all of you were strangers to me! I didn\u0027t know how to deal with that, and things only got worse, so I did the only thing I still could, I tried to hang on to the delusions. But then I met Nate, and with him I was suddenly someone else. It wasn\u0027t even sexual attraction at first between us, that came much later. And I hated myself for sleeping with him because I knew I was cheating on Jazz and that he\u0027d never forgive me when he found out, but locked inside my head, it seemed like him shoving me away was exactly what I deserved. I waited and waited for him to catch on, but he just didn\u0027t, we went through the motions like before, pretended to be happy, and that drove me insane! He forced me to end things, and I did, about the only mature thing I\u0027ve done in years.\" \n","sourceLink":"https://allnovel.net/beautiful-disaster-beautiful-1/page-54.html","bookId":2786,"book":{"id":2786,"title":"Beautiful Disaster (Beautiful #1)","description":"Storyline: \n Beautiful Disaster (Beautiful #1) \n INTENSE. DANGEROUS. ADDICTIVE. \n Abby Abernathy is a good girl. She doesn’t drink or swear, and she has the appropriate number of cardigans in her wardrobe. Abby believes she has enough distance from the darkness of her past, but when she arrives at college with her best friend, her path to a new beginning is quickly challenged by Eastern University’s Walking One-Night Stand. \n Travis Maddox, lean, cut, and covered in tattoos, is exactly what Abby wants—and needs—to avoid. He spends his nights winning money in a floating fight ring, and his days as the ultimate college campus charmer. Intrigued by Abby’s resistance to his appeal, Travis tricks her into his daily life with a simple bet. If he loses, he must remain abstinent for a month. If Abby loses, she must live in Travis’s apartment for the same amount of time. Either way, Travis has no idea that he has met his match.\n \n","cover":"https://allnovel.net/images/beautiful-disaster-beautiful-1.jpg","author":"Jamie McGuire","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/beautiful-disaster-beautiful-1.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:30:15 PM"}}
