{"id":34808,"no":20,"title":"CHAPTER XX RUDOLPH FINDS TONY","content":"Four days afterward Rudolph arrived in the town where Tony was employed. He had not been drawn thither by any clew, but by pure accident. \\n\\n \\n\\n He put up for the night at the hotel where our hero had found work. He enrolled himself on the register as “Obadiah Latham, Philadelphia.” \\n\\n \\n\\n “Can thee give me a room, friend?” he inquired. \\n\\n \\n\\n Certainly, sir,” was the polite reply. “Here, Henry, show this gentleman up to No. 6. No. 6 is one of our best rooms, Mr. Latham.” \\n\\n \\n\\n “I thank thee,” said the tramp. \\n\\n \\n\\n The Quakers are always polite,” said the bookkeeper. “They are good pay, too, and never give any trouble. I wish we had more of them stop here.” \\n\\n \\n\\n “If all your customers were of that description, your bar wouldn’t pay very well.” \\n\\n \\n\\n “That is true.” \\n\\n \\n\\n But later in the evening the speaker was obliged to change his opinion. \\n\\n \\n\\n The Quaker came to the bar and asked: \\n\\n \\n\\n “Will thee give me a glass of brandy?” \\n\\n \\n\\n “Sir!” said the barkeeper, astounded. \\n\\n \\n\\n A glass of brandy!” repeated Rudolph, irritably. \\n\\n \\n\\n I beg pardon, sir, but I was surprised. I did not know that gentlemen of your faith ever drank liquor.” \\n\\n \\n\\n “Thee is right,” said the tramp, recollecting himself. “It is only for my health. Thee may make it strong, so that I may feel better soon.” \\n\\n \\n\\n Rudolph drained the glass, and then, after a little hesitation, he said: \\n\\n \\n\\n “I feel better. Will thee mix me another glass, and a little stronger?” \\n\\n \\n\\n A stronger glass was given him. \\n\\n \\n\\n The barkeeper looked at him shrewdly. \\n\\n \\n\\n Quaker as he is, he is evidently used to brandy,” he said to himself. “If he wasn’t, those two glasses would have upset him.” \\n\\n \\n\\n But Rudolph did not appear to be upset. \\n\\n \\n\\n He put his broad-brimmed hat more firmly on his head, and went outside. He decided to take a walk about the village. He little suspected that Tony was in the stable yard in the rear of the hotel. \\n\\n \\n\\n He walked on for perhaps a quarter of a mile, and then leaned against a fence to rest. As he stood here two boys passed him slowly, conversing as they walked. \\n\\n \\n\\n “I was surprised, Sam, at Tony Rugg’s licking you,” said the first. \\n\\n \\n\\n He couldn’t do it again,” said Sam, sullenly. \\n\\n \\n\\n Rudolph’s attention was at once drawn. \\n\\n \\n\\n Boys,” he asked, “did thee mention the name of Tony Rugg?” \\n\\n \\n\\n “Yes, sir.” \\n\\n \\n\\n “Does thee know such a boy?” \\n\\n \\n\\n “Yes, sir. He is working at the hotel. He got my place away from me,” said Sam. “Do you know him?” \\n\\n \\n\\n “I once knew such a boy.” \\n\\n \\n\\n Rudolph was very much elated at what he had heard. \\n\\n \\n\\n Well, good luck has come to me at last,” he said to himself. “The young scoundrel, is found, and now I must consider how to get him into my hands once more.” \\n\\n \\n\\n The Quaker, to designate him according to his present appearance, at once made his way back to the hotel. \\n\\n \\n\\n There can’t be two Tony Ruggs in this world,” he said to himself. “I am sure this is the boy.” \\n\\n \\n\\n On reaching the hotel he sauntered out to the stable yard in the rear of the house. His eyes lighted with pleasure, for he at once caught sight of Tony, standing beside James, the hostler. \\n\\n \\n\\n There comes old Broadbrim,” said James, in a low voice. “The barkeeper told me he took two stiff horns of brandy. He’s a queer sort of Quaker.” \\n\\n \\n\\n Tony gave a glance at the tramp but entertained no suspicion of his not being what he represented. Rudolph came nearer. His disguise had been so successful that he felt perfectly safe from discovery. \\n\\n \\n\\n Does thee keep many horses?” he asked. \\n\\n \\n\\n Yes, sir; we have twelve.” \\n\\n \\n\\n “That is a large number. Yea, verily, it is.” \\n\\n \\n\\n “Well, it is. There’s a good deal of carting to do for the hotel; besides Mr. Porter keeps a livery stable. Was you ever this way before?” asked James. \\n\\n \\n\\n “Nay, verily.” \\n\\n \\n\\n “Are you going away to-morrow morning?” \\n\\n \\n\\n “Nay, friend, I think I shall tarry a day or two. Is that lad thy son?” \\n\\n \\n\\n “Tony, he asks if you are my son,” said James, laughing. “No, his name is Tony Rugg, while mine is James Woodley.” \\n\\n \\n\\n “Anthony, was thee born in this town?” asked the tramp, boldly defying detection. \\n\\n \\n\\n No, sir,” answered Tony. “I only came here a few weeks ago.” \\n\\n \\n\\n “I’d like to choke the boy. I can hardly keep my hands off him,” thought Rudolph. “But I’d better be going. He is looking at me closely.” \\n\\n \\n\\n “Good-night,” he said, and the two responded civilly. \\n\\n \\n\\n Well, Tony, what do you think of Broadbrim?” \\n\\n \\n\\n “I don’t know, there’s something in his voice that sounds familiar to me.” \\n\\n \\n\\n “Perhaps you may have met him somewhere.” \\n\\n \\n\\n “No; I never met any Quaker before.” \\n\\n \\n\\n “Well, there’s stranger likenesses sometimes. Did I ever tell you my adventure out in Maine?” \\n\\n \\n\\n “No, what was it?” \\n\\n \\n\\n “I went down East to see a sister of mine that is married down near Augusta. When, as I was goin’ through Portland, a woman came up and made a great ado about my deserting her. She took me for her husband, and came near having me arrested for desertion. You see, I and her husband was alike as two peas, that’s what some of her neighbors said.” \\n\\n \\n\\n “How did you get off?” \\n\\n \\n\\n “Luckily I had documents in my pocket showing who I was. Besides, my brother-in-law happened to be in the city, and he identified me.” \\n\\n \\n\\n Rudolph sat in the public room of the hotel for a time, and then he went up to his room, partly to be out of the way of possible recognition, partly to think how he could manage to get Tony into his clutches once more. \\n\\n \\n\\n He had a back room, the window of which looked out upon the stable yard. He seated himself at this window, and could easily see and hear all that passed there. \\n\\n \\n\\n Tony and the hostler were lounging about, the latter smoking a clay pipe, their work being done for the day. \\n\\n \\n\\n Tony,” said the hostler, “I almost forgot to tell you you’re to go to Thornton to-morrow.” \\n\\n \\n\\n “What for?” \\n\\n \\n\\n “There’s a top-buggy Mr. Porter has sold to a man there. You’re to take it over, and lead the horse back.” \\n\\n \\n\\n “All right. I’d just as leave go as stay here. Can I find the road easily?” \\n\\n \\n\\n “There’s no trouble about that. Part of it runs through the woods—about a mile, I should say.” \\n\\n \\n\\n “Did Mr. Porter say when he wanted me to start?” \\n\\n \\n\\n “About nine o’clock; by that time you’ll be through with your chores.” \\n\\n \\n\\n Rudolph heard this conversation with pleasure. \\n\\n \\n\\n It’s the chance I was waiting for,” he said to himself. “I’ll lie in wait for him as he comes back.” \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/2019/57605.html","bookId":622,"book":{"id":622,"title":"Tony The Tramp;Or Right is Might","description":"简介： A man and a boy were ascending a steep street in a country town in eastern New York. The man was tall and dark-complexioned, with a sinister look which of itself excited distrust. He wore a slouch hat, which, coming down over his forehead, nearly con...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2019","creation":"Aug 1, 2019 12:19:03 AM","modification":"Aug 1, 2019 12:19:03 AM"}}
