{"id":34820,"no":32,"title":"CHAPTER XXXII TONY’S BAD LUCK","content":"Two weeks later Tony and his friend were guests at a popular London hotel, not far from Charing Cross. We will postpone business till we have seen a little of London,” said George Spencer. “Luckily my business is not of a pressing character, and it can wait.” “You have been in London before, Mr. Spencer,” said Tony. “I am afraid you will find it a bore going round with me.” “Not at all. I spent a week here when a boy of twelve, and saw nothing thoroughly, so I am at your disposal. Where shall we go first?” “I should like to see Buckingham Palace, where the king lives.” “He doesn’t live there much. However, we’ll go to see it, but we’ll take the Parliament House and Westminster Abbey on the way.” In accordance with this program they walked—for the distance was but small—to Westminster Abbey. It would be out of place for me to describe here that wonderful church where so much of the rank and talent of past ages lies buried. It is enough to say that Tony enjoyed it highly. He afterward visited the Parliament House. This occupied another hour. When they came out Mr. Spencer said: “Tony, I have got to go to my banker’s. Do you care to come?” “No, thank you, Mr. Spencer, I would rather walk round by myself.” “Very well, Tony, just as you please. Only don’t get lost.” “I’ll take care of that; I’m used to cities.” “You are not used to London. It is one of the blindest cities in the world; it is a complete labyrinth.” “I don’t mean to get lost. You’ll find me at the hotel at four o’clock.” “Very well. That will be early enough.” So George Spencer went his way, and Tony set out upon his rambles. He found plenty to amuse him in the various buildings and sights of the great metropolis. But after a while he began to wonder where he was. He had strayed into a narrow street, scarcely more than a lane, with a row of tumble-down dwellings on either side. There’s nothing worth seeing here,” said our hero. “I’ll inquire my way to Charing Cross.” He went into a small beer house, and preferred his request. Charing Cross!” repeated the publican. “It’s a good ways from ’ere.” “How far?” asked Tony. A mile easy, and there’s no end of turns.” “Just start me, then,” said Tony, “and I’ll reach there. Which way is it?” “Turn to the left when you go out of this shop.” “All right, and thank you.” Tony noticed that there were three or four men seated at tables in the back part of the shop, but he had not the curiosity to look at them. If he had, he would have been startled, for among these men was Rudolph Rugg, more disreputable than ever in appearance, for he had been drinking deeply for the last six months. He stared at Tony as one dazed, for he supposed him dead long ago at the bottom of a well, three thousand miles away. What’s the matter, Rugg?” asked his companion. “You look as if you’d seen a ghost.” “So I have,” muttered Rugg, starting for the door. Where are you going?” “I’ve got a headache,” said Rudolph. You’ve left your drink.” “I don’t want it.” “What’s come over him?” said his late companion, in surprise. No matter. He’ll be back soon.” Rudolph swiftly followed Tony. He wanted to find out whether it was really the boy whom he had sought to murder or not. Then, what did his appearance in London mean? Was he possibly in search of him—Rugg? It was wonderful, certainly. How had he obtained the means of coming to England?—as a gentleman, too, for Rudolph had not failed to notice his rich clothes. Had he obtained rich and powerful friends, and was he in search of the inheritance that had been wrongfully kept from him? Rudolph asked himself all these questions, but he could not answer one. If I could only ask him,” he thought, “but that wouldn’t be safe.” By this time he had come in sight of Tony, who was walking along slowly, not feeling in any particular hurry. An idea struck Rudolph. A boy who had been employed in begging was standing on the sidewalk. Gi’ me a penny, sir,” he said. Rudolph paused. Walk along with me, and I’ll show you how you can earn half a crown,” he said. Will you?” said the boy, his face brightening. Yes, I will, and you won’t find it hard work, either.” “Go ahead, guv’nor.” “Do you see that boy ahead?” “That young gentleman?” “Yes,” said Rudolph. I see him.” “I want you to manage to get him up to my room; it’s No. 7 —?— street, top floor, just at the head of the stairs.” “Shall I tell him you want to see him?” “No, he wouldn’t come. Tell him your poor grandfather is sick in bed—anything you like, only get him to come.” “S’posin’ he won’t come?” “Then follow him, and find out where he is staying. Do you understand?” “Yes, guv’nor. I’ll bring him.” “Go ahead, and I’ll hurry round to the room. I’ll be in bed.” “All right.” The boy was a sharp specimen of the juvenile London beggar. He was up to the usual tricks of his class, and quite competent to the task which Rudolph had engaged him to perform. He came up to Tony, and then began to whimper. What’s the matter, Johnny?” said Tony, addressing him by the usual New York name for an unknown boy. Oh, my poor grandfather is so sick!” said the boy. What’s the matter with him?” “I don’t know. I guess he’s goin’ to die.” “Why don’t you send for a doctor?” “He wouldn’t come—we’re so poor.” “Do you live near here?” “Oh, yes, sir; only a little way.” “I want to go to Charing Cross—is it much out of the way?” “No, sir; it’s right on the way there.” “Then, if you’ll show me the way to Charing Cross afterward, I will go round with you and look at your grandfather. Perhaps I can do something for him.” “Oh, sir, how kind you are! I know’d you was a gentleman when I fust saw you.” “When was your grandfather taken sick?” “Two days ago,” said the boy. Is he in bed?” “Yes, sir. Leastways, he was when I came out. We didn’t have no breakfast.” “I am sorry for that. Don’t you want to buy something to take to him?” “If you’ll give me a shillin’, sir, I’ll ask him what he can eat. Sick folks can’t eat the same things as the rest of us.” “To be sure. You are right. Well, here’s a shilling.” “The boy little thinks that I have known many a time what it is to be without breakfast, or money to buy any,” thought Tony. “I’ll do something for the poor man, if only to show how grateful I am for my own good fortune.” He followed the boy for about ten minutes, until they reached rather a shabby building. This was No. 7. Come right up after me,” said the boy. The two went up till they reached the room indicated by Rudolph. The boy pushed the door open. A sound of groaning proceeded from the bed. Grandfather, I’ve brought a kind young gentleman,” said the boy. Come here,” muttered the person in bed. Tony came up to the bed. In an instant Rudolph had thrown off the clothes, and had him seized by the arm. There’s your money, boy. Go!” he said to the other, flinging a half crown. I’ve got you at last!” he shouted. “Now, you young villain, I’ll get even with you!” His face was almost fiendish with rage, as he uttered these words.","sourceLink":"http://novel.tingroom.com/ertong/2019/57617.html","bookId":622,"book":{"id":622,"title":"Tony The Tramp;Or Right is Might","description":"简介： A man and a boy were ascending a steep street in a country town in eastern New York. The man was tall and dark-complexioned, with a sinister look which of itself excited distrust. He wore a slouch hat, which, coming down over his forehead, nearly con...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2019","creation":"Aug 1, 2019 12:19:03 AM","modification":"Aug 1, 2019 12:19:03 AM"}}
