{"id":41542,"no":13,"title":"CHAPTER IV. THE MEDICINE OF THE HINDUS.","content":"The Aryans.—Hindu Philosophy.—The Vedas.—The Shastres of Charaka and Susruta.—Code of Menu.—The Brahmans.—Medical Practitioners.—Strabo on the Hindu Philosophers.—Charms.—Buddhism and Medicine.—Jíwaka, Buddha’s Physician.—The Pulse.—Knowledge of Anatomy and Surgery in Ancient Times.—Surgical Instruments.—Decadence of Hindu Medical Science.—Goddesses of Disease.—Origin of Hospitals in India. The Hindus are considered by Max Müller to be much older even as regards their civilization than the Egyptians. This belief is based on his study of their language, which he says existed “before there was a single Greek statue, a single Babylonian bull, or a single Egyptian sphinx.” According to him, the noble Indo-Germanic or Aryan people, from whom have descended the Brahman, the Rájput, and the Englishman, had their earliest home, not in Hindustan, but in Central Asia. (Max Müller’s theory is now superseded by anthropological researches so far as the Europeans are concerned.) This splendid race drove before them into the mountains or reduced to slavery the Dasyus, the obscure aborigines, the non-Aryan prim?val peoples. The earliest Aryan poets composed the Rig-Veda at least three thousand, perhaps even four thousand years ago. The handsome Aryan fair-complexioned conquerors spoke with the utmost contempt of “the noseless” or “flat-nosed” Mongolian aborigines, who, in the Vedic poems, from being “gross feeders on flesh,” “lawless,” “non-sacrificing” tribes, were afterwards described as “monsters” and “demons.”224 It is necessary, if we wish to understand the principles of Hindu medicine, to glance at the philosophy and religion of the Brahmans and Buddhists. The Aryan conquerors descending through the Himalayas were a sober, industrious, courageous people, who lived a pastoral life, and knowing nothing of the enervating attractions of great cities, required no other medical treatment than simple folk medicine everywhere affords. Their earliest literature is found in the “Vedic Hymns,” the “Sacred Books of the Hindus,” which were composed by the wisest and best of the men, who were warriors and husbandmen, and97 the priests and physicians of their own households. They gradually acquired priestly supremacy over a wider range. Thus arose the Brahmans, the “Offerers of Potent Prayer.” The Rig-Veda refers to physicians, and speaks of the healing power of medicinal herbs; and the Atharva-Veda contains an invocation against the fever-demon, so that medical matters began very early to receive attention after the conquest of India by the Aryans. “Hinduism,” says Professor Monier Williams, “is a creed which may be expressed by the two words, spiritual pantheism.”225 Of all beliefs this is the simplest. Nothing really exists but the One Universal Spirit; man’s soul is identical with that Spirit. Separate existence apart from the Supreme is mere illusion; consequently every man’s highest aim should be to get rid for ever of doing, having, and being, and strive to consider himself a part of the One Spirit. This in a few words is esoteric Hinduism. When we attempt to study the endless ramifications of the exoteric, or popular belief, the system, so far from being simple, is infinitely complicated. God may amuse Himself by illusory appearances. Light in the rainbow is one, but it manifests itself variously. All material objects, and the gods, demons, good and evil spirits, men, and animals are emanations from the One Universal Spirit; though temporarily they exist apart from him, they will all ultimately be reabsorbed into their source. In the Sanskrit language, which is the repository of Veda, or “knowledge,” we have the vehicle of Hindu philosophy. The systems of Hindu philosophy which grew out of the third division of the Vedas, called the Upanishads, are six, and are given in Professor Monier Williams’ work already referred to as— 1. The Nyāya, founded by Gotama. 2. The Vais’eshika, by Kanāda. 3. The Sānkhya, by Kapila. 4. The Yoga, by Pantanjali. 5. The Mīmānsā, by Jaimini. 6. The Vedānta, by Bādarāyana or Vyāsa. We know neither the dates of these systems, nor which of them preceded the other. Oriental scholars tell us that, 500 years before Christ, in India, China, Greece, and Persia men began to formulate philosophical systems of religious belief, and to elaborate scientific ideas of the world in which they lived. Williams considers the Vais’eshika system of philosophy the most interesting of all the systems, from the parallels it offers to European philosophical ideas. This system goes more correctly than98 the others into the qualities of all substances. It is therefore more scientific, as we should say. It is most interesting to discover how nearly the doctrine of the atoms approaches our Western teaching. The following is Professor Williams’ account of these views:— “First, then, as to the formation of the world, this is supposed to be effected by the aggregation of Anus, or ‘Atoms.’ These are innumerable and eternal, and are eternally aggregated, disintegrated, and re-integrated by the power of Adrishta. According to the Kanādas Sūtras, an atom is ‘something existing, having no cause, eternal.’ They are, moreover, described as less than the least, invisible, intangible, indivisible, imperceptible by the senses, and as having each of them a Vis’esha or eternal essence of its own. The combination of these atoms is first into an aggregate of two, called Duy-anuka. Three of them, again, are supposed to combine into a Trasa-renu, which, like a mote in a sunbeam, has just magnitude enough to be perceptible.”226 In the Sānkhya philosophy we find something very like Darwinism. “There cannot be the production of something out of nothing; that which is not cannot be developed into that which is. The production of what does not already exist (potentially) is impossible, like a horn on a man; because there must of necessity be a material out of which a product is developed; and because everything cannot occur everywhere at all times; and because anything possible must be produced from something competent to produce it.” (Aphorisms, i. 78, 114-117).227 The Upa-Vedas, or secondary Vedas, treat of various sciences, one of which, Ayur-Veda, is the “science of life,” or medicine. By some this is considered to belong to the Atharva-Veda; by others to the Rig-Veda. By Ayur-Veda we are to understand something derived immediately from the gods. The supplementary revelation known as Upa-Vedas dates about 350 b.c., and there we find Brahmanical medicine already developing.228 “Of all ancient nations,” says Elphinstone, “the Egyptians are the one whom the Hindus seem most to have resembled.”229 There is good reason for believing that the ancient Greeks derived much of their philosophy and religion from the Egyptians, who seem in their turn to have taken both in great measure from India. Says Elphinstone:99 “It is impossible not to be struck with the identity of the topics discussed by the Hindu philosophers with those which engaged the attention of the same class in ancient Greece, and with the similarity between the doctrines of schools subsisting in regions of the earth so remote from each other.”230 Here we find the doctrines of the eternity of matter, the derivation of all souls from God and their return to Him, the doctrine of atoms and a whole system similar to that of Pythagoras. The Greek philosopher taught that intermediate between God and mankind are a host of aerial beings who exercise various influences on the condition of mankind and the affairs of the world. Enfield231 and Stanley232 say that Pythagoras learned his doctrine from the Magi or Oriental philosophers. Max Müller says that Zarathustra and his followers, the Zoroastrians, had been settled in India before they immigrated into Persia. “That the Zoroastrians and their ancestors started from India during the Vaidik period, can be proved as distinctly as that the inhabitants of Massilia started from Greece.... Many of the gods of the Zoroastrians come out ... as mere reflections and deflections of the primitive and authentic gods of Veda.”233 The Hindus say that when their four immortal Vedas, named Rig, Yajur, Sáma, and Atharva, were originally given to man by Brahma, there was no disease or sin; but when mankind fell away from this virtuous and happy state, life was shortened and disease introduced. Brahma, in his compassion for the sufferings of mankind, then gave a second class of sacred books, the Upavédas; one of these, named Ayur-Veda, treats of the prevention and cure of diseases. Some say this work really came from Siva; it is the sacred medical authority of the Hindus, and is of the highest antiquity. It was originally of great length, but Brahma in mercy to mankind shortened it. Fragments now only remain, and these in the works of commentators. Two divisions treat of surgery. 1st, Salya treats of the surgery of the removal of foreign bodies, pus, and the dead child from the uterus; of healing wounds caused by knives, etc.; of bandaging, operations, blistering, and the treatment of abscesses and inflammations. 2nd, Sálákya treats of diseases of the eyes, ears, mouth, and nose. 3rd, Káyachikitsá describes diseases affecting the whole body, as fevers, dysentery, etc. This section may be considered as constituting the practice of medicine. 4th, Bhutavidya deals with the art of restoring the deranged faculties of the mind produced by demoniacal possession, as by the anger of the gods, devils, giants, or spirits of dead men. They can only be removed by prayers, medicines, ablution, and offerings to the offended deity. 5th, Kaumárabhritya comprises the treatment of infants and such diseases as in them were caused by the displeasure of demons.100 6th, Agadatantra is concerned with the administration of antidotes. 7th, Rasáyanatantra treats of the medicines proper for restoring youth, beauty, and happiness; it embraced chemistry or alchemy, and its intention was to discover the universal medicine. 8th, Vájíkaranatantra deals with the best means of increasing the human race: an illusory research, which, like the search for the elixir of life, has even in modern times occupied the attention of physicians. The sacred Ayur-Veda contained a description of the structure of the human body as learned from dissection, and a complete system of preventive and curative medicine. In the Shastres (Charaka, Susruta), we learn that the Ashwins, or offspring of the Sun (Surja), were the physicians of the gods; they wrote books on medicine, and wrought wonderful cures. When the fifth head of Brahma was cut off by Bayraba, it was united again by the Ashwins, so skilled were they in surgery. They also cured the wounds which the gods received in the battle with the giants. They healed also the paralysed arm of Indra. When mankind became wicked, and consequently diseased, Bharadwaja went to Indra in heaven to acquire a knowledge of medicine, and the thousand-eyed god taught him the healing art. With this knowledge the sage Bharadwaja returned to earth, and taught the Rishis the principles he had acquired. So the sages learned to distinguish diseases and the medicines suitable for their cure; they lived to a very great age, writing books called by their own names. Charaka became the instructor of practitioners upon earth, and his is the most ancient and famous work on Hindu medicine. Charaka, whom we may term the Hindu Hippocrates, flourished at Benares, probably about b.c. 320. The most celebrated and ancient collection of Hindu laws and precepts is that which is known as “the Code of Menu,” or “Institutes of Menu.” It is probably the oldest and most sacred Sanskrit work after the Veda and its Sutras, and presents us with a faithful picture of the customs and institutions of the Hindus. The Code of Menu lays it down that diseases are the consequences of sinful acts in previous states of existence.101 “Men of evil manners receive an alteration of form, some through evil (deeds) committed (by them) in this life, some also through (acts) formerly committed. A thief of gold (receives) the disease of bad nails; a drinker of intoxicating liquor (the disease of) black teeth; a slayer of a Brahman, consumption; he who violates the couch of the Guru, a skin disease; a slanderer, a foul-smelling nose; a false informer, a foul-smelling mouth; a stealer of grain, the loss of a limb, and one who mixes (grain) a superfluity (of limbs); one who takes food, dyspepsia; a thief of the voice, dumbness; a thief of clothes, leprosy; a horse-thief, lameness; a stealer of a lamp would (in the next birth) become blind; an extinguisher (of a lamp), one-eyed; by (committing) injury (one would get) a condition of disease; by not (committing) injury, the condition of not being diseased. Thus, according to the difference in their acts, (men who are) blamed by the good are born dull, dumb, blind, and deformed in appearance. Regularly, then, penance should be practised for purification, since those whose sins have not (thus) been done away with are (re)born with (these) disgraceful marks attached.”234 Physicians are referred to several times in the Ordinances of Menu. In Lect. iv. 179 we are advised that “we should never have a dispute with a physician.” We are to avoid eating the “food of a physician and hunter, if a cruel man,” etc. (Lect. iv. 212). “The food of a physician is pus” (Ibid. 220). In Lect. ix. 284, “A fine (is set) for all physicians treating (a case) incorrectly: in (the case of creatures) not human (this is) the first, but in (the case of) human beings the medium (fine).”235 The Brahmans believed there was a remedy for every disease, in consequence of which they made a very careful examination of the vegetable kingdom, and so discovered a great number of medicines. If a medicine were efficacious in curing the patient, they invariably supposed it was due to the sanctity of the individual, and the divine pleasure which endowed him with it. It is therefore exceedingly difficult to obtain information, as it is believed that the medicine would lose its effect if the secret of the cure were divulged to others. From these selfish motives, the knowledge of the properties of many valuable remedies have been lost. Dr. Wise says, according to the Brahmans, there are nine secrets which should not be revealed to any one: these are the age of a person; his wealth; family occurrences; his bad actions, or those which reflect shame or dishonour upon him; his relations with his wife; his prayers to his tutelar gods; his charities; and the virtues of nostrums, the ingredients of which are known to him. Yet priests, says Baas, from the Brahman caste, and the sub-castes, the Vaisya and Vaidya, officiated for a long time as teachers of medicine102 and as physicians. The Vaidyas, as the higher of the two sub-castes, included the physicians proper; while the Vaisyas, or lower caste, furnished nurses.238 When Buddhism passed into modern Hinduism (750-1000 a.d.) the rules of caste became stricter, and the old fetters were reimposed, and the Brahmans returned to their ancient principles which forbade them to contaminate themselves with blood or morbid matter; they withdrew from all practice of medicine, and left it entirely to the Vaidyas. After a time these also shrank from touching dead bodies. Then public hospitals were abolished when Buddhism fell. The Mohammedan conquests which began about 1000 a.d. introduced foreign practitioners of physic, who derived their knowledge from Arabic translations of Sanskrit medical classics and monopolised the patronage of the Mohammedan aristocracy.239 The only remains of the Buddhist hospitals now existing are the various institutions for animals, supported principally by the Jains, a sort of Protestants against Brahmanism.240 The Mohammedan medical practitioners were called “Hukeems,” who followed the principles of Arabian medicine derived from Greek sources. As a rule these practitioners only attended on nobles and chiefs. There is no evidence even that the Mohammedan invaders employed medical men for their armies.241 Dr. Benjamin Heyne, in his Tracts on India, says,242— “The medical works of the Hindus are neither to be regarded as miraculous productions of wisdom, nor as repositories of nonsense. Their practical principles, as far as I can judge, are very similar to our own; and even their theories may be reconciled with ours, if we make allowance for their ignorance of anatomy, and the imperfections of their physiological speculations.” In surgery they attained to high proficiency, and our modern surgeons have even been able to borrow from them the operation of rhinoplasty.243 Concerning the medicinal properties of minerals (stones and metals), plants, animal substances, and the chemical analysis and decomposition of these, we have also learned much that is extremely valuable from the Hindus. Their Materia Medica is so important, and has played so large a part in Western medical science, that we cannot afford to despise it, though the Hindus have contributed so little to the study of natural science.244 Veterinary medicine, so far as the diseases of103 horses and elephants are concerned, has received special attention from the Hindus. Charaka counsels youths who desire to study medicine to “seek a teacher whose precepts are sound and whose practical skill is generally approved, who is clever, dexterous, upright, and blameless; who knows also how to use his hands, has the requisite appliances, and all his senses about him; is confident with simple cases, and sure of his treatment in difficult ones; of genuine learning, unaffected, not morose or passionate, patient and kind to his pupils.” The pupils should spring from a family of doctors, and should have lost none of their limbs and none of their senses. “They are to be taught to be chaste and temperate, to speak the truth, to obey their teacher in all things, and to wear a beard.” They are advised to read medical treatises, attend to the personal instruction of their teacher, and to associate with other doctors. When the doctor visits his patient he should wear good clothes, incline his head, be thoughtful but of firm bearing, and observe all possible respect. Once within the house, word, thought, and attention should be directed to nothing else than the examination of the patient and all that concerns his case. He must not be a boaster. “Many recoil even from a man of skill if he loves to boast.” As medicine is difficult to learn, the doctor must practise carefully and incessantly. He must seek every opportunity for conversation with a colleague. This will remove doubts, if he have them, and fortify his opinion. When an operation is decided on, a fortunate moment, says Dr. Wise, is to be selected, and the Brahmans and the surgeons are to be “propitiated” with gifts. The operating room is to be clean and well lighted, milk, oil, herbs, hot and cold water are to be at hand, and strong attendants to hold the patient. The knife should be wet with water before being used. The sky must be clear, and the time should be near the new moon. The surgeon must be strong and a rapid operator, and he must neither perspire, shake, nor make exclamations. The palms of the hands and soles of the feet, vessels, tendons, joints, and bones are to be avoided. During the operation, care must be taken to keep a fire burning in the patient’s room, on which sweet-scented substances are to be burnt, in order to prevent devils entering the patient by the wound made by the surgeon. After the operation holy water is to be sprinkled on the sufferer, and prayer addressed to Brahma. The bandages are to remain till the third day, and clean ones substituted.245 Susruta was the son of Visámitra, a contemporary of Rama, and was104 chosen by Dhanwantari, who was the Hindu ?sculapius, to abridge the Ayur-Veda for the cure of diseases and the preservation of the health, so that it might be more easily committed to memory. Susruta’s book is still preserved, and after Charaka’s it is the oldest book on medicine which the Hindus possess. Surgery was considered by Susruta to be “the first and best of the medical sciences; less liable than any other to the fallacies of conjectural and inferential practice; pure in itself, perpetual in its applicability; the worthy produce of heaven, and certain source of fame.” Wise says,246 “Dhanwantari asked his pupils, On what shall I first lecture? They answered, On surgery; because formerly there were no diseases among the gods, and wounds were the first injuries which required treatment. Besides, the practice of surgery is more respected, as affording immediate relief, and is connected with the practice of medicine; although the latter has no connection with surgery.” This was agreed to; and we find the explanation of the eight parts of Ayur-Veda, in six books of Susruta, as follows:— 1st. Surgery (Sútra Sthána), in which is considered the origin of medicine; the rules of teaching, the duty of practitioners, the selection and uses of instruments and medicines, the influence of the weather on health, and the practice to be followed after surgical operations. Then follows the description of the diseases of the humours and surgical diseases; the restoration of defective ears and noses; and the removal of extraneous substances which have entered the body; the different stages of inflammation, with their treatment; different forms of wounds and ulcers, and the regimen of patients labouring under surgical diseases; the description of good and bad diet; of prognosis; the kind of messengers to be employed by the sick; and of diseases produced by the deranged actions of the senses, and of incurable diseases. Then follows the preparations required for accompanying a rajah in war, the duty of practitioners, the difference of climates, the different classes of medicines according to their sensible qualities, a description of the fluids, and of the different preparations, and articles of food. These subjects are treated of in thirty-six chapters. 2nd. Nosology (Nidána Sthána). The description and diagnosis of diseases produced by vitiated humous, or derangements of blood, bile, wind, and phlegm; the symptoms and causes of rheumatic diseases, of piles, of stone, fistula-in-ano, leprosy, diabetes, gonorrh?a, and ascites; the symptoms of unnatural presentations in midwifery, large internal abscesses, erysipelas, scrofula, hydrocele, venereal diseases, and diseases of the mouth. These subjects are considered in sixteen chapters. 105 3rd. Anatomy (Saríra Sthána), or structure of the body. The description of the soul, and the elementary parts of the body; of puberty; of conception; of the growth of the different parts of the body; of bleeding; of the treatment of pregnancy, and of infants. This division has ten chapters. 4th. Therapeutics (Chikitsa Sthána), in which the exhibition of medicines, the history of inflammations, the treatment of fractures, rheumatic diseases, piles, fistula-in-ano, leprosy, diabetes, and dropsy are given; the manner of extracting the child in unusual positions, the remedies for restoring health and strength, and for prolonging life; the means of preventing diseases; the use of clysters, and of errhines, and the use of the smoke of different substances. These are considered in forty chapters. 5th. Toxicology (Kalpa Sthána). The means of distinguishing poisoned food, and descriptions of different mineral, vegetable, and animal poisons, with their antidotes, is given under this head. This division is treated of in eight chapters. 6th. The supplementary section, Locales (Uttara Sthána), includes various local diseases; as those of the eye, nose, ears and head, with their treatment; the symptoms and treatment of fever, and its varieties; dysentery, consumption; gulma; diseases of the heart; jaundice; discharges of blood, and fainting. This is followed by the treatment of intoxication, of cough, hiccough, asthma, hoarseness of voice, worms, stercoraceous vomiting, cholera, dyspepsia, and dysuria. It also treats of madness, epilepsy, apoplexy; the different tastes of substances, with their effects; the means of retaining health, and the different opinions of practitioners regarding the humours. These subjects are treated in sixty-six chapters. According to Susruta a pupil had to be initiated into the Science of Medicine. “A medical man should initiate a pupil who is either a Brahmana, Kshatriya, or Vaishya, the members of whose body are sound, of an amiable disposition, active, well-conducted, mild, healthy, vigorous, talented, courageous, of a retentive memory, good judgment and rank, whose tooth-ends, tongue, and lips are small, whose eyes, nose, and mouth are straight, of a pleasant mind, talk, and behaviour, and able to bear fatigue; other such should not be initiated.” Many ceremonies follow; an altar is to be erected having four angles in some conspicuous direction, which is to be washed with infusion of cow-dung and spread with kúsa grass; precious stones and rice are to be scattered upon it, and a fire is to be kindled with a number of precious woods, an oblation of ghee is to be made, and the mystic words Bhúr Bhuvah Svar and Om are to be said.106 “After this hail each divinity (Brahma, Agni, Dhanvantari, Prajápati, Asvins, and Indra) and each Sage (the Rishis), and make the pupil do the same.” Stenzler and others have thought it possible that Susruta borrowed his system of medicine largely from the Greeks, and they say that so far as chronology is affected by it there would be nothing surprising in the circumstance. But Weber asserts247 that no grounds whatever exist for this supposition; on the contrary, there is much to tell against such an idea. None of the contemporaries of Susruta has a name with a foreign sound, and the cultivation of medicine is assigned by Susruta and other writers to the city of Benares. The weights and measures to be employed by the physician are those of the eastern provinces, which never came into close contact with the Greeks, and it was first in these parts where medicine received its special cultivation. In the general treatment of disease, the Hindus paid great attention to diet, so as to promote the just balance of the elements and humours, as they considered that the generality of diseases are produced by derangements in the humours. Many of their statements on dietetics show a keen observation. If management of diet failed to cure the disorder, the patient was directed to abstain from food altogether for a time. Should this also fail, recourse was had to ejecting the corrupted humours by emetics, purgatives, or bleeding. Even the healthy were advised to take an emetic once a fortnight, a purgative once a month, and to be bled twice a year at the change of the seasons. The Hindus observed the “critical days” which have long been recognised by physicians everywhere. Pythagoras says the Egyptians observed them, and Hippocrates employed the term κρασι? when the humoral pathology was in vogue. The Hindus thought that all diseases divide naturally into two classes of the sthenic and asthenic types. In the one there was excess, in the other deficiency of excitement. Health consists in a happy medium. All the Asiatic nations hold this opinion. Their remedies consequently were stimulating or cooling, as the type of the malady demanded. Pepper, bitters, and purgatives were stimulants. Stomachics, as chiraitá, paun mixed with lime, bathing and cold were cooling remedies.248 The sages of antiquity have handed down to us the qualities which constitute a good physician. He must be strictly truthful, and of the greatest sobriety and decorum; he must have no dealings with any women but his own wife; he must be a man of sense and benevolence, of a charitable heart, and of a calm temper, constantly studying how to do good. Such a man is a good physician if, in addition to this, he constantly endeavours to improve his mind by the study of good books.107 He is not to be peevish with an irritable patient; he must be courageous and hopeful to the last day of his patient’s life; always frank, communicative, and impartial, he is yet to be rigid in seeing that his orders are carried out. Hindu physicians make their prognosis a strong point in their practice; there are, they say, certain signs which to the experienced eye enable the doctor to prognosticate the favourable or fatal termination of a disorder. And in the first place a good deal is to be learned from the messenger who summons him to the patient, and so he notes his appearance, his dress, his manner of speaking; he notes the time of day and other circumstances, as these are all considered to have an influence on the result of the illness. It is considered unfavourable if many people follow each other to call the doctor. If the messenger sees a man arrive riding on an ass, or if he has a stick, string, or fruit in his hand, if he is dressed in red, black, or net clothes, if he sneezes, is deformed, agitated, crying, or scratching himself,—all these are bad signs. Not less so is it unfavourable when the physician is called at noonday or midnight, when he has his face turned towards the south, when he is eating, or when he is asleep or fatigued.249 When the doctor arrives at the bedside, it is an unfavourable sign if the patient rubs one hand against another, scratches his back, or constantly moves his head. There are eight most severe forms of disease—the nervous class, tetanus and paralysis; leprosy; piles, fistula-in-ano, stone; unnatural presentations in labour; and dropsy of the abdomen. These are cured with great difficulty, say the Hindus. It is a good sign when the patient’s voice remains unaltered, when he awakes from sleep without starting, when he remains cool after food, and when he does not forget his god, but is prayerful and resigned. “When the messenger finds the physician sitting in a clean place, with his face towards the east, and the messenger has in his hands a water-pot full of water, with an umbrella, they are favourable signs.” 108 “In Ceylon it is affirmed by the Shastree Brahmans that the Science of Medicine was communicated by M?h? Br?hma to the Br?hma D?ksh? Prajapatí; by Prajapatí it was communicated to the Aswins (the physicians of heaven): the two Aswins communicated it to Satora, the chief of the gods inhabiting the six lower heavens, by whom it was communicated to the nine sages, mentioned, on their going to him with one accord to seek a remedy for the evils brought upon mankind by their iniquities; they communicated it to the King of Casi (Benares), whose descendants caused it to be committed to writing.”250 Arrianus, in his history of Alexander’s expedition to India, says that “speckled snakes of a wonderful size and swiftness” are found in that country, and that “The Grecian physicians found no remedy against the bite of these snakes; but the Indians cured those who happened to fall under that misfortune; for which reason, Nearchus tells us, Alexander having all the most skilful Indians about his person, caused proclamation to be made throughout the camp that whoever was bit by one of these snakes, should forthwith repair to the royal pavilion for cure. These physicians also cure other diseases; but as they have a very temperate clime, the inhabitants are not subject to many. However, if any among them feel themselves much indisposed, they apply themselves to their sophists, who by wonderful, and even more than human means, cure whatever will admit of it.”251 Strabo speaks of the Hindu philosophers or sages, and the physicians. “Of the Garmanes, the most honourable,” he says, “are the Hylobii, who live in the forests, and subsist on leaves and wild fruits; they are clothed with garments made of the bark of trees, and abstain from commerce with women and from wine. The kings hold communication with them by messengers concerning the causes of things, and through them worship and supplicate the Divinity. Second in honour to the Hylobii are the physicians, for they apply philosophy to the study of the nature of man. They are of frugal habits, but do not live in the fields, and subsist upon rice and bread, which every one gives when asked, and receive them hospitably. They are able to cause persons to have a numerous offspring, and to have either male or female children, by means of charms. They cure diseases by diet, rather than by medicinal remedies. Among the latter, the most in repute are ointments and plasters. All others they suppose partake greatly of a noxious nature.”252 They had enchanters and diviners versed in the arts of magic, who went about the villages and towns begging. Arrianus said of the Hindus that their women were deemed marriageable at seven years of age; but the men, not till they arrive at the age of forty.253 Many charms, imprecations, and other superstitious usages of ancient India are contained in the Atharva-veda-Samhita. This body of literature dates, according to Max Müller, from 1000 to 800 b.c. (the Mantra109 period).254 In this Samhita a number of songs are addressed to illnesses, and the healing herbs appropriate for their cure. Sarpa-vidyá (serpent-science) possibly dealt with medical matters also.255 The oldest fragments (very poor ones, it must be confessed) of Hindu medical science are to be found in these relics of Vedic times. In a work on Indian medicine called the Kalpastanum described by Dr. Heyne,256 we read that the doctor’s apparatus of mortars, scales, etc., must be kept in a place in the wall that has been consecrated for that purpose by religious ceremonies. In the middle of the medicine room the mystic sign must be set up, with images of Brahma, Vishnu, and Siva. Mystic Sign Many ceremonies must be gone through in the preparation of medicines; the physician must attend to the boiling of some of them himself, and the spot round the fireplace must be smeared with cow-dung by a virgin, or by the mother of sons whose husband is alive; at the same time, offerings must be made to the gods. Should any of the ceremonies be omitted, the patient will repent the neglect, for devils of all descriptions will defile the medicine and hinder its good effect. Before the patient takes his potion, the god of physic is to be worshipped in the person of his deputy, the doctor, who naturally (and for the good of the patient) is to be well rewarded for his services. Buddhism, says Max Müller, is the frontier between ancient and modern literature in India. He gives 477 b.c. as the probable date of Buddha’s death,257 and describes the religion of that great sage as standing in the same relation to the ancient Brahmanism of the Veda as Italian to Latin, or as Protestantism to Catholicism. It is a development from Brahmanism, yet it is not the religion of India, though it has greatly influenced Hindu thought.258 Buddha’s religious system recognised no supreme deity; a Buddhist never really prays, he merely contemplates.259 Man can himself become the only god Buddha’s system finds room for. God becomes man in Brahmanism; man becomes a god in Bud110dhism. All existence is an evil to the Buddhist; “act” is to be got rid of as effectually as possible, for action means existence. The great end of the system is Nirvāna, or non-existence. “Of priests and clergy in our sense,” says Professor Williams, “the Buddhist religion has none.” Though there is no God, prayer is practised as a kind of charm against diseases; for malignant demons, as we might have expected, are believed by Buddhists to cause these and other evils. These Buddhist prayers are used like the Mantras of the Brahmins as charms against evils of all kinds. The Buddhists have a demon of love, anger, evil, and death, called Māra, the opponent of Buddha. He can send forth legions of evil demons like himself. Some of the precepts of Buddha are fully equal to those of the highest religions—Charity, Virtue, Patience, Fortitude, Meditation, and Knowledge. The special characteristic of Buddhism is the perfection of its tenderness and mercy towards all living creatures, even beasts of prey and noxious insects not being outside the circle of its sympathy. According to the Buddhist’s belief, all our acts ripen and go to form our Karma. The consequences of our acts must inexorably be worked out. This is Brahminical as well as Buddhistic doctrine. “In the Sábda-kalpa-druma, under the head of Karma-vipāka,” says Williams, “will be found a long catalogue of the various diseases with which men are born, as the fruit of evil deeds committed in former states of existence, and a declaration as to the number of births through which each disease will be protracted, unless, expiations be performed in the present life.”260 All our sufferings, our sicknesses, weaknesses, and moral depravity are simply the consequences of our actions in former bodies. When the Jews asked our Lord, “Who did sin, this man (i.e. in a former life) or his parents, that he was born blind?”261 they evidently had in their minds the Hindu doctrine of previous existences. The principles of the Brahminic religion do not appear to have embraced any care for or attention to the needs of sick people. Involved in philosophical speculations, and the perfecting of their system of caste, the founders of the Brahminic religion had no time to bestow on such mundane matters as disease and its cure. It was not until the rise of Buddhism and the political ascendency which it acquired over Brahmanism (from about 250 b.c. to a.d. 600), that public hospitals were established for man and animals in the great cities of the Buddhist princes.262 Buddhism had a gospel for every living creature; it taught the spiritual equality of all men, whose good works, without the mediation of priests and Brahmins, would save them from future punishment. Medicine, under the111 fostering care of Buddhism, was studied as any other science, and the noblest outcome of the movement was the establishment of public hospitals. A great seat of medical learning was established at Benares, and Asoka, King of Behar or Putra, published fourteen Edicts, one of which devised a system of medical care for man and beast.263 Amongst the legends of Gotama Buddha is the history of Jíwaka, which is of great interest to the historians of medicine, as it illustrates the state of the science in India at that early age. The following account is abbreviated from Mr. Spence Hardy’s translation of Singhalese MSS.264 Jíwaka was a physician who administered medicine to Budha. He learned his profession in this way. When he was seven or eight years of age, he ran away from his parents, resolving that he would learn some science; so he considered the character of the eighteen sciences and the sixty-four arts, and determined that he would study the art of medicine, that he might be called doctor, and be respected, and attain to eminence. So he went to the collegiate city of Taksalá265 and applied to a learned professor to take him into his school of medicine. The professor asked him what fees he had brought with him. Jíwaka said he had no money, but he was willing to work. The professor liked the manner of the lad, and agreed to teach him, though from other pupils he received a thousand masurans. At this moment the throne of Sekra trembled, as Jíwaka had been acquiring merit, and was soon to administer medicine to Gotama Budha. The déwa resolved that as he was to become the physician of Budha, he would himself be his teacher; and for this purpose he came to the earth, entered the mouth of the professor, and inspired him with the wisdom he needed to teach his pupil in the most excellent manner. Jíwaka made rapid progress, and soon discovered that he could treat the patients more successfully than his master. He learned in seven years as much about diseases as any other teacher could have taught him in sixteen. Then Jíwaka asked his preceptor when his education would be finished; and the old man, wishing to test his knowledge, told him to take a basket and go outside the city for the space of sixteen miles, and collect all the roots, barks, leaves, and fruits which were useless in the art of medicine. Jíwaka did as he was instructed, and after four days he returned and informed the professor that he had met with no substance which in some way or other was not useful in medicine; there was no such thing on earth. Now when the teacher heard this reply, he said, there was no one who could teach the pupil any more,112 and Sekra departed from his mouth. He knew that his pupil had been taught by divine wisdom. Then Jíwaka journeyed to Sákétu, where he found a woman who had a violent pain in her head, which for seven years many learned physicians had vainly tried to cure. He offered to cure her, but she said, “If all the learned doctors had failed to relieve her, it was useless to seek the aid of a little child.” Jíwaka replied that “Science is neither old nor young. I will not go away till the headache is entirely cured.” Then the woman said, “My son, give me relief for a single day: it is seven years since I was able to sleep.” So Jíwaka poured a little medicine into her nose, which went into her brain, and behold, all her headache was gone; and the lady and her relations each gave the physician 4,000 níla-karshas, with chariots, and other, and other gifts in abundance. After this he cured the king of a fistula-in-ano, for which he received a royal reward. There was in Rajagaha a rich nobleman who had a pain in his head like the cutting of a knife. None of his physicians could cure him, so Jíwaka took the noble into a room, sat behind him, and taking a very sharp instrument, opened his skull; and setting aside the three sutures, he seized the two worms which were gnawing his brain with a forceps, and extracted them entire. He then closed up the wound in such a manner that not a single hair was displaced. There was a nobleman in Benares who had twisted one of his intestines into a knot, so that he was not able to pass any solid food. Crowds of physicians came to see him, but none of them dare undertake his case; but Jíwaka said at once he could cure him. He bound his patient to a pillar that he might not move, covered his face, and taking a sharp instrument, without the noble’s being aware of what was going on, ripped open the abdomen, took out his intestines, undid the knot, and replaced them in a proper manner. He then rubbed ointment on the place, put the patient to bed, fed him on rice-gruel, and in three days he was as well as ever. Of course he had an immense fee. After performing other wonderful cures, Jíwaka administered medicine to Budha in the perfume of a flower. The narrative must be given in the words of the MS.:113 “In this way was the medicine given. On a certain occasion when Budha was sick, it was thought that if he were to take a little opening medicine he would be better; and accordingly Ananda went to Jíwaka to inform him that the teacher of the world was indisposed. On receiving this information, Jíwaka, who thought that the time to which he had so long looked forward had arrived, went to the wihára, as Budha was at that time residing near Rajagaha. After making the proper inquiries, he discovered that there were three causes of the disease; and in order to remove them he prepared three lotus flowers, into each of which he put a quantity of medicine. The flowers were given to Budha at three separate times, and by smelling at them his bowels were moved ten times by each flower. By means of the first flower the first cause of disease passed away, and by the other two the second and third causes were removed.” This legend is instructive in many ways. It shows us that 500 b.c. there were colleges in which medicine was taught, and that by special professors of the art, who received large fees from their pupils and kept them under instruction for many years. We find that the profession of medicine brought great honours and rewards to its adepts. We learn that trephining the skull for cerebral diseases was in use, and that the operation of opening the abdomen for bowel obstructions was understood. It reveals the important fact that already the whole of nature had been ransacked for remedies, and that everything was more or less useful to the physician. The great efficacy which the ancients attributed to perfumes is exhibited in the lotus story, which reminds us that when Democritus was aware that he was dying, he desired to prolong his life beyond the festival of Ceres, and accomplished his wish by inhaling the vapour of hot bread. Galen’s description of the pulse in disease is very suggestive of the ancient Sanskrit treatises on the pulse; so much is this the case, it would seem, that either the Hindu physician must have copied from the Roman, or the Roman from the Indian. He speaks of the sharp-tailed or myuri, fainting myuri, recurrent myuri, the goat-leap or dorcadissans, a term derived from the animal dorcas, which, in jumping aloft, stops in the air, and then unexpectedly takes another and a swifter spring than the former. But if after the diastole it recur, and before a complete systole take place, strike the finger a second time; such a pulse is called a reverberating one, or dicrotos, from its beating twice. There is also the undulatory and vermicular pulse, the spasmodic and vibratory, the ant-like or formicans, from its resemblance to the ant (formica), on account of its smallness and kind of motion; there is the hectic, the serrated, the fat and the lean kind. Medical etiquette amongst the Hindus was not overlooked. “A physician who desires success in his practice, his own profit, a good name, and finally a place in heaven, must pray daily for all living creatures, first of the Brahmans and of the cow. The physician should wear his hair short, keep his nails clean266 and cut close, and wear a sweet-smelling dress. He should never leave the house without a cane or umbrella; he should avoid especially any familiarity with women. Let his speech be soft, clear, pleasant. Transactions in the house should not be bruited abroad.”267 114 The dissection and examination of the dead subject is not practised in India, it is contrary to the tenets of the Brahmans; such knowledge of anatomy as the Hindus possess must therefore be little else than conjecture, formed by the study of the bodies of animals. Ainslie says268 that the Rajah of Tanjore, in the year 1826, was a learned and enlightened prince, who was anxious to study the structure of the human body, but was too rigid a Hindu to satisfy his curiosity at the expense of his principles, so he ordered a complete skeleton made of ivory to be sent to him from England. Sir William Jones states that in a fragment of the Ayur-Veda he was surprised to find an account of the internal structure of the human frame.269 The ancient Hindus must have possessed considerable knowledge of surgery. In a commentary on Susruta made by Ubhatta, a Cashmirian, which may be as old, Ainslie thinks, as the twelfth century, many valuable surgical definitions are distinctly detailed. According to the best authorities, says Ainslie, surgery was of eight kinds: chedhana, cutting or excision; lekhana, or scarification and inoculation; vyadhana, puncturing; eshyam, probing or sounding; aharya, extraction of solid bodies; visravana, extracting fluids (by leeches and bleeding); sevana, or sewing; and bhedana, division or excision.270 Twelve species of leeches are enumerated in some of the Sanskrit works on surgery, six of which are poisonous and six useful medicinally.271 Dissection was practised in the most ancient times; but now there is the greatest prejudice against touching the dead body, and modern practitioners of Hindu medicine, where they do not follow the ancient authors, are in a worse condition than they were, on account of the present ignorance of anatomy. All the sages are alleged to have learned their knowledge of medicine from the works of Charaka and Susruta. Those who were taught by Charaka became physicians; those who were followers of Susruta, surgeons. Charaka’s classification and plan of treating diseases are considered superior to those of Susruta, but the latter is prized for his anatomy and surgery. Babhata compiled a compendium of medicine from the works of these great masters of the art, and some three hundred years ago a compilation was made from all the most celebrated works on medicine; this was called Baboprukasa. It is clear and well arranged, and explains the difficulties and obscurities of the ancient Shastres. This was compiled as a text-book for practitioners, and is in high repute with them. Dr. Wise explains the ancient methods of dissecting the human body as given in Hindu text-books. 115 “The dejections are to be removed, and the body washed and placed in a framework of wood, properly secured by means of grass, hemp, sugar-cane reeds, corn-straw, pea-stalks, or the like. The body is then to be placed in still water, in a moving stream, where it will not be injured by birds, fish, or animals. It is to remain for seven days and nights in the water, when it will have become putrid. It is then to be removed to a convenient situation, and with a brush, made of reeds, hair, or bamboo bark, the surface of the body is to be removed so as to exhibit the skin, flesh, etc., which are each in their turn to be observed before being removed. In this manner, the different corporeal parts of the body will be exhibited; but the life of the body is too ethereal to be distinguished by this process, and its properties must therefore be learned with the assistance of the explanations of holy medical practitioners, and prayers offered up to God, by which, conjoined with the exercise of the reasoning and understanding faculties, conviction will be certainly obtained.”272 The Hindus have been great observers of the natural qualities of plants, though they have contributed little or nothing to the study of botany. “The materia medica of the Hindus,” says Hunter,273 “embraces a vast collection of drugs belonging to the mineral, vegetable, and animal kingdoms, many of which have been adopted by European physicians.” They were ingenious pharmacists, and some of their directions for the administration of medicines are most elaborate. They paid scrupulous attention to hygiene, regimen, and diet. Hindu treatises on medicine inform the physician that man’s constitution is occasioned by three dispositions born with him—wadum, pittum, and chestum, or wind, bile, and slime,—and it is the physician’s business to ascertain which of these predominate in any individual. These we may call the three morbiferous diatheses. The pulse is to be felt, not merely at the wrist as we feel it, but in ten different parts of the body. Some of the descriptions of the pulse are very curious. Sometimes, they say, it beats as a frog jumps, or as a creeping rain-worm, or like the motion of a child in a cradle hung in chains; at other times it is like a fowl when running or as a peacock when strutting, and so on. The Yantras or surgical implements known to Susruta were, according to Professor H.?H. Wilson, one hundred and one, and are thus described by him in his most interesting paper on the “Medical and Surgical Sciences of the Hindus.”274 The instruments were classed as Swastikas, Sandan?as, Tálayantras, Nádiyantras, Salákás, and Upayantras. 116 The Swastikas are twenty-four in number; they are metallic, about eighteen inches long, and fancifully shaped like the beaks of birds, etc. They were a sort of pincers or forceps. The Sandan?as were a kind of tongs for removing extraneous substances from the soft parts. The Tálayantras were similar, and were used for bringing away foreign bodies from the ears, nose, etc. The Nádiyantras were tubular instruments, of which there were twenty sorts. They were similar to our catheters, syringes, etc. The Salákás were rods and sounds, etc. Of these there were twenty-eight kinds; some were for removing nasal polypi, so common and so troublesome in India. The Upayantras were such dressings as cloth, twine, leather, etc. The first, best, and most important of all implements is declared to be the Hand. The Man’dalágra was a round pointed lancet; the Vriddhipatra a broad knife; the Arddhadhárás are perhaps knives with one edge; the Trikúrchaka may be a sort of canular trochar, with a guarded point. The Vrihimukha is a perforating instrument. The Kutháriká was probably a bistoury. The Vadi?a is a hooked or curved instrument for extracting foreign substances, and the Danta?anku appears to be an instrument for drawing teeth. The Ará and Karapatra are saws for cutting through bones. The Eshan’i is a blunt straight instrument six or eight inches long—a sort of probe, in fact. The Súchi is a needle. Then the Hindu surgeon had substitutes such as rough leaves that draw blood, pith of trees, skin, leeches, caustics, etc. It is evident that the surgeon of ancient India was not inefficiently armed. The student of surgery had many curious contrivances for acquiring manual dexterity. He practised the art of making incisions on wax spread out on a board; on flowers, bulbs, and gourds. Skins or bladders filled with paste and mire were used for the same purpose. He practised scarification on the fresh hides of animals from which the hair has not been removed; puncturing, or lancing the vessels of dead animals; extraction on the cavities of the same, or fruits with large seeds; sutures were made on skin and leather, and ligatures and bandages on well-made models of the human limbs. Fourteen kinds of bandages are described by Vágbhatta. The cautery was applied by hot seeds, burning substances, or heated plates and probes. Frequently this treatment was used for headaches and for liver and spleen disorders. It was chiefly employed, however, as with the Greeks, for averting bleeding by searing the mouths of the divided vessels. The early Hindus could extract stone from the bladder, and even the f?tus from the uterus. They must have been bold operators, many of their117 operations being actually hazardous. It is a subject deserving of inquiry how they lost the information and skill which they once possessed in so high a degree. The books of medicine and surgery to which reference has been made are undoubtedly most ancient, and it must be remembered were considered as inspired writings. Professor Wilson says: “We must infer that the existing sentiments of the Hindus are of modern date, growing out of an altered state of society, and unsupported by their oldest and most authentic civil and moral, as well as medical institutes.” Many surgical operations which we consider triumphs of our modern practice were invented by the ancient Hindus. They were skilled in amputation, in lithotomy (as we have seen), in abdominal and uterine operations; they operated for hernia, fistula, and piles, set broken bones, and had specialists in rhinoplasty or operations for restoring lost ears and noses. It was a common custom in India for a jealous husband to mutilate the nose of his suspected wife, so that surgeons had opportunities to practise this branch of their art. The ancient Indian surgeons invented an operation for neuralgia which was very similar to the modern division of the fifth nerve above the eyebrow. Veterinary science was understood, and ancient treatises exist, says Hunter,275 on the diseases of elephants and horses. The best era of Hindu medicine was from 250 b.c. to 750 a.d. Its chief centres were found in such Buddhist monastic universities as that of Nalanda, near Gayá.276 Hunter thinks it probable that the ancient Brahmans may have derived their anatomical knowledge from the dissection of the sacrifices; but there is no doubt that the true schools of Indian medicine were the great public hospitals which were established by Buddhist princes like Asoka, famous for his rock edicts, b.c. 251-249. Amongst the fourteen injunctions inscribed by this enlightened sovereign, the first was the prohibition of the slaughter of animals for food or sacrifice, and the second was the provision of a system of medical aid for men and animals and of plantations and wells on the roadside.277 Probably King Asoka’s were the first real hospitals for general diseases anywhere established, as the institutions connected with the Greek temples were not exactly hospitals in our sense of the term; they were more like camps round a mineral spring or spa. The Buddhist physicians would have in these merciful institutions abundant opportunity for the continuous study of disease. Whatever may have been the condition of ancient Hindu anatomy and surgery, in modern times both have now fallen to the lowest point.118 Dislocated joints are replaced and fractured limbs set by a class of men similar to our bone-setters which are found in all nations. Certain of the Mohammedan doctors—Hakeems—sometimes bleed and couch for cataract in a clumsy manner. The village Kabiráj knows but a few sentences of Sanskrit texts, but he has “a by no means contemptible pharmacop?ia,” says Hunter. The rest consists of spells, fasts, and quackery. Physicians (Vitians or Vydias) being Sudras are not allowed to read the sacred medical writings (Vedas); these are guarded with religious awe by the Brahmins; they are permitted, however, access to certain commentaries upon the professional sacred books. When we reflect on the high position which the science and art of the Hindus had attained in very ancient times, it is surprising that we have apparently learned little or nothing from them in connection with the healing art. Max Müller believes that there was an ancient indigenous Hindu astronomy and an ancient indigenous Hindu geometry. Probably the first attempt at solving the problem of the squaring of the circle was suggested, he thinks, by the problem in the Sutras how to construct a square altar that should be of exactly the same magnitude as a round altar. It is scarcely conceivable that so patient and shrewd a people as the Hindus, a people at once so observant and so profoundly speculative, should not have kept pace with the other enlightened nations of the world in the study of medicine and surgery. The vegetation of India is so rich in medicinal herbs that its Materia Medica could hardly be equalled in any other country; so that both by intellect and by location the Hindus should be amongst the foremost professors of the art of medicine. On the contrary, however, the West has everywhere to instruct the East in the medical sciences; and the young Brahmins who flock to the medical schools and universities of Europe find that they have everything to learn from us in this direction. Is this an evidence of arrested development, a retrogression in civilization due to conservatism and a paralysis of the power to keep pace with the world’s advance consequent on the influences of religion and custom? Probably it is. All the medicine of the Hindus is empiricism; their systems exclude anatomy and surgery, without which, as Prof. H.?H. Wilson observes,278 “the whole system must be defective.... We can easily imagine that these were not likely to have been much cultivated in Hindustan, and that local disadvantages and religious prejudices might have proved very serious impediments to their acquirement.” As compared with other ancient nations, Egypt, Chald?a, Greece, and Rome, we are at considerable disadvantage in the attempt to dis119cover what was known and practised of the healing arts in the remoter ages. We have no papyri like the “Book of the Dead” or the great medical papyrus of Ebers; we have no inscriptions on such ancient monuments as Mesopotamia has preserved for us; we have no Sanskrit treatises to be compared for their antiquity and scientific interest with those which have come down to us from ancient Greece. Max Müller says279 that “few Sanskrit MSS. in India are older than 1000 after Christ, nor is there any evidence that the art of writing was known in India much before the beginning of Buddhism, or the very end of the ancient Vedic literature.” Then, again, the Hindu treatises on medical subjects, whether fables or facts, have hitherto been little noticed by Sanskrit scholars.280 The subject is not of general interest, and a man would need to be not only a perfect Sanskrit scholar, but a physician as well, who should attempt such a task as the translation of these treatises in any useful manner. Although ancient India has little to show us in the way of actual written documents and inscriptions, it must not be supposed for a moment that she is deficient in ancient poetry and other works which have been preserved through the ages by the marvellously developed memory of her Brahmins and religious teachers. The ancient Vedic hymns, the Brahmanas, and probably the Sutras, were handed down from before 1000 b.c. by oral tradition. Every, the minutest precaution was taken that not a word, not a letter, not an accent even should be omitted or altered; and Max Müller tells us “this was a sacred duty, the neglect of which entailed social degradation, and the most minute rules were laid down as to the mnemonic system that had to be followed.” The people of India believe that small-pox is under the control of “the goddess Mata,” in whose honour temples abound and fairs are held, where thousands of women and children attend with offerings. The declivities of most of the numerous conical hills present either a reddened stone or temple devoted to “Mata,” with most probably an attendant Brahmin priest. Nearly every village has its goddess of small-pox in the immediate locality, and in many places a large piece of ground is esteemed holy and dedicated to “Mata.” The people do not pray to escape the affliction, unless in seasons when it occurs with more than ordinary violence. They do, however, petition for a mild visitation. But even the loss of an eye does not appear to be viewed as a very serious calamity! “Is there not another eye sufficient for all our purposes?” questioned one of these stoical philosophers.120 “If it were the leg or hand, it would be different, but an eye is immaterial.”281 “The small-pox goddess stands with two uplifted crooked daggers, threatening to strike on the right and left. Before her are a band of executors of her vengeance. Two of them wear red grinning masks, carry black shields, and brandish naked scimitars. White lines, like rays, issue from the bodies of the others, to indicate infection. On the right there is a group of men with spotted bodies, afflicted with the malady; bells are hung at their cinctures, and a few of them wave in their hands black feathers. They are preceded by musicians with drums, who are supplicating the pity of the furious deity. Behind the goddess, on the right, there advances a bevy of smiling young women, who are carrying gracefully on their heads baskets with thanksgiving-offerings, in gratitude for their lives and their beauty having been spared. There is, besides, a little boy with a bell at his girdle, who seems to be conveying something from the right arm of the goddess. This action may possibly be emblematic of inoculation.”282 Another small-pox deity of India described by Mr. Dubois, a missionary,283 is Mah-ry-Umma, who is supposed to incarnate herself in the disease. The natives, when vaccination was first introduced, objected to the practice for fear lest the goddess should be offended, as to prevent the small-pox would imply an objection to her becoming incarnate amongst them. The difficulty was overcome by the suggestion that the vaccination was a mild form of disease by which the goddess had chosen to visit her votaries, so that she might be worshipped with equal respect. “Even Siva is worshipped as a stone, especially that Siva who will afflict a child with epileptic fits, and then, speaking by its voice, will announce that he is Parchanana, the Five-faced, and is punishing the child for insulting his image.”284 Surgeon-General Sir W.?J. Moore, in an article on “The Origin and Progress of Hospitals in India,”285 says that we may form a very good opinion of the condition of the whole of India in ancient times by recalling what was the state of medical relief in most of the native States previous to the institution of medical relief and sanitation in British districts. “Recently, in the Native States, there might be witnessed disease121 proceeding unchecked and uninterfered with, to a degree which certainly would not be allowed at present in civilized Europe. And especially was this evident in surgical disease, as illustrated by the following extract from an official document:286— “‘In former reports I have mentioned the extreme ignorance displayed by native “hukeems” or “vaids” of surgical principles. As a rule, all surgical disease is either wrongly treated, or let alone until treatment is unavailable by these uneducated practitioners. Their errors of omission and commission are not so easily ascertained in their medical, as in their surgical, practice. But in the latter, there is a glaring ignorance, not only from things requisite not being attempted, but from things unnecessary being performed, leading to the serious injury and often to the death of the patient. Thus, during my last tour, I saw at one village, an open scrofulous sore of the neck with the carotid artery isolated, and apparently on the point of giving way. At another village I witnessed an advanced cancer rapidly killing a man. In another place a woman had remained for days with a dislocated jaw, which was easily put in situ. Other forms of dislocation and fracture neglected are almost daily sights. At Bikaneer I amputated the leg of a man who eight months before fell from a camel; the bones of the leg protruding through the skin of the heel, and the foot being driven half-way up the front of the leg, in which position it had been permitted to heal! At the same place a woman was rapidly sinking from the results of extensive sinus of the breast, following abscess, and which only required free incisions for the restoration of health. I also saw a man dying of strangulated hernia, without the slightest idea of or attempt at relief on the part of the native practitioners. And so on, throughout almost the whole range of surgery, I have from time to time witnessed the most lamentable results from the malpractices, or from the absence of practice on the part of the Native Doctors.’ “As mentioned in the above extract, the errors of omission and commission are not so easily ascertained in medical as in surgical cases. But the great majority of those stricken by disease, such as inflammations and fevers, derived as little benefit from medicine as did the Romans when, according to Pliny, physicians were banished from the Imperial City during many years. For few indeed of the higher class and comparatively better educated ‘hukeems’ or ‘vaids’ would minister to the poor who were unable to pay their fees; and of the122 populations of India the great majority are and always were poor. Steeped in continually augmenting superstition and ignorance, if the poor received medical aid at all, it was from the hands of the equally ignorant and superstitious village ‘Kabiraj,’ who, unlike their more noble Aryan predecessors, did not even ‘draw physic from the fields,’ although they may have used a charm, such as a peacock’s feather tied round the affected part! If the poor got well, they got well; and as most diseases have a tendency to terminate in health, many did recover. If a fatal termination resulted, it was attributed to nusseeb or destiny, or the gods were blamed. Insane persons, if harmless, were allowed to ramble about the streets; if violent, they were chained in the most convenient place. The jails of the Native States were also in an unparalleled unsanitary condition, for no medical aid whatever was provided; as Coleridge said of Coldbath Fields, these jails might have given His Satanic Majesty a hint for improving Hades. Fatalism combined with ignorance, and a consequent utter unbelief in any measures of sanitation, resulted in the absence of all measures of precaution during epidemics of contagious disease. During the prevalence of small-pox, children might be seen by scores, in every stage of the disease, playing or lying about the streets. During an epidemic of cholera, not one precautionary measure was ever adopted—except by the wild Bheels, who invariably moved, leaving their villages for a time for the open jungle; thus forestalling the most approved method of preventing cholera adopted for British troops, viz., marching away from the infected area. “Not only were there no hospitals proper, or contagious hospitals, or asylums for the insane, but neither were there any asylums for lepers. Regarding the latter, difference of opinion would appear to have existed among scientific investigators, then as now, as to whether leprosy is a contagious disease or not. Then as now, in some parts of the country, lepers were permitted to live among the people; in other localities they were thrust out from the towns or villages, generally forming a little colony on the adjoining plain. This expulsion of lepers from the towns and villages, then as now, was not so much the result of fear of contagion, as the Brahminical dread of contact with impurity. Then as now, these outcasts lived miserably in mud or grass huts, obtaining food by begging. When tired of life, or when being old or disabled their relatives were tired of keeping them, they often submitted to ‘sumajh’ or burial alive. But they more frequently threatened to perform ‘sumajh’ with the view of extracting alms from the charitable, who were induced to believe that the death of the leper would be credited to them, unless they bought off the sacrifice. ‘Sumajh,’ or leper burial alive, has123 been practised comparatively recently in more than one of the Native States. “The Native principalities are now much more advanced in most respects than they were only a few years back. By coming into contact with the progressive civilization of adjoining British districts, the Governments of Native States were forced to advance; for they felt their existence would be imperilled. And this advance was most materially assisted by the successful endeavours made by the Indian Government to secure the better education of the young Indian princes and nobles. The Imperial Government also, and especially under Lord Mayo, enunciated care for the sick as one of the most urgent duties of the feudatory rulers of India. Owing to such measures, aided by the personal influence of the Political, and the assistance of the Medical Officers attached to the Native Courts, a hospital or dispensary has, amongst other features of civilization, been established at every large capital; while in some States ramifications of such central establishments have rendered the people almost as well off, in the matter of medical relief, as those in British territory. As it will not be necessary to refer again, except incidentally, to the Native States, I may here remark that all the medical institutions are supported at the cost of the Durbar or Government of each State. They are, as a rule, superintended by the European Medical Officer attached to the Political Residency, aided by native assistants. “Although the recent condition of the Native States represents what formerly prevailed all over Hindustan, it must not be understood that the people were devoid of charity; only the charity of the well-to-do classes did not take the form of medical relief. In the absence of a qualified medical profession recognised by the State, the confidence felt in the physic of the ‘vaids’ and ‘hukeems’ was something akin to the faith of Byron, who without any such excuse designated medicine as ‘the destructive art of healing.’ Moreover, the organization of hospitals was not understood, and the necessary discipline of such establishments was foreign to the habits and ideas of the people. The poor (who now throng the hospitals of India), having had no experience of the advantages of such institutions, would probably not have resorted thereto had hospitals and dispensaries been opened under native control. So suspicious were the people on the first opening of a hospital in one of the Native States, that sweetmeats, of which they are very fond, were ordered to be given daily to each patient, as an encouragement to attend! So in former times the charitable preferred spending their money in sinking wells, in constructing serais or rest-houses for travellers, in endowing temples, and in feeding the poor, particularly 124 Brahmins. In this manner, enormous sums have been disbursed and are still expended, especially in food for the destitute. This laudable charity of the Indians, although often confined to their own caste people, and to occasions of family festival, is one of the reasons why it has never been thought necessary to establish any system of poor-law relief in British India. Of late years native charity has been often directed towards building and endowing medical institutions, and many Indian gentlemen have given most liberally for such purposes.” \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3068/84795.html","bookId":986,"book":{"id":986,"title":"The Origin and Growth of the Healing Art","description":"简介： The History of Medicine is a terra incognita to the general reader, and an all but untravelled region to the great majority of medical men. On special occasions, such as First of October Addresses at the opening of the Medical Schools, or the Oration...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3068","creation":"Aug 1, 2019 12:24:05 AM","modification":"Aug 1, 2019 12:24:05 AM"}}
