{"id":41549,"no":20,"title":"CHAPTER V. LATER ROMAN MEDICINE.","content":"The Eclectic and Pneumatic Sects.—Galen.—Neo-Platonism.—Oribasius and ?tius.—Influence of Christianity and the Rise of Hospitals.—Paulus ?gineta.—Ancient Surgical Instruments. The Sect of the Pneumatists. Athen?us of Cilicia about a.d. 69 founded at Rome the Sect of the Pneumatists, at the time when the Methodists enjoyed their greatest reputation. They admitted an active principle of an immaterial nature, to which they gave the name of πνε?μα, spirit. This principle caused the health or the diseases of the body, and the sect was named from it. Athen?us was a Stoic, who had adopted the doctrines of the Peripatetics. In addition to the pneuma, he developed the theory of the elements, and in them recognised the positive qualities of the animal frame. The union of heat and moisture is necessary for the preservation of health. Heat and dryness cause acute diseases, cold and moisture produce phlegmatic disorders, cold and dryness give rise to melancholy. At death, all things dry up and become cold.488 Great services to pathology were rendered by the Pneumatic sect. Several new diseases were discovered by them; but they over refined their doctrines, especially that of fevers and the pulse; they thought this alternate contraction and dilatation of the arteries was the operation of the pneuma, or spirit passing from the heart. Diastole or dilatation pushes forward the spirit, the systole or contraction draws it back.489 The Sect of the Eclectics Derived their name from the fact that they selected from each of the other sects the opinions that seemed most probable. They seem to have agreed very nearly, if they were not actually identical with the sect known as the Episynthetics. They endeavoured to join the tenets of the Methodici to those of the Empiric and Dogmatic sects, and to reconcile their differences.490 228 Amongst the most famous of the school were Agathinus of Sparta (1st cent. a.d.), who founded the Episynthetic sect, though Galen refers to him as among the Pneumatici. He was a pupil of Athen?us, and the tutor of Archigenes. None of his writings are extant. Theodorus was a physician mentioned by Pliny.491 Archigenes of Apam?a, who practised in Rome (a.d. 98-117), was exceedingly famous. He is mentioned several times by Juvenal,492 and was the most celebrated of the sect. He wrote on the pulse, and attempted the classification of fevers. Very few fragments of his works remain. He was the first to treat dysentery with opium. Aret?us of Cappadocia (1st cent, a.d.) was a celebrated Greek physician who wrote on diseases, detailing their symptoms with great accuracy and displaying great skill in diagnosis. He was very little biased by any peculiar opinions, and his observations on diseases and their treatment have stood the light of our modern medical science better than those of many of the ancient authorities. He was acquainted with the fact that injuries to the brain cause paralysis on the opposite side; and his classification of mental diseases is as good as our own. His knowledge of anatomy was considerable, and in his physiology he shows how much more the ancients knew of this branch of science than is generally supposed. He was acquainted with the operation of tracheotomy, and remarked its partial success.493 He considered elephantiasis to be contagious, and gives this caution: “That it is not less dangerous to converse and live with persons affected with this distemper, than with those infected with the plague; because the contagion is communicated by the inspired air.”494 Herodotus (there were several of the name) was a physician of repute in Rome (about a.d. 100). He was a pupil of Athen?us or Agathinus, and wrote several medical books which are quoted by Galen and Oribasius. He first recommended pomegranate root as a remedy for tape-worm, and described several infectious diseases.495 Heliodorus (about a.d. 100) was a famous surgeon, and wrote on amputations and injuries of the head. His operation for scrotal hernia is described by Haeser as “a brilliant example of the surgical skill of the Empire.” He treated stricture of the urethra by internal section. Cassius Felix lived in the first century after Christ, and was the author of a curious set of eighty-four medical questions and their answers. He was also called Cassius Iatrosophista. 229 Leonidas of Alexandria lived in the second or third century after Christ, was a distinguished surgeon, who operated on strumous glands, and amputated by the flap operation. Claudius Galenus, commonly called Galen, or, as medi?val writers named him, Gallien, was a very celebrated physician and philosopher, who was born at Pergamos in Asia, a.d. 131, under Hadrian. His father, Nicon, was an architect and geometrician, a highly cultivated and estimable man. His mother was a passionate scold, who led her husband a worse life than Xantippe led Socrates. Nicon spared no pains to give his son an education which should fit him to be a philosopher, and in his fifteenth year he was a pupil of the Stoic, Platonist, Peripatetic, and Epicurean philosophies. In his seventeenth year his father, in consequence of a dream, changed his intentions concerning his son’s profession, and determined that he should study medicine. His first tutors were ?schrion, Satyrus, and Stratonicus. He studied the doctrines of all the sects of medicine in the school of Alexandria, and travelled in Egypt, Greece, Asia, and Italy. He devoted himself to none of the schools of medicine whose doctrines he had studied, but struck out a path for himself. On his return to Pergamos, he was selected to take charge of the wounded gladiators, a position which afforded him opportunities for studying surgical operations. He filled this post with great reputation and success. When he was thirty-four years old he went to Rome for the first time, remaining there four years, and acquiring a great reputation for his knowledge of anatomy, physiology, and medicine. He was connected with many persons of great influence, and his popularity at last became so great that it excited the ill-will of his professional brethren, especially as by his lecturing, writing, and disputing, his name was constantly before them. So great was the ill-feeling they bore towards him that he was afraid of being poisoned. He was called the “wonder speaker” and the “wonder worker.” “The greatest savant of all the ancient physicians,” says Sprengel, “was Galen. He strove to introduce into medicine a severe dogmatism, and to give it a scientific appearance, borrowed almost entirely from the Peripatetic school. The enormous number of his works, the systematic order which distinguishes them, and the elegance of their style, won over, as by an irresistible charm, the indolent physicians who succeeded him, so that during many ages his system was considered as immovable.”496 For thirteen centuries his name and influence dominated the medical profession in Europe, Asia, and Africa; and this influence, under the name of Galenism, was paramount in the eighteenth century, notwith230standing the discovery of the circulation of the blood and other great advances in science. Galen collected and co-ordinated all the medical knowledge which previous physicians and anatomists had acquired. He was no mere collector of, or compiler of other men’s works; but he enriched previous acquirements by his own observation, and was in every way a man greatly in advance of his time. “A great and profound spirit,” says Daremberg, “he was philosopher as well as physician, realising the aspiration of Hippocrates when he said that the physician who should be also a philosopher must be the equal of the gods. A dialectician like Aristotle, a psychologist like Plato, who glorified his work by his genius for interpreting nature and life, his position as philosopher would have been beside those men, if his devotion to medicine had not called him to another sphere of intellectual activity.” Nevertheless, Galen did in fact occupy an exalted position in the history of philosophy, not only in the West, but amongst the Arabians. His encyclop?dic knowledge, his spirit of observation, and his influence on the thought of the middle ages, compel a comparison with Aristotle. It was thus that the vast body of medical material collected by the various sects and schools was analysed by the penetrating genius of Galen, whose philosophical and scientific mind was able to extract the good and permanent from the worthless and ephemeral material, which encumbered the literature of the healing art. He fell under the domination of none of the schools, though in one sense he may be said to have leaned towards the Dogmatists, “for his method was to reduce all his knowledge, as acquired by the observation of facts, to general theoretical principles.”497 He endeavoured to draw the student of medicine back to Hippocrates, of whom he was an admirer and expounder. The labours of Galen had the effect of destroying the vitality of the old medical sects; they became merged in his system, and left off wrangling amongst themselves to imitate the new master who had arisen. A crowd of new writers found in the works of Galen abundant material for their industry. Partly in consequence of this jealousy, and partly from the fact that in a.d. 167 a pestilence broke out in Rome, he left the city privately, and returned to his native country. Galen, as a profound anatomist and physiologist, recognised final causes, a purpose in all parts of the bodies which he dissected; and it is, as Whewell points out,498 impossible for a really great anatomist to do other than recognise these. He cannot doubt that the nerves run along the limbs, in order that they may convey the impulses of the will231 to the muscles: he cannot doubt that the muscles are attached to the bones, in order that they move and support them. The development of this conviction, that there is a purpose in the parts of animals of a function to which every organ is subservient, greatly contributed to the progress of physiology; it compelled men to work till they had discovered what the purpose is. Galen declared that it is easy to say with some impotent pretenders that Nature has worked to no purpose. He has an enthusiastic scorn of the folly of atheism.499 “Try,” he says, “if you can imagine a shoe made with half the skill which appears in the skin of the foot.” Somebody had expressed a desire for some structure of the human body over that which Nature has provided. “See,” he exclaims, “what brutishness there is in this wish. But if I were to spend more words on such cattle, reasonable men might blame me for desecrating my work, which I regard as a religious hymn in honour of the Creator. True piety does not consist in immolating hecatombs, or in bearing a thousand delicious perfumes in His honour, but in recognising and loudly proclaiming His wisdom, almighty power, love and goodness. The Father of universal nature has proved His goodness in wisely providing for the happiness of all His creatures, in giving to each that which is most really useful for them. Let us celebrate Him then by our hymns and chants! He has shown His infinite wisdom in choosing the best means for contriving His beneficent ends; He has given proof of His omnipotence in creating everything perfectly conformable to its destination.” Anatomy must have reached a high standard before Galen’s time, as we learn from his corrections of the mistakes and defects of his predecessors. He remarks that some anatomists have made one muscle into two, from its having two heads; that they have overlooked some of the muscles in the face of an ape in consequence of not skinning the animal with their own hands. This shows that the anatomists before Galen’s time had a tolerably complete knowledge of the science. But Galen greatly advanced it. He observes that the skeleton may be compared to the pole of a tent or the walls of a house. His knowledge of the action of the muscles was anatomically and mechanically correct. His discoveries and descriptions even of the very minute parts of the muscular system are highly praised by modern anatomists.500 He knew the necessity of the nerve supply to the muscle, and that the brain originated the consequent motion of a muscle so supplied, and proved the fact experimentally by cutting through some of the nerves and232 so paralysing the part.501 Where the origin of the nerve is, there, he said, it is admitted by all physicians and philosophers is the seat of the soul. This, he adds, is in the brain and not in the heart. The principles of voluntary motion were well understood, therefore, by Galen, and he must have possessed “clear mechanical views of what the tensions of collections of strings could do, and an exact practical acquaintance with the muscular cordage which exists in the animal frame:—in short, in this as in other instances of real advance in science, there must have been clear ideas and real facts, unity of thought and extent of observation, brought into contact.”502 He observed that although a ligature on the inguinal or axillary artery causes the pulse to cease in the leg or in the arm, the operation is not permanently injurious, and that even the carotid arteries may be tied with impunity. He corrects the error of those who, in tying the carotids, omitted to separate the contiguous nerves, and then wrongly concluded that the consequent loss of voice was due to compression of the arteries. Galen was the first and greatest authority on the pulse, if not our sole authority; for all subsequent writers simply transferred his teaching on this subject bodily to their own works.503 Briefly it was as follows: “The pulse consists of four parts, of a diastole and a systole, with two intervals of rest, one after the diastole before the systole, the other after the systole before the diastole.”504 His therapeutics were based on these two principles:—“1. That disease is something contrary to nature, and is to be overcome by that which is contrary to the disease itself; and 2. That nature is to be preserved by that which has relation with nature.”505 The affection contrary to nature must be overcome, and the strength of the body has to be preserved. But while the cause of the disease continues to operate, we must endeavour to remove it; we are not to treat symptoms merely, for they will disappear when their cause is removed, and we must consider the constitution and condition of the patient before we proceed to treat him. “Such as are essentially of a good constitution are such in whose bodies heat, coldness, dryness, and moisture are equally tempered; the instruments of the body are composed in every part of due bigness, number, place, and formation.”506 He gives in succeeding chapters the233 signs of a hot, cold, dry, moist, hot and dry, hot and moist, cold and dry, and cold and moist brain; of a heart overheated, of a heart too cold, of a dry and of a moist heart, of a heart hot and dry, hot and moist, cold and moist, cold and dry heart. The liver is described under the same conditions. Galen’s surgery is not of very great importance, but he is credited with the resection of a portion of the sternum for caries and with ligature of the temporal artery.507 He applied the doctrine of the four elements to his theories of diseases. “Fire is hot and dry; air is hot and moist; for the air is like a vapour; water is cold and moist, and earth is cold and dry.” Galen’s pathology is explained by Sprengel thus: when the body is free from pain, and performs its functions without obstacle, it is in a state of health; when the functions are disturbed, there is a state of disease. The effect of disturbed functions is the affection (π?θο?); that which determines this injury is the cause of the disease, the sensible effects of which are the symptoms. Diseases (δι?θεσι?) are unnatural states either of the similar parts or of the organs themselves. Those of the similar parts proceed in general from the want of proportion among the elements, of which one or two predominate. In this manner arise eight different dyscrasies, or ill states of the constitution. Symptoms consist either in deranged function or vicious secretions. The internal causes of disease depend almost always on the superabundance or deterioration of the humours. Galen calls every disorder of the humours a putridity; it is due to a stagnant humour being exposed to a high temperature without evaporating. Thus suppuration and the sediment of urine are proofs of putridity. In every fever there is a kind of putridity which gives out an unnatural heat, which becomes the cause of fever, because the heart and the arterial system take part in it. Choulant enumerates eighty-three works of Galen which are acknowledged as genuine, nineteen which are doubtful, forty-five spurious, nineteen fragments; and fifteen commentaries on different books of Hippocrates; and more than fifty short pieces and fragments for the most part probably spurious, which are still lying unpublished in the libraries of Europe. Besides these Galen wrote many other works, the titles of which only remain to us; so that it is estimated that altogether the number of his different books cannot have been less than five hundred.508 He wrote, not on medicine only, but on ethics, logic, grammar, and other philosophical subjects; he was therefore amongst234 the greatest and most voluminous authors that have ever lived.509 His style is elegant, but he is given to prolixity, and he abounds in quotations from the Greek writers. Philip of C?sarea was a contemporary of Galen about the middle of the second century after Christ. He belonged to the sect of the Empirici, and defended their doctrines. It is probable that he wrote on marasmus, on materia medica, and on catalepsy; but as there were other physicians of the same name, there is much uncertainty as to their identity. After the death of Galen came the Gothic invasions over the civilized world, and all but extinguished the learning of the times. Medicine lingered still in Rome, Constantinople, and Alexandria, but individuals rather than schools and sects kept it alive; it struggled to exist amidst the grossest ignorance, superstition, and magical practices, till it was re-invigorated by the Saracens. Saints Cosmas and Damian (circ. 303) were brothers who studied the sciences in Syria, and became eminent for their skill in the practice of medicine. As they were Christians, and eager to spread the faith which they professed, they never took any fees, and thus came to be called by the Greeks Anargyri (without fees). The two brothers suffered martyrdom under the Diocletian persecution, and have ever since been famous as workers of miracles of healing and patrons of medical science. Their relics were everywhere honoured, and a church built in Rome by St. Gregory the Great preserves them to this day. Dr. Meryon points out510 that Gregory the Great enunciated one great doctrine of hom?opathy: “Mos medicin? est ut aliquando similia similibus, aliquando contraria contrairiis curet. Nam s?pe calida calidis, frigida frigidis, s?pe autem frigida calidis, calida frigidis sanare consuevit.” Alexander of Tralles, though one of the most eminent ancient physicians, believed in charms and amulets. Here are a few specimens. For a quotidian ague, “Gather an olive leaf before sunrise, write on it with common ink κα, ροι, α, and hang it round the neck” (xii. 7, p. 339); for the gout, “Write on a thin plate of gold, during the waning of the moon, με?, θρε?, μ?ρ, φ?ρ, τε?ξ, βα?ν, χω?κ” (xi. l. p. 313). He exorcised the gout thus: “I adjure thee by the great name ?α? Σαβα?θ,” that is, ??????? ???????? and a little further on: “I adjure thee by the holy names ?α?, Σαβα?θ, ?δωνα?, ?λω?,” that is ??????? ???????? ??????? ???????.511 235 Neoplatonism had its influence on medicine. Plotinus (a.d. 205-270), its great father, said, when dying, “I am striving to bring the God which is in us into harmony with the God which is in the Universe.” The early Christians began to tell the world that the God within the soul of man and the God which is in the Universe are one and the same being, of absolute righteousness, power and love. Plotinus preached a gospel to the philosophic world; the first Christians preached theirs to every creature. Neoplatonism taught the world that spirit was meant to rule matter: it was not enough that the early Christian exhibited to mankind man transformed as the result of his intimate relationship to the Divine, the philosophic world demanded wonders, something above nature, as a proof of the Divine character of the revelation; then, as Kingsley explains,512 we begin to enter “the fairy land of ecstasy, clairvoyance, insensibility to pain, cures produced by the effect of what we now call mesmerism. They are all there, these modern puzzles, in those old books of the long bygone seekers for wisdom.” Thus mankind, for ever wandering in a circle, began by these ecstasies and cures to retrace its steps towards the ancient priestcraft. These wonders were nothing to the Egyptian, Babylonian, and Jewish sorcerers; they had traded in them for ages. Antyllus (circ. 300 a.d.) is mentioned by Oribasius, and is said by H?ser to have been one of the greatest of the world’s surgeons; for aneurism he tied the artery above and below the sac, and evacuated its contents; for cataract, and for the cure of stammering, he invented appropriate treatment; and he employed something very much like tenotomy for contractures. He is the earliest writer whose directions are extant for performing the operation of tracheotomy. He must have been a man of great talent and originality. He practised the removal of glandular swellings of the neck and ligatured vessels before dividing them, giving directions for avoiding the carotid artery and the jugular vein. It is a striking proof of the high state which surgery had reached at this period that bones were resected with freedom; the long bones, the lower jaw, and the upper jaw were dealt with in a manner generally considered to be brilliant examples of modern surgery. Oribasius (a.d. 326-403) was born at Pergamos. By command of the Emperor Julian the Apostate he made a summary from the works of all preceding physicians who had written upon the Healing Art. Having made a collection of some seventy medical treatises, he reduced them into one, adding thereto the results of his own observations and experience. He also wrote for his friend Eunapius two books on diseases and their remedies, besides treatises on anatomy and236 an epitome of the works of Galen.513 He was called the Ape of Galen, and Freind says the title was not undeserved. He wrote in Greek, and though a mere compiler was capable of better things. His pharmacy was that of Dioscorides. He did some original work, as he was the first to write a description of the drum of the ear and the salivary glands. In his works also, we find the first description of the wonderful disease called lycanthropy, a form of melancholia, or insanity,514 in which the affected persons believe themselves to be transformed into wolves, leaving their homes at night, imitating the behaviour of those animals, and wandering amongst the tombs. His great work he entitled Collecta Medicinalia. When Julian died, Oribasius fell into disgrace, and was banished. He bore his misfortunes with great fortitude, and so gained the esteem and love of the “barbarians” amongst whom he lived that he was almost adored as a god. He was ultimately restored to his property and honour. Jacobus Psychristus lived in the time of Leo I. Thrax (a.d. 457-474), was a very famous physician of Constantinople, who was called “the Saviour,” on account of his successful practice. Adamantius of Alexandria, an Iatrosophist, was a Jewish physician, who was expelled, with his co-religionists, from Alexandria, a.d. 415. He embraced Christianity at Constantinople. He wrote on physiognomy. Iatrosophista was the ancient title of one who both taught and practised medicine. Archiater (chief physician) was a medical title under the Roman Empire, meaning “the chief of the physicians,” and not “physician to the prince,” as some have explained.515 Meletius (4th cent. a.d.), a Christian monk, wrote on physiology and anatomy. Nemesius, Bishop of Emissa (near the end of the fourth century), wrote a treatise on the Nature of Man, which is remarkable for a proof that the good Churchman came very near to two discoveries which were made long after his time. He says that the object of the bile is to help digestion, to purify the blood, and impart heat to the body. Freind says516 that in this we have the foundation of that which Sylvius de la Bo? with so much vanity boasted he had invented himself. He adds that “if this theory be of any use in physic, Nemesius has a very good title to the discovery.” The Bishop described the circulation of the blood in very plain terms considering the state of physiology at that time. 237 “The motion of the pulse takes its rise from the heart, and chiefly from the left ventricle of it; the artery is, with great vehemence, dilated and contracted by a sort of constant harmony and order. While it is dilated it draws the thinner part of the blood from the next veins, the exhalation or vapour of which blood is made the aliment for the vital spirit. But while it is contracted it exhales whatever fumes it has through the whole body and by secret passages. So that the heart throws out whatever is fuliginous through the mouth and the nose by expiration.”517 Lucius wrote on pharmacy in the first century. Marcellus Empiricus (4th cent.) wrote a work on pharmacy, in Latin, which contains many charms and absurdities. ?tius was a Greek medical writer, who probably was a Christian of the sixth century. He was a native of Amida in Mesopotamia, and studied medicine at Alexandria. He wrote the Sixteen Books on Medicine, one of the most valuable medical treatises of antiquity; though containing little original matter, it includes numerous extracts from works which have since perished.518 Many of the opinions of ?tius on surgery are excellent; he recommended the seton, and lithotomy for women. Bleeding arteries he treated by twisting, as we do now, and by tying. He advised irrigation with cold water in the treatment of wounds. In lithotomy he recommends that the knife should be guarded by a tube. He treated worms with pomegranate bark, as has been recently revived.519 He was the first Greek medical writer amongst the Christians who gives specimens of the spells and charms so much used by the Egyptian Christians in surgical cases; thus, in case of a bone sticking in the throat, the physician was to cry out in a loud voice, “As Jesus Christ drew Lazarus from the grave, and Jonah out of the whale, thus Blasius, the martyr and servant of God, commands, ‘Bone, come up or go down!’”520 Influence of Christianity At the time when the civilizations of Greece and Rome had reached their highest perfection, the poison of sensual indulgence, elevated into a religion, had instilled itself into the whole social life of the people: in every incident of life, in business, in pleasure, in literature, in politics, in arms, in the theatres, in the streets, in the baths, at the games, in the decorations of his home, in the ornaments and service of his table, in the very conditions of the weather and the physical phenomena of nature521 it met the Roman, and tainted every action of his life. Archdeacon Farrar, in the first chapter of his Early Days of238 Christianity, draws an awful picture of the corruption of the old world at the moment when it was confronted by Christianity. The parent had absolute power over the person of his child, and could destroy its life at its pleasure. Unfortunate children were exposed on the roadside or left to perish in the waters of the Tiber. The slave was the mere chattel of his master, and Roman women treated their servants with the utmost barbarity. Juvenal has painted for us in terrible colours the vices and shameless conduct of the women, and the selfish luxury and degrading pleasures of the men; the nameless crime, which was the disgrace of Greek and Roman civilization, was looked upon as merely a question of taste; and St. Paul, in the first chapter of the Epistle to the Romans, has recorded for all time what was the highest the most perfect civilization Paganism has ever produced was able to effect for the moral condition of the people. To the Roman and Greek world, saturated with the most perfect philosophy the world has ever known, and adorned by the art which has ever since been the despair of its imitators, there presented itself the Catholic Church, and before the sun’s embrace sublime “Night wist Her work done, and betook herself in mist To marsh and hollow, there to bide her time Blindly in acquiescence.”522 The enemies of Christianity have affected to lament the effects produced by the religion of Jesus on the art and science of the pagan world; it has been said that the early Christians became so indifferent to the welfare of their bodies that they no longer sought medical aid when sick, but either resigned themselves to death or sought remedies in prayers. It is quite possible that, at the soul’s awakening at the first revelation of the infinite importance of the spiritual life, men did somewhat neglect the ailments of the flesh and forget them in the effort to realize the things of the spirit. It is perfectly true that the natural sciences were not likely to make much progress in such a condition of things. But if Christians were careless of their own health, it is not less certain that they were intensely solicitous for that of their poor and friendless neighbours. The peculiar constitution of the Roman Empire, which was but a military tyranny, greatly contributed to its fall, and the collapse would have come earlier had it not been for Christianity. The Empire had very little cohesion; the Church had a cohesive force, such as the world had never experienced before, and the Church availed herself of all the facilities which the Empire possessed of keeping up, from centre to circumference, the circulation of the spirit of solidarity239 which has ever animated the Catholic body. Of course there was little reason to expect the Church to be very favourably disposed towards the philosophies of old Greece and Rome; they had done little for the moral and social welfare of the people, and the Church had a better system than these could exhibit: but when St Augustine appeared, there was found a modus vivendi between the noblest Platonism and the purest and loftiest Christian theology. He pointed the way towards a Christian science, and Europe ultimately realized it. It was found in the Schoolmen. Modern science is the legitimate child of Scholasticism, though it is unsparing in its abuse of its parent. The slave to the ancient Roman was simply a beast who was able to speak. When such beasts became unprofitable, because through sickness or old age they could no longer work, they were frequently turned out to perish. Cato advised the agriculturists to sell their old and sick slaves when no longer able to work, just as he recommended them to dispose of worn-out and diseased cattle and worthless implements of husbandry.523 The Emperor Claudius caused slaves who were thus cruelly treated to be proclaimed freemen. It was the merciful and charitable conduct of the early Christians towards slaves, of whom such vast numbers helped to people the Roman Empire, that caused the doctrines of the Gospel to spread so rapidly throughout the Roman world. The slave found in the Gospel of Christ the first system of religion and philosophy which took any account of the poor, the helpless, and the slave; the rich and cultured saw in the teachings of the Church of Christ the only system which embraced mankind as a whole. Juvenal524 has indicated for us the value of a slave’s life in these times. “Go, crucify that slave. For what offence? Who the accuser? Where the evidence? For when the life of man is in debate, No time can be too long, no care too great. Hear all, weigh all with caution, I advise. ‘Thou sniveller! is a slave a man?’ she cries. ‘He’s innocent! be’t so; ’tis my command, My will; let that, sir, for a reason stand.’” Although there is evidence that hospitals for the reception and treatment of sick and destitute persons were established in India in very early times,525 and though we know that these were attached to240 some of the temples of ancient Greece, and the Romans had convalescent institutions for sick slaves and soldiers, it cannot be doubted that we owe to Christianity the hospital as it exists amongst us at the present day. Christianity taught the world not only that God is the Father of mankind, the pagan world already knew Him as Zeus pater, but that as His children we are the brethren and sisters of each other. The Church in Rome, in the third century, says Eusebius,526 supported “widows and impotent persons, about a thousand and fifty souls who were all relieved through the grace and goodness of Almighty God.” St. Basil the Great (a.d. 379) founded at C?sarea a vast hospital, which Nazianzen calls a new city, and was named after him Basiliades. The same author thought “it might deservedly be reckoned among the miracles of the world, so numerous were the poor and sick that came thither, and so admirable was the care and order with which they were served.”527 In this institution St. Gregory of Nazianzus said, “disease became a school of wisdom, and misery was changed into happiness.” Chastel relates that (a.d. 375) Edessa possessed a hospital with 300 beds, and there were many similar institutions in the East. St. Jerome says that the widow Fabiola founded the first Christian infirmary in Rome, at the end of the fourth century. St. Paula, a Roman widow, in whose veins ran the blood of the Scipios, the Gracchi, and Paulus ?milia, and of Agamemnon, was born in 347 a.d., and was one of the many noble Christian women who devoted their wealth and their lives to the poor, the suffering, and the helpless, in the early days of Christianity. She distributed immense alms, and built a hospital on the road to Jerusalem, and also a monastery for St. Jerome and his monks, whom she maintained, besides three monasteries for women;528 she carried the sick to their beds in her arms, and with her own hands washed their wounds, as St. Jerome tells us. In Italy, Gaul, and Spain, many asylums for sick and poor persons were built and maintained. Nor were their benefits confined to Christians; for Jews, slaves, and freemen were welcomed to these temples of charity. It is impossible in the limits of this work to trace fully the progress of the hospital movement; enough has been said to prove, as Baas, the Agnostic historian of medicine, admits,529 that “Hospitals proper, in our sense of the term, did not originate till Christian times.” When the plague raged at Alexandria, Eusebius tells us,530241 “Many of our brethren, by reason of their great love and brotherly charity, sparing not themselves, cleaved one to another, visited the sick without weariness or heed-taking, and attended upon them diligently, cured them in Christ, which cost them their lives, and being full of other men’s maladies, took the infection of their neighbours.” Such was the initial impulse which Christian charity applied to the healing art; trace we now its splendid results in medi?val times. In the Middle Ages almost all the monasteries and religious houses had a hospital of one kind or another attached to them; they had not only places of entertainment for pilgrims, but institutions for the treatment and care of the sick and poor. This care of the diseased and helpless was not left to the civil administration alone, but formed part of the regular work of the Church of the middle ages, and by ancient regulation this was placed under the control of the Bishops. The Council of Vienne ordained that if the administrators of a hospital, lay or clerical, became relaxed in the exercise of their charge, proceedings should be taken against them by the Bishops, who should reform and restore the hospital of their own authority. The Council of Trent granted to Bishops the power of visiting the hospitals. This connection between the hospitals and the ecclesiastical power was acknowledged by the Christian sovereigns of Europe from the earliest times. The Emperor Justinian, for example, gave authority over the hospitals to the Bishops; the property of the hospitals was considered as Church property, and thus was protected in troublous times by the sanctity of religion.531 The Council of Chalcedon placed such clergy as lived in establishments where orphans, the aged, and infirm were received and cared for under the authority of the Bishops, and makes use of the expression that this regulation was according to ancient custom. In the time of the Council of Chalcedon a hospital (ξενοδοχε?ον) seems to have been a common adjunct of a church.532 Originally appropriated to the reception of strangers, its use was afterwards extended to the relief of the poor and also of the sick, as at Alexandria, where, in a.d. 399, we read that “the priest Isidore being four-score years old, was at that time governor of the hospital.”533 In connection with the story of Hypatia at Alexandria, we learn that the Parabolani was the name given to the clergy of the lowest order, who were appointed to attend to the sick, particularly in contagious disorders, from which circumstance, says Fleury,534 their name was derived, because it signifies persons who expose themselves. 242 Moschion Diorthortes (about the 6th cent.) was a specialist in diseases of women. He wrote a manual for midwives based on the work of Soranus. His description of the uterus is similar to the treatise of that physician. He refutes the opinion of the ancients on the situation of male infants on the right, and of females on the left. He has well indicated the signs of imminent abortion. He made a great number of observations on the physical education of children which must have been of great importance to his time. He justly explained the reason for the cessation of the catamenia after severe diseases: the system cannot afford the waste. He anticipated the modern discovery that sterility is a disease common to women and men. He adhered to the principles of the Methodical school, and the doctrines of strictum and laxum.535 Paulus ?gineta, one of the most famous of the Greek writers on medicine, was born in the island of ?gina, probably in the latter half of the seventh century after Christ. He was an Iatrosophist, and a Periodeutes, or one who travelled about in the exercise of his profession. He wrote several books on medicine, of which one has come down to us, called De re Medica Libri Septem, or “Synopsis of Medicine in seven books.” Dr. Adams, in his translation of this famous work for the Sydenham Society, gives us the original introduction to the treatises of this physician, who informs us that:— 243 “In the first book you will find everything that relates to hygiene, and to the preservation from, and correction of, distempers peculiar to the various ages, seasons, temperaments, and so forth; also the powers and use of the different articles of food, as is set forth in the chapter of contents. In the second is explained the whole doctrine of fevers, an account of certain matters relating to them being premised, such as excrementitious discharges, critical days, and other appearances, and concluding with certain symptoms which are the concomitants of fevers. The third book relates to topical affections, beginning from the crown of the head, and descending down to the nails of the feet. The fourth book treats of those complaints which are external and exposed to view, and are not limited to one part of the body, but affect various parts. Also, of intestinal worms and dracunculi. The fifth treats of the wounds and bites of venomous animals; also of the distemper called hydrophobia, and of persons bitten by dogs which are mad, and by those which are not mad; and also of persons bitten by men. Afterwards it treats of deleterious substances, and of the preservatives from them. In the sixth book is contained everything relating to surgery, both what relates to the fleshy parts, such as the extraction of weapons, and to the bones, which comprehends fractures and dislocations. In the seventh is contained an account of the properties of all medicines, first of the simple, then of the compound, particularly of those which I have mentioned in the preceding six books, and more especially the greater, and as it were, celebrated preparations; for I did not think it proper to treat of all these articles promiscuously, lest it should occasion confusion, but so that any person looking for one or more of the distinguished preparations might easily find it. Towards the end are certain things connected with the composition of medicines, and of those articles which may be substituted for one another, the whole concluding with an account of weights and measures.” The most valuable and interesting part of this work is the sixth book. The whole treatise is chiefly a compilation from the great physicians who preceded Paulus, but the sixth book contains some original matter. This great Byzantine physician must have possessed considerable skill in surgery. His famous treatise on midwifery is now lost; it procured for him amongst the Arabs the title of “the Obstetrician,” and entitles him to be called the first of the teachers of the accoucheur’s art. Celebrated equally in the Arabian and Western schools, he exercised an enormous influence in the development of the medical arts. Throughout the Middle Ages he maintained his great popularity, and his surgical teaching was the basis of that of Abulcasis, which afforded to Europe in the Middle Ages her best surgical knowledge. He was the first writer who took notice of the cathartic properties of rhubarb.536 After the time of Paulus of ?gina the art of surgery slept for five hundred years; imitators of the ancient masters and compilers of their works alone remained to prove that it was still alive, but no progress was made. The religious orders employed the best methods they knew for the relief of physical suffering, but naturally it was not their work to perfect the healing art. In the Middle Ages, when so much of the medical and surgical practice was in the hands of the monks, particularly of the Benedictine order, many abuses crept in; and at last the practice of surgery by the clergy was forbidden in 1163 by the Council of Tours. The office of royal physician in the Frankish court in the sixth century was not unattended with risk. When Austrigildis, wife of King Guntram, died of the pestilence in the year 580, she expressed in her last moments a pious desire that her doctors, Nicolaus and Donatus, should be put to death for not having saved her; and her husband, feeling it incumbent upon him to carry out her wishes, had them duly executed.537 244 Ancient Surgical Instruments. Bramhilla, surgeon to Francis II. of Austria, said that surgical instruments were invented by Tubal Cain, because the Bible says he was “the instructor of every artificer in brass and iron.” The saw is a tool of great antiquity. Pliny attributes its invention to D?dalus, or to his nephew Perdix, who was also called Talos; he was supposed to have imitated it from the jaw of a serpent, with which he had been able to cut a piece of wood. The invention of forceps was attributed to Vulcan and the Cyclopes. When used for extracting teeth, the Greeks called them ?δοντ?γρα; for extracting arrow-heads and other weapons from the wounded in battle, the particular form employed was called ?ρδιοθ?ρα. In the collection of domestic objects discovered by M. Petrie in the Egyptian ruins of Kahun, flint saws close upon 5,000 years old may be seen.538 Pincers and tweezers are made by the natives of Timor-laut from the bamboo; they are used for pulling out the hair from the face. The natives of the Darling River, New South Wales, use fine bone needles for boring through the septum of the nose. The book on Wounds of the Head is admitted by the best critics to be a genuine work of Hippocrates. We find in that treatise that he used the trepan, as he speaks of a σμικρ?ν τρ?πανον, a small trepan. There must also have been a larger one, a πρ?ων, or saw, which had a περ?οδο?, or circular motion, and which was probably the trephine, and a πρ?ων χαραcτ??, or jagged saw, which is held to be the trepan; and he gives instructions to the operator to withdraw the instrument frequently and cool both it and the bone with cold water, and to exercise all vigilance not to wound the living membrane.539 Splints were used by the Greeks for fractured limbs; they were called ν?ρθηκα?. Cutting for the stone is spoken of in the ?ρκο?, which is attributed to Hippocrates. Celsus describes lithotrity, or crushing the stone by the instrument invented by Ammonios the λιθοτ?μο?, i.e. lithotomist. Asclepiades practised tracheotomy. Many surgical instruments have been discovered in Herculaneum and Pompeii. There is a speculum vagin? with two branches and a travelling yoke for them driven by a screw, and a speculum ani opening by pressure on the handles; there is a forceps of curious construction for removing pieces of bone from the surface of the brain in cases of fracture of the skull. Mr. Cockayne says:540— 245 “It has been specially considered by Prof. Benedetto Vulpes [1847], who thinks it may also have been intended to take up an artery. The Greeks, he observes, as appears by an inscription dug up near Athens, were able to tie an artery in order to stop h?morrhage, and words implying so much are found in a treatise of Archigenes (a.d. 100), existing in MS. in the Laurentian library at Florence, ‘the vessels carrying (blood) towards the incision must be tied or sewed up.’ Near the end of the sixteenth century a French surgeon was the first to recover the ligature of the artery, and the instrument he used was very similar to the forceps in the Museum at Naples.” A curious pair of forceps has also been found, without a parallel among modern surgical instruments; the blades have a half turn, and the grip is toothed and spoon-shaped when closed. By construction it is suited for introduction into some internal cavity, and for holding firm and fast some excrescence there. Professor Vulpes finds it well calculated for dealing with the excrescences which grow upon the Schneiderian membrane covering the nasal bones, or such as come on the periphery of the anus, or the orifice of the female urethra; especially such as having a large base cannot be tied.541 There is further an instrument for tapping the dropsical, described by Celsus542 and Paulus ?gineta. It was somewhat altered in the middle of the seventeenth century by Petit. An instrument suited to carry off the dropsical humours by a little at a time on successive days, as Celsus and Paulus ?gineta recommended, has also been dug up. Rust and hard earth, which cannot safely be removed, have blocked up the canal of the relic, and rendered conclusions less certain.543 “The probe, ‘specillum,’ μ?λη, is reputed by Cicero to have been invented by the Arcadian Apollo, who also was the first to bind up a wound. Seven varieties are figured in the work of Professor Vulpes in one plate, with ends obtuse, spoon-shaped, flat and oval, flat and square, flat and divided. The catheter of the ancients is figured by the same writer. It was furnished with a bit of wood to be drawn out by a thread, to prevent the obstructive effects of capillary attraction, and to fetch the urine after it when withdrawn. It is of bronze, and elastic catheters seem to be of modern invention.” There are, or were in 1847, eighty-nine specimens of pincers in the Naples Museum. Hooks, hamuli, cauterising instruments, a spatula, a silver lancet, a small spoon for examining a small quantity of blood after venesection.246 There are cupping vessels of a somewhat spherical shape, from which air was exhausted by burning a little tow. A fleam for bleeding horses just like that used at the present time, a bent lever of steel for raising the bones of the head in cases of depressed fracture. Professor Vulpes gives figures of eight steel or iron knives used for various surgical purposes, and of a small plate to be used as an actual cautery. ANCIENT SURGICAL INSTRUMENTS. Fig. 1. The Saw used by Carpenters. Fig. 2. A Small Saw. Fig. 3. The Modiolus, or Ancient Trephine. Fig. 4. The Terebra, or Trepan, called Abaptiston. Fig. 5. The Augur used by Carpenters. Fig. 6. The Terebra, or Trepan, which is turned round by a thong bound tight about its middle. Fig. 7. The Augur, or Trepan, which is turned round by a bow. Fig. 8. A Terebra, or Trepan, which is turned round by a thong on a cross-beam. Fig. 9. A Terebra, or Trepan, which has a ball in its upper end, by which it is turned round. Fig. 10. A Terebra, or Trepan, which is turned round by a cross piece of wood, or handle, on its upper end. (From Adams’ Hippocrates, vol. i.) \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3068/84802.html","bookId":986,"book":{"id":986,"title":"The Origin and Growth of the Healing Art","description":"简介： The History of Medicine is a terra incognita to the general reader, and an all but untravelled region to the great majority of medical men. On special occasions, such as First of October Addresses at the opening of the Medical Schools, or the Oration...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3068","creation":"Aug 1, 2019 12:24:05 AM","modification":"Aug 1, 2019 12:24:05 AM"}}
