{"id":41551,"no":22,"title":"BOOK IV. CELTIC, TEUTONIC, AND MEDI?VAL MEDICINE. CHAPTER I.","content":"MEDICINE OF THE DRUIDS, TEUTONS, ANGLO-SAXONS, AND WELSH. Origin of the Druid Religion.—Druid Medicine.—Their Magic.—Teutonic Medicine.—Gods of Healing.—Elves.—The Elements.—Anglo-Saxon Leechcraft.—The Leech-book.—Monastic Leechdoms.—Superstitions.—Welsh Medicine.—The Triads.—Welsh Druidism.—The Laws of the Court Physicians.—Welsh Medical Maxims.—Welsh Medical and Surgical Practice and Fees. Medicine of the Druids. The learned men of the Celto-Britannic regions were called Druids. They were the judges, legislators, priests, and physicians, and corresponded to the Magi of the ancient Persians and Chald?ans of Syria. The etymology of the name is uncertain. The old derivation from δρ?σ, an oak, is considered fanciful, and that from the Irish draoi, druidh \u003d a magician, an augur, is by some authorities preferred. It is probable that they derived their knowledge from association with Greek colonists of Marseilles, as such writing as they used was in Greek characters, and they taught the doctrine of the immortality of the soul and a philosophy which Diodorus Siculus says was similar to that of the teaching of Pythagoras. Clement of Alexandria compared their religion to Shamanism. Whatever it was, it did not differ probably very widely from other systems which pretended to put its priests in direct communication with gods and demons. Its priests, says Sprengel, were simply impostors who pretended to exclusive knowledge of medicine and other sciences. Their women practised sorcery and divination, but by their medical skill were able to afford great assistance to the wounded in war. Plants were collected and magical properties ascribed to them. Lying-in women sought the aid of these Druidesses, who seem to have been wise women, somewhat after the character of gypsies. Mela says these women were called Sen?. They pretended to cure the most incurable diseases and to raise tempests by their incantations.611 The Druids communicated their knowledge to initiates only, and they celebrated their mystic rites under groves of oaks. Whatever grew on that tree was considered a divine gift; their highest veneration was reserved for270 the mistletoe, which they called All-Heal, and which they considered a panacea for all diseases. Three other plants, called Selago, a kind of club-moss, or perhaps hedge-hyssop, Samulus, the brookweed or winter cress, and Vervain, were held to be sacred plants. The mistletoe must be gathered fasting, the gatherer must not look backward while doing it, and he must take it with his left hand. The branches and herbs were immersed in water, and the infusion then became possessed of the property of preserving the drinkers from disease. When the Selago and Vervain were gathered, a white garment was worn, sacrifices of bread and wine were offered, and the gatherer, having covered his hand with the skirt of his robe, cut up the herbs with a hook made of a metal more precious than iron, placed it in a clean cloth, and preserved it as a charm against misfortunes and accidents.612 Strutt says: “Faint is the light thrown upon the methods pursued by the Druids in preparing their medicines. Some few hints, it is true, we meet with, of their extracting the juice of herbs, their bruising and steeping them in water, infusing them in wine, boiling them and making fumes from them, and the like; it also appears that they were not ignorant of making salves and ointments from vegetables.”613 In Britain the magical juggles, ceremonies, and rites were carried to a greater excess than in any other Celtic nation. They made a great mystery of their learning, their seminaries were held in groves and forests and the caverns of the earth.614 Strutt thinks that their alphabet was derived from the Greek merchants, who came frequently to the island. Pliny says that the ancient Britons were much addicted to the arts of divination.615 Diodorus Siculus describes one of their methods. “They take a man who is to be sacrificed and kill him with one stroke of a sword above the diaphragm; and by observing the posture in which he falls, his different convulsions, and the direction in which the blood flows from his body, they form their predictions, according to certain rules which have been left them by their ancestors.”616 Strutt says:617271 “The people were the more particularly inclined to make application to them for relief, because they thought that all internal diseases proceeded from the anger of the gods, and therefore none could be so proper to make intercession for them as the priest of those very deities from whom their afflictions came; for this cause also they offered sacrifices when sick; and if dangerously ill, the better to prevail upon the gods to restore them to health, a man was slain and sacrificed upon their altars.” The custom of human sacrifices doubtless afforded the Druids some knowledge of human anatomy. Their surgery was of a simple but useful character, and had to do principally with setting broken bones, reducing dislocations, and healing wounds; all this, of course, combined with magical ceremonies.618 Pliny refers to the magical practices of the Druids, and states that the Emperor Tiberius put them down, “and all that tribe of wizards and physicians.”619 He adds that they crossed the ocean and “penetrated to the void recesses of Nature,” as he calls Britannia. There, he tells us, they still cultivated the magic art, and that with fascinations and ceremonials so august that Persia might almost seem to have communicated it direct to Britain. “The worship of the stars, lakes, forests, and rivers, the ceremonials used in cutting the plants Samiolus, Selago, and Mistletoe, and the virtues attributed to the adder’s egg,” are thought by Ajasson to indicate the connection between the superstitions of ancient Britain and those of Persia.620 Medicine of the Teutons. The Goths and other German peoples were from early times brought into relationship with the Romans, and had acquired some of the advantages of their civilization. Originally their medical notions were not dissimilar to those of other barbaric nations. On the one hand, there was the belief in disease as the manifestation of the anger of supernatural beings who could be propitiated by prayers and magic rites; while on the other, the use of medicinal plants and the ministrations of old women were not less prominent. Tacitus points out the important part played by the women in the life of the Germans, and the good influence they exerted as nurses to the sick. The Roman general Agricola, who was in Britain from a.d. 78-84, induced the noblemen’s sons to learn the liberal sciences.621 They must have acquired some knowledge of Greek and Roman medicine. In the earliest ages, says Baas,622 women only seem to have practised272 medicine among the Germans and Celts. Medicine was deemed a profession unworthy of men, and it is not till the twelfth century that physicians are spoken of. Probably old women or Druidesses in ancient times were the only doctors of these peoples. Puschmann says that the Norwegians had a number of highly paid doctors in the tenth century, and that already a medical tax existed.623 In the time of the Vikings wounds were well attended to, amputations performed, and wooden legs were not uncommon. “Mention,” says Puschmann, “is also made of the operation called gastroraphy” (or sewing up a wound of the belly or some of its contents);624 lithotomy was performed successfully. Wodan is the all-pervading creative and formative power who gives shape and beauty, wealth, prosperity, and all highest blessings to men.625 Eir was the goddess of physicians; Odin was a doctor; Brunhilda was a doctoress. The ancient German nations offered to the gods sacrifices of human food, which they believed they enjoyed. These sacrifices were offered as thanksgivings or to appease their anger. When a famine or a pestilence appeared amongst the people, they concluded that the gods were angry, and they proceeded to propitiate them with gifts.626 Animal and especially human sacrifices had the most binding and atoning power.627 The Teutonic elves are good-natured, helpful beings. They fetch goodwives, midwives, to assist she-dwarfs in labour, and have much knowledge of occult healing virtues in plants and stones.628 But elves sometimes do mischief to men. Their touch and their breath may bring sickness or death on man and beast. Lamed cattle are said in Norway to be bewitched by them, and their avenging hand makes men silly or half-witted.629 Teutonic peoples have always had great faith in the normal influence of pure water. The Germans believed in the magical properties of water hallowed at midnight of the day of baptism. Such water they called heilawac. They believed it to have a wonderful power of healing diseases and wounds, and of never spoiling.630 The salt which is added to holy water in the church will account for its keeping properties. But it is in medicinal springs, such as are called Heilbrunn, Heilborn, Heiligenbrunnen, that273 Teutonic faith has always exhibited the strongest devotion. Sacrifices, says Grimm, were offered at such springs. When the Wetterau people begin a new jug of chalybeate water, they always spill a few drops first on the ground. Grimm thinks this was originally a libation to the fountain sprite.631 The Christians replaced water-sprites by saints. Fire was regularly worshipped, and there are many superstitions still existing which point to this phase of Teutonic religion. “The Esthonians throw gifts into fire, as well as into water. To pacify the flame they sacrifice a fowl to it.”632 Sulphur has always had an evil reputation. Murrain amongst cattle could only be got rid of by a Needfire. On the day appointed for banishing the pest, there must in no house be any flame left on the hearth, but a new fire must be kindled by friction after the manner of savages.633 Teutonic children born with a caul about their head are believed to be lucky children. The membrane is carefully treasured, and sometimes worn round the babe as an amulet. The Icelanders imagine that the child’s guardian spirit resides in it; midwives are careful not to injure it, but bury it under the threshold. If any one throws it away, he deprives the child of its guardian spirit.634 Anglo-Saxon Medicine. It is difficult to discover what was the state of learning existing amongst the ancient Saxons before their conversion to Christianity. We know that soon after this event schools were established in Kent, with such good results that Sigebert (a.d. 635) established seminaries on the same plan in his own dominions. After this, as Bede informs us, there flourished a great number of learned men.635 Theodore, Archbishop of Canterbury, came over into Britain a.d. 669, and did much to improve the learning of the country. He was accompanied by many professors of science, one of whom, the monk Adrian, instructed a great number of students in the sciences, especially teaching the art of medicine and establishing rules for preserving the health.636 Aldhelm, who according to Bede was a man of great erudition and was “wonderfully well acquainted with books,” very greatly contributed to the spread of education. The state of medicine in England in Anglo-Saxon times is said by274 Strutt637 to have been very degraded. Medicine consisted chiefly of nostrums which had been handed down from one age to another, and their administration was usually accompanied with whimsical rites and ceremonies, to which the success was often in a great measure attributed. The most ignorant persons practised the profession, and particularly old women, who were supposed to be the most expert and were in high repute amongst the Anglo-Saxons. After the establishment of Christianity the clergy succeeded to the business carried on by the ancient dames, and it must be admitted that the superstitious element in their treatment of disease was not less prominent than in that of their venerable predecessors. Bede says638 that Theodore, Archbishop of Canterbury, taught that “It is very dangerous to let blood on the fourth day of the moon, because both the light of the moon and the tides are upon the increase.” Before any medicine could be administered, fortunate and unfortunate times, the changes of the moon and appearance of the planets, had to be considered. Many medicinal books were amongst those which ?lfred the Great caused to be translated into the Saxon tongue. Some of them were embellished with illustrations of herbs, etc., so that about the tenth century some knowledge of medicine was diffused, and Strutt thinks there may have been persons whose only profession was medicine and surgery, besides the ecclesiastics who practised these arts, before the close of the Saxon government.639 The Anglo-Saxons, even after their conversion to Christianity, retained much of the superstition of their ancestors; they placed faith in astrology, and had some acquaintance with astronomy, which they obtained from the Romans, from whom they learned most of the arts and sciences. They had a good knowledge of botany, and their MS. were embellished with excellent drawings of the herbs and plants.640 Theodore brought with him a large collection of books, and set up schools in Kent, where many students were instructed in the sciences and the knowledge and application of medicine and the rules for the preservation of the health.641 The Rev. Oswald Cockayne has given us, in his translation of the Saxon Leech Book, a very curious and interesting citation from Helias, Patriarch of Jerusalem, who wrote to King ?lfred in answer to his request to be furnished with some good recipes from the Holy Land: 275 “Patriarch Helias sends these to King ?lfred:642__ “So much as may weigh a penny and a half, rub very small, then add the white of an egg, and give it to the man to sip. It (balsam) is also very good in this wise for cough and for carbuncle, apply this wort, soon shall the man be hole. This is smearing with balsam for all infirmities which are on a man’s body, against fever, and against apparitions, and against all delusions. Similarly also petroleum is good to drink simple for inward tenderness, and to smear on outwardly on a winter’s day, since it hath very much heat; hence one shall drink it in winter; and it is good if for any one his speech faileth, then let him take it, and make the mark of Christ under his tongue, and swallow a little of it. Also if a man become out of his wits, then let him take part of it, and make Christ’s mark on every limb, except the cross upon the forehead, that shall be of balsam, and the other also on the top of the head. Triacle (θηριακ?ν) is a good drink for all inward tendernesses, and the man, who so behaveth himself as is here said, he may much help himself. On the day on which he will drink Triacle, he shall fast until midday, and not let the wind blow on him that day: then let him go to the bath, let him sit there till he sweat; then let him take a cup, and put a little warm water in it, then let him take a little bit of the triacle, and mingle with the water, and drain through some thin raiment, then drink it, and let him then go to his bed and wrap himself up warm, and so lie till he sweat well; then let him arise and sit up and clothe himself, and then take his meat at noon, and protect himself earnestly against the wind that day; then, I believe to God, that it may help the man much. The white stone is powerful against stitch, and against flying venom, and against all strange calamities; thou shalt shave it into water and drink a good mickle, and shave thereto a portion of the red earth, and the stones are all very good to drink of, against all strange uncouth things. When the fire is struck out of the stone, it is good against lightenings and against thunders, and against delusion of every kind; and if a man in his way is gone astray, let him strike himself a spark before him. He will soon be in the right way. All this Dominus Helias, Patriarch at Jerusalem, ordered one to say to King ?lfred.” Mr. Cockayne tells us in his preface643 that Helias sent Alfred276 “a recommendation of scammony, which is the juice of a Syrian convolvulus, of gutta ammoniacum,644 of spices, of gum dragon, of aloes, of galbanum, of balsam, of petroleum, of the famous Greek compound preparation called θηριακ? and of the magic virtues of alabaster. These drugs are good in themselves, and such as a resident in Syria would naturally recommend to others.” This very singular and instructive fact concerning King ?lfred is one of the most interesting things in Mr. Cockayne’s valuable work. As to the age of the MS., the translator sets it down about a.d. 900. The sources of the information he ascribes to Oxa, Dun, and Helias; there is a mixture of the Hibernian and Scandinavian elements also. Some of the prescriptions are traceable to Latin writers, and large extracts are made from the Greek physicians. Paulus ?gineta is responsible for the long passage on hiccupings (or Hicket, as the Leech Book calls the malady), as chapter xviii. is almost identical with Paulus ?gin., lib. ii. sect. 57. Mr. Cockayne thinks that the number of passages the Saxon drew from the Greek would make perhaps one-fourth of the first two books. Whether they came direct from the Greek manuscripts or at second hand as quotations, it is not possible to say. Quoting M. Brechillet Jourdain,645 Mr. Cockayne says that it is shown that the wise men of the Middle Ages long before the invention of printing possessed Latin translations of Aristotle; there is every probability, therefore, that they would be familiar with the works of the Greek physicians. Some of them could translate Greek. If an Italian or Frenchman could acquire Greek and turn it into Latin, a Saxon might do as much. Bede and his disciples could certainly have done so. Bede says that Tobias, Bishop of Rochester, was as familiar with the Greek and Latin languages as with his own. “It appears, therefore,” concludes Mr. Cockayne, “that the leeches of the Angles and Saxons had the means, by personal industry or by the aid of others, of arriving at a competent knowledge of the contents of the works of the Greek medical writers. Here, in this volume, the results are visible. They keep, for the most part, to the diagnosis and the theory; they go back in the prescriptions to the easier remedies; for whether in Galen or others, there was a chapter on the ε?π?ριστα, the ‘parabilia,’ the resources of country practitioners, and of course, even now, expensive medicines are not prescribed for poor patients.”646 In the very valuable Saxon Leechdoms647 we have an excellent account of the state of medicine as practised in England before the Norman Conquest. The Leech Book (L?ce Boc)648 is a treatise on medicine which probably belonged to the abbey of Glastonbury. The manu277script, thinks Mr. Cockayne, belonged to one Bald, a monk. The book, says the editor, is learned in a literary sense, but not in a professional, for it does not really advance man’s knowledge of disease or of cures. He may have been a physician, he was certainly a lover of books—“nulla mihi tam cara est optima gaza quam cari libri.” The work seems to imply that there was a school of medicine among the Saxons. In the first book, p. 120, we read that “Oxa taught us this leechdom”; in the second book, p. 293, we are told concerning a leechdom for lung disease that “Dun taught it”; again we find “some teach us.” So far as book learning was concerned, there was certainly a sort of medical teaching. It was perhaps merely taken from the Greek by means of a Latin translation of Trallianus, Paulus of ?gina, and Philagrios. As examples of reasonable treatment take that for hare-lip (or hair-lip as in the text): “Pound mastic very small, add the white of an egg, and mingle as thou dost vermilion, cut with a knife the false edges of the lip, sew fast with silk, then smear without and within with the salve, ere the silk rot. If it draw together, arrange it with the hand, anoint again soon.”649 Against pediculi quicksilver and old butter are to be mingled together in a mortar, and the resulting salve to be applied to the body. This is precisely the mercurial ointment of modern pharmacy used for the same purpose. Religion, magic, and medicine were oddly mixed up by our Saxon forefathers. Thus the Leech Book tells us650 for the “dry” disease we should “delve about sour ompre (i.e. sorrel dock), sing thrice the Pater noster, jerk it up, then while thou sayest sed libera nos a malo, take five slices of it and seven peppercorns, bray them together, and while thou be working it, sing twelve times the psalm Miserere mei, Deus, and Gloria in excelsis deo, and the Pater noster; then pour the stuff all over with wine, when day and night divide, then drink the dose and wrap thyself up warm.” Here is an exorcism for fever. “A man shall write this upon the sacramental paten, and wash it off into the drink with holy water, and sing over it.... In the beginning, etc. (John i. 1). Then wash the writing with holy water off the dish into the drink, then sing the Credo, and the Paternoster, and this lay, Beati immaculati, the psalm (cxix.), with the twelve prayer psalms, I adjure you, etc. And let each of the two651 then sip thrice of the water so prepared.”652 The demon theory of disease was still in force; even at Glastonbury we find the following exorcism:653278 “For a fiend sick man, when a devil possesses the man or controls him from within with disease; a spew drink, lupin, bishopwort, henbane, cropleek; pound these together, add ale for a liquid, let stand for a night, add fifty libcorns (or cathartic grains), and holy water. A drink for a fiend sick man, to be drunk out of church bell.”654 “Githrife, cynoglossum, yarrow, lupin, betony, attorlothe, cassock, flower de luce, fennel, church lichen, lichen, of Christ’s mark or crosse, lovage; work up the drink off clear ale, sing seven masses over the worts, add garlic and holy water, and drip the drink into every drink which he will subsequently drink, and let him sing the psalm, Beati immaculati, and Exurgat, and Salvum me fac, Deus,655 and then let him drink the drink out of a church bell, and let the mass priest after the drink sing this over him: Domine, sancte pater omnipotens.”656 Again, “For the phrenzied; bishopwort, lupin, bonewort, everfern,657 githrife, elecampane; when day and night divide, then sing thou in the church litanies, that is, the names of the hallows or saints, and the Paternoster; with the song go thou, that thou mayest be near the worts and go thrice about them, and when thou takest them go again to church with the same song, and sing twelve masses over them, and over all the drinks which belong to the disease, in honour of the twelve apostles.”658 The Leech Book has “a salve against nocturnal goblin visitors,” a remedy “against a woman’s chatter,” which is to go to bed, having eaten only a root of radish; “that day the chatter cannot harm thee.”659 Red niolin, a plant which grows by running water, if put under the bolster, will prevent the devil from scathing a man within or without. There is “a lithe drink against a devil and dementedness,” and a cure for a man who is “overlooked.” If the man’s face is turned toward the doctor when he enters the sick room, “then he may live; if his face be turned from thee, have thou nothing to do with him.” “In case a man be lunatic, take of a mere-swine or porpoise, work it into a whip, swinge the man therewith; soon he will be well. Amen.”660 A salve against temptation of the devil contains many herbs, must have nine masses said over it, and must be set under the altar for a while; then it is very good for every temptation of the fiend, and for a man full of elfin tricks, and for typhus fever.661 279 Cancer is to be cured with goat’s gall and honey. Our forefathers made very light of such trifles as cancer and lunacy, it will be perceived. Joint pains (rheumatism) are cured by singing over them, “Malignus obligavit; angelus curavit; dominus salvavit,” and then spitting on the joints. “It will soon be well with him,” adds the Saxon leech, in his usual cheery manner.662 Pepper is to be chewed for the toothache; “it will soon be well with them.” Horrible applications of pepper, salt, and vinegar were recommended to be applied to sore eyes. If the eyes were swollen, “take a live crab, put his eyes out, and put him alive again into the water, and put the eyes on the neck of the man who hath need; he will soon be well.” There are light drinks “against the devil and want of memory,” “for a wild heart,” and “pain of the maw.” There is treatment for the bite of “a gangwayweaving spider,” and remedies in case a woman cannot “kindle a child.” Neuralgia and megrims are not the new disorders they are generally supposed to be, as we find remedies “for headache, and for old headache, and for ache of half of the head.” “Poison” was lightly treated with holy water and herbs. Snake-bite was cured with ear-wax and a collect. For bite of an adder you said one word “Faul”; “it may not hurt him.” “Against bite of snake, if the man procures and eateth rind which cometh out of paradise, no venom will damage him. Then said he that wrote this book that the rind was hard gotten.” If, by chance, one drank a creeping thing in water, he was to cut into a sheep instantly and drink the sheep’s blood hot. Lest a man tire with much travelling over land, he must take mugwort and put it into his shoe, saying, as he pulls up the root, “I will take thee, artemisia, lest I be weary on the way;” and having taken it, he must sign it with the sign of the cross. “Over the whole face of Europe, while the old Hellenic school survived in Arabia, the next to hand resource became the established remedy, and the searching incision of the practised anatomist was replaced by a droning song.”663 Such medical learning as existed amongst the Angles, Saxons, and Goths was found only in a corrupted state in the monasteries. As we have seen, the herbal remedies were, for the most, useless or worse, and the treatment was so intermingled with magic ceremonies and religious superstitious uses, that Greek science, so far as it related to the healing art, was all but smothered by absurdities. 280 “The Saxon leeches were unable to use the catheter, the searching knife, and the lithotrite; they knew nothing of the Indian drugs, and were almost wholly thrown back on the lancet wherewith to let blood, and the simples from the field and garden.”664 “For a very old headache” one must “seek in the maw of young swallows for some little stones, and mind that they touch neither earth, nor water, nor other stones; look out three of them, put them on the man; he will soon be well. They are good for head ache and for eye wark, and for the fiend’s temptations, and for the night mare, and for knot, and for fascination, and for evil enchantments by song.”665 As a specimen of a regular Anglo-Saxon prescription, take the following, as given in the MS. Cott.: Vitellius; c. 3:— For the foot-adle (the gout), “Take the herb datulus, or titulosa, which we call greater crauleac—tuberose isis. Take the heads of it and dry them very much, and take thereof a pennyweight and a half, and the pear tree and Roman bark, and cummin, and a fourth part of laurel-berries, and of the other herbs half a pennyweight of each, and six peppercorns, and grind all to dust, and put two egg-shells full of wine. This is true leechcraft. Give it the man till he be well.” Venesection was in use, but it must have often done more harm than good, as its use was regulated, not so much by the necessities of the case as by the season and courses of the moon. Bede gives a long list of times when bleeding was forbidden. In the Cottonian library there is a Saxon MS., which tells us that the second, third, fifth, sixth, ninth, eleventh, fifteenth, seventeenth, and twentieth days of the month are bad for bleeding. Medicine of the Welsh. The Welsh claim that medicine was practised as one of “the nine rural arts,” by the ancient Cymry, before they became possessed of cities and a sovereignty, that is, before the time of Prydain ab ?dd Mawr, that is to say, about a thousand years before the Christian era.666 As in other nations of antiquity, the practice of medicine was in the hands of the priests, the Gwyddoniaid, or men of knowledge: they were the depositaries of such wisdom as existed in the land, and they practised almost entirely by means of herbs. The science of plants was one of the three sciences, the others being theology and astronomy.667 In the following Triad (one of the poetical histories of the Welsh bards) we learn that,281—“The three pillars of knowledge, with which the Gwyddoniaid were acquainted, and which they bore in memory from the beginning: the first was a knowledge of Divine things, and of such matters as appertain to the worship of God and the homage due to goodness; the second, a knowledge of the course of the stars, their names and kinds, and the order of times; the third, a knowledge of the names and use of the herbs of the field, and of their application in practice, in medicine, and in religious worship. These were preserved in the memorials of vocal song, and in the memorials of times, before there were bards of degree and chair.”668 The Welsh do not appear to have had any gods of medicine or to have pretended to derive their knowledge of the healing art from any divinities. In the reign of Prydian the Gwyddoniaid were divided into three orders, Bards, Druids, and Ovates. The Ovates occupied themselves especially with the natural sciences. In the Laws of Dyvnwal Moelmud, “medicine, commerce, and navigation” were termed “the three civil arts.”669 This legislator lived about the year 430 b.c., at which early period it would seem that the art of medicine was encouraged and protected by the State.670 As Hippocrates lived 400 b.c., it has been thought possible that the British Ovates may have learned something of his teaching from the Phoceans, who traded between Marseilles and Britain. Later we have proof that the physicians of Myddvai held the Father of Medicine in great esteem. It is customary amongst the English to ridicule the pretensions of the Welsh to the high antiquity of their knowledge of the arts and sciences, but classical writers bear witness to the wisdom and learning of the Druids. Strabo speaks of their knowledge of physiology. Cicero was acquainted with one of the Gallic Druids, who was called Divitiacus the ?duan, and claimed to have a thorough knowledge of the laws of nature. Pliny mentions the plants used as medicines by the Druids, such as the mistletoe, called Oll iach, omnia sanantem, or “All heal,” the selago (Lycopodium selago, or Upright Fir Moss), and the Samolus or marshwort (Samolus valerandi, or Water Pimpernel).671 One of the Medical Triads in the Llanover MS. is that by Taliesin; it runs thus:— “There are three intractable substantial organs: the liver, the kidney, and the heart. “There are three intractable membranes: the dura mater, the peritoneum, and the urinary bladder. 282 “There are three tedious complaints: disease of the knee joint, disease of the substance of a rib, and phthysis; for when purulent matter has formed in one of these, it is not known when it will get well.” Howel Dda (or the good) in the year 930 a.d. compiled the following laws of the Court Physician:— “Of the mediciner of the household, his office, his privilege, and his duty, this treats. 1. The twelfth is the mediciner of the household. 2. He is to have his land free: his horse in attendance: and his linen clothing from the queen, and his woollen clothing from the king. 3. His seat in the hall within the palace is at the base of the pillar to which the screen is attached, near which the king sits. 4. His lodging is with the chief of the household. 5. His protection is, from the time the king shall command him to visit a wounded or sick person, whether the person be in the palace or out of it, until he quit him, to convey away an offender. 6. He is to administer medicine gratuitously to all within the palace, and to the chief of the household; and he is to have nothing from them except their bloody clothes, unless it be for one of the three dangerous wounds, as mentioned before; these are a stroke on the head unto the brain; a stroke in the body unto the bowels; and the breaking of one of the four limbs; for every one of these three dangerous wounds the mediciner is to have nine score pence and his food, or one pound without his food, and also the bloody clothes. 7. The mediciner is to have, when he shall apply a tent, twenty-four pence. 8. For an application of red ointment, twelve pence. 9. For an application of herbs to a swelling, four legal pence. 10. For letting blood, fourpence. 11. His food daily is worth one penny half-penny. 12. His light every night is worth one legal penny. 13. The worth of a medical man is one penny. 14. The mediciner is to take an indemnification from the kindred of the wounded person, in case he die from the remedy he may use, and if he do not take it, let him answer for the deed. 15. He is to accompany the armies. 16. He is never to leave the palace, but with the king’s permission. 17. His saraad is six kine, and six score of silver, to be augmented. 18. His worth is six score and six kine, to be augmented.” Elsewhere we meet with the following particulars:— “Of the three conspicuous scars this is: “There are three conspicuous scars: one upon the face; another upon the foot; and another upon the hand; thirty pence upon the foot; three-score pence upon the hand; six-score pence on the face. Every unexposed scar, fourpence. The cranium, fourpence.”672 283 “For every broken bone, twenty pence; unless there be a dispute as to its diminutiveness; and if there be a dispute as to the size, let the mediciner take a brass basin, and let him place his elbow upon the ground, and his hand over the basin, and if its sound be heard, let four legal pence be paid; and if it be not heard, nothing is due.”673 This singular test is explained in another passage, thus:— “Four curt pennies are to be paid to a person for every bone taken from the upper part of the cranium, which shall sound on falling into a copper basin.”674 A very curious regulation was that if the physician got drunk and anybody insulted him, he could claim no recompense, because “he knew not at what time the king might want his assistance.” The physicians of Myddvai flourished in the time of Rhys Gryg in the early part of the thirteenth century. His domestic physician was Rhiwallon, who was assisted by his three sons Cadwgan, Gruffydd, and Einion. They lived at Myddvai, in the present county of Caermarthen. By command of the prince, these physicians made a collection of the most valuable prescriptions for the treatment of the various diseases of the human body. This collection was not reduced to writing previously, though many of the recipes were no doubt in use some centuries before. The original manuscript is in the British Museum, and there is a copy in Jesus College, Oxford, in the Red Book, which has been published with an English translation by the Welsh MSS. Society.675 The descendants of this family of physicians continued to practise medicine without intermission until the middle of the last century. This most interesting volume also contains a second portion, which purports to be a compilation by Howel the physician, son of Rhys, son of Llewelyn, son of Philip the physician, a lineal descendant of Einion the son of Rhiwallon. Some medical prescriptions assumed the form of proverbs such as the following:— Medical Maxims. (From the Book of Iago ab Dewi.) “He who goes to sleep supperless will have no need of Rhiwallon of Myddvai. A supper of apples—breakfast of nuts. A cold mouth and warm feet will live long. To the fish market in the morning, to the butcher’s shop in the afternoon. Cold water and warm bread will make an unhealthy stomach. 284 The three qualities of water: it will produce no sickness, no debt, and no widowhood. To eat eggs without salt will bring on sickness. It is no insult to deprive an old man of his supper. An eel in a pie, lampreys in salt. An ague or fever at the fall of the leaf is always of long continuance, or else is fatal. A kid a month old—a lamb three months. Dry feet, moist tongue. A salmon and a sermon in Lent. Supper will kill more than were ever cured by the physicians of Myddvai. A light dinner, a less supper, sound sleep, long life. Do not wish for milk after fish. To sleep much is the health of youth, the sickness of old age. Long health in youth will shorten life. It is more wholesome to smell warm bread than to eat it. A short sickness for the body, and short frost for the earth, will heal; either of them long will destroy. Whilst the urine is clear, let the physician beg. Better is appetite than gluttony. Enough of bread, little of drink. The bread of yesterday, the meat of to-day, and the wine of last year will produce health. Quench thy thirst where the washerwoman goes for water. Three men that are long-lived: the ploughman of dry land, a mountain dairyman, and a fisherman of the sea. The three feasts of health: milk, bread, and salt. The three medicines of the physicians of Myddvai: water, honey, and labour. Moderate exercise is health. Three moderations will produce long life; in food, labour, and meditation. Whoso breaks not his fast in May, let him consider himself with the dead. He who sees fennel and gathers it not, is not a man, but a devil. If thou desirest to die, eat cabbage in August. Whatever quantity thou eatest, drink thrice. God will send food to washed hands. Drink water like an ox, and wine like a king. One egg is economy, two is gentility, three is greediness, and the fourth is wastefulness. 285 If persons knew how good a hen is in January, none would be left on the roost. The cheese of sheep, the milk of goats, and the butter of cows are the best. The three victuals of health: honey, butter, and milk. The three victuals of sickness: flesh meat, ale, and vinegar. Take not thy coat off before Ascension day. If thou wilt become unwell, wash thy head and go to sleep. In pottage without herbs there is neither goodness nor nourishment. If thou wilt die, eat roast mutton and sleep soon after it. If thou wilt eat a bad thing, eat roast hare. Mustard after food. He who cleans his teeth with the point of his knife may soon clean them with the haft. A dry cough is the trumpet of death.” One of the laws of Howel Dda permitted divorce for so trifling a cause as an unsavoury or disagreeable breath.676 Poppies bruised in wine were used to induce sleep. For agues the treatment was to write in three apples on three separate days an invocation to the Trinity; “on the third day he will recover.” Saffron was used for many complaints; it is a drug still largely used by the poor, who have unbounded faith in it, but it is almost inert. If a person lost his reason, he was ordered to take primrose juice, “and he will indeed recover.” There were regular tables of lucky and unlucky days for bleeding. Fennel juice was supposed to act as a sort of anti-fat, and the roots of thistles were given as a purgative. If a snake should crawl into a man’s mouth, the patient was to take camomile powder in wine. An irritable man was to drink celery juice; “it will produce joy.” As we might have expected, the leek was supposed to have many virtues; wives who desired children were told to eat leeks. Leek juice and woman’s milk was good for whooping cough. The juice was also used for deafness, heart-burn, headache, and boils. Mustard purifies the brain, is an antidote to the bite of an adder, is good for colic, loss of hair, palsy, and many other things. To ascertain the fate of a sick person, bruise violets and apply them to the eyebrows; “if he sleep, he will live, but if not he will die.” Radishes were supposed to prevent hydrophobia. “That is the greatest remedy, to remove a bone from the brain (to trephine) with safety.” Dittany was the antidote for pain. Mouse-dung was used as a remedy for spitting of blood, and a plaster of cow-dung for gout. An eye-water was made from rotten apples. The berries of mistletoe were286 made into a confection as a remedy for epilepsy. “Let the sick person eat a good mouthful (they gave large doses in those days) thereof, fasting morning, noon, and night. It is proven.” Sage was supposed to strengthen the nerves (nerves in those days!). Nettles, goose-grass, blessed-thistle, and rosemary were favourite remedies. Then we have numerous curious charms and “medical feats discovered through the grace of God.” Here is one: “Take a frog alive from the water, extract his tongue (frogs have long been subject to vivisection), and put him again in the water. Lay this same tongue upon the heart of sleeping man, and he will confess his deeds in his sleep.” A charm for the toothache runs thus: “Saint Mary sat on a stone, the stone being near her hermitage, when the Holy Ghost came to her, she being sad. Why art thou sad, mother of my Lord, and what pain tormenteth thee? My teeth are painful, a worm called megrim has penetrated them, and I have masticated and swallowed it. I adjure thee, daffin O negrbina, by the Father, and the Son, and the Holy Ghost, the Virgin Mary, and God, the munificent physician, that thou dost not permit any disease, dolour, or molestation to affect this servant of God here present, either in tooth, eye, head, or in the whole of her teeth together. So be it. Amen.” All the herbs and plants (so far as was possible) which were used in the doctor’s practice were directed to be grown by him in his garden and orchard, so that they might be at hand when required. In the table of weights and measures used by the ancient Welsh physicians, we learn that twenty grains of wheat make one scruple, four podfuls make one spoonful, four spoonfuls make one eggshellful, four eggshellfuls make one cupful. The physician also for his guidance had the following curious table:—Four grains of wheat \u003d one pea, four peas \u003d one acorn, four acorns \u003d one pigeon’s egg, four pigeon’s eggs \u003d one hen’s egg, four hen’s eggs \u003d one goose’s egg, four goose’s eggs \u003d one swan’s egg. “For treating a stroke on the head unto the brain, a stroke in the body unto the bowels, and the breaking of one of the four limbs, the wounded person was to receive three pounds from the one who wounded him; and that person had also to pay for the medical treatment of the sufferer a pound without food, or nine-score pence with his food, and the bloody clothes.”677 The physicians of Myddvai recognised five kinds of fevers; viz., latent, intermittent, ephemeral, inflammatory, and typhus. The doctor’s “three master difficulties” were a wounded lung, a wounded mammary gland, and a wounded knee joint. “There are three bones which will never unite when broken—a tooth, the knee pan, and the os frontis.” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3068/84804.html","bookId":986,"book":{"id":986,"title":"The Origin and Growth of the Healing Art","description":"简介： The History of Medicine is a terra incognita to the general reader, and an all but untravelled region to the great majority of medical men. On special occasions, such as First of October Addresses at the opening of the Medical Schools, or the Oration...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3068","creation":"Aug 1, 2019 12:24:05 AM","modification":"Aug 1, 2019 12:24:05 AM"}}
