{"id":41533,"no":4,"title":"CHAPTER III. SAVAGE THEORIES OF DISEASE.","content":"Demoniacal.—Witchcraft.—Offended Dead Persons. We find amongst savages three chief theories of disease; that it is caused by— I. The anger of an offended demon. II. Witchcraft, or III. Offended dead persons. I. Anger of Offended Demons. Disease and death are set down to the influences of spirits in the Australian-Tasmanian district, where demons are held to have the power of creeping into men’s bodies, to eat up their livers, and sometimes to work the wicked will of a sorcerer by inflicting blows with a club on the back of the victim’s neck.16 The Mantira, a low race of the Malay Peninsula, believe in the theory of disease-spirits in its extreme form; their spirits cause all sorts of ailments. The “Hantu Kalumbahan” causes small-pox; the “Hantu Kamang” brings on inflammation and swelling of the hands and feet; the blood which flows from wounds is due to the “Hantu-pari,” which fastens on the wound and sucks. So many diseases, so many Hantus. If a new malady were to appear amongst the tribes, a new Hantu would be named as its cause.17 When small-pox breaks out amongst these people, they place thorns and brush in the paths to keep the demons away. The Khonds of Orissa try to defend themselves against the goddess of small-pox, Jugah Pensu, in the same way. Among the Dayaks of Borneo, to have been ill is to have been smitten by a spirit; invisible spirits inflict invisible wounds with invisible spears, or they enter bodies and make them mad. Disease-spirits in the Indian Archipelago are conciliated by presents13 and dances. In Polynesia, every sickness is set down to deities which have been offended, or which have been urged to afflict the sufferer by their enemies.18 In New Zealand disease is supposed to be due to a baby, or undeveloped spirit, which is gnawing the patient’s body. Those who endeavour to charm it away persuade it to get upon a flax-stalk and go home. Each part of the body is the particular region of the spirit whose office it is to afflict it.19 The Prairie Indians treat all diseases in the same way, as they must all have been caused by one evil spirit.20 Among the Betschvaria disease may be averted if a painted stone or a crossbar smeared with medicine be set up near the entrance of the residence or approach to a town.21 Amongst the Bodo and Dhimal peoples, when the exorcist is called to a sick man he sets thirteen loaves round him, to represent the gods, one of whom he must have offended; then he prays to the deity, holding a pendulum by a string. The offended god is supposed to cause the pendulum to swing towards his loaf.22 The New Zealanders had a separate demon for each part of the body to cause disease. Tonga caused headache and sickness; Moko-Tiki was responsible for chest pains, and so on.23 The Karens of Burmah and the Zulus both say, “The rainbow is disease. If it rests on a man, something will happen to him.”24 “The rainbow has come to drink wells.” They say, “Look out; some one or other will come violently by an evil death.” The Tasmanians lay their sick round a corpse on the funeral pile, that the dead may come in the night and take out the devils that cause the diseases.25 The Zulus believe that spirits, when angry, seize a living man’s body and inflict disease and death, and when kindly disposed give health and cattle. In Madagascar, Mr. Tylor tells us, the spirits of the Vazimbas, the aborigines of the island, inflict diseases, and the Malagasy accounts for all sorts of mysterious complaints by the supposition that he has given offence to some Vazimba. The Gold Coast negroes believe that ghosts plague the living and cause sickness. The Dayaks of Borneo think that the souls of men enter the trunks of trees, and the Hindus hold that plants are sometimes the homes of the spirits of the departed. The Santals of Bengal believe that the spirits of the good14 enter into fruit-bearing trees.26 It is but another step to the belief that beneficent medicinal plants are tenanted by good spirits, and poisonous plants by evil spirits. The Malays have a special demon for each kind of disease; one for small-pox, another for swellings, and so on.27 The Dayaks of Borneo acknowledge a supreme God, although, as we have said, they attribute all kinds of diseases and calamities to the malignity of evil spirits. Their system of medicine consists in the application of appropriate charms or the offering of conciliatory sacrifices.28 Yet they are an intelligent and highly capable race, and their steel instruments far surpass European wares in strength and fineness of edge.29 The Javanese, nominally Mahometans, are really believers in the primitive animism of their ancestry. They worship numberless spirits; all their villages have patron saints, to whom is attributed all that happens to the inhabitants, good or bad. Mentik causes the rice disease; Sawan produces convulsions in children; Dengen causes gout and rheumatism.30 The religion of Siam is a corrupted Buddhism; spirits and demons (nats or phees) are worshipped and propitiated. Some of these malignant beings cause children to sicken and die. Talismans are worked into the ornamentation of the houses to avert their evil influence.31 The Rev. J.?L. Wilson32 says: “Demoniacal possessions are common, and the feats performed by those who are supposed to be under such influence are certainly not unlike those described in the New Testament. Frantic gestures, convulsions, foaming at the mouth, feats of supernatural strength, furious ravings, bodily lacerations, grinding of teeth, and other things of a similar character, may be witnessed in most of the cases.” In Finnish mythology, which introduces us to ideas of extreme antiquity, we find the disease-demon theory in all its force. The Tietajat, “the learned,” and the Noijat, or sorcerers, claimed the power to cure diseases by expelling the demons which caused them, by incantations assisted by drugs; these magicians were the only physicians of the nation. The Tietajat and the Noijat, however, were not magicians of the same class: the former practised “white magic,” or “sacred science”; the latter practised “black magic,” or sorcery. Evil spirits, poisons, and malice were the chief aids to practice in the latter; while Tietajat, by means of learning and the assistance of benevolent supernatural beings, devote themselves to the welfare of the people. The three highest deities of Finnish mythology, Ukko, W?in?15m?inen, and Ilmarinen, corresponded to three superior gods of the Accadian magic collection, Ana, Hea, and Mut-ge. W?in?m?inen was the great spirit of life, the master of favourable spells, conqueror of evil, and sovereign possessor of science. The sweat which dropped from his body was a balm for all diseases. It was he alone who could conquer all the demons. Every disease was itself a demon. The invasion of the disorder was an actual possession. Finnish magic was chiefly medical, being used to cure diseases and wounds.33 The Finns believed diseases to be the daughters of Louhiatar, the demon of diseases. Pleurisy, gout, colic, consumption, leprosy, and the plague were all distinct personages. By the help of conjurations, these might be buried or cooked in a brazen vessel. When the priest made his diagnosis he had to be in a state of divine ecstasy, and then by incantation, assisted by drugs, he proceeded to exorcise the demon. The Finnish incantations belonged to the same family as those of the Accadians. Professor Lenormant translates from the great Epopee of the Kalevala one of the incantations:— “O malady, disappear into the heavens; pain, rise up to the clouds; inflamed vapour, fly into the air, in order that the wind may take thee away, that the tempest may chase thee to distant regions, where neither sun nor moon give their light, where the warm wind does not inflame the flesh. “O pain, mount upon the winged steed of stone, and fly to the mountains covered with iron. For he is too robust to be devoured by disease, to be consumed by pains. “Go, O diseases, to where the virgin of pains has her hearth, where the daughter of W?in?m?inen cooks pains,—go to the hill of pains. “These are the white dogs, who formerly hurled torments, who groaned in their sufferings.” Another incantation against the plague was discovered by Ganander, and is given by Lenormant:— “O scourge, depart; plague, take thy flight, far from the bare flesh. “I will give thee a horse, with which to escape, whose shoes shall not slide on ice;” and so on. The Jewish ceremony expelled the scapegoat to the desert; the Accadian banished the disease-demons to the desert of sand; the Finnish magician sent his disease-demons to Lapland. The goddess Suonetar was the healer and renewer of flesh:— “She is beautiful, the goddess of veins, Suonetar, the beneficent goddess! She knits the veins wonderfully with her beautiful spindle, her metal distaff, her iron wheel. 16 “Come to me, I invoke thy help; come to me, I call thee. Bring in thy bosom a bundle of flesh, a ball of veins to tie the extremity of the veins.”34 “All diseases are attributed by the Thibetans to the four elements, who are propitiated accordingly in cases of severe illness. The winds are invoked in cases of affections of the breathing; fire in fevers and inflammations; water in dropsy, and diseases whereby the fluids are affected; and the god of earth when solid organs are diseased, as in liver complaints, rheumatism, etc. Propitiatory offerings are made to the deities of these elements, but never sacrifices.”35 Hooker tells of a case of apoplexy which was treated by a Lama, who perched a saddle on a stone, and burning incense before it, scattered rice to the winds, invoking the various mountain peaks in the neighbourhood. In Hottentot mythology Gaunab is a malevolent ghost, who kills people who die what we call a “natural” death. Unburied men change into this sort of vampire.36 The demoniacal theory of at least one class of disease is found in the Bible, although the New Testament in one passage distinguishes between lunatics and demoniacs. In Matthew iv. 24 we read that they brought to Jesus “those which were possessed with devils, and those which were lunatick.” Epilepsy is evidently the disease described in Mark ix. 17-26, though the symptoms are attributed to possession by a dumb spirit. II. Witchcraft as a Cause of Disease. Sorcerers and magicians not only use evil words and cast evil glances at the persons whom they wish to afflict, but they endeavour to obtain possession of some article which has belonged to the individual, or something connected more closely with his personality, as parings of the nails or a few of his hairs, and through these he professes to be able to operate more effectually on the object of his malice. It is to this use of portions of the body that ignorant persons, even at the present day, insist that nail-parings, hair-cuttings, and the like, shall be at once destroyed by fire. Such superstitions are found at work all over the world. Mr. Black tells us37 that the servants of the chiefs of the17 South Sea Islanders carefully collect and bury their masters’ spittle in places where sorcerers are not likely to find it. He says also it is believed in the West of Scotland that if a bird used any of the hair of a person’s head in building his nest, the individual would be subject to headaches and become bald. Of course the bird is held to be the embodiment of an evil spirit or witch. Images of persons to be bewitched are sometimes made in wood or wax, in which has been inserted some of the hair of the victim of the enchantment; the image is then buried, and before long some malady attacks the part of the bewitched person corresponding to that in which the hair has been placed in his effigy. Disease-making is a profession in the island of Tanna in the New Hebrides; the sorcerers collect the skins and shells of the fruits eaten by any one who is to be punished, they are then slowly burned, and the victims sicken. Disease-demons are driven away from patients in Alaska by the beating of drums. The size of the drum and the force of the beating are directly proportioned to the gravity of the disease. A headache can be dispelled by the gentle tapping of a toy drum; concussion of the brain would require that the big drum should be thumped till it broke; if that failed to expel the evil spirit, there would be nothing left but to strangle the patient. The wild natives of Australia are exceedingly superstitious. Sorcery enters into every relation of life, and their great fear is lest they should be injured by the mysterious influence called boyl-ya. The sorcerers have power to enter the bodies of men and slowly consume them; the victim feels the pain as the boyl-ya enters him, and it does not leave him till it is extracted by another sorcerer. While he is sleeping, he may be attacked and bewitched by having pointed at him a leg-bone of a kangaroo, or the sorcerer may steal away his kidney-fat, where the savage believes that his power resides, or he may secretly slay his victim by a blow on the back of his neck. The magician may dispose of his victim by procuring a lock of his hair and roasting it with fat; as it is consumed, so does his victim pine away and die. Wingo is a superstition which some Australian tribes have, that with a rope of fibre they can partially choke a man, by putting it round his neck at night while he is asleep, without waking him; his enemy then removes his caul-fat from under his short rib, leaving no mark or wound. When the victim awakes he feels no pain or weakness, but sooner or later he feels something break in his inside like a string. He then goes home and dies at once.38 Dr. Watson thus describes the typical medicine-men:— 18 “The Tla-guill-augh, or man of supernatural gifts, is supposed to be capable of throwing his good or bad medicine, without regard to distance, on whom he will, and to kill or cure by magic at his pleasure. These medicine-men are generally beyond the meridian of life; grave, sedate, and shy, with a certain air of cunning, but possessing some skill in the use of herbs and roots, and in the management of injuries and external diseases. The people at large stand in great awe of them, and consult them on every affair of importance.”39 Dr. O.?L. M?ller, Medical Director-General of the Danish army, describes a certain wise woman near L?gst?r, who used in her prescriptions for the sick people who consulted her a charm of willow twigs tied together amongst other mystic things, and whose therapeutics were of a bloodthirsty character, as she would advise her patients to strike the first person they met after returning home, until they drew blood, for that person would be the cause of the disease.40 The fact that ghosts and demons are everywhere believed to cause diseases, and that sorcery is practised more or less by most of the races of man in connection with the causation or cure of disease, has been used as a factor in the argument for the origin of primitive man from a single pair in accordance with the orthodox belief. Dr. Pickering, the ethnologist, says: “Superstitions also appear to be subject to the same laws of progression with communicated knowledge, and the belief in ghosts, evil spirits, and sorcery, current among the ruder East Indian tribes, in Madagascar, and in a great part of Africa, seems to indicate that such ideas may have elsewhere preceded a regular form of mythology.”41 There has long been practised in the West Indies a species of witchcraft called Obeah or Obi, supposed to have been introduced from Africa, and which is in reality an ingenious system of poisoning. Mr. Bowrey, Government chemist in Jamaica, connects Obeah-poisoning with a plant which grows abundantly in Jamaica and other West Indian islands, called the “savannah flower,” or “yellow-flowered nightshade” (Urechites suberecta).42 Mr. Bowrey concludes that there is some truth in the stories told of the poisoning by Obeah-men, and that minute doses, frequently administered, might cause death without suspicion being aroused. The British Medical Journal, June 18th, 1892, has the following interesting notes on Obeah (p. 1296):— 19 “It is difficult to obtain detailed information regarding Obeah practices. They rest largely on the credence given to superstitious practices and vulgar quackery by the uneducated in every country, but there seems little doubt that among them secret poisoning is included. Benjamin Moseley (Medical Tracts, London, 1800) states that Obi had its origin, like many customs among the Africans, from the ancient Egyptians, Ob meaning a demon or magic. Villiers-Stuart (Jamaica Revisited, 1891) says that Obeah in the West African dialects signifies serpent, and that the Obeah-men in Jamaica carry (but in greatest secrecy, for fear of the penal laws) a stick on which is carved a serpent, the emblem being a relic of the serpent worship once universal among mankind, and also that they sacrifice cocks at their religious rites. Moseley gives the following account: ‘Obi, for the purposes of bewitching people or consuming them by lingering illness, is made of grave-dirt, hair, teeth of sharks and other animals, blood, feathers,’ and so on. Mixtures of these are placed in various ways near the person to be bewitched. ‘The victims to this nefarious art in the West Indies among the negroes are numerous. No humanity of the master nor skill in medicine can relieve the poor negro labouring under the influence of Obi. He will surely die, and of a disease that answers no description in nosology. This, when I first went to the colonies, perplexed me. Laws have been made in the West Indies to punish the Obian practice with death, but they have been impotent and nugatory. Laws constructed in the West Indies can never suppress the effect of ideas, the origin of which is in the centre of Africa.’ ‘A negro Obi-man will administer a baleful dose from poisonous herbs, and calculate its mortal effects to an hour, day, week, month, or year.’ The missionaries Waddell (Twenty-nine Years in the West Indies and Central Africa, 1863) and Blyth (Reminiscences of Missionary Life, 1851) confirm this account. They are all agreed that similar practices prevail in West and Central Africa, and that Jamaican Obeah-men use poisons. Mr. Bowrey informs me that he has examined many Obeah charms, and confirms Moseley’s account of them. He thinks, however, that among the negroes the knowledge of poisons has been rapidly dying out, ‘doctor’s medicine’ and the much-advertised patent medicines having largely replaced the drugs of the native practitioners. The belief in Obeah is still, however, almost universal among the black population. According to Sir Spencer St. John (Hayti, or the Black Republic, second edition, London, 1889) secret poisoning is a lucrative occupation in the neighbouring island of Hayti, certain of the people having an intimate knowledge of indigenous poisonous plants and being expert poisoners.”20 III. Offence to the Dead as a Cause of Disease. How comes it that all the races of man of which we have any accurate information have some belief or other in spirits good or bad, and of some other life than the actual one which they live in their waking hours? The theologian answers it in his own way, the anthropologist in his, and perhaps a simpler one. With the religious aspect of the question we are not here concerned, we have merely to consider the scientific points involved. When the most ignorant savage of the lowest type falls asleep, he is as sure to dream as his more favoured civilized brother. To his companions he appears as though he were dead, he is motionless and apparently unconscious. He awakes and is himself again. What has his spirit or thinking part been doing while his body slept? The man has seen various things and places, has even conversed with friend or foe in his slumbers, has engaged in fights, has taken a journey, has had adventures, and yet his body has not stirred. Naturally enough the explanation most satisfactory is, that his soul has temporarily left his body, and has met other souls in a similar condition. He has seen and conversed with his dead friends or relatives, has been comforted by their presence or alarmed at the visitation. Here, then, we have the anthropologist’s “theory of souls where life, mind, breath, shadow, reflexion, dream, vision, come together and account for one another in some such vague, confused way as satisfies the untaught reasoner.”43 But the savage goes further than this: he has seen his horse, his dog, his canoe, and his spear in his dream, they too must have souls; and thus he invests with a spiritual essence every material object by which he is surrounded. And so we find funeral sacrifices and ceremonies all over the world which testify to this universal belief of primitive man. The ornaments and weapons which are found with the bones of chiefs, the warrior’s horses slain at his burial place, the food and drink and piece of money left with the dead, are intelligible on this theory, and on no other. The savage’s idea of a demon or evil spirit is usually that of a soul of a malevolent dead man. The man was his enemy during life, he remains his enemy after death; or he owed some acknowledgment and reward to a spirit who had helped him, he has neglected to pay his debt, and he has offended the spirit in consequence. In cases of fainting, delirium from fever, hysteria, epilepsy, or insanity, the savage sees the partial absence of the patient’s soul from his body, or the work of a tormenting demon. Demoniacal possession and the ceremonies of exorcism are theories readily explainable by facts with which the an21thropologist is familiar. “The sick Australian will believe that the angry ghost of a dead man has got into him, and is gnawing his liver; in a Patagonian skin hut the wizards may be seen dancing, shouting, and drumming, to drive out the evil demon from a man down with fever.”44 When Prof. Bartram, the anthropologist, was in Burma, his servant was seized with an apopleptic fit. The man’s wife, of course, attributed the misfortune to an angry demon, so she set out for him little heaps of rice, and was heard praying, “Oh, ride him not! Ah, let him go! Grip him not so hard! Thou shalt have rice! Ah, how good that tastes!” The exorcist may so delude himself that he may believe that he has power to make the demon converse with him. There may be a falsetto voice like that of the mediums of modern civilization issuing from the patient’s mouth, and the exorcist’s questions and commands may be answered, and the evil spirit may consent to leave the sufferer in peace. In nervous or mental disorders, in cases of defective power of assimilating food, such a process may exert a soothing and highly beneficial influence on the patient who is actively co-operating by his faith in his own cure, and so the error both as to the cause of the malady and its treatment is perpetuated. Primitive folk think that life is indestructible; what is called death is but a change of condition to them; even mites and mosquitos are immortal.45 The Tasmanian, when he suffers from a gnawing disease, believes that he has unwittingly pronounced the name of a dead man, who, thus summoned, has crept into his body, and is consuming his liver. The sick Zulu believes that some dead ancestor he sees in a dream has caused his ailment, wanting to be propitiated with the sacrifice of an ox. The Samoan thinks that the ancestral souls can get into the heads and stomachs of living men, and cause their illness and death. These are examples of human ghosts having become demons.46 In the Samoan group people thought that if a man died bearing ill-will towards any one, he would be likely to return to trouble him, and cause sickness and death, taking up his abode in the sufferer’s head, chest, or stomach. If he died suddenly, they said he had been eaten by the spirit that took him. In the Georgian and Society Islands evil demons cause convulsions and hysterics, or twist the bowels till the sufferers die writhing in agony. Madmen are thought to be entered22 by a god, so they are treated with great respect; idiots are considered to be divinely inspired.47 Many other races believe in the inspiration of mentally feeble or insane persons. Amongst the Dacotas spirits of animals, trees, stones, or deceased persons are believed to enter the patient and cause his disease. The medicine-man recites charms over him, and making a symbolic representation of the intruding spirit in bark, shoots it ceremonially; he sucks over the seat of the pain to draw the spirit out, and fires guns at it as it escapes. This is just what happened in the West Indies in the time of Columbus. Friar Roman Paul tells of a native sorcerer who pretended to pull the disease from the legs of his patients, blowing it away, and telling it to begone to the mountain or the sea. He would then pretend to extract by sucking some stone or bit of flesh, which he declared had been put into the patient to cause the disease by a deity in punishment for some religious neglect.48 The Patagonians believed that sickness was caused by spirits entering the patient’s body; they considered that an evil demon held possession of the sick man’s body, and their doctors always carried a drum which they struck at the bedside to frighten away the demons which caused the disorder.49 The Zulus and Basutos in Africa teach that ghosts of dead persons are the causes of all diseases. Congo tribes believe also that the souls of the dead cause disease and death amongst men. The art of medicine in these lands therefore is, for the most part, merely an affair of propitiating some offended and disease-causing spirit. In several parts of Africa mentally deranged persons are worshipped. Madness and idiocy are explained by the phrase, “he has fiends.” The Bodo and Dhimal people of North-east India ascribe all diseases to a deity who torments the patient, and who must be appeased by the sacrifice of a hog. With these people naturally the doctor is a sort of priest. As Mr. Tylor says, “Where the world-wide doctrine of disease-demons has held sway, men’s minds, full of spells and ceremonies, have scarce had room for thought of drugs and regimen.”50 A forest tribe of the Malay Peninsula, called the Original People, are said to have no religion, no idea of any Supreme Being, and no priests; yet their Puyung, who is a sort of general adviser to the tribe, instructs them in sorcery and the doctrine of ghosts and evil spirits. In sickness they use the roots and leaves of trees as medicines. Amongst23 the Tarawan group of the Coral Islands, Pickering says: “Divination or sorcery was also known, and the natives paid worship to the manes or spirits of their departed ancestors.”51 Probably on careful investigation we should find that in these cases the doctrine of ghosts and the worship of spirits has some connection with the causation of disease. The Malagasy profess a religion which is chiefly fetishism. They believe in the life of the spirit, which they call “the essential part of me,” apart from the body; and they believe that this spirit exists when the body dies. Such “ghosts” they consider can do harm in various ways, especially by causing diseases; consequently they endeavour, as the chief means of cure, to appease the offended ghost. Witchcraft and belief in charms naturally flourish amongst these people.52 Mr. A.?W. Howitt says that the K?rnai of Gippsland, Australia, believe that a man’s spirit (Yambo) can leave the body during sleep, and hold converse with other disembodied spirits. Another tribe, the Woi-wor?ng, call this spirit Mūr?p, and they suppose it leaves the body in a similar manner, the exact moment of its departure being indicated by the “snoring” of the sleeper. As a theory of the soul, Mr. Howitt says: “It may be said of the aborigines I am now concerned with, and probably of all others, that their dreams are to them as much realities in one sense, as are the actual events of their waking life. It may be said that in this respect they fail to distinguish between the subjective and objective impressions of the brain, and regard both as real events.”53 They believe that these ghosts live upon plants, that they can revisit their old haunts at will, and communicate with the wizards or medicine-men on being summoned by them. A celebrated wizard amongst the Woi-wor?ng caught the spirit of a dying man, and brought it back under his ’possum rug, and restored it to the still breathing body just in time to save his life. The ghosts can kill game with spiritually poisoned spears. Even the tomahawk has a spirit, and this belief explains many burial customs. One of the Woi-wor?ng people told Mr. Howitt that they buried the weapon with the dead man, “so that he might have it handy.” Other tribes bury with the corpse the amulets and charms used by the deceased during life, in case they may be required in the spirit-world. The Woi-wor?ng believe that their wizards could send their deadly magical yark, or rock crystal, against a person they desired to kill, in the form of a small whirlwind. They believe that their wizards “go up” at night to the sky, and obtain such information as24 they require in their profession. They can also bring away the magical apparatus by which some one of another tribe might be injuring the health of a member of his own tribe. It is highly probable that in these Australian beliefs we have the counterparts of those which were everywhere held by primitive man. Good spirits are very little worshipped by savages; they are already well disposed, and need no invocation; it is the bad ones who must be propitiated by an infinite variety of rites and sacrifices. “Thus,” as Professor Keane says, “has demonology everywhere preceded theology.”54 Mr. Edward Palmer, in Notes on Some Australian Tribes, says that the Gulf tribes believe in spirits which live inside the bark of trees, and which come out at night to hold intercourse with the doctors, or “mediums.” These spirits work evil at times. The Kombinegherry tribe are much afraid of an evil-working spirit called Tharragarry, but they are protected by a good spirit, Coomboorah. The Mycoolon people believe in an invisible spear which enters the body, leaving no outward sign of its entry. The victim does not even know that he is hurt; he goes on hunting, and returns home as usual; in the night he becomes ill, delirious, or mad, and dies in the morning. Thimmool is a pointed leg-bone of a man, which, being held over a blackfellow when asleep, causes sickness or death. The Marro is the pinion-bone of a hawk, in which hair of an enemy has been fixed with wax. To work a charm on him a fire circle is made round it. With this charm they can make their enemy sick, or, by prolonging their magic, kill him. When they think they have done harm enough, they place the Marro in water, which removes the charm.55 Mr. H.?H. Johnstone says that the tribes on the Lower Congo bury with any one of consequence bales of cloth, plates, beads, knives, and other things required to set the deceased up in the spirit-life on which he has entered. The plates are broken, the beads are crushed, and the knives bent, so as to kill them, that they too may “die,” and go to the spirit-land with their owner.56 This is a valuable confirmation of the doctrine of animism. As Mr. Herbert Spencer says:57 “It is absurd to suppose that uncivilized man possesses at the outset the idea of ‘natural explanation.’” At a great price has civilized man purchased the power of giving a natural explanation to the phenomena by which he is surrounded. As societies grow, as the arts flourish, as painfully, little by little, his25 experiences accumulate, so does man learn to correct his earlier impressions, and to construct the foundations of science. It is the natural, or it would not be the universal, process for primitive man to explain phenomena by the simplest methods, and these always lead him to his superstitions. It is the only process open to him. The activity which he sees all around him is controlled by the spirits of the dead, and by spirits more or less like those which animate his fellow-men. Clement of Alexandria says that all superstition arises from the inveterate habit of mankind to make gods like themselves. The deities have like passions with their worshippers, “and some say that plagues, and hailstorms, and tempests, and the like, are wont to take place, not alone in consequence of material disturbance, but also through the anger of demons and bad angels. These can only be appeased by sacrifice and incantations. Yet some of them are easily satisfied, for when animals failed, it sufficed for the magi at Cleone to bleed their own fingers.”58 “The prophetess Diotima, by the Athenians offering sacrifice previous to the pestilence, effected a delay of the plague for ten years.” \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3068/84786.html","bookId":986,"book":{"id":986,"title":"The Origin and Growth of the Healing Art","description":"简介： The History of Medicine is a terra incognita to the general reader, and an all but untravelled region to the great majority of medical men. On special occasions, such as First of October Addresses at the opening of the Medical Schools, or the Oration...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3068","creation":"Aug 1, 2019 12:24:05 AM","modification":"Aug 1, 2019 12:24:05 AM"}}
