{"id":6001,"no":9,"title":"Chapter 9","content":"\"This is a terrible thing, \" he said, the moment we got out into the street.\\n\\n I realised that he had come away with me in order to discuss once more what he had been already discussing for hours with his sister-in-law.\\n\\n \"We don\u0027t know who the woman is, you know, \" he said. \"All we know is that the blackguard\u0027s gone to Paris. \"\\n\\n \"I thought they got on so well. \"\\n\\n \"So they did. Why, just before you came in Amy said they\u0027d never had a quarrel in the whole of their married life. You know Amy. There never was a better woman in the world. \"\\n\\n Since these confidences were thrust on me, I saw no harm in asking a few questions.\\n\\n \"But do you mean to say she suspected nothing?\"\\n\\n \"Nothing. He spent August with her and the children in Norfolk. He was just the same as he\u0027d always been. We went down for two or three days, my wife and I, and I played golf with him. He came back to town in September to let his partner go away, and Amy stayed on in the country. They\u0027d taken a house for six weeks, and at the end of her tenancy she wrote to tell him on which day she was arriving in London. He answered from Paris. He said he\u0027d made up his mind not to live with her any more. \"\\n\\n \"What explanation did he give?\"\\n\\n \"My dear fellow, he gave no explanation. I\u0027ve seen the letter. It wasn\u0027t more than ten lines. \"\\n\\n \"But that\u0027s extraordinary. \"\\n\\n We happened then to cross the street, and the traffic prevented us from speaking. What Colonel MacAndrew had told me seemed very improbable, and I suspected that Mrs. Strickland, for reasons of her own, had concealed from him some part of the facts. It was clear that a man after seventeen years of wedlock did not leave his wife without certain occurrences which must have led her to suspect that all was not well with their married life. The Colonel caught me up.\\n\\n \"Of course, there was no explanation he could give except that he\u0027d gone off with a woman. I suppose he thought she could find that out for herself. That\u0027s the sort of chap he was. \"\\n\\n \"What is Mrs. Strickland going to do?\"\\n\\n \"Well, the first thing is to get our proofs. I\u0027m going over to Paris myself. \"\\n\\n \"And what about his business?\"\\n\\n \"That\u0027s where he\u0027s been so artful. He\u0027s been drawing in his horns for the last year. \"\\n\\n \"Did he tell his partner he was leaving?\"\\n\\n \"Not a word. \"\\n\\n Colonel MacAndrew had a very sketchy knowledge of business matters, and I had none at all, so I did not quite understand under what conditions Strickland had left his affairs. I gathered that the deserted partner was very angry and threatened proceedings. It appeared that when everything was settled he would be four or five hundred pounds out of pocket.\\n\\n \"It\u0027s lucky the furniture in the flat is in Amy\u0027s name. She\u0027ll have that at all events. \"\\n\\n \"Did you mean it when you said she wouldn\u0027t have a bob?\"\\n\\n \"Of course I did. She\u0027s got two or three hundred pounds and the furniture. \"\\n\\n \"But how is she going to live?\"\\n\\n \"God knows. \"\\n\\n The affair seemed to grow more complicated, and the Colonel, with his expletives and his indignation, confused rather than informed me. I was glad that, catching sight of the clock at the Army and Navy Stores, he remembered an engagement to play cards at his club, and so left me to cut across St. James Park.\\n\\n \\n\\n “真太可怕了，”我们刚刚走到大街上，他马上开口说。\\n\\n 我看出来，他同我一起出来目的就是想同我继续谈论这件他已经同他的小姨子谈了好几小时的事。\\n\\n “我们根本弄不清是哪个女人，你知道，”他说，“我们只知道那个流氓跑到巴黎去了。”\\n\\n “我一直以为他们俩感情挺不错。”\\n\\n “是不错。哼，你来以前，阿美还说他们结婚这么多年就没有吵过一次嘴。你知道阿美是怎样一个人。世界上没有比她更好的女人了。”\\n\\n 既然他主动把这家人的秘密都告诉我，我觉得我不妨继续提出几个问题来。\\n\\n “你的意思是说她什么也没有猜到？”\\n\\n “什么也没猜到。八月他是同她和孩子们一起在诺佛克度过的。他同平常日子一模一样，一点也没有反常的地方。我和我妻子到他们乡下过了两三天，我还同他玩过高尔夫球。九月，他回到城里来，为了让他的合股人去度假。阿美仍然待在乡下。他们在乡下房子租了六个星期，房子快满期以前她给他写了封信，告诉他自己哪一天回伦敦来。他的回信是从巴黎发的，说他已经打定主意不同她一起生活了。”\\n\\n “他怎样解释呢？”\\n\\n “他根本没有解释，小朋友。那封信我看了。还不到十行字。”\\n\\n “真是奇怪了。”\\n\\n 说到这里我们正好过马路，过往车辆把我们的谈话打断了。麦克安德鲁告诉我的事听起来很难令人相信，我怀疑思特里克兰德太太根据她自己的理由把一部分事实隐瞒着没对他说。非常清楚，一个人结婚十七年不会平白无故地离家出走的，这里面一定有一些事会使她猜想两人的夫妻生活并不美满。我正在思忖这件事，上校又从后面赶上来。\\n\\n “当然了，除了坦白承认自己是同另外一个女人私奔之外，他是无法解释这件事的。据我看，他认为早晚她会自己弄清楚的。他就是这样一个人。”\\n\\n “思特里克兰德太太打算怎么办？”\\n\\n “哈，第一件事是抓到证据。我准备自己到巴黎去一趟。”\\n\\n “他的买卖怎么办？”\\n\\n “这正是他狡诈的地方。一年来他一直把摊子越缩越小。”\\n\\n “他告诉没告诉他的合股人他不想干了？”\\n\\n “一句也没透露。”\\n\\n 麦克安德鲁上校对证券交易的事不太内行，我更是一窍不通，因此我不太清楚思特里克兰德是在什么情况下退出了他经营的交易。我得到的印象是，被他中途甩开的合股人气得要命，威胁说要提出诉讼。看来一切都安排妥善后，这个人的腰包要损失四五百镑钱。\\n\\n “幸而住房的全套家具都是写在阿美名下的。不管怎么说这些东西她还都能落下。”\\n\\n “刚才你说她一个便士也没有是真实情况吗？”\\n\\n “当然是真的。她手头就只有两三百镑钱和那些家具。”\\n\\n “那她怎样生活呢？”\\n\\n “天晓得。”\\n\\n 事情变得更加复杂了，再加上上校火冒三丈，骂骂咧咧，不但不能把事情讲清楚，反而叫我越听越糊涂。我很高兴，在他看到陆海军商店上面的大钟的时候，突然记起他要到俱乐部玩牌的约会来。他同我分了手，穿过圣杰姆斯公园往另一个方向走去了。\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/shuangyu/289/2757.html","bookId":193,"book":{"id":193,"title":"月亮和六便士 Moon and Sixpence","description":"简介： The Moon and Sixpence is a short novel of 1919 by William Somerset Maugham based on the life of the painter Paul Gauguin. The story is told in episodic form by the first-person narrator as a series of glimpses into the mind and soul of the...","cover":"http://novel.tingroom.com/uploads/110421/1-110421140615S6.jpg","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/289","creation":"Aug 1, 2019 12:18:23 AM","modification":"Aug 1, 2019 12:18:23 AM"}}
