{"id":43987,"no":10,"title":"CHAPTER X. DINNER AT SMITH INSTITUTE.","content":"At twelve o’clock the morning session closed. Then came an intermission of an hour, during which the day scholars either ate lunch brought with them, or went to their homes in the village to partake of a warm repast. At ten minutes past twelve, a red-armed servant girl made her appearance at the back door looking out on the playground, and rang a huge dinner bell. The boys dropped their games, and made what haste they could to the dining room. “Now for a feast!” said Wilkins to Hector, significantly. “Does Mr. Smith furnish good board?” asked Hector, for he felt the hunger of a healthy boy who had taken an early breakfast. “Good grub?” said Wilkins, making a face. “Wait till you see. Old Sock isn’t going to ruin himself providing his pupils with the delicacies of the season.” “I’m sorry for that. I am confoundedly hungry.” “Hungry!” exclaimed Wilkins. “I’ve been I hungry ever since I came here.” “Is it as bad as that?” asked Hector, rather alarmed. “I should say so. I haven’t had a square meal—what I call a square meal—for four weeks, and that’s just the time since I left home.” They had reached the door of the dining-room by this time. In the center stood a long table, but there didn’t seem to be much on it except empty plates. At a side table stood Mrs. Smith, ladling out soup from a large tureen. “That’s the first course,” whispered Wilkins. “I hope you’ll like it.” The boys filed in and took seats. The servant girl already referred to began to bring plates of soup and set before the boys. It was a thin, unwholesome-looking mixture, with one or two small pieces of meat, about the size of a chestnut, in each plate, and fragments of potatoes and carrots. A small, triangular wedge of dry bread was furnished with each portion of soup. “We all begin to eat together. Don’t be in a hurry,” said Wilkins, in a low tone. When all the boys were served, Socrates Smith, who sat in an armchair at the head of the table, said: “Boys, we are now about to partake of the bounties of Providence, let me hope, with grateful hearts.” He touched a hand bell, and the boys took up their soup spoons. Hector put a spoonful gingerly into his mouth, and then, stopping short, looked at Wilkins. His face was evidently struggling not to express disgust. “Is it always as bad?” he asked, in a whisper. “Yes,” answered Wilkins, shrugging his shoulders. “But you eat it!” Wilkins had already swallowed his third spoonful. “I don’t want to starve,” answered Wilkins, significantly. “You’ll get used to it in time.” Hector tried to dispose of a second spoonful, but he had to give it up. At home he was accustomed to a luxurious table, and this meal seemed to be a mere mockery. Yet he felt hungry. So he took up the piece of bread at the side of his plate, and, though it was dry, he succeeded in eating it. By this time his left-hand neighbor, a boy named Colburn, had finished his soup. He looked longingly at Hector’s almost untasted plate. “Ain’t you going to eat your soup?” he asked, in a hoarse whisper “No.” “Give it to me?” “Yes.” In a trice, Colburn had appropriated Hector’s plate and put his own empty one in its place. Just after this transfer had been made, Mr. Smith looked over to where Hector was sitting. He observed the empty plate, and said to himself: “That new boy has been gorging himself. He must have a terrible appetite. Well, that’s one good thing, he ain’t dainty. Some boys turn up their noses at plain, wholesome diet. I didn’t know but he might.” Presently the hand bell rang again, and the soup plates were removed. In their places were set dinner plates, containing a small section each of corned beef, with a consumptive-looking potato, very probably “soggy.” At any rate, this was the case with Hector’s. He succeeded in eating the meat, but not the potato. “Give me your potato?” asked his left-hand neighbor. “Yes.” It was quickly appropriated. Hector looked with some curiosity at the boy who did so much justice to boarding-school fare. He was a thin, pale boy, who looked as if he had been growing rapidly, as, indeed, he had. This, perhaps, it was that stimulated his appetite. Afterward Hector asked him if he really liked his meals. “No,” he said; “they’re nasty.” He was an English boy, which accounted for his use of the last word. “You eat them as if you liked them,” remarked Hector. “I’m so hungry,” apologized Colburn, mournfully. “I’m always hungry. I eat to fill up, not ‘cause I like it. I could eat anything.” “I believe he could,” said Wilkins, who overheard this conversation. “Could you eat fried cat, now?” he asked. “Yes,” answered Colburn, honestly. “There would be something hearty and filling about fried cat. I ain’t half full now.” It was just after dinner. Hector might have said the same thing at the end of his first dinner. There was, indeed, another course. It consisted of some pale, flabby apple pie, about half baked. The slices given were about half the size of those that are ordinarily supplied at private tables and restaurants. Hector managed to eat the apple, but the crust he was obliged to leave. He noticed, however, that his fellow pupils were not so fastidious. When the last fragment of pie had disappeared, Mr. Smith again rang the hand bell. “Boys,” he said, “we have now satisfied our appetites.” “I haven’t,” thought Hector. “We have once more experienced the bountiful goodness of Providence in supplying our material wants. As we sit down to our plain but wholesome diet, I wonder how many of us are sensible of our good fortune. I wonder how many of us think of the thousands of poor children, scattered about the world, who know not where to get their daily bread. You have been refreshed, and have reinforced your strength; you will soon be ready to resume your studies, and thus, also, take in a supply of mental food, for, as you are all aware, or ought to be aware, the mind needs to be fed as well as the body. There will first be a short season for games and out-of-door amusements. Mr. Crabb, will you accompany the boys to the playground and superintend their sports?” Mr. Crabb also had participated in the rich feast, and rose with the same unsatisfied but resigned look which characterized the rest. He led the way to the playground, and the boys trooped after him. “Really, Wilkins,” said Hector, in a low tone, “this is getting serious. Isn’t there any place outside where one can get something to eat?” “There’s a baker’s half a mile away, but you can’t go till after afternoon session.” “Show me the way there, then, and I’ll buy something for both of us.” “All right,” said Wilkins, brightening up. “By the way, I didn’t see Jim Smith at the table.” “No; he eats with his uncle and aunt afterward. You noticed that old Sock didn’t eat just now.” “Yes, I wondered at it.” “He has something a good deal better afterward. He wouldn’t like our dinner any better than we did; but he is better off, for he needn’t eat it.” “So Jim fares better than the rest of us, does he?” “Yes, he’s one of the family, you know.” Just then pleasant fumes were wafted to the boys’ nostrils, and they saw through the open window, with feelings that cannot well be described, a pair of roast chickens carried from the kitchen to the dining-room. “See what old Sock and Ma’am Sock are going to have for dinner?” said Wilkins, enviously. “I don’t like to look at it. It is too tantalizing,” said Hector.","sourceLink":"http://novel.tingroom.com/ertong/2974/81926.html","bookId":349,"book":{"id":349,"title":"Hector\u0027s Inheritance or The Boys of Smith Institute","description":"简介： Mr. Roscoe rang the bell, and, in answer, a servant entered the library, where he sat before a large and commodious desk....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2974","creation":"Aug 1, 2019 12:18:37 AM","modification":"Aug 1, 2019 12:18:37 AM"}}
