{"id":40363,"no":18,"title":"CHAPTER 18","content":"Apprehension filled him again as he watched the staff assemble the next morning. The faces of the Nemarian members increased his discomfort. Why didn\u0027t they look happier, more excited? Why should they look at him with that unspoken sympathy in their eyes. He was afraid to hear what they had to say. The native who had spoken the day before moved forward a little. \"We\u0027re very sorry,\" he said gently. Kirk felt his heart sinking. \"We realize that you have worked very hard in what you consider to be our interests. We hoped you would come up with something more acceptable than these mines. But we cannot put the plans for mining these gems of yours into operation. We are very sorry,\" he said again, \"but the Council has voted against it.\" \"The Council!\" Kirk stared at him. He fought to control his voice. \"You know perfectly well that the power of my command is supreme over any local councils of whatever nature.\" He stiffened. \"But that isn\u0027t the point. I guess I haven\u0027t made things clear to you somehow. These gems—which you refer to as if they were a child\u0027s baubles—can make this insignificant planet a power in the galaxy. They can make the name of Nemar respected throughout the whole Galactic union. You can trade them.\" He spoke each word slowly and carefully as if he were explaining to a child. \"I\u0027m not having expensive machinery constructed and sending you down hundreds of feet into the ground so that your women can wear these jewels. They\u0027re extremely pretty, but you probably feel the flowers the girls pluck and put in their hair do just as well for ornaments, and perhaps you\u0027re right.\" He paused, trying to hold on to his temper. \"It will be dark and dusty and uncomfortable down in those mines, as I told you yesterday when you asked about it. It will be hard work, and I know you\u0027re not fond of hard work.\" He could not keep the sarcasm out of his voice. \"But I assure you, it will be worth it. A really good specimen of one of these little gems (he underlined the word) can buy half the cargo of a spaceship. These jewels can make it worthwhile for the great trading ships to swarm through space out to this isolated fragment of the cosmos. You can acquire the technologies of other planets with them. The evolution of this planet can be speeded up a dozen times. You can become of importance in the scheme of things, leave this backward, primitive way of life behind you.\" As he paused for breath, one of the Nemarians spoke quietly. \"We don\u0027t want to push ahead that fast.\" He looked at Kirk serenely. \"We are interested in improving conditions here, of course. We want to acquire things that will make our lives more pleasant and luxurious. Some day we wish to become a highly developed society, technologically. We wish growth and change—but only very slowly, very carefully. We want to be very, very sure we do not bring in pain when we bring in new pleasures. We need to study each new change to see what it might mean.\" He paused. \"In this case, it took very little study. This mining project would mean the young men would be put to backbreaking labor in underground, unhealthy conditions. There might be circumstances which could justify such a thing. But not for jewels which are intrinsically worthless.\" \"Worthless! I just told you—\" \"I mean they are not valuable in themselves. You can make cheap, synthetic jewels that are almost as beautiful, can\u0027t you?\" \"Yes, of course, but—\" \"So they are only valuable because they are rare, because you call them valuable, because they show the people who buy them have enough money to buy them. Wearing them is really a way of saying, I\u0027m rich, to everyone who sees you.\" He shrugged. \"We don\u0027t care about that sort of thing here.\" Kirk clenched his fists in frustration. Maybe he should have specialized in alien psychology. He made another try. \"I know you don\u0027t. That\u0027s not the point. The point is that you can trade them for other things, for—\" The older native who had announced the Council decision broke in again. \"As you said, the mining is very hard, disagreeable work. We feel that when you begin to do disagreeable things for an end that is not valuable in itself, you are beginning to tread a dangerous path. There is no telling where it will end. One such situation leads to another. We might end up cooped up in a room all day, shut away from the sun and air, turning bolts on an assembly line to make machines, as we have heard often happens on Terra.\" He looked slightly shocked at the picture. \"Being surrounded by technical conveniences isn\u0027t worth that.\" He looked at Kirk patiently, as though this should be self-evident. \"On Terra and on most of the other planets we have had word of, people seem to spend their time making all kinds of things that have no value in themselves, because they can be sold or traded. Other people spend their time trying to persuade people to buy these useless things. Still other people spend all day making records of how many of these things have been sold. No! This path is not for us.\" He shook his head. \"We don\u0027t know how it came about that all these people spend their time at these unpleasant, useless things. They can\u0027t have wanted it that way. No human being could want to spend his time doing silly, pointless things. How could you believe in yourself? How could you walk proudly? How could you explain it to your children? We must be careful not to make the mistake of taking the first step in that direction.\" Kirk felt hopelessly confused. The reasoning was all wrong, but how could he explain it to them? He began slowly, from another angle.... \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3075/84946.html","bookId":979,"book":{"id":979,"title":"Birthright","description":"简介： Cyril Kirk\u0027s first sight of the planet from the spaceship did nothing to abate the anger seething within him. He stared at it in disgust, glad there were no other passengers left to witness his arrival....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3075","creation":"Aug 1, 2019 12:24:05 AM","modification":"Aug 1, 2019 12:24:05 AM"}}
