{"id":40347,"no":2,"title":"CHAPTER 2","content":"They were dressed, men and women alike, in a simple fold of bright-colored cloth circling their body from the waist and reaching a third of the way to their knees. Kirk noted, with a slight sense of shock, that the women wore nothing above the waist except for a strand of woven reeds, interlaced with shells and flowers, which fell loosely to their breasts. In these brief and primitive garments, the natives bore themselves with such imperious grace and assurance that for a moment Kirk felt as if his role had been abruptly reversed—as if instead of being the powerful representative of a great civilization to a backward people, he were the humble primitive waiting for their acceptance. One of the older natives stepped forward from the rest, his palm outstretched, shoulder high, in greeting. \"Welcome to Nemar,\" he said, his glance steady and gracious on Kirk\u0027s face. Kirk recognized the words of the native language with surprise. The clear, musical quality of the native\u0027s speech made his own words, harsh and grating by comparison, sound like a different language, as he replied. \"Thank you. I am very happy to be here.\" As he spoke, he realized that the lie had for a moment felt almost like truth. For a moment he wondered if the planet\u0027s apparent primitiveness was deceptive and if its simplicity concealed a highly developed culture. But even as the hope surged through him, he remembered Ross\u0027s clear and definite statement to the contrary. Besides, there would be no point in keeping a thing like that secret from the rest of the galaxy, even if it could be done. Such a culture, moreover, would certainly have things of value to trade. As these thoughts coursed through his mind, one of the Terrans stepped forward from the crowd. The insignia on his uniform were the same as his own, and he realized, with a surge of curiosity, that this must be his predecessor. The man reached forward to shake his hand. \"Hello. The name\u0027s Jerwyn.\" His tanned face was open and friendly, and reminded Kirk curiously of someone; he couldn\u0027t remember who. \"Glad to see you.\" I\u0027ll bet you are, Kirk thought: your gain, my loss. \"Greetings from Terra,\" he replied, somewhat stiffly. \"Cyril Kirk.\" He tried to keep his vague disapproval of Jerwyn\u0027s breezy informality out of his voice. It was hard to realize this man was also a Planetary Administrator. He seemed to have lost completely the look of authority that was the lifelong mark of the PA graduate. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3075/84930.html","bookId":979,"book":{"id":979,"title":"Birthright","description":"简介： Cyril Kirk\u0027s first sight of the planet from the spaceship did nothing to abate the anger seething within him. He stared at it in disgust, glad there were no other passengers left to witness his arrival....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3075","creation":"Aug 1, 2019 12:24:05 AM","modification":"Aug 1, 2019 12:24:05 AM"}}
