{"id":92720,"no":26,"title":"Page 26","content":"AFTER THIS PIECE of impromptu performance “art,” I was more than ready to retreat behind the closed door of the suite’s powder room off the entry hall.\n The last time I’d made a pit stop on the way out of a major hotel-casino’s penthouse suite, it had been to wash off blood spatter after ridding werewolf mobster Cesar Cicereau of a reanimated victim at the Gehenna Hotel in Vegas.\n Now, I just wanted to avoid Snow for a while.\n When I entered, I discovered this was a kiss-off point for the ladies.\n Here I’d been hopelessly Midwestern again, thinking vacationing married couples used this suite. Duh. It was for big spenders and their hired ladies of the night. No wonder it offered the high-tech fantasy makeover. I began to suspect the guest programmed his fantasy tart into the process. The lights in here should have been tinted red, but they, too, were green, as was anything reflected by the mirror.\n I twisted to view the back of my gown … gorgeous bias-cut green satin folds, tight through the torso and flaring into a mermaid skirt with a train. Yup, cut down to rear cleavage, which was accented with a rhinestone pin in a peacock tail design. How ironic that Snow fixated on bare white backs when his own was now hash, thanks to me. If he indeed bore no marks, the only way I’d find out would be with a rematch.\n Speaking of marks … I lifted the heavy waves of unbraided hair off my neck, but no matter which way I turned and twisted, I could just barely glimpse Ric’s love bruise.\n Well, look at you wearing a fairly fresh new skank tattoo yourself.\n Dry up, Irma, I thought.\n And then I turned to face myself in the mirror. I hadn’t heard Irma. “Lilith” stared back at me.\n I knew her because she wasn’t a mirror image. She wore low-rise jeans that underlined an “outie” belly button, pierced by a familiar blue topaz stud, whereas mine was an “innie.”\n That kind of summed up our opposing personalities, but we actually differed in this minor way? I’d assumed we were identical in everything physical, for some reason.\n “Here you are,” Lilith went on, “back in Wichita, living it up in the ‘whale’ suite. Watching boring old movies. Riding our old friend Snow hard and putting him up wet. I love it.”\n “That’s between him and me,” I said. “Or maybe you are.”\n “Nope, I never got even one orgasmic shiver out of Ice Prick. I guess he likes using you better.”\n “Why are you here again? Oh. Maybe it’s the current theme. Wicked Witch green. A little envy going on, Lilith?”\n “What you don’t know, Delilah, would fill a chasm.”\n “You know I saw your Wichita police mug shots. You got me in trouble here years ago. You were acting out and showing up on my record.”\n “I freaked out after that gross incident you know about now. I guess subconsciously I was trying to make Wichita too hot to hold me so I had to leave eventually. You sure weren’t going to bust out.”\n She made a face. “I didn’t know we were, like, the Corsican twins until that happened.”\n My mind did another rapid vintage movie rerun. The Corsican Brothers were guys, obviously, separated at birth, but they found each again because they felt each other’s pain.\n “Home run, kid,” Lilith said, as the reference registered on my face. “I couldn’t stick around and wait for you to turn bean-grinder and smell the Starbucks.” Lilith sounded guilty anyway. “That ugly doctor stuff drove me to act out … and finally move on. I hitched all the way to the Sunshine State to find Mother Dearest, though it turns out she didn’t want either of us.”\n “We have a mother?”\n “Most people do, even us.”\n “Where is she? Oh.” I remembered the La Vida Loca checks sent to Our Lady of the Lake. “Corona, California?”\n Lilith shrugged tattooed shoulders. The designs weren’t pretty, just blots of dark ink. She looked hollow-eyed and gaunt and too indifferent to really be that way.\n “Lil … are you all right?”\n “Right as acid rain,” she answered bitterly, looking toward the ceiling and rolling heavenly blue-green eyes emphasized by seriously smoked-out eyeliner. “Watch your back, Dee. There’s more than Snow with a hard-on for it. Some very bad supers are on our tails and in our future. Okay?”\n She winked out like a night-light with a dead battery.\n MY STREET CLOTHES, the unexciting navy suit, hung from a hook. On the malachite sink counter lay a set of mint-hued French underwear and a Red Carpet–level emerald-green metallic gift bag I couldn’t resist exploring.\n Immediately, a sinuous chill whipped up my spine and down my arm to cuff my right wrist in a circle of “eyes” from the peacock tail pin. It was so heavy it slipped down my hand a little and into the top of the bag. Apparently the familiar was as curious as I was.\n I pulled out green crystal bottles of beauty potions, even some old-time Emeraude perfume, green silk designer scarves, and emerald baubles inset in thick wrist cuffs.\n I left all that heavy stuff out on the counter, but slipped out of the gown and let it coil into the empty bag. No way was I leaving another evening dress behind for Snow to send me later with an enclosed lock of his insidious silken white hair. I did not need twin familiars.\n My underwear had melted off, so I donned the skimpy French stuff and my suit skirt and jacket as fast as I could. Only then did I glance down to the green carpet and spot the only red thing in the room.\n The ruby slippers.\n I bent to elevate them into the light from the overhead absinthe-colored chandelier bulbs. Up too close the combined red and green made them look black, reminding me of a nightmare, me standing on the yellow brick road in glittering funeral-black pumps.\n At least these weren’t modern, rhinestone-slathered, strappy hooker spikes.\n They were the real Oz, sweet, kitten-heeled, closed-toe pumps glittering with sequins, with a plump formal bow tie on the toes. I clutched them to my chest and closed my eyes. Maybe the makeover machinery, possibly a blend of technology and magic like CinSims, had tapped my subconscious too.\n If only I’d had the power to click my heels and bow out of all my early years in Wichita. Or maybe they’d made me what I’d become, for better as well as worse. I sat on the closed commode and did an examination of conscience. I hadn’t been to confession in years, but old school habits linger.\n What had just happened here? How had I gone from a defensively fierce virgin to playing groupie to a rock star? I dredged up the usual mixed bag of motives, outside influences, and fears.\n Guilt led the parade, of course. And pride.\n When I’d accepted Snow’s Brimstone Kiss under duress to save Ric’s life, I’d expected to “suffer” the multiple orgasms that had sent his mosh-pit groupies on fruitless quests for another kiss that would never come. My emotions were in overdrive. I was frantic about wasting time in rushing to Ric’s rescue, infuriated about being blackmailed into a sexual situation, loathing Snow and myself, terrified I would lose my free will and become a mindless sex addict. And, face it, Lilith would tell me if she hadn’t split: I’d always felt his sexual charisma as much as the most deluded groupie.\n Afterward, for all those reasons, I couldn’t bear to think of the incident, but maybe I should have. I was a trained observer, after all. Maybe in all the drama, I’d missed something vital. My mind had resisted going back there, but when I did, I realized I’d been a pretty inattentive witness, what with expecting to lose my soul and freedom and all.\n Snow had prolonged that “one only” Brimstone Kiss into seductive minutes of a sensual battle of wills. To my eternal relief, I didn’t experience even one orgasm, but I was so keyed up about what might happen that his sexual force did put me into a dreamy, erotic fog. Wincing, I recalled enough body contact to have a referee blow the whistle on it.\n I knew Snow had expected something from the whole charade, for me either to succumb or totally resist, but I’d done neither. I had been so languidly out of it for a time that he’d been able to brush my mouth across his erotic zones like I was a blow-up doll.\n I pressed the tops of my hands to cheeks flaming with fever at the returning memory picture and my self-disgust. Talk about zombies. I’d almost gone down on the world’s sexiest rock star. Missed it by that much.\n Usually, my mind fast-forwarded past humiliating moments. Now I slowed down the scene. He’d upheld me as I’d been sinking down to the floor in a swoon, letting my ebbing mouth slide against his body in a long, semi-conscious kiss, holding me almost … tenderly. As if he needed my kiss far more than I’d needed his.\n I’d berated Snow once for not having the decency to ever sleep with his groupies even while he addicted them to an impossibly rewarding kiss. I’d found that sadistic, but maybe he was celibate, had to be celibate, for a long, long time, as I was beginning to suspect. And I was the only one …\n Down with the ego, girl, Irma objected. He’s no Sleeping Beauty, just a lech who kissed you semiconscious and copped a serial feel.\n And I was just an impulsive idiot who’d thought I could duel superstar charisma and win.\n So … HOPING TO slink out of the suite, I grabbed the bag holding the gown and shoes and reentered the hall, eyes on the dead-ahead double exit doors.\n Curses! Snow appeared, string tie gone and shirt collar open to reveal and even frame the scarlet oval my mouth had burned into his albino throat. Instant contrition. I wanted that undone.\n “Ice would bring the redness down,” I suggested.\n An onstage-style head-toss made his ice-white hair shimmy as Snow smiled down at me. Those Western boot heels made him even more larger-than-life.\n “Why would you think I’d want to bring the redness down, Delilah? It amps up my rock-star image to flaunt the evidence that some hot skank has just been at me.”\n “Snow, you kill me. Everything I come up with— Albino Vampire cocktails, sensual tattoos—you turn them to your commercial advantage.”\n “Why not? You’re not a scared, damaged little girl anymore. You’re a serious and seriously sexy woman. And you’ve amped up the stakes on that too, Delilah, now that you’re living up to your name. You liked taunting me by planting a passion bruise dead center on my throat. You like seeing it there now. You like secretly knowing you’re the one who put that bold brand on rock-star me.”\n “The one?” I asked, suspicious again that he, at least, believed in fate.\n His hand cupped my head to bring my lips to his throat once more. That resonant stage voice whispered into the hair above my ear, but I could feel his words vibrate on my lips as his other hand swept the rippling hair up from my neck.\n He knew just how to cast his erotic spell on me. I felt I was in his protective custody, cherished and challenged, terrified and thrilled.\n “I doubt you care to look too much in a mirror probably crowded with ghosts right now, Delilah,” he whispered, “but if you could see, I’ve bared the lovely white nape of your neck to reveal a ripe purple passion bruise like the one you laid on me just now.”\n His cold white lips brushed the spot and I felt the touch as an electric jolt at the pit of my womb. His lips continued moving around my neck to my jawline, murmuring all the while.\n “You’ll be surprised to know I think Montoya is a damn good influence, maybe the last positive force left in Vegas. He’s a first-class crime fighter and, obviously, a hot-blooded but discreet lover. I know you two share true love and our little tangos are just an entertaining power play between what’s left of the guilty girl in you and …”\n His lips were almost on mine. Could the Brimstone Kiss still exist?\n “… whatever you think I am.\n “But we liked it, Delilah, and will again,” he said, releasing me gently. “And that you can’t change. Grizelle tells me I’ve taken three hundred and twenty-two separate lash welts on my back because of you. Now that I’ve seen what you can do for my front, I look forward to your healing every stripe on my back.”\n I fell back on my old friend, sass.\n “This was a one-off, Snow. Maybe you can hope for a freebie, if you give me the information in future I need to do my job. Tit for tat.”\n “Which will be my pleasure.”\n And it had been.\n I stared at him, trying to clear my head and emotions. Grizelle had charged me with “stealing” the Brimstone Kiss from Snow, and maybe I had, in a way. Snow’s preexisting chest scar tissue certainly was sensitive to the aphrodisiac effect of my healing kisses. I didn’t know if I could heal the three-hundred-some new scars he claimed because of me, but I knew now I couldn’t do it without giving him three-hundred-some orgasms.\n Once had been “bad” enough and could be called “prideful penitence.” Any more would be outright infidelity and too much “Hollywood Madam” to stomach. Yet it had soothed my outraged soul to take as complete sexual control of him as he had of me.\n You crazy, mixed-up minx, Irma lectured. Who knew you had it in you? I gotta admit that parting touch on the throat, over his very voice box, was genius. You won this one. So publicly intimate. Yum. His groupies will swoon and they’ll be dying to know Who.\n I don’t approve of that sort of thing, I told her stiffly. And thank you for not using “the word.” He can hide the mark with that pink-diamond-studded collar he wears onstage. Any trace will fade soon anyway.\n Yeah, but we know. And he knows.\n I’m in love with Ric.\n Yeah, me too. But you can’t help that you had unfinished business with Snow the minute you met him. That’s karma, kid. It’s not like Ric waited around twenty-four years for you. And, as the politicians say over and over again for the stupid media who never seem to get it … foreplay doesn’t count, just like the calories in chocolate don’t. Free pass.\n I didn’t believe in free passes. I guess that was my religion.\n “A word of warning before you leave,” Snow said in the all-too-uncomfortable present now.\n He turned me to face the bathroom mirror through the open door, despite the possibility of ghosts. My usually colorless cheeks were as flushed as the intensifying bruise on his throat. I looked guilty. He just looked hotter.\n “The Brimstone Kiss is more powerful than even I knew,” Snow said. “Be careful whom you kiss from now on, Delilah Street, how hard and where. Be careful whom you let kiss you, how hard and where.\n “Bruise, but don’t bite or be bitten. That’s not a bad motto for handling whatever the whole damn Millennium Revelation throws your way.” \n","sourceLink":"https://allnovel.net/silver-zombie-delilah-street-4/page-26.html","bookId":2116,"book":{"id":2116,"title":"Silver Zombie (Delilah Street #4)","description":"Storyline: \n Silver Zombie (Delilah Street #4) \n Zombies and Witches and Vamps . . . Oh, My! What happens in Vegas stays in Vegas—at least that’s Delilah Street’s hope. With Sin City’s vampire and werewolf mobs wanting to cash in her chips once and for all, she’s retreating with her partner Ric Montoya and half-wolfhound Quicksilver to her Kansas birthplace. Unfortunately, when it comes to finding trouble, there’s no place like home. . . . \n It doesn’t take long before Delilah realizes she’s not in Vegas anymore. Zombie cowboys and spectral cattle drives are kicking up dust, the local weather girls are total witches who forecast perfect storms, and some Hollywood fanatic is recasting zombies as the greatest stars of the silver screen. And speaking of silver, Delilah’s special affinity for the all-purpose monster-repellent leads her posse straight down a silver brick road—and into a notso- fun house of mirrors—putting her face-to-face with her dicey past and a mystery woman named Lilith, who’s a real dead ringer for Delilah. The key word being dead.\n \n","cover":"https://allnovel.net/images/silver-zombie-delilah-street-4.jpg","author":"Carole Nelson Douglas","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/silver-zombie-delilah-street-4.html","creation":"Oct 5, 2019 8:58:21 AM","modification":"Oct 5, 2019 5:56:49 PM"}}
