{"id":92726,"no":32,"title":"Page 32","content":"I TURNED FROM the green-mirrored penthouse suite bar, pleased to have seen only my reflection.\n My gown’s emerald-satin bias-cut skirt swirled around my legs as it wafted to display my ankles and the demure ruby red slippers I wore. So I was a bit Merry Christmas-y for summer, so sue me. This was my last personal appearance at Emerald City and I wanted to make it an occasion.\n I craned my neck to see who had just committed a wolf whistle when my admittedly bare back was turned.\n I faced a full house of suspects, so to speak.\n The penthouse suite’s long green leather sofa now seated three men, Ric, Leonard Tallgrass, and Ben Hassard.\n Snow lounged in an emerald-velvet club chair and I was even less sure now that either he or Ric qualified simply as a man.\n Quicksilver lounged in front of Tallgrass on the grass-green carpeting in his “Sphinx” position, belly down and forelegs extended. I knew he wasn’t simply a dog.\n The row of human male eyes were still dazzled from eyeing my gownless back with the silver familiar forming a long supple diamond dividing line down my spine. Even the familiar was putting on the dog tonight. Usually it was content to morph into rhinestones or Austrian crystals, since I was no jewelry snob.\n Snow, of course, was seeing everything through very dark sunglasses.\n I held up a tall, stemmed glass.\n Finally. A little male attention that wasn’t focused on the Silver Zombie standing at robotic attention behind a seated Ric. She sure did shine.\n Normally, I’m not a show-off, but my new cocktail creation deserved a dramatic introduction. It flouted the Emerald City color scheme, being an opaque, faintly blue silver color, whereas absinthe was opaque green. A dash of vivid blue curaçao at the bottom made it something of a Tequila Sunrise in a blue mood and reflected a circle of electric blue at the cocktail’s top rim.\n “Gentlemen, and lady,” I said. “Introducing the latest entry in Delilah’s Darkside Bar Book of Paranormally Phenomenal Cocktails, I give you … the Silver Zombie.”\n The applause and whistles still didn’t give away the lone wolf among them.\n Snow wouldn’t whistle even onstage. Ric had a mischievous streak but had been acting too possessive lately to draw other men’s attention to me.\n Leonard Tallgrass cultivated a poker face, but just might be up to it. Ben Hassard, patched up and very grateful to me, might have been unable to quell his enthusiasm.\n Quicksilver had a lot of wolf in him, but was a howler by nature. And Maria, the Metropolis robot, lacked the necessary moving mouth parts.\n We really must get this metal maiden a jazzier name, Irma said. “I’ve Just Met a Robot Named Maria” won’t burn out any lights on Broadway.\n Irma was right. She needed an updated name. Maybe Brigitte, for the teenage German actress who’d played both human and robot roles. Darn, sounded too sexy.\n “What’s in the drink?” Ben Hassard wanted to know.\n “Three chilled ounces each of Fuse blueberry raspberry water champagne. An ounce of José Cuervo Silver tequila, an ounce and a half of lime vodka, an ounce of Alizé Bleu brandy, fruit and vodka mix, and a dash of blue curaçao dribbled down the inside of the glass so it sinks to the bottom.”\n “That sounds like enough goodies to make a zombie out of me,” Ben said. “I’ll drink to that.”\n So I gestured to the line of four Silver Zombies on the malachite bar top behind me.\n Maria surprised me by being the first to approach, eerily noiseless for a silver metal woman. Actually, the film robot’s likeness had been constructed from a new material, plastic wood, painted silver and bronze. Brigitte had to act as her own body double and wear the modern suit of armor even during nonspeaking camera shots, although it cut and bruised her body. How ironic it was, but not unlikely, that a film about abused workers would abuse its lead actress.\n And that’s when I realized that Maria was already a true CinSim. She had a built-in zombie body, that of the dead actress, Brigitte Helm. That is what—who—Ric had raised. How mind-bending was that? I thought I’d keep that insight to myself for a while.\n Maria turned and, doing her C-3PO routine, brought a glass to … Ric.\n The poor futuristic thing still thought like an Old World body servant. I was probably the only one in this room who knew that CinSims could “grow” beyond their original film personas, so I hoped this one got wise to the imprisoned superstar future Snow had in mind for her sooner rather than later.\n Did the Inferno Hotel honcho somehow read or guess my rebellious wish?\n Snow stood abruptly to claim two glasses from the bar and present them to Tallgrass and Hassard, now rising from their seats to accept them.\n Snow stepped back to the bar, leaned against it, and took the last glass. Of course, from that strategic position he could better view his favorite part of my anatomy and simultaneously remind me of what I owed him. Three hundred and twenty-two bottles of beer on the wall … the paraphrased drinking song ran through my head. I’d never dreamed that stupid verse would have an erotic connection.\n Heck, honey, Irma pointed out, they all can eyeball your naked back with that mirror behind the bar. She giggled. Except your skin looks almost Wicked Witch of the West green. It matches your gown, but it’s your least favorite color, and you’re even wearing her shoes. Remember, Dorothy got the ruby slippers from the WWW’s dead body through the Good Witch Glinda’s intervention. Any message for the future in those facts?\n Maybe for Lilah West back in Vegas’s Sunset City, I told Irma. She’d always wanted to play Glinda. Perhaps she finally did somehow, seeing to her wicked sister’s coven of weather witches fall from grace here.\n “A toast,” Ben Hassard announced to those present, which did not include Irma.\n He lifted his Silver Zombie. “To Emerald City’s booming future, to the destruction of all my immortal enemies, and to the good fortune of all my unsuspected friends.”\n “To unsuspected friends.”\n The end of the phrase was murmured around the room as Ric moved beside me. His arm slipped around my bare waist, caressing me as he and I chimed glass rims. I felt my world had snapped back into place after a few moments of temporary insanity.\n “Amor,” he murmured against the glass rims that separated us.\n “Amor,” I repeated the toast, under my breath.\n Meanwhile, the public self-congratulations continued.\n “To unsuspected enemies and immortal friends,” Snow rephrased Ben’s toast, his sonorous voice wafting from behind my back. “May we always be able to tell them apart.”\n Quicksilver added a canine arf of agreement to that, and of course we all laughed, as the cast so often did at the end of so many movies.\n Maria, the universally sought CinSim robot from Metropolis, did not laugh. She just stood there in aloof metal majesty and shone like the once and future star she was and would be.\n Forever and ever.\n Amen.\n I was betting she was a virgin, poor thing. \n","sourceLink":"https://allnovel.net/silver-zombie-delilah-street-4/page-32.html","bookId":2116,"book":{"id":2116,"title":"Silver Zombie (Delilah Street #4)","description":"Storyline: \n Silver Zombie (Delilah Street #4) \n Zombies and Witches and Vamps . . . Oh, My! What happens in Vegas stays in Vegas—at least that’s Delilah Street’s hope. With Sin City’s vampire and werewolf mobs wanting to cash in her chips once and for all, she’s retreating with her partner Ric Montoya and half-wolfhound Quicksilver to her Kansas birthplace. Unfortunately, when it comes to finding trouble, there’s no place like home. . . . \n It doesn’t take long before Delilah realizes she’s not in Vegas anymore. Zombie cowboys and spectral cattle drives are kicking up dust, the local weather girls are total witches who forecast perfect storms, and some Hollywood fanatic is recasting zombies as the greatest stars of the silver screen. And speaking of silver, Delilah’s special affinity for the all-purpose monster-repellent leads her posse straight down a silver brick road—and into a notso- fun house of mirrors—putting her face-to-face with her dicey past and a mystery woman named Lilith, who’s a real dead ringer for Delilah. The key word being dead.\n \n","cover":"https://allnovel.net/images/silver-zombie-delilah-street-4.jpg","author":"Carole Nelson Douglas","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/silver-zombie-delilah-street-4.html","creation":"Oct 5, 2019 8:58:21 AM","modification":"Oct 5, 2019 5:56:49 PM"}}
