{"id":89456,"no":13,"title":"Page 13","content":"Almost at random she said, \"I miss woodskeeping because I knew how to do it. The Chalice is a bloodright, like the Mastership is, but it seems to me much like finding water. The rods in the dowser\u0027s hands draw down till they crack, and when the hole is dug the water springs up, but one must still brick in the well or the channel or the pond, or the water will spread itself out and sink back into the earth again and be lost. I do not know how to brick my channel. I feel - I feel as if I am trying to hold back a river with my hands. The Chalice energy is strong...and I am weak and foolish. At first, when it only seemed to be about mixing cups and standing in doorways, I thought I could learn enough to - to appear to be Chalice. That part even made some sense to me: water is the basis of all things, the thing of all things we need to stay alive, and whenever I was in doubt I put a little honey in; and there were books that told me the usual, the standard mixtures for the usual, standard gatherings. By narrowing it down to the most visible, the best-known, of the Chalice\u0027s work - the bit where she dresses up like a mummer and stands around holding a big flashy cup with enamel and jewels on it - I could think about trying to learn it, despite the daily - hourly - sinking of the heart at the size of the task. Don\u0027t think about it; just put something in a cup and stir. \"At first, after your brother died, the demesne was in such disarray that the least gesture toward coherence seemed a great one. But disarray has its own destructive inertia and those small gestures have meant less and less; and my faith that I am learning to make them correctly is too slow and slight a thing to set against...and I have made a terrible error from ignorance.\" His silence was a waiting and listening silence. And would he not have heard the story already, from someone else? Might not the thought that his own Chalice preferred the Heir have further urged him to consider ceding Mastership? What if he thought her someone who would say one thing to him - as she had just done - while saying, and doing, something else entirely when he was not there? And so at last she said, draggingly, \"The Heir came to me. I spent time with him, as Chalice, as a way of keeping distance between us, because I did not want to spend time with him at all, and I did not know that the Chalice could send the Heir away. The Grand Seneschal told me - told me that I could have sent him away. I would not have known else. \"The Grand Seneschal told me that the Chalice had been seen alone with the Heir and had thus indicated her championing of him. I did not know. It is what I did not want - of all things what I did not want. The Grand Seneschal said it was a result of my lack of training; but that is something there is no cure for. I see no comfort - nor useful penance - there. The Grand Seneschal has said he will try to counter the damage I have done with a tale of my shameful ignorance, and that I must - must make up - some tale in support. But I cannot see that the revelation that your demesne\u0027s Chalice is inept and imprudent is going to be seen as a satisfactory situation in a demesne struggling for balance - for its life.\" Again she stopped. After a pause he said, \"I am worse than you, because I have spent useless days in the company of various members of my Circle, knowing that as Master I could send them away, but not able to believe in my Mastership enough to do so.\" \"That is only kindness,\" she said. \"You will lose nothing in anyone\u0027s eyes for kindness, and something, I think, you will gain.\" \"That is a remark the Chalice would make,\" he said, \"a Chalice wishing to affirm her Master\u0027s binding to his bloodright.\" \"You are bound,\" she said. \"As am I.\" \"Yes,\" he said, \"I am. But binding cannot necessarily quiet that which has been bound. My people fear me. They fear me and they fear my touch - with justice, as you know. They flinch away from me when I walk among them.\" At the unfairness of this she cried out, \"You have only burnt one person! And you were tired near death and only just returned from Fire!\" Gently he said, \"I know this too. As does my Circle - as do my people. But they also know that there is always a hesitation - sometimes so slight that were they not looking for it they would not see it - before I touch anyone or anything. If I know the need is coming for me to lay my hand somewhere, I can prepare. A sudden grasp - I cannot do it. A stair banister, a dinner plate, even Ponty\u0027s mane - no harm. But if I touched bare human flesh suddenly, I would still burn it.\" She did not know this. She could say nothing; think of nothing to say. No...she had guessed as much. Guessed that it was not only the Master\u0027s continuing physical awkwardness that caused all those brief pauses. She had sometimes thought that they came from his having to remember what he was doing, what gesture he needed, what action he had next to perform; a kind of physical translation, as from one language to another. But she had still known, though she had not wanted to know, that while that was a part of it, it was only a part. She must say something, but what reassurance could she offer? It had been over half a year since the Master had come home, and still Fire ran in him this strongly? Perhaps the priests of Fire had been right that he could not return. \"By the fourth level,\" he said sadly, \"an Elemental priest can again go into the world, if he so chooses, because his metamorphosis is complete.\" She knew of the temples in the cities where the priests\u0027 abbeys lay, where the Elemental priests occasionally came to hold rites for ordinary humans. The priests were described as superhumanly beautiful, miraculously graceful and utterly terrifying. \"But they mostly choose not to come,\" she said. \"And they cannot stay, because they can no longer live among humans. Among us. A fourth-level priest would never have been sent home to be Master of his demesne. And I have never heard of one stopping a forest fire.\" Thoughtfully he went on, as if he had not heard her, \"Occasionally I have seen one or another of my people creep up to Ponty - when I have been some safe little distance away - and pat him, quickly and as if surreptitiously, as if checking that he is real horseflesh - or as if he were a charm against his rider.\" \"Ponty,\" she said. \"Ponty must do you good among the people of Willowlands; who could fear Ponty?\" \"It is not Ponty they fear,\" he said patiently, as if she were a student who was refusing to learn her lesson. She shook her head. She did not want to say yet more against his brother; but what she was thinking of were the increasingly wild, trampling horses her Master\u0027s brother had chosen to ride round his demesne, as if he were trying to frighten his own folk - as if he were trying to hammer the earthlines into passivity, into acceptance of his misuse of them. But he did not burn human flesh if he thoughtlessly touched it. Did it matter? Her Master touched the earthlines softly - she knew this; more and more she could read the influence he was gaining over the solid earth and invisible air of his demesne; those parts of his Mastership which he could not burn. Had a demesne ever had an inhuman Master before? He said, \"And they do not fear Horuld.\" \"There is still time,\" she said, hearing the emptiness of her own words: was there ever a more useless remark than \"Give it time\"? \"The Chalice has no Heir - no apprentice. And I am not yet fit to take an apprentice - if I ever shall be.\" \"Did you ask Listening Hill for a Chalice\u0027s Heir? Or did you ask how to unbind mine, to reveal him as unworthy and incapable?\" It was no more than she deserved. She took a deep breath. \"I do not know how to ask an oracle anything. The tale that was once told among us small people - among woodskeepers and beekeepers and shepherds and dairy folk - is that Listening Hill, did you fall asleep on it, would tell a man if his wife were unfaithful, and a woman whom she was to marry.\" He followed her thought, but not far enough. \"A Chalice cannot be married against her will.\" She thought of lying to him, but there were too many broken laws and too much harm done to the demesne already by the lies of a Master who had dishonoured his bloodright and a Chalice who had not tried to stop him. Now she was Chalice, and she could not lie to her Master. She knew little enough, as the Grand Seneschal had reminded her, but even she knew that much. \"I have been reading as hastily as I can about the treatment of an outblood Heir. It is not only the cups I must give him, it is - everything. It is all that everything that I do not know, that let me make the wrong decision the other day when he sought my company. I accept the responsibility of binding him as Heir as the Chalice must, but I - yes, I wish to bind you, the Master, more. You are Master, and so it is what I must do but I also do not - I do not feel - I do not feel safe with Horuld. The Chalice is not easy in me when he is walking in Willowlands. It may be that the Chalice bloodright only recognises that he is outblood. But it may be something more. I fear it, whatever it is. \"And I read, yesterday, that in the case of an outblood Heir coming to Mastership, the best way for the transition to be successfully made is that the Chalice marry him. It is a small dusty book - but all the books in the library are dusty - I believe it is not well known, that an outblood Heir may marry his Chalice; aside that it is against the usual law forbidding any such bond, there may be other reasons against it that I do not know. Those reasons may even be in that same small dusty book which I can no longer bear to pick up, let alone read. But I am sure the Overlord knows, and Horuld, of this exception, when an outblood Heir inherits. I saw - I wondered - I am sure, now, that this is in their minds - even perhaps that this is their plan. It was more, that day, when I spent that mistaken, irretrievable time with Horuld, than merely that he was currying favour with the Chalice. I knew it at the time; I only did not know what it was. I knew that it made my flesh creep. \"I - I cannot face this. I came to the Chalice too late; my apprenticeship should have begun when I was still a child, so that I could grow up within it - it within me - and it have the chance to shape me. I had inherited my father\u0027s woodright six years before the Circle came to me at my cottage, and my mother\u0027s bees four years before. They came and found a madwoman milking her goats three times a day while her cottage floor ran with mead and the bees were so thick they were like a canopy over the meadow. When I saw them coming I burst into tears. When they told me what they had come for, I could not believe it. I could not. Perhaps it is the Chalice\u0027s duty to marry an outblood Heir, but I cannot.\" There was a long pause while Mirasol wished she could see his face. At last, musingly, he said, \"I had great difficulty when I was first sent away, because I had not wanted to be sent. But the priests are, I fear, accustomed to that, and care only that you are suited to enter Fire at last; the rest, they believe, will come in time. Indeed, when I finally did enter, I felt at home there, at home in a way that I had not been able to feel here, because of my brother. I had been too young to understand much of what the Master did when my father was still Master; the murmur of the earthlines seemed no more to me than the singing of the birds, and rather less than the nicker of my pony when he saw me coming with the bulges in my pockets that meant apples. But when our father died and my brother took the bloodright, I felt it, and felt it very strongly that he was not working in a way best for the demesne.... What I feel now is that Fire taught me what I should be looking to do now, but in some other land, language - dimension. Fire taught me a skill of care and guardianship that I feel I should be able to adapt but somehow I cannot. \"I do not miss Fire the way I missed Willowlands when I was sent away. And the way I seem still to miss Willowlands now. \"The priests would have an answer to that. Indeed I think they tried to tell me before I left. When I came, they said, I was too old; Fire too prefers its apprentices young. But Fire could still bring me to itself, if I let it, and having read me, they believed I would - could - let it. But it is hard to leave one\u0027s...humanity behind. Especially if one is already a man grown. How did you say it? That your apprenticeship should have begun when you were still a child, that you might grow up within it and it within you, and it have the chance to shape you. Yes.\" He held out a black hand. \"I am blacker than most of the Fire priests, because there was more of me to burn. But perhaps that is also why, even from the third level, I was able to make the attempt to return to the mundane world. I almost did not make that journey, however; I believe I almost died, although the priests did not tell me so. \"And now...it is not Fire that is blocking my way back into Willowlands, but it is perhaps Fire that burned me too well, because I am hollow where I need to be full. \"I cannot promise to remain your Master, even to save you, although I would if I could. I - I cannot think how to say it. The I in Fire is not the same I as in the world, and I am neither the one nor the other. A Master must save his folk as he is able, and able he must be; it is what a Master is for. And a Master treats his Chalice as if she were the finest crystal.\" \"The Master\u0027s wedding cup is crystal so delicate that the rule is you may put only two mouthfuls of the drink in it, one each for the bride and groom,\" she said dully, as if reciting a memorised text. There was another pause. \"Mirasol,\" he said; she looked at him, puzzled. \"Mirasol is your name. I...cannot remember mine. In Fire I was Azungbai.\" \"Liapnir,\" she whispered. \"The last Master\u0027s younger brother\u0027s name was Liapnir, the younger brother he sent away to the priests of Fire.\" \"Liapnir,\" he said. \"Liapnir would save Mirasol if he could.\" The next few weeks were hectic. She was almost grateful, despite that it meant she did no more reading about outblood Heirs; at least it meant she also made no more horrifying discoveries. She was almost constantly in attendance at the House or the six and twenty-four fanes and outposts of the Circle; when she was not holding a cup she was pouring patterns of water and mead over the least quiet of the demesne\u0027s hills and dells, copses and meadows. She thought grimly, Now that it is possibly too late, folk are remembering what a Chalice is for. People asked her to lay the restless energies in this or that place that fell within their tending, or that they often walked near, or was where they drew their water. This tradition of the Chalice had fallen away during the last several years of the previous Chalice\u0027s governance. Mirasol did not know whether to be pleased that she was fitting into the role - or at least perceived as fitting into it - or worried that if the folk chose to come to an unsatisfactory Chalice, they must do so because they believed the Master to be more disappointing still. She thought - she hoped - she could see the ripples spreading from Kenti telling the story of Tis\u0027 burnt arm. She\u0027d had Kenti\u0027s neighbour Vel asking about his well first, where about once a sennight for about a day the water tasted strongly of roses - \"It\u0027s nice, the wife likes it, and she\u0027ll be sorry if you take it away, but it\u0027s a little queer and queer is...queer.\" She forbore to ask how long this had been happening, and why he was only coming to ask her about it now. After Vel there was Frak, an old mate of Danel\u0027s, asking if she could do anything about a quiet, flat-seeming field where the furrows refused to cut straight; and after Frak was Droman, who worked on the same farm, who wanted something for the ground under a bit of fence that kept falling down and letting the sheep out. She might, once or twice, have asked one of the others of the Circle to help her - Landsman or Oakstaff, perhaps, with a restless spinney or meadow - but she did not. At this rate, she thought, I\u0027ll have to take an apprentice just because I need the help. At least I could teach her to take care of bees. She\u0027d have to be able to read; but then maybe she could teach me something about the Chalice.... She surprised herself by considering this possibility seriously for a minute or two, and then thought, No. Not yet. Wait till...but she could not put it into words, even to herself. But when Catu came to discuss with her the possibility of letting it be known that the Chalice could heal burns and wounds as well as Catu could, she said: \"I\u0027d be glad of it; and if you can cure a few stomach-aches too that would be even better; I have more work than Silla\" - who was Catu\u0027s apprentice - \"and I can do, and I\u0027d rather be birthing babies.\" And Mirasol almost replied, \"Only if you find me a good girl for apprentice. Silla doesn\u0027t have any younger sisters, does she?\" She said instead, \"I\u0027ll help anyone I can.\" Catu looked at her shrewdly. \"You aren\u0027t getting enough sleep, are you? Is it work or worry?\" Mirasol shook her head. \"Both. Everything.\" \"I should have come before - Mirasol, I\u0027m sorry. You know how - confused - everything has been, since the old Master died. I know it\u0027s been a hard transition for you - I know that I can\u0027t imagine how hard a transition - but I\u0027ve been run off my legs myself. The next time I\u0027m going this way I\u0027ll bring you something to help you sleep. The quietening herbs I gave you helped, didn\u0027t they? Oh dear - if it\u0027s work that\u0027s keeping you up, I shouldn\u0027t be adding to it, should I? But - well, it would be good if...\" She hesitated. \"The Chalice before the last one - she was Chalice almost sixty years. And our Master\u0027s father - he was a good Master but not an easy man - and as is the way of things, most of his Circle was like him. That\u0027s some of the problem now, of course, there are a few of them left, and the others, they took as apprentices folk who were as near like to them as the rods would let them. And so the people went to their Chalice, who was not like the others. Everyone knew her.\" \"Yes. Nara is the commonest woman\u0027s name in Willowlands, because it was her name.\" \"Yes. In sixty years I hope the commonest woman\u0027s name is Mirasol.\" Mirasol smiled, tiredly. And Nara\u0027s Master was as friendly and approachable as a puppy or your grandmother, compared to the one we have now, and most of his Circle is united only in their aversion to him. What would you think of Horuld as a Master? What would Silla think? What would the mothers of your babies think? \"Send me your wounds and burns and stomach-aches then.\" But it was Kenti who brought two little packets from Catu - \"this one\u0027s for if you\u0027re lying awake thinking, and this one\u0027s if you\u0027re just too tired to sleep\" - plus two loaves of bread and a big jar of potted meat. \"I asked Catu - she didn\u0027t think it would be - she thought it would be - she told me these were to help you sleep, that you were working too hard, and I said I didn\u0027t think you were eating properly, I know it\u0027s easy not to when you\u0027re too busy, but even honey isn\u0027t enough by itself....\" Her voice trailed away and she looked at Mirasol anxiously. Mirasol reached out and took the parcels. \"It\u0027s very kind of you, thank you,\" she said. Very little money changed hands among the small folk of a demesne; some duty was paid in coin, but most of the economy was based on barter and exchange. The Chalice, like the other members of the Circle, received a stipend for the work she did (disbursed by the Grand Seneschal), and unless there was some very complex ritual involved, ordinary demesne folk were not expected to pay for help from a Circle member. (Given her book-and-paper habit, Mirasol was glad she had honey and beeswax to sell.) But popular Circle members tended to have very well-stocked larders and very well-maintained properties, or known and frequently augmented collections of things on display at the House. Nara had collected wood carvings; there was a dormouse in linden wood in the Yellow Room which had belonged to her that Mirasol was absurdly fond of. Occasionally she took her books and papers to the Yellow Room and when she did she always lifted the dormouse down from its shelf to sit on her work-table. Mirasol\u0027s hands shook a little as she cradled the parcels. \"How is Tis?\" Kenti laughed with an easiness that told Mirasol what she wanted to know. \"She\u0027s absolutely fine. Except she gives the stove a wide berth - which is no bad thing. She\u0027s with her cousins today, so that I could get some things done.\" She hesitated. \"I - I told Danel and my sister what you said about the Master - about him healing your hand. I - I hope you don\u0027t mind.\" \"On the contrary,\" Mirasol said sincerely, and her heart sang within her. \"It is hard to - to - to like him,\" Kenti said, obviously finding words with difficulty, \"although I know it\u0027s not liking a Master needs from his people. Danel says his horses aren\u0027t always shying at ghosts any more - any more nor horses always shy at ghosts - especially the young \u0027uns, and that that\u0027ll be the Master taking hold like a proper Master, and the earthlines quietening under him, and never mind what he looks like. But those red eyes - I can\u0027t - what does he see with those red eyes?\" \"He sees warmth,\" said Mirasol. \"When he looks into a tree where a bird sits singing, where you and I could not see it hidden behind the leaves, he will see the outline of its warmth.\" \"But they - But he - \" \"You get used to it,\" Mirasol said. Kenti looked at her sidelong. \"There\u0027s a story that you spent the day with the Heir. That you...favour him.\" The day, thought Mirasol miserably. She took a deep breath and said, \"I - I feel that the Heir\u0027s connection with the demesne is - is not as strong as it might be. If he is Heir, then he must be bound here - for the Master\u0027s sake. Binding is the Chalice\u0027s work. But we have a Master - a good Master. Whatever colour his eyes are. The Heir is only the Heir.\" Kenti\u0027s face was wearing that hopeful, thoughtful look again when she left, the look she had worn when Mirasol had told her about the Master healing her hand. Mirasol hoped Kenti would tell the story of why the Chalice had spent time with the Heir too - and hoped that her sister was a chatterbox. She could not tell - or guess - how much or how little her mistake with the Heir might have contributed to any new restlessness among the demesne\u0027s folk. She heard other reverberations of both her behaviour and the Grand Seneschal\u0027s commentary on it. When she could - since few people asked her as directly as Kenti had, as if healing her daughter\u0027s arm had somehow made the Chalice accessible - she said she had mistaken the Heir\u0027s purpose in consulting her; that she had wished not to embarrass him by revealing his shortcomings. It was the nearest she could come to the Seneschal\u0027s suggestion that she insinuate the Heir was unworthy or unfit. She was afraid that her real revulsion would be exposed if she spoke too near it. She had, by now, learnt enough to be Chalice when she wished not to be questioned further, and mostly she was as saddened as she was relieved when it worked. She told Selim the truth about that day: that she\u0027d been stupid because she didn\u0027t know any better. She even managed to make Selim laugh by describing her consternation when she looked up and saw the Grand Seneschal standing in the library door. But the laugh stopped too soon and worry took its place. Selim was no fool, and she knew the danger the demesne was in; she was of another old family, and the land spoke in her blood too. Mirasol thought, if there were enough of the old families, perhaps we could drive the Heir away. Perhaps there is a better candidate for Heir right here in Willowlands, disguised as a houndsman or a small woodskeeper.... But what if it is not that Horuld is a poor tool in the hand of the Overlord which might snap from pressure; what if it is that this is the way it is, having an outblood Heir? That the true blood repels it, like iron filings from a magnet? \"Tell it around,\" said Mirasol. \"Please. The Seneschal warned me what was happening - and Kenti asked me in so many words if I favoured the Heir.\" \"I will,\" Selim said grimly. \"I may leave out the part about your being stupid.\" Mirasol recognised the joke, and laughed. \"I worry about you, Mirasol,\" said Selim. \"I am happy to trust you with my life - remember the night we saved Cag\u0027s barn from burning down? - but it seems to me that you\u0027ve been thrown in quicksand and told to learn to swim. And the Master - \" \"The Master is learning,\" said Mirasol quickly. \"Remember Danel\u0027s horses.\" \"The land and the beasts may be learning to listen to him,\" said Selim. \"I am not so sure about the people. Would the story of you favouring the Heir have flown so quickly if they weren\u0027t hoping it was true?\" Once Mirasol was so tired that she fell asleep sitting on one of the stone chairs outside her cottage, on an afternoon that was just warm enough to permit the chilly folly of sitting outdoors in the sunlight for a few moments. She had brought another book from the House library back with her to read, but her mind kept turning in spirals very like the ones she trickled from the lip of a Chalice cup. She only closed her eyes for a moment, her face turned up toward the sun, thinking that she could smell the mead and the herbs she had chosen that day for a field where the cattle would not stay...at least there had been no more cracks in the earth...Faine\u0027s wife had bought honey from her for the first time a few weeks ago, and said that Daisy\u0027s calf was a fine strong heifer...here by her cottage she could always smell mead and herbs...when she woke it was twilight, and her nose was cold, but she was warmly covered by a blanket of bees. She did not see the Master alone again, although he looked into her face with a directness no other member of the Circle did when he accepted the cup she raised to his lips.","sourceLink":"https://allnovel.net/chalice/page-13.html","bookId":2087,"book":{"id":2087,"title":"Chalice","description":"Storyline: Chalice was published in 2008. It was written by fantasy author Robin McKinley, who lives in England. McKinley has won several awards for her writing, some of which has been popular with young readers, and some with mature ones. Her work has been published for thirty years. She has re-told old fairy tales, and the story of Robin Hood, sub-created a country, Damar, in a world like some of the desert or near-desert parts of ours, except that there are dragons. In Chalice, she has written a book which takes place in a country that seems entirely of McKinley\u0027s creation, except that the culture approximates that of the Middle Ages. There are horses and carriages, but no steam engines, swords but no gunpowder.","cover":"https://allnovel.net/images/chalice.jpg","author":"Robin McKinley","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/chalice.html","creation":"Oct 5, 2019 8:58:19 AM","modification":"Oct 5, 2019 5:35:37 PM"}}
