{"id":89459,"no":16,"title":"Page 16","content":"\"Save our demesne,\" he said immediately. \"I don\u0027t care how you do it. But I know what the faenorn means. And I never heard that an outblood Master was anything but loss and ruin to any demesne. Whatever else our Master is, he\u0027s the right blood.\"\n Despairingly she thought, Are his people are turning to the Master at last, now that it is too late? Or have I not noticed this happening because I have been too aware that his Circle still turns away from him? For a moment her mind went blank with grief and regret. But then she thought: It does not matter - even if all the people in a demesne stood together against him, an Overlord would still win out over them. There was never anything any of us could do to stop what this Overlord wills.\n \"I - I will do what I can,\" she said. \"Before and after the faenorn.\"\n A second pony was led up, its saddle creaking and clattering with flasks and bottles.\n \"Is there aught else I can do for you, missus?\" said the stablemaster.\n \"Pray for me,\" she said. \"Light a candle. Do you have a honey or a beeswax candle?\"\n \"Yes, missus,\" he said. \"We all have one of yours, up here at the House.\"\n \"Do you?\" she said, surprised.\n \"For luck,\" he said. \"We know our Chalice is a honey Chalice - and that none has been such before. And we need all the luck we can find since the old Master, and the old Chalice, died. We, most of us, we can\u0027t afford beeswax candles, but we all have one of your candles, missus. We don\u0027t burn \u0027em. We keep \u0027em, for luck.\"\n \"Burn them now,\" she said. \"Burn them over the next five days, between now and the faenorn.\"\n \"I will, missus,\" he said, and dropped his hands to his sides. \"And I\u0027ll tell the others to do the same.\"\n \"Thank you,\" she said.\n \"May the gods of the land and the earthlines bless your journey,\" he replied.\n She took the ponies straight back to the cottage and spent some time - too much time - arranging, rearranging and agonising. She needed rest so she might think more clearly; she did not have time for rest, and the ponies were fresh. But she would not come back here; what she took with her now would have to do.\n They left at sunset, the ponies mildly puzzled at setting out again so late, but too polite to protest still wearing their harness when they wanted to graze and doze. They were lucky in the moon; she would be full in four days, and if they were lucky in the weather as well there would be light enough to see by for most of the dark hours. She pointed the ponies\u0027 noses southwest; they would go to the Great Tor, and the ponies could rest while she did a more elaborate ritual there. Then they would go to the Ladywell; she did not have much of her water left, and she must have enough for the next five days. They would stop long enough there for the ponies to rest again, but they would have to go on as soon as Mirasol was finished. They needed to begin the Circle points by tomorrow noon.\n They did more than fifty leagues in the five days left to them. She had not looked at a map of the demesne since she had first been found as Chalice, though there were many maps at the House. She knew she could find her way around the edges, along the boundaries, because the earthlines would tell her where they lay; what she had not expected was how ragged and whimsical some of those boundaries were, or had become, over the centuries, as Willowlands learned to fit comfortably against its neighbours. It was like bodies in a bed, she thought, each trying not to put an elbow in another\u0027s eye. The old woodskeepers\u0027 map had showed the boundaries as being regular and straight, except when one followed a stream; at least the stream boundaries, she found, still ran through the streams, where the map showed them. The rest curled and curved, bent and dented. That made the way longer. And many of the places she wanted specifically to secure were not on the boundary itself, but a little way inside.\n Also she thought of several places that as Chalice she should open and speak to, which she had not thought of when she made her plans, that the binding over all should be stronger, like extra fence posts in a fence. And then there were those small, anonymous dells and hollows or meadows and mounds which slipped into her mind like bees through a window as she passed them, and when this happened she turned off to go to them. When she slid off her pony and put her hands on the earth or the tree or the stone or in the water it seemed to her that something came to her, the something that had called her. Be thou one-hearted, she said. Thou art Willowlands, each and all of you. She thought they listened. She hoped they listened.\n There were many of these. And they made the way longer yet.\n Gallant, she found, was better at obeying her legs and heels while she scattered the sweet drops from her flasks as they walked, and so she rode him more often than Ironfoot; but remembering that Gallant might not let her know he was tiring till he was half foundered, and knowing that she wasn\u0027t paying enough attention to anything but what the earthlines were telling her, sometimes she got off and walked too. She only stopped at the places that needed more than a few drops from the tips of her fingers: the places whose attention she had to catch first - or those who had caught hers - or where she needed the opening or the binding to be particularly strong - the fence posts for her fence, the cornerstones for her House.\n Other than these she only stopped when the ponies needed rest, and while they rested she mixed more mead and honey and Ladywell water from her flasks, and added herbs or didn\u0027t, and dropped in or took out stones; and topped the result up with whatever local water she could find. Occasionally the ponies had quite a long rest - or no rest at all - because she could not find a water source that suited her. Some ponds had lain in their beds and dreamed for too long; some streams rushed in spate for the love of the violence of it. Sometimes she could balance a sleepy or a riotous water with a particular honey, but sometimes she knew she did not want to try.\n There were bees with them always.\n Once, on the third day of their journey, the only water she could find - and Willowlands was very rich in springs - was a reedy pool so languid she was half afraid of letting the ponies drink from it, that it might give them a dislike for the long and weary work they were in the middle of; she stared at it, forlornly, with her empty flask in her hand, near where she had unloaded the saddlebags. A few of the accompanying bees circled past her face and then went and clustered on a particular bulge of one saddlebag. It contained a pot of honey she\u0027d added at the last moment. Not all honey - she had concluded - had a specific use beyond what all honey is good for, sweetness and salves. But this honey, it was somehow so strong that it must be for something, though she had still not learnt what it was. The best she had come to was that this honey was for joy; it didn\u0027t seem suitable for such desperate work as this sennight was, but the seeming vigour of it heartened her, and she\u0027d brought it so as not to have left any potential resource behind. It was the honey she had given the Master the day he had come to her cottage.\n \"Very well,\" she said to the bees. When she put her hand on that saddlebag, they all flew away. She filled her flask with the indolent water and added more honey than usual, from that particular pot, then tasted the result, which was also not something she usually did. And she felt a vast uplift of her sagging mood, as if her spirit had grown wings and soared into the sky. She didn\u0027t use that honey again to counter sleepy water, but she used it on herself when the road ahead seemed unbearably long, and she dropped it on the ponies\u0027 meagre nightly handfuls of corn.\n She never remembered falling asleep. But on several of those occasions when she came back to herself standing up, she found a bee clinging to her mouth, pushing a tiny ball of pollen between her lips. It had a pleasant nutty flavour. My bees not only make combless honey and honeyless comb, she thought bemusedly, they also store pollen as squirrels store acorns.\n After the first time this happened, she stopped trying to send her bees home, not that there was any way - as she had often told people who weren\u0027t beekeepers - that you could ever tell bees to do anything. But if bees were behaving in so un-bee-like a manner as to follow a human being anywhere at all, perhaps they would listen to that human being telling them to go home. They didn\u0027t. So in the evening, when she\u0027d pulled the ponies\u0027 tack off, and rubbed them down, and given them their corn, she also opened a jar of honey and set it out for the bees, carefully wrapping it up again as soon as there were no bees left on it. She wondered if any of the woodland and meadow creatures who would be happy to eat honey any time they could, would follow the strange trail of sweet drips and drizzles she was leaving and investigate one of their campsites; but none ever did. But then they never stayed more than a few short hours anywhere either, and rarely even that long.\n Occasionally their way took them along the margin of a field with cattle or sheep pastured in it. But farmhouses and barns were rarely built near the edge of a demesne, and with the harvest in, most beasts were brought as near home as possible to make winter feeding easier. Once they passed a field of heifers who had to gallop over and investigate; and Ironfoot, who didn\u0027t mind bees, was inclined to prance. The bees themselves tactfully disappeared and reappeared when the heifers had been left behind. Once they crossed a turnip field where sheep had just been loosed, and the sharp smell of freshly bitten turnips was a shock of reminder of why she was there and what she was doing: that the demesne could go on being a place where sheep and turnips grew and thrived.\n She only saw other human beings twice. Once as she emerged from a wood she saw a woman, head bent, shawl wrapped closely round her, hurrying along a path on the far side of a leaf-fallen hedgerow parallel to the way Mirasol was going; she did not look up. And once, as Mirasol skirted along a freshly cut field, she saw the late stookers lifting and tossing their sheaves. They did see her, and paused. She raised a hand to them, and all their hands went up immediately in response. One of them shouted something. It sounded like Good luck, Lady.\n During any night hours that she was sitting on a pony or by a campfire, the bees settled round her shoulders like a cape. If she was moving around too briskly, they would collect in little dark furry puddles on the heap of baggage. The ponies did not seem to heed the bees at all, or to have taken any time to adjust to their small companions\u0027 company; often she found a few bees buried in the ponies\u0027 warm manes in the mornings.\n They were lucky with the moon; and they remained lucky with the weather. They were lucky too with the earthlines themselves, which often enough seemed to be expecting her, waiting for her - almost as if someone had been there before her and whispered to them, Your Chalice is coming. Be ready. By the third day she had realised that she would not have got round the entire demesne in time if the earthlines had been less unusually alert, unusually close to where human awareness can reach them, if she had had to spend more time calling them, asking them to listen to her. It was as if a ploughman found his horses already in harness, and all he had to do was lead them out and back them into their places. Thank you, she whispered; but she would have thanked the earthlines anyway. She was also thanking...she didn\u0027t know. But twice, when complex bindings had slid together like a belt buckling, and she had lit a little fire after, the fire had sprung to life almost before the flint touched the tinder. The first time she had been lighting a fire to eat hot food in celebration of the unexpectedly powerful and straightforward binding; the second time it was to see if the fire would leap into existence in the same eager way. It did.\n If...\n It was unusual for a Master to be able to speak to the earthlines all over his demesne from his House, but it was not unknown; and she thought she would have sensed his presence if he were walking the earthlines with her in the mundane world. Was it he? Was it his interference that was making her impossible task a thread more possible? Did that mean - she thought with a frantic little rush of hope - that he would fight on the day of the faenorn? The hope drained away from her just as quickly. It would not matter if he did; he was still weak and clumsy - weaker and clumsier than the worthless Horuld.\n She did not know how much the earthlines understood of human affairs; perhaps they were responding to the demesne\u0027s need for unity in the face of an outblood Master for their own sake. They had known something was wrong the day the faenorn had been declared. Whatever the cause of their ready cooperation she was grateful.\n But on the morning of the day before the faenorn she had to take up the ponies\u0027 girths a second hole.\n \"It is almost over,\" she whispered to them. \"Tomorrow you will be back in your own stalls, with as much hay as you can eat, and this journey will soon become only a harsh dream, and you will think to yourselves, Neither the Grand Seneschal nor our master of the stables would have sent us to be used so; it was only a dream.\" Let it only be a dream to them, she thought, and to all the ponies and sheep and heifers of the demesne. Let there still be a demesne, another sennight hence.\n She had left the pavilion hill till last. It had meant a long awkward curve back on their own trail when, near the end of their journey, they were already very weary; but she had no idea how to address the hill, and merely by making it last there would be a strength to any binding she might be able to create. It was past midnight of the day of the faenorn when they arrived; from the pavilion they would have to go straight on to the House with only what rest the ponies had had while she tried to reach the earthlines of the old hill. She untacked the ponies and hobbled them while she thought about what she was going to do.\n She had used candles sparingly, at the twenty-four points of the Circle, the Ladywell, and the First Tree. She put out all the candles she had left around the outside of the pavilion, setting them on the ruined walls so she would be able to see them from the inside. She had one fresh candle, and stood holding it, unlit, the winter wind hissing through her hair. As the wind moved through the dry leaves on the full-grown trees at the edge of what had been the parkland around the pavilion, it seemed to be muttering words she could not understand.\n The earthlines here were confused and unhappy. She knew where they had to run because of where they came and left this place, and where the pavilion had been built, before it had been turned to bad purpose; but she could not see or hear them clearly. It was a little like listening to fretful voices in another room with the door closed. She could hear the distress and discomfort, but she did not know who spoke nor what they were saying. She knew it was part of her responsibility as Chalice to bring the pavilion hill back into alignment with the rest of the demesne, to smooth and quiet the earthlines - as you might untangle the fringe on a tapestry or soothe an agitated dog. But she knew that as yet neither her strength nor her experience was equal to the task - like a blind person untangling the fringe, or a stranger soothing the dog. But wouldn\u0027t the blind person have sensitive fingers for the knots, and mightn\u0027t the stranger make friends with the dog?\n But if this place were a tapestry, it would be a tapestry to hang in the front hall of the king, where, legend had it, the ceiling was five stories high and the floor a hectare; if it were a dog, it was the Dog that guarded the entrance to the caves of the gods of the earthlines, where no mortal went. This hill had been a danger to the wholeness of the demesne since the death of the old Master. But the Chalice whose task it was to right and purify it needed to be able to call on her Master and the rest of the Circle for help. Mirasol feared her Master was no more up to the challenge than she was, and most of the rest of the Circle she did not trust; and there was always so much other work to do. And so the pavilion had been allowed to smoulder on, like a cave fire that might find a dangerous new portal to the surface at any time, and rage out over the land.... And now, if the faenorn went as everyone believed it was going to.... She had to keep shutting off thoughts about her own future to concentrate her sore and weary skill on the future of her demesne.\n Hesitatingly she went and stood where she had lain and slept the night the Master had found and saved her. If there were anywhere in this haunted spot that she might be able to make her presence - and therefore her message - felt, then this was probably it; despite that she had failed in her aim, on that previous visit. If she was very lucky, the Master\u0027s own power had been felt here too, and the earthlines might respond to that memory, if she was able to reach it, to touch it.... If she was able to name him as different from his brother, who as Master had done so much hurt to this place. Different, and yet Master. Master, human and no priest of Fire.\n Or if he had been here before her, as she suspected he had been elsewhere. But she knew almost at once that the earthlines here had spoken to no one recently. If he had tried here, he too had failed.\n She left her candle where she had been standing while she lit all the rest. She had never felt so feeble and ineffectual as she mixed a driblet of every kind of honey she had brought with the last of her Ladywell water and went round the base of the hill, scattering the drops with her fingers, murmuring, Be thou one and one-hearted. She climbed the hill and scattered the last of her sweet water around the ruined walls. The flicker of her candle flames seemed to fall on her like drops of honey.\n Last she knelt and lit her one remaining fresh candle, and put herself into the mind frame where she became a part of the earthline system herself. After the last six days this was much easier than it had ever been, while at the same time she was bruised and chafed and aching with the effort of repetition, as bruised and chafed and aching as her legs and back were from too many hours in a saddle. As a bloodright bearer she had always been able to listen to the earthlines, but when she had become Chalice she had had to invent her entrance among them, where they might listen to her, because there had been no one to teach her how. And she suspected she hadn\u0027t done it very well. The soreness was probably the result of her awkwardness; shouldn\u0027t the Chalice find the earthlines as familiar as the shape of her own hands on a goblet, the contact as sleek as flowing water? She was still much more familiar with the shape of a honeycomb, of knowing worker brood from queen cells, of recognising when the drones\u0027 idle flying on a warm summer day suddenly takes on purpose because they have sensed a young queen on her maiden flight.\n She was trying to hold that sense of peace and comfort and the hopeful future of a vigorous young bee queen on a warm summer day, trying to take it with her, into the troubled murk of the earthlines beneath the old knoll. She was gripping warmth of summer and daylight so hard that she lost her sense of cold and winter and darkness. She didn\u0027t feel the snow starting again, drifting down against her face. The soft touch of the flakes felt a little like bees\u0027 feet. And she was so tired....\n Sitting up, she fell asleep.\n And dreamed. \n","sourceLink":"https://allnovel.net/chalice/page-16.html","bookId":2087,"book":{"id":2087,"title":"Chalice","description":"Storyline: \n Chalice was published in 2008. It was written by fantasy author Robin McKinley, who lives in England. McKinley has won several awards for her writing, some of which has been popular with young readers, and some with mature ones. Her work has been published for thirty years. She has re-told old fairy tales, and the story of Robin Hood, sub-created a country, Damar, in a world like some of the desert or near-desert parts of ours, except that there are dragons. In Chalice, she has written a book which takes place in a country that seems entirely of McKinley\u0027s creation, except that the culture approximates that of the Middle Ages. There are horses and carriages, but no steam engines, swords but no gunpowder.\n \n","cover":"https://allnovel.net/images/chalice.jpg","author":"Robin McKinley","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/chalice.html","creation":"Oct 5, 2019 8:58:19 AM","modification":"Oct 5, 2019 5:35:37 PM"}}
