{"id":7066,"no":17,"title":"The Professor, Part Two","content":"The Morrie I knew, the Morrie so many others knew, would not have been the man he was without the years he spent working at a mental hospital just outside Washington, D.C., a place with the deceptively peaceful name of Chestnut Lodge. It was one of Morrie\u0027s first jobs after plowing through a master\u0027s degree and a Ph.D. from the University of Chicago. Having rejected medicine, law, and business, Morrie had decided the research world would be a place where he could contribute without exploiting others.\n Morrie was given a grant to observe mental patients and record their treatments. While the idea seems common today, it was groundbreaking in the early fifties. Morrie saw patients who would scream all day. Patients who would cry all night. Patients soiling their underwear. Patients refusing to eat, having to be held down, medicated, fed intravenously.\n One of the patients, a middle-aged woman, came out of her room every day and lay facedown on the tile floor, stayed there for hours, as doctors and nurses stepped around her. Morrie watched in horror. He took notes, which is what he was there to do. Every day, she did the same thing: came out in the morning, lay on the floor, stayed there until the evening, talking to no one, ignored by everyone. It saddened Morrie. He began to sit on the floor with her, even lay down alongside her, trying to draw her out of her misery. Eventually, he got her to sit up, and even to return to her room. What she mostly wanted, he learned, was the same thing many people want-someone to notice she was there.\n Morrie worked at Chestnut Lodge for five years. Although it wasn\u0027t encouraged, he befriended some of the patients, including a woman who joked with him about how lucky she was to be there \"because my husband is rich so he can afford it. Can you imagine if I had to be in one of those cheap mental hospitals?\"\n Another woman-who would spit at everyone else took to Morrie and called him her friend. They talked each day, and the staff was at least encouraged that someone had gotten through to her. But one day she ran away, and Morrie was asked to help bring her back. They tracked her down in a nearby store, hiding in the back, and when Morrie went in, she burned an angry look at him.\n \"So you\u0027re one of them, too,\" she snarled.\n \"One of who?\"\n \"My jailers.\"\n Morrie observed that most of the patients there had been rejected and ignored in their lives, made to feel that they didn\u0027t exist. They also missed compassion-something the staff ran out of quickly. And many of these patients were well-off, from rich families, so their wealth did not buy them happiness or contentment. It was a lesson he never forgot.\n He came to Brandeis after his work in the mental health field, just before the sixties began. Within a few years, the campus became a hotbed for cultural revolution. Drugs, sex, race, Vietnam protests. Abbie Hoffman attended Brandeis. So did Jerry Rubin and Angela Davis. Morrie had many of the \"radical\" students in his classes.\n That was partly because, instead of simply teaching, the sociology faculty got involved. It was fiercely antiwar, for example. When the professors learned that students who did not maintain a certain grade point average could lose their deferments and be drafted, they decided not to give any grades. When the administration said, \"If you don\u0027t give these students grades, they will all fail,\" Morrie had a solution: \"Let\u0027s give them all A\u0027s.\" And they did.\n Just as the sixties opened up the campus, it also opened up the staff in Morrie\u0027s department, from the jeans and sandals they now wore when working to their view of the classroom as a living, breathing place. They chose discussions over lectures, experience over theory. They sent students to the Deep South for civil rights projects and to the inner city for fieldwork. They went to Washington for protest marches, and Morrie often rode the busses with his students. On one trip, he watched with gentle amusement as women in flowing skirts and love beads put flowers in soldiers\u0027 guns, then sat on the lawn, holding hands, trying to levitate the Pentagon.\n \"They didn\u0027t move it,\" he later recalled, \"but it was a nice try.\"\n One time, a group of black students took over Ford Hall on the Brandeis campus, draping it in a banner that read MALCOLM X UNIVERSITY. Ford Hall had chemistry labs, and some administration officials worried that these radicals were making bombs in the basement. Morrie knew better. He saw right to the core of the problem, which was human beings wanting to feel that they mattered.\n The standoff lasted for weeks. And it might have gone on even longer if Morrie hadn\u0027t been walking by the building when one of the protesters recognized him as a favorite teacher and yelled for him to come in through the window.\n An hour later, Morrie crawled out through the window with a list of what the protesters wanted. He took the list to the university president, and the situation was diffused.\n Morrie always made good peace.\n At Brandeis, he taught classes about social psychology, mental illness and health, group process. They were light on what you\u0027d now call \"career skills\" and heavy on \"personal development.\"\n And because of this, business and law students today might look at Morrie as foolishly naive about his contributions. How much money did his students go on to make? How many big-time cases did they win?\n Then again, how many business or law students ever visit their old professors once they leave? Morrie\u0027s students did that all the time. And in his final months, they came back to him, hundreds of them, from Boston, New York, California, London, and Switzerland; from corporate offices and inner city school programs. They called. They wrote. They drove hundreds of miles for a visit, a word, a smile.\n \"I\u0027ve never had another teacher like you,\" they all said.\n Sometimes, they say, the moon is so busy with the new souls of the world that it disappears from the sky. That is why we have moonless nights. But in the end, the moon always returns, as do we all.\n That is what they believe.\n \n \n","sourceLink":"http://novel.tingroom.com/shuangyu/260/2468.html","bookId":229,"book":{"id":229,"title":"相约星期二 Tuesdays with Morrie","description":"简介： Tuesdays with Morrie is a 1997 non-fiction novel by American writer Mitch Albom. The story was later adapted by Thomas Rickman into a TV movie of the same name directed by Mick Jackson, which aired on 5 December 1999 and starred Jack Lemmon...","cover":"http://novel.tingroom.com/uploads/110323/1-110323131R2331.jpg","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/260","creation":"Aug 1, 2019 12:18:25 AM","modification":"Aug 1, 2019 12:23:19 AM"}}
