{"id":79073,"no":12,"title":"Page 12","content":"It was one of the best compliments of my life. But that wasn’t the game-changing moment.\n That happened next. I was really on a roll, doing an impersonation of Conrad when he wakes up in the mornings. A whole Frankenstein sort of thing. Then Conrad came out and sat next to her on the deck chair. He pulled on her ponytail and said, “What’s so funny?”\n Belly looked up at him, and she was actually blushing. Her face was all flushed, and her eyes were shining. “I don’t remember,” she said.\n My gut just twisted. I felt like somebody had drop-kicked me in the stomach. I was jealous, crazy jealous. Of Conrad. And when she got up a little while later to get a soda, I watched him watch her walk away and I felt sick inside.\n That was when I knew things would never be the same.\n I wanted to tell Conrad that he had no right. That he’d ignored her all these years, that he couldn’t just decide to take her just because he felt like it.\n She was all of ours. My mom adored her. She called Belly her secret daughter. She looked forward to seeing her all year. Steven, even though he gave her a hard time, he was really protective of her. Everyone took care of Belly, she just didn’t know it. She was too busy looking at Conrad. For as long as any of us could remember, she had loved Conrad.\n All I knew was, I wanted her to look at me like that. After that day, I was done for. I liked her, as more than a friend. I maybe even loved her.\n There have been other girls. But they weren’t her.\n I didn’t want to call Belly for help. I was pissed at her. It wasn’t just that she’d picked Conrad. That was old news. She was always going to pick Conrad. But we were friends too. How many times had she called me since my mom died? Twice? A few texts and emails?\n But sitting in the car next to her, smelling her Belly Conklin smell (Ivory soap and coconuts and sugar), the way her nose wrinkled up as she thought, her nervous smile and chewed-up fingernails. The way she said my name.\n When she leaned forward to mess with the AC vents, her hair brushed against my leg and it was really soft. It made me remember all over again. It made it hard to stay pissed and keep her at arm’s length the way I’d planned. It was pretty damn near impossible. When I was near her, I just wanted to grab her and hold her and kiss the shit out of her. Maybe then she’d finally forget about my ass**le of a brother.\n Chapter nine\n “So where are we going?” I asked Jeremiah. I tried to catch his eye, to make him look at me, just for a second. It seemed like he hadn’t looked me in the eye once since he’s showed up, and it made me nervous. I needed to know that things were okay between us.\n “I don’t know,” he said. “I haven’t talked to Con in a while. I have no clue where he’d go. I was hoping you’d have some ideas.”\n The thing was, I didn’t. Not really. Not at all, actually. I cleared my throat. “Conrad and I haven’t spoken since—since May.”\n Jeremiah looked at me sideways, but he didn’t say anything. I wondered what Conrad had told him. Probably not much.\n I kept talking because he wasn’t. “Have you called his roommate?”\n “I don’t have his number. I don’t even know his name.”\n “His name is Eric,” I said quickly. I was glad to know that at least. “It’s his same roommate from the school year. They stayed in the same room for summer school. So, um, I guess that’s where we’ll go, then. To Brown. We’ll talk to Eric, to people on his hall. You never know, he could just be hanging out on campus.”\n “Sounds like a plan.” As he checked his rearview mirror and changed lanes, he asked me, “So you’ve been to visit Con at school?”\n “No,” I said, looking out the window. It was a pretty embarrassing thing to admit. “Have you?”\n “My dad and I helped him move into the dorms.” Almost reluctantly he added, “Thanks for coming.”\n “Sure,” I said.\n “So Laurel’s cool with it?”\n “Oh, yeah, totally,” I lied. “I’m glad I could come.”\n I used to look forward to seeing Conrad all year. I used to wish for summer the way kids wished for Christmas. It was all I thought about. Even now, even after everything, he was still all I thought about.\n Later I turned on the radio to fill the silence between Jeremiah and me.\n Once I thought I heard him start to say something, and I said, “Did you just say something?”\n He said, “Nope.”\n For a while we just drove. Jeremiah and me were two people who never ran out of things to say to each other, but there we were, not saying a word.\n Finally he said, “I saw Nona last week. I stopped by the retirement home she’s been working at.”\n Nona was Susannah’s hospice nurse. I’d met her a few times. She was funny, and strong. Nona was slight, maybe five foot two with spindly arms and legs, but I’d seen her haul up Susannah like she weighed nothing. Which, toward the end, I guess she very nearly did.\n Chapter ten\n When Susannah got really sick again, no one told me right away. Not Conrad, or my mother, or Susannah herself. It all happened so fast.\n I tried getting out of going to see Susannah that last time. I told my mother I had a trig exam that counted for a quarter of my grade. I would have said anything to get out of going. “I’m going to have to study all weekend. I can’t come. Maybe next weekend,” I said over the phone. I tried to make my voice casual and not desperate. “Okay?”\n Immediately she said, “No. Not okay. You’re coming up this weekend. Susannah wants to see you.”\n “But—”\n “No buts.” Her voice was razor sharp. “I already bought your train ticket. See you tomorrow.”\n On the train ride up, I worked hard to come up with things I could say when I saw Susannah. I would tell her about how hard trig was, how Taylor was in love, how I was thinking of running for class secretary, which was a lie. I wasn’t going to run for class secretary, but I knew that Susannah would like the sound of it. I would tell her all of those things, and I would not ask about Conrad.\n My mother picked me up at the train station. When I got into the car, she said, “I’m glad you came.”\n She went on to say, “Don’t worry, Conrad’s not here.”\n I didn’t answer her, I just stared out the window. I was unjustifiably mad at her for making me come. Not that she cared. She kept right on talking. “I’m going to go ahead and warn you that she doesn’t look good. She’s tired. She’s very tired, but she’s excited to see you.” \n","sourceLink":"https://allnovel.net/it-s-not-summer-without-you-summer-2/page-12.html","bookId":2724,"book":{"id":2724,"title":"It\u0027s Not Summer Without You (Summer #2)","description":"Storyline: \n Can summer be truly summer without Cousins Beach? \n It used to be that Belly counted the days until summer, until she was back at Cousins Beach with Conrad and Jeremiah. But not this year. Not after Susannah got sick again and Conrad stopped caring. Everything that was right and good has fallen apart, leaving Belly wishing summer would never come. \n But when Jeremiah calls saying Conrad has disappeared, Belly knows what she must do to make things right again. And it can only happen back at the beach house, the three of them together, the way things used to be. If this summer really and truly is the last summer, it should end the way it started--at Cousins Beach.\n \n","cover":"https://allnovel.net/images/it-s-not-summer-without-you-summer-2.jpg","author":"Jenny Han","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/it-s-not-summer-without-you-summer-2.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 4:12:14 PM"}}
