{"id":79091,"no":30,"title":"Page 30","content":"“Believe it,” Conrad said harshly. “Why didn’t you tell me about it?” Jeremiah demanded. Conrad glanced at me before saying, “I didn’t think you needed to know.” Jeremiah’s eyes narrowed. “What the hell, Conrad? It’s my house too.” “Jere, I only just found out myself.” Conrad propped himself up on the kitchen counter, his head down. “I was at home picking up some clothes. That real estate agent, Sandy, called and left a message on the machine, saying movers were coming to get the stuff they packed. I went back to school and got my stuff and I came straight here.” Conrad had dropped school and everything else to come to the summer house, and here we’d just thought he was a screwup in need of saving. When in actuality, he was the one doing the saving. I felt guilty for not giving him the benefit of the doubt, and I knew Jeremiah did too. We exchanged a quick look and I knew we were thinking exactly the same thing. Then I guess he remembered he was pissed at me, too, and he looked away. “So that’s it, then?” Jeremiah said. Conrad didn’t answer him right away. Then he looked up and said, “Yeah, I guess it is.” “Well, great job taking care of all this, Con.” “I’ve been handling this on my own,” Conrad snapped. “It’s not like I had any help from you.” “Well, maybe if you’d told me about it—” Conrad cut him off. “You’d have done what?” “I would have talked to Dad.” “Yeah, exactly.” Conrad could not have sounded more disdainful. “What the hell does that mean?” “It means that you’re so busy being up his ass, you can’t see him for who he is.” Jeremiah didn’t say anything right away, and I was really afraid of where this was heading. Conrad was looking for a fight and the last thing we needed was for the two of them to start wrestling on the kitchen floor, breaking things and each other. This time, my mother wasn’t here to stop them. There was just me, and that was hardly anything. And then Jeremiah said, “He’s our father.” His voice was measured, even, and I let out a tiny breath of relief. There wouldn’t be any fight, because Jeremiah wouldn’t let it happen. I admired him for that. But Conrad just shook his head in disgust. “He’s a dirtbag.” “Don’t call him that.” “What kind of guy cheats on his wife and then leaves her when she has cancer? What kind of man does that? I can’t even stand to look at him. He makes me sick, playing the martyr now, the grieving widower. But where was he when Mom needed him, huh, Jere?” “I don’t know, Con. Where were you?” The room went silent, and it felt to me like the air was almost crackling. The way Conrad flinched, the way Jeremiah sucked in his breath right after he said it. He wanted to take it back, I could tell, and he was about to, when Conrad said, conversationally, “That’s a low blow.” “I’m sorry,” Jeremiah said. Conrad shrugged, brushing him off like it didn’t matter either way. And then Jeremiah said, “Why can’t you just let it go? Why do you have to hold on to all the shitty stuff that’s ever happened to you?” “Because I live in reality, unlike you. You’d rather live in a fantasy world than see people for who they really are.” He said it in a way that made me wonder who he was really talking about. Jeremiah bristled. He looked at me and then back at Conrad and said, “You’re just jealous. Admit it.” “Jealous?” “You’re jealous that Dad and I have an actual relationship now. It’s not just all about you anymore, and that kills you.” Conrad actually laughed. It was a bitter, terrible sound. “That’s such BS.” He turned to me. “Belly, are you hearing this? Jeremiah thinks I’m jealous.” Jeremiah looked at me, like, Be on my side , and I knew that if I did, he’d forgive me for not telling him about the house. I hated Conrad for putting me in the middle, for making me choose. I didn’t know whose side I was on. They were both right and they were both wrong. I guess I took too long to answer, because Jeremiah stopped looking at me and said, “You’re an ass**le, Conrad. You just want everyone to be as miserable as you are.” And then he walked out. The front door slammed behind him. I felt like I should go after him. I felt like I had just let him down when he needed me most. Then Conrad said to me, “Am I an ass**le, Belly?” He popped open another beer and he was trying to sound so indifferent, but his hand was shaking. “Yeah,” I said. “You really are.” I walked over to the window and I watched Jeremiah getting into his car. It was too late to follow him; he was already pulling out of the driveway. Even though he was pissed, he had his seat belt on. “He’ll be back,” Conrad said. I hesitated and then I said, “You shouldn’t have said that stuff.” “Maybe not.” “You shouldn’t have asked me to keep it a secret from him.” Conrad shrugged like he was already over it, but then he looked back toward the window and I knew he was worried. He threw me a beer and I caught it. I popped the top off and took a long drink. It hardly even tasted bad. Maybe I was getting used to it. I smacked my lips loudly. He watched me, and there was a funny look on his face. “So you like beer now, huh?” I shrugged. “It’s all right,” I said, and I felt very grown-up. But then I added, “I still like Cherry Coke better though.” He almost smiled when he said, “Same old Belly. I bet if we cut your body open, white sugar would come pouring out of you.” “That’s me,” I said. “Sugar and spice and everything nice.” Conrad said, “I don’t know about that.” And then we were both quiet. I took another sip of beer and set it down next to Conrad. “I think you really hurt Jeremiah’s feelings.” He shrugged. “He needed a reality check.” “You didn’t have to do it like that.” “I think you’re the one who hurt Jeremiah’s feelings.” I opened my mouth and then closed it. If I asked him what he meant by that, he’d tell me. And I didn’t want him to. So I drank my beer and said, “What now?”","sourceLink":"https://allnovel.net/it-s-not-summer-without-you-summer-2/page-30.html","bookId":2724,"book":{"id":2724,"title":"It\u0027s Not Summer Without You (Summer #2)","description":"Storyline: Can summer be truly summer without Cousins Beach? It used to be that Belly counted the days until summer, until she was back at Cousins Beach with Conrad and Jeremiah. But not this year. Not after Susannah got sick again and Conrad stopped caring. Everything that was right and good has fallen apart, leaving Belly wishing summer would never come. But when Jeremiah calls saying Conrad has disappeared, Belly knows what she must do to make things right again. And it can only happen back at the beach house, the three of them together, the way things used to be. If this summer really and truly is the last summer, it should end the way it started--at Cousins Beach.","cover":"https://allnovel.net/images/it-s-not-summer-without-you-summer-2.jpg","author":"Jenny Han","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/it-s-not-summer-without-you-summer-2.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 4:12:14 PM"}}
