{"id":108754,"no":1,"title":"Page 1","content":"Elena stepped into the clearing.\\n\\n Beneath her feet tatters of autumn leaves were freezing into the slush. Dusk had fallen, and although the storm was dying away the woods were getting colder. Elena didn\u0027t feel the cold.\\n\\n Neither did she mind the dark. Her pupils opened wide, gathering up tiny particles of light that would have been invisible to a human. She could see the two figures struggling beneath the great oak tree quite clearly.\\n\\n One had thick dark hair, which the wind had churned into a tumbled sea of waves. He was slightly taller than the other, and although Elena couldn\u0027t see his face she somehow knew his eyes were green.\\n\\n The other had a shock of dark hair as well, but his was fine and straight, almost like the pelt of an animal. His lips were drawn back from his teeth in fury, and the lounging grace of his body was gathered into a predator\u0027s crouch. His eyes were black.\\n\\n Elena watched them for several minutes without moving. She\u0027d forgotten why she had come here, why she\u0027d been pulled here by the echoes of their battle in her mind. This close the clamor of their anger and hatred and pain was almost deafening, like silent shouts coming from the fighters. They were locked in a death match.\\n\\n I wonder which of them will win, she thought. They were both wounded and bleeding, and the taller one\u0027s left arm hung at an unnatural angle. Still, he had just slammed the other against the gnarled trunk of an oak tree. His fury was so strong that Elena could feel and taste it as well as hear it, and she knew it was giving him impossible strength.\\n\\n And then Elena remembered why she had come. How could she have forgotten? He was hurt. His mind had summoned her here, battering her with shock waves of rage and pain. She had come to help him because she belonged to him.\\n\\n The two figures were down on the icy ground now, righting like wolves, snarling. Swiftly and silently Elena went to them. The one with the wavy hair and green eyes- Stefan, a voice in her mind whispered-was on top, fingers scrabbling at the other\u0027s throat. Anger washed through Elena, anger and protectiveness. She reached between the two of them to grab that choking hand, to pry the fingers up.\\n\\n It didn\u0027t occur to her that she shouldn\u0027t be strong enough to do this. She was strong enough; that was all. She threw her weight to the side, wrenching her captive away from his opponent. For good measure, she bore down hard on his wounded arm, knocking him flat on his face in the leaf-strewn slush. Then she began to choke him from behind.\\n\\n Her attack had taken him by surprise, but he was far from beaten. He struck back at her, his good hand fumbling for her throat. His thumb dug into her windpipe.\\n\\n Her attack had taken him by surprise, but he was far from beaten. He struck back at her, his good hand fumbling for her throat. His thumb dug into her windpipe.\\n\\n But he was stronger than she was. With a jerk of his shoulders, he broke her hold on him and twisted in her grasp, flinging her down. And then he was above her, his face contorted with animal fury. She hissed at him and went for his eyes with her nails, but he knocked her hand away.\\n\\n He was going to kill her. Even wounded, he was by far the stronger. His lips had drawn back to show teeth already stained with scarlet. Like a cobra, he was ready to strike.\\n\\n Then he stopped, hovering over her, his face changing.\\n\\n Elena saw the green eyes widen. The pupils, which had been contracted to vicious dots, sprang open. He was staring down at her as if truly seeing her for the first time.\\n\\n Why was he looking at her that way? Why didn\u0027t he just get it over with? But now the iron hand on her shoulder was releasing her. The animal snarl had disappeared, replaced by a look of bewilderment and wonder. He sat back, helping her to sit up, all the while gazing into her face.\\n\\n \"Elena,\" he whispered. His voice was cracked. \"Elena, it\u0027s you.\"\\n\\n Is that who I am? she thought. Elena? It didn\u0027t really matter. She cast a glance toward the old oak tree. He was still there, standing between the upthrust roots, panting, supporting himself against it with one hand. He was looking at her with his endlessly black eyes, his brows drawn together in a frown.\\n\\n Don\u0027t worry, she thought. I can take care of this one. He\u0027s stupid. Then she flung herself on the green-eyed one again.\\n\\n \"Elena!\" he cried as she knocked him backward. His good hand pushed at her shoulder, holding her up. \"Elena, it\u0027s me, Stefan! Elena, look at me!\"\\n\\n She was looking. All she could see was the exposed patch of skin at his neck. She hissed again, upper lip drawing back, showing him her teeth.\\n\\n He froze.\\n\\n She felt the shock reverberate through his body, saw his gaze shatter. His face went as white as if someone had struck him a blow in the stomach. He shook his head slightly on the muddy ground.\\n\\n \"No,\" he whispered. \"Oh, no...\"\\n\\n He seemed to be saying it to himself, as if he didn\u0027t expect her to hear him. He reached a hand toward her cheek, and she snapped at it.\\n\\n \"Oh, Elena...\" he whispered.\\n\\n The last traces of fury, of animal bloodlust, had disappeared from his face. His eyes were dazed and stricken and grieving.\\n\\n The last traces of fury, of animal bloodlust, had disappeared from his face. His eyes were dazed and stricken and grieving.\\n\\n He stared at her a moment, the pain in his eyes reaching a peak, and then he simply gave up. He stopped fighting completely.\\n\\n She could feel it happen, feel the resistance leave his body. He lay on the icy ground with scraps of oak leaves in his hair, staring up past her at the black and clouded sky.\\n\\n Finish it, his weary voice said in her mind.\\n\\n Elena hesitated for an instant. There was something about those eyes that called up memories inside her. Standing in the moonlight, sitting in an attic room... But the memories were too vague. She couldn\u0027t get a grasp on them, and the effort made her dizzy and sick.\\n\\n And this one had to die, this green-eyed one called Stefan. Because he\u0027d hurt him, the other one, the one Elena had been born to be with. No one could hurt him and live.\\n\\n She clamped her teeth into his throat and bit deep.\\n\\n She realized at once that she wasn\u0027t doing it quite right. She hadn\u0027t hit an artery or vein. She worried at the throat, angry at her own inexperience. It felt good to bite something, but not much blood was coming. Frustrated, she lifted up and bit again, feeling his body jerk in pain.\\n\\n Much better. She\u0027d found a vein this time, but she hadn\u0027t torn it deeply enough. A little scratch like that wouldn\u0027t do. What she needed was to rip it right across, to let the rich hot blood stream out.\\n\\n Her victim shuddered as she worked to do this, teeth raking and gnawing. She was just feeling the flesh give way when hands pulled at her, lifting her from behind.\\n\\n Elena snarled without letting go of the throat. The hands were insistent though. An arm looped about her waist, fingers twined in her hair. She fought, clinging with teeth and nails to her prey.\\n\\n Let go of him. Leave him!\\n\\n The voice was sharp and commanding, like a blast from a cold wind. Elena recognized it and stopped struggling with the hands that pulled her away. As they deposited her on the ground and she looked up to see him, a name came into her mind. Damon. His name was Damon. She stared at him sulkily, resentful of being yanked away from her kill, but obedient.\\n\\n Stefan was sitting up, his neck red with blood. It was running onto his shirt. Elena licked her lips, feeling a throb like a hunger pang that seemed to come from every fiber of her being. She was dizzy again.\\n\\n \"I thought,\" Damon said aloud, \"that you said she was dead.\" He was looking at Stefan, who was even paler than before, if that was possible.\\n\\n That white face filled with infinite hopelessness.\\n\\n \"Look at her\" was all he said.\\n\\n A hand cupped Elena\u0027s chin, tilting her face up. She met Damon\u0027s narrowed dark eyes directly. Then long, slender fingers touched her lips, probing between them. Instinctively Elena tried to bite, but not very hard. Damon\u0027s finger found the sharp curve of a canine tooth, and Elena did bite now, giving it a nip like a kitten\u0027s.\\n\\n Damon\u0027s face was expressionless, his eyes hard.\\n\\n \"Do you know where you are?\" he said.\\n\\n Elena glanced around. Trees. \"In the woods,\" she said craftily, looking back at him.\\n\\n \"And who is that?\"\\n\\n She followed his pointing finger. \"Stefan,\" she said indifferently. \"Your brother.\" \"And who am I? Do you know who I am?\" She smiled up at him, showing him her pointed teeth. \"Of course I do. You\u0027re Damon, and I love you.\" \\n\\n","sourceLink":"https://allnovel.net/the-vampire-diaries-the-fury-the-vampire-diaries-3/page-1.html","bookId":2033,"book":{"id":2033,"title":"The Vampire Diaries: The Fury (The Vampire Diaries #3)","description":"Storyline: This book begins with the newly \"turned\" Elena watching Damon and Stefan engaged in a fight to the death. Initially, she does not recognize the brothers due to her confused state, having recently died and risen as a Vampire, but soon a flicker of memory causes her to realize the one she loves is hurt and needs her help. The reader is led to believe she is referring to Stefan. But instead Elena attacks him, and fully intends to kill him for hurting Damon. Stefan, upon recognizing Elena, doesn\u0027t fight back and allows her to bite him. Damon eventually commands her to stop and takes her in search of human blood. Stefan intervenes, not wanting Elena to kill someone, and instead makes her drink Matt\u0027s blood. Afterwards, Damon hides her in Alaric Saltzman\u0027s attic and once she has rested, her disorientation begins to lift. Elena is deeply bothered and upset about the way she attacked Stefan...\\n","cover":"https://allnovel.net/images/the-vampire-diaries-the-fury-the-vampire-diaries-3.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-vampire-diaries-the-fury-the-vampire-diaries-3.html","creation":"Oct 5, 2019 8:58:16 AM","modification":"Oct 5, 2019 11:24:49 PM"}}
