{"id":108761,"no":8,"title":"Page 8","content":"\"Who-? Oh, it\u0027s you!\" Bonnie said, starting at the touch on her elbow. \"You scared me. I didn\u0027t hear you come up.\" He\u0027d have to be more careful, Stefan realized. In the few days he\u0027d been away from school, he\u0027d gotten out of the habit of walking and moving like a human and fallen back into the noiseless, perfectly controlled stride of the hunter. \"Sorry,\" he said, as they walked side by side down the corridor. \"S\u0027okay,\" said Bonnie with a brave attempt at nonchalance. But her brown eyes were wide and rather fixed. \"So what are you doing here today? Meredith and I came by the boardinghouse this morning to check on Mrs. Flowers, but nobody answered the door. And I didn\u0027t see you in biology.\" \"I came this afternoon. I\u0027m back at school. For as long as it takes to find what we\u0027re looking for anyway.\" \"To spy on Alaric, you mean,\" Bonnie muttered. \"I told Elena yesterday just to leave him to me. Oops,\" she added, as a couple of passing juniors stared at her. She rolled her eyes at Stefan. By mutual consent, they turned off into a side corridor and made for an empty stairwell. Bonnie leaned against the wall with a groan of relief. \"I\u0027ve got to remember not to say her name,\" she said pathetically, \"but it\u0027s so hard. My mother asked me how I felt this morning and I almost told her, \u0027fine,\u0027 since I saw Elena last night. I don\u0027t know how you two kept-you know what-a secret so long.\" Stefan felt a grin tugging at his lips in spite of himself. Bonnie was like a six-week-old kitten, all charm and no inhibitions. She always said exactly what she was thinking at the moment, even if it completely contradicted what she\u0027d just said the moment before, but everything she did came from the heart. \"You\u0027re standing in a deserted hallway with a you know what right now,\" he reminded her devilishly. \"Ohhh.\" Her eyes widened again. \"But you wouldn\u0027t, would you?\" she added, relieved. \"Because Elena would kill you... Oh, dear.\" Searching for another topic, she gulped and said, \"So-so how did things go last night?\" Stefan\u0027s mood darkened immediately. \"Not so good. Oh, Elena\u0027s all right; she\u0027s sleeping safely.\" Before he could go on, his ears picked up footfalls at the end of the corridor. Three senior girls were passing by, and one broke away from the group at the sight of Stefan and Bonnie. Sue Carson\u0027s face was pale and her eyes were red-rimmed, but she smiled at them. Bonnie was full of concern. \"Sue, how are you? How\u0027s Doug?\" \"I\u0027m okay. He\u0027s okay, too, or at least he\u0027s going to be. Stefan, I wanted to talk to you,\" she added in a rush. \"I know my dad thanked you yesterday for helping Doug the way you did, but I wanted to thank you, too. I mean, I know that people in town have been pretty horrible to you and-well, I\u0027m just surprised you cared enough to help at all. But I\u0027m glad. My mom says you saved Doug\u0027s life. And so, I just wanted to thank you, and to say I\u0027m sorry-about everything.\" \"That\u0027s all right,\" he said. \"How\u0027s Chelsea today?\" \"She\u0027s at the pound. They\u0027re holding the dogs in quarantine there, all the ones they could round up.\" Sue blotted her eyes and straightened, and Stefan relaxed, seeing that the danger was over. An awkward silence descended. \"Well,\" said Bonnie to Sue at last, \"have you heard what the school board decided about the Snow Dance?\" \"I heard they met this morning and they\u0027ve pretty much decided to let us have it. Somebody said they were talking about a police guard, though. Oh, there\u0027s the late bell. We\u0027d better get to history before Alaric hands us all demerits.\" \"We\u0027re coming in a minute,\" Stefan said. He added casually, \"When is this Snow Dance?\" \"It\u0027s the thirteenth; Friday night, you know,\" Sue said, and then winced. \"Oh my God, Friday the thirteenth. I didn\u0027t even think about that. But it reminds me that there was one other thing I wanted to tell you. This morning I took my name out of the running for snow queen. It-it just seemed right, somehow. That\u0027s all.\" Sue hurried away, almost running. Stefan\u0027s mind was racing. \"Bonnie, what is this Snow Dance?\" \"Well, it\u0027s the Christmas dance really, only we have a snow queen instead of a Christmas queen. After what happened at Founders\u0027 Day, they were thinking of canceling it, and then with the dogs yesterday-but it sounds like they\u0027re going to have it after all.\" \"On Friday the thirteenth,\" Stefan said grimly. \"Yes.\" Bonnie was looking scared again, making herself small and inconspicuous. \"Stefan, don\u0027t look that way; you\u0027re frightening me. What\u0027s wrong? What do you think will happen at the dance?\" \"I don\u0027t know.\" But something would, Stefan was thinking. Fell\u0027s Church hadn\u0027t had one public celebration that had escaped being visited by the Other Power, and this would probably be the last festivity of the year. But there was no point in talking about it now. \"Come on,\" he said. \"We\u0027re really late.\" He was right. Alaric Saltzman was at the chalkboard when they walked in, as he had been the first day he\u0027d appeared in the history classroom. If he was surprised at seeing them late, or at all, he covered it faultlessly, giving one of his friendliest smiles. So you\u0027re the one who\u0027s hunting the hunter, Stefan thought, taking his seat and studying the man before him. But are you anything more than that? Elena\u0027s Other Power maybe? Elena. Stefan\u0027s hand clenched under his desk, and a slow ache woke in his chest. He hadn\u0027t meant to think about her. The only way he had gotten through the last five days was by keeping her at the edge of his mind, not letting her image any closer. But then of course the effort of holding her away at a safe distance took up most of his time and energy. And this was the worst place of all to be, in a classroom where he couldn\u0027t care less about what was being taught. There was nothing to do but think here. He made himself breathe slowly, calmly. She was well; that was the important thing. Nothing else really mattered. But even as he told himself this, jealousy bit into him like the thongs of a whip. Because whenever he thought about Elena now, he had to think about him. About Damon, who was free to come and go as he liked. Who might even be with Elena this minute. Anger burned in Stefan\u0027s mind, bright and cold, mingling with the hot ache in his chest. He still wasn\u0027t convinced that Damon wasn\u0027t the one who had casually thrown him, bleeding and unconscious, into an abandoned well shaft to die. And he would take Elena\u0027s idea about the Other Power much more seriously if he was completely sure that Damon hadn\u0027t chased Elena to her death. Damon was evil; he had no mercy and no scruples... And what\u0027s he done that I haven\u0027t done? Stefan asked himself heavily, for the hundredth time. Nothing. Except kill. Stefan had tried to kill. He\u0027d meant to kill Tyler. At the memory, the cold fire of his anger toward Damon was doused, and he glanced instead toward a desk at the back of the room. It was empty. Though Tyler had gotten out of the hospital the day before, he hadn\u0027t returned to school. Still, there should be no danger of his remembering anything from that grisly afternoon. The subliminal suggestion to forget should hold for quite a while, as long as no one messed with Tyler\u0027s mind. He suddenly became aware that he was staring at Tyler\u0027s empty desk with narrow, brooding eyes. As he looked away, he caught the glance of someone who\u0027d been watching him do it. Matt turned quickly and bent over his history book, but not before Stefan saw his expression. December 5-I don\u0027t know what time, probably early afternoon. Dear Diary, Damon got you back for me this morning. Stefan said he didn\u0027t want me going into Alaric\u0027s attic again. This is Stefan\u0027s pen I\u0027m using. I don\u0027t own anything anymore, or at least I can\u0027t get at any of my own things, and most of them Aunt Judith would miss if I took them. I\u0027m sitting right now in a barn behind the boardinghouse. I can\u0027t go where people sleep, you know, unless I\u0027ve been invited in. I guess animals don\u0027t count, because there are some rats sleeping here under the hay and an owl in the rafters. At the moment, we\u0027re ignoring each other. I\u0027m trying very hard not to have hysterics. I thought writing might help. Something normal, something familiar. Except that nothing in my life is normal anymore. Damon says I\u0027ll get used to it faster if I throw my old life away and embrace the new one. He seems to think it\u0027s inevitable that I turn out like him. He says I was born to be a hunter and there\u0027s no point in doing things halfway. I hunted a deer last night. A stag, because it was making the most noise, clashing its antlers against tree branches, challenging other males. I drank its blood. When I look over this diary, all I can see is that I was searching for something, for someplace to belong. But this isn\u0027t it. This new life isn\u0027t it. I\u0027m afraid of what I\u0027ll become if I do start to belong here. Oh, God, I\u0027m frightened. The barn owl is almost pure white, especially when it spreads its wings so you can see the underside. From the back it looks more gold. It has just a little gold around the face. It\u0027s staring at me right now because I\u0027m making noises, trying not to cry. It\u0027s funny that I can still cry. I guess it\u0027s witches that can\u0027t. It\u0027s started snowing outside. I\u0027m pulling my cloak up around me. Elena tucked the little book close to her body and drew the soft dark velvet of the cloak up to her chin. The barn was utterly silent, except for the minute breathing of the animals that slept there. Outside the snow drifted down just as soundlessly, blanketing the world in muffling stillness. Elena stared at it with unseeing eyes, scarcely noticing the tears that ran down her cheeks. \"And could Bonnie McCullough and Caroline Forbes please stay after class a moment,\" Alaric said as the last bell rang. Stefan frowned, a frown that deepened as he saw Vickie Bennett hovering outside the open door of the history room, her eyes shy and frightened. \"I\u0027ll be right outside,\" he said meaningfully to Bonnie, who nodded. He added a warning lift of his eyebrows, and she responded with a virtuous look. Catch me saying anything I\u0027m not supposed to, the look said. Vickie Bennett was entering as he exited, and he had to step out of her way. But that took him right into the path of Matt, who\u0027d come out the other door and was trying to get down the corridor as fast as possible. Stefan grabbed his arm without thinking. \"Matt, wait.\" \"Let go of me.\" Matt\u0027s fist came up. He looked at it in apparent surprise, as if not sure what he should be so mad about. But every muscle in his body was fighting Stefan\u0027s grip. \"I just want to talk to you. Just for a minute, all right?\" \"I don\u0027t have a minute,\" Matt said, and at last his eyes, a lighter, less complicated blue than Elena\u0027s, met Stefan\u0027s. But there was a blankness in the depths of them that reminded Stefan of the look of someone who\u0027d been hypnotized, or who was under the influence of some Power. Only it was no Power except Matt\u0027s own mind, he realized abruptly. This was what the human brain did to itself when faced with something it simply couldn\u0027t deal with. Matt had shut down, turned off. Testing, Stefan said, \"About what happened Saturday night-\" \"I don\u0027t know what you\u0027re talking about. Look, I said I had to go, damn it.\" Denial was like a fortress behind Matt\u0027s eyes. But Stefan had to try again. \"I don\u0027t blame you for being mad. If I were you, I\u0027d be furious. And I know what it\u0027s like not to want to think, especially when thinking can drive you crazy.\" Matt was shaking his head, and Stefan looked around the hallway. It was almost empty, and desperation made him willing to take a risk. He lowered his voice. \"But maybe you\u0027d at least like to know that Elena\u0027s awake, and she\u0027s much-\" \"Elena\u0027s dead!\" Matt shouted, drawing the attention of everyone in the corridor. \"And I told you to let go of me!\" he added, oblivious of their audience, and shoved Stefan hard. It was so unexpected that Stefan stumbled back against the lockers, almost ending up sprawled on the ground. He stared at Matt, but Matt never even glanced back as he took off down the hallway. Stefan spent the rest of the time until Bonnie emerged just staring at the wall. There was a poster there for the Snow Dance, and he knew every inch of it by the time the girls came out. Despite everything Caroline had tried to do to him and Elena, Stefan found he couldn\u0027t summon up any hatred of her. Her auburn hair looked faded, her face pinched. Instead of being willowy, her posture just looked wilted, he thought, watching her go. \"Yes, of course. Alaric just knows we three-Vickie, Caroline, and I-have been through a lot, and he wants us to know that he supports us,\" Bonnie said, but even her dogged optimism about the history teacher sounded a little forced. \"None of us told him about anything, though. He\u0027s having another get-together at his house next week,\" she added brightly. Wonderful, thought Stefan. Normally he might have said something about it, but at that moment he was distracted. \"There\u0027s Meredith,\" he said. \"She must be waiting for us-no, she\u0027s going down the history wing,\" Bonnie said. \"That\u0027s funny, I told her I\u0027d meet her out here.\" It was more than funny, thought Stefan. He\u0027d caught only a glimpse of her as she turned the corner, but that glimpse stuck in his mind. The expression on Meredith\u0027s face had been calculating, watchful, and her step had been stealthy. As if she were trying to do something without being seen. \"She\u0027ll come back in a minute when she sees we\u0027re not down there,\" Bonnie said, but Meredith didn\u0027t come back in a minute, or two, or three. In fact, it was almost ten minutes before she appeared, and then she looked startled to see Stefan and Bonnie waiting for her. \"Sorry, I got held up,\" she said coolly, and Stefan had to admire her self-possession. But he wondered what was behind it, and only Bonnie was in a mood to chat as the three of them left school. \"But last time you used fire,\" Elena said. \"That was because we were looking for Stefan, for a specific person,\" Bonnie replied. \"This time we\u0027re trying to predict the future. If it was just your personal future I was trying to predict, I\u0027d look in your palm, but we\u0027re trying to find out something general.\" Meredith entered the room, carefully balancing a china bowl full to the brim with water. In her other hand, she held a candle. \"I\u0027ve got the stuff,\" she said. \"Water was sacred to the Druids,\" Bonnie explained, as Meredith placed the dish on the floor and the three girls sat around it. \"Apparently, everything was sacred to the Druids,\" said Meredith. \"Shh. Now, put the candle in the candlestick and light it. Then I\u0027m going to pour melted wax into the water, and the shapes it makes will tell me the answers to your questions. My grandmother used melted lead, and she said her grandmother used melted silver, but she told me wax would do.\" When Meredith had lit the candle, Bonnie glanced at it sideways and took a deep breath. \"I\u0027m getting scareder and scareder to do this,\" she said. \"You don\u0027t have to,\" Elena said softly. \"I know. But I want to-this once. Besides, it\u0027s not these kind of rituals that scare me; it\u0027s getting taken over that\u0027s so awful. I hate it. It\u0027s like somebody else getting into my body.\" \"Anyway, here goes. Turn down the lights, Meredith. Give me a minute to get attuned and then ask your questions.\" In the silence of the dim room Elena watched the candlelight flickering over Bonnie\u0027s lowered eyelashes and Meredith\u0027s sober face. She looked down at her own hands in her lap, pale against the blackness of the sweater and leggings Meredith had lent her. Then she looked at the dancing flame. \"All right,\" Bonnie said softly and took the candle. Elena\u0027s fingers twined together, clenching hard, but she spoke in a low voice so as not to break the atmosphere. \"Who is the Other Power in Fell\u0027s Church?\" Bonnie tilted the candle so that the flame licked up its sides. Hot wax streamed down like water into the bowl and formed round globules there. \"I was afraid of that,\" Bonnie murmured. \"That\u0027s no answer, nothing. Try a different question.\" Disappointed, Elena sat back, fingernails biting into her palms. It was Meredith who spoke. \"Can we find this Other Power if we look? And can we defeat it?\" \"That\u0027s two questions,\" Bonnie said under her breath as she tilted the candle again. This time the wax formed a circle, a lumpy white ring. \"That\u0027s unity! The symbol for people joining hands. It means we can do it if we stick together.\" Elena\u0027s head jerked up. Those were almost the same words she\u0027d said to Stefan and Damon. Bonnie\u0027s eyes were shining with excitement, and they smiled at each other. \"Watch out! You\u0027re still pouring,\" Meredith said. Bonnie quickly righted the candle, looking into the bowl again. The last spill of wax had formed a thin, straight line. \"That\u0027s a sword,\" she said slowly. \"It means sacrifice. We can do it if we stick together, but not without sacrifice.\" \"What kind of sacrifice?\" asked Elena. \"I don\u0027t know,\" Bonnie said, her face troubled. \"That\u0027s all I can tell you this time.\" She stuck the candle back in the candleholder. \"Whew,\" said Meredith, as she got up to turn on the lights. Elena stood, too. \"Well, at least we know we can beat it,\" she said, tugging up the leggings, which were too long for her. She caught a glimpse of herself in Meredith\u0027s mirror. She certainly didn\u0027t look like Elena Gilbert the high school fashion plate anymore. Dressed all in black like this, she looked pale and dangerous, like a sheathed sword. Her hair fell haphazardly around her shoulders. certainly didn\u0027t look like Elena Gilbert the high school fashion plate anymore. Dressed all in black like this, she looked pale and dangerous, like a sheathed sword. Her hair fell haphazardly around her shoulders. \"You could go somewhere else,\" Bonnie suggested. \"I mean, after this is all over, you could finish the school year someplace where nobody knows you. Like Stefan did.\" \"No, I don\u0027t think so.\" Elena was in a strange mood tonight, after spending the day alone in the barn watching the snow. \"Bonnie,\" she said abruptly, \"would you look at my palm again? I want you to tell my future, my personal future.\" \"I don\u0027t even know if I remember all the stuff my grandmother taught me... but, all right, I\u0027ll try,\" Bonnie relented. \"There\u0027d just better be no more dark strangers on the way, that\u0027s all. You\u0027ve already got all you can handle.\" She giggled as she took Elena\u0027s outstretched hand. \"Remember when Caroline asked what you could do with two? I guess you\u0027re finding out now, huh?\" \"Just read my palm, will you?\" \"All right, this is your life line-\" Bonnie\u0027s stream of patter broke off almost before it was started. She stared at Elena\u0027s hand, fear and apprehension in her face. \"It should go all the way down to here,\" she said. \"But it\u0027s cut off so short...\" She and Elena looked at each other without speaking for a moment, while Elena felt that same apprehension solidify inside herself. Then Meredith broke in. \"Well, naturally it\u0027s short,\" she said. \"It just means what happened already, when Elena drowned.\" \"Yes, of course, that must be it,\" Bonnie murmured. She let go of Elena\u0027s hand and Elena slowly drew back. \"That\u0027s it, all right,\" Bonnie said in a stronger voice. Elena was gazing into the mirror again. The girl who gazed back was beautiful, but there was a sad wisdom about her eyes that the old Elena Gilbert had never had. She realized that Bonnie and Meredith were looking at her. \"That must be it,\" she said lightly, but her smile didn\u0027t touch her eyes.","sourceLink":"https://allnovel.net/the-vampire-diaries-the-fury-the-vampire-diaries-3/page-8.html","bookId":2033,"book":{"id":2033,"title":"The Vampire Diaries: The Fury (The Vampire Diaries #3)","description":"Storyline: This book begins with the newly \"turned\" Elena watching Damon and Stefan engaged in a fight to the death. Initially, she does not recognize the brothers due to her confused state, having recently died and risen as a Vampire, but soon a flicker of memory causes her to realize the one she loves is hurt and needs her help. The reader is led to believe she is referring to Stefan. But instead Elena attacks him, and fully intends to kill him for hurting Damon. Stefan, upon recognizing Elena, doesn\u0027t fight back and allows her to bite him. Damon eventually commands her to stop and takes her in search of human blood. Stefan intervenes, not wanting Elena to kill someone, and instead makes her drink Matt\u0027s blood. Afterwards, Damon hides her in Alaric Saltzman\u0027s attic and once she has rested, her disorientation begins to lift. Elena is deeply bothered and upset about the way she attacked Stefan...","cover":"https://allnovel.net/images/the-vampire-diaries-the-fury-the-vampire-diaries-3.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-vampire-diaries-the-fury-the-vampire-diaries-3.html","creation":"Oct 5, 2019 8:58:16 AM","modification":"Oct 5, 2019 11:24:49 PM"}}
