{"id":108762,"no":9,"title":"Page 9","content":"\"Well, at least I didn\u0027t get taken over,\" Bonnie said. \"But I\u0027m sick of this psychic stuff anyway; I\u0027m tired of the whole thing. That was the last time, absolutely the last.\"\n \"All right,\" said Elena, turning away from the mirror, \"let\u0027s talk about something else. Did you find anything out today?\"\n \"I talked with Alaric, and he\u0027s having another get-together next week,\" Bonnie replied. \"He asked Caroline and Vickie and me if we wanted to be hypnotized to help us deal with what\u0027s been happening. But I\u0027m sure he isn\u0027t the Other Power, Elena. He\u0027s too nice.\"\n Elena nodded. She\u0027d had second thoughts about her suspicions of Alaric herself. Not because he was nice, but because she had spent four days in his attic asleep. Would the Other Power really have let her stay there unharmed? Of course, Damon had said he\u0027d influenced Alaric to forget that she was up there, but would the Other Power have succumbed to Damon\u0027s influence? Shouldn\u0027t it be far too strong?\n Unless its Powers had temporarily burned out, she thought suddenly. The way Stefan\u0027s were burning out now. Or unless it had only been pretending to be influenced.\n \"Well, we won\u0027t cross him off the list just yet,\" she said. \"We\u0027ve got to be careful. What about Mrs. Flowers? Did you find out anything about her?\"\n \"No luck,\" said Meredith. \"We went to the boardinghouse this morning, but she didn\u0027t answer the door. Stefan said he\u0027d try to track her down in the afternoon.\"\n \"If somebody would only invite me in there, I could watch her, too,\" Elena said. \"I feel like I\u0027m the only one not doing anything. I think...\" She paused a moment, considering, and then said, \"I think I\u0027ll go by home-by Aunt Judith\u0027s, I mean. Maybe I\u0027ll find Robert hanging around in the bushes or something.\"\n \"We\u0027ll go with you,\" Meredith said.\n \"No, it\u0027s better for me to do it alone. Really, it is. I can be very inconspicuous these days.\"\n \"Then take your own advice and be careful. It\u0027s still snowing hard.\"\n Elena nodded and dropped over the windowsill.\n As she approached her house, she saw that a car was just pulling out of the driveway. She melted into the shadows and watched. The headlights illuminated an eerie winter sight: the neighbors\u0027 black locust tree, like a bare-branched silhouette, with a white owl sitting in it.\n As the car roared past, Elena recognized it. Robert\u0027s blue Oldsmobile.\n Now, that was interesting. She had an urge to follow him, but a stronger urge to check the house, make sure everything was all right. She circled it stealthily, examining windows.\n The yellow chintz curtains at the kitchen window were looped back, revealing a bright section of kitchen inside. Aunt Judith was closing the dishwasher. Had Robert come to dinner? Elena wondered.\n The yellow chintz curtains at the kitchen window were looped back, revealing a bright section of kitchen inside. Aunt Judith was closing the dishwasher. Had Robert come to dinner? Elena wondered.\n Elena wished she could see more than just her aunt\u0027s profile in the flickering light of the TV. It gave her a strange feeling to look at this room, knowing that she could only look and not go in. How long had it been since she realized what a nice room it was? The old mahogany whatnot, crowded with china and glassware, the Tiffany lamp on the table next to Aunt Judith, the needlepoint pillows on the couch, all seemed precious to her now. Standing outside, feeling the feathery caress of the snow on the back of her neck, she wished she could go in just for a moment, just for a little while.\n Aunt Judith\u0027s head was tilting back, her eyes shutting. Elena leaned her forehead against the window, then slowly turned away.\n She climbed the quince tree outside her own bedroom, but to her disappointment the curtains were shut tight. The maple tree outside Margaret\u0027s room was fragile and harder to climb, but once she got up she had a good view; these curtains were wide open. Margaret was asleep with the bedcovers drawn up to her chin, her mouth open, her pale hair spread out like a fan on the pillow.\n Hello, baby, Elena thought and swallowed back tears. It was such a sweetly innocent scene: the nightlight, the little girl in bed, the stuffed animals on the shelves keeping watch over her. And here came a little white kitten padding through the open door to complete the picture, Elena thought.\n Snowball jumped onto Margaret\u0027s bed. The kitten yawned, showing a tiny pink tongue, and stretched, displaying miniature claws. Then it walked daintily over to stand on Margaret\u0027s chest.\n Something tingled at the roots of Elena\u0027s hair.\n She didn\u0027t know if it was some new hunter\u0027s sense or sheer intuition, but suddenly she was afraid. There was danger in that room. Margaret was in danger.\n The kitten was still standing there, tail swishing back and forth. And all at once Elena realized what it looked like. The dogs. It looked the way Chelsea had looked at Doug Carson before she lunged at him. Oh, God, the town had quarantined the dogs, but nobody had thought about the cats.\n Elena\u0027s mind was working at top speed, but it wasn\u0027t helping her. It was only flashing pictures of what a cat could do with curved claws and needle-sharp teeth. And Margaret just lay there breathing softly, oblivious to any danger.\n The fur on Snowball\u0027s back was rising, her tail swelling like a bottle brush. Her ears flattened and she opened her mouth in a silent hiss. Her eyes were fixed on Margaret\u0027s face just the way Chelsea\u0027s had been on Doug Carson\u0027s.\n Margaret\u0027s face just the way Chelsea\u0027s had been on Doug Carson\u0027s.\n But the snow, settling like a blanket around her, seemed to deaden the words into nothingness. A low, discordant wail was started in Snowball\u0027s throat as it flicked its eyes toward the window and then back to Margaret\u0027s face.\n \"Margaret, wake up!\" Elena shouted. Then, just as the kitten pulled back a curved paw, she threw herself at the window.\n She never knew, later, how she managed to hang on. There was no room to kneel on the sill, but her fingernails sank into the soft old wood of the casing, and the toe of one boot jammed into a foothold below. She banged against the window with her body weight, shouting.\n \"Get away from her! Wake up, Margaret!\"\n Margaret\u0027s eyes flew open and she sat up, throwing Snowball backward. The kitten\u0027s claws caught in the eyelet bedspread as it scrambled to right itself. Elena shouted again.\n \"Margaret, get off the bed! Open the window, quick!\"\n Margaret\u0027s four-year-old face was full of sleepy surprise, but no fear. She got up and stumbled toward the window while Elena gritted her teeth.\n \"That\u0027s it. Good girl... now say, \u0027Come in.\u0027 Quick, say it!\"\n \"Come in,\" Margaret said obediently, blinking and stepping back.\n The kitten sprang out as Elena fell in. She made a grab for it, but it was too fast. Once outside it glided across the maple branches with taunting ease and leaped down into the snow, disappearing.\n A small hand was tugging at Elena\u0027s sweater. \"You came back!\" Margaret said, hugging Elena\u0027s hips. \"I missed you.\"\n \"Oh, Margaret, I missed you-\" Elena began, and then froze. Aunt Judith\u0027s voice sounded from the top of the stairs.\n \"Margaret, are you awake? What\u0027s going on in there?\"\n Elena had only an instant to make her decision. \"Don\u0027t tell her I\u0027m here,\" she whispered, dropping to her knees. \"It\u0027s a secret; do you understand? Say you let the kitty out, but don\u0027t tell her I\u0027m here.\" There wasn\u0027t time for any more; Elena dived under the bed and prayed.\n From under the dust ruffle, she watched Aunt Judith\u0027s stocking feet come into the room. She pressed her face into the floorboards, not breathing.\n \"Margaret! What are you doing up? Come on, let\u0027s get you back in bed,\" Aunt Judith\u0027s voice said, and then the bed creaked with Margaret\u0027s weight and Elena heard the noises of Aunt Judith\u0027s fussing with the covers. \"Your hands are freezing. What on earth is the window doing open?\"\n \"And now there\u0027s snow all over the floor. I can\u0027t believe this... Don\u0027t you open it up again, do you hear me?\" A little more bustling and the stocking feet went out again. The door shut.\n Elena squirmed out.\n \"Good girl,\" she whispered as Margaret sat up. \"I\u0027m proud of you. Now tomorrow you tell Aunt Judith that you have to give your kitty away. Tell her it scared you. I know you don\u0027t want to\"-she put up a hand to stop the wail that was gathering on Margaret\u0027s lips-\"but you have to. Because I\u0027m telling you that kitty will hurt you if you keep it. You don\u0027t want to get hurt, do you?\"\n \"No,\" said Margaret, her blue eyes filling. \"But-\"\n \"And you don\u0027t want the kitty to hurt Aunt Judith, either, do you? You tell Aunt Judith you can\u0027t have a kitten or a puppy or even a bird until-well, for a while. Don\u0027t tell her that I said so; that\u0027s still our secret. Tell her you\u0027re scared because of what happened with the dogs at church.\" It was better, Elena reasoned grimly, to give the little girl nightmares than to have a nightmare play out in this bedroom.\n Margaret\u0027s mouth drooped sadly. \"Okay.\"\n \"I\u0027m sorry, sweetie.\" Elena sat down and hugged her. \"But that\u0027s the way it has to be.\"\n \"You\u0027re cold,\" Margaret said. Then she looked up into Elena\u0027s face. \"Are you an angel?\"\n \"Uh... not exactly.\" Just the opposite, Elena thought ironically.\n \"Aunt Judith said you went to be with Mommy and Daddy. Did you see them yet?\"\n \"I-it\u0027s sort of hard to explain, Margaret. I haven\u0027t seen them yet, no. And I\u0027m not an angel, but I\u0027m going to be like your guardian angel anyway, all right? I\u0027ll watch over you, even when you can\u0027t see me. Okay?\"\n \"Okay.\" Margaret played with her fingers. \"Does that mean you can\u0027t live here anymore?\"\n Elena looked around the pink-and-white bedroom, at the stuffed animals on the shelves and the little writing desk and the rocking horse that had once been hers in the corner. \"That\u0027s what it means,\" she said softly.\n \"When they said you went to be with Mommy and Daddy, I said I wanted to go, too.\"\n Elena blinked hard. \"Oh, baby. It\u0027s not time for you to go, so you can\u0027t. And Aunt Judith loves you very much, and she\u0027d be lonely without you.\"\n Margaret nodded, her eyelids drooping. But as Elena eased her down and pulled the bedspread over her, Margaret asked one more question. \"But don\u0027t you love me?\"\n Oh, stupid, stupid, Elena thought, forging through the banked snow to the other side of Maple Street. She\u0027d missed her chance to ask Margaret whether Robert had been at dinner. It was too late now.\n Robert. Her eyes narrowed suddenly. At the church, Robert had been outside and then the dogs had gone mad. And tonight Margaret\u0027s kitten had gone feral-just a little while after Robert\u0027s car had pulled out of the driveway.\n Robert has a lot to answer for, she thought.\n But melancholy was pulling at her, tugging her thoughts away. Her mind kept returning to the bright house she\u0027d just left, going over the things she\u0027d never see again. All her clothes and knickknacks and jewelry-what would Aunt Judith do with them? I don\u0027t own anything anymore, she thought. I\u0027m a pauper.\n Elena?\n With relief, Elena recognized the mental voice and the distinctive shadow at the end of the street. She hurried toward Stefan, who took his hands out of his jacket pockets and held hers to warm them.\n \"Meredith told me where you\u0027d gone.\"\n \"I went home,\" Elena said. That was all she could say, but as she leaned against him for comfort, she knew that he understood.\n \"Let\u0027s find someplace we can sit down,\" he said, and stopped in frustration. All the places they used to go were either too dangerous or closed to Elena. The police still had Stefan\u0027s car.\n Eventually they just went to the high school where they could sit under the overhang of a roof and watch the snow sift down. Elena told him what had happened in Margaret\u0027s room.\n \"I\u0027m going to have Meredith and Bonnie spread it around town that cats can attack, too. People should know that. And I think somebody ought to be watching Robert,\" she concluded.\n \"We\u0027ll tail him,\" Stefan said, and she couldn\u0027t help smiling.\n \"It\u0027s funny how much more American you\u0027ve gotten,\" she said. \"I hadn\u0027t thought about it in a long time, but when you first came you were a lot more foreign. Now nobody would know you hadn\u0027t lived here all your life.\"\n \"We adapt quickly. We have to,\" Stefan said. \"There are always new countries, new decades, new situations. You\u0027ll adapt, too.\"\n \"You\u0027ll learn, in time. If there is anything... good... about what we are, it\u0027s time. We have plenty of it, as much as we want. Forever.\"\n \" \u0027Joyous companions forever.\u0027 Isn\u0027t that what Katherine said to you and Damon?\" Elena murmured.\n She could feel Stefan\u0027s stiffening, his withdrawal. \"She was talking about all three of us,\" he said. \"I wasn\u0027t.\"\n \"Oh, Stefan, please don\u0027t, not now. I wasn\u0027t even thinking about Damon, only about forever. It scares me. Everything about this scares me, and sometimes I think I just want to go to sleep and never wake up again...\"\n In the shelter of his arms she felt safer, and she found her new senses were just as amazing close up as they were at a distance. She could hear each separate pulse of Stefan\u0027s heart, and the rush of blood through his veins. And she could smell his own distinctive scent mingled with the scent of his jacket, and the snow, and the wool of his clothes.\n \"Please trust me,\" she whispered. \"I know you\u0027re angry with Damon, but try to give him a chance. I think there\u0027s more to him than there seems to be. And I want his help in finding the Other Power, and that\u0027s all I want from him.\"\n At that moment it was completely true. Elena wanted nothing to do with the hunter\u0027s life tonight; the darkness held no appeal for her. She wished she could be at home sitting in front of a fire.\n But it was sweet just to be held like this, even if she and Stefan had to sit in the snow to do it. Stefan\u0027s breath was warm as he kissed the back of her neck, and she sensed no further withdrawal in Stefan\u0027s body.\n No hunger, either, or at least not the kind she was used to sensing when they were close like this. Now that she was a hunter like he, the need was different, a need for togetherness rather than for sustenance. It didn\u0027t matter. They had lost something, but they had gained something, too. She understood Stefan in a way she never had before. And her understanding brought them closer, until their minds were touching, almost meshing with each other\u0027s. It wasn\u0027t the noisy chatter of mental voices; it was a deep and wordless communion. As if their spirits were united.\n \"I love you,\" Stefan said against her neck, and she held on tighter. She understood now why he\u0027d been afraid to say it for so long. When the thought of tomorrow scared you sick, it was hard to make a commitment. Because you didn\u0027t want to drag someone else down with you.\n Particularly someone you loved. \"I love you, too,\" she made herself say and sat back, her peaceful mood broken. \"And will you try to give Damon a chance, for my sake? Try to work with him?\"\n \"I\u0027ll work with him, but I won\u0027t trust him. I can\u0027t. I know him too well.\"\n \"I followed Mrs. Flowers today.\" Stefan\u0027s lip quirked. \"All afternoon and evening. And you know what she did?\"\n \"What?\"\n \"Three loads of wash-in an ancient machine that looked like it was going to explode any minute. No clothes dryer, just a wringer. It\u0027s all down in the basement. Then she went outside and filled about two dozen bird feeders. Then back to the basement to wipe off jars of preserves. She spends most of her time down there. She talks to herself.\"\n \"Just like a dotty old lady,\" said Elena. \"All right; maybe Meredith\u0027s wrong and that\u0027s all she is.\" She noticed his change of expression at Meredith\u0027s name and added, \"What?\"\n \"Well, Meredith may have some explaining to do herself. I didn\u0027t ask her about it; I thought maybe it was better coming from you. But she went to talk to Alaric Saltzman after school today. And she didn\u0027t want anyone to know where she was going.\"\n Disquiet uncoiled in Elena\u0027s middle. \"So what?\"\n \"So she lied about it afterward-or at least she evaded the issue. I tried to probe her mind, but my Powers are just about burnt out. And she\u0027s strong-willed.\"\n \"And you had no right! Stefan, listen to me. Meredith would never do anything to hurt us or betray us. Whatever she\u0027s keeping from us-\"\n \"So you do admit that she\u0027s hiding something.\"\n \"Yes,\" Elena said reluctantly. \"But it\u0027s nothing that will hurt us, I\u0027m sure. Meredith has been my friend since the first grade...\" Without knowing it, Elena let the sentence slip away from her. She was thinking of another friend, one who\u0027d been\n close to her since kindergarten. Caroline. Who last week had tried to destroy Stefan and humiliate Elena in front of the entire town.\n And what was it Caroline\u0027s diary had said about Meredith? Meredith doesn\u0027t do anything; she just watches. It\u0027s as if she can\u0027t act, she can only react to things. Besides, I\u0027ve heard my parents talking about her family-no wonder she never mentions them.\n Elena\u0027s eyes left the snowy landscape to seek Stefan\u0027s waiting face. \"It doesn\u0027t matter,\" she said quietly. \"I know Meredith, and I trust her. I\u0027ll trust her to the end.\"\n \"I hope she\u0027s worthy of it, Elena,\" he said. \"I really do.\"\n \n","sourceLink":"https://allnovel.net/the-vampire-diaries-the-fury-the-vampire-diaries-3/page-9.html","bookId":2033,"book":{"id":2033,"title":"The Vampire Diaries: The Fury (The Vampire Diaries #3)","description":"Storyline: \n This book begins with the newly \"turned\" Elena watching Damon and Stefan engaged in a fight to the death. Initially, she does not recognize the brothers due to her confused state, having recently died and risen as a Vampire, but soon a flicker of memory causes her to realize the one she loves is hurt and needs her help. The reader is led to believe she is referring to Stefan. But instead Elena attacks him, and fully intends to kill him for hurting Damon. Stefan, upon recognizing Elena, doesn\u0027t fight back and allows her to bite him. Damon eventually commands her to stop and takes her in search of human blood. Stefan intervenes, not wanting Elena to kill someone, and instead makes her drink Matt\u0027s blood. Afterwards, Damon hides her in Alaric Saltzman\u0027s attic and once she has rested, her disorientation begins to lift. Elena is deeply bothered and upset about the way she attacked Stefan...\n \n","cover":"https://allnovel.net/images/the-vampire-diaries-the-fury-the-vampire-diaries-3.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-vampire-diaries-the-fury-the-vampire-diaries-3.html","creation":"Oct 5, 2019 8:58:16 AM","modification":"Oct 5, 2019 11:24:49 PM"}}
