{"id":27724,"no":13,"title":"CHAPTER V. HOW BESSY PRYOR CEASED TO BE A YOUNG LADY OF IMPORTANCE.","content":"When the old woman was alone she at once went to work in her own mind resolving what should be her course of proceeding. To yield in the matter, and to confirm the happiness of the young people, never occurred to her. Again and again she repeated to herself that she would do her duty; and again and again she repeated to herself that in allowing Philip and Bessy to come together she had neglected her duty. That her duty required her to separate them, in spite of their love, in spite of their engagement, though all the happiness of their lives might depend upon it, she did not in the least doubt. Duty is duty. And it was her duty to aggrandise the house of Launay, so that the old autocracy of the land might, so far as in her lay, be preserved. That it would be a good and pious thing to do,—to keep them apart, to force Philip{137} to marry the girl in Cornwall, to drive Bessy into Mr. Morrison’s arms, was to her so certain that it required no further thought. She had never indulged herself. Her life had been so led as to maintain the power of her own order, and relieve the wants of those below her. She had done nothing for her own pleasure. How should it occur to her that it would be well for her to change the whole course of her life in order that she might administer to the joys of a young man and a young woman? \\n\\n \\n\\n It did not occur to her to do so. Lying thus all alone, white, sick, and feeble, but very strong of heart, she made her resolutions. As Bessy could not well be sent out of the house till a home should be provided for her elsewhere, Philip should be made to go. As that was to be the first step, she again sent for Philip that day. “No, mother; not while you are so ill.” This he said in answer to her first command that he should leave Launay at once. It had not occurred to him that the house in which he had been born and bred, the house of his ancestors, the house which he had always supposed was at some future day to be his own, was not free to him. But, feeble as she was, she soon made him understand her purpose. He must go,—because she ordered him, because the house was hers and not his, because he was no longer welcome there as a guest unless he would promise to abandon Bessy. “This is tyranny, mother,” he said. \\n\\n \\n\\n “I do not mean to argue the question,” said Mrs. Miles, leaning back among the pillows, gaunt, with{138} hollow cheeks, yellow with her long sickness, seeming to be all eyes as she looked at him. “I tell you that you must go.” \\n\\n \\n\\n “Mother!” \\n\\n \\n\\n Then, at considerable length, she explained her intended arrangements. He must go, and live upon the very modest income which she proposed. At any rate he must go, and go at once. The house was hers, and she would not have him there. She would have no one in the house who disputed her will. She had been an over-indulgent mother to him, and this had been the return made to her! She had condescended to explain to him her intention in regard to Bessy, and he had immediately resolved to thwart her. When she was dead and gone it might perhaps be in his power to ruin the family if he chose. As to that she would take further thought. But she, as long as she lived, would do her duty. “I suppose I may understand,” she said, “that you will leave Launay early after breakfast to-morrow.” \\n\\n \\n\\n “Do you mean to turn me out of the house?” \\n\\n \\n\\n “I do,” she said, looking full at him, all eyes, with her grey hair coming dishevelled from under the large frill of her nightcap, with cheeks gaunt and yellow. Her extended hands were very thin. She had been very near death, and seemed, as he gazed at her, to be very near it now. If he went it might be her fate never to see him again. \\n\\n \\n\\n “I cannot leave you like this,” he said. \\n\\n \\n\\n “Then obey me.{139}” \\n\\n \\n\\n “Why should we not be married, mother?” \\n\\n \\n\\n “I will not argue. You know as well as I do. Will you obey me?” \\n\\n \\n\\n “Not in this, mother. I could not do so without perjuring myself.” \\n\\n \\n\\n “Then go you out of this house at once.” She was sitting now bolt upright on her bed, supporting herself on her hands behind her. The whole thing was so dreadful that he could not endure to prolong the interview, and he left the room. \\n\\n \\n\\n Then there came a message from the old housekeeper to Bessy, forbidding her to leave her own room. It was thus that Bessy first understood that her great sin was to be made public to all the household. Mrs. Knowl, who was the head of the domestics, had been told, and now felt that a sort of authority over Bessy had been confided to her. “No, Miss Bessy; you are not to go into her room at all. She says that she will not see you till you promise to be said by her.” \\n\\n \\n\\n “But why, Mrs. Knowl?” \\n\\n \\n\\n “Well, miss; I suppose it’s along of Mr. Philip. But you know that better than me. Mr. Philip is to go to-morrow morning and never come back any more.” \\n\\n \\n\\n “Never come back to Launay?” \\n\\n \\n\\n “Not while things is as they is, miss. But you are to stay here and not go out at all. That’s what Madam says.” The servants about the place all called Mrs. Miles Madam. \\n\\n \\n\\n There was a potency about Mrs. Miles which enabled her to have her will carried out, although she was lying{140} ill in bed,—to have her will carried out as far as the immediate severance of the lovers was concerned. When the command had been brought by the mouth of a servant, Bessy determined that she would not see Philip again before he went. She understood that she was bound by her position, bound by gratitude, bound by a sense of propriety, to so much obedience as that. No earthly authority could be sufficient to make her abandon her troth. In that she could not allow even her aunt to sway her,—her aunt though she were sick and suffering, even though she were dying! Both her love and her vow were sacred to her. But obedience at the moment she did owe, and she kept her room. Philip came to the door, but she sat mute and would not speak to him. Mrs. Knowl, when she brought her some food, asked her whether she intended to obey the order. “Your aunt wants a promise from you, Miss Bessy?” \\n\\n \\n\\n “I am sure my aunt knows that I shall obey her,” said Bessy. \\n\\n \\n\\n On the following morning Philip left the house. He sent a message to his mother, asking whether she would see him; but she refused. “I think you had better not disturb her, Mr. Philip,” said Mrs. Knowl. Then he went, and as the waggonette took him away from the door, Bessy sat and listened to the sound of the wheels on the gravel. \\n\\n \\n\\n All that day and all the next passed on and she was not allowed to see her aunt. Mrs. Knowl repeated that she could not take upon herself to say that Madam{141} was better. No doubt the worry of the last day or two had been a great trouble to her. Mrs. Knowl grew much in self-importance at the time, and felt that she was overtopping Miss Bessy in the affairs of Launay. \\n\\n \\n\\n It was no less true than singular that all the sympathies of the place should be on the side of the old woman. Her illness probably had something to do with it. And then she had been so autocratic, all Launay and Budcombe had been so accustomed to bow down to her, that rebellion on the part of anyone seemed to be shocking. And who was Bessy Pryor that she should dare to think of marrying the heir? Who, even, was the supposed heir that he should dare to think of marrying anyone in opposition to the actual owner of the acres? Heir though he was called, he was not necessarily the heir. She might do as she pleased with all Launay and all Budcombe, and there were those who thought that if Philip was still obstinate she would leave everything to her elder son. She did not love her elder son. In these days she never saw him. He was a gay man of the world, who had never been dutiful to her. But he might take the name of Launay, and the family would be perpetuated as well that way as the other. Philip was very foolish. And as for Bessy; Bessy was worse than foolish. That was the verdict of the place generally. \\n\\n \\n\\n I think Launay liked it. The troubles of our neighbours are generally endurable, and any subject for conversation is a blessing. Launay liked the {142}excitement; but, nevertheless, felt itself to be compressed into whispers and a solemn demeanour. The Gregory girls were solemn, conscious of the iniquity of their friend, and deeply sensitive of the danger to which poor Philip was exposed. When a rumour came to the vicarage that a fly had been up at the great house, it was immediately conceived that Mr. Jones, the lawyer from Taunton, had been sent for, with a view to an alteration of the will. This suddenness, this anger, this disruption of all things was dreadful! But when it was discovered that the fly contained no one but the doctor there was disappointment. \\n\\n \\n\\n On the third day there came a message from Mrs. Miles to the rector. Would Mr. Gregory step up and see Mrs. Miles? Then it was thought at the rectory that the dear old lady was again worse, and that she had sent for her clergyman that she might receive the last comforts of religion. But this again was wrong. “Mr. Gregory,” she said very suddenly, “I want to consult you as to a future home for Bessy Pryor.” \\n\\n \\n\\n “Must she go from this?” \\n\\n \\n\\n “Yes; she must go from this. You have heard, perhaps, about her and my son.” Mr. Gregory acknowledged that he had heard. “Of course she must go. I cannot have Philip banished from the house which is to be his own. In this matter he probably has been the most to blame.” \\n\\n \\n\\n “They have both, perhaps, been foolish.” \\n\\n \\n\\n “It is wickedness rather than folly. But he has been the wickeder. It should have been a duty to{143} him, a great duty, and he should have been the stronger. But he is my son, and I cannot banish him.” \\n\\n \\n\\n “Oh, no!” \\n\\n \\n\\n “But they must not be brought together. I love Bessy Pryor dearly, Mr. Gregory; oh, so dearly! Since she came to me, now so many years ago, she has been like a gleam of sunlight in the house. She has always been gentle with me. The very touch of her hand is sweet to me. But I must not on that account sacrifice the honour of the family. I have a duty to do; and I must do it, though I tear my heart in pieces. Where can I send her?” \\n\\n \\n\\n “Permanently?” \\n\\n \\n\\n “Well, yes; permanently. If Philip were married, of course she might come back. But I will still trust that she herself may be married first. I do not mean to cast her off;—only she must go. Anything that may be wanting in money shall be paid for her. She shall be provided for comfortably. You know what I had hoped about Mr. Morrison. Perhaps he may even yet be able to persuade her; but it must be away from here. Where can I send her?” \\n\\n \\n\\n This was a question not very easy to answer, and Mr. Gregory said that he must take time to think of it. Mrs. Miles, when she asked the question, was aware that Mr. Gregory had a maiden sister, living at Avranches in Normandy, who was not in opulent circumstances.{144} \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2747/75695.html","bookId":1375,"book":{"id":1375,"title":"Why Frau Frohmann Raised her Prices and other stories","description":"简介： IF ever there was a Tory upon earth, the Frau Frohmann was a Tory; for I hold that landed possessions, gentle blood, a gray-haired butler behind ones chair, and adherence to the Church of England, are not necessarily the distinguishing marks of Toryi...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2747","creation":"Aug 1, 2019 12:24:58 AM","modification":"Aug 1, 2019 12:24:58 AM"}}
