{"id":27728,"no":17,"title":"CHAPTER IX.","content":"HOW BESSY PRYOR ANSWERED THE TWO LETTERS, AND WHAT CAME OF IT. \\n\\n \\n\\n The letters were read very often, and that from Mrs. Miles I think the oftener. Philip’s love was plainly expressed, and what more is expected from a lover’s letter than a strong, manly expression of love? It was quite satisfactory, declaring the one important fact that his happiness was bound up in hers. But Mrs. Miles’ was the stronger letter, and by far the more suggestive. She had so mingled hardness and softness, had enveloped her stern lesson of feminine duty in so sweet a frame of personal love, that it was hardly possible that such a girl as Bessy Pryor should not be shaken by her arguments. There were moments during the night in which she had almost resolved to yield. “A woman can soar only by suffering.” She was not sure that she wanted to soar, but she certainly did want to do her duty, even though suffering should come of it. But there was one word in her aunt’s letter which militated against the writer’s purpose rather than assisted it. “Since you first came to me, you have{168} never been false.” False! no; she hoped she had not been false. Whatever might be the duty of a man or a woman, that duty should be founded on truth. Was it not her special duty at this moment to be true to Philip? I do not know that she was altogether logical. I do not know but that in so supporting herself in her love there may have been a bias of personal inclination. Bessy perhaps was a little prone to think that her delight and her duty went together. But that flattering assurance, that she had never yet been false, strengthened her resolution to be true, now, to Philip. \\n\\n \\n\\n She took the whole of the next day to think, abstaining during the whole day from a word of confidential conversation with Miss Gregory. Then on the following morning she wrote her letters. That to Philip would be easily written. Words come readily when one has to give a hearty assent to an eager and welcome proposition. But to deny, to make denial to one loved and respected, to make denial of that which the loved one has a right to ask, must be difficult. Bessy, like a brave girl, went to the hard task first, and she rushed instantly at her subject, as a brave horseman rides at his fence without craning. \\n\\n \\n\\n “Dearest Aunt,—I cannot do as you bid me. My word to him is so sacred to me that I do not dare to break it. I cannot say that I won’t be his when I feel that I have already given myself to him. \\n\\n \\n\\n “Dear, dearest aunt, my heart is very sad as I write{169} this, because I feel that I am separating myself from you almost for ever. You know that I love you. You know that I am miserable because you have banished me from your side. All the sweet kind words of your love to me are like daggers to me, because I cannot show my gratitude by doing as you would have me. It seems so hard! I know it is probable that I may never see him again, and yet I am to be separated from you, and you will be my enemy. In all the world there are but two that I really love. Though I cannot and will not give him up, I desire to be back at Launay now only that I might be with you. My love for him would be contented with a simple permission that it should exist. My love for you cannot be satisfied unless I am allowed to be close to you once again. You say that a woman’s duty consists in suffering. I am striving to do my duty, but I know how great is my suffering in doing it. However angry you may be with your Bessy, you will not think that she can appear even to be ungrateful without a pang. \\n\\n \\n\\n “Though I will not give him up, you need not fear that I shall do anything. Should he come here I could not, I suppose, avoid seeing him, but I should ask him to go at once; and I should beg Miss Gregory to tell him that she could not make him welcome to her house. In all things I will do as though I were your daughter—though I know so well how far I am from any right to make use of so dear a name! \\n\\n \\n\\n “But dear, dear aunt, no daughter could love you better, nor strive more faithfully to be obedient.{170} \\n\\n \\n\\n “I shall always be, even when you are most angry with me, your own, poor, loving, most affectionate \\n\\n \\n\\n “Bessy.” \\n\\n \\n\\n The other letter need perhaps be not given in its entirety. Even in such a chronicle as this there seems to be something of treachery, something of a want of that forbearance to which young ladies are entitled, in making public the words of love which such a one may write to her lover. Bessy’s letter was no doubt full of love, but it was full of prudence also. She begged him not to come to Avranches. As to such a marriage as that of which he had spoken, it was, she assured him, quite impossible. She would never give him up, and so she had told Mrs. Miles. In that respect her duty to him was above her duty to her aunt. But she was so subject to her aunt that she would not in any other matter disobey her. For his sake—for Philip’s sake—only for Philip’s sake, she grieved that there should be more delay. Of course she was aware that it might possibly be a trouble in life too many for him to bear. In that case he might make himself free from it without a word of reproach from her. Of that he alone must be the judge. But, for the present, she could be no partner to any plans for the future. Her aunt had desired her to stay at Avranches, and at Avranches she must remain. There were words of love, no doubt; but the letter, taken altogether, was much sterner and less demonstrative of affection than that written to her aunt.{171} \\n\\n \\n\\n There very soon came a rejoinder from Mrs. Miles, but it was so curt and harsh as almost to crush Bessy by its laconic severity. “You are separated from me, and I am your enemy.” That was all. Beneath that one line the old woman had signed her name, M. Miles, in large, plain angry letters. Bessy, who knew every turn of the woman’s mind, understood exactly how it had been with her when she wrote those few words, and when, with care, she had traced that indignant signature. “Then everything shall be broken, and though there was but one gleam of sunshine left to me, that gleam shall be extinguished. No one shall say that I, as Lady of Launay, did not do my duty.” It was thus the Lady of Launay had communed with herself when she penned that dreadful line. Bessy understood it all, and could almost see the woman as she wrote it. \\n\\n \\n\\n Then in her desolation she told everything to Miss Gregory—showed the two former letters, showed that dreadful denunciation of lasting wrath, and described exactly what had been her own letter, both to Mrs. Miles and to her lover. Miss Gregory had but one recipe to offer in such a malady; that, namely, which she had taken herself in a somewhat similar sickness. The gentleman should be allowed to go forth into the world and seek a fitter wife, whereas Bessy should content herself, for the remainder of her life, with the pleasures of memory. Miss Gregory thought that it was much even to have been once loved by the major-general. When Bessy almost angrily declared{172} that this would not be enough for her, Miss Gregory very meekly suggested that possibly affection might change in the lapse of years, and that some other suitor—perhaps Mr. Morrison—might in course of time suffice. But at the idea Bessy became indignant, and Miss Gregory was glad to confine herself to the remedy pure and simple which she acknowledged to have been good for herself. \\n\\n \\n\\n Then there passed a month—a month without a line from Launay or from Philip. That Mrs. Miles should not write again was to be expected. She had declared her enmity, and there was an end of everything. During the month there had come a cheque to Miss Gregory from some man of business, and with the cheque there had been no intimation that the present arrangement was to be brought to a close. It appeared therefore that Mrs. Miles, in spite of her enmity, intended to provide for the mutinous girl a continuation of the comforts which she now enjoyed. Certainly nothing more than this could have been expected from her. But, in regard to Philip, though Bessy had assured herself, and had assured Miss Gregory also, that she did not at all desire a correspondence in the present condition of affairs, still she felt so total a cessation of all tidings to be hard to bear. Mary Gregory, when writing to her aunt, said nothing of Philip—merely remarked that Bessy Pryor would be glad to know that her aunt had nearly recovered her health, and was again able to go out among the poor. Then Bessy began to think—not that Philip was like the major-general,{173} for to that idea she would not give way at all—but that higher and nobler motives had induced him to yield to his mother. If so she would never reproach him. If so she would forgive him in her heart of hearts. If so she would accept her destiny and entreat her old friend to allow her to return once more to Launay, and thenceforth to endure the evil thing which fate would have done to her in patient submission. If once the word should have come to her from Philip, then would she freely declare that everything should be over, then and for always, between her and her lover. After such suffering as that, while she was undergoing agony so severe, surely her friend would forgive her. That terrible word, “I am your enemy,” would surely then be withdrawn. \\n\\n \\n\\n But if it were to be so, if this was to be the end of her love, Philip, at least, would write. He would not leave her in doubt, after such a decision on his own part. That thought ought to have sustained her; but it was explained to her by Miss Gregory that the major-general had taken three months before he had been inspirited to send the fatal letter, and to declare his purpose of marrying money. There could be but little doubt, according to Miss Gregory, that Philip was undergoing the same process. It was, she thought, the natural end to such an affair. This was the kind of thing which young ladies without dowry, but with hearts to love, are doomed to suffer. There could be no doubt that Miss Gregory regarded the termination of the affair with a certain amount of sympathetic{174} satisfaction. Could she have given Bessy all Launay, and her lover, she would have done so. But sadness and disappointment were congenial to her, and a heart broken, but still constant, was, to her thinking, a pretty feminine acquisition. She was to herself the heroine of her own romance, and she thought it good to be a heroine. But Bessy was indignant; not that Philip should be false, but that he should not dare to write and say so. “I think he ought to write,” was on her lips, when the door was opened, and, lo, all of a sudden, Philip Miles was in the room. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2747/75699.html","bookId":1375,"book":{"id":1375,"title":"Why Frau Frohmann Raised her Prices and other stories","description":"简介： IF ever there was a Tory upon earth, the Frau Frohmann was a Tory; for I hold that landed possessions, gentle blood, a gray-haired butler behind ones chair, and adherence to the Church of England, are not necessarily the distinguishing marks of Toryi...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2747","creation":"Aug 1, 2019 12:24:58 AM","modification":"Aug 1, 2019 12:24:58 AM"}}
