{"id":27729,"no":18,"title":"CHAPTER X.","content":"HOW BESSY PRYOR’S LOVER ARGUED HIS CASE. We must now go back to Launay. It will be remembered that Bessy received both her letters on the same day—those namely from Mrs. Miles and from Philip—and that they both came from Launay. Philip had been sent away from the place when the fact of his declared love was first made known to the old lady, as though into a banishment which was to be perpetual till he should have repented of his sin. Such certainly had been his mother’s intention. He was to be sent one way, and the girl another, and everyone concerned was to be made to feel the terrible weight of her displeasure, till repentance and retractation should come.{175} He was to be starved into obedience by a minimised allowance, and she by the weariness of her life at Avranches. But the person most grievously punished by these arrangements was herself. She had declared to herself that she would endure anything, everything, in the performance of her duty. But the desolation of her life was so extreme that it was very hard to bear. She did not shrink and tell herself that it was unendurable, but after awhile she persuaded herself that now that Bessy was gone there could be no reason why Philip also should be exiled. Would not her influence be more potent over Philip if he were at Launay? She therefore sent for him, and he came. Thus it was that the two letters were written from the same house. Philip obeyed his mother’s behest in coming as he had obeyed it in going; but he did not hesitate to show her that he felt himself to be aggrieved. Launay of course belonged to her. She could leave it and all the property to some hospital if she chose. He was well aware of that. But he had been brought up as the heir, and he could not believe that there should come such a ruin of heaven and earth as would be produced by any change in his mother’s intentions as to the Launay property. Touching his marriage, he felt that he had a right to marry whom he pleased, as long as she was a lady, and that any dictation from his mother in such a matter was a tyranny not to be endured. He had talked it all over with the rector before he went. Of course it was possible that his mother should commit such an injustice as that at which the rector{176} hinted. “There are,” said Philip, “no bounds to possibilities.” It was, however, he thought, all but impossible; and whether probable or improbable, no fear of such tyranny should drive him from his purpose. He was a little magniloquent, perhaps, in what he said, but he was very resolved. It was, therefore, with some feeling of an injury inflicted upon him that he first greeted his mother on his return to the house. For a day or two not a word passed about Bessy. “Of course, I am delighted to be with you, and glad enough to have the shooting,” he said, in answer to some word of hers. “I shouldn’t have gone, as you know, unless you had driven me away.” This was hard on the old woman; but she bore it, and, for some days, was simply affectionate and gentle to her son—more gentle than was her wont. Then she wrote to Bessy, and told her son that she was writing. “It is so impossible,” she said, “that I cannot conceive that Bessy should not obey me when she comes to regard it at a distance.” “I see no impossibility; but Bessy can, of course, do as she pleases,” replied Philip, almost jauntily. Then he determined that he also would write. There were no further disputes on the matter till Bessy’s answer came, and then Mrs. Miles was very angry indeed. She had done her best so to write her letter that Bessy should be conquered both by the weight of her arguments and by the warmth of her love. If reason would not prevail, surely gratitude would compel her to do as she was bidden. But the{177} very first words of Bessy’s letter contained a flat refusal. “I cannot do as you bid me.” Who was this girl, that had been picked out of a gutter, that she should persist in the right of becoming the mistress of Launay? In a moment the old woman’s love was turned into a feeling of condemnation, nearly akin to hatred. Then she sent off her short rejoinder, declaring herself to be Bessy’s enemy. On the following morning regret had come, and perhaps remorse. She was a woman of strong passion, subject to impulses which were, at the time, uncontrollable; but she was one who was always compelled by her conscience to quick repentance, and sometimes to an agonising feeling of wrong done by herself. To declare that Bessy was her enemy—Bessy, who for so many years had prevented all her wishes, who had never been weary of well-doing to her, who had been patient in all things, who had been her gleam of sunshine, of whom she had sometimes said to herself in her closet that the child was certainly nearer to perfection than any other human being that she had known! True, it was not fit that the girl should become mistress of Launay! A misfortune had happened which must be cured—if even by the severance of persons so dear to each other as she and her Bessy. But she knew that she had signed in declaring one so good, and one so dear, to be her enemy. But what should she do next? Days went on and she did nothing. She simply suffered. There was no pretext on which she could frame an affectionate letter{178} to her child. She could not write and ask to be forgiven for the harshness of her letter. She could not simply revoke the sentence she had pronounced without any reference to Philip and his love. In great misery, with a strong feeling of self-degradation because she had allowed herself to be violent in her wrath, she went on, repentant but still obstinate, till Philip himself forced the subject upon her. “Mother,” he said one day, “is it not time that things should be settled?” “What things, Philip?” “You know my intention.” “What intention?” “As to making Bessy my wife.” “That can never be.” “But it will be. It has to be. If as regards my own feelings I could bring myself to yield to you, how could I do so with honour in regard to her? But, for myself, nothing on earth would induce me to change my mind. It is a matter on which a man has to judge for himself, and I have not heard a word from you or from anyone to make me think that I have judged wrongly.” “Do birth and rank go for nothing?” He paused a moment, and then he answered her very seriously, standing up and looking down upon her as he did so. “For very much—with me. I do not think that I could have brought myself to choose a wife, whatever might have been a woman’s charms, except among ladies. I found this one to be the chosen companion{179} and dearest friend of the finest lady I know.” At this the old woman, old as she was, first blushed, and then, finding herself to be sobbing, turned her face away from him. “I came across a girl of whose antecedents I could be quite sure, of whose bringing up I knew all the particulars, as to whom I could be certain that every hour of her life had been passed among the best possible associations. I heard testimony as to her worth and her temper which I could not but believe. As to her outward belongings, I had eyes of my own to judge. Could I be wrong in asking such a one to be my wife? Can I be regarded as unhappy in having succeeded with her? Could I be acquitted of dishonour if I were to desert her? Shall I be held to be contemptible if I am true to her?” At every word he spoke he grew in her esteem. At this present crisis of her life she did not wish to think specially well of him, though he was her son, but she could not help herself. He became bigger before her than he had ever been before, and more of a man. It was, she felt, almost vain for a woman to lay her commands, either this way or that, upon a man who could speak to her as Philip had spoken. But not the less was the power in her hands. She could bid him go and marry—and be a beggar. She could tell him that all Launay should go to his brother, and she could instantly make a will to that effect. So strong was the desire for masterdom upon her that she longed to do it. In the very teeth of her honest wish to do what was right, there was another wish—a longing{180} to do what she knew to be wrong. There was a struggle within, during which she strove to strengthen herself for evil. But it was vain. She knew of herself that were she to swear to-day to him that he was disinherited, were she to make a will before nightfall carrying out her threat, the pangs of conscience would be so heavy during the night that she would certainly change it all on the next morning. Of what use is a sword in your hand if you have not the heart to use it? Why seek to be turbulent with a pistol if your bosom be of such a nature that your finger cannot be forced to pull the trigger? Power was in her possession—but she could not use it. The power rather was in her hands. She could not punish her boy, even though he had deserved it. She had punished her girl, and from that moment she had been crushed by torments, because of the thing that she had done. Others besides Mrs. Miles have felt, with something of regret, that they have lacked the hardness necessary for cruelty and the courage necessary for its doing. “How shall it be, mother?” asked Philip. As she knew not what to answer she rose slowly from her chair, and leaving the room went to the seclusion of her own chamber. Days again passed before Philip renewed his question, and repeated it in the same words: “How shall it be, mother?” Wistfully she looked up at him, as though even yet something might be accorded by him to pity; as though the son might even yet be induced{181} to accede to his mother’s prayers. It was not that she thought so. No. She had thought much, and was aware that it could not be so. But as a dog will ask with its eyes when it knows that asking is in vain, so did she ask. “One word from you, mother, will make us all happy.” “No; not all of us.” “Will not my happiness make you happy?” Then he stooped over her and kissed her forehead. “Could you be happy if you knew that I were wretched?” “I do not want to be happy. It should be enough that one does one’s duty.” “And what is my duty? Can it be my duty to betray the girl I love in order that I may increase an estate which is already large enough?” “It is for the family.” “What is a family but you, or I, or whoever for the moment may be its representative? Say that it shall be as I would have it, and then I will go to her and let her know that she may come back to your arms.” Not then, or on the next day, or on the next, did she yield; though she knew well during all these hours that it was her fate to yield. She had indeed yielded. She had confessed to herself that it must be so, and as she did so she felt once more the soft pressure of Bessy’s arms as they would cling round her neck, and she could see once more the brightness of Bessy’s eyes as the girl would hang over her bed early in the morning. “I do not want to be happy,” she had said; but she did want, sorely want, to see her{182} girl. “You may go and tell her,” she said one night as she was preparing to go to her chamber. Then she turned quickly away, and was out of the room before he could answer her with a word.","sourceLink":"http://novel.tingroom.com/duanpian/2747/75700.html","bookId":1375,"book":{"id":1375,"title":"Why Frau Frohmann Raised her Prices and other stories","description":"简介： IF ever there was a Tory upon earth, the Frau Frohmann was a Tory; for I hold that landed possessions, gentle blood, a gray-haired butler behind ones chair, and adherence to the Church of England, are not necessarily the distinguishing marks of Toryi...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2747","creation":"Aug 1, 2019 12:24:58 AM","modification":"Aug 1, 2019 12:24:58 AM"}}
