{"id":27718,"no":7,"title":"CHAPTER VII. AND GOLD BECOMES CHEAP.","content":"“But if there is more money, sir, that ought to make us all more comfortable.” This was said by the Frau to Mr. Cartwright a few days after her return from Innsbruck, and was a reply to a statement made by him. She had listened to advice from Hoff the butcher, and now she was listening to advice from her guest. He had told her that these troubles of hers had come from the fact that gold had become more{80} plentiful in the world than heretofore, or rather from that other fact that she had refused to accommodate herself to this increased plenty of gold. Then had come her very natural suggestion, “If there is more money that ought to make us all more comfortable.” “Not at all, Frau Frohmann.” “Well, sir!” Then she paused, not wishing to express an unrestrained praise of wealth, and so to appear too worldly-minded, but yet feeling that he certainly was wrong according to the clearly expressed opinion of the world. “Not at all. Though you had your barn and your stores filled with gold, you could not make your guests comfortable with that. They could not eat it, nor drink it, nor sleep upon it, nor delight themselves with looking at it as we do at the waterfall, or at the mill up yonder.” “But I could buy all those things for them.” “Ah, if you could buy them! That’s just the question. But if everybody had gold so common, if all the barns were full of it, then people would not care to take it for their meat and wine.” “It never can be like that, surely.” “There is no knowing; probably not. But it is a question of degree. When you have your hay-crop here very plentiful, don’t you find that hay becomes cheap?” “That’s of course.” “And gold becomes cheap. You just think it over, and you’ll find how it is. When hay is plentiful, you{81} can’t get so much for a load because it becomes cheap. But you can feed more cows, and altogether you know that such plenty is a blessing. So it is with gold. When it is plentiful, you can’t get so much meat for it as you used to do; but, as you can get the gold much easier, it will come to the same thing,—if you will swim with the stream, as your friend in Innsbruck counselled you.” Then the Frau again considered, and again found that she could not accept this doctrine as bearing upon her own case. “I don’t think it can be like that here, sir,” she said. “Why not here as well as elsewhere?” “Because we never see a bit of gold from one year’s end to the other. Barns full of it! Why, it’s so precious that you English people, and the French, and the Americans always change it for paper before you come here. If you mean that it is because bank-notes are so common——” Then Mr. Cartwright scratched his head, feeling that there would be a difficulty in making the Frau understand the increased use of an article which, common as it had become in the great marts of the world, had not as yet made its way into her valley. “It is because bank-notes are less common.” The Frau gazed at him steadfastly, trying to understand something about it. “You still use bank-notes at Innsbruck?” “Nothing else,” she said. “There is a little silver among the shops, but you never see a bit of gold.” “And at Munich?{82}” “At Munich they tell me the French pieces have become—well, not common, but not so very scarce.” “And at Dresden?” “I do not know. Perhaps Dresden is the same.” “And at Paris?” “Ah, Paris! Do they have gold there?” “When I was young it was all silver at Paris. Gold is now as plentiful as blackberries. And at Berlin it is nearly the same. Just here in Austria, you have not quite got through your difficulties.” “I think we are doing very well in Austria;—at any rate, in the Tyrol.” “Very well, Frau Frohmann; very well indeed. Pray do not suppose that I mean anything to the contrary. But though you haven’t got into the way of using gold money yourself, the world all around you has done so; and, of course, if meat is dear at Munich because gold won’t buy so much there as it used to do, meat will be dearer also at Innsbruck, even though you continue to pay for it with bank-notes.” “It is dearer, sir, no doubt,” said the Frau, shaking her head. She had endeavoured to contest that point gallantly, but had been beaten by the conduct of the two butchers. The higher prices of Hoff at Innsbruck had become at any rate better than the lower prices of that deceitful enemy at Brixen. “It is dearer. For the world generally that may suffice. Your friend’s doctrine is quite enough for the world at large. Swim with the stream. In buying and selling,—what we call trade,—things arrange themselves{83} so subtly, that we are often driven to accept them without quite knowing why they are so. Then we can only swim with the stream. But, in this matter, if you want to find out the cause, if you cannot satisfy your mind without knowing why it is that you must pay more for everything, and must, therefore, charge more to other people, it is because the gold which your notes represent has become more common in the world during the last thirty years.” She did want to know. She was not satisfied to swim with the stream as Hoff had done, not caring to inquire, but simply feeling sure that as things were so, so they must be. That such changes should take place had gone much against the grain of her conservative nature. She, in her own mind, had attributed these pestilently increased expenses to elongated petticoats, French bonnets, swallow-tailed coats, and a taste for sour wine. She had imagined that Josephine Bull might have been contented with the old price for her eggs if she would also be contented with the old raiment and the old food. Grounding her resolutions on that belief, she had endeavoured not only to resist further changes, but even to go back to the good old times. But she now was quite aware that in doing so she had endeavoured to swim against the stream. Whether it ought to be so or not, she was not as yet quite sure, but she was becoming sure that such was the fact, and that the fact was too strong for her to combat. She did not at all like swimming with the stream.{84} There was something conveyed by the idea which was repugnant to her sense of honour. Did it not mean that she was to increase her prices because other people increased theirs, whether it was wrong or right? She hated the doing of anything because other people did it. Was not that base propensity to imitation the cause of the long petticoats which all the girls were wearing? Was it not thus that all those vile changes were effected which she saw around her on every side? Had it not been her glory, her great resolve, to stand as fast as possible on the old ways? And now in her great attempt to do so, was she to be foiled thus easily? It was clear to her that she must be foiled, if not in one way, then in another. She must either raise her prices, or else retire to Schwatz. She had been thoroughly beaten in her endeavour to make others carry on their trade in accordance with her theories. On every side she had been beaten. There was not a poor woman in the valley, not one of those who had wont to be so submissive and gracious to her, who had not deserted her. A proposed reduction of two kreutzers on a dozen of eggs had changed the most constant of humble friends into the bitterest foes. Seppel would have gone through fire and water for her. Anything that a man’s strength or courage could do, he would have done. But a threat of going back to the old wages had conquered even Seppel’s gratitude. Concurrent testimony had convinced her that she must either yield—or go. But, when she came to think of it{85} in her solitude, she did not wish to go. Schwatz! oh yes; it would be very well to have a quiet place ready chosen for retirement when retirement should be necessary. But what did retirement mean? Would it not be to her simply a beginning of dying? A man, or a woman, should retire when no longer able to do the work of the world. But who in all the world could keep the Brunnenthal Peacock as well as she? Was she fatigued with her kitchen, or worn out with the charge of her guests, or worried inwardly by the anxieties of her position? Not in the least, not at all, but for this later misfortune which had come upon her, a misfortune which she knew how to remedy at once if only she could bring herself to apply the remedy. The kaplan had indiscreetly suggested to her that as Malchen was about to marry and be taken away into the town, it would be a good thing that Peter should take a wife, so that there might be a future mistress of the establishment in readiness. The idea caused her to arm herself instantly with renewed self-assertion. So;—they were already preparing for her departure to Schwatz! It was thus she communed with herself. They had already made up their minds that she must succumb to these difficulties and go! The idea had come simply from the kaplan without consultation with any one, but to the Frau it seemed as though the whole valley were already preparing for her departure. No, she would not go! With her strength and her energy, why should she shut herself up as ready for death? She would not go to Schwatz yet awhile.{86} But if not, then she must raise her prices. To waste her substance, to expend the success of her life in entertaining folk gratis who, after all, would believe that they were paying for their entertainment, would be worse even than going to Schwatz. “I have been thinking over what you were telling me,” she said to Mr. Cartwright about a week after their last interview, on the day before his departure from the valley. “I hope you do not find I was wrong, Frau Frohmann.” “As for wrong and right, that is very difficult to get at in this wicked world.” “But one can acknowledge a necessity.” “That is where it is, sir. One can see what is necessary; but if one could only see that it were right also, one would be so much more comfortable.” “There are things so hard to be seen, my friend, that let us do what we will we cannot see clearly into the middle of them. Perhaps I could have explained to you better all this about the depreciation of money, and the nominal rise in the value of everything else, if I had understood it better myself.” “I am sure you understand all about it,—which a poor woman can’t ever do.” “But this at any rate ought to give you confidence, that that which you purpose to do is being done by everybody around you. You were talking to me about the Weisses. Herr Weiss, I hear, had his salary raised last spring.” “Had he?” asked the Frau with energy and a little{87} start. For this piece of news had not reached her before. “Somebody was saying so the other day. No doubt it was found that he must be paid more because he had to pay more for everything he wanted. Therefore he ought to expect to have to pay you more.” This piece of information gave the Frau more comfort than anything she had yet heard. That gold should be common, what people call a drug in the market, did not come quite within the scope of her comprehension. Gold to her was gold, and a zwansiger a zwansiger. But if Herr Weiss got more for his services from the community, she ought to get more from him for her services. That did seem plain to her. But then her triumph in that direction was immediately diminished by a tender feeling as to other customers. “But what of those poor Fraulein Tendels?” she said. “Ah, yes,” said Mr. Cartwright. “There you come to fixed incomes.” “To what?” “To people with fixed incomes. They must suffer, Frau Frohmann. There is an old saying that in making laws you cannot look after all the little things. The people who work and earn their living are the multitude, and to them these matters adjust themselves. The few who live upon what they have saved or others have saved for them must go to the wall.” Neither did the Frau understand this; but she at once made up her mind that, however necessary it might be{88} to raise her prices against the Weisses and the rest of the world, she would never raise them against those two poor desolate frauleins. So Herr Weiss had had his salary raised, and had said nothing to her about it, no doubt prudently wishing to conceal the matter! He had said nothing to her about it, although he had talked to her about her own affairs, and had applauded her courage and her old conservatism in that she would not demand that extra zwansiger and a half! This hardened her heart so much that she felt she would have a pleasure in sending a circular to him as to the new tariff. He might come or let it alone, as he pleased,—certainly he ought to have told her that his own salary had been increased! But there was more to do than sending out the new circular to her customers. How was she to send a circular round the valley to the old women and the others concerned? How was she to make Seppel, and Anton, and Josephine Bull understand that they should be forgiven, and have their old prices and their increased wages if they would come back to their allegiance, and never say a word again as to the sad affairs of the past summer? This circular must be of a nature very different from that which would serve for her customers. Thinking over it, she came to the opinion that Suse Krapp would be the best circular. A day or two after the Cartwrights were gone, she sent for Suse. Suse was by no means a bad diplomate. When gaining her point she had no desire to triumph outwardly. When feeling herself a conqueror, she was{89} quite ready to flatter the conquered one. She had never been more gracious, more submissive, or more ready to declare that in all matters the Frau’s will was the law of the valley than now, when she was given to understand that everything should be bought on the same terms as heretofore, that the dairy should be discontinued during the next season, and that the wild fruits of the woods and mountains should be made welcome at the Peacock as had heretofore always been the case. “To-morrow will be the happiest day that ever was in the valley,” said Suse in her enthusiasm. “And as for Seppel, he was telling me only yesterday that he would never be a happy man again till he could find himself once more at work in the old shed behind the chapel.” Then Suse was told that Seppel might come as soon as he pleased. “He’ll be there the morning after next if I’m a living woman,” continued Suse energetically; and then she said another word, “Oh, meine liebe Frau Frohmann, it broke my heart when they told me you were going away.” “Going away!” said the Frau, as though she had been stung. “Who said that I was going away?” “I did hear it.” “Psha! it was that stupid priest.” She had never before been heard to say a word against the kaplan; but now she could hardly restrain herself. “Why should I go away?{90}” “No, indeed!” “I am not thinking of going away. It would be a bad thing if I were to be driven out of my house by a little trouble as to the price of eggs and butter! No, Suse Krapp, I am not going away.” “It will be the best word we have all of us heard this many a day, Frau Frohmann. When it came to that, we were all as though we would have broken our hearts.” Then she was sent away upon her mission, not, upon this occasion, without a full glass of kirsch-wasser. On the very day following Seppel was back. There was nothing said between him and his mistress, but he waited about the front of the house till he had an opportunity of putting his hand up to his cap and smiling at her as she stood upon the doorstep. And then, before the week was over, all the old women and all the young girls were crowding round the place with little presents which, on this their first return to their allegiance, they brought to the Frau as peace-offerings. The season was nearly over when she signified to Malchen her desire that Fritz Schlessen should come out to the valley. This she did with much good humour, explaining frankly that Fritz would have to prepare the new circulars, and that she must discuss with him the nature of the altered propositions which were to be made to the public. Fritz of course came, and was closeted with her for a full hour, during which he absolutely prepared the document for the Innsbruck printer. It was a simple announcement that for the future the charge made at the Brunnenthal Peacock{91} would be seven and a half zwansigers per head per day. It then went on to declare that, as heretofore, the Frau Frohmann would endeavour to give satisfaction to all those who would do her the honour of visiting her establishment. And instructions were given to Schlessen as to sending the circulars out to the public. “But whatever you do,” said the Frau, “don’t send one to those Tendel ladies.” And something else was settled at this conference. As soon as it was over Fritz Schlessen was encountered by Malchen, who on such occasions would never be far away. Though the spot on which they met was one which might not have been altogether secure from intrusive eyes, he took her fondly by the waist and whispered a word in her ear. “And will that do?” asked Malchen anxiously; to which question his reply was made by a kiss. In that whisper he had conveyed to her the amount now fixed for the mitgift.","sourceLink":"http://novel.tingroom.com/duanpian/2747/75689.html","bookId":1375,"book":{"id":1375,"title":"Why Frau Frohmann Raised her Prices and other stories","description":"简介： IF ever there was a Tory upon earth, the Frau Frohmann was a Tory; for I hold that landed possessions, gentle blood, a gray-haired butler behind ones chair, and adherence to the Church of England, are not necessarily the distinguishing marks of Toryi...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2747","creation":"Aug 1, 2019 12:24:58 AM","modification":"Aug 1, 2019 12:24:58 AM"}}
