{"id":66326,"no":1,"title":"Page 1","content":"One\\n\\n “I think Dad wants to get back together.” Bethanne’s daughter, Annie, spoke with studied nonchalance. “He still loves you, Mom.”\\n\\n Bethanne’s spoon hovered over her bowl of soup as they sat at a window table in their favorite café. This wasn’t actually news and shouldn’t have come as any surprise. Didn’t come as any surprise. She’d seen the signs, as recently as this morning. These days Grant was inventing excuses to call her.\\n\\n Six years ago her world had imploded when her husband confessed that he’d fallen in love with another woman. With barely a backward glance, Grant had walked out—out of their home, their marriage, their lives. And now he wanted back in.\\n\\n “Don’t you have anything to say?” Annie asked, toying with her fork. She watched her mother intently.\\n\\n “Not really.” She swallowed the soup and lowered her spoon for another taste.\\n\\n Annie, it seemed, had forgotten. But not Bethanne.\\n\\n The morning Grant told her he wanted a divorce would stay in her mind forever. He couldn’t seem to get away from her fast enough. He’d retained a lawyer and advised her to do the same, then coldly informed her that all future communication would be through their lawyers. The less contact with her and their children, the better, he’d said. A clean break was best.\\n\\n Grant’s decision had struck Bethanne with the force and unpredictability of a hurricane. She’d stumbled blindly through the next few months, trying to hold her family together, clinging to the semblance of normality while her world disintegrated around her. “You really don’t have anything to say?” Annie prodded.\\n\\n “No,” Bethanne said shortly. She swallowed another spoonful of soup and reached for the herb scone. “What disturbs me is that your father would let you do his talking for him.”\\n\\n Annie had the grace to look chastened, but she pushed her food away as if she’d suddenly lost her appetite.\\n\\n At one time Bethanne had dreamed Grant would regret what he’d done, that he’d seek her forgiveness and come crawling back to her. She’d wanted him to suffer for the way he’d treated her, for the hurt he’d inflicted when he’d turned his back on their children.\\n\\n But in the years since the divorce, Bethanne had gradually found her footing and, in the process, discovered a self she didn’t know existed—a stronger, independent Bethanne, a woman forged in the fire of despair. Now her two children were on their own; her oldest, Andrew, was engaged to be married in a few weeks, following his graduation from law school. As for her daughter, Annie was a year from obtaining her MBA. She worked part-time with Bethanne on the creative end of the party business Bethanne had established in the wake of her divorce.\\n\\n During her twenty years of marriage, Bethanne had become known for her lavish and inventive parties. She’d taken pride in making Grant look good by hosting unforgettable events for clients and potential clients—an invitation to Grant’s home became a sought-after privilege in certain circles. Her birthday parties for Andrew and Annie were legendary. But never once had she dreamed that her party-giving skills would eventually be parlayed into such a success.\\n\\n She’d started the business, which she called simply Parties, as a way of making enough money to continue living in their family home, although she’d had to take out a substantial second mortgage to get Parties off the ground. Grant had paid the required support, but depending on that would’ve meant moving to a smaller house in a different neighborhood. If ever her children needed stability, she knew, it was in the period after the divorce. She’d since paid off both mortgages.\\n\\n To Bethanne’s astonishment, the business had taken off immediately. She’d started small, with themed birthday parties for children. The Alice in Wonderland Tea Party had been the most popular of the dozens of concepts she’d created. With busy schedules, parents were looking for an easy, economical way to make birthday parties special. Bethanne’s company had filled that need.\\n\\n Currently, there were five Parties stores in the Seattle area, including the original location, and she was considerating a deal that offered national franchising opportunities. The key was to keep the ideas fresh and the prices reasonable. This past winter she’d added a “birthday party in a box”—more scaled-down, do-it-yourself versions of her trademarked theme parties.\\n\\n A year earlier Bethanne had hired Julia Hayden as her corporate operations manager. Julia was efficient, dedicated and gifted. She loved the job and had begun overseeing the company’s day-today activities, freeing Bethanne to focus on creative development. Annie worked with her, and the two of them had recently developed birthday party ideas for cats and dogs, which was now a popular trend, especially among childless, affluent professionals. They’d expanded into other types of parties, too—anniversary and retirement celebrations, Christmas and even Halloween events.\\n\\n Bethanne signaled for the check, and they went their separate ways with a quick hug and a wave. Annie was walking back to the office, while Bethanne headed for Blossom Street and A Good Yarn. Knitting had become one of her favourite activities. When she needed to think, nothing helped more than sitting down with a knitting project. She felt a sense of happy anticipation as she parked in front of the yarn store, which was owned by her dear friend Lydia Goetz.\\n\\n With the wedding only six weeks away, she’d wanted to knit something for Courtney, her almost-daughter-in-law, to wear during the wedding.\\n\\n The wedding. It was why Grant had called her two weeks ago—their son’s marriage had given him a legitimate excuse—and he’d called twice since then, including this morning.\\n\\n Other than the occasional joint decisions they’d made regarding their children, they’d had little personal contact since the divorce. Then Grant had phoned her with a question about a wedding gift for Andrew and Courtney. He’d been friendly and relaxed. And this week, he’d asked her to dinner.\\n\\n Dinner. She and Grant. After six years?\\n\\n She’d heard from Annie that his marriage to Tiffany had ended in divorce the previous year—after a brief separation—and felt genuinely sorry for him. This was a second divorce for Tiffany, as well. In fact, Bethanne had briefly dated Paul, Tiffany’s first husband, shortly after the divorce, although date wasn’t exactly the right word. They’d been more of a two-person support group, helping each other grapple with their betrayal by the people they loved.\\n\\n Unfortunately, Andrew’s relationship with his father remained cool. Her son had met his father’s desertion with a bitter resolve that only seemed to harden as he grew older. Andrew was polite but kept an emotional distance from Grant.\\n\\n For Annie, sixteen at the time, the divorce had been nothing short of devastating. Always a “daddy’s girl,” she’d acted out her shock and pain as only a willful teenager can. Annie blamed Tiffany for stealing her father away and had done everything she could to sabotage the marriage. But Bethanne was also a target for her rage during those early months. Annie had railed at her for being too “boring” and “clueless” to keep her father happy. Bethanne had never responded to Annie’s accusations about her failures as a wife, afraid to reveal how close to home her words had hit. Eventually, Annie had adjusted to the new reality, although she still referred to Grant’s second wife in sarcastic tones as “the lovely Tiffany.”\\n\\n Bethanne thought about her conversation with him that morning. His excuse for calling this time was so flimsy Bethanne couldn’t even remember what it was. He’d kept her on the line, relating office gossip as if she was still intimately familiar with the goings-on at his workplace. After several minutes of chatter, he reminded her that she hadn’t given him a definite answer regarding his dinner invitation.\\n\\n “Grant,” she’d said bluntly. “Why are you doing this?”\\n\\n For a moment there was silence on the other end. When he spoke, any hints of lightheartedness were gone. “I made a mistake, Bethanne.” His voice caught, and for once he seemed at a loss for words. “A major one.” He left the rest unsaid, but she knew what he meant. He wanted things back the way they used to be.\\n\\n Well, good luck with that. Bethanne wasn’t the same naive woman he’d divorced, and she wasn’t interested in retracing her steps.\\n\\n After six years on her own, she’d discovered she didn’t want or need a man complicating her life. Years ago she’d read somewhere that “it takes a hell of a man to replace no man.” At first, that remark had seemed merely humorous; she hadn’t completely understood what it meant. She did now.\\n\\n While she was flattered that Grant wanted to reconcile, the situation wasn’t that simple. He’d had his chance. He was the one who’d deserted her, who’d left her floundering and shaken. Without ever thinking about the consequences of his actions, he’d ripped apart their family, betrayed her and their children, robbed them all of their security.\\n\\n Now he was sorry. Fine. He’d seen the error of his ways and realized what a terrible mistake he’d made.\\n\\n So of course he wanted her back. She was a successful businesswoman with a growing company that received lots of media and corporate interest. In six short years she’d made a name for herself. She’d been interviewed by Forbes and the Wall Street Journal. A piece had been written about her in USA Today. Her ex had his nerve.\\n\\n Contrition was all well and good. Bethanne felt a certain vindication in hearing Grant admit how wrong he’d been, a certain sense of righteousness. She’d forgiven him to the best of her ability, refusing to let herself be trapped in the mire of resentment. He had a new life and so did she. But forgiveness, she’d learned, was tricky. Just when she felt sure she was beyond rancor, she’d find herself wallowing in indignation. Like the night three years ago when the pipe burst in the basement and she couldn’t figure out where to turn off the water. If Grant had been there he would’ve known what to do. By the time she found the tap she’d been shaking with anger, and as unreasonable as it seemed, she’d blamed Grant. This was all his fault. He should’ve been there. How dared he do this to her and, worse, to their children!\\n\\n She should reject his invitation, she told herself now. Laugh in his face. Tell him to take a hike.\\n\\n To her astonishment she couldn’t.\\n\\n It had taken courage for Grant to approach her, courage and, yes, nerve. She’d give him that. Crazy though it might be, Bethanne realized she still had feelings for Grant, feelings she’d pushed aside for the past few years. She didn’t love him, not in the all-consuming way she had when they were married. Back then, she’d been blind to his flaws and his weaknesses, blind to what should’ve been obvious, especially after he’d started the affair. His betrayal had revealed that the man she’d married was selfish and shallow. And yet he hadn’t always been like that. She couldn’t forget the companionship—and the passion—of their early years together….\\n\\n She loved him.\\n\\n She hated him.\\n\\n Both emotions warred within her.\\n\\n “Dinner for old times’ sake,” he’d almost pleaded. “Besides, we need to talk about Andrew’s wedding.” \\n\\n","sourceLink":"https://allnovel.net/a-turn-in-the-road-blossom-street-8/page-1.html","bookId":1940,"book":{"id":1940,"title":"A Turn in the Road (Blossom Street #8)","description":"Storyline: A Turn in the Road (Blossom Street #8) \\n Six years after he had walked out on his wife and kids, Grant was freshly single again and looking to reconcile with Bethanne Hamlin. To forgive the betrayal was one thing, she did that for herself. To forget was something that she didn’t think she could ever do and she wasn’t sure if she could ever trust him again either. Being willing to at least think about it for the sake of the grown kids, herself, him, she wasn’t sure, but think about it she was. Hearing that her ex-mother-in-law was planning a road trip across the country to her 50th class reunion in Florida was the perfect excuse to get away and do that thinking. With the addition of her daughter Annie, Ruth and Bethanne set out to see America. Even though Ruth had made plans, the addition of Annie added spontaneity to the group, taking them off the plotted course early in the trip. Helping out in a diner for an old friend of Ruth’s was the fist of may changes to come. Then they have trouble with the rental car with only one source of help, and that coming from a group of motorcycle riders they met at the diner. Offering a ride to the nearest town was the best way for Max to help, but the connection they found while offering confessions may make some decisions more difficult.\\n","cover":"https://allnovel.net/images/a-turn-in-the-road-blossom-street-8.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/a-turn-in-the-road-blossom-street-8.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:00:24 AM"}}
