{"id":66340,"no":15,"title":"Page 15","content":"Max took off his helmet and climbed down; she did, too, with a lot less grace. “Were you able to breathe?” she asked.\\n\\n The merest hint of a smile touched his mouth. “Barely. I think I might have a couple of cracked ribs.”\\n\\n Bethanne didn’t know if this was a joke or if he was serious. “Sorry.”\\n\\n He entered the garage and she trailed after him. The mechanic brightened the instant he saw Max, came forward and thrust out his hand. “Max! Good to see you again. I got that widow’s car running and—”\\n\\n “Hey, Marv, I need a favor,” Max said, cutting him off.\\n\\n “You got it,” the other man said without hesitation. “I owe you. I didn’t need even half the money you gave me to fix that old Ford.”\\n\\n “You don’t owe me a thing.”\\n\\n The mechanic obviously knew and trusted Max. That was a good sign as far as Bethanne was concerned.\\n\\n He nodded at Bethanne. “Name’s Marvin Green.”\\n\\n “Bethanne,” she said. “Bethanne Hamlin.”\\n\\n “Can you send a tow truck out to Snow Water Lake?” Max asked his friend.\\n\\n “Sure.” Marvin went into a small windowed office and picked up a phone. Max and Bethanne waited outside.\\n\\n “Is there a rental car place in town?” Bethanne asked, since they’d need to exchange vehicles.\\n\\n “I only ride,” he said, which she guessed was his shortcut way of telling her he didn’t know.\\n\\n “You don’t talk much, do you?”\\n\\n “No.”\\n\\n “Any particular reason?”\\n\\n He shrugged. “I generally don’t have a lot to say.”\\n\\n Bethanne didn’t believe him but didn’t respond, either.\\n\\n Max walked over to the soda machine, inserted a couple of dollar bills and bought two sodas, bringing her one.\\n\\n “Thanks,” she said, accepting it gratefully. Her throat was parched. They wandered over to a row of plastic chairs and sat quietly, side by side, while Marvin made phone calls.\\n\\n After several minutes of discomfort, Bethanne found herself breaking the silence. “I thought about you last night.” The confession popped out before she could censure it. She had no idea what had prompted the comment and instantly regretted it.\\n\\n His gaze shot to hers. She could tell she’d surprised him.\\n\\n Instead of dropping it the way she should have, she made matters worse. “Actually, I said a prayer for you…. I didn’t used to pray,” she added awkwardly, feeling she needed to explain herself. “Not until recently.” The words just kept coming. Normally Bethanne would never have blurted out something this personal. She hardly ever talked about politics or religion and never with someone who was basically a stranger.\\n\\n He stared at her as if he didn’t know how to take her ad mission.\\n\\n She’d started down this road, so she might as well continue. “I always believed in God. I went to church and all that, but, well…after my husband left me, I backed off for a while. I feel differently now….”\\n\\n “You’re divorced?”\\n\\n She nodded. “Six years now. Annie’s my daughter and Ruth’s my—mother-in-law.”\\n\\n “Ex-mother-in-law.”\\n\\n “Technically, you’re right. But I don’t think of her in those terms. Grant divorced me, but I chose to keep Ruth.”\\n\\n “Your husband’s an idiot,” Max said.\\n\\n “Ex-husband,” she corrected, and to her astonishment, Max laughed.\\n\\n Marvin glanced their way and lifted his chin. Max stood, joining the mechanic in his office. The two men spoke for a while; she finished her soda before Max returned.\\n\\n “Marvin found a tow truck willing to drive out to the lake.”\\n\\n That was a relief. “Would it be okay if I rode back with the driver rather than on the Harley? No slight intended, but I think we’d both be more comfortable.”\\n\\n “That’s fine.”\\n\\n Once again they sat in silence. Finally, Max leaned forward, his forearms resting on his thighs. “Why did you feel you needed to say a prayer for me?” he asked.\\n\\n Bethanne wasn’t sure what to tell him. She couldn’t very well admit he’d remained in her thoughts—and that she didn’t understand why. “I…asked God to keep you and your friends safe on the road. Of course, at the time, I didn’t know I was going to be riding, uh, buddy with you in the very near future.” She tried to make light of it and realized she was saying far more than necessary. Maybe it was because he didn’t speak much that she felt this compulsion to fill the void with chatter.\\n\\n “Why?” he asked again after she’d stopped talking.\\n\\n Bethanne closed her eyes and settled back against the hard chair. “I don’t exactly know.” She wasn’t being completely honest. At the café she’d been aware that he was watching her as she moved about, waiting tables, delivering meals, doing her best to keep up with customers’ demands. A couple of times their eyes had met. She’d smiled, but he hadn’t. His lack of response hadn’t intimidated her; instead, she saw something in him…something she recognized in herself. Pain. She sensed that he’d suffered the same kind of wrenching emotional pain she had. Ultimately that was what had prompted her to pray for him.\\n\\n “Would you mind if I asked you a question?” She looked up at him.\\n\\n “That depends. You can ask, but I might not answer.”\\n\\n “Fair enough.”\\n\\n Max walked over to the vending machine as if he needed to put distance between them.\\n\\n Bethanne stood and followed him. “Did your wife leave you?” she asked in a low voice.\\n\\n He turned and faced her and seemed to be studying her intently. Bethanne held his gaze.\\n\\n “No,” he said after a lengthy moment.\\n\\n “Oh.” She couldn’t keep her foot out of her mouth with this man.\\n\\n “Kate died three years ago.”\\n\\n Bethanne wanted to tell him how sorry she was but instinctively knew he’d find no comfort in her condolences. “You’ve been on the bike ever since, haven’t you?”\\n\\n He frowned and then nodded.\\n\\n Bethanne wasn’t sure how she knew it, but she did. Living the life of a drifter probably meant he didn’t have children. No roots. No ties. Free to roam wherever the wind took him.\\n\\n “Grant married Tiffany,” she said.\\n\\n “Good for him.”\\n\\n “Then she left him.”\\n\\n Max smiled. So did Bethanne.\\n\\n “You’re supposed to say it served him right.”\\n\\n “Served him right,” Max echoed.\\n\\n “He’s divorced now and—”\\n\\n “He wants you back.”\\n\\n Bethanne gaped at him. “How’d you know?”\\n\\n “Makes sense. Are you going to take him back?”\\n\\n That was the million-dollar question. “I don’t know…I just don’t know.” Bethanne wasn’t an indecisive woman; she’d learned not to be in the six years since Grant had walked out. This question, however, left her stomach in knots and her mind in a state of confusion. Fortunately, an answer wasn’t immediately required. She had time.\\n\\n Before she could say more, the tow truck rounded the corner. “Max?” she whispered. “Listen, I might not get a chance later but I wanted to thank you.”\\n\\n He lifted one shoulder. “You’re welcome.”\\n\\n Unable to stop herself, she briefly, gently, touched his hand. Despite their physical contact on the bike, this was different. More intentional, more…personal. She felt the urge to at least try to comfort him, to show him how sorry she was about his wife’s death.\\n\\n From the look on his face she could see that her gesture had jolted him. He stared down at her and frowned.\\n\\n Then, just as she removed her hand from his, Max stepped toward her.\\n\\n Tentatively, he circled her waist with his arms and she returned his embrace. His pulse thundered in her ear. Slowly, ever so slowly, his hold tightened. She felt him inhale deeply and closed her eyes at his touch. She wanted to weep; she didn’t understand why.\\n\\n Max’s hands moved over her back, caressing her.\\n\\n “It gets easier,” she whispered. “I promise you it does.”\\n\\n Max brushed his lips against her hair, then dropped his arms and stepped back.\\n\\n “Thank you,” she said, feeling foolish and sentimental.\\n\\n The tow truck driver climbed out of his rig and walked toward them but before she left, Bethanne had one last thing to say. She couldn’t meet Max’s eyes. “Your Kate must have been very special,” she said softly.\\n\\n Max reached for his helmet. He didn’t speak for a long time and then murmured, “She was.”\\n\\n Ten\\n\\n “I don’t like this. I don’t like this one bit,” Ruth told her granddaughter as Bethanne left riding behind that biker. For all they knew, Max could be some kind of…hoodlum. She’d read about motorcycle gangs, and while she doubted that these four belonged to any organized group, she was sure they couldn’t be trusted.\\n\\n “What alternative do we have?” Annie asked.\\n\\n Ruth feared they’d been far too quick to let Bethanne leave with Max. They knew absolutely nothing about these men, other than the fact that they weren’t capable of fixing a carburetor. “We should’ve done what we originally planned—waited until dusk and then walked to the highway.” In retrospect, Ruth regretted not insisting they do exactly that.\\n\\n “And take our chances hitchhiking into Wells?” Annie shook her head. “I doubt that people who pick up hitchhikers can be trusted, either, Grandma. At least we’ve seen these men before.”\\n\\n Annie could be right. Hitchhiking into town didn’t sound too appealing and it could make them even more vulnerable. She tapped her fingers nervously on the car’s hood while she worried about Bethanne alone with that biker.\\n\\n “Why didn’t I listen to Robin?” Ruth muttered. She’d assumed Robin was being overprotective. Because of her experience in court, dealing with criminals day in and day out, Robin had a polluted view of humanity. She trusted no one and seemed to look for the bad in people, to expect it. All with good reason; Ruth understood that, but it saddened her.\\n\\n Ruth’s job now, she felt, was to protect Annie in case these men decided to take advantage of her granddaughter. She drew Annie away from them to stand beneath the shade of the only tree, which happened to be several feet off.\\n\\n “We should make contingency plans,” she whispered, although there was little chance the men could overhear their conversation.\\n\\n “How?”\\n\\n “In case…” Ruth didn’t want to say it. “You know.”\\n\\n Annie gave her an odd look. “You mean we should dismantle their motorcycles so they couldn’t come after us if we ran away?”\\n\\n Ruth hadn’t thought of that, but it was an excellent idea. “Good plan,” she said approvingly.\\n\\n Annie rolled her eyes. “Grandma, I was only joking!”\\n\\n “That would be our insurance.”\\n\\n Annie frowned. “I don’t think—”\\n\\n “It’s what Robin would suggest.”\\n\\n “Yes, but Aunt Robin—” \\n\\n","sourceLink":"https://allnovel.net/a-turn-in-the-road-blossom-street-8/page-15.html","bookId":1940,"book":{"id":1940,"title":"A Turn in the Road (Blossom Street #8)","description":"Storyline: A Turn in the Road (Blossom Street #8) \\n Six years after he had walked out on his wife and kids, Grant was freshly single again and looking to reconcile with Bethanne Hamlin. To forgive the betrayal was one thing, she did that for herself. To forget was something that she didn’t think she could ever do and she wasn’t sure if she could ever trust him again either. Being willing to at least think about it for the sake of the grown kids, herself, him, she wasn’t sure, but think about it she was. Hearing that her ex-mother-in-law was planning a road trip across the country to her 50th class reunion in Florida was the perfect excuse to get away and do that thinking. With the addition of her daughter Annie, Ruth and Bethanne set out to see America. Even though Ruth had made plans, the addition of Annie added spontaneity to the group, taking them off the plotted course early in the trip. Helping out in a diner for an old friend of Ruth’s was the fist of may changes to come. Then they have trouble with the rental car with only one source of help, and that coming from a group of motorcycle riders they met at the diner. Offering a ride to the nearest town was the best way for Max to help, but the connection they found while offering confessions may make some decisions more difficult.\\n","cover":"https://allnovel.net/images/a-turn-in-the-road-blossom-street-8.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/a-turn-in-the-road-blossom-street-8.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:00:24 AM"}}
