{"id":66341,"no":16,"title":"Page 16","content":"Ruth already knew what her granddaughter was about to say. She agreed, but they didn’t have time to discuss Robin. If they were going to act, they had to do it now. “I’ll distract the men and then you do whatever one does to make motorcycles refuse to start.”\n “Do you know what that is?” Annie asked.\n “No. Don’t you?”\n “Nope.”\n “Oh, dear.” So much for that. Ruth bit her lip as she searched for another idea. “There’s got to be a way to protect ourselves.” Her gaze fell to the ground as she began pacing. “And your mother—”\n “I think Mom’s safe.”\n “I certainly hope so,” Ruth said, her mind whirling. “What would we tell the police? These bikers don’t even have real names! Who ever heard of men named Rooster and Skunk? If something did happen, God forbid, how could we tell the police we let your mother drive off with someone named Rooster?”\n “She’s with Max, not Rooster. Nothing’s going to happen, Grandma. You’re getting yourself worked up for no reason.”\n “Forget the police,” Ruth continued. “What am I going to tell your father?”\n “Grandma, repeat after me. Nothing is going to happen.”\n Ruth ignored that. “Grant will be so upset with me,” she went on. “He’ll say it’s all my fault and I can’t blame him. I’m responsible for this mess. I should’ve insisted I be the one to go. I’ve lived my life. You and your mother are young.”\n “You want to see your high school friends again, don’t you?”\n “Of course.” Ruth sighed. She desperately wanted to see Royce, too. Just once, so she could tell him how sorry she was, how deeply she regretted having hurt him. But if she had to give up her life in order to save her daughter-in-law and granddaughter, Ruth wouldn’t think twice. A small part of her wondered if she was overreacting, but she decided she simply couldn’t take the risk.\n “Do you have any ideas?” she asked her granddaughter. Annie was smart and sensible like Bethanne. The girl would come up with something.\n “In my opinion, we should just wait this out. If Mom isn’t back in, say, another hour—”\n “Another hour?” Ruth interrupted. That seemed far too long.\n “Grandma,” Annie said, “it’ll take time to get into Wells and then more time to arrange for a tow truck. We should wait a minimum of ninety minutes.”\n “Then what?”\n “Then we…I don’t know, regroup, I guess.”\n “Okay.” However, Ruth didn’t like it. She checked her watch so she’d know exactly when those ninety minutes were up and prepared to wait.\n To distract themselves they discussed Las Vegas and what they’d do when they got there.\n After ten interminable minutes, Ruth chanced a look at the bikers and to her shock saw the three of them swimming. Their clothes, all of them, were piled along the shoreline and…oh, my goodness, they’d gone in the water nude. She felt herself flush. While she’d been talking to Annie, those men had stripped naked.\n “We don’t have a thing to worry about,” she told Annie. Ruth had the perfect plan. “I’ve got everything under control.”\n “What do you mean?”\n “You’ll see.” As casually as possible, Ruth strolled toward the lake.\n “Grandma,” Annie called after her. “What are you going to do?”\n She whirled around and pressed her finger to her lips, shushing Annie.\n “Grandma,” her granddaughter called again, this time in a harsh whisper. “Don’t do anything…silly.”\n Ruth waved off her concern. As fast as she could, she gathered up the men’s clothes. Clasping them to her chest, she ran toward Annie.\n “What are you doing?” Rooster shouted.\n Facing them, Ruth said loudly, “I’m taking your clothes and I’m not giving them back until Bethanne is returned safe and sound.” She clutched the clothes even tighter, unwilling to surrender a single item.\n All three men laughed as though they thought her hilarious.\n Without another word, Rooster started walking to shore and the other two followed. Soon vital body parts were fully exposed. Ruth gasped and backed away. Clearly the threat of not having their clothes meant nothing to them.\n “That scares us, Grandma. That really scares us.”\n Ruth dropped the clothes and, feeling more than a little ridiculous, hurried over to Annie.\n They heard the roar of a motorcycle in the distance.\n “Mom’s back!” Annie cried.\n The weight of worry and responsibility instantly lifted from Ruth’s shoulders—until Max rode into view.\n He was alone.\n Ruth grabbed Annie’s arm. “Your mother isn’t with him,” she hissed.\n “She’s probably with the tow truck driver,” Annie said, not revealing the slightest alarm. “And where is the tow truck?” she asked. A chill went down her spine. Hands on her hips, Ruth marched up to Max and waited until he’d turned off that blasted ear-splitting engine. “What have you done with my daughter-in-law?” she demanded.\n Max slowly removed his helmet.\n “I want to know right this minute where Bethanne is,” she yelled.\n “Grandma, Grandma,” Annie hollered. “The tow truck is here.”\n Ruth wagged her finger under Max’s nose. “You’re fortunate Bethanne is safe. Otherwise…otherwise, you would’ve been sorry.”\n “Ooh, he’s shaking in his boots,” Rooster said, then practically collapsed with laughter.\n Ruth was pleased to know she was such a source of amusement. The tow truck parked, the passenger door opened and Bethanne climbed down. Ruth ran over to her.\n “I was so worried,” she blurted as she pulled Bethanne into her arms and hugged her hard.\n “I’m fine, Ruth, just fine.”\n Bethanne stretched out one arm to Annie and they held hands. “I talked to a mechanic who’s going to fix the car. We’ll need to spend the night in Wells, but we should be able to leave sometime tomorrow.”\n Annie nodded. “As soon as we’re somewhere with cell coverage, I’ll find us a hotel room and cancel our reservations in Ely.”\n “Now I’m thinking we shouldn’t go to Vegas,” Ruth said. “We went off course and look what happened.”\n “Not go to Vegas?” Annie wailed. “Oh, Grandma, we can’t change our plans now.”\n “Why can’t we?”\n “I—” Annie turned to Bethanne. “Mom…”\n “I was looking forward to seeing Vegas and so was Annie,” Bethanne said. “I’m sure everything will be fine now. We’ll pick up a new rental car while we’re there and continue on our trip.”\n Ruth seemed unconvinced. “I don’t know….”\n “Please, Grandma,” Annie begged. “Vegas will be fun, and after today that’s what we need.”\n “Oh, all right.” She felt she’d succumbed far too easily, but it wasn’t in her to disappoint Annie or Bethanne.\n “Good.” Bethanne returned to the tow truck and removed a large white bag.\n “What’s that?” Annie asked.\n “I got the driver to take me to a fast food place so I could pick up burger-and-fry combos for the guys,” she said. “I can hardly imagine what we would’ve done if they hadn’t stopped by the lake when they did.”\n “You bought them burgers?” These were the men who’d frightened her out of several years of her life, and her daughter-in-law wanted to feed them?\n Bethanne brought the bag over to the bikers who were, thankfully, dressed by now. At least Bethanne had been spared that sight.\n “You should know Grandma there tried to abscond with our clothes,” Rooster said as he helped himself to a burger and a bag of fries. His eyes twinkled with merriment. “She assumed that was a major threat.”\n “We showed her,” Willie said.\n “That’s just it,” Ruth snapped, unwilling to be the butt of their jokes. “You did show me—you exposed yourselves. There’s laws against that. I should’ve made a citizen’s arrest.”\n Bethanne grinned, and Ruth decided it would be best to simply drop the matter.\n Annie distributed the rest of the food, and the men sat together while the three women went off to relax under the tree.\n Ruth hadn’t realized how thirsty she was until she drank a bottle of the water Bethanne had brought back. They’d already eaten lunch, but even if she’d been ravenous, she couldn’t have managed a bite—and the thought of a greasy burger was singularly unappealing. Not so with the bikers and the tow truck driver, who wolfed down their food so fast it made her feel nauseous.\n Bethanne and Annie thanked everyone for their help. Although the men on bikes hadn’t turned out to be ax murderers, Ruth let the other two women do the talking.\n Fortunately, the tow truck had a backseat so they could all fit inside. During the ride into town Bethanne seemed unusually quiet and Ruth could only speculate on what she was thinking.\n “Those bikers weren’t so bad, now, were they?” Annie said.\n Ruth nodded reluctantly. “They weren’t as bad as I feared.”\n “Oh, Grandma, admit it. They were cool guys, helping us like that.”\n “Cool guys?” Ruth glanced at Bethanne. She could do with some reinforcement in case her daughter-in-law hadn’t noticed.\n “Actually, Max was a real gentleman,” Bethanne said.\n “A gentleman?” Well, okay, maybe she’d been wrong, but Ruth always figured it was better to be prepared.\n Eleven\n There wasn’t much to recommend Wells, Nevada, as a tourist destination. The entire town consisted of two casinos, gas stations, a fast-food joint and a few watering holes. After the vehicle was repaired, with the promise of a replacement once they reached Las Vegas, Bethanne, Ruth and Annie found a room for the night.\n “I think we should call Dad,” Annie said, sitting cross-legged on one of the two queen-size beds. “He should know where we are.”\n “You can if you want,” Bethanne told her daughter. She propped her suitcase up on the luggage holder, unzipped it and took out what she needed for the night.\n “He’s not going to be too happy with us,” Annie murmured, looking thoughtful. She nibbled on her lower lip. “Maybe I should wait until we’re in Vegas.”\n Bethanne made a noncommittal sound.\n “We might as well face the music,” Ruth said. “Get it over with.” She sat on the edge of the bed, obviously worn-out from their unexpected adventure. “Guaranteed, Grant will mention it to Robin and then we’ll all get read the riot act.”\n “The riot act, Grandma? What’s that?”\n “Oh, it’s an expression based on an old English law. It just means Robin’s going to be furious—and she’s going to let us know it. I don’t care. She can say what she wants. We’re safe now and that’s all that matters.” Ruth set her pajamas on the second bed and sank into the mattress. “I don’t mind telling you, after a day like this, I’m completely exhausted.” \n","sourceLink":"https://allnovel.net/a-turn-in-the-road-blossom-street-8/page-16.html","bookId":1940,"book":{"id":1940,"title":"A Turn in the Road (Blossom Street #8)","description":"Storyline: \n A Turn in the Road (Blossom Street #8) \n Six years after he had walked out on his wife and kids, Grant was freshly single again and looking to reconcile with Bethanne Hamlin. To forgive the betrayal was one thing, she did that for herself. To forget was something that she didn’t think she could ever do and she wasn’t sure if she could ever trust him again either. Being willing to at least think about it for the sake of the grown kids, herself, him, she wasn’t sure, but think about it she was. Hearing that her ex-mother-in-law was planning a road trip across the country to her 50th class reunion in Florida was the perfect excuse to get away and do that thinking. With the addition of her daughter Annie, Ruth and Bethanne set out to see America. Even though Ruth had made plans, the addition of Annie added spontaneity to the group, taking them off the plotted course early in the trip. Helping out in a diner for an old friend of Ruth’s was the fist of may changes to come. Then they have trouble with the rental car with only one source of help, and that coming from a group of motorcycle riders they met at the diner. Offering a ride to the nearest town was the best way for Max to help, but the connection they found while offering confessions may make some decisions more difficult.\n \n","cover":"https://allnovel.net/images/a-turn-in-the-road-blossom-street-8.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/a-turn-in-the-road-blossom-street-8.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:00:24 AM"}}
