{"id":66348,"no":23,"title":"Page 23","content":"“Did you see him again?” Annie asked. “I couldn’t help it. We were in the same history class. We talked after the lecture a couple of times and went for a Coke. He was always nice to me. I wouldn’t let him kiss me again and he respected that. I wrote Royce every single day but I never told him about Richard.” “Richard?” Bethanne repeated, stunned. That was Grant’s father. “Yes. Then one night we attended another party. He and I went together. I thought I’d be all right because I was with Richard, but someone gave me a spiked drink and we…we—” She paused and once more hid her face in her hands. “We made love in the backseat of his car and a few weeks later I realized I was pregnant.” “Oh, Ruth.” Bethanne looked away from the road long enough to reassure her mother-in-law that she was the last person who’d think badly of her. How strange that they should be having this conversation, which was probably the most serious and honest of their entire relationship, while driving down the freeway. “Richard took the news like a gentleman…. He said he loved me and would marry me. But we hardly knew each other and I hadn’t even told Royce I’d met anyone else…and then I had to tell him I was marrying another man and that I was pregnant—and all of this happened while he was still in basic training!” “Ruth, my poor Ruth…” “Oh, Grandma, how awful for you.” “I broke his heart,” Ruth said with finality. She gazed at Bethanne, her tears drying as she resumed her story. “He said if I could be unfaithful so soon after leaving home, I wasn’t the person he thought I was. He said he was happy to be rid of me.” Again Bethanne looked away from the road. “I’m sure he didn’t mean that. He was speaking from his pain.” Ruth went on as if she hadn’t heard. “Richard was a good husband. We were both determined to make the best of the marriage, and we did, but through the years…” She hesitated. “I often wondered what might’ve happened if I’d stayed home that night instead of going to the party. I wonder if Royce and I would eventually have married.” “It’s only natural to wonder,” Bethanne said. “You were pregnant with Dad when you married Grandpa?” Annie said. “Wow. I never added up the dates before.” “Annie.” “Grandma.” Annie ignored Bethanne. “I meant what I said—I bet Royce is just as anxious to see you again. You’re probably the reason he’s attending this reunion.” “I hope so, but I can’t be sure.” “You should call him and at least let him know you’ll be there.” “I can’t,” she said adamantly. “Why not?” “For one thing, I wouldn’t know what to say. Besides,” she said as though this was a more convincing excuse, “I don’t have his number.” “That’s easy.” Annie pulled out her cell phone. “Tell me his full name and I’ll get it for you.” Frowning, Ruth turned to Bethanne, her face creased with doubt and indecision. “Do you think contacting Royce before I arrive is a good idea?” “I don’t think it would hurt,” Bethanne said. “If you chatted briefly, then your mind would be at rest. You’d know what to expect.” Ruth’s shoulders sagged. “Maybe later. Okay?” “Of course it’s okay,” Bethanne assured her. “You do what you feel is best,” Annie echoed. “But I’ll look up his number for you, anyway.” “Okay,” Ruth said. “I’d like to have it…in case I do decide to call. In case I can figure out what to say,” she added under her breath. It was afternoon when they entered the national park. The sights were as spectacular as Max had promised. They walked across the Grand Canyon Skywalk and marveled at the twisting, curving Colorado River far below. Later, Ruth was in the gift shop and Annie was speaking to one of the park rangers, a young woman who didn’t look much older than her daughter, when Bethanne’s cell phone rang. Digging in her purse, she located it just before it went to voice mail. “Hello.” “Bethanne, where are you?” She groaned inwardly. “Hello, Grant.” She almost wished she hadn’t answered—or that she’d taken the time to check call display. “We’re at the Grand Canyon.” “Sounds like you got a late start.” “We did, but we drove straight here. Your mother’s eager to get to Florida.” The words were barely past her lips when Grant asked, “What’s this about you taking off with that biker?” Apparently, Annie had told Grant, which Bethanne didn’t appreciate. “Is that what Annie said?” “Well, some variation of it. I’m sure she’s exaggerating.” “I’m sure,” Bethanne echoed, unwilling to discuss Max with her ex-husband. “So what happened?” “What do you mean?” “You took off with this biker and according to our daughter you spent the night with him.” “What?” Bethanne nearly exploded with outrage—and then laughter. “You’ve got to be joking!” “Okay, well, I hear you were gone until three.” Bethanne neither confirmed nor denied the report. Let Grant think whatever he wanted. She didn’t owe him an explanation or an excuse. “Did you have a good time?” “The best.” And she meant it. The night with Max was one she would long cherish. He made her feel more alive, more feminine, and he’d brought back the thrill of newly discovered passion. Yet he hadn’t done anything other than kiss her and hold her. The desire was there; the need had felt urgent. “You sound like you’re falling for this guy.” “Do I?” She turned the question around, wanting him to form his own opinion. “Yes.” The amusement was gone from his voice. “We’ve already had one rather unpleasant discussion about this man. I’d hate to have a repeat of that.” “So would I.” She had no intention of defending herself to Grant. “Do you plan on seeing him again?” She didn’t answer. “Bethanne?” “I don’t believe that’s any of your business,” she said. “I don’t mean to be rude, Grant, but my relationship with Max has nothing to do with you.” His silence spoke volumes. “True, but you have to know I’m working as hard as I can to rebuild our relationship. It doesn’t help that every time I turn around, I hear about you and this biker.” “His name is Max.” “I don’t care what his name is.” Bethanne sighed, unwilling to get into an argument with her ex-husband over a man she’d dated once. Arguing put her on the defensive and she wasn’t going to allow that. She heard Grant exhale as though struggling with himself. “I imagine women are easily enthralled with that kind of guy.” “You mean the way middle-age men fall for younger women?” That small dig apparently went right over Grant’s head. “True enough,” he agreed, and his voice was back to that cajoling tone she knew so well. “On a completely different subject, how’s my mother holding up?” Bethanne was grateful to talk about something other than Max. “She’s doing great.” “And you?” “Annie and I are fine.” “Good. Listen, I have some news I thought I’d pass along.” “What is it?” “I found out there’s a real estate conference in Orlando the same week as Mom’s class reunion.” “Oh.” She already knew what Grant was going to say. “You’ve decided to go.” “What could be more perfect?” Grant asked. Indeed, Bethanne mused. What could be more perfect? Fifteen They spent the night in Flagstaff, Arizona, and were up early Monday morning, waking to sunshine. By seven, Annie had dragged the suitcases out to the car, while Bethanne dealt with the hotel. “I’ll drive so you can knit,” Ruth volunteered. Bethanne let her take the wheel, sitting beside her, while Annie climbed into the backseat. A little more than two hours later, they were in Albuquerque, New Mexico. They stopped for breakfast at a restaurant just off Interstate 40. They were seated in a booth and reading over the menus when Annie said, “Dad told me he called while we were at the Grand Canyon.” The comment was directed at Bethanne. “He did,” she confirmed without adding any details. Annie set her menu aside. “Did he say anything about the Realtors’ convention?” In response, Bethanne looked at Ruth. “Grant will be in Orlando next weekend, the same time as your reunion.” “How far is Vero Beach from Orlando?” Annie asked. Bethanne referred the question to her mother-in-law, who was far more familiar with Florida than she was. Ruth glanced over her menu. “About two hours, I think—but it’s been a long time since I made the drive.” “So Dad will be only two hours away,” Annie said, sounding downright gleeful. “Do you think he’ll come to Vero Beach?” Ruth asked hopefully. “I’m sure he will.” Bethanne kept her feelings well under control. Actually, she’d be happy to see Grant. Maybe she could finally come to some conclusion, some decision; maybe she could finally say yes to a reconciliation. She’d been giving their situation a great deal of thought. Grant had been persistent, determined to regain her love and trust. The problem—and this had only recently become a problem—was the way Bethanne felt about Max. Every time she considered what her life would be like if she and Grant were to reunite, Max was there, competing with those visions, those possibilities. Max of the rare smiles, grinning at her. Memories of riding on his Harley, her arms hugging his waist. Memories of dancing and kissing. With Grant it was expensive champagne, classical music, two children and a twenty-year history. With Max it was cold beer, loud country music and one night in Vegas. No, it was time to put him out of her mind. He was little more than a drifter running from life. Deep down she suspected that her fascination with him was prompted by her fear of facing the issues she needed to confront regarding her ex-husband. She’d forgiven Grant—hadn’t she? Forgiveness, as she’d discovered, could be deceptive. She didn’t know if it was possible to trust him again. Grant was sorry. He’d admitted he’d been wrong and accepted full responsibility for the pain he’d inflicted on her and their children. Ruth had a point; that couldn’t have been easy, especially for a proud man like Grant. If only she could forgive wholeheartedly and forget the past… And then there was Max. Gentle, loving Max, devoted to his wife. He’d never cheated on Kate. He loved beyond the grave. Instinctively, she knew she could trust him.","sourceLink":"https://allnovel.net/a-turn-in-the-road-blossom-street-8/page-23.html","bookId":1940,"book":{"id":1940,"title":"A Turn in the Road (Blossom Street #8)","description":"Storyline: A Turn in the Road (Blossom Street #8) Six years after he had walked out on his wife and kids, Grant was freshly single again and looking to reconcile with Bethanne Hamlin. To forgive the betrayal was one thing, she did that for herself. To forget was something that she didn’t think she could ever do and she wasn’t sure if she could ever trust him again either. Being willing to at least think about it for the sake of the grown kids, herself, him, she wasn’t sure, but think about it she was. Hearing that her ex-mother-in-law was planning a road trip across the country to her 50th class reunion in Florida was the perfect excuse to get away and do that thinking. With the addition of her daughter Annie, Ruth and Bethanne set out to see America. Even though Ruth had made plans, the addition of Annie added spontaneity to the group, taking them off the plotted course early in the trip. Helping out in a diner for an old friend of Ruth’s was the fist of may changes to come. Then they have trouble with the rental car with only one source of help, and that coming from a group of motorcycle riders they met at the diner. Offering a ride to the nearest town was the best way for Max to help, but the connection they found while offering confessions may make some decisions more difficult.","cover":"https://allnovel.net/images/a-turn-in-the-road-blossom-street-8.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/a-turn-in-the-road-blossom-street-8.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:00:24 AM"}}
