{"id":66362,"no":37,"title":"Page 37","content":"“Was that Max?” Annie asked. Bethanne nodded. “Dad called,” Annie continued. “His flight landed on time and he’s on his way to Vero.” “Okay.” “Grandma suggested he join us for dinner,” Annie said, leaning against the glass door. Bethanne’s voice was cool. “What about the conference? Won’t he be missing that?” Annie shrugged. “You’ll have to ask him.” For a moment, Bethanne wondered if there even was a conference. It had certainly come up very conveniently. “Aren’t you going to get ready for dinner?” Annie prompted. Reluctantly, Bethanne stood up and prepared to go back inside the room. “Mom,” Annie murmured, putting a hand on her arm. “Grandma’s pretty nervous about seeing Royce. You might want to help her.” “How am I supposed to do that?” Bethanne searched Annie’s face. “I don’t know. You always managed with me.” Annie smiled. “But…Ruth isn’t my daughter.” “Pretend she is.” Annie glanced over her shoulder. “Someone’s got to do something. She’s pacing back and forth, and I’m afraid if she sprays on any more cologne she might set off the fire alarm.” Sure enough, Bethanne found her pacing the length of the room, pausing only to gnaw on her cuticles. “Give me fifteen minutes,” she told Ruth. “Fifteen minutes for what?” “To take a quick shower and change clothes.” “Then what?” “Then I’m taking you to the bar.” “I can’t let Royce find me in the bar!” she cried. “Yes, you can.” Bethanne adopted her firmest parental tone. “Now, don’t argue with me.” Ruth stared at her like a forest animal caught in the headlights of an oncoming car. Shortly thereafter, Bethanne escorted her to the lounge, which was a cozy, unpretentious place, with an old-fashioned wooden U-shaped bar and a few mismatched tables and chairs. A cheerful bartender took their drink order. Bethanne asked for two glasses of white wine, which were brought to the table a few minutes later. Ruth took one sip and nearly coughed her lungs out. “Are you okay?” Bethanne pounded her on the back. Ruth shook her head vigorously. “What’s wrong?” Bethanne asked, startled. “Royce just came in,” she whispered, while she dug in her purse for a tissue to wipe her eyes. “Where?” Bethanne scanned the dimly lit room. Ruth nodded toward the tall, silver-haired man who’d just slipped onto a bar stool with his back to them. “Are you all right?” Bethanne whispered. Ruth seemed paralyzed with fright. “I don’t know if I can face him.” Bethanne was surprised to see Ruth’s hands trembling. “I hurt him so much…” she began in a broken voice that Bethanne had never heard before. “Ruth, you were young…. I’m sure he’s gotten over it—” Ruth cut her off with a sharp shake of her head. “He might have, but I’m not sure I ever can.” She sat for several minutes, clutching the now-tattered wisp of tissue. Then, as Bethanne watched, she slid out of her chair and squared her shoulders. Bethanne gave her a smile of encouragement. Ruth walked up behind Royce and placed her hand on his shoulder. Royce whirled around. His face registered shock. For a long moment all they did was stare at each other. “Ruth… Ruth, is that really you?” “Have I changed so much?” she asked, taking a step back, as if dreading the answer. She pressed her fingers to her lips, seemingly on the verge of tears. “No, no…” He blinked, apparently to clear his vision. “You’re even more beautiful now. More beautiful than I remembered.” “Royce…” she said, then faltered. They embraced wordlessly, then he took Ruth’s face in his hands as he gazed down at her. Just then, Annie entered the bar, having updated her Facebook page with photos from the road. Taking in the reunion between Ruth and Royce, she broke into a huge smile and gave Bethanne a thumbs-up. Royce’s grandson, Craig, was the next to arrive; shortly after he joined the party and introductions were made, Bethanne noticed that he and Annie fell into animated conversation. Royce and Ruth hardly looked up, drowning in each other’s eyes. Leaning back in her seat, Bethanne savored her wine and surveyed the scene. In a few days’ time they’d fly home to Seattle and Bethanne would return to her regular life, but she wouldn’t be the same woman. The trip had changed her. It had changed them all. The three of them had grown close, sharing their secrets, confronting their fears. And despite some moments of tension, they’d come to understand and support one another in new ways. She was so immersed in her thoughts that she almost missed Grant’s entrance. He walked into the bar and glanced around, brightening when he saw her. To her surprise, Bethanne felt a surge of affection. Tall and lean, Grant still cut a striking figure, and his energy was palpable. They’d been a good match—partly because Bethanne had always been content to remain in the background, his silent partner in more ways than one. His smile was electric, transforming his entire face. As he started toward her, she was reminded of his ability to make people feel they were the sole focus of his attention. Over the years, she’d heard many of his colleagues talk about his charisma and its effect on clients. He obviously still had it. Ruth spotted her son before he reached Bethanne and pulled him over to make introductions. Grant caught her eye and winked, but when the three couples sat down together, he was trapped on the other side of the table. After sharing a bottle of wine, they all left for dinner at the restaurant beside the hotel. The Ocean Grill boasted an interesting assortment of wrought iron, stained glass and other collectibles. While they were being seated at their table next to the window, Grant wangled a seat next to Bethanne. Outside, the surf roared against the sand and groups of tourists walked the beach, waves crashing at their feet. Bethanne felt Grant’s hand touch hers beneath the table. “I’ve missed you,” he murmured. She gave him a fleeting smile but kept her eyes on the menu. The truth was, he’d been in her thoughts more than she wanted to admit. Despite her reservations, his familiar presence brought back the glow of happier times. Grant slipped comfortably into his role as father and son—something that Max, for all his intensity, could never do. She studied him as he chatted effortlessly with Royce and Ruth, full of high spirits and completely at ease. Grant was family, and that was difficult to ignore or dismiss. The wine flowed as the evening progressed, and Bethanne relaxed. At Royce’s urging, she ordered the pompano with apricot sauce and found it outstanding. As was typical, Grant and Annie both ordered the same entrée—the stone crab claws—which they ate with gusto. After dinner Annie and Craig went for a walk along the beach. Royce and Ruth did, too, leaving Grant and Bethanne alone at the table. Bethanne stirred her coffee, suddenly self-conscious. “I brought you something,” Grant said. “From Seattle?” “Not exactly.” He reached inside his dinner jacket and took out a small wrapped package. “You don’t need to buy me gifts,” she protested, although she couldn’t suppress her curiosity. Grant had always been a generous and original gift-giver; it was one of his talents. He never once forgot an anniversary or her birthday, and outdid himself from year to year in the extravagance and thoughtfulness of his presents. “I wanted you to have this,” he said as she untied the bow and removed the paper. The instant she saw the box, Bethanne knew. Nestled inside was the button she’d seen in the antique store in New Orleans. Annie had obviously mentioned it to him; he must have ordered it that same night. “Do you like it?” “Very much,” she breathed, recalling the story about the soldiers and their sweethearts. “Every time you look at that button,” he said, his head close to hers, “I want you to think of me.” Twenty-Five That evening with Royce, Ruth felt as if the years had evaporated, and they were eighteen again. They talked nonstop without a trace of awkwardness, until Ruth realized it was midnight—and they were alone. Bethanne and Annie had turned in for the night. Craig must have gone home. Apparently, Grant had driven back to Orlando, although she didn’t remember him leaving. All Ruth could see, the whole night long, was Royce. All she’d heard was what he said. Everything else was a blur. Before he left her at the door of her room, Royce had asked if he could pick her up the next morning and take her to his home on the Indian River. Ruth had agreed. Not once had he mentioned the circumstances of their parting fifty years ago, but she felt its shadow, even in their happiest recollections. Ruth wished they could leave the past buried, but she knew that unless they confronted it now, it could destroy any hope of a future. All that shame and pain… Unable to sleep with such thoughts chasing through her head, Ruth rose before Bethanne and Annie and dressed, taking special care with her hair and makeup. The humidity in Florida during summer was unrelenting. She didn’t expect her hair to stay in place, but felt she had to make the effort. For Royce. “Grandma, what are you doing up so early?” Annie asked groggily as Ruth came out of the bathroom. “It’s almost eight.” “That’s early for you,” Annie observed. Generally, Ruth was the one who lingered in bed. “Have you done your exercises?” “I did.” Ruth smoothed a stray curl into place. “I’m seeing Royce this morning.” “That explains it,” Bethanne murmured from the other side of the bed, next to Annie. “Did you enjoy meeting Craig?” Ruth asked her granddaughter. While her attention had been focused mostly on Royce, she did notice the two young people talking, their heads close together. “He’s really nice.” Annie’s face shone with what looked like genuine enthusiasm. “Are you seeing him again?” Ruth asked. “He’s taking me out on the river—he promised we’ll see manatees and dolphins.” Annie stretched contentedly. “You never told me Florida was so beautiful, Grandma.” “It has its own unique beauty, just like the Pacific Northwest.” “Do you know when you’ll be back?” Bethanne pushed herself into a sitting position, running a hand through her tousled hair. “No…I’ll give you a call later. If Annie’s with Craig, what are you going to do all day?” She hated the thought of Bethanne stuck in the hotel room or out on her own, and hoped Grant wouldn’t be tied up in those boring Realtor meetings. “Grant’s stopping by,” Bethanne assured her. “He’s got a session this morning, but he should be finished by lunchtime. We’re going to meet up around one o’clock.”","sourceLink":"https://allnovel.net/a-turn-in-the-road-blossom-street-8/page-37.html","bookId":1940,"book":{"id":1940,"title":"A Turn in the Road (Blossom Street #8)","description":"Storyline: A Turn in the Road (Blossom Street #8) Six years after he had walked out on his wife and kids, Grant was freshly single again and looking to reconcile with Bethanne Hamlin. To forgive the betrayal was one thing, she did that for herself. To forget was something that she didn’t think she could ever do and she wasn’t sure if she could ever trust him again either. Being willing to at least think about it for the sake of the grown kids, herself, him, she wasn’t sure, but think about it she was. Hearing that her ex-mother-in-law was planning a road trip across the country to her 50th class reunion in Florida was the perfect excuse to get away and do that thinking. With the addition of her daughter Annie, Ruth and Bethanne set out to see America. Even though Ruth had made plans, the addition of Annie added spontaneity to the group, taking them off the plotted course early in the trip. Helping out in a diner for an old friend of Ruth’s was the fist of may changes to come. Then they have trouble with the rental car with only one source of help, and that coming from a group of motorcycle riders they met at the diner. Offering a ride to the nearest town was the best way for Max to help, but the connection they found while offering confessions may make some decisions more difficult.","cover":"https://allnovel.net/images/a-turn-in-the-road-blossom-street-8.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/a-turn-in-the-road-blossom-street-8.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:00:24 AM"}}
