{"id":84224,"no":55,"title":"Page 55","content":"“You should have told me when we first met you were system-produced.”\\n\\n She squishes her lips together. “I was once pissed-off-seventeen. You weren’t ready to listen.”\\n\\n True.\\n\\n “Congrats, by the way. Heard you aced the exam.”\\n\\n “Thanks.” I passed my ASE...again. My internship and job secured. I nudge the ice cream away and relax back in my seat. Lately, I feel like I’ve been drifting. I’m back in foster care at Shirley and Dale’s. Noah lives in the dorms. We still talk, but not nearly as often. There are times I feel...alone.\\n\\n “I know people who have families,” I say. “They graduate from high school and they get a job or go to college and if they fuck it all up they go back home.” I pause, tapping my finger on the table. “What do I do if...” I fuck it all up. I clear my throat and my eyebrows move closer together. “Where do I go?”\\n\\n Courtney shoves her ice cream away, too. “Foster care sucks, but so does aging out. It’s weird. You spend the entire first part of your life fighting to get out and then one day...you are out. Then you want to scream at the closed door that you’re still a kid, but everyone is pretty damned insistent you’re an adult. I cried a lot when I first aged out.”\\n\\n My lips quirk. “I don’t think I’ll be crying.”\\n\\n Courtney snorts. “Or whatever boys do.”\\n\\n I swallow and find the courage to say the words. “I don’t want to be homeless.”\\n\\n “You won’t be.” She waggles her eyebrows and pulls a folder out of her bag. “I have a plan. You don’t turn eighteen until this summer, so we have a couple more months before you age out. I can teach you how to budget and help you find a place to live and all sorts of fun adult things. And here’s the cool part. I’ll still be around when you turn eighteen. I may not be mandatory, but I don’t disappear.”\\n\\n The alarm on my phone rings, and Courtney smiles, knowing why I’m ready to bolt. “We’ll start this next week.”\\n\\n I stand. “Thanks. For everything.”\\n\\n “No problem. And next week we’re getting hot fudge.”\\n\\n Chapter 77\\n\\n Rachel\\n\\n I DREAM A LOT. FOR the past three months, I’ve been sleeping more than I’m awake. Between surgeries, hospital stays, pain meds and rehab, I always seem tired.\\n\\n I see Isaiah in my dreams. Giving that rare smile. Laughing that deep chuckle. Every now and then, I dream of his kiss. Those are my favorites.\\n\\n Someone whispers and I open my eyes. The specialist appointment wore me out physically. My therapy appointment with my counselor knocked me out mentally. I stretch my arms on the bed and hear crinkling to the side. I turn my head and see a Mustang magazine with a note:\\n\\n Tell me which one you want. I love you—Dad.\\n\\n My fingers brush the note before I toss the magazine onto my bedside table. I don’t want to think about cars, not yet.\\n\\n “Told you she wasn’t ready,” whispers a deep voice from across the room.\\n\\n Propping up on my elbows, I lift my upper body. West and Ethan sit on the floor, both with controllers in their hands. Their eyes locked on the video game they play with no sound on my flat screen. The two of them practically moved in here when I came home from the hospital. Most of the time, I don’t mind the company.\\n\\n Ethan glances over his shoulder at me. “Finally.” He tosses the controller on the floor, and West follows his lead.\\n\\n “Field trip, baby sis,” says West. He flips his hat so that it’s backward.\\n\\n I flop back on the bed. “I’ve got rehab in two hours.”\\n\\n “That’s why we’re going now,” Ethan says. “You’ll be too tired later. How do you want to do this?”\\n\\n It’s a question I’m used to, and one they’ve learned to ask. It’s been weird between my family and me. My entire life I never wanted to be the family weakling, and now there’s absolutely no doubt that I’m the physically weakest one under the roof. The casts are off, but both of my legs are in a full brace.\\n\\n While it’s apparent to anyone that I can’t run as far as my brothers or dance like my mom, what can’t be seen by the naked eye is the real miracle. It was hard to ask for help at first. I made everything a million times harder by my need to do it all myself, and it was a zillion times harder for my family not to do things for me. But I learned to ask. And they learned not to jump in. And so my weakness has made me stronger.\\n\\n “Let me swing my legs off the bed.”\\n\\n My brothers both take two steps back and watch as I use my upper-body strength to readjust myself so that my legs are near the edge. My face goes red and my teeth clench, but inch by fought-after inch, both of my legs hover over the side.\\n\\n I release enough air to move the hair hanging in my face. The small smile tugs at my lips. I did it. “Your turn.”\\n\\n “Grab her wheelchair,” says Ethan as he slips his arms around me and lifts me into the air. West goes out the door of my bedroom first, and Ethan follows. The workmen in what used to be Colleen’s room stare at me, then at my legs, before returning to installing the custom-made shelves and desk. Mom is being paid to fundraise now and announced she deserved an office.\\n\\n At the bottom of the stairs, West sets up my chair, and Ethan settles me in the seat. They gesture for me to follow and I do. Down the hall, through the kitchen, down the ramp, and I pause when they head to the unconnected garage. “I don’t have time to go anyplace.”\\n\\n West walks backward. “Come on, slowpoke. You got wheels, use them.”\\n\\n “You’re such an ass.”\\n\\n West smacks Ethan’s arm. “She called me an ass.”\\n\\n “You are an ass.” Ethan opens the garage door.\\n\\n “Yeah, but she called me an ass.”\\n\\n I blink when I roll into the garage. There’s a contraption with a plank of wood covered by a cushion. “What is that?”\\n\\n “It’s for you.” West stands next to it and shoves his hands into his pockets with straight arms. “It’ll help you navigate the car.”\\n\\n I raise a questioning eyebrow, and West holds out his arms. “Can I?”\\n\\n I nod, and West lifts me from the chair and places me on the cushion. He motions to two cranks and begins to turn one. “This one moves you up.”\\n\\n Surprised by the momentum into the air, I flinch and grab the sides. He continues to turn the crank until I’m level with the open hood of his SUV. “And this one will bring you closer.”\\n\\n The plank extends forward and for the first time in three months, I can touch the inside of a car. As if it’s a dream, I sweep my fingers across the engine. Even from this position, I won’t be able to do much, but it’s better than doing nothing.\\n\\n Feeling a little speechless, I pop open my mouth and say the mundane. “Thanks.”\\n\\n “West built it for you,” says Ethan.\\n\\n West sheepishly raises a shoulder. “Ethan helped. Besides, who else is going to change my oil?”\\n\\n A wetness invades my eyes. I’m touched that they would invest time and energy into something for me...not just anything...they created something to help me return to what I love.\\n\\n “Dad wants to get you a new car,” says Ethan.\\n\\n “I know.” But that part is more complicated. I won’t lie. It hurts that I won’t be able to drive—for a very long time.\\n\\n “All right,” says West. “Wasn’t joking on the oil change. Tell me what to do and me and Moron will do it.”\\n\\n An adrenaline rush tickles my bloodstream. “Get me that rolling board and help me down. I’m going under the car.”\\n\\n Gloriously covered in grease and oil, I sit on the top of West’s contraption and hover over West as he tries to figure out the oil filter. “This isn’t rocket science.”\\n\\n “Says the car genius,” he mumbles.\\n\\n A clearing of a throat grabs our attention and we all pause when we see Mom in the garage door frame.\\n\\n West and Ethan share a guilty glance. “Mom,” Ethan says. “We were just about to bring her back to the house.”\\n\\n “Will you boys give Rachel and me a second?”\\n\\n West wiggles his grimy hands in front of my face and wipes one particularly greasy finger across my cheek. Ethan squeezes my wrist before he leaves. I readjust myself and lean over to inspect West’s work. Not too bad.\\n\\n “What are you working on?” Mom asks.\\n\\n I shrug. “Nothing.”\\n\\n Mom’s dressed in a pair of gray dress pants and a blue sweater. Dad took me to my appointments this morning while Mom visited Gavin in rehab. Because of the accident, my father’s original plan for Gavin and rehab tanked. But a few weeks ago, Gavin finally entered treatment. “How’s Gavin?”\\n\\n “Good. He’s worried about you.” Mom peers into the hood. “Your father said your appointments went well.”\\n\\n “Yup.” It feels odd being here with Mom after lying about my love of cars for so long.\\n\\n Mom looks at me. She does this now—actually stares at me with her blue eyes and sees me. Not being used to it, I always glance away. Mom tucks a wayward strand of hair over my shoulder. “Gavin and I had a group-therapy appointment today. He promised to not keep secrets like his addiction from me anymore. I thought about it on the way home. I think I want a promise like that from all of you. Secrets have come too close to ruining this family.”\\n\\n I pick at my flaking thumbnail. “I’m sorry I didn’t tell you about Gavin.”\\n\\n Mom shifts her weight. “I care that you didn’t tell me about you.”\\n\\n Confrontation has never been a strong suit for either of us, and I wonder if the silence is killing her like it’s killing me. “You didn’t want to hear it. You wanted me to be Colleen.”\\n\\n “Rachel—”\\n\\n Preferring not to hear her deny it, I stare straight into her eyes. “I spent a good portion of my life overhearing you tell people that you dreamed of me becoming like Colleen. It’s true, so please don’t pretend it isn’t.”\\n\\n Mom touches her wedding ring and turns the band. “I wish I could tell you that you weren’t the replacement, but we’d both know that would be a lie. Regardless of what you think, I have always loved you.”\\n\\n I fidget with the tools my brothers left on the board. Over the past three months, Mom and I have danced around this issue. “You loved her more.”\\n\\n “Not true,” says Mom. “But I do miss her. Too much. I’ve thought about it and think there’s some truth to what you said that night. I loved you, but I don’t think I ever saw you. For that I’m sorry.”\\n\\n “It’s okay.” And it is.\\n\\n “In my defense, you never gave me the chance to know you.”\\n\\n I open my mouth to protest, and she waves it away. “Rachel, the problem in this family is that no one gave me credit. Instead of changing to make me happy, do you ever wonder what would have happened if you had told me what I was missing?”\\n\\n And I snap my mouth shut. Part of me thinks I could have screamed until I was blue in the face, but there’s another part that wonders what would have happened if I had truly tried. \\n\\n","sourceLink":"https://allnovel.net/crash-into-you-pushing-the-limits-3/page-55.html","bookId":2754,"book":{"id":2754,"title":"Crash into You (Pushing the Limits #3)","description":"Storyline: Crash into You (Pushing the Limits #3) \\n The girl with straight As, designer clothes and the perfect life—that\u0027s who people expect Rachel Young to be. So the private-school junior keeps secrets from her wealthy parents and overbearing brothers...and she\u0027s just added two more to the list. One involves racing strangers down dark country roads in her Mustang GT. The other? Seventeen-year-old Isaiah Walker-a guy she has no business even talking to. But when the foster kid with the tattoos and intense gray eyes comes to her rescue, she can\u0027t get him out of her mind. \\n Isaiah has secrets, too. About where he lives, and how he really feels about Rachel. The last thing he needs is to get tangled up with a rich girl who wants to slum it on the south side for kicks-no matter how angelic she might look. \\n But when their shared love of street racing puts both their lives in jeopardy, they have six weeks to come up with a way out. Six weeks to discover just how far they\u0027ll go to save each other.\\n","cover":"https://allnovel.net/images/crash-into-you-pushing-the-limits-3.jpg","author":"Katie McGarry","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/crash-into-you-pushing-the-limits-3.html","creation":"Oct 5, 2019 8:59:21 AM","modification":"Oct 5, 2019 4:56:15 PM"}}
