{"id":27115,"no":10,"title":"CHAPTER II","content":"They were now upon the loneliest piece of the whole island. Far and near not a human creature or sign of humanity, save themselves, was to be seen. The few villages of Inishmaan were upon the other side, the few spots of verdure which might here and there have been discerned by long search were all but completely lost in the prevailing stoniness, and to eyes less accustomed than theirs nothing could have been more deplorable than the waste of desolation spread out here step above step, stony level above stony level, till it ended, appropriately enough, in the huge ruinous fort of Dun Connor, grey even amongst that{125} greyness, grim even by comparison with what surrounded it, and upon which it looked austerely down. \\n\\n \\n\\n It was one of those days, too, when the islands, susceptible enough at times of beauty, stand out nakedly, almost revoltingly, ugly. The low sky; the slate-coloured waste of water; the black hanks of driftweed flung hither and thither upon the rocks; the rocks themselves, shapeless, colourless, half-dissolved by the rains that eternally beat on them; the white pools staring upwards like so many dead eyes; the melancholy, roofless church; the great, grey fort overhead, sloughing away atom by atom like some decaying madrepore; the few pitiful attempts at cultivation—the whole thing, above, below, everywhere, seeming to press upon the senses with an impression of ugliness, an ugliness enough to sicken not the eyes or the heart alone, but the very stomach.{126} \\n\\n \\n\\n As Grania and Murdough pursued their way side by side over the rocks little Phelim gradually lagged behind, and at last drifted away altogether, stopping dreamily first at one patch of sand, then at another, and becoming more and more merged in the general hue of the rocks, till he finally disappeared from sight in the direction of his mother’s cabin. \\n\\n \\n\\n The other two kept on upon the same level till they had got back to Grania’s potato-patch. Here she picked up her spade, and at once resumed her work of clearing out stone-encumbered ridges, Murdough Blake perching himself meanwhile comfortably upon a boulder, where he sat swinging his pampootie-shod feet over the edge and complacently surveying her labours. \\n\\n \\n\\n The girl drove her spade vehemently into the ground with a sort of fierce impatience, due partly to a sense of having{127} wasted time, but more to a vague feeling of irritation and disappointment which, like the former feeling, had a fashion of recurring whenever these two had been some time together. The sods sprang from before her spade; the light sandy soil flew wildly hither and thither; some of the dust of it even reached Murdough as he lounged upon his boulder: but he only sat still and watched her complacently, utterly unaware that he had anything himself to say to this really unnecessary display of energy. \\n\\n \\n\\n The theory that love would be less felt if it was less talked about certainly finds some justification in Ireland, and amongst such well-developed specimens of youthful manhood as Murdough Blake. It is seldom talked of there, and apparently in consequence seldom felt. Marriages being largely matters of barter, irregular connections all but unknown, it follows that the topic loses{128} that predominance which it possesses in nearly every other community in the world. Politics, sport, religion, a dozen others push it from the field. Physiologically—you would have said to look at him—he was of the very material out of which an emotional animal is made, and yet—explain the matter how you like—he was not in the least an emotional animal, or rather his emotional activity was used up in quite other directions than the particular form called love-making. Of his conversational entertainment, for instance, to do him justice, he was rarely lacking. \\n\\n \\n\\n ‘Begorrah, tis the wonderful girl you are for the work, Grania O’Malley!’ he observed, when the silence between them had lasted about three minutes. ‘Is it never tired you do be getting of it; never at all, summer or winter, say, Grania?’ \\n\\n \\n\\n She shook her head. ‘And what else{129} would I be doing upon Inishmaan if I did get tired of it itself, Murdough Blake?’ she asked pertinently. \\n\\n \\n\\n There being no very easy answer to this question, Murdough was silent again for another minute and a half. \\n\\n \\n\\n ‘It is myself that gets tired of it then, so it is,’ he replied candidly. ‘I would give a great deal if I had it, I would, Grania O’Malley, to be out of Inishmaan, so I would, God knows!’ he continued, looking away towards the line of coast, low to the south, but rising towards the north in a succession of pallid peaks, peering one behind the other till they melted into the distance. ‘It is a very poor place, Inishmaan, for a young man and a man of spirit to be living in, always, week-days and Sundays, fine days, rain days, always the same. How is he to show what is in him, at all, at all, and he always in the same place? It{130} is, yes, my faith and word, very hard on him. He might as well be one of these prickly things down there that do take a year to crawl from one stone to another, so he might, every bit as well, my faith and word!’ \\n\\n \\n\\n ‘You do go to Galway most weeks in Peter O’Donovan’s turf boat,’ the girl rejoined, stooping to pick up a stone and tossing it impatiently away from the drill. \\n\\n \\n\\n ‘And if I do, Grania O’Malley, what then? It is not a very great affair Peter O’Donovan’s turf boat. And it is not much time either—not more than three or four hours at the most—that I get in the town, for there is the fastening of the boat to be done, and helping to get the turf on board, and many another thing too. And Peter O’Donovan he is a very hard man, so he is; yes, indeed, God knows, very. And when I am in the town itself, and walking about in the streets of it, why, you see, Grania{131} deelish, I’ve got so little of the English—— Bad luck to my father and to my mother too for not sending me to be learnt it when I was a bouchaleen! A man feels a born gomoral, so he does, just a gomoral, no better—when he hasn’t got the good English. And there are a great many of the quality too in the town of Galway, and it is not one word of the Irish that they will speak—no, nor understand it either—so they will not, Grania, not one word.’ \\n\\n \\n\\n ‘I’ve got no English either, and I don’t want any of it,’ she answered proudly; ‘I had sooner have only the Irish.’ \\n\\n \\n\\n ‘Arrah, Grania, but you are an ignorant colleen to go say such a thing! ’Tis yourself that knows nothing about it, or you would not talk so. Language is grand, grand! I wish that I knew all the languages that ever were upon this earth since the days of King Noah, who made the Flood. Yes, I do, and more too, than ever there were on it! Then{132} I could talk to all the people, and hold up my head high with the best in the land. My word, yes, if I knew all the languages that ever were, I promise you I could speak fine—my word, yes!’ \\n\\n \\n\\n It was quite a new idea to Grania that there were more languages in the world than English and Irish, and she meditated silently upon the information for several minutes. \\n\\n \\n\\n ‘There’s what Father Tom speaks in the chapel, when he comes over from Aranmore to say Mass,’ she observed reflectively. “Ave Maria” and “Pater Noster.” Honor learned me that, and it is not the Irish, I know, and it would not be the English, I suppose, either?’ \\n\\n \\n\\n The remark was put in the form of an interrogation, but Murdough’s thoughts had travelled elsewhere. \\n\\n \\n\\n ‘Young Mr. Mullarky of Ballyhure was in Galway last day I was there, so he was.{133} Och! but it is the quality that have the grand times, Grania O’Malley, and it is myself would have had the grand times too if I had been born one of them, that I would, the grandest times of them all. He was riding upon a big black horse, the blackest horse ever you saw in your life. Och! but the noise it made as it came down the street, scattering the people and clattering upon the stones. Wurrah! wurrah! but it did make the noise, I tell you, Grania, and the people all turning round to look at him, and he pretending not to see one of them. My God! but a horse is a wonderful beast! I would sooner have a horse of my own, of my very own, that I could ride all over the world upon the back of, than I would have a ship or anything! Yes, I would, my faith and word, yes.’ \\n\\n \\n\\n ‘A ship would take you a deal further,’ Grania replied scornfully. ‘When my father{134} had the hooker he would put up the sails of her here in Inishmaan, and it would not be four hours—no, nor nearly four hours—before we would be sailing into the harbour at Ballyvaughan, and what horse in the world would do that for you?’ \\n\\n \\n\\n ‘A horse wouldn’t take you over the sea, of course, but a horse could take you anywhere you wanted on the dry land—anywhere over the whole earth, just for the trouble of skelping it. Arrah my word! just think how you’d feel sitting on the back of it, and it galloping along the road, and everyone turning round to look at you. That’s how the quality feel, and that’s how I’d feel if I had been born one of them, as I might have been and as I ought to have been; for why not? Why should they have everything and we nothing? Is that fair? God who is up there in heaven, He knows right well that it is not fair, so it is not. There was a{135} man last year at the Galway horse fair, and he had a little horse, a yellow-coloured one it was, Grania O’Malley, only the mane and tail of it were black, and I went up to him as bold as bold, and says I—“Cay vadh é luach an coppul shin?”[5] For I wanted to know the cost of it. “Coog poonthe daig,[6] and that’s more than you’ve got about you this minute, I’m thinking, my poor gosthoon,” said he, with a laugh. “Gorra, that’s true,” thought I to myself, and I went away very troubled like, for my heart seemed tied with strings to that little yellow horse. And I watched it all day from a distance, and everyone that went up to look at it; ’twas just like something of my own that I was afraid of having stolen, just the very same, and I could have leaped out and knocked them down, I was so mad to think{136} that another would have it and I not. And about four o’clock in the afternoon there came a young fellow from Gort—a little dotteen he was, not up to my shoulder—and he too asked the price of it, only it was in the English he asked it, and the man told him seventeen pounds, for I understood that much. “Can it leap?” says the young fellow. “Is it leap?” says the other. “Yarra, it would leap the moon as ready as look at it, so it would, and higher too if you could find it anything to stand on!” says he, joking like. “Auch, don’t be trying to put your comethers upon me,” says the young fellow who was wanting to buy it. “Do you think it was yesterday I was born?” says he. \\n\\n \\n\\n ‘Well, with that they went away to a place about a quarter of a mile from there, and I crept after them, hiding behind the walls, and every now and then I would peep{137} over the top of a wall, and the heart inside me it would go hop, hopping, up and down, till I thought it would burst. And every time that little yellow horse lifted its legs or twitched its ear I’d leap as if I was doing it myself. And when the man that was selling it gave it now and then a skelp with a bit of a kippeen that he held in his hand I felt like murdering him—“How dare you be touching another gentleman’s horse, you spalpeen?” I’d cry out, only it was in the inside of me, you understand, under my breath, I’d say it, for there were the two of them, and the one that was wanting to sell the horse was a big fellow, twice as big as myself and bigger, with a great brown beard on the chin of him. And ever since that day I’ve been thinking and thinking of all I’d do if I had a horse, a real live horse of my own. And at night I do be dreaming that I’m galloping down the hill{138} over beyond Gort-na-Copple, and the four legs of the horse under me going so fast that you would hardly tell one of them from the other, and the children running out on to the road, and their mothers screeching and bawling to them at the tops of their voices to come out of that, or maybe the gentleman would kill them. Oh! but it is a grand beast, I tell you, Grania O’Malley, a horse is! There is no other beast in the whole world so grand as a horse—not one anywhere—no, not anywhere at all.’ \\n\\n \\n\\n Grania listened to all this in perfect silence. These aspirations of Murdough found her very much colder than his more juvenile ones used to find her. They did not stimulate her imagination, somehow now, on the contrary they merely made her feel vaguely uncomfortable and cross. All this talk about money and fine horses, and the quality, and what he would have done if he{139} himself had been one of the quality was a mere fairy tale, and moreover a very tiresome fairy tale to her. There was nothing about it that she could attach any idea to; nothing which seemed to have any connection with themselves, or their own life present or future. She went on steadily cleaning out her drills, scraping the small stones in front of her and laying them in heaps at the side. Murdough meanwhile, having finished everything he had to say upon the subject of horsemanship, had travelled away to another topic, explaining, expounding, elaborating, pouring forth a flood of illustrations such as his native tongue is rich in. It was a torrent to which there was apparently no limit, and which, once started, could flow as readily and continue as long in one direction as in another. \\n\\n \\n\\n Grania was hardly listening. She wanted—she hardly herself knew what she wanted{140}—but certainly it was not words. Why would Murdough always go on talk, talk, talking? she thought irritably. She admired his interminable flow of words of course—she would not have been Irish had she not done so—at the same time she was conscious of a vague grudge against them. They seemed always to be coming between them. They were her rivals after a fashion, and she was not of a temper to put up patiently with rivals, even invisible ones. \\n\\n \\n\\n ‘Man above! but it is late ’tis getting!’ she suddenly exclaimed. ‘And I, that ought to have gone home before this!—yes indeed,’ she added, looking up at the sky, in which the light had shifted considerably towards the west since they had been there together. ‘Honor will wonder not to see me. It is half an hour ago I should have gone, so it is.’ \\n\\n \\n\\n ‘Is it worse than common she is to-{141}day?’ Murdough inquired carelessly, getting up from his rock and stretching himself with an air of immeasurable fatigue. \\n\\n \\n\\n ‘It is not better any way,’ the girl answered curtly. \\n\\n \\n\\n A great heap of seaweed which she had brought up from the shore was lying close under the low lacework wall of the little enclosure. Taking up her fork she stuck it into the whole mass, twisting it about so as to make it adhere; then with a sudden lift she raised the fork with all its dangling burden and laid it against her shoulder, and so burdened prepared to mount the hill. \\n\\n \\n\\n Murdough watched her proceedings with an air of impartial approval. ‘Monnum a Dhea! but it is yourself that is the powerful strong girl, Grania O’Malley. There is not many of the boys, I tell you, on Inishmaan that is stronger than you—no, nor as strong{142} either, so there is not,’ he observed appreciatively. \\n\\n \\n\\n Grania smiled proudly. She knew that she was strong, and took an immense pride in her own strength; moreover, speeches like these were about the nearest approaches to compliments that Murdough ever paid her, and she treasured them accordingly. \\n\\n \\n\\n They walked on together over the rocky platform till they had reached its edge, where a low cliff or single gigantic stair rose perpendicularly, leading to the one beyond. Here Murdough, who was a little in front, clambered leisurely up, catching at the overhanging lip of the step with his hand, and pulling himself easily upwards with its aid till he stood upon the higher level. Then he waited for Grania. \\n\\n \\n\\n With her dangling burden of seaweed depending from her shoulder it was not quite so easy for her to do the same. To{143} have handed the whole thing, fork and all, to Murdough until she had in her turn climbed to where he stood would have been the simplest course, but then it was not a course that would have occurred to either of them. Murdough was supposed by Honor and the rest of the world to help Grania at her work, not having any work in particular of his own to do, but in reality their mutual share of that work was always exactly what it had been that afternoon. Habits grow as rapidly as ragweeds, especially where life is of the simplest, and where two people are practically agreed as to how that life is to be carried on; and that Murdough should trouble himself about anything that it was possible for her to do single-handed had long seemed to both of them a sheer absurdity. They might and did have differences about other matters, but so far they were absolutely at one.{144} \\n\\n \\n\\n Now, therefore, as usual, the rule held. Grania lowered the fork on her shoulder, so as to reduce its weight, bringing it down until its burden of seaweed covered her back and head. Then, exerting her muscles to the utmost, she scrambled up, half blinded by the sticky black stuff which dangled over her eyes, helping herself as best she could with her left hand and wedging her knees into the small clefts as they rose one above the other, till at last, her face red and bathed in perspiration though the day was cold, she stood upon the ridge above. \\n\\n \\n\\n This time Murdough did not compliment her in words upon her strength, but his glance seemed to say the same thing, and she was content. \\n\\n \\n\\n From this point they had no more steps to climb, though they had to make a slight circuit to avoid a second and steeper one which lay just below the gully. Following the{145} course of a small valley, grass-grown and boulder-dotted, they presently found themselves in the street, if street it could be called, of a tiny hamlet, consisting of some five or six stone cabins upon one side and three or four upon the other, minute cabins, built of materials so disproportionately big that two or three of the stone slabs sufficed for the length of a wall, which walls were grey as the still living rocks around them, and, like them, might have been seen on inspection to be covered with a close-fitting suit of lichens, sedums, and such small crops, with here and there something taller sprouting where a chink gave it foothold, or a piece of earth, fallen from the decaying thatch above, offered a temporary home. \\n\\n \\n\\n This was Ballinlisheen, second or third largest of the towns of Inishmaan. A good many of its citizens—most of them apparently very old women—were sitting upon their heels at{146} the doorsteps as the two young people came up the track, Murdough sauntering leisurely along with his hands in his pockets, Grania with her black load of seaweed dangling half-way down her back. The latter did not stop to speak to anyone. She was in a hurry to get back to Honor, being conscious of having already delayed too long. Murdough, though a young man generally open to all social advances, was beginning to get hungry, so he, too, kept on steadily beside her, giving only an occasional nod or word of greeting as first one and then another head craned forward into the narrow space between the opposing doorways. \\n\\n \\n\\n Conversation, which had lagged a little in Ballinlisheen before their coming, began to stir and grow brisk again after they had passed on and were moving along the top of the nearest ridge. \\n\\n \\n\\n ‘She is the big girl, Grania O’Malley! the powerful big girl, my conscience, yes,’ said old{147} Stacia Casey, Mick Halliday’s wife, stretching out a neck long and scraggy as a turkey’s and looking after them with an air of contemplation. \\n\\n \\n\\n ‘Murdough Blake tops her by the head,’ replied her neighbour Deb Cassidy from the opposite side of the street, in a tone of contradiction. \\n\\n \\n\\n ‘He does not, then, nor by the half of it,’ retorted the other in the same spirit. ‘Is it marrying him she’ll be, I wonder?’ she added after a minute’s pause. \\n\\n \\n\\n ‘Is it eating her dinner she’ll be?’ exclaimed her friend with a laugh. ‘Wurrah! wurrah! but ’tis the real born fool you must be, woman, to be asking such a question.’ \\n\\n \\n\\n ‘Ugh! ugh! but ’tis the real born fool she will be if she does marry him!’ grunted an enormously big old woman, much older than any of the other speakers, Peggy Dowd by name, the professional story teller, and at that time the oldest inhabitant of Inishmaan. She was{148} supposed to live with a widowed daughter, herself a woman of nearly sixty, but was to be found anywhere else in preference, her great age and standing reputation making her everywhere acceptable, or at all events accepted. \\n\\n \\n\\n ‘Murdough Blake, wisha!’ she went on, emptying the small black pipe she was smoking with a sharp rap upon the stones. ‘Trath, ’tis the poor lot those Blakes of Alleenageeragh are, and always have been, so they have! There was this one’s grandfather—myself remembers him when he was no older than this one—no, nor so old by a year—a fine bouchaleen you’d say to look at him—broad and bulky, and a clean skin, and a toss to his head as if all the rest in the place were but dirt and he picking his steps about amongst them. Well, what was he? He was just nothing, that is what he was, and so I tell you, women, not worth a thraneen, no, nor the half of a thraneen. Ugh! ugh! ugh!{149} don’t talk to me of the Blakes of Alleenageerah, for I tell you I know them—I know them, those Blakes of Alleenageeragh. St. Macdara! I do know them, and have reason to know them! There was another—Malachy Blake his name was—a great man, full of gosther and brag; you’d think it was the world he must have for himself, the whole world, no less, from Liscanor Head to Renvyle Point out yonder, and farther still. Well, I will tell you now about Malachy Blake. The heart of him was no better than the heart of a pullet—of a sick pullet, when the eyes of it begin to turn up, and it squeaks when you take it in your hand and turns over and dies on the floor. That was what Malachy Blake’s heart was like—no better! I have heard him one day so you’d think the wind flying over the top of the island or the stars shining up in the sky would stoop down to listen to him, and the{150} very next minute I have seen a little pinkeen of a man not up to his shoulder give him the go-by and abuse him before the girls, and he never showing no spirit nor a thing, no more than if he was dead. Phoo! phoo! phoo! I know them, those Blakes of Alleenageeragh. There is a story that I could tell you about that same Malachy Blake would make the very eyes of you start out of your head, so it would. But there—’tis a poor case, God knows, to be telling stories to them that knows nothing; a poor case, a very poor case! A fine man he was anyway to look at, I’ll say that for him, Malachy Blake, finer than this one, or six of him! and there was a many a girl in the place liked him well enough, though ’tis flat and low in his grave he is now, and has been these thirty years. Phoo! phoo! flat and low in his grave he is. Yes, indeed, flat and low for all his boasting! But I shall be sorry for Grania O’Malley and for that good woman{151} her sister if she marries young Murdough Blake, so I shall; very sorry! very sorry!’ \\n\\n \\n\\n ‘It is not long Honor O’Malley will be in this world, marrying or no marrying,’ said another old woman, many years younger than the last speaker, Molly Muldoon by name, a brisk, apple-faced little spinster of fifty-seven or thereabouts. ‘It was only yesterday I was with her at their own house yonder, and it was the death-streak I saw plainly under her left eye, the death-streak that no one can live two months once it comes out on them. Oh, a good woman Honor O’Malley is, as you say, Mrs. Dowd, ma’am, none better in this world, nor beyond it either—a real saint, and a credit to Inishmaan and all belonging to her. It is myself has promised to be with her at the last, and at her laying out and at everything, so I have. “Keep Grania away,” says she to me only yesterday. “’Tis broke the child’s heart will be any way, and{152} what good is it to be tearing the life out of her and I past knowing anything about it? Send for Murdough Blake,” says she, “the minute the breath is out of my body, and bid him take her with my blessing and comfort her.” Those were the very words she said. Oh, yes, a good woman, and a kind woman, and a tender woman is Honor O’Malley, a real saint. It is the loss she will be to Inishmaan, the great loss entirely.’ \\n\\n \\n\\n Mrs. Dowd grunted. She was not much of a devotee of saints, certainly not of contemporary ones. \\n\\n \\n\\n ‘And if it isn’t the real out-and-out right wake and funeral she gets it will be the shame of the place, no better,’ Molly Muldoon went on in a tone of enthusiasm. ‘Candles—the best wax ones—with tobacco and spirits for the men, and a plate of white salt to lay on her breast, and the priest, or may be two priests, over from Aranmore.{153} That is the least she should have, so it is, for none ever deserved it better than Honor O’Malley, so they did not.’ \\n\\n \\n\\n ‘They’re rich too, the O’Malleys,’ remarked Deb Cassidy from her side of the path—‘money laid by, and warm people always from first to last, no warmer anywhere. Oh, a real rich girl is Grania O’Malley—my God! yes, rich. There are not three girls on Inishmaan as rich as she is—no, not two, nor any other at all, I am thinking.’ \\n\\n \\n\\n ‘Trath, and it is none too rich she’ll find herself when she is married to Murdough Blake!’ old Peggy Dowd said bitterly. ‘’Tis down from the sky or up from the sea those Blakes of Alleenageeragh do expect the money to be coming to them. A gosthering, spending, having brood they are and always have been. Rich is it? Gorra! ’tis eight days in the week she’ll find herself working for all her money if she means to keep a roof over her{154} head and Murdough Blake under it—yes, and going a shaughraun most like at the tail of it all, so she will. Mark my words, women, so she will, so she will!’ \\n\\n \\n\\n No one ventured to contradict this prophecy, Peggy O’Dowd’s age and reputation making the course perilous. There was a few minutes’ silence, after which Molly Muldoon was the first to break up the conclave. She was the chief rearer of chickens on Inishmaan, and now got up briskly to see after the various broods to which every corner of her cabin was dedicated. One by one, most of the other women, too, got up and moved indoors on various domestic duties, till at last only old Peggy herself remained behind. She had no household duties to see to. She was a mere visitor, a sitter beside other people’s hearths and a sharer of other people’s victuals. She remained, therefore, squatting in the same place{155} upon the doorstep, her big blue patched cloak hitched about her shoulders, her knees nearly on a level with her big projecting chin, her broad face, once immensely fat, now fallen into deep furrows and hollows, growing gradually impassive as the momentary excitement of recalling her old grudge against the Blakes faded away or got merged in other and probably equally long-remembered grudges. Sitting there hunched in her big cloak, she might at a little distance have been taken for some sort of queer vegetable growth—a fungus, say, or toadstool, which had slowly drawn to itself all the qualities—by preference the less benignant ones—of the soil from which it had sprung. In places like Inishmaan, where change has hardly any existence, the loves, hates, feuds, animosities of fifty or sixty years ago may often be found on examination to be just as green and just as unforgotten as those of yesterday. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2729/75185.html","bookId":1402,"book":{"id":1402,"title":"Grania, The Story of an Island","description":"简介： This story was always intended to be dedicated to you. It could hardly, in fact, have been dedicated to anyone else, seeing that it was with you it was originally planned; you who helped out its meagre scraps of Gaelic; you with whom was first discus...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2729","creation":"Aug 1, 2019 12:25:01 AM","modification":"Aug 1, 2019 12:25:01 AM"}}
