{"id":27107,"no":2,"title":"PART I SEPTEMBER CHAPTER I","content":"A mild September afternoon, thirty years ago, in the middle of Galway Bay. Clouds over the whole expanse of sky, nowhere showing any immediate disposition to fall as rain, yet nowhere allowing the sky to appear decidedly, nowhere even becoming themselves decided, keeping everywhere a broad indefinable wash of greyness, a grey so dim, uniform, and all-pervasive, that it defied observation, floating and melting away into a dimly blotted horizon, an horizon which,{2} whether at any given point to call sea or sky, land or water, it was all but impossible to decide. Here and there in that wide cloud-covered sweep of sky a sort of break or window occurred, and through this break or window long shafts of sunlight fell in a cold and chastened drizzle, now upon the bluish levels of crestless waves, now upon the bleak untrodden corner of some portion of the coast of Clare, tilted perpendicularly upwards; now perhaps again upon that low line of islands which breaks the outermost curve of the bay of Galway, and beyond which is nothing, nothing, that is to say, but the Atlantic, a region which, despite the ploughing of innumerable keels, is still given up by the dwellers of those islands to a mystic condition of things unknown to geographers, but too deeply rooted in their consciousness to yield to any mere reports from without.{3} One of these momentary shafts of light had just caught in its passage upon the sails of a fishing smack or hooker, Con O’Malley’s hooker, from the middle isle of Aran. It was an old, battered, much-enduring sail of indeterminate hue, inclining to coffee colour, and patched towards the top with a large patch of a different shade and much newer material. The hooker itself was old, too, and patched, but still seaworthy, and, as the only hooker at that time belonging to the islands, a source, as all Inishmaan knew, of unspeakable pride and satisfaction to its owner. At present its only occupants were Con himself and his little eleven-year-old daughter, Grania. There was, however, a smaller boat belonging to it a few yards away, which had been detached a short while before for the convenience of fishing. The occupants of this smaller boat were two{4} also, a lad of about fourteen, well grown, light haired, fairly well to do, despite the raggedness of his clothes, which in Ireland is no especial test of poverty. The other was a man of about twenty-eight or thirty, the raggedness of whose clothes was of the absolute rather than comparative order. The face, too, above the rags was rather wilder, more unsettled, more restless than even West Connaught recognises as customary or becoming. Nay, if you chose to consider it critically, you might have called it a dangerous face, not ugly, handsome rather, as far as the features went, and lit by a pair of eyes so dark as to be almost black, but with a restlessly moving lower jaw, a quantity of hair raked into a tangled mass over an excessively low brow, and the eyes themselves were sombre, furtive, menacing—the eyes of a wolf or other beast of prey—eyes which by moments{5} seemed to flash upon you like something sinister seen suddenly at dead of night. Shan Daly, or Shan-à-vehonee—‘Shan the vagabond’—he was commonly called by his neighbours, and he certainly looked the character. Even this man’s fashion of fishing had something in it of the same furtive and predatory character. Fishing, no doubt, is a predatory pursuit; still, if any predatory pursuit can be said to be legalised or sanctified, it surely is. Shan Daly’s manner of fishing, however, carried no biblical suggestions with it. Every time his line neared the surface with a fish attached, he clutched at it with a sudden clawing gesture, expressive of fierce, hungry desire, his lips moving, his eyes glittering, his whole face working. Even when the fish had been cleared from the line and lay in a scaly heap at the bottom of the boat, his looks still followed them with the{6} same peculiarly hungry expression. Watching him at such a moment you would hardly have been surprised had you seen him suddenly begin to devour them, then and there, scales and all, as an otter might have done. For more than an hour the light western breeze which had carried the hooker so rapidly to Ballyvaughan that morning, with its load of kelp, had been gradually dying away, until now it was all but gone. Far and wide, too, not a sign of its revival appeared. Schools of gulls rose and dipped in circles here and there upon the surface of the water, their screams, now harsh and ear-piercing, now faint and rendered almost inaudible by distance. A few other fishing boats lay becalmed at widely separated points in the broad circumference, and, where the two lines of coast, converging rapidly towards one another, met at Galway, a big merchantman was seen slowly moving into{7} harbour in the wake of a small tug, the trail of whose smoke lay behind it, a long coal-black thread upon the satiny surface. Leaning against the taffrail of his vessel, Con O’Malley puffed lazily at his pipe, and watched the smoke disappearing in thin concentric circles, his brawny shoulders, already bent, less from age than from an inveterate habit of slouching and leaning showing massively against that watery background. Opposite, at the further end of the boat, the little red-petticoated figure of his daughter sat perched upon the top of a heap of loose stones, which served for the moment as ballast. The day, as has been said, was calm, but the Atlantic is never an absolutely passive object. Every now and then a slow sleepy swell would come and lift the boat upon its shoulders, up one long green watery slope and down another, setting the heap of stones rolling and grinding one against the{8} other. Whenever this happened the little figure upon the ballast would get temporarily dislodged from its perch, and sent rolling, now to one side, now to the other, according as the boat moved, or the loose freight shifted its position. The next moment, however, with a quick scrambling action, like that of some small marmoset or squirrel, it would have clambered up again to its former place; its feet would have wedged themselves securely into a new position against the stones, the small mouth opening to display a row of white teeth with a laugh of triumphant glee at its own achievement. A wild little face, and a wild little figure! Bare-headed, with unkempt hair tossing in a brown mane over face and neck; a short red flannel petticoat barely reaching to the knees; another, a whitish one, tied by the strings cloak-fashion about the shoulders, and tumbling backwards{9} with every movement. One thing would probably have struck a stranger as incongruous, and that was the small feet and legs were not, as might have been expected, bare, but clad in comfortable thick knitted stockings, with shoes, or rather sandals, of the kind known as pampooties, made of cow’s skin, the hair being left on, the upper portion sewn together and tied with a wisp of wool in more or less classical fashion across the two small insteps. Seen against that indeterminate welter of sea and sky, the little brown face with its rapidly moving glances, strongly marked brows, vividly tinted colouring, might have brought southern suggestions to your mind. Small Italian faces have something of that same outline, that flash, that vividness of colouring: gipsies too. Could the child by any chance, you might have asked yourself, be a gipsy? But no: a moment’s reflection{10} would have told you it was impossible, for there are no gipsies, never have been any, in Ireland. Of course, the real explanation would soon have presented itself to your mind. It lay in that long-unrenewed, but still-to-be-distinguished streak of Spanish blood, which comes out, generation after generation, in so many a West Irish face, a legacy from the days when, to all intents and purposes, yonder little town was a beleaguered fortress, dependent for daily necessities upon its boats and the shifting caprice of the seas; the landways between it and the rest of the island being as impracticable for all ordinary purposes and ordinary travellers as any similar extent of mid-Africa to-day. Hours pass unobserved in occupations which are thoroughly congenial to our temperaments, and it would have been difficult to hit upon one more congenial to such a tempera{11}ment as Con O’Malley’s than that in which he was at that moment engaged. Had wind, sky, and other conditions continued unchanged, he would in all probability have maintained the same attitude, smoked his pipe with the same passive enjoyment, watched the horizon with the same vaguely scrutinising air, till darkness drove him home to supper and Inishmaan. An interruption, however, came, as interruptions are apt to come when they are least wanted. The fishing that afternoon had been unusually good, and for a long time past the two occupants of the smaller boat had been too busily occupied pulling in their lines to have time for anything else. It was plain, however, that strict harmony was not reigning there. Now and then a smothered ejaculation might have been heard from the elder of the two fishermen directed against some proceeding on the part of the younger one. Presently this would die{12} away, and silence again set in, broken only by the movements of the fishers, the whisper of the water, the far-off cries of the gulls, and the dull sleepy croak with which the old hooker responded to the swell, which, lifting it upon its shoulders up one smooth grey incline, let it drop down again with a stealthy rocking motion the next moment upon the other. Suddenly a loud burst of noise broke from the curragh. It was less like the anger of a human being than like the violent jabbering, the harsh, inarticulate cries of some infuriated ape. Harsher and harsher, louder and louder still it grew, till the discord seemed to fill the whole hitherto peace-enveloped scene; the very gulls wheeling overhead sweeping away in wider circles as the clamour reached their ears. Con O’Malley roused himself, lifted his gaze from the horizon, took the pipe out of his mouth, and, standing erect, flung an{13} angry glance at the curragh, which was only separated from his own boat by some twenty or thirty yards of water. Evidently a furious quarrel was raging there. The two fishermen, a minute ago, defined, as everything else, large or small, was defined against that grey, luminous background of water, were now tumbled together into an indistinguishable heap, rolling, kicking, struggling at the bottom of the boat. Now a foot or hand, now a head, rose above the confusion, as one or other of the combatants came uppermost; then the struggle grew hot and desperate, and the fragile craft rocked from side to side, but nothing was to be seen of either of them. Suddenly Shan Daly’s face appeared. It was convulsed with rage; fury and a sort of wild triumph shone in his black eyes; one skinny arm, from which the ragged sleeve had fallen back, rose, brown, naked, and{14} sinewy, over the edge of the boat. He had pinned the boy, Murdough Blake, down with his left hand, and with the other was now feeling round, evidently for something to strike him with. Before he could do so, however, Con O’Malley interfered. ‘Cred thurt, Shan Daly? Cred thurt?’[1] he exclaimed in loud, peremptory tones. There was an instant silence. Shan Daly drew back, showing a very ugly face—a face spotted green and yellow with passion, teeth gleaming whitely, rage and the desire of vengeance struggling in every line of it. He stared at his interlocutor wildly for a minute, as if hardly realising who he was or what he was being asked, his mouth moving as if he was about to speak, but not a word escaping from his lips. In the meantime, the boy had shaken himself free, had{15} got upon his feet, and now proceeded to explain the cause of the quarrel. His face was red with the prolonged struggle, his clothes torn, there was a bad bleeding bruise upon the back of one of his hands, but though he breathed hard, and was evidently excited, it was with a volubility quite remarkable under the circumstances that he proceeded to explain the matter in hand. Shan Daly, he said, had quarrelled with him about the fish. The fish would roll together whenever the boat moved, so that the two heaps, his and Shan’s, got mixed. Could he, Murdough Blake, help their rolling? No: God knew that he could not help it. Yet Shan Daly had sworn to have his blood if he didn’t keep them apart. How was he to keep them apart? It was all the fault of the fish themselves! Yes, it was! So it was! He had done his best to keep them apart, but the fish were slimy and they ran together.{16} Did he make them slimy? No, he did not! It was God Himself who had made them slimy. But Shan Daly.... How much longer he would have gone on it is difficult to say, but at this point his explanations were cut summarily short. ‘Bedhe hushth, agus tharann sho,’[2] Con O’Malley said curtly. The smaller boat was then pushed up to the other and the boy obeyed. No sooner was he upon the deck of the larger vessel than Con O’Malley silently descended into the curragh. The two boats were again pushed a few yards apart, and Murdough Blake found himself left behind upon the hooker.","sourceLink":"http://novel.tingroom.com/duanpian/2729/75177.html","bookId":1402,"book":{"id":1402,"title":"Grania, The Story of an Island","description":"简介： This story was always intended to be dedicated to you. It could hardly, in fact, have been dedicated to anyone else, seeing that it was with you it was originally planned; you who helped out its meagre scraps of Gaelic; you with whom was first discus...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2729","creation":"Aug 1, 2019 12:25:01 AM","modification":"Aug 1, 2019 12:25:01 AM"}}
