{"id":27129,"no":24,"title":"CHAPTER VII","content":"The road from Cashla Bay past Spiddal into Galway is as grim a one surely as is to be found in these three kingdoms. Mile after mile it runs through a grey world of boulders, varying from the size of a hencoop to that of an average cottage. Mile after mile, and still you say to yourself that the stony deluge must have reached its limits, that the stones will soon begin to cease; somewhere or other, a little farther on, at the next turn, there will be unencumbered fields again; grass, perhaps; possibly even trees; at the worst an earth free from this soul-wearying, this eternal, interminable incubus of stones.{103} \\n\\n \\n\\n But no; mile after mile, and still never a sign or hint of change, never the slightest diminution in their multitude. The straight road—good and level as all West Connaught roads are—runs on and on through this rock-encumbered wilderness as if it loved it. There are low drift-hills near at hand, stone-covered like the rest; there are a few nipped and draggled looking villages at long intervals; there is a more or less misty glimpse of Connemara mountains occasionally to be had; also a much nearer view of Clare and the hills of Burren; there is the bay, very near indeed, with, perhaps, a ‘pookhaun’ or a hooker upon it; now and then a stream dashes by, struggling with difficulty through its incubus of rock, and disappearing under a bridge; otherwise, save stones, stones, stones, there is nothing till the Galway suburbs grow, grey and unlovely, upon your sight. \\n\\n \\n\\n It was the day of Galway fair, the last of{104} the great western spring fairs, and a large party of Aranites were on their way to it. Grania and Murdough were amongst them. Grania had her calf to sell, also a couple of pigs. Murdough had nothing to sell and nothing to do, but any opportunity of escaping for a few hours from Inishmaan, any prospect of stir, bustle, and life was welcome to him. It was he, therefore, who had urged Grania to go this time herself to the fair, instead of entrusting the calf and pigs to Pete Durane, who usually sold them for her, charging a modest commission for his own benefit upon the transaction. \\n\\n \\n\\n She had at first demurred. She did not want, she said, to leave Honor. This was a perfectly true reason, but there were others as well. An inborn reluctance, a touch of savage pride had always hitherto made her shrink from facing the crowds and the bustle of the mainland. Ever since those early days{105} of her trips with her father in the old hooker she had hardly set foot outside their own islands. There had been for her a sense of great dignity and importance in those old, lost, but never-forgotten days. How, indeed, could there fail to be? To sail across the bay in one’s own private hooker; to enter a harbour in it; the fuss and bustle of embarkation; the loud talk of the other hooker-owners with her father; the stares of the open-mouthed, bare-legged beggars and loafers upon the pier—such details as these had naturally given a sense of vague but vast dignity and grandeur to a small person sitting bolt upright upon her ballast of stones, and looking with a sense of condescension at all these new houses and faces thus brought, as it were, officially, under her notice. \\n\\n \\n\\n After this to land, like anyone else, from a curragh at Cashla Bay, and to tramp tamely along a road, was a descent not easy to bring{106} the mind to. Murdough, however, had so urged the matter, had pictured the delights of the fair in such glowing colours, had undertaken to look after her so energetically, to aid her so indefatigably, that in the end—the glamour of that fishing evening being still upon her—she had consented. Honor, too, had wished her to go, had arranged that Molly Muldoon should come and sit with her while she was away, had disposed of every difficulty, and had herself waked her up at three o’clock that morning so as to be ready to start at dawn for the curragh, looking so much better than she had lately done that Grania had been able to start feeling as if all was really going well, and all would still go well with her and with all of them. \\n\\n \\n\\n And in the morning all had gone well. The weather was very fine, though there was a suspicious movement and bustling up of clouds to eastward. As for the scenery,{107} certainly a stranger would have seen little variation, save in point of size, between its stoniness and the stoniness of Inishmaan. To Grania, however, as to all whose eyes are not spoiled by too varied and too early an acquaintanceship with many landscapes, small differences made great ones, and there was enough variety in that morning tramp through those stone-encumbered pastures to cause an exhilarated sense of travel and enlarged acquaintanceship with a world as yet imperfectly known and visited. \\n\\n \\n\\n To walk briskly along the wide, indefinitely extending road, with Murdough Blake beside her; to hear him expatiating, descanting, pointing out the different objects she was to notice; to look from right to left; to laugh and nod to other passers-by—all this surely was novelty, stir, and exhilaration enough for anyone! The group of Aranites tramped rapidly along in their{108} cow’s-skin pampooties, their tongues keeping pace with their legs. In their homemade flannel clothes and queer shoes, with their quick, alert, yet shuffling tread, they formed a marked contrast to the ordinary peasants of the mainland, most of whom stopped short on encountering them, and a brisk interchange of guttural salutations took place. Yes, certainly, it was amusing, Grania thought. Murdough was right; it was a mistake to stay always in one place. One grew to be no better than a cow, or a goat, or a thistle growing upon the rocks. It was good to look abroad. The world, after all, was really a large place. Why, beyond Galway there were actually other towns; Dublin even; that Dublin which Murdough was always talking about and pining to get to. Who could tell but what she herself might some day see Dublin? Stranger things had happened.{109} \\n\\n \\n\\n Matters went less well when they at last reached Galway. The fair is held in the middle of the town, in its main square, the Belgrave or Grosvenor Square of its fashion and importance. The crowd was already great, all the people from the country round having streamed in long before our more distant Aranites could reach the scene. To Grania’s unaccustomed ears the noise seemed to echo and re-echo from every house around, big grey or white houses—enormously big in her eyes—and all strange, all full of people standing in the windows and looking out, laughing at the crowd below—that crowd of which she herself was but a solitary and an insignificant fragment. \\n\\n \\n\\n She had considerable difficulty in discovering her own beasts, which had been sent by boat the night before so that they might be fresh for the fair, and even after she had found them the next difficulty of finding{110} purchasers was to her inexperience absolutely paralysing. If Murdough had stayed with her and helped her, as he had promised to do, all might have gone well, but almost immediately after their arrival he had gone off to look at a horse, promising to return quickly, and had never done so. Left to herself, Grania soon grew utterly miserable and bewildered. She was not frightened by the crowd, for that was not her way; but the noise, the shouts, the rude shoving, the laughter, the rushing to and fro of the animals, the loud thumps upon their wretched backs, the pushing of the people about her, the constant arrival of more cars, more carts, more people, more beasts, more big, excited men in frieze coats, the necessity of being constantly on the alert, so as to hinder oneself from being cheated—all this disturbed and annoyed her. Further, it offended her dignity, used as she was to moving at her{111} own free will amid the solitude and austere silence of her own island. \\n\\n \\n\\n Worse than all the rest, however, and deeper than any merely temporary vexation, was the sense of Murdough’s defection. Why had he left her? why did he not come back when he had promised to do so? why to-day?—just to-day when everything had promised to be so happy? She scanned the crowd in every direction, growing from minute to minute more wretched, more and more hurt and angry. A burning, deep-seated anger such as she had never before experienced seemed to fill her veins. She was hot and cold at once; she was sick with vexation and disappointment. The end of it was that, after vainly waiting and looking about her, seeing him twenty times in the distance, and finding, as he drew near, that it was someone else, she suddenly accepted an offer for her calf from a cattle-jobber which was{112} at least ten shillings less than she ought to have got for it, and, making over the two pigs to Pete Durane, telling him to do the best he could with them, she darted away out of the fair, out of the town, retracing her steps almost by instinct along the road to Spiddal, her whole soul smarting under a sense of wrong and injury. \\n\\n \\n\\n It had begun to rain while she was still in Galway, and as she advanced along the road the rain grew momentarily heavier. There was not a scrap of shelter of any sort, and before she had gone many miles she was drenched to the skin. The immensely thick red flannel petticoat she wore, in all other respects an admirable garment, is apt in the long run to become a terrible drag in such a downpour as this. Once soaked, it weighed upon her as though it had been a petticoat of solid lead, and she had again and again to pause and wring it{113} out as she might have wrung a sponge. In spite of this she hurried on along the dreary, featureless road, hardly heeding where she was going, only filled with the desire of escaping from that dreadful fair, which to her had been a scene not merely of disappointment but something far worse—a breaking-down of this sweet, this newly-found, this hardly-touched happiness—a source of intense bitterness; of a bitterness how intense she herself hardly yet knew. \\n\\n \\n\\n At last, though how long after she left Galway she could not have told, she once more reached the spot, not far from Cloghmore Point, where they had disembarked in the morning. No boat was ready to take her across; the men were all away; there was not even a curragh to be seen, or, in her present mood, she might have attempted to get across the bay by herself. As it was, there was nothing for it but to wait till someone{114} arrived. Once more, therefore, wringing out her petticoat and gathering up her hair, which had got loose in her race, she got under the shelter of a bank and sat down upon a stone, near to where a small stream was bubbling and trickling through a pipe. \\n\\n \\n\\n It was a wretched spot. There were a few cabins a little farther up the road, but it did not occur to her, somehow, to ask for shelter in any of them. She simply sat still upon her stone under the bank, waiting for someone to come, feeling miserable, but almost too tired now to know why or about what. The rain beat upon her head; the wind whistled round her; the sea was a sheet of ink, save for here and there the white crest of a breaker. She was growing very cold after the heat of her walk, and her wet clothes clung closely. She had eaten nothing since the early morning. As regards all this, however, she was for the moment not indifferent merely, but unconscious of it.{115} \\n\\n \\n\\n Presently the door of the nearest cabin opened, and a woman came out, carrying a pail in her hand. She came directly towards Grania, who sat still on her stone under the pelting rain and watched her. She was a terribly emaciated-looking creature, evidently not long out of bed, though it was now getting to the afternoon. She seemed almost too weak, indeed, to stand, much less to walk. As she came up to the stranger she gazed at her with a look of dull indifference, either from ill-health or habitual misery; set her pail under the pipe in the bank through which the stream ran, and, when it was filled, turned and went back, staggering under its weight, towards the door of her cabin again. \\n\\n \\n\\n With an instinct of helpfulness Grania sprang up and ran after her, took the pail from her hands and carried it for her to the door. \\n\\n \\n\\n The woman stared a little, but said{116} nothing. Some half-naked, hungry-looking children were playing round the entrance, and through these she pushed her way with a weary, dragging step. Then, as if for the first time observing the rain, turned and beckoned Grania to follow her indoors. \\n\\n \\n\\n Dull as it had been outside, entering the cabin was like going into a cellar. There was hardly a spark of fire. That red glow which rarely fails in any Irish home, however miserable, was all but out; a pale, sickly glimmer hung about the edges of some charred sods of turf, but that was all. \\n\\n \\n\\n A heavy, stertorous breathing coming from a distant corner next attracted Grania’s attention, and, looking closely, she could just distinguish a man lying there at full length. A glance showed that he was dead drunk, too drunk to move, though not too drunk, as presently became apparent, to{117} maunder out a string of incoherent abuse, which he directed at his wife without pause, meaning, or intermission, as she moved about the cabin. One of the brood of squalid children—too well used, evidently, to the phenomenon to heed it—ventured within reach of his arm, whereupon he struck an aimless blow at it, less with the intention apparently of hurting it, than from a vague impulse of asserting himself by doing something to somebody. He was very lamentably drunk indeed, and probably not for the first, or the first hundredth, time. \\n\\n \\n\\n The woman indifferently drew the child away and sent it to play with the other children in the gutter outside. Then having set the black pot upon the fire, she squatted down on her heels beside it, heedless, apparently, of the fact that there was not a chance of its boiling in its present state, and taking no heed either of her visitor or of{118} her husband, who continued to maunder out more or less incoherent curses from his corner. \\n\\n \\n\\n Grania shivered and felt sick. Something in the look and extraordinary apathy of the woman, something in the hideous squalor of the house, affected her as no poverty—not even that of the Dalys at home—had ever done before. She raked together the embers, and put a few fresh sods of turf on the fire—seeing that the woman of the house was either too ill or too indifferent to do anything—then sat down on a low creepy opposite to her, feeling chilled to the bone and utterly miserable. \\n\\n \\n\\n Something new was at work within her. She did not yet know what it was, but it was a revelation in its way—a revelation as new and as strange as that other revelation two days before in the boat, only that it was exactly the reverse of it. A new idea, a{119} new impression, was again at work within her, only this time it was a new idea, a new impression upon the intolerableness of life, its unspeakable hopelessness, its misery, its dread, unfathomable dismalness. Why should people go on living so? she thought. Why should they go on living at all, indeed? Why, above all, should they marry and bring more wretched creatures into the world, if this was to be the way of it? How stupid, how useless, how horrible it all was! Yes, Honor was right, the priests were right, the nuns were right, they were all right—there was no happiness in the world, none at all—nowhere! Murdough Blake?—well, Murdough Blake would be just like the rest of them, just like every other husband—worse, perhaps, than some. He wanted to marry her, it is true, but why? Because she was strong, because she owned the farm, because she owned Moonyeen, and the pigs, and the little bit{120} of money; because she could keep him in idleness; could keep him, above all, in drink; because he could get more out of her perhaps than he could out of another! \\n\\n \\n\\n She looked suddenly across at the mistress of the house and it seemed to her that she saw herself grown older. Evidently the other had once been a handsome woman, and was not even now old, only worn out with ill-health, many children, much work, much misery. Her left hand, which she held mechanically towards the now rising blaze, was so thin that the wedding-ring seemed to be dropping off; her hair was still black, and hung about her emaciated face in draggled-looking coils and wisps like seaweed. Staring at her in the dusk of that miserable hearth Grania seemed to see herself a dozen years later: broken down in spirit; broken down in health; grown prematurely old; her capacity for work diminished; with{121} a brood of squalid, ill-fed children clamouring for what she had not to give them; with no help; with Honor long dead; without a soul left who had known her and cared for her when she was young; with shame and a workhouse on the mainland—deepest of all degradation to an islander—coming hourly nearer and nearer, and a maudlin, helpless, eternally drunken— \\n\\n \\n\\n With a sudden sickening sense of disgust and yet of fascination she turned and looked again at the man, still swearing and squirming in his corner. All at once an overpowering feeling of revolt overtook her, and with a bound she sprang to her feet and ran out of the cabin and down the road. Anywhere, anywhere in the world would be better than to remain an instant longer looking at those two, that man, that woman! Who were they? Were they not simply herself and him—herself and Murdough?{122} \\n\\n \\n\\n It was raining harder than ever, but she went on a long distance, far away from all the houses, before she again crouched down, this time nearer to the shore, under the shelter of a big boulder, there to wait till the rest of the party returned from Galway. \\n\\n \\n\\n It was a dreary, and seemingly an endless wait, but they came at last. Half an hour at least before they reached her she could hear Murdough Blake’s voice, far away up the road, and the minute he saw her he ran forward and began a long, involved account of all that had delayed him and prevented his return—how he had met Pat this, and Larry that, and Malachy the other, what they had said, done, and consulted him about. It was an even more involved account, and one that entailed a yet more profuse expenditure of vocabulary, than usual, and this and his looks showed that the proverbial hospitality of Galway had not belied itself. Grania{123} answered nothing; accepted his explanations in absolute silence; sat looking in front of her silently upon her thwart all the while they were crossing back to the islands. She was so often silent that neither he nor anyone else in the boat noticed anything unusual. When they reached the shore, however, she turned instantly away, without a word to any of the rest of the party gathered together at the landing-place, and walked slowly home by herself to the cabin and to Honor. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2729/75199.html","bookId":1402,"book":{"id":1402,"title":"Grania, The Story of an Island","description":"简介： This story was always intended to be dedicated to you. It could hardly, in fact, have been dedicated to anyone else, seeing that it was with you it was originally planned; you who helped out its meagre scraps of Gaelic; you with whom was first discus...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2729","creation":"Aug 1, 2019 12:25:01 AM","modification":"Aug 1, 2019 12:25:01 AM"}}
