{"id":10021,"no":8,"title":"Chapter 7: Gratitude.","content":"Reuben looked round, upon gaining his feet. He saw Miss Hudson standing by the side of her companion; who had fallen, fainting, to the ground. Mr. Hudson and Captain Wilson, running at their full speed, were within a few paces of the girls. They had entered a shop to make a purchase, while the ladies strolled on; and although they had rushed out on hearing the alarm, they were too far off to render assistance and, impotent to help, had seen with horror the terrible death which threatened the ladies. Frances Hudson had not uttered a word, from the moment when the Malay rushed down upon them; but as her father came up she turned round, and burst into tears as he clasped her in his arms. As soon as it was seen that the Malay was no longer dangerous, the people poured out again from the houses and shops. It was no very unusual thing, in Cape Town, for the Malays to run amuck; and many of those in the streets hurried off, in the direction from which the man had come, to inquire how many victims had fallen to his deadly crease, and to see whether any friends were among them. On the Malay himself no one spared a moment\u0027s attention. A second tremendous blow, with the policeman\u0027s club, had dashed out his brains; for Malays running amuck were always killed upon the spot, partly in order to save further trouble with them, partly to strike terror into others. Many of the bystanders gathered round Reuben, seized him by the hand, patting him on the shoulder, and praising him for the courage with which he had faced the maddened savage. A minute later, Mr. Hudson forced his way through the crowd. Miss Furley had already been raised, and carried into a shop. \"Go in with her, my dear,\" Mr. Hudson said to his daughter. \"I will bring him to you directly. \"My brave fellow!\" he exclaimed, as he made his way to Reuben and grasped his hand, \"how can I thank you for saving my child\u0027s life? It seemed to us that she was lost, and that nothing could save her; when we saw you dash past her, and throw yourself unarmed upon the madman. It was a noble deed, indeed. \"You are not badly hurt, I hope,\" he added, as he saw the blood streaming down Reuben\u0027s face and arm. \"Nothing to speak of, sir,\" Reuben replied. \"At least, I think not; but I feel rather queer from this loss of blood. I had better get myself bandaged up.\" And indeed, Reuben was turning very pale, partly from the relaxation of the tension of the struggle; partly, as he said, from loss of blood. \"Stand back!\" Mr. Hudson cried, \"don\u0027t press upon him. The lad is nearly fainting. One of you help me get him into a shop. Where is the nearest surgeon to be found?\" It was as much as Reuben could do to walk across the street, aided by his two supporters. A strong glass of Cape smoke (as the native spirit is called) and water revived him somewhat. It was some minutes before a surgeon arrived; for five persons had been terribly wounded, and two killed by the Malay on his course, and the surgeons near were busily employed. \"Not very serious,\" the surgeon said, as soon as he examined Reuben\u0027s wounds. \"Very different affairs from those I have just come from.\" \"I had hold of his hand,\" Reuben said, \"so that he couldn\u0027t strike. They are only cuts he made in trying to get his arm free.\" \"That on your arm will not trouble you, though it has bled pretty freely. The one down your face is, fortunately, of no great consequence; except that it has cut down to the bone on the brow and cheek. If it had been an inch further back, it would have severed the temporal artery. You have had a narrow escape of it. As it is, you will get off with a scar, which may last for some time; but as it is an honourable one, perhaps you won\u0027t so much care. However, I will bring it together as well as I can, and stitch it up, and it may not show much.\" The wound was sewn up and then bandaged, as was that on the arm. The other and slighter wounds were simply drawn together by slips of plaster. When all was done, Reuben said to Mr. Hudson: \"I shall do very well now, sir. I am sure you must wish to go to Miss Hudson. I will sit here a bit longer, and then go on board the ship.\" \"You will do nothing of the kind,\" Mr. Hudson said. \"I have just sent for a vehicle, and you will come to the hotel and get into bed at once. You are not fit to stand now, but I hope a good night\u0027s rest will do you good.\" Reuben would have protested, but at this moment a vehicle arrived at the door, and with it Captain Wilson entered. \"I have just taken your daughter and Miss Furley to the hotel, Hudson,\" he said. \"They are both greatly shaken, and no wonder. So I thought it better to see them back, before coming in to shake hands with our gallant young friend here.\" \"He has lost a good deal of blood, Wilson; and I am just taking him off, to get him to bed in the hotel. \"So we won\u0027t do any thanking till the morning,\" Mr. Hudson said, seeing that Reuben\u0027s lip quivered, and he was incapable of bearing any further excitement. \"Do you take one of his arms and I will take the other, and get him into that trap.\" A quarter of an hour later, Reuben was in bed at the hotel. Mr. Hudson brought him up a basin of clear soup. Having drunk this, he turned over and was, in a very few minutes, asleep. The captain and most of the other passengers were at the same hotel, and there was great excitement when the news arrived of the terrible danger the two girls had run. Mrs. Hudson had, from her early life, been accustomed to emergencies; and the instant the girls arrived she took them up to the room they shared between them, and insisted upon their going at once to bed, after partaking of a cup of tea. \"What am I to do for this young fellow, Wilson?\" Mr. Hudson asked as, having seen his patient comfortably in bed, he returned downstairs, and took a seat in the verandah by his fellow passenger. \"I owe Frances\u0027 life to him, and there is nothing I wouldn\u0027t do for him. The question is, what? One does not like to offer money to a man, for such a service as this.\" \"No,\" Mr. Wilson agreed, \"especially in his case. The young fellow appears to me very much above his condition. Your daughter first pointed it out to me, and I have since chatted with him several times, and find him a very superior young fellow. Certainly his education has been very different from that of most men in his condition of life, and I should have taken him for a gentleman, who had got into some scrape and run away, had it not been that he seems to have been regularly apprenticed to his trade. Still, there is something a little mysterious about him. I asked him casually what part of the country he came from. He hesitated a moment, and then said, \u0027From the south of England.\u0027 Of course, I did not ask any further questions, as it was clear he did not care about naming the precise locality, or he would not have given so vague an answer. I feel as deeply indebted to him as you do.\" Mr. Hudson nodded. Only the evening before arriving at Cape Town, Captain Wilson had spoken to him on the matter of his affection for his daughter, and had asked his permission to speak to Frances. They had known each other in the colony, but had not been intimate until thrown together on board the Paramatta. Seeing that she was an only child, and that her father was considered one of the wealthiest squatters in the colony, Captain Wilson had feared that Mr. Hudson would not approve of him as a suitor; and had therefore broached the subject to him, before speaking to her. Mr. Hudson, however, had raised no objections. \"You have taken a manly and proper course, in speaking to me first,\" he said; \"just what I should have expected from you. I own that, with the fortune the girl will have some day, I have always looked for her making what they call a good match, and settling down in the old country; but I may tell you that while she has been in Europe she has had several opportunities of so doing, if she would have taken them. She did not think fit to do so, and I have always made up my mind not to influence her in any way, providing she didn\u0027t fix her choice upon one whose character I disapproved. Certainly I have no reasons for so doing, in the present case. Your character stands high in the colony; and personally, as you are well aware, I like you exceedingly. \"What Frances\u0027 feelings in the matter are, I have no means of knowing. There is no doubt she likes you, but as to anything more, it is for you to find out. You will have plenty of time, between this and Sydney. Anyhow, you have my hearty approval of your wooing. \"I think, between ourselves you know, you must not expect, at first, any very cordial approval on the part of her mother. She had an idea, you know, that Frances would marry a duke at least, and an offer from a prince of the blood would not have surprised her. It is a great disappointment, to her, that she should have returned unmarried; and she has already been talking to me about our returning to England, in another couple of years. So she will not take quite kindly to it, at first; but you mustn\u0027t mind that. Fond of Frances as she is, she will soon come round, if she finds that the girl\u0027s happiness is really concerned in the matter. \"Take my advice, and don\u0027t push it till we get near the end of the voyage. If Frances says yes, she is the sort of girl to stick to it; and as I am with you, you may be quite sure it will come right in the long run; but we might not have a very pleasant time of it during the remainder of the voyage, you know, and as things have gone on so pleasantly, it would be a pity to spoil them.\" Thus it was that Mr. Hudson nodded, when the young officer of the constabulary said that his indebtedness to Reuben was equal to his own. \"Yes,\" he said, \"if it had been one of the sailors, I could have set the matter right by drawing a big cheque, and I shouldn\u0027t have cared how big; but with this young fellow I do not quite see my way. However, I will shift the responsibility, by leaving the matter in Frances\u0027 hands—women are much better hands at things of this sort, that require a light touch, than we are. I do not wonder that she and Miss Furley are shaken. I feel shaken myself. I shall never forget that scene, and the two girls standing there, and that wild Malay rushing at them. My legs seemed to give way under me, and I thought I should have fallen down.\" \"I felt bad myself, sir,\" Captain Wilson said. \"I have been in some tough fights, with bush rangers and natives; but I never had that sort of feeling before. \"One ran, but one felt it was no use running, as all must be over before we could get there. When it was over, I felt as weak as a child.\" \"Don\u0027t let us talk any more about it,\" Mr. Hudson said, rising. \"I doubt whether I shall get a wink of sleep now; and I am sure I sha\u0027n\u0027t, if we go on talking any more about it. Let us take a turn, and have a stiff glass of brandy and water afterwards, to settle our nerves before turning in.\" The passengers by the Paramatta were up early in the morning, for the ship was to sail at nine. But early as they were, Reuben was before them; and on Mr. Hudson inquiring about him, as he turned out, he was informed that he had already gone on board the ship. The two girls both looked pale, when they came down to their early breakfast. Both declared, however, that they had slept well. \"You must give us time, dad, to get up our roses,\" Frances Hudson said, in reply to her father\u0027s remarks as to their appearance. \"I have no doubt a few days at sea will do it; but of course, it is only right and proper that young ladies should be pale, after going through such an adventure as we had yesterday. \"But do not let us talk about it,\" she said, with a shudder. \"I should like not to be able to think about it, again, for six months. You used to say, dad, that I was plucky, because I wasn\u0027t afraid of wild cattle, and not very afraid of the natives or bush rangers; but I am sure I cannot lay claim to any special courage in future, for no one in the world could feel more frightened than I did, yesterday.\" \"Well, my dear, you were no worse than anyone else, for everyone else bolted at the first alarm. The way that street was cleared was something marvellous.\" \"Yes, dad; but I was too frightened to run. Not that it would have been any use if I had, for he was close to us before we knew what was the matter; and if I could have run, I don\u0027t think Emma could.\" \"No, indeed,\" Miss Furley said. \"I had no idea of running and, even had there been plenty of time, I am sure I could not have got out of the way. Somehow I seemed to lose all power to move. I had just shut my eyes, and thought it was all over, when there was a shout and a rush, and I saw the Malay roll over; and then I made a snatch at Frances, and rolled over, too.\" \"It was a terrible moment,\" Mr. Hudson said. \"But I agree, with Frances, that it is better for you to try and think nothing more about it, until you have perfectly recovered your health and spirits.\" \"I hear, dad, that the young man that saved us has gone on board ship. I asked, directly I was up, because I wanted to see him.\" \"And I expect, my dear, that he slipped away because he didn\u0027t want to see you. It sounds rude, doesn\u0027t it? But I can perfectly understand it.\" \"So can I,\" the girl agreed. \"Did you see him this morning?\" \"No, my dear. I came downstairs only a minute or two before you did, and then found that he was gone.\" \"Have you thought over what you are going to do, dad, for him?\" \"Wilson and I have talked it over, Frances, but at present we don\u0027t see our way. It is too serious a matter to make up our minds in a hurry. Your mother is in favour of giving him a handsome present; but I don\u0027t think, myself, that that would do. Men who will do such deeds as that are not the sort of men to be paid by money.\" \"Oh no, dad! Surely not that. Any other possible way, but not money.\" \"No, my dear; so I thought. I have chatted it over with Wilson, and we have agreed that the best plan is to leave it entirely in your hands.\" \"I will think it over, dad,\" the girl said gravely. \"It is a serious thing. We owe him our lives, and the least we can do is not to hurt his feelings, by the way in which we try to show our gratitude.\" Reuben had slept well; and on waking, soon after daylight, jumped at once out of bed; and was glad to feel that, except for a certain amount of weakness in the legs, and stiffness in his wounds, he was all right again. He dressed quietly and, as soon as he heard persons moving about in the hotel, made his way down to the shore, and sat down there to wait for a boat from the ship; which was lying some distance out, and would, he was sure, be sending off early, as there would be many things to bring on board before she sailed. It was not long before he saw the men descending the gangway to the boat alongside, which was soon rowing towards the shore. As she approached, Reuben saw the steward and first mate, sitting in the stern seats; and when the officer jumped ashore, his eye fell on Reuben. \"Ah, Whitney,\" he said, \"I am glad to see you about. When the captain came off, last night, he told me all about your gallant rescue of the two ladies. I am sorry to see you bandaged up so much. The captain said you had some nasty cuts, but I didn\u0027t think they were so bad.\" \"They are nothing to speak about, sir,\" Reuben replied, \"although you would think so, from seeing those bandages all over one side of the face, and my arm in a sling; but they are no great depth, and don\u0027t hurt to speak of. They were clean cuts with a sharp edge, and don\u0027t hurt half as much as many a knock I have had, with a hammer.\" \"Well, we all feel proud of you, my lad. It isn\u0027t everyone who would face a Malay running amuck, without weapons, I can tell you.\" \"I think any English sailor would do so, sir, if he saw the Malay rushing down upon two ladies. There was no time to think about danger, one way or the other. The only thing to be done was to rush at him, and so I rushed, as anyone else would have done.\" \"Ah, it\u0027s all very well to say so, Whitney; but I have my doubts about everyone else rushing. However, I mustn\u0027t stand talking about it now, as I have my hands full of work. The sooner you get on board the ship, the better. \"Row Whitney back to the ship, lads, and come back again in an hour\u0027s time. None of the things will be down here before that.\" Reuben stepped into the boat, which at once pushed off. The men rowed easily, for they were anxious to hear the particulars of the report which had circulated through the ship. Bill Hardy was rowing the stroke oar, and did the questioning. \"You may try to make little of it,\" he said, \"but I tell you, Reuben, it were a right down good thing—a thing any man would have right to be proud of. \"What do you say, mates?\" There was a general chorus of \"Ay, ay.\" \"I took you in hand when you came on board, young un,\" Bill went on, \"and I looks upon you as my chick, and I tell you I feel proud on you. I felt sure you would turn out a good un, some day, but I didn\u0027t look to see it so quick. \"In oars!\" The boat ran up alongside the gangway, and Reuben was soon upon deck. He was there met by the captain, who had just come up as the boat rowed alongside. He shook Reuben\u0027s hand heartily. \"You are a fine young fellow, Whitney; and your mother, if you have one, ought to be proud of you. I should be, if you were a son of mine. It was a lucky day for us all, when I shipped you on board the Paramatta; for it would have been a heavy day for us, if those two young ladies had been killed by that madman, yesterday. \"You look pale, lad, as much as one can see of you, and you will have to lie by for a bit. I hear you lost a great deal of blood. \"Steward, bring another cup of cocoa with mine, a large one, and put plenty of milk in.\" The captain insisted on Reuben coming to his cabin to drink his cocoa. \"You had best knock off your allowance of spirits, till your wounds have healed up, lad. I will tell the second mate to serve you out port wine, instead.\" Reuben now went forward, feeling very much the better for the cocoa. He again had to receive the hearty congratulations of the men; and then, rather to escape from this than because he felt he needed it, he turned into his bunk, and was soon sound asleep. Three hours later, he was awakened by the tramp of men overhead, and knew that they were shortening the anchor chain, and preparing to be off. Going out on to the deck, he saw that the courses had been dropped, and the topsails were lying loose in their gaskets. The crew were singing merrily, as they worked the capstan. Three of the boats already hung from the davits, and two large boats were bringing off the passengers, and were already within a hundred yards of the ship; while the remaining ship\u0027s boat, with the steward, crowded with fresh stores, was but a short way behind them. As soon as the passengers were up, and the shore boats had left, she came alongside. \"Hook on the falls at once,\" the first mate ordered, \"and run her up as she is. You can get the things out afterwards.\" The anchor was, by this time, under the foot. \"Up with it, lads!\" and the sailors again started, at full speed, on the capstan. The jibs were run up, the courses and topsails shaken out and braced, and the Paramatta began to steal through the water again, for the second portion of her voyage. Mr. Hudson and his friend very soon made their way forward, and the ship was scarcely under way when Reuben, who was gazing over the bulwark at the shore, felt a hand laid on his shoulder. \"How are you today, Reuben? Better, I hope? It was too bad of you to run off in that way, this morning.\" \"I am all right now, thank you, sir,\" Reuben answered. \"I felt just a little shaky at first, but the captain gave me a cup of cocoa when I came on board, and I feel now as if I were fit for duty again.\" \"Oh, nonsense,\" Mr. Hudson exclaimed, \"you mustn\u0027t think of work, for days yet. No, you must come aft with me. My daughter and Miss Furley are most anxious to see you; and my wife, too, is longing to add her thanks to mine.\" \"You are very good, sir, but really I would rather not, if you will excuse me. It is horrid being thanked and made a fuss about, just because, on the spur of the moment, one did one\u0027s duty.\" \"That\u0027s all very well, Reuben; but you see, it wouldn\u0027t be fair to my daughter. If anyone did you a great service, you would want to thank them, would you not?\" \"Yes, I suppose so, sir,\" Reuben answered reluctantly; \"but really, I hate it.\" \"I can understand your feelings, my lad, but you must make up your mind to do it. When anyone puts others under a vast obligation to him, he must submit to be thanked, however much he may shrink from it. Come along, it will not be very dreadful.\" Reuben saw that there was no getting out of it, and followed Mr. Hudson along the deck; feeling, however, more ashamed and uncomfortable even than he did when standing in the dock, as a criminal. Captain Wilson walked beside him. Hitherto he had not spoken, but he now laid his hand quietly upon Reuben\u0027s shoulder. \"My lad,\" he said, \"I am not a man to talk much; but believe me that, henceforth, I am your friend for life.\" Reuben looked up, with a little smile which showed that he understood. He had often, indeed, watched the young officer and Miss Hudson together, and had guessed that they were more than mere acquaintances. The passengers were, with the exception of the three ladies, all gathered on the poop. But Frances had proposed to her mother that they should see Reuben in the cabin alone, as she felt that it would be a severe ordeal, to the lad, to be publicly thanked. Captain Wilson ascended to the poop and joined the others there, while Mr. Hudson went alone into the cabin. The three ladies were awaiting him there. Frances came forward first. The tears were standing in her eyes. \"You have saved my life,\" she said softly, \"at the risk of your own; and I thank you with all my heart, not only for my own sake, but for that of my father and mother; who would have been childless, today, had it not been for you.\" \"I need no thanks, Miss Hudson,\" Reuben said quietly. His shyness had left him, as he entered the cabin. \"It will, all my life, be a source of pleasure and gratification to me, that I have been able to have been of service to so bright and kind a lady.\" \"I am not less grateful,\" Miss Furley said, advancing also. \"I shall never forget that dreadful moment, and the feeling which darted through my mind, as you rushed past us and threw yourself upon him, and I felt that I was saved almost by a miracle.\" \"And you must accept my thanks also,\" Mrs. Hudson said; \"the thanks of a mother, whose child you have saved from so dreadful a death. Believe me that there is nothing that my husband or myself would not do, to show how deeply and sincerely we are grateful to you.\" Mrs. Hudson, indeed, felt rather aggrieved that she could not, at once, take some active steps towards rewarding the young man for saving her daughter\u0027s life; and she had been unable to understand the scruples of her husband and daughter on the subject. It was only, indeed, at their urgent entreaty that she had given way on this point. \"I call it monstrous, Frances,\" she said, almost angrily. \"Of course the young man will expect something more substantial than words. It is only natural that we should reward him for preserving your life, and it would be a crime if we didn\u0027t do so. Of course, he didn\u0027t do it for money at the time, but it is absurd to suppose that a young carpenter like this, working his way out on board a ship, will object to receive a handsome present for such a service as this. Our feelings have a right to be considered, as well as his; and a nice thing it will be, for people to say that Ralph Hudson and his wife were so stingy, and ungrateful, that they did nothing for the lad who had saved their daughter\u0027s life.\" \"There is no fear of their saying that, mother. Everyone in the colony knows that there are no more open-handed people in New South Wales than you and my father. Besides, I do not say that we are to do nothing for him. On the contrary, I agree with you that it would be wrong, indeed, if we did not. I only say, please don\u0027t let there be a word said about reward, now. Let us thank him as one would thank a gentleman, who had done us a great service.\" \"Of course, I will do as your father wishes, Frances, but I call it nonsense. If he were a gentleman it would, of course, be different; but he is a young carpenter and, though you won\u0027t see it, that seems to me to make all the difference.\" \"From what I have seen of him, mother,\" Frances persisted, \"I am sure that he has the feelings of a gentleman; even if he is not one by birth, about which I am not certain. Anyhow, I am much obliged to you for letting me have my own way.\" \"You always do have your own way, Frances,\" her mother laughed. \"You get round your father first, and then you come to me, and what can I do against the two of you?\" Reuben briefly answered Miss Furley and Mrs. Hudson; and Mr. Hudson, feeling that the lad would rather get over the scene as soon as possible, slipped his arm though his and said: \"Now, Reuben, you must just come up for a minute on the poop. The other passengers are all waiting to shake you by the hand, and they would not forgive me if I were to let you run off, as I know you are wanting to do, without a word.\" Accordingly Reuben was taken up to the poop, where the passengers all shook hands with him, and congratulated him upon his courage. \"Now, I suppose I can go, sir,\" he said, with a smile to Mr. Hudson, when this was over. \"Yes, you can go now,\" Mr. Hudson laughed. \"Most young fellows at your age would be glad of an opportunity for figuring as a hero, but you talk as if it was one of the most painful businesses imaginable.\" \"Anyhow, I am glad it\u0027s over, Mr. Hudson, I can assure you; and now, I think I will turn in again. Considering what a night I had, I feel wonderfully sleepy.\" It was not until the sun was setting that Reuben appeared again on deck. Shortly after he did so, Captain Wilson strolled up to the place where he was standing. \"I wish, Reuben,\" he said, after a few remarks on other subjects, \"that you would tell me a little more about yourself. You understand that I do not ask from mere inquisitiveness; but after what has happened, you see, we seem to have got into close relationship with each other; and if I knew more about you, I could the easier see in what way I could most really be useful to you, out there. Are you what you appear to be?\" \"I am, indeed,\" Reuben replied, with a smile. \"My history is a very simple one. My father was a miller with a good business and, up to the age of ten, it did not appear that I should ever be working as a craftsman for my living. Unhappily, at that time my father slipped, one night, into the mill pond and was drowned; and when his affairs came to be wound up, it was found that he had speculated disastrously in wheat; and that, after paying all claims, there was nothing left. \"My mother took a little village shop, and I went to the village school. At first, I think I did not work very hard; but fortunately there was a change in masters, and the new one turned out one of the best friends a boy ever had. He pushed me on greatly and, when I was apprenticed to a mill wright, he urged me to continue my education by working of an evening. I stuck to it hard, and with his help learned, therefore, a good deal more than was usual, in my station of life. My mother was always particular about my speaking and, what with that and the books, I suppose I talk better than they generally do.\" \"And is your mother alive?\" \"Yes, sir.\" \"But how came you to think of emigrating, at your age; when indeed, you cannot have served out your full time?\" \"That, sir,\" Reuben said gravely, \"I cannot tell you. Some day, perhaps, if you care to know, I may bring myself to do so. I may say that it was a serious matter, but that I was really in no way to blame, whatever people may think. My conscience is absolutely clear, and yet I would rather that the story, which I left England to escape, should not be known to anyone.\" \"I do not seek to know further, Reuben. I think I know enough of you to be perfectly sure that you would do nothing that was wrong, and I am perfectly willing to take your word in the matter. However, I am glad that you have told me as much as you have. Your early rearing, your mother\u0027s care, and the education you have had, perfectly account for what seemed strange about you before. You have no objection, I hope, to my repeating your story to Mr. Hudson, who is as much interested in you as I am. \"And now another thing. I know that it is painful, to him, that one to whom he is so indebted should be forward here in the forecastle, instead of being in the cabin. He was afraid of hurting your feelings, by speaking to you about it; but I know that it would be a great relief and pleasure, to him and Mrs. Hudson, if you would allow them to make an arrangement with the captain that, for the remainder of the voyage, you should be a passenger.\" \"I am much obliged to them,\" Reuben said quietly; \"but I could not think of accepting such an offer. I am working my way out independently, sir, and I owe no one anything. I am really enjoying the passage, and so far there has been no hardship worth speaking of. Even putting aside the fact that I should not like to accept an obligation which would, to most people, look like a payment for the service I was fortunate enough to be able to render to Mr. Hudson, I should feel out of my element. I am very comfortable, and get on very well with the men; while in the cabin I should feel strange, and out of place.\" \"I don\u0027t think you would seem out of place anywhere, Reuben. No one, from your manner and conversation, would judge you to be otherwise than a gentleman by birth; while there are several of the passengers, aft, whose talk and methods of expression are by no means up to the level of yours.\" \"I should feel uncomfortable myself,\" Reuben said, \"even if I didn\u0027t make other people uncomfortable. So I think that, with all gratitude for the offer, I would very much rather remain as I am. Accustomed as I have been to hard work, during my apprenticeship, the life here appears to be exceedingly easy.\" \"Then we will say no more about it,\" Captain Wilson said. \"It would have been a pleasure, both to me and the Hudsons, to have you aft, and I am sure you would be well received by all the passengers. However, as you think you would not be comfortable, we will let the matter drop. \"However, as to your work in the colony, we must have a say in that; and I hope that, when I thoroughly understand your wishes, we shall be able to help you forward there.\" \"For that I shall be extremely obliged, sir. It would be a great thing, indeed, for anyone on landing to have gentlemen ready to assist him, and push him forward. This is so at home, and is of course still more the case in a strange country. I am very anxious to get on, and am ready to work my hardest, to deserve any kindness that may be shown me.\" \"Well, we shall have plenty of time to think it over before we arrive. \"I fancy,\" Captain Wilson went on, looking upwards at the sky, \"that our wonderful run of good luck, with regard to the weather, is likely to end shortly, and that we are in for a gale.\" \"Do you think so, sir?\" \"I do, indeed; and if we do get a gale, it is likely to be a serious one. The Cape, you know, was much feared for its terrible storms by the Portuguese, and it has kept up its reputation ever since. I think it is going to give us a taste of its quality.\"","sourceLink":"http://novel.tingroom.com/duanpian/3167/86890.html","bookId":867,"book":{"id":867,"title":"A Final Reckoning","description":"简介： In this tale I have left the battlefields of history, and have written a story of adventure in Australia, in the early days when the bush rangers and the natives constituted a real and formidable danger to the settlers. I have done this, not with the...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3167","creation":"Aug 1, 2019 12:23:39 AM","modification":"Aug 1, 2019 12:23:39 AM"}}
