{"id":18798,"no":14,"title":"XIV THE NEWS REACHES THE PYRENEES","content":"Pau, in August, being what no man could be expected to stand, Duplessis and his friend Lord Bramleigh went into Spain, and lounged at San Sebastian. Here on a blazing noon of mid-September, as they were breakfasting at leisure, a budget of letters was delivered. Lord Bramleigh, cheerful, wholesome, and round-faced, chirped over his, according to his wont. He read most of them aloud, with comments. “Old Gosperton’s shoot—will I go? I’ll see him damned. Why should I go and see old Gosperton shoot beaters? Not if I know it. Who’s this? Mary St. Chad, by the Lord! Now what does she want? . . . ‘I suppose you know that Bob Longford is . . .’ I’ll be shot if I know anything of the sort. I know he wants to all right; but you can’t marry a chap’s wife—at least I don’t think you can. . . . Oh, sorry! Fellow’s dead. . . . I say, Tristram, do you hear that? Old Bland-Mainways is dead, and Bob Longford’s married his relic—married her in a week, my boy. What do you say to that? You marry a man’s remains almost as soon as he’s remains himself. Pretty manners, what? . . .” Duplessis took no heed; the babbler ran on. . . . “This is my mater—wonder what she’s got to say? I rather funk the Dowager. . . . Hulloa! By Gad, that’s rum. I say, Duplessis, did you know a chap called Senhouse at Cambridge? Pembroke, was he? Or King’s? King’s, I think . . . it was King’s. Did you know him? Jack Senhouse—John Senhouse—rum chap.” “Eh? Senhouse? Oh, yes, I knew him. Used to see him about.” Duplessis resumed his letters; one, especially, made him frown—then stare out of the window. He read others but returned to that. Lord Bramleigh went on. “I want to tell you about this chap Senhouse. Of course, I never knew him at the Varsity—ages before me, he was. Good footer—player—ran with the beagles—ran like the devil; rowed a bit, painted a bit, sang a damned good song: Jack Senhouse. Well, he’s mad. Rich chap—at least, his father was rich—alderman somewhere, I b’lieve—say, Birmingham . . . one of those sort of places. Well, Jack Senhouse chucked all that—took to painting, scribbling, God knows what. His governor gets cross—sends him round the world on the chance he’ll settle down by’n by. Not he! Gets up to all sorts of unlawful games—cuts the ship and starts off on his own across Morocco; gets hung up at Fez—row with a Shereef about his wife or wives. Foreign Office has to get to work—makes it all right. Senhouse goes? Not he. Stays there all the same—to learn the language, I’ll ask you. Language and plants. He collects plants in the Atlas. So he goes on. Then he gets back home. ‘Hope you’ll settle down to the office, my boy,’ says his governor. ‘No, thank ye,’ says Jack, and doesn’t. He was off again on the tramp somewhere—turns up in Russia—if Warsaw’s in Russia—anyhow he turns up where Warsaw is—talking to the Poles about Revolution. Still collects plants. They put him over the frontier. He goes to Siberia after plants and politics. More rows. Well, anyhow, he came back a year ago, and said he was a tinker. He’d learned tinkerin’ somewhere round, sawderin’ and all that—and I’m damned if he didn’t set up a cart and horse and go about with a tent. He paints, he scribbles, he tinkers, he sawders—just as he dam’ pleases. And he turns England into a garden, and plants his plants. He’s got plants out all over the country. I tell you—the rummiest chap. Up in the Lakes somewhere he’s got a lot—growin’ wild, free and easy—says he don’t want hedges round his things. ‘Let ’em go as they please,’ he says. So he turns the Land’s End into a rockery and stuffs the cracks with things from the Alps. He’s made me promise him things from the Pyrenees, confound him—you’ll have to help me with ’em. And irises on Dartmoor—from the Caucasus! And peonies growin’ wild in South Wales—oh, he’s mad! You never saw such a chap. And so dam’ reasonable about it. I like the chap. He’s all right, you know. He’s been turned out of every village in England pretty well, ’cause he will talk and will camp out, and plant his plants in other men’s land. I met him once bein’ kicked out of Dicky Clavering’s place—regular procession—and old Jack sittin’ up in his cart talkin’ to the policeman like an old friend. Admirin’ crowd, of course—the gels all love him, he’s so devilish agreeable, is Jack. I tell you, he learnt more than one sort of sawderin’. And as for his flowers—well, you know there’s a language of ’em. Well, now, what do you think? I’ve heard from the Dowager, and I’ll be shot if she hasn’t just turned old Jack out of my place! Found him campin’ in the park, with one of the maids boilin’ his kettle, and another cuttin’ bread and butter for him. Plantin’ peonies he was—in my park! Dam’ funny business; but the end’s funnier still. The Dowager, out driving, comes home—sees Master Jack waiting for his tea. Stops the carriage—sends the footman to order him off. Jack says he’ll go after tea. This won’t suit the Dowager by any means—so there’s a row. Jack comes up to explain; makes himself so infernally agreeable that I’ll be jiggered if the Dowager don’t ask him to dinner, and up he turns in evenin’ togs, just like you or me. After dinner—‘Good-night, my lady,’ says Jack. ‘I must be off early, as I’ve some saucepan bottoms waiting for me—and I’ve promised ’em for to-morrow sharp’—says Jack. Now—I say, I don’t believe you’ve heard a word of all this.” Duplessis, I think, had not. He had been frowning at the glare outside, biting his cheek; in his hand was a crumpled-up letter. “Look here, Bramleigh, I must get out of this,” he said. “I want to go home.” Lord Bramleigh, never to be surprised, emptied his tumbler. Then he asked, “What’s up? No trouble, I hope?” He had a gloomy stare for his first answer, and for second—“No, I don’t say that. I don’t know. That’s why I am off—to see.” A man’s pleasure is a matter of course to your Bramleighs: the moral and social order must accommodate itself to that. “That’s all right,” said Lord Bramleigh, therefore. “When do you go? To-morrow?” “I go this evening.” The effect of this was to raise Lord Bramleigh’s scalp a shade higher. “We swore we’d go to Madame Sop’s to-night, you know.” Madame Sop was a Madame Sopwith, a lady of uncertain age and Oriental appearance, who gave card-parties. Duplessis said, “You must make my excuses—if she wants ’em. I’m going.” “A woman, of course,” said Bramleigh, tapping a cigarette—but had no answer. Duplessis caught the Sun express, and, travelling straight through, reached Misperton Brand in less than two days. On the afternoon of the third day he was at the door of the little house, Heath View, in Blackheath. The door was open, and within the frame of it stood a tall young woman with hair elaborately puffed over the ears and a complexion heightened by excitement. “Good-afternoon,” says Duplessis. “Miss Middleham at home?” “Yes,” says Jinny, “she is. Will you come in?” He followed her into the parlour and was offered a chair. “Thanks very much,” he said, but did not take it. He stood by the window, and Jinny Middleham stood by the door. Presently Jinny said, “I am Miss Middleham, you know. Or perhaps you didn’t know it.” Duplessis stared, then recovered. “I beg your pardon. No, I didn’t grasp that. But you’re not my Miss Middleham.” “I didn’t know that you had one,” said Jinny. “It’s the first I’ve heard of it.” He laughed. “You’ll think me very rude in a minute; but I’ll explain to you. It was your sister I wanted to see. She is—a friend of mine. My name is Duplessis. She may have told you.” Jinny was as stiff as a poker. “I have heard my sister speak of you, certainly. I understood that you were—an acquaintance.” Duplessis nodded easily. “Put it at that. I suppose I may see her?” “She’s away,” said Jinny. “She’s staying in London—with the Honourable Mrs. Germain.” He began to bite his cheek. “Can you give me Mrs. Germain’s address? It’s not Hill-street, I suppose?” Jinny was very happy just now. “I suppose that a letter to Mrs. Germain at Misperton would find her. You are related to her, I believe?” “My dear Miss Middleham,” said Duplessis candidly, “let’s keep to the point. It seems to me that you don’t want me to see your sister.” “Oh,” says Jinny, “it don’t matter at all to me.” He knit his brows. “Then you mean——?” “I mean,” said Jinny, “that my sister is going to be married to Mr. Germain. That’s what it comes to.” Duplessis bowed. “I see. Thank you very much. Than I think, if you’ll allow me—” He bowed again and went towards the door. The scene was to be over. Jinny put her hand upon the latch. “Where are you going?” she said, very short of breath. There was a thrill yet to be got out of this. What was sport to her mortified him to death. “Really, I don’t know that I need trouble you any more,” he said. “You will give my kind regards to your sister, I hope.” But Jinny kept the door-handle in possession. “Mr. Duplessis,” she said, “I ought to tell you that my sister would rather be excused from seeing you. At least, she says so. She said so to me. You best know why that may be.” He ill concealed his mortification. “We won’t talk of your sister’s affairs, I think. I am happy to have made your acquaintance——” Jinny tossed her head up. “My acquaintance, as you call it, is for them that want it. My sister’s is her own business. I tell you fairly, Mr. Duplessis, that she may be very unhappy.” He flashed her a savage look. “Good Heavens, I believe that. Why, the thing’s monstrous! You might as well marry her to a nunnery. The fellow’s frozen—stark cold.” Jinny steadfastly regarded him. “You know very well that you never meant to marry her,” she said. He grew cold instantly. “Once for all, I must tell you that I decline to discuss your sister’s affairs with any one but herself. And since you tell me that I am not to see her, I will ask you to let me bid you good-afternoon. I am very sorry to have given you so much trouble.” It was over; there was but one treatment for such a cavalier in Jinny’s code of manners. She opened the door wide. “Good-afternoon,” she said. He bowed and went out with no more ceremony. He felt spotted, and was furious that such a squalid drama should have engaged him. A fluffed shop-girl—and Tristram Duplessis! Filthy, filthy business! But he went directly to Hill-street—whither a telegram had preceded him, terse and significant according to Jinny’s sense of the theatre. “Look out,” it said. That sent the colour flying from Mary’s lips, and lighted panic in her eyes. She crushed it into a ball and dropped it; then she went directly to Mrs. James and asked leave to go home for a few days. She shook as she spoke. She said she was feeling very tired and unlike herself; she wanted her mother, she said simply, and as her lip quivered at the pathetic sound of that, her eyes also filled. Mrs. James, not an unkind woman by any means, was really sympathetic. “My dear child, I quite understand. Go home, of course, and get strong and well. Although you may hardly believe me, I care very much for your happiness—and John would wish it. If he could have been here I know he would have taken you. You shall have the carriage. Now, when would you like to——?” “At once, please, Mrs. Germain—at once.” Mrs. Germain rang the bell and ordered the carriage. Mary could hardly wait for it; she spent the lagging moments pacing her room, and before it was fairly at the door she was on the doorstep. She took no luggage. Crouched in one corner of the hatefully dawdling thing, she stared quivering out of the window. At the corner of the square by Lansdowne House she gasped and cowered. A cab passed her, in which sat, scowling and great, Tristram Duplessis, his arms folded over the apron. Did he—? No, no, thank God, he had not seen her. She was safe in the ladies’ waiting-room; but the traverse of the platform was full of peril. Not until the train moved did she feel herself safe. She hungered for Jinny’s arms as never in her life before. The brave, the capable, the dauntless Jinny—Mercy of Heaven, to have given her such a sister in whom to confide! But Mrs. James—the sweeping eye having lighted upon the ball of paper—Mrs. James wrote to her brother-in-law that night:— “My dear John,—In case you may be hurrying back to town, I think I should tell you that Mary has gone to her people for a few days; she will write me the day and hour of her return. There is nothing serious; but she complained of being overtired—not to be wondered at. Even young ladies may find the pleasures of shopping a tax. It is possible, I think, that family matters, of which I know nothing—as I am not in her confidence—may have called her home. She left this telegram here. ‘Blackheath’ is on the stamp, you will notice. Mary spoke of her mother to me when she said that she must go, and seemed unhappy. I put this down to her being overwrought—and no doubt you will hear from her by the post which brings you this. Most of my work is done here, I am happy to say. I hope you will be pleased with Mary’s things. I must say that she looks charming in her wedding gown. But Ninon may be trusted for style. James is getting restive without me. Soames is no doubt at his tricks again. I shall be glad to be at my post. Your affecte. sister, “Constantia Germain.” “P.S.—Tristram is back from San Sebastian. I had a visit from him this afternoon, some three minutes after Mary left. He asked after her. You know that they were old acquaintances. Lord Bramleigh remains in Spain. He seems in no hurry to greet his bride. She is staying with the Gospertons at Brenchmore. They expect him there from day to day.” Next day Mr. Germain presented himself in Hill-street, nothing varied in his deliberate urbanity. He had not heard from Mary, he said, in reply to a question; there had been no time for a letter to reach Southover, and the absence of a telegram was reassuring. He intended to go to Blackheath in the course of the afternoon. No doubt she had overtired herself. He applied himself to other topics and said nothing of Duplessis nor of the Blackheath message until luncheon was over. Then, as Mrs. James went by him through the door which he held open for her, he said, “I had forgotten: you have Tristram back? If he should happen to call, pray tell him that I should be glad to see him if he could spare me a moment.” Mrs. James stopped in her rustling career. “But I don’t think it at all likely he will call—again,” she said. “No? Very well. Perhaps I shall encounter him somewhere. Or I could write.” “Quite so,” said Mrs. James. “It is easy to write.” Then she shimmered away up the stairs. He went into the library, and, after some pacing of the floor, sat down at his desk, wrote, signed, and sealed a paper. He rang the bell. “I wish you and Gutteridge to witness a paper for me, Jennings,” he said to the man. “Fetch him in here, please.” The two functionaries signed the sheet as he directed them. “Sign there, if you please, Jennings. And Gutteridge below your name. . . . That will do. Thank you.” He put the paper and a crumpled telegram together in a long envelope, sealed it, and wrote shortly on the outside. He locked it in his desk, then resumed his pacing of the room. As he walked his lips moved to frame words—“Impossible! Purity’s self. . . Her eyes ray innocence. . . .” But he knew Tristram, and could not get his leisurely image away. And Tristram had been much at Misperton; and had a way of—his lips moved again—“My darling from the lions! From the power of the dog!” He went back to his desk, took out the envelope he had sealed, and would have torn it across—but did not. Instead, he put it in his breast-pocket, and left the house. In the little parlour of Heath View he stood presently awaiting her. Jinny had seemed relieved to see him when she opened the door. Mary had been lying down, she said, and would come when she was tidy. He smiled and said he would wait. He was noticeably white and lined in the face. She came into the room presently, flushed and very bright-eyed. He thought that she stood there like a mouse sensing the air for alarms, prompt to dart at a pinfall. His heart beat to see the youth and charm of her; his pain was swallowed up in longing for his treasured bliss. He almost sobbed as he held out his arms. “Mary—my child—my love;—” and when she ran in and clung to him with all her force, he clasped her in a frenzy. Whatever darksome fears his honest mind may have harboured, whatever beasts he may have fought, there were none after such a greeting as this. He poured out his love like water upon her, kissed her wet cheeks and shining eyes, and with, “There, my little lamb, there, my pretty one, be at rest, be at peace with me,” he soothed her, and felt the panic of her heart to die down. Then, sitting, he drew her to his knees and let her lie awhile with her head on his shoulder. She whispered in his ear, “Oh, it was sweet of you to come! I wanted you dreadfully—you don’t know.” “No, my precious one, I don’t indeed. But I am well content that you should have needed me. I pray that you always will, and that I may never fail you.” She lifted her head back to look at him; she smiled like an April day. “You fail me! Oh, no, you’ll never do that.” And of her own accord she kissed him. The good man simply adored her. “Now will you tell me what upset you so much?” he asked her, but she shook her head roguishly and said that she didn’t know. “It was my stupidity—I was frightened—suddenly frightened of all the grandeur—the great rooms, the butler and footmen—the people in carriages who called—” She stopped here, her large eyes full upon his own. She breathed very fast. Then she said, “That’s partly the truth—but there’s more.” He could not bear it. He could not face what she had to say. He knew that he was a coward, but he could not; despised himself, but could not. He clasped her close. “Tell me nothing more, darling child. You will reproach yourself, and I cannot bear it.” She struggled to be free. “Oh, listen, listen to me, please!” He kissed her with passion. “My life is yours; would you rob me of it? I cannot listen to you——” She gave over, and lay with hidden face until she dared to look up again. Then, when both were calmer, she showed her serious face. Playing with his eyeglasses, she did relieve her mind of one of her fears. “Do you know,” she said, “unless you are with me—always—I am sure that I shall do something mad, or bad. Run away from it all—hide myself.” She nodded her head sadly. “Yes, I’m quite sure.” He could afford to look at the future, not the past. “Why, then, my love, I shall be with you always—night and day. Do you hear me? Night and day! How will you like that?” She hung her head, peered up at him for a second, and hung her head again. He could do nothing but kiss her after that. He stayed to tea, which she prepared with her own quick hands. She and Jinny entertained him, and he had never liked that pronounced young woman so well. It was her birthday, Jinny’s birthday, he was told. “A few days only from mine,” he said, with a fine smile to Mary, which made her understand him, and blush. “Twenty-nine to-day,” said Jinny candidly, cutting cake. “This is my cake, Mr. Germain. I suppose you’ll give Mary a better one.” “I shall give her the best I can, Miss Jinny, you may be sure,” he said heartily, and she nodded to him her confidence in his love. He treated her with grave politeness, which lost all its distance by the evident interest he took in her affairs. She gave herself no airs or graces, was neither pert nor sniffing for offence, nor airy, nor merely odious. Germain’s own manners were so fine, so based upon candour and honesty that one could not fail to respond. Even Jinny Middleham forgot herself; and as for Mary, she sat quietly on the watch, really happy, really at ease about the dread future—and whatever terrors she may have owed to Tristram she had none now. Yet she was to have one more chance. At parting she clung to him again, and begged him not to leave her for long. “I’m safe with you—I feel that. Oh, how did you make me like you?” “By liking you myself, I expect, little witch.” “I’m not a witch. I’m a dunce, and you know that I am. But listen——” “I listen, dearest.” “I am going to be the best girl in the world. I’m going to do everything that you tell me—always.” “Beloved, I am sure.” “Wait. You haven’t forgotten what you promised me?” “What was that?” “You have forgotten! Oh, but you must never forget it. It is important—to me.” “Tell me again.” “It was—always to ask me before you believe anything against me. That was it—and you promised.” He took her face between his hands and looked long into her eyes. “My dearest heart,” he said, “I’ll promise you better. Not only shall I never believe anything against you—but I shall never even ask you of the fact. Never, never.” She searched his face—her eyes wandered over it, doubting, judging, considering. “I had rather you asked me,” she told him; but his answer was to kiss her lips. She went with him to the garden gate, seemed most unwilling that he should go. Farewells spoken, her ring-hand kissed, she stood watching him down the terrace, and then, as he never looked back, walked slowly into the house and shut the door. Had she stayed a moment longer she would have seen an encounter he had at the corner where you turn up for the station. Perhaps it was better as it was; I don’t know. He had paused there to hail a fly with his umbrella, and having faced round towards his way, saw Duplessis advancing towards him. He felt himself turn cold and sick. The fly drew up. “Wait for me where you are,” he said, and went to meet the young man. Duplessis saw him on a sudden; his eyes, blue by nature, grew steely and intensely narrow. “Good-evening, Tristram,” said Germain. “Constantia told me of your return.” Duplessis dug the pavement with his stick. “Did she? Well, it is true, you see.” “I do see. You are going to pay Mary a visit, I suppose. She’s not very well, I’m sorry to say—a little overtired. Otherwise, I am sure she would have been delighted.” Duplessis made no reply, and the other continued: “I told Constantia that I hoped to see you—to tell you a small piece of news. I am about to be married again. Mary has been so kind as to confide her future happiness into my hands. Perhaps you won’t misunderstand me if I say that some little fraction of that happiness depends upon her not seeing you for the moment. When she is rested, we may hope—The wedding will naturally be a very quiet one. Her people wish it, and my taste agrees with theirs. Otherwise we should have liked to have you among our guests. We promise ourselves the pleasure of seeing you at Southover in the near future. I think the place will please you. You must give an account of my pheasants in December.” “That’s very good of you, Germain,” said Duplessis, looking him full in the face. Mr. Germain turned to his waiting fly. “Have you other engagements in Blackheath?” “None,” said Duplessis. “No? Then perhaps I can offer you a seat in my carriage.” “Thanks,” said Duplessis, “I’m walking;” nodded, and went forward, the way of the heath. “The station,” said Mr. Germain. He could thank God, at least, that she had not meant to deceive him; he could thank God, at least, that she had done with the past. But he had received a mortal wound, and after his manner concealed it. His lovely image was soiled; the glass of his life to come dimmed already. He saw nothing more of Mary until the wedding day, though he wrote to her in his usual fashion and on his usual days. “My dear child,” and “Yours with sincere affection.” She did not guess that anything was amiss, could not know what they had cost him to write them twice a week. His brother and sister-in-law noticed his depression. Mrs. James indeed was tempted to believe that, at the eleventh hour—but the Rector knew him better. All his forces were now to put heart in the bridegroom. He spoke much of Mary.","sourceLink":"http://novel.tingroom.com/duanpian/3328/91120.html","bookId":381,"book":{"id":381,"title":"Halfway House","description":"简介： It was when Mr. John Germain, a gentleman of fifty, and of fine landed estate in Berkshead of his family, Deputy-Lieutenant, Chairman of Quarter Sessions, and I dont know what notwas paying one of his yearly visits to his brother James, who was Recto...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3328","creation":"Aug 1, 2019 12:18:41 AM","modification":"Aug 1, 2019 12:18:41 AM"}}
