{"id":92314,"no":12,"title":"Page 12","content":"\\n\\n “A book, huh?” Demi asked, and Jacinda nodded.\\n\\n “I’m known for writing about the places that most consider no more than dreams. The pyramids of Kyro, the native villages of Almanica, the daimon cabarets of Paris, the hidden jungles of Africa. But I’ve never seen a single book about the truth behind a caravan.”\\n\\n “And Criminy knows? He doesn’t mind?” Cherie glanced around nervously.\\n\\n Demi smirked. “If she’s here, he knows. And he probably loves it. Crim’s got an ego the size of a Mack truck.”\\n\\n “A what?” Jacinda asked, as it was rare that anyone mentioned anything she hadn’t heard of at least once.\\n\\n Demi, blushed, her eyebrows drawn down as she looked away, annoyed. “Just something from where I’m from.”\\n\\n “And where’s that?” Jacinda’s pen was poised over a fresh sheet of paper, and she felt the familiar thrill of the blank page, the pause before the story started.\\n\\n “Demi, don’t,” Cherie said, but Demi just shook her head.\\n\\n “Almanica. But I won’t talk about that.”\\n\\n Jacinda knew well enough how to dance around forbidden topics and still get the pieces she needed to enthrall an audience. And having been there herself for more than a year, she also knew well enough that Demi wasn’t actually from Almanica.\\n\\n “Tell me about Sangland, then. How long have you been here, and how did you get into contortion?”\\n\\n Demi sighed and drank the last of the blood from her cup with a determined air. “One question, first. Can you make me famous?”\\n\\n Jacinda didn’t want to let the girl down; she looked so hungry and earnest and, suddenly, very innocent. “My books do fairly well, and I believe the city folk would be riveted by the tales of the caravan. But tell me, aren’t you already a star? I’ve seen the crowd gathered around your act, and I can tell you’re very popular. Every girl in London dreams of what you have, this freedom and applause.”\\n\\n “It’s not enough. I want more. I want to be famous.”\\n\\n Poor Cherie looked as if she was about to collapse in on herself, her fair head ducked down between narrow shoulders and her face in her hands, although whether it was in embarrassment, worry, or fear, Jacinda couldn’t tell. But Demi had her head high, her eyes gazing out the window and past the moors to the sky with near-feral determination.\\n\\n “Being in a book is a good start, darling. I’ll do what I can.”\\n\\n Demi took a deep breath and focused. “My name is Demi Ward. I was attacked by bludbunnies, and Criminy Stain bludded me and pretty much adopted me, and when we were trying to think of some sort of work I could do to earn my way in the caravan, he suggested contortion. I was young enough and had a little acrobatic training, and Cherie was willing to teach me.” She looked at her friend fondly, and Cherie looked up and smiled. “We were instant best friends and have been performing together for five years. But that’s not really interesting, is it?”\\n\\n Jacinda shook her head, her pen scritching over the paper. “Think about what it would be like to be fifteen years old, living in a cramped, dark apartment in London. Most girls your age have never been outside the city walls. You almost died and were saved at the last moment by the most notorious and handsome magician in the country. They’d salivate to hear it.”\\n\\n Demi chuckled. “Never thought about it that way. I’ll try to make it sound juicy. Um. One time, the Magistrate raided the caravan with a bunch of Coppers and dogs, looking for Lady Letitia, and all the Bludmen ran away into the moors. But Cherie and I didn’t want to run far, so we hid in the lookout box on top of our wagon and watched. It was totally brutal. They pulled out the old costumer and carried her away tied to a bludmare’s rump. She beat three guys up with a sword hidden in her umbrella first.”\\n\\n “But what about you? Any exciting stories of your own?”\\n\\n Demi thought about it for a few moments, her face slowly falling. “I can’t think of a single freaking thing. I mean, I wake up, drink blood, perform, drink blood, and sleep. I don’t leave the caravan or go into the cities.” She swallowed hard and let her head fall to her chest. “I’m just as trapped as they are.”\\n\\n The interview was not going the way she had hoped, and when the dining-car door opened, Jacinda was grateful for a reason to look away from the girl’s tears. Marco didn’t pause as he stepped into the trailer, but he did tip his head just a shade to smirk at her.\\n\\n Demi saw it, too, and her voice took on a tinge of resentment. “I mean, there aren’t even any guys here. All the good ones get taken. And Criminy makes sure I never get to talk to anyone in the crowd.”\\n\\n “Don’t forget the daimon boys.” Jacinda winked.\\n\\n “And Luc is looking right at you,” Cherie began, tossing her hair and surreptitiously glancing to the other end of the wagon, where a lanky, good-looking boy with red skin joked with Marco by the drink dispenser.\\n\\n Demi’s eyes flicked to Marco and Luc. “I don’t know. Daimons?”\\n\\n Jacinda leaned close with a conspiratorial grin. “I had a daimon lover in Paris. His name was Gael, and he was a dealer in rare books and antiquities. He looked quite calm until the spectacles came off. And then, ooh la la. Highly recommended. Since they feed off emotions, let’s just say they’re . . . highly motivated to keep you happy.”\\n\\n Demi’s lips twisted up as she watched the boy laugh and turn around, tail waving. He caught her eye and winked with a daredevil smile, and Cherie giggled and hid her face.\\n\\n “Hmm. Maybe you’re right. I hadn’t really considered it before, but I guess a Bludman being prejudiced against daimons is just as bad as Pinkies being prejudiced against me.”\\n\\n “And he’ll speak Franchian, too. Such a sensual language,” Jacinda added.\\n\\n Cherie giggled again, and when the daimon boy passed by them with a backward glance, Demi met it and nodded, just a little. Good for her. Jacinda loved an adventure, and the thought that the bright, pretty girl could be depressed in the caravan hurt the journalist’s heart. It would do the girl good to have a fling with a daimon, one as giving and energetic as Gael had been. Just thinking about it brought her thoughts back to Marco and the night before, and she watched him contemplatively as he loaded up his tray.\\n\\n Even though his back was to her, she felt as if he knew she was watching, as if he could sense her eyes brushing over his shoulders, the small of his back where his shirt tucked into his breeches, a place she’d barely begun to explore. What else might have happened, had she kept her hands on the door last night? Damn the man! He was under her skin now, and she craved what she’d barely tasted. But she wasn’t about to admit it. She looked down at her notebook, where she had doodled the exact curve of where his back met his ass when she was supposed to be sketching Demi’s face.\\n\\n Turning to a new page, she asked, “What about you, Cherie? Where are you from?”\\n\\n The girl blushed and looked down. “Oh, I’m from Freesia. We were once a great family, but the tsarina argued with my mother, and we lost everything. Six of us lived in a wagon smaller than the one I share with Demi, all pulled by a pair of gray dappled bludmares named Snow and Ice. I fought a bludbear once . . .”\\n\\n As Cherie talked, Jacinda made the appropriate noises of surprise and assent, scribbling down the details of a life that would read like a fairy tale to the city girls. Festivals, balls, bludbears, wild unicorns, and bloodthirsty peacocks. To Cherie and Demi, it was boring, but to everyone else in the world, it was a beautiful dream.\\n\\n Although Jacinda’s mind was halfway on the story and aware of how valuable the tale would be, she couldn’t stop glancing at Marco in between words. It slowly dawned on her that he was purposefully taking his time, giving her ideal views of his physique as he collected food and talked to Criminy by the cauldron of vials. His mouth was quirked up as if he knew his very existence teased her, as if he was more than pleased about it. Therefore, she wasn’t surprised when he slid into the booth directly behind her. He leaned back, letting his hair brush her neck, and she went still like a dog on point, positive she could feel the warmth of his body through the wood between their backs.\\n\\n It was hard to respond appropriately to Cherie with him so close, and she wondered that the girl couldn’t feel the tension, the hot and cold running through her body. But no, Cherie just prattled, innocent as the girl she seemed. Demi stared contemplatively at Luc where he sat with his slightly less handsome brother at a far booth, sipping a daimon drink and staring right back. When Cherie reached what seemed like a stopping point, Jacinda closed her notebook with a satisfied nod.\\n\\n “Thank you so much for sharing your stories with me, both of you. I may not be able to crack the toughest nut in the caravan, but this is just as satisfying. It’ll be good to keep my hands busy with something worthwhile instead of sitting around, twiddling my thumbs, and doing nothing.”\\n\\n Behind her, Marco stifled a chuckle and cleared his throat. Demi and Cherie shared a look of bemused doubt.\\n\\n “Um, you’re welcome?” Demi said. “And you should definitely talk to Veruca and Eblick. They don’t talk much, but I think they’ve got pretty good origin stories.”\\n\\n With a nod, the contortionists stood, and Jacinda rose to let Cherie out of the booth, purposefully stepping back just enough to allow her bustle to brush Marco’s sleeve. As Demi and Cherie left to deposit their bloody teacups in the washing cube, Jacinda was sure she felt a hand slip into the pocket of her skirt, but it was so stealthy and quick that she might have imagined it. She paused a moment, rolling up her notebook, but the sensation didn’t come again. Although she had planned on visiting with more of the carnivalleros this morning for research purposes, she changed plans and headed outside without a word or a look for the man behind her.\\n\\n In her pocket, she found a bit of parchment hastily scribbled with pencil.\\n\\n Find me later. I have something to keep your hands busy. M.\\n\\n She smiled to herself, fingering the paper.\\n\\n Oh, I bet you do, Marco. I bet you do. \\n\\n","sourceLink":"https://allnovel.net/the-damsel-and-the-daggerman-blud-3/page-12.html","bookId":1603,"book":{"id":1603,"title":"The Damsel and the Daggerman (Blud #3)","description":"Storyline: The Damsel and the Daggerman (Blud #2.5) \\n Bad boy knife-thrower Marco Taresque is the hottest and most dangerous performer in the caravan. He keeps to himself until a pesky female journalist arrives, anxious to interview him about his checkered past—his last assistant disappeared under mysterious and bloody circumstances, earning him the nickname “The Deadly Daggerman.” \\n Unsinkable journalist and adventurer Jacinda Harville doesn’t take no for an answer, and she’s determined to wear down Marco no matter how threatening—or incredibly desirable—he might appear. He agrees to an interview—but only if she’ll let him strap her to a spinning table and throw knives at her body. How can she say no? And how can she resist him when he leans close for a kiss that strikes her more sharply than any blade? It’s the first time she’s let a man get the better of her, and she’s determined it will be the last…\\n","cover":"https://allnovel.net/images/the-damsel-and-the-daggerman-blud-3.jpg","author":"Delilah S. Dawson","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-damsel-and-the-daggerman-blud-3.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:54:47 PM"}}
