{"id":92319,"no":17,"title":"Page 17","content":"\n She went silent and collapsed against him, and Marco fell bonelessly back onto the bed, taking her with him. Rolling off his body, she put her head to his chest and smiled at his slow, steady heartbeat.\n “Damn, woman,” was all he could say before closing his eyes and going completely limp, his booted feet still on the floor and his undone breeches flung open.\n “Damn, yourself.”\n He flinched, and she nuzzled closer. “Maybe I should just say ‘Wow’ and leave it at that.”\n “Wow, indeed.”\n He curled an arm around her shoulders and pulled her close, brushing her hair back from her temples. “If I’d known it would be that good, I might not have resisted for so long,” he said.\n “I had my suspicions.” She ran a hand over the dark hair fuzzing his chest. “But I always like it when I’m right.”\n .11.\n The afternoon passed with that sweet, slow discovery of things above the neck. He liked poetry and read well, and she curled on the bed happily while he paced in breeches and boots and wooed her with words. She found his violin case under the bed when she stubbed her toe and persuaded him to play a little for her. It was slow and mournful and made her think of looking up through pine boughs at the winter sky, just before the snow came. After delving into her girlhood, he unearthed that she had once sung opera, and clad in nothing but her skin, she sang a few rusty arias for him, for which he went still and wide-eyed and reverent, which gratified her.\n He kept an eye on the clock, and she felt a twinge of sadness when he rose to prepare for the night’s show. His breeches had been utterly ruined, and she watched appreciatively as he pulled off his boots and stockings to change into a new pair that fit just as well. For all their leisurely and time-consuming lovemaking, she hadn’t seen his body fully exposed before then. Jacinda lay back and watched him go through his ministrations as if he were a classical statue brought to life, all strong lines and ideal curves and masculine power balanced with beauty and just the right dusting of dark hair. Only the scars marred his perfection, and she felt a twinge of doubt. Had she just slept with a murderer? He’d given her his body but not his truth. Had he shared himself with Petra like this . . . before she disappeared?\n “You going to come watch me throw some knives, sweetness?”\n She jumped guiltily. Of course he wasn’t a murderer, no matter how dangerous he appeared, no matter what the carnivalleros whispered, no matter what some biased rumor rag printed. He was watching her in the mirror as he brushed his hair and tied on his bandanna, and her heart softened at the smile in his eyes. She reluctantly stood and stepped into the petticoats puddled on the floor. She’d been here for hours, naked and learning about the mysterious man she’d needed so badly to bed. But now . . .\n “I’ve seen the show. And I like the private show better. I’ll be in my conveyance, working.”\n His eyebrows went down. “Abandoning me already?”\n She stepped behind him, pressing her bare chest against his back and wrapping her arms around him. He was about half a foot taller than she, and on tiptoes, her chin fit just over his shoulder with a possessive intimacy that made her feel warm all over.\n “You have your work, and I have mine. I’m not some fawning girl who’s incomplete without a man and needs to follow you about, mooning like a fool. But I’ll be counting the moments until the caravan is closed for the night and you’re knocking on my door.”\n That seemed to satisfy him, and he turned his head to kiss her cheek. She went back to the pile of clothes, unlacing her corset so that it would fasten down the front again and then pulling the laces just enough for decency. The skirt billowed over her head, and the jacket covered her arms. Her legs felt naked and free without the stockings, but the matched pair was ruined now, thanks to his clumsy knife throw.\n “That’s twice you’ve missed,” she said, holding up the slithery gray silk to show the bloodstained slice where his knife had found her ankle. She’d totally forgotten about the wound, couldn’t even feel it anymore as she laced on her boots.\n “The first time was your fault. You dropped the card.”\n “And the second time?”\n He stepped close, fully costumed and ready for the show, all vestiges of vulnerability replaced by the raw power that had originally drawn her to him against her will. “The second time wasn’t an accident.”\n “You hit me on purpose?”\n He tangled his hand in her hair and pulled her close, kissing her hard and deep and reminding her how very easily he could make her insides quiver.\n “And look how nice it turned out.”\n “You sly dog. I can’t believe you cut me just to get me into your wagon. I would have followed you in here willingly.”\n “Followed me? Girl, you broke in once already! But I wanted it on my terms. I wanted you in my arms, not driving me before you like some idiot sheep. And I wanted to give you a reason to run, if you were looking for one. Getting involved with me . . . well, I’m dangerous. And I’m not a man who lets go of things easily.”\n “Like your past, for example?”\n A rueful sadness filled his violet eyes. “Don’t rush me, sweetness. A man can’t give up all his secrets at once.”\n “I just want to know—”\n “I’ll tell you. In time. I promise.”\n She sighed melodramatically and buttoned up her jacket. He watched her fingers, not blinking, his desire to see the jacket back on the ground all but palpable. “Fine. Then I’ll be waiting to screw it out of you in my conveyance after tonight’s show.”\n His eyes raked her as she twisted up her hair. “What’ll you be wearing?”\n She smiled, smug as a cat in cream. “Nothing but a smile.”\n Before he could kiss her, she turned and left, letting her hips swing. She didn’t look back, just shut the door behind her as she stepped down to the ground. Far away, she could hear the banks rumbling over the moors, packed with city people, their pockets filled with clinking vials and coins. The carnivalleros were all in the wagons, preparing, as Marco was, for the night’s show. Being seen by the audience before everything was perfect was considered a grand misstep, and Criminy himself was walking the perimeter with a copper monkey scampering at his side, checking that all was in place.\n The smug and knowing smile he gave her made her roll her eyes. What did she care if the ringmaster knew what she’d been at with the knife thrower?\n “Finding success in your endeavors, Mrs. Harville?” he asked, giving her a polite bow.\n “I’m getting what I need, yes.” She kept walking toward her conveyance, and he fell into step beside her, swinging the monkey up onto his shoulder.\n “You’re not distracting my daggerman, are you?”\n “As much as possible, yes.”\n “That would upset me, if not for my wife’s charming insistence that your continued presence is the only way I can keep him among us. It’s hard to find a good knife thrower, you know. Especially one with such a lively reputation. I hope you don’t plan on ruining it with the pesky truth.”\n “You’re just vexed that I’ve been chasing him instead of interviewing you for your chapter in the book.”\n The ringmaster threw his head back and laughed, a wild sound that suited him perfectly. “For a journalist, you certainly have an honest streak,” he said. “Now, go back to your conveyance and find some new stockings before the two-headed Bludmen smell what you’ve been up to and get hungry. It would be such a shame if you died before you immortalized me in prose.”\n “I don’t take orders from you.”\n “I’d just hate to see you get hurt before you can completely corrupt my daggerman.”\n “Marco’s a big boy. And I’m not one of your carnivalleros, you know.” She flounced away to hide her embarrassment.\n “Keep telling yourself that, pet,” he called with another mad laugh. “You’re practically his assistant, which means you’ll be asking me for wages soon.”\n A shiver ran up her spine at the word “assistant,” but when she turned back around to shout at him, the ringmaster had disappeared.\n “I’m no one’s assistant,” she muttered under her breath. “I’m a goddamn journalist.”\n She was beyond the caravan lights now, out among the wilder winds of the moors. A bludbunny darted out for her, and she kicked it away, wondering where Brutus had gotten off to. She’d left the metal dog on Marco’s doorstep, but she’d seen no sign of it since emerging and had forgotten to leave it with orders. It had malfunctioned before and was programmed to return to the homing beacon in her conveyance. Still, out here, without her guard or an escort, she felt ill at ease.\n The field between her conveyance and the warm lights of the caravan felt larger, wilder, and colder than it did in the daylight. Thunder grumbled menacingly, and Jacinda hurried faster, stumbling over a rogue bludbunny and almost falling into the waist-high grass. Back on her feet, she broke into a jog and didn’t look back until she stood on the steps of her conveyance, unlocking her door by gaslight with shaking hands.\n Gazing back down to the caravan that was beginning to feel like home, she shivered. Criminy was nowhere to be seen, and the carnivalleros were in place, waiting for the crowd that was moving down the moor in a frightened cluster of bright silks. No one looked toward the shadowy conveyance on the hill. And yet she felt eyes on her, danger hovering near, dogging her every step since she’d left Marco’s wagon.\n Perhaps she should have gone to watch Marco’s show, paid her copper to wander again among the glittering golden lights and laughter, where things felt safe. But no. Foolish fears had never stopped her before, and they wouldn’t now. She didn’t know if Criminy had been joking about the dangers of his pet Bludmen and the wild animals, if there was any real threat other than the same strangely oppressing darkness that hung always over the moors. \n","sourceLink":"https://allnovel.net/the-damsel-and-the-daggerman-blud-3/page-17.html","bookId":1603,"book":{"id":1603,"title":"The Damsel and the Daggerman (Blud #3)","description":"Storyline: \n The Damsel and the Daggerman (Blud #2.5) \n Bad boy knife-thrower Marco Taresque is the hottest and most dangerous performer in the caravan. He keeps to himself until a pesky female journalist arrives, anxious to interview him about his checkered past—his last assistant disappeared under mysterious and bloody circumstances, earning him the nickname “The Deadly Daggerman.” \n Unsinkable journalist and adventurer Jacinda Harville doesn’t take no for an answer, and she’s determined to wear down Marco no matter how threatening—or incredibly desirable—he might appear. He agrees to an interview—but only if she’ll let him strap her to a spinning table and throw knives at her body. How can she say no? And how can she resist him when he leans close for a kiss that strikes her more sharply than any blade? It’s the first time she’s let a man get the better of her, and she’s determined it will be the last…\n \n","cover":"https://allnovel.net/images/the-damsel-and-the-daggerman-blud-3.jpg","author":"Delilah S. Dawson","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-damsel-and-the-daggerman-blud-3.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:54:47 PM"}}
