{"id":68126,"no":21,"title":"Page 21","content":"“No, pink as in dusty rose.” Feeling almost giddy, Justine laughed and her mother joined in. It took Justine a moment to realize that her mother’s laughter sounded forced.\\n\\n She wanted to ask if anything was wrong, but didn’t. If her mother and Jack had quarreled, Justine had no intention of prying. Anything Olivia meant to share, she’d tell Justine without prodding.\\n\\n “I’m so tired,” Olivia said weakly, sipping her tea.\\n\\n “Do you want to go back to bed?”\\n\\n “Maybe I should. In a few minutes.” She finished her tea and reached for the white pot. It shook precariously in her hand.\\n\\n “Here, Mom.” Justine quickly took the teapot away from her. “Let me do that.” Her mother’s frail condition after the surgery worried her. She looked dreadful, something Justine hadn’t wanted to admit earlier. Her skin was flushed and she shifted uncomfortably in her chair.\\n\\n “Is your grandmother done with the recipes?” Olivia asked, diverting Justine’s interest.\\n\\n “Almost. Oh, Mom, you won’t believe what a fabulous job Grandma’s doing.”\\n\\n Olivia nodded, smiling. “I knew she would.”\\n\\n “Grandma’s been collecting recipes for weeks.” All Justine had asked for was a few of Charlotte’s special recipes, but her grandmother had gone far beyond her expectations.\\n\\n “Grandma’s determined to finish organizing everything before she and Ben leave on their Christmas cruise in two weeks.”\\n\\n “She has quite a few, then?” Her mother’s hand trembled as she lifted her cup.\\n\\n “I’d say a couple of hundred. Mom, you’ve just got to see it. Ben typed everything into the computer for her. Then Grandma read over each of the recipes and added special touches and little anecdotes. She made me my very own family cookbook. She even included recipes from friends like Grace and Corrie McAfee and Peggy Beldon. All her holiday dishes are there, too. But the best part is the little notes.”\\n\\n “Give me an example,” Olivia said.\\n\\n “Well, for instance, on her recipe for cinnamon rolls, she says that if she’s baking them for Jack to leave out the raisins.”\\n\\n Her mother nodded.\\n\\n “Grandma thought it was funny that Jack would hate raisins since he likes grapes.”\\n\\n Her mother’s eyes softened. “He likes plums, too, but not prunes, you know.”\\n\\n Justine thought they should avoid any further comment on Jack’s dislike of dried fruit. “Anyway,” she went on, “Grandma has all kinds of hints, plus she explains where she got some of the recipes. Remember all those wakes she attended over the years?” Justine and Olivia shared a complicit grin. “Mom, the cookbook’s a real treasure.”\\n\\n “That’s your grandmother,” Olivia murmured. “When she sets her mind on something, there’s no holding her back.”\\n\\n “It’s the most wonderful gift she could’ve given me.”\\n\\n “Your brother’s favorite cookies were gingerbread.” Her mother seemed lost in thought.\\n\\n “James?”\\n\\n “Jordan. Only he didn’t want me to bake them in the shape of little men. He was far too cool for that. So I made them round like every other cookie.”\\n\\n Justine didn’t remember that.\\n\\n “He asked me to bake them for him.”\\n\\n They seldom talked about Jordan’s youth. Even now, after more than twenty years, it was simply too painful. The fact that her mother was talking about his favorite cookies was decidedly odd.\\n\\n “Jordan wanted you to bake cookies? When?” He’d died in August and it was unlikely that their mother would’ve been baking cookies on one of the hottest days of the summer.\\n\\n Olivia threw Justine a puzzled look. “This morning.”\\n\\n Justine froze. When she spoke, she kept her voice soft. “You couldn’t have talked to Jordan this morning, Mom.”\\n\\n Olivia stared at her blankly and then, seemingly embarrassed, shook her head. “Of course it wasn’t this morning. I don’t know what I was thinking. Jordan can’t ask me to bake cookies, can he?”\\n\\n “No, Mom, he can’t.” Alarmed, Justine studied her mother carefully. Her eyes were far too bright, and they glittered with fever.\\n\\n “I’m so thirsty,” Olivia said. She picked up her cup and this time her hand shook uncontrollably. Tea splashed over the sides before the cup fell from her fingers and crashed to the table, spilling tea on the Christmas-themed place mats.\\n\\n Leaping to her feet, Justine dashed to her mother’s side.\\n\\n “What have I done?” Olivia cried. “Look at this mess!”\\n\\n “Don’t worry about that. I’m getting you back to bed.”\\n\\n Olivia regarded Justine with a confused expression, as if unsure where she was.\\n\\n Supporting her mother, Justine managed to get her out of the kitchen and down the long hallway to the master bedroom. With one arm around her waist, she half carried, half dragged her to the bed.\\n\\n Once Olivia was covered by the sheet, Justine felt her mother’s face and nearly gasped aloud at how hot she was to the touch. She located a temperature strip in the bathroom, then pressed it against Olivia’s forehead.\\n\\n The reading nearly sent her into a panic. No one needed to tell her that with a temperature of a hundred and five degrees her mother was in a life-threatening situation.\\n\\n “I’ll be fine, Justine,” Olivia insisted in a slurred voice. “Jack will be home soon.”\\n\\n “I’m calling him right this minute!”\\n\\n “No…don’t do that. No need. I’ll go back to sleep and…be fine.”\\n\\n Rather than argue, Justine left her mother and rushed into the kitchen. She ignored the spilled tea as she scrambled to find Jack’s cell number. Ever organized, her mother had written it neatly in the telephone directory under Jack.\\n\\n He didn’t answer for three rings.\\n\\n It felt more like three years. When he did pick up, Justine burst out, “Something’s wrong with Mom. Her temperature’s a hundred and five…she’s talking to Jordan…. Jack, what should I do?”\\n\\n To his credit, Jack didn’t ask any questions. “I’m on my way,” he said urgently. “I’ll get in touch with her oncologist right now. I’m close…I’ll be there in under ten minutes.”\\n\\n Justine went back to check on her mother, only to find that Olivia appeared to be having entire conversations with Jordan now. She chuckled at something and murmured, “Oh, Jordan, you always made me laugh.”\\n\\n “Mom, Mom.” Justine sat on the edge of the bed and took her mother’s hand. Her heart raced and she struggled to hold back the tears.\\n\\n The sound of a speeding car reached her. Justine ran into the living room, praying frantically that it was Jack. Instead it was a teenage boy, driving recklessly in a souped-up vehicle without a muffler. She scanned the road for any sign of Jack.\\n\\n In another five minutes, he was there. He banged the door open and dashed into the house, shouting for her.\\n\\n “In here,” Justine cried.\\n\\n Jack tore into the bedroom. Olivia gazed up at him as though she’d never seen him before.\\n\\n “She’s out of her mind with fever,” Justine said, not even trying to hide her fear. “It’s high, Jack. Way too high.”\\n\\n “Dr. Franklin said we’re to get her to the hospital.” He scooped Olivia into his arms, blankets and all, and started for the front door. By this point Olivia was too weak to protest.\\n\\n Justine hurried along at his side, gathering up the dragging blanket. They got Olivia into the backseat of his car and drove straight to the hospital in Bremerton. Justine rode with her mother.\\n\\n “He never grew up,” Olivia said, turning to Justine.\\n\\n “Do you mean Jordan, Mom?”\\n\\n She smiled and laid her head against the seat. “When he asked about the gingerbread cookies, he was thirteen. He still is…”\\n\\n Justine clutched her mother’s hand, working hard to keep the emotion at bay. Jack went over the speed limit when he could, with the windows open so the cold December air blew into the car. It was his desperate attempt to bring down her fever. Olivia closed her eyes as the icy breeze touched her heated face. Justine shivered. She hadn’t bothered to grab her jacket or purse, and her teeth were beginning to chatter.\\n\\n Once they arrived at the hospital, everything happened quickly. Her mother’s physician had phoned ahead and the hospital staff was waiting for them.\\n\\n Justine and Jack sat in silence until Dr. Franklin, the oncologist, appeared. His face was grim. “I’m afraid Olivia has a massive infection at the site of her incision,” he said.\\n\\n “How could this be?” Jack demanded. “We were so careful. We followed all the instructions to the letter.”\\n\\n “We probably won’t ever know the exact cause. Our biggest concern at the moment is to get her temperature down. We’ll be starting her on antibiotics intravenously.”\\n\\n He left them, saying he’d be back as soon as Olivia had been admitted.\\n\\n Jack was pale, the look on his face anguished. He seemed to blame himself. “I should never have gone out,” he said over and over. “Thank God you were there.”\\n\\n The Christmas music playing in the background seemed incongruous, but it reminded her that she and Seth had planned to put up their tree this afternoon. Now the prospect of preparing for the holidays was the farthest thing from her mind.\\n\\n “Mom’s going to be all right,” she said because she needed to hear it. Needed to say it.\\n\\n “Yes,” Jack confirmed, but he didn’t sound confident.\\n\\n While they waited for news, Justine phoned Seth to explain where she was. He assured her that he could easily keep Leif occupied and sent Olivia his best wishes.\\n\\n When Dr. Franklin returned, his voice was grave. “Olivia is stable. As I told you, I’ve started her on a high dose of antibiotics. Her temperature is down a couple of degrees. We have her lying on an ice blanket, which has helped quite a bit.”\\n\\n “Thank God,” Jack whispered again.\\n\\n “Although she’s in stable condition, I don’t want to discount the seriousness of this infection. Another four or five hours, and we might not have been able to save her.”\\n\\n Justine’s hand flew to her mouth.\\n\\n “We’re going to fight this to the best of our ability. The problem, of course, is that Olivia’s immune system is already compromised. This isn’t something we can deal with overnight. She’ll probably be here for several days.”\\n\\n Jack nodded. “I’d like to stay with her if I could.”\\n\\n Dr. Franklin nodded.\\n\\n When he’d gone, Jack turned to Justine and handed her the keys to his car. She stared at them, not understanding his intent.\\n\\n “Take the car home,” he said. “When you come back, bring me a set of clothes.”\\n\\n “But, Jack—”\\n\\n “I’m not leaving Olivia again,” he insisted. “I’m never leaving her alone again.”\\n\\n Sixteen\\n\\n Shirley Bliss glanced out the front window. The streetlights had come on more than an hour ago. Tanni was late for dinner again, which wasn’t an unusual occurrence since she’d taken up with Shaw, the boy who seemed to have only one name. Shirley had met him once, briefly. Tanni was none too eager for her to talk to this young man, for reasons Shirley didn’t understand. It was times like this that she missed Jim the most. \\n\\n","sourceLink":"https://allnovel.net/8-sandpiper-way-cedar-cove-8/page-21.html","bookId":1949,"book":{"id":1949,"title":"8 Sandpiper Way (Cedar Cove #8)","description":"Storyline: 8 Sandpiper Way (Cedar Cove #8) \\n 8 SANDPIPER WAY \\n CEDAR COVE, WASHINGTON \\n DEAR READER: \\n I have something to confide in you. I think my husband, Dave, might be having an affair. I found an earring in his pocket, and it\u0027s not mine. I\u0027m also worried because some jewelry was recently stolen from an old woman --- and Dave used to visit her a lot. \\n You see, he\u0027s a pastor. And a good man. I can\u0027t believe he\u0027s guilty of anything, but why won\u0027t he tell me where he\u0027s been when he comes home so late? \\n Reader, I\u0027d love to hear what you think. I also want to tell you what\u0027s going on with your other friends in Cedar Cove. Like Sheriff Troy Davis, to mention one. His long-ago love, Faith Beckwith, just moved here! \\n So come on in and join me for a cup of tea. \\n EMILY FLEMING\\n","cover":"https://allnovel.net/images/8-sandpiper-way-cedar-cove-8.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/8-sandpiper-way-cedar-cove-8.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:07:26 AM"}}
