{"id":68138,"no":33,"title":"Page 33","content":"He climbed out of his car when she stepped out of hers.\n Her heart pounded furiously as he came toward her.\n “I’m going to be a volunteer,” she said excitedly, needing to tell someone about her momentous decision.\n He blinked as though she’d spoken in a foreign language.\n “If I can, I’m going to deliver charity baskets and gifts to underprivileged children on Christmas Eve.” She laughed at his puzzled expression. “I was feeling sorry for myself, and then it occurred to me that what I need to do is reach out to someone else.” All at once she realized that she didn’t know why he was there.\n She stopped and waited for him to tell her.\n James never seemed to find it easy to explain himself.\n When he didn’t say anything, she asked, “Do you want to volunteer with me?”\n He nodded. “Okay.”\n “Would you like…” She almost said a beer. “Tea,” she offered instead.\n “Yes, please,” he said with a grin.\n She led him into her apartment, which was clean for a change. It wasn’t the Ritz, by any means, but at least it was comfortable. In a burst of holiday enthusiasm she’d strung a tinsel garland across her drapery rod and stuck a ceramic snowman in the middle of her coffee table.\n James folded his coat neatly and laid it on the back of her sofa.\n “Did you, um, have a reason for coming?” she asked as she filled her teakettle.\n “Where did you go?” he asked, which seemed to be a habit of his—answering a question with a question.\n “Down to the waterfront. The high school band’s is putting on a Christmas concert. I listened to the music for a while and that’s when I decided to be a volunteer.”\n “Why at Christmas, though?”\n She didn’t want to tell him she didn’t have anywhere to go. It was too personal, too…embarrassing. Too sad. “Payback,” she told him. “Someone was kind to me when I was a little girl without a gift at Christmas. Now I’m returning that kindness.”\n “It’s a very thoughtful thing to do.”\n Rather than discuss the worthiness of her idea, she said, “You didn’t answer my question. Why are you here?”\n “I wanted to see you. I thought you’d go to The Pink Poodle.”\n She almost had. “You wanted to see me. That’s sweet.”\n He nodded rather sheepishly.\n “I like you, James.”\n There it was—without a lot of fancy words to dress it up—just the plain truth. He could accept it or reject it and frankly, she wasn’t sure which he’d do.\n His gaze held hers for a moment, and then the most enchanting smile fell into place. “I like you, too.”\n That was as big an admission as he’d ever made in their decidedly odd relationship. Fearing he’d see the joy it gave her, she busied herself getting tea bags and sugar from the cupboard.\n As soon as their tea was ready, she carried the two mugs to the small coffee table and set them on her Christmas coasters. There was only the one sofa, so she had no choice but to sit next to James.\n He waited until she’d sipped from her tea before he picked up his own mug.\n “I’m glad you came,” she said, not looking at him.\n “I am, too.” He paused, then added, “I like your hair.”\n She’d almost forgotten she’d had it cut. “Thank you.”\n “You’re very pretty.”\n Christie was accustomed to flattery. Most men seemed to know exactly what to say in order to get what they wanted from her. She listened to their lies because she so badly needed to believe they were true. James’s three words meant more to her than any compliment she’d ever received.\n For several minutes she couldn’t respond. “Thank you,” she murmured at last. “Do you want to kiss me again?” she asked, only half joking.\n He took her seriously. “Yes, but not yet. Later.”\n She nearly laughed out loud. Later? Any other man would’ve had her in bed by now. They would’ve found more interesting ways of keeping warm than sipping tea.\n “I don’t know anything about you,” she said.\n “I realize that.”\n “You’ve been Bobby’s driver for how many years?” She waited for him to answer. He didn’t.\n “Bobby and I are friends.”\n “You’ve been friends for a long time?”\n “Yes.”\n The silence stretched between them. “You don’t want me to know anything else, is that it?”\n He shifted uneasily. “Maybe now,” he said, leaning forward to set his mug on the coaster.\n She frowned, not understanding. “Maybe now what?”\n He smiled that sweet boyish smile of his and took her tea out of her hands. “It’s time to kiss again.” He moved closer and pressed his lips to hers.\n Christie nearly gasped at the explosive desire that erupted inside her. “James,” she whispered. “Oh, James.” She locked her arms around his neck and kissed him back. But he wouldn’t allow her to deepen the contact. He maintained his gentle pressure until she thought she’d melt at his feet if he didn’t hurry up and kiss her properly.\n Then his hands were in her newly short hair. He angled his mouth over hers and showed her that there was no need to hurry, after all. He was hers and she was his.\n When he released her, Christie collapsed against the back of the sofa. Her eyes were still shut and she couldn’t catch her breath for what seemed like minutes.\n “Wow,” she sighed.\n “That was nice,” he agreed. He, too, was breathing hard.\n She leaned foreward and touched her forehead to his. “James, there are things you don’t know about me,” she said.\n “It doesn’t matter.”\n “It does to me.” She wanted to tell him the truth so there’d be no surprises later on. “I’ve been married before…. It wasn’t a good marriage.” She gave him some of the details, just enough so he’d understand that her husband hadn’t been her first lover nor had he been her last.\n James listened quietly, then held and kissed her again. Occasionally he’d ask a question. When tears fell from her eyes, he kissed them away. Once she’d finished her confession, she buried her head in his shoulder.\n James cradled her with comforting hands. “Thank you,” he whispered.\n She couldn’t figure out why he’d say that and looked up. His eyes met hers. “Telling me all this couldn’t have been easy.”\n “It wasn’t.”\n “I’m important to you?”\n She nodded. “Important enough that I want you to know the truth.”\n He kissed her temple. “The truth is a precious gift.”\n He continued to hold her. Then, reluctant to leave, he murmured against her hair, “I have to get back to the house.” When he came to his feet, he seemed a bit unsteady. “Thank you, Christie,” he said a second time.\n She gestured weakly, not knowing what to say. A plea to see him again was on the tip of her tongue. She swallowed the question unasked. He would call her. She saw it in his eyes. She was important to him, too, otherwise he wouldn’t have come. She’d poured out her heart to him, and he’d accepted what she had to say without censure. He knew everything about her now; she’d held nothing back. She hated that he had to go.\n After one last kiss, James saw himself out, which was a good thing. Her legs didn’t seem to work properly. He’d been gone for at least five minutes before she found the strength to stand.\n She’d never done anything so bold as to lay out her sins for a man to examine. In a strange way she felt better. Telling James everything had unexpectedly freed her. At first she was afraid she’d chase him away, but nothing could be further from the truth. His touch had been gentle, his words kind and encouraging. He hadn’t said he loved her, but he did. She knew it. She felt it. And Christie knew something else.\n She loved him, too.\n Twenty-Four\n “Mom, I know you’re disappointed,” Linnette said into her cell phone. She was just as disappointed, but she couldn’t possibly return to Cedar Cove for Christmas. Not if she was going to accomplish everything that needed to be done for the Buffalo Valley medical clinic to open on schedule.\n Linnette cast an apologetic glance at Pete Mason. He’d invited her to lunch and they sat in the Three of a Kind restaurant and bar, where Linnette had, until recently, worked as a waitress. They’d just been served their meal and Linnette had taken a couple of bites of her sandwich when her cell phone rang. She wished she hadn’t answered it, but too late now.\n “You told us over Thanksgiving you’d make it home for Christmas,” her mother protested.\n “I know I did, and I’m sorry.” She already felt guilty, and hearing the frustration in her mother’s voice wasn’t helping.\n Silence followed Linnette’s announcement. Repressing a sigh, she wondered what else she could say to comfort Corrie—and herself. She missed her family and her friends in Cedar Cove. She’d like nothing better than to spend the holidays at her parents’ home. But she was deeply involved with the medical clinic, which would be opening—she hoped—by February. Not only that, she didn’t have the extra money to make such a trip. Airfares at this time of year were simply out of reach.\n “Mack will be with you. And Gloria will, too. Right?”\n “I’m not sure yet.” Her mother didn’t hide her distress. “They’re both the most recent hires, so I’m afraid they’ll end up working. It won’t be Christmas without my children.”\n “I’m sorry,” she said again. Changing the subject, she asked, “How’s Mack?”\n “Fine. He’s settling into his job with the fire department. He seems to be enjoying it.”\n “I knew he would,” Linnette murmured.\n “I had a surprise for you, too,” her mother lamented.\n “A…surprise?” Linnette felt guilty enough.\n “Yes. Bob Beldon got your father and your brother parts in the live Nativity scene at the church.”\n Linnette could hardly believe it. “You’ve got to be joking! Dad—and Mack, too?” She could imagine Mack enjoying such an event, but it must’ve taken some fast talking to get her father to agree.\n “Mack’s playing a shepherd and your father’s one of the Wise Men.”\n Linnette giggled, thinking she’d love to see that. “How did Pastor Flemming and Mr. Beldon convince Dad to do this?”\n “Don’t ask me, but whatever they said worked.” Her mother finally seemed to relax. “You should’ve seen Mack chasing sheep at the first practice,” she said with a laugh.\n “Real sheep?”\n “Oh, yes. We’ve got a camel, too,” Corrie bragged. “I have no idea how Pastor Dave managed it, but he found a camel for your father. Roy’s going to lead him—or is it her?—around the stable where Jesus, Mary and Joseph are on display.” \n","sourceLink":"https://allnovel.net/8-sandpiper-way-cedar-cove-8/page-33.html","bookId":1949,"book":{"id":1949,"title":"8 Sandpiper Way (Cedar Cove #8)","description":"Storyline: \n 8 Sandpiper Way (Cedar Cove #8) \n 8 SANDPIPER WAY \n CEDAR COVE, WASHINGTON \n DEAR READER: \n I have something to confide in you. I think my husband, Dave, might be having an affair. I found an earring in his pocket, and it\u0027s not mine. I\u0027m also worried because some jewelry was recently stolen from an old woman --- and Dave used to visit her a lot. \n You see, he\u0027s a pastor. And a good man. I can\u0027t believe he\u0027s guilty of anything, but why won\u0027t he tell me where he\u0027s been when he comes home so late? \n Reader, I\u0027d love to hear what you think. I also want to tell you what\u0027s going on with your other friends in Cedar Cove. Like Sheriff Troy Davis, to mention one. His long-ago love, Faith Beckwith, just moved here! \n So come on in and join me for a cup of tea. \n EMILY FLEMING\n \n","cover":"https://allnovel.net/images/8-sandpiper-way-cedar-cove-8.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/8-sandpiper-way-cedar-cove-8.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:07:26 AM"}}
