{"id":14112,"no":12,"title":"CHAPTER XII: THE BATTLE OF THE ATBARA","content":"April 8, 1898 In the evening of Thursday, the 7th of April, the army at Umdabia paraded for the attack on Mahmud\u0027s zeriba. The camp lay in the scrub which grows by the banks of the Atbara, as by those of the Nile, and in order to profit by the open, level ground the four infantry brigades moved by parallel routes into the desert, and then formed facing south-east in column of brigade squares, the British brigade leading. The mounted forces, with four batteries of artillery, waited in camp until two o\u0027clock the next morning, and did not break their march. The distance from the river bank to the open plain was perhaps a mile and a half, and the whole infantry force had cleared the scrub by six o\u0027clock. The sun was setting, and the red glow, brightening the sandy hillocks, made the western horizon indefinite, so that it was hard to tell where the desert ended and the sky began. A few gazelle, intercepted on their way to the water by the unexpected movement of troops, trotted slowly away in the distance—white spots on the rosy-brown of the sand—and on the great plain 12,000 infantry, conscious of their strength and eager to encounter the enemy, were beautifully arranged in four solid masses. Then the march began. The actual distance from the camp to the Dervish position was scarcely seven miles, but the circle necessary to avoid the bushes and the gradual bends of the river added perhaps another five to the length of the road. The pace of the advance was slow, and the troops had not gone far when the sun sank and, with hardly an interval of twilight, darkness enveloped everything. In the stillness of the night the brigades moved steadily forward, and only the regular scrunching of the hard sand betrayed the advance of an overwhelming force upon their enemies. No operation of a war is more critical than a night-march. Over and over again in every country frightful disaster has overtaken the rash or daring force that has attempted it. In the gloom the shape and aspect of the ground are altered. Places well known by daylight appear strange and unrecognisable. The smallest obstacle impedes the column, which can only crawl sluggishly forward with continual checks and halts. The effect of the gloom upon the nerves of the soldiers is not less than on the features of the country. Each man tries to walk quietly, and hence all are listening for the slightest sound. Every eye seeks to pierce the darkness. Every sense in the body is raised to a pitch of expectancy. In such hours doubts and fears come unbidden to the brain, and the marching men wonder anxiously whether all will be well with the army, and whether they themselves will survive the event. And if suddenly out of the black silence there burst the jagged glare of rifles and the crash of a volley followed by the yell of an attacking foe, the steadiest troops may be thrown into confusion, and a panic, once afoot, stops only with the destruction or dispersal of the whole force. Nevertheless, so paramount is the necessity of attacking at dawn, with all the day to finish the fight, that in spite of the recorded disasters and the known dangers, the night-march is a frequent operation. For more than two hours the force advanced, moving across smooth swells of sand broken by rocks and with occasional small bushes. Several shallow khors traversed the road, and these rocky ditches, filled with a strange, sweet-scented grass, delayed the brigades until the pace was hardly two miles an hour. The smell of the grass was noticed by the alert senses of many, and will for ever refresh in their minds the strong impression of the night. The breeze which had sprung up at sundown gradually freshened and raised clouds of fine sand, which deepened the darkness with a whiter mist. At nine o\u0027clock the army halted in a previously selected space, near the deserted village of Mutrus and about two miles from the river. Nearly half the distance to Mahmud\u0027s zeriba was accomplished, and barely four miles in the direct line divided the combatants; but since it was not desirable to arrive before the dawn, the soldiers, still formed in their squares, lay down upon the ground. Meat and biscuits were served out to the men. The transport animals went by relays to the pools of the Atbara bed to drink and to replenish the tanks. All water-bottles were refilled, pickets being thrown out to cover the business. Then, after sufficient sentries had been posted, the army slept, still in array. During the halt the moon had risen, and when at one o\u0027clock the advance was resumed, the white beams revealed a wider prospect and, glinting on the fixed bayonets, crowned the squares with a sinister glitter. For three hours the army toiled onwards at the same slow and interrupted crawl. Strict silence was now enforced, and all smoking was forbidden. The cavalry, the Camel Corps, and the five batteries had overtaken the infantry, so that the whole attacking force was concentrated. Meanwhile the Dervishes slept. At three o\u0027clock the glare of fires became visible to the south, and, thus arrived before the Dervish position, the squares, with the exception of the reserve brigade, were unlocked, and the whole force, assuming formation of attack, now advanced in one long line through the scattered bush and scrub, presently to emerge upon a large plateau which overlooked Mahmud\u0027s zeriba from a distance of about 900 yards. It was still dark, and the haze that shrouded the Dervish camp was broken only by the glare of the watch-fires. The silence was profound. It seemed impossible to believe that more than 25,000 men were ready to join battle at scarcely the distance of half a mile. Yet the advance had not been unperceived, and the Arabs knew that their terrible antagonists crouched on the ridge waiting for the morning; For a while the suspense was prolonged. At last, after what seemed to many an interminable period, the uniform blackness of the horizon was broken by the first glimmer of the dawn. Gradually the light grew stronger until, as a theatre curtain is pulled up, the darkness rolled away, the vague outlines in the haze became definite, and the whole scene was revealed. The British and Egyptian army lay along the low ridge in the form of a great bow—the British brigade on the left, MacDonald in the centre, Maxwell curving forward on the right. The whole crest of the swell of ground was crowned with a bristle of bayonets and the tiny figures of thousands of men sitting or lying down and gazing curiously before them. Behind them, in a solid square, was the transport, guarded by Lewis\u0027s brigade. The leading squadrons of the cavalry were forming leisurely towards the left flank. The four batteries and a rocket detachment, moving between the infantry, ranged themselves on two convenient positions about a hundred yards in front of the line of battalions. All was ready. Yet everything was very quiet, and in the stillness of the dawn it almost seemed that Nature held her breath. Half a mile away, at the foot of the ridge, a long irregular black line of thorn bushes enclosed the Dervish defences. Behind this zeriba low palisades and entrenchments bent back to the scrub by the river. Odd shapeless mounds indicated the positions of the gun-emplacements, and various casemates could be seen in the middle of the enclosure. Without, the bushes had been cleared away, and the smooth sand stretched in a gentle slope to where the army waited. Within were crowds of little straw huts and scattered bushes, growing thicker to the southward. From among this rose the palm-trees, between whose stems the dry bed of the Atbara was exposed, and a single pool of water gleamed in the early sunlight. Such was Mahmud\u0027s famous zeriba, which for more than a month had been the predominant thought in the minds of the troops. It was scarcely imposing, and at first the soldiers thought it deserted. Only a dozen stray horsemen sat silently on their horses outside the entrenchment, watching their enemies, and inside a few dirty-white figures appeared and disappeared behind the parapets. Yet, insignificant as the zeriba looked, the smoke of many fires cooking the morning meal—never to be eaten—showed that it was occupied by men; and gay banners of varied colour and device, flaunting along the entrenchments or within the enclosure, declared that some at least were prepared to die in its defence. The hush of the hour and the suspense of the army were broken by the bang of a gun. Everyone on the ridge jumped up and looked towards the sound. A battery of Krupps a little to the right of the Cameron Highlanders had opened fire. Another gun further to the right was fired. Another shell burst over the straw huts among the palm-trees. The two Maxim-Nordenfeldt batteries had come into action. The officers looked at their watches. It was a quarter-past six. The bombardment had begun. Explosion followed explosion in quick succession until all four batteries were busily engaged. The cannonade grew loud and continuous. The rocket detachment began to fire, and the strange projectiles hissed and screamed as they left the troughs and jerked erratically towards the zeriba. In the air above the enclosure shell after shell flashed into existence, smote the ground with its leaden shower, and dispersed—a mere film—into the haze and smoke which still hung over the Dervish encampment. At the very first shot all the dirty-white figures disappeared, bobbing down into their pits and shelters; but a few solitary horsemen remained motionless for a while in the middle of the enclosure, watching the effect of the fire, as if it had no concern with them. The British infantry stood up on tip-toe to look at the wonderful spectacle of actual war, and at first every shell was eagerly scrutinised and its probable effect discussed. But the busy gunners multiplied the projectiles until so many were alive in the air at once that all criticism was prevented. Gradually even the strange sight became monotonous. The officers shut up their glasses. The men began to sit down again. Many of them actually went to sleep. The rest were soon tired of the amazing scene, the like of which they had never looked on before, and awaited impatiently further developments and \u0027some new thing.\u0027 After the bombardment had lasted about ten minutes a great cloud of dust sprang up in the zeriba, and hundreds of horsemen were seen scrambling into their saddles and galloping through a gap in the rear face out into the open sand to the right. To meet the possibility of an attempt to turn the left flank of the attack, the eight squadrons of cavalry and two Maxim guns jingled and clattered off in the direction of the danger. The dust, which the swift passage of so many horsemen raised, shut the scene from the eyes of the infantry, but continual dust-clouds above the scrub to the left and the noise of the Maxims seemed to indicate a cavalry fight. The Baggara horse, however, declined an unequal combat, and made no serious attempt to interfere with the attack. Twice they showed some sort of front, and the squadrons thought they might find opportunity to charge; but a few rounds from the Maxims effectually checked the enemy, inflicting on each occasion the loss of about twenty killed and wounded. With the exception of one squadron detached on the right, the Egyptian cavalry force, however, remained on the left flank, and shielded the operations of the assaulting infantry. Meanwhile the bombardment—no longer watched with curiosity—continued with accuracy and precision. The batteries searched the interior of the zeriba, threshing out one section after another, and working the whole ground regularly from front to rear. The zeriba and palisades were knocked about in many places, and at a quarter to seven a cluster of straw huts caught fire and began to burn briskly. At a quarter-past seven the infantry were ordered to form in column for assault. The plan of the attack for the army was simple. The long, deployed line were to advance steadily against the entrenchments, subduing by their continual fire that of the enemy. They were then to tear the zeriba to pieces. Covered by their musketry, the dense columns of assault which had followed the line were to enter the defences through the gaps, deploy to the right, and march through the enclosure, clearing it with the bayonet and by fire. At twenty minutes to eight the Sirdar ordered his bugles to sound the general advance. The call was repeated by all the brigades, and the clear notes rang out above the noise of the artillery. The superior officers—with the exception of Hunter, Maxwell, and MacDonald—dismounted and placed themselves at the head of their commands. The whole mass of the infantry, numbering nearly eleven thousand men, immediately began to move forward upon the zeriba. The scene as this great force crested the ridge and advanced down the slope was magnificent and tremendous. Large solid columns of men, preceded by a long double line, with the sunlight flashing on their bayonets and displaying their ensigns, marched to the assault in regular and precise array. The pipes of the Highlanders, the bands of the Soudanese, and the drums and fifes of the English regiments added a wild and thrilling accompaniment. As soon as the advance masked the batteries, the guns were run forward with the firing line, in order effectually to support the attack. The deployed battalions opened a ceaseless and crushing fire on the entrenchment, and as the necessity of firing delayed the advance of the attacking columns, the pace did not exceed a slow march. The Dervishes remained silent until the troops were within 300 yards. Then the smoke-puffs spurted out all along the stockades, and a sharp fusillade began, gradually and continually growing in intensity until the assaulting troops were exposed to a furious and effective fire. From 250 yards up to the position losses began to occur. The whole entrenchment was rimmed with flame and smoke, amid which the active figures of the Dervish riflemen were momentarily visible, and behind the filmy curtain solid masses of swordsmen and spearmen appeared. The fortunate interposition of a small knoll in some degree protected the advance of the Lincoln Regiment, but in both Highland battalions soldiers began to drop. The whole air was full of a strange chirping whistle. The hard pebbly sand was everywhere dashed up into dust-spurts. Numerous explosive bullets, fired by the Arabs, made queer startling reports. The roar of the rifles drowned even the noise of the artillery. All the deployed battalions began to suffer. But they and the assaulting columns, regardless of the fire, bore down on the zeriba in all the majesty of war—an avalanche of men, stern, unflinching, utterly irresistible. Two hundred yards from the entrenchment and one hundred and fifty from the thorn bushes independent firing broke out, running along the line from end to end. Shooting continually, but without any hurry or confusion, the British and Soudanese battalions continued their slow, remorseless advance; and it was evident that, in spite of the fierce fire of the defence, which was now causing many casualties, the assault would be successful. The loss during the passage of the zeriba and in the assault of the entrenchments was severe. Captain Findlay and Major Urquhart, of the Cameron Highlanders, were both mortally wounded in the fight at the stockades, and expired still cheering on their men. Major Napier, of the same regiment, and Captain Baillie, of the Seaforth Highlanders, received the wounds, of which they subsequently died, a few yards further on. At all points the troops broke into the enclosure. Behind the stockade there ran a treble trench. The whole interior was honeycombed with pits and holes. From these there now sprang thousands of Dervishes, desperately endeavouring to show a front to the attack. Second-Lieutenant Gore, a young officer fresh from Sandburst, was shot dead between the thorn fence and the stockade. Other officers in the Lincoln and the Warwickshire regiments sustained severe wounds. Many soldiers were killed and wounded in the narrow space. These losses were general throughout the assaulting brigades. In the five minutes which were occupied in the passage of the obstruction about four hundred casualties occurred. The attack continued. The British brigade had struck the extremity of the north front of the zeriba, and thus took the whole of the eastern face in enfilade, sweeping it with their terrible musketry from end to end, and strewing the ground with corpses. Although, owing to the lines of advance having converged, there was not room for more than half the force to deploy, the brigades pushed on. The conduct of the attack passed to the company commanders. All these officers kept their heads, and brought their companies up into the general line as the front gradually widened and gaps appeared. So the whole force—companies, battalions, even brigades—mixed up together and formed in one dense, ragged, but triumphant line, marched on unchecked towards the river bed, driving their enemies in hopeless confusion before them. Yet, although the Dervishes were unable to make head against the attack, they disdained to run. Many hundreds held their ground, firing their rifles valiantly till the end. Others charged with spear and sword. The greater part retired in skirmishing order, jumping over the numerous pits, walking across the open spaces, and repeatedly turning round to shoot. The XIth Soudanese encountered the most severe resistance after the defences were penetrated. As their three deployed companies pressed on through the enclosure, they were confronted by a small inner zeriba stubbornly defended by the Emir Mahmud\u0027s personal bodyguard. These poured a sudden volley into the centre company at close range, and so deadly was the effect that nearly all the company were shot, falling to the ground still in their ranks, so that a British officer passing at a little distance was provoked to inquire \u0027what they were doing lying down.\u0027 Notwithstanding this severe check the regiment, gallantly led by their colonel and supported by the Xth Soudanese, rushed this last defence and slew its last defenders. Mahmud was himself captured. Having duly inspected his defences and made his dispositions, he had sheltered in a specially constructed casemate. Thence he was now ignominiously dragged, and, on his being recognised, the intervention of a British officer alone saved him from the fury of the excited Soudanese. Still the advance continued, and it seemed to those who took part in it more like a horrible nightmare than a waking reality. Captains and subalterns collected whatever men they could, heedless of corps or nationality, and strove to control and direct their fire. Jibba-clad figures sprang out of the ground, fired or charged, and were destroyed at every step. And onwards over their bodies—over pits choked with dead and dying, among heaps of mangled camels and donkeys, among decapitated or eviscerated trunks, the ghastly results of the shell fire; women and little children killed by the bombardment or praying in wild terror for mercy; blacks chained in their trenches, slaughtered in their chains—always onwards marched the conquerors, with bayonets running blood; clothes, hands, and faces all besmeared; the foul stench of a month\u0027s accumulated filth in their nostrils, and the savage whistle of random bullets in their ears. But at about twenty minutes past eight the whole force, with the Seaforth Highlanders well forward on the left, arrived at the bank of the Atbara, having marched completely through the position, and shot or bayoneted all in their path. Hundreds of Dervishes were still visible retiring across the dry bed of the river, and making for the scrub on the opposite bank. The leading companies of the Seaforth Highlanders and Lincolns, with such odd parties of Camerons as had been carried on with the attack, opened a murderous fire on these fugitives. Since they would not run their loss was heavy, and it was a strange sight—the last vivid impression of the day—to watch them struggling through the deep sand, with the dust knocked up into clouds by the bullets which struck all round them. Very few escaped, and the bodies of the killed lay thickly dotting the river-bed with heaps of dirty-white. Then at 8.25 the \u0027Cease fire\u0027 sounded, and the battle of the Atbara ended. Forthwith the battalions began to re-form, and in every company the roll was called. The losses had been severe. In the assault—a period not exceeding half an hour—eighteen British, sixteen native officers and 525 men had been killed or wounded, the greater part during the passage of the zeriba. The actual pursuit was abortive. Colonel Lewis, with his two battalions, followed a line of advance which led south of the zeriba, and just before reaching the river bank found and fired upon a few Dervishes retreating through the scrub. All the cavalry and the Camel Corps crossed the Atbara and plunged into the bush on the further side. But so dense and tangled was the country that after three miles of peril and perplexity they abandoned he attempt, and the routed Arabs fled unmolested. The Baggara horse had ridden off during the action, headed by the prudent Osman Digna—whose position in the zeriba was conveniently suited to such a manoeuvre—and under that careful leadership suffered little loss. The rest of the army was, however, destroyed or dispersed. The fugitives fled up the Atbara river, leaving many wounded to die in the scrub, all along their line of retreat. Of the powerful force of 12,000 fighting men which Mahmud had gathered at Metemma, scarcely 4,000 reached Gedaret in safety. These survivors were added to the army of Ahmed Fedil, and thus prevented from spreading their evil tidings among the populace at Omdurman. Osman Digna, Wad Bishara, and other important Emirs whose devotion and discretion were undoubted, alone returned to the capital. As soon as the troops were re-formed, the zeriba was evacuated and the army drew up in line along the neighbouring ridge. It was then only nine o\u0027clock, and the air was still cool and fresh. The soldiers lit fires, made some tea, and ate their rations of biscuits and meat. Then they lay down and waited for evening. Gradually, as the hours passed, the sun became powerful. There was no shade, and only a few thin, leafless bushes rose from the sand. The hours of a day, peculiarly hot, even for the country and season, dragged wearily away. The sandy ridge beat back the rays till the air above was like the breath of a furnace and the pebbly ground burned. The water in the fantasses and bottles was hot and scarce. The pool of the Atbara was foul and tainted. In spite of the devoted efforts of the few medical officers who had been allowed to accompany the force, the wounded officers and soldiers endured the greatest miseries, and it is certain that several died of their wounds who might in happier circumstances have been saved. Several hundred prisoners were taken. They were mostly negroes—for the Arabs refused to surrender, and fought to the last or tried to escape. The captive blacks, who fight with equal willingness on either side, were content to be enlisted in the Soudanese regiments; so that many of those who served the Khalifa on the Atbara helped to destroy him at Omdurman. The most notable prisoner was the Emir Mahmud—a tall, strong Arab, about thirty years old. Immediately after his capture he was dragged before the Sirdar. \u0027Why,\u0027 inquired the General, \u0027have you come into my country to burn and kill?\u0027 \u0027I have to obey my orders, and so have you,\u0027 retorted the captive sullenly, yet not without a certain dignity. To other questions he returned curt or evasive answers, and volunteered the opinion that all this slaughter would be avenged at Omdurman. He was removed in custody—a fine specimen of proud brutality, worthy perhaps of some better fate than to linger indefinitely in the gaol at Rosetta. With the cool of the evening the army left its bed of torment on the ridge and returned to Umdabia. The homeward march was a severe trial; the troops were exhausted; the ground was broken; the guides, less careful or less fortunate than on the previous night, lost their way. The columns were encumbered with wounded, most of whom were already in a high state of fever, and whose sufferings were painful to witness. It was not until after midnight that the camp was reached. The infantry had been continuously under arms—marching, fighting, or sweltering in the sun—for thirty hours, and most of them had hardly closed their eyes for two days. Officers and soldiers—British, Soudanese, and Egyptian—struggled into their bivouacs, and fell asleep, very weary but victorious. British and Egyptian casualties on the Atbara included 20 officers and 539 men killed or wounded. The Dervish loss was officially estimated at 40 Emirs and 3,000 dervishes killed. No statistics as to their wounded are forthcoming. . . . . . . . . . . As the battle of the Atbara had been decisive, the whole Expeditionary Force went into summer quarters. The Egyptian army was distributed into three principal garrisons—four battalions at Atbara camp, six battalions and the cavalry at Berber, three battalions at Abadia. The artillery and transport were proportionately divided. The British brigade encamped with two battalions at Darmali and two at the village of Selim, about a mile and a half distant. For the final phase of the campaign three new gunboats had been ordered from England. These were now sent in sections over the Desert Railway. Special arrangements were made to admit of the clumsy loads passing trains on the ordinary sidings. As usual, the contrivances of the railway subalterns were attended with success. Sir H. Kitchener himself proceeded to Abadia to accelerate by his personal activity and ingenuity the construction of the vessels on which so much depended. Here during the heat of the summer he remained, nursing his gunboats, maturing his plans, and waiting only for the rise of the river to complete the downfall of his foes. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2891/79964.html","bookId":1137,"book":{"id":1137,"title":"The River War","description":"简介： The north-eastern quarter of the continent of Africa is drained and watered by the Nile. Among and about the headstreams and tributaries of this mighty river lie the wide and fertile provinces of the Egyptian Soudan. Situated in the very centre of th...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2891","creation":"Aug 1, 2019 12:24:26 AM","modification":"Aug 1, 2019 12:24:26 AM"}}
