{"id":14118,"no":18,"title":"CHAPTER XVIII: ON THE BLUE NILE","content":"The authority of the Khalifa and the strength of his army were for ever broken on the 2nd of September, and the battle of Omdurman is the natural climax of this tale of war. To those who fought, and still more to those who fell, in the subsequent actions the climax came somewhat later. After the victory the public interest was no longer centred in the Soudan. The last British battalion had been carried north of Assuan; the last Press correspondent had hurried back to Cairo or London. But the military operations were by no means over. The enemy had been defeated. It remained to reconquer the territory. The Dervishes of the provincial garrisons still preserved their allegiance to the Khalifa. Several strong Arab forces kept the field. Distant Kordofan and even more distant Darfur were as yet quite unaffected by the great battle at the confluence of the Niles. There were rumours of Europeans in the Far South. The unquestioned command of the waterways which the Sirdar enjoyed enabled the greater part of the Egyptian Soudan to be at once formally re-occupied. All towns or stations on the main rivers and their tributaries were at the mercy of the gunboats. It was only necessary to send troops to occupy them and to hoist the British and Egyptian flags. Two expeditions were forthwith sent up the White and Blue Niles to establish garrisons, and as far as possible to subdue the country. The first, under the personal command of the Sirdar, left Omdurman on the 8th of September, and steamed up the White Nile towards Fashoda. The events which followed that momentous journey have already been related. The second expedition consisted of the gunboats Sheikh and Hafir, together with two companies and the brass band of the Xth Soudanese and a Maxim battery, all under the command of General Hunter. Leaving Omdurman on the 19th of September, they started up the Blue Nile to Abu Haraz. The rest of the Xth Battalion followed as soon as other steamers were set free from the business of taking the British division to the Atbara and bringing supplies to Omdurman. The progress of the expedition up the river resembled a triumphal procession. The people of the riparian villages assembled on the banks, and, partly from satisfaction at being relieved from the oppression of the Khalifa and the scourge of war, partly from fear, and partly from wonder, gave vent to loud and long-continued cheers. As the gunboats advanced the inhabitants escorted them along the bank, the men dancing and waving their swords, and the women uttering shrill cries of welcome. The reception of the expedition when places of importance were passed, and the crowd amounted to several thousands, is described as very stirring, and, we are told, such was the enthusiasm of the natives that they even broke up their houses to supply the gunboats with wood for fuel. Whether this be true or not I cannot tell, but it is in any case certain that the vessels were duly supplied, and that the expedition in its progress was well received by the negroid tribes, who had long resented the tyranny of the Arabs. On the 22nd of September a considerable part of the army of Osman Digna, which had not been present at the battle of Omdurman, was found encamped on the Ghezira, a few miles north of Rufaa. The Sheikhs and Emirs, on being summoned by General Hunter, surrendered, and a force of about 2,000 men laid down their arms. Musa Digna, a nephew of Osman and the commander of his forces, was put in irons and held prisoner. The rest, who were mostly from the Suakin district, were given a safe-conduct, and told to return to their homes—an order they lost no time in obeying. The next day the general arrived at Wad Medina, where the Dervish garrison—1,000 strong—had already surrendered to the gunboat Sheikh. These men, who were regular Dervishes, were transported in sailing-boats to Omdurman; and augmented the number of prisoners of war already collected. On the 29th of September General Hunter reached Rosaires, 400 miles south of Khartoum, and the extreme limit of steam navigation on the Blue Nile. By the 3rd of October he had established garrisons of the Xth Soudanese in Rosaires, at Karkoj, at Sennar (the old seat of the Government of the province), and at Wad Medina. Having also arranged for gunboat patrolling, he returned to Omdurman. But there was one Dervish force which had no intention of surrendering to the invaders, and whose dispersal was not accomplished until three fierce and critical actions had been fought. Ahmed Fedil, a zealous and devoted adherent of the Khalifa, had been sent, after the defeat on the Atbara, to collect all the Dervishes who could be spared from the Gedaref and Gallabat provinces, and bring them to join the growing army at Omdurman. The Emir had faithfully discharged his duty, and he was hurrying to his master\u0027s assistance with a strong and well disciplined force of no fewer than 8,000 men when, while yet sixty miles from the city, he received the news of \u0027the stricken field.\u0027 He immediately halted, and sought to hide the disaster from his soldiers by announcing that the Khalifa had been victorious and no longer needed their assistance. He even explained the appearance of gunboats upon the river by saying that these had run past the batteries at Omdurman and that the others were destroyed. The truth was not, however, long concealed; for a few days later two emissaries despatched by Slatin arrived at the Dervish camp and announced the destruction of the Omdurman army, the flight of the Khalifa, and the fall of the city. The messengers were authorised to offer Ahmed terms; but that implacable Dervish flew into a rage, and, having shot one, sent the other, covered with insults and stripes, to tell the \u0027Turks\u0027 that he would fight to the bitter end. He then struck his camp, and marched back along the east bank of the Blue Nile, with the intention of crossing the river near its confluence with the Rahad, and so joining the Khalifa in Kordofan. His Dervishes, however, did not view this project with satisfaction. Their families and women had been left with large stores of grain and ammunition in Gedaref, under a strong garrison of 3,000 men. They urged their commander to return and collect these possessions. Ahmed at first refused, but when on arriving at the place of passage he found himself confronted with a gunboat, he resolved to make a virtue of necessity and set out leisurely for Gedaref. On the 5th of September Colonel Parsons, in command of the forces at Kassala, heard through the Italian Governor of Eritrea of the victory at Omdurman. The next day official news arrived from England, and in conformity with previous instructions he set out on the 7th for Gedaref. It was known that Ahmed Fedil had marched towards Omdurman. It was believed that Gedaref was only weakly held, and the opportunity of cutting the most powerful remaining Dervish army from its base was too precious to be neglected. But the venture was desperate. The whole available strength of the Kassala garrison was mustered. With these 1,350 motley soldiers, untried, little disciplined, worn with waiting and wasted by disease, without cavalry, artillery, or machine guns, and with only seven British officers, including the doctor, Gedaref was taken, and, having been taken, was held. After two long marches Colonel Parsons and his force arrived at El Fasher, on the right bank of the Atbara. Their advance, which had hitherto led them through a waterless desert, was now checked by a raging torrent. The river was in full flood, and a channel of deep water, broader than the Thames below London Bridge and racing along at seven miles an hour, formed a serious obstacle. Since there were no boats the soldiers began forthwith to construct rafts from barrels that had been brought for the purpose. As soon as the first of these was completed, it was sent on a trial trip. The result was not encouraging. The raft supported ten men, occupied five hours in the passage, was carried ten miles down stream, and came back for its second journey on the afternoon of the next day. It was evident that this means of transport was out of the question. The only chance of success—indeed, of safety—lay in the force reaching and taking Gedaref before the return of Ahmed Fedil. All depended upon speed; yet here was a hopeless delay. After prolonged discussion it was resolved to act on the suggestion of an Egyptian officer and endeavour to build boats. The work proved easier than was anticipated. The elastic wood of the mimosa scrub supplied the frames; some tarpaulins—fortunately available—formed the outer covering. The Egyptian soldiers, who delighted in the work, succeeded in making daily from such materials one boat capable of carrying two tons; and in these ingenious contrivances the whole force crossed to the further bank. The camels, mules, and horses of the transport—their heads supported with inflated water-skins tied under their jowls—were made to swim across the river by the local Shukrieh Arabs. Such was the skill of these tribesmen that only one camel and one mule were drowned during the operation. The passage was completed on the 16th, and the next day the advance was resumed along the west bank of the Atbara. At midday on the 18th Mugatta was reached, and at dawn on the 20th the little force—having filled their water-skins, tightened their belts, and invoked the assistance of the various gods they worshipped—started off, and marched all day in single file through the thick bush which lies between the Atbara and Gedaref. The column retired to rest peacefully during the night of the 21st, although within twelve miles of Gedaref. But at midnight startling news arrived. A deserter from the Dervishes made his way into the camp and informed Colonel Parsons that the Emir Saadalla awaited him with 3,500 men two miles before the town. The situation was grave. A retreat through the broken country and thick bush in the face of a powerful and triumphant enemy seemed impossible. There was no alternative but to attack. Very early on the morning of the 22nd—the same day on which General Hunter on the Blue Nile was compelling Musa Digna and his followers to surrender—Colonel Parsons and the Kassala column set forth to march into Gedaref and to fight whatever force it might contain. For the first two hours the road lay through doura plantations and high grass which rose above the heads even of men mounted on camels; but as the town was approached, the doura ceased, and the troops emerged from the jungle on to an undulating moorland with occasional patches of rushes and withered grass. At half-past seven, and about three miles from Gedaref, the enemy\u0027s scouts were encountered. A few shots were fired. The soldiers pressed their march, and at eight o\u0027clock had reached a small knoll, from the top of which an extensive view was obtainable. The column halted, and Colonel Parsons and his officers ascended the eminence to reconnoitre. A most menacing spectacle confronted them. Scarcely a mile away a strong force of Dervishes was rapidly advancing to meet the invaders. Four lines of white figures rising out of the grass showed by their length the number, and by their regularity the discipline, of the enemy. The officers computed the strength of their antagonists at not fewer than 4,000. Subsequent investigation has shown that the Emir Saadalla marched out of Gedaref with 1,700 riflemen, 1,600 spearmen, and 300 horse. The swiftness of the Dervish advance and the short space that intervened between the forces made it evident that a collision would take place within half an hour. The valley was rocky, and overgrown with grass and reeds; but to the right of the track there rose a high saddleback hill, the surface of which looked more open, and which appeared to command the approaches from Gedaref. The troops knew nothing of the country; the Dervishes understood it thoroughly. The high ground gave at least advantage of view. Colonel Parsons resolved to occupy it. Time was however, very scanty. The order was given, and the column began to double across the valley towards the saddleback. The Dervishes, perceiving the nature of the movement, hurried their advance in the hope of catching the troops on the move and perhaps of even seizing the hill itself. But they were too late. Colonel Parsons and his force reached the saddleback safely, and with a few minutes to spare climbed up and advanced along it in column in the direction of Gedaref—the Arab battalion leading, the 16th Egyptians next, and last of all the irregulars. The Dervishes, seeing that the troops had already reached the hill and were moving along it towards the town, swung to their left and advanced to the attack. Thereupon at half-past eight the column wheeled into line to meet them, and standing in the long grass, which even on the summit of the hill was nearly breast-high, opened a heavy and destructive fire. The enemy, although suffering severe loss, continued to struggle bravely onward, replying vigorously to the musketry of the soldiers. At nine o\u0027clock, while the frontal attack was still undecided, Colonel Parsons became aware that a strong force of Dervishes had moved round the left rear and were about to attack the hospital and transport. He at once sent to warn Captain Fleming, R.A.M.C., who combined the duties of medical officer and commander of the baggage column, of the impending assault, and directed him to close up the camels and meet it. The Arab Sheikhs, who in the absence of officers were acting as orderlies, had scarcely brought the news to Fleming, when the Dervish attack developed. The enemy, some 300 strong, rushed with great determination upon the baggage, and the escort of 120 Arab irregulars at once broke and fled. The situation became desperate; but Ruthven with thirty-four Supply Department camel-men hastened to meet the exultant enemy and protect the baggage column, and the transport was stubbornly defended. In spite of all their efforts the rear of the baggage column was broken and cut up. The survivors escaped along the saddleback. The British officers, with their small following, fell back towards their main body, hotly pressed by the enemy. At this moment Captain Ruthven observed one of his native officers, lying wounded on the ground, about to fall into the hands of the Dervishes and perish miserably. He immediately went back and, being a man of great physical strength, carried the body off in his arms. The enemy were, however, so close that he was three times compelled to set his burden down and defend himself with his revolver. Meanwhile the retirement towards the main body continued and accelerated. Colonel Parsons and his force were now between two fires. The frontal attack was within 200 yards. The rear attack, flushed with success, were hurrying impetuously forward. The defeat and consequent total destruction of the Kassala column appeared certain. But in the nick of time the Dervish frontal attack, which had been suffering heavily from the fire of the troops, wavered; and when the Arab battalion and the 16th Egyptians advanced upon them to complete their discomfiture, they broke and fled. Colonel Parsons at once endeavoured to meet the rear attack. The Arab battalion, whose valour was more admirable than their discipline, continued to pursue the beaten enemy down the hill; but the 16th Egyptians, on being called upon by their commanding officer, Captain McKerrell, faced steadily about and turned to encounter the fresh attack. The heavy fire of the regular battalion checked the Dervish advance, and Captain Fleming, the rest of the dismounted camel-men, and Ruthven still carrying his native officer, found safety in their ranks. [For his gallantry on this occasion Captain Ruthven has since received the Victoria Cross.] A short fierce musketry combat followed at a range of less than a hundred yards, at the end of which the assailants of the baggage convoy were completely repulsed. The action was now practically over and success was won. The Arab battalion, and those of the irregulars that had rallied, advanced and drove the enemy before them towards Gedaref, until at ten o\u0027clock, both their front and rear attacks having failed, the Dervishes abandoned all resistance and a general rout ensued. No cavalry or artillery being available, further pursuit was impossible. The town of Gedaref surrendered at noon. The Dervish Emir, Nur Angara, who with 200 black riflemen and two brass guns had been left in command of the garrison, made haste to submit. The remainder of the Dervishes, continuing their flight under the Emir Saadalla, hurried to tell the tale of defeat to Ahmed Fedil. The casualties suffered by the Kassala column in the action were severe in proportion to their numbers and the duration of the fight. The seven British officers escaped untouched; but of the 1,400 soldiers and irregulars engaged, 51 were killed and 80 wounded—a total of 131. The Dervishes left 500 dead on the field, including four Emirs of rank. The victory had been won, the enemy were routed, and the town was taken: it had now to be defended. Colonel Parsons took possession of the principal buildings, and began immediately to put them in a state of defence. This was fortunately an easy matter. The position was good and adaptable. It consisted of three large enclosures, capable of holding the entire force, situated in echelon, so as to protect each other by their fire, and with strong brick walls six feet high. All were at once set to work to clear the approaches, to level the mud houses without, and to build ramparts or banquettes within the walls. The three enclosures thus became three forts, and in the principal work the two captured brass guns were mounted, in small bastions thrown out from the north and west corners. While the infantry were thus engaged, Ruthven and his camel-men made daily reconnaissances of the surrounding country, and eagerly looked for the first appearance of Ahmed Fedil. By great good fortune a convoy of ammunition from Mugatta reached Gedaref on the afternoon of the 27th. At dawn the next day Ruthven reported that the advance guard of Ahmed Fedil was approaching the town. The attack began at half-past eight. The Dervishes, who fought with their customary gallantry, simultaneously assaulted the north, south, and west faces of the defences. Creeping forward through the high doura, they were able to get within 300 yards of the enclosures. But the intervening space had been carefully cleared of cover, and was swept by the musketry of the defenders. All attempts to cross this ground—even the most determined rushes—proved vain. While some made hopeless charges towards the walls, others crowded into a few straw shelters and mud huts which the troops had not found opportunity to remove, and thence maintained a ragged fire. After an hour\u0027s heavy fusillade the attack weakened, and presently ceased altogether. At ten o\u0027clock, however, strong reinforcements having come up, the Dervishes made a second attempt. They were again repulsed, and at a quarter to eleven, after losing more than 500 men in killed and wounded, Ahmed Fedil admitted his defeat and retired to a clump of palm-trees two miles to the west of the town. The casualties among the defenders were five men killed, one British officer (Captain Dwyer) and thirteen men wounded. The Dervishes remained for two days in the palm grove, and their leader repeatedly endeavoured to induce them to renew the attack. But although they closely surrounded the enclosures, and maintained a dropping fire, they refused to knock their heads against brick walls a third time; and on the 1st of October Ahmed Fedil was forced to retire to a more convenient camp eight miles to the southward. Here for the next three weeks he remained, savage and sulky; and the Kassala column were content to keep to their defences. A few convoys from Mugatta made their way into the forts under the cover of darkness, but for all practical purposes the blockade of the garrison was complete. Their losses in action had reduced their strength. They were not abundantly supplied with ammunition. The smell of the putrefying corpses which lay around the walls and in the doura crop, together with the unhealthy climate and the filth of the town, was a fertile source of disease. A painful and racking fever afflicted all ranks, and at one time as many as 270 of the 400 regular soldiers were prostrated. The recurring night alarms added to the fatigues of the troops and the anxieties of the seven officers. The situation was indeed so unsatisfactory that Colonel Parsons was compelled to ask for assistance. Major-General Rundle, who in the Sirdar\u0027s absence held the chief command, immediately organised a relief expedition. The IXth, XIIth, and half of the XIIIth Soudanese, with three companies of the Camel Corps, under Colonel Collinson, were at once sent from Omdurman to the mouth of the Rahad river. The infantry were conveyed in steamers; the Camel Corps marched along the bank, completing the whole distance of 130 miles in fifty-six hours. The Blue Nile garrisons, with the exception of the post at Rosaires, were also concentrated. By the 8th of October the whole force was collected at Abu Haraz. Five hundred camels, which had marched from Omdurman, and every available local beast of burden joined the transport of the column. On the 9th the XIIth Soudanese started up the Rahad river for Ain el Owega. From this point the road leaves the river and strikes across the desert to Gedaref, a distance of 100 miles; and in the whole distance water is only found at the wells of El Kau. Owing to this scarcity of water it was necessary to carry a supply with the troops. The transport being insufficient to provide for the whole force, the march had to be made in two columns. The Camel Corps and the XIIth Soudanese, about 1,200 strong, set forth under Colonel Collinson from Ain el Owega on the 17th, and reached Gedaref safely on the 22nd. Warned of their arrival, Ahmed Fedil, having made a feeble night attack which was repulsed by the garrison with a loss to themselves of two Soudanese wounded, realised that he had now no chance of recapturing the town. Preparations were indeed made to attack him; but on the 23rd of October, when a reconnaissance was made in the direction of his camp, the Dervish force was seen moving off in a southerly direction, their retreat covered by a strong rearguard, which was intended to perform the double duty of protecting the retirement and preventing desertion. The operations conducted by Colonel Parsons thus ended in complete success. Great difficulties were overcome, great perils were encountered, great results were obtained. But while we applaud the skill of the commander and the devotion of his subordinates, it is impossible not to criticise the rash and over-confident policy which sent such a weak and ill-equipped force on so hazardous an enterprise. The action of Gedaref, as has been shown, was, through no fault of the officers or men of the expedition, within an ace of being a disaster. But there were other critical occasions when only the extraordinary good fortune which attended the force saved it from destruction. First, the column was not discovered until it reached Mugatta; secondly, it was not attacked in the thick bush; thirdly, the Dervishes gave battle in the open instead of remaining within their walls, whence the troops could not have driven them without artillery; and, fourthly, the reserve ammunition arrived before the attack of Ahmed Fedil. After his defeat before Gedaref, Ahmed Fedil reverted to his intention of joining the Khalifa in Kordofan, and he withdrew southwards towards the Dinder river with a following that still numbered more than 5,000. To pass the Nile in the face of the gunboats appeared impossible. He did not, however, believe that steamers could navigate the higher reaches of the rivers, and in the hopes of finding a safe crossing-place he directed his march so as to strike the Blue Nile south of Karkoj. Moving leisurely, and with frequent delays to pillage the inhabitants, he arrived on the Dinder, twenty-five miles to the east of Karkoj, on the 7th of November. Here he halted to reconnoitre. He had trusted in the Karkoj-Rosaires reach being too shallow for the gunboats; but he found two powerful vessels already patrolling it. Again frustrated, he turned southwards, meaning to cross above the Rosaires Cataract, which was without doubt impassable to steamers. On the 22nd of October Colonel Lewis, with two companies of the Camel Corps and three squadrons of cavalry, started from Omdurman with the object of marching through the centre of the Ghezira and of re-establishing the Egyptian authority. His progress was in every way successful. The inhabitants were submissive, and resigned themselves with scarcely a regret to orderly government. Very little lawlessness had followed the defeat of the Khalifa, and whatever plundering there had been was chiefly the work of the disbanded irregulars who had fought at Omdurman under Major Wortley\u0027s command on the east bank of the Nile. In every village Sheikhs were appointed in the name of the Khedive, and the officers of the cavalry column concerned themselves with many difficult disputes about land, crops, and women—all of which they settled to their satisfaction. Marching through Awamra, Haloosen, and Mesalamia, Colonel Lewis reached Karkoj on the 7th of November, almost at the same time that Ahmed Fedil arrived on the Dinder. For the next six weeks the movements of the two forces resembled a game of hide-and-seek. Ahmed Fedil, concealed in the dense forest and jungle of the east bank, raided the surrounding villages and worked his way gradually towards the Rosaires Cataract. Colonel Lewis, perplexed by false and vague information, remained halted at Karkoj, despatched vain reconnaissances in the hopes of obtaining reliable news, revolved deep schemes to cut off the raiding parties, or patrolled the river in the gunboats. And meanwhile sickness fell upon his force. The malarial fever, which is everywhere prevalent on the Blue Nile in the autumn, was now at its height. More than 30 per cent of every garrison and every post were affected. The company holding Rosaires were stricken to a man, and only the two British officers remained fit for duty. The cavalry force which had marched through the Ghezira suffered the most severely. One after another every British officer was stricken down and lay burning but helpless beneath the palm-leaf shelters or tottered on to the friendly steamers that bore the worst cases north. Of the 460 men who composed the force, ten had died and 420 were reported unfit for duty within a month of their arrival at Karkoj. During the end of November the Sheikh Bakr, who had deserted the Dervishes after their retreat from Gedaref, arrived at Karkoj with 350 irregulars. He claimed to have defeated his former chief many times, and produced a sack of heads as evidence of his success. His loyalty being thus placed beyond doubt, he was sent to keep contact with the Dervishes and encouraged to the greatest efforts by the permission to appropriate whatever spoils of war he could capture. Meanwhile Ahmed Fedil was working his way slowly southward along a deep khor which runs almost parallel to the Blue Nile and is perhaps twenty miles from it. As soon as the position of the Dervish Emir was definitely known, Colonel Lewis moved his force, which had been strengthened by detachments of the Xth Soudanese, from Karkoj to Rosaires. Here he remained for several days, with but little hope of obstructing the enemy\u0027s passage of the river. On the 20th of December, however, full—though, as was afterwards found, not very accurate—information was received. It was reported that on the 18th Ahmed Fedil had reached the village of Dakhila, about twenty miles south of the Rosaires post; that he himself had immediately crossed with his advanced guard, and was busily passing the women and children across the river on rafts. On the 22nd, therefore, Colonel Lewis hurried the Sheikh Bakr up the west bank to cut off their flocks and harass the Dervishes who had already crossed the river. The irregulars accordingly departed; and the next day news was brought that the Dervish force was almost equally divided by the Blue Nile, half being on one bank and half on the other. At midday on the 24th the gunboats Melik and Dal arrived from Omdurman with a detachment of 200 more men of the Xth Soudanese under Major Fergusson, and thirty men of the IXth Soudanese under Captain Sir Henry Hill. With this addition the force at Colonel Lewis\u0027s disposal consisted of half the Xth Soudanese, a small detachment of the IXth Soudanese, two Maxim guns, and a doctor. Besides the regular troops, there were also the band of irregulars under the Sheikh Bakr, numbering 380 men, 100 men under the Sheikh of Rosaires, and a few other unclassified scallywags. Colonel Lewis determined to attack what part of Ahmed Fedil\u0027s force still remained on the east bank of the river, and on Christmas Day, at five o\u0027clock in the afternoon, he marched with every man he could muster in the direction of Dakhila. Moving in single file along a track which led through a dense forest of thorny trees, the column reached Adu Zogholi, a village thought to be half, but really not one-third, of the way to Dakhila, at eleven o\u0027clock on Christmas night. Here they bivouacked until 3 A.M. on the 26th, when the march was resumed in the same straggling order through the same tangled scrub. Daylight found them still several miles from the Dervish position, and it was not until eight o\u0027clock that the enemy\u0027s outposts were discovered. After a few shots the Arab picket fell back, and the advance guard, hurrying after them, emerged from the forest upon the open ground of the river bank, broken only by palms and patches of high grass. Into this space the whole column gradually debouched. Before them the Blue Nile, shining in the early sunlight like a silver band, flowed swiftly; and beyond its nearest waters rose a long, bare, gravel island crowned with clumps of sandhills, to the shelter of which several hundred Dervishes, surprised by the sudden arrival of the troops, were scampering. Beyond the island, on the tall tree-clad cliff of the further bank, other minute figures moved and bustled. The discordant sound of horns and drums floating across the waters, and the unfurling of many bright flags, proclaimed the presence and the intention of the hostile force. The Dervish position was well chosen and of great defensive strength. A little to the north of Dakhila the Blue Nile bifurcates—one rapid but shallow stream flowing fairly straight under the east bank; another very deep stream running in a wide curve under the west bank, cutting into it so that it is precipitous. These two branches of the river enclose an island a mile and a quarter long by 1,400 yards wide, and on this island, surrounded by a natural moat of swiftly flowing water, was the Dervish dem. The western side of the island rose into a line of low sandhills covered with scrub and grass, with a steep reverse slope towards the foreshore of the river-bank; and here, in this excellent cover, what eventually proved to be three-quarters of the force of Ahmed Fedil were drawn up. Backed against the deep arm of the river they had no choice, nor indeed any other wish, but to fight. Before them stretched a bare slope of heavy shingle, 1,000 yards wide, over which their enemies must advance to the attack, Behind them the high precipitous west bank of the river, which rose in some places to a height of fifty feet, was lined with the 300 riflemen who had already crossed; and from this secure position Ahmed Fedil and four of his Emirs were able to watch, assist, and direct the defence of the island. The force on the island was under the sole command of the Emir Saadalla, of Gedaref repute; but, besides his own followers, most of the men of the four other Emirs were concentrated there. The prospect was uninviting. Colonel Lewis discovered that he had absurdly under-rated the strength and discipline of the Dervish force. It had been continually reported that the defeats at Gedaref had demoralised them, and that their numbers did not exceed 2,000 men. Moreover, he had marched to the attack in the belief that they were equally divided on both sides of the river. Retreat was, however, impossible. Strong as was the position of the enemy, formidable as was their strength, the direct assault was actually safer than a retirement through the nineteen miles of gloomy forest which lay between the adventurous column and Rosaires. The British officer immediately determined to engage. At nine o\u0027clock the two Maxims, which represented the artillery of the little force, came into action in good positions, while the Xth Soudanese and most of the irregulars lined the east bank. Musketry and Maxim fire was now opened at long range. The Dervishes replied, and as the smoke of their rifles gradually revealed their position and their numbers, it soon became evident that no long-range fire could dislodge them; and Colonel Lewis resolved, in spite of the great disparity of force and disadvantage of ground, to attack them with the bayonet. Some time was spent in finding fords across the interposing arm of the river, and it was not until past ten o\u0027clock that Bakr\u0027s men crossed on to the island, and, supported by a company of the Xth Soudanese, advanced towards the enemy\u0027s right and took up a position at about 800 yards from their line, to cover the rest of the passage. Colonel Lewis now determined to turn the enemy\u0027s left from the north, attack them in flank, and roll them into the deep part of the river. With the Xth Soudanese, under Colonel Nason and Major Fergusson, he marched northwards along the river\u0027s edge, sheltering as far as possible under the curve of the bank from the fire, which now began to cause casualties. Having reached the position from which it was determined to deliver the attack, the battalion deployed into line, and, changing front half left, advanced obliquely by alternate companies across the bare shingle towards the sandhills. As they advanced, a galling fire was opened upon the left flank by two hundred Dervishes admirably placed on a knoll. Major Fergusson was detached with one company to dislodge them. The remaining four companies continued the attack. The Dervish musketry now became intense. The whole front of the island position was lined with smoke, and behind it, from the high cliff of the west bank, a long half-circle of riflemen directed a second tier of converging bullets upon the 400 charging men. The shingle jumped and stirred in all directions as it was struck. A hideous whistling filled the air. The Soudanese began to drop on all sides, \u0027just like the Dervishes at Omdurman,\u0027 and the ground was soon dotted with the bodies of the killed and wounded. \u0027We did not,\u0027 said an officer, \u0027dare to look back.\u0027 But undaunted by fire and cross-fire, the heroic black soldiers—demons who would not be denied—pressed forward without the slightest check or hesitation, and, increasing their pace to a swift run in their eagerness to close with the enemy, reached the first sandhills and found cover beneath them. A quarter of the battalion had already fallen, and lay strewn on the shingle. The rapidity of their advance had exhausted the Soudanese, and Lewis ordered Nason to halt under cover of the sandhills for a few minutes, so that the soldiers might get their breath before the final effort. Thereupon the Dervishes, seeing that the troops were no longer advancing, and believing that the attack was repulsed, resolved to clinch the matter. Ahmed Fedil from the west bank sounded the charge on drum and bugle, and with loud shouts of triumph and enthusiasm the whole force on the island rose from among the upper sandhills, and, waving their banners, advanced impetuously in counter-attack. But the Xth Soudanese, panting yet unconquerable, responded to the call of their two white officers, and, crowning the little dunes behind which they had sheltered, met the exultant enemy with a withering fire and a responding shout. The range was short and the fire effective. The astonished Arabs wavered and broke; and then the soldiers, nobly led, swept forward in a long scattered line and drove the enemy from one sandy ridge to another—drove them across the rolling and uneven ground, every fold of which contained Dervishes—drove them steadily back over the sandhills, until all who were not killed or wounded were penned at the extreme southern end of the island, with the deep unfordable arm of the river behind them and the fierce black soldiers, roused to fury by their losses, in front. The Sheikh Bakr, with his men and the rest of the irregulars, joined the victorious Soudanese, and from the cover of the sandhills, now in the hands of the troops, a terrible fire was opened upon the Dervishes crowded together on the bare and narrow promontory and on the foreshore. Some tried to swim across the rushing river to their friends on the west bank. Many were drowned—among them Saadalla, who sank horse and man beneath the flood. Others took refuge from the fire by standing up to their necks in the stream. The greater part, however, escaped to a smaller island a little further up the river. But the cover was bad, the deep water prevented further flight, and, after being exposed for an hour and a half to the musketry of two companies, the survivors—300 strong—surrendered. By 11.30 the whole island was in the possession of the troops. It was, however, still swept and commanded by the fire from the west bank. The company which had been detached to subdue the Dervish riflemen were themselves pinned behind their scanty cover. Major Fergusson was severely wounded and a third of his men were hit. To withdraw this company and the wounded was a matter of great difficulty; and it was necessary to carry the Maxims across the river and bring them into action at 400 yards. Firing ceased at last at three o\u0027clock, and the victors were left to measure their losses and their achievement. There was neither time nor opportunity to count the enemy\u0027s dead, but it is certain that at least 500 Arabs were killed on the island. Two thousand one hundred and twenty-seven fighting men and several hundred women and children surrendered. Five hundred and seventy-six rifles, large quantities of ammunition, and a huge pile of spears and swords were captured. Ahmed Fedil, indeed, escaped with a numerous following across the Ghezira, but so disheartened were the Dervishes by this crushing defeat that the whole force surrendered to the gunboat Metemma at Reng, on the White Nile, on the 22nd of January, and their leader was content to fly with scarcely a dozen followers to join the Khalifa. The casualties among the troops in the action amounted to 41 killed and 145 wounded, including Major Fergusson; and the Xth Soudanese, on whom the brunt of the fighting fell, suffered a loss of 25 non-commissioned officers and men killed, 1 British officer, 6 native officers, and 117 non-commissioned officers and men wounded, out of a total strength of 511. The rest of the loss was among the irregulars, 495 of whom took part in the engagement.","sourceLink":"http://novel.tingroom.com/duanpian/2891/79970.html","bookId":1137,"book":{"id":1137,"title":"The River War","description":"简介： The north-eastern quarter of the continent of Africa is drained and watered by the Nile. Among and about the headstreams and tributaries of this mighty river lie the wide and fertile provinces of the Egyptian Soudan. Situated in the very centre of th...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2891","creation":"Aug 1, 2019 12:24:26 AM","modification":"Aug 1, 2019 12:24:26 AM"}}
