{"id":31669,"no":4,"title":"CHAPTER IV. VACILLATION.","content":"When the spring-time came, Sir Harry Hotspur with his wife and daughter, went up to London. During the last season the house in Bruton Street had been empty. He and his wife were then mourning their lost son, and there was no place for the gaiety of London in their lives. Sir Harry was still thinking of his great loss. He was always thinking of the boy who was gone, who had been the apple of his eye, his one great treasure, the only human being in the world whose superior importance to his own he had been ready, in his heart of hearts, to admit; but it was needful that the outer signs of sorrow should be laid aside, and Emily Hotspur was taken up to London, in order that she might be suited with a husband. That, in truth, was the reason of their going. Neither Sir Harry nor Lady Elizabeth would have cared to leave Cumberland had there been no such cause. They would have been altogether content to remain at home had Emily been obedient enough in the winter to accept the hand of the suitor proposed for her. \\n\\n \\n\\n The house was opened in Bruton Street, and Lord Alfred came to see them. So also did Cousin George. There was no reason why Cousin George should not come. Indeed, had he not done so, he must have been the most ungracious of cousins. He came, and found Lady Elizabeth and Emily at home. Emily told him that they were always there to receive visitors on Sundays after morning church, and then he came again. She had made no such communication to Lord Alfred, but then perhaps it would have been hardly natural that she should have done so. Lady Elizabeth, in a note which she had occasion to write to Lord Alfred, did tell him of her custom on a Sunday afternoon; but Lord Alfred took no such immediate advantage of the offer as did Cousin George. \\n\\n \\n\\n As regarded the outward appearance of their life, the Hotspurs were gayer this May than they had been heretofore when living in London. There were dinner-parties, whereas in previous times there had only been dinners at which a few friends might join them;—and there was to be a ball. There was a box at the Opera, and there were horses for the Park, and there was an understanding that the dealings with Madame Milvodi, the milliner, were to be as unlimited as the occasion demanded. It was perceived by every one that Miss Hotspur was to be settled in life. Not a few knew the story of Lord Alfred. Every one knew the facts of the property and Emily\u0027s position as heiress, though every one probably did not know that it was still in Sir Harry\u0027s power to leave every acre of the property to whom he pleased. Emily understood it all herself. There lay upon her that terrible responsibility of doing her best with the Hotspur interests. To her the death of her brother had at the time been the blackest of misfortunes, and it was not the less so now as she thought of her own position. She had been steady enough as to the refusal of Lord Alfred, knowing well enough that she cared nothing for him. But there had since come upon her moments almost of regret that she should have been unable to accept him. It would have been so easy a way of escape from all her troubles without the assistance of Madame Milvodi, and the opera-box, and the Park horses! At the time she had her own ideas about another man, but her ideas were not such as to make her think that any further work with Madame Milvodi and the opera-box would be unnecessary. \\n\\n \\n\\n Then came the question of asking Cousin George to the house. He had already been told to come on Sundays, and on the very next Sunday had been there. He had given no cause of offence at Humblethwaite, and Lady Elizabeth was of opinion that he should be asked to dinner. If he were not asked, the very omission would show that they were afraid of him. Lady Elizabeth did not exactly explain this to her husband,—did not accurately know that such was her fear; but Sir Harry understood her feelings, and yielded. Let Cousin George be asked to dinner. \\n\\n \\n\\n Sir Harry at this time was vacillating with more of weakness than would have been expected from a man who had generally been so firm in the affairs of his life. He had been quite clear about George Hotspur, when those inquiries of his were first made, and when his mind had first accepted the notion of Lord Alfred as his chosen son-in-law. But now he was again at sea. He was so conscious of the importance of his daughter\u0027s case, that he could not bring himself to be at ease, and to allow himself to expect that the girl would, in the ordinary course of nature, dispose of her young heart not to her own injury, as might reasonably be hoped from her temperament, her character, and her education. He could not protect himself from daily and hourly thought about it. Her marriage was not as the marriage of other girls. The house of Hotspur, which had lived and prospered for so many centuries, was to live and prosper through her; or rather mainly through the man whom she should choose as her husband. The girl was all-important now, but when she should have once disposed of herself her importance would be almost at an end. Sir Harry had in the recess of his mind almost a conviction that, although the thing was of such utmost moment, it would be better for him, better for them all, better for the Hotspurs, that the matter should be allowed to arrange itself than that there should be any special judgment used in selection. He almost believed that his girl should be left to herself, as are other girls. But the thing was of such moment that he could not save himself from having it always before his eyes. \\n\\n \\n\\n And yet he knew not what to do; nor was there any aid forthcoming from Lady Elizabeth. He had tried his hand at the choice of a proper husband, and his daughter would have none of the man so chosen. So he had brought her up to London, and thrown her as it were upon the market. Let Madame Milvodi and the opera-box and the Park horses do what they could for her. Of course a watch should be kept on her;—not from doubt of her excellence, but because the thing to be disposed of was so all-important, and the girl\u0027s mode of disposing of it might, without disgrace or fault on her part, be so vitally prejudicial to the family! \\n\\n \\n\\n For, let it be remembered, no curled darling of an eldest son would suit the exigencies of the case, unless such eldest son were willing altogether to merge the claims of his own family, and to make himself by name and purpose a Hotspur. Were his child to present to him as his son-in-law some heir to a noble house, some future earl, say even a duke in embryo, all that would be as nothing to Sir Harry. It was not his ambition to see his daughter a duchess. He wanted no name, or place, or dominion for any Hotspur greater or higher or more noble than those which the Hotspurs claimed and could maintain for themselves. To have Humblethwaite and Scarrowby lost amidst the vast appanages and domains of some titled family, whose gorgeous glories were new and paltry in comparison with the mellow honours of his own house, would to him have been a ruin to all his hopes. There might, indeed, be some arrangement as to the second son proceeding from such a marriage,—as to a future chance Hotspur; but the claims of the Hotspurs were, he thought, too high and too holy for such future chance; and in such case, for one generation at least, the Hotspurs would be in abeyance. No: it was not that which he desired. That would not suffice for him. The son-in-law that he desired should be well born, a perfect gentleman, with belongings of whom he and his child might be proud; but he should be one who should be content to rest his claims to material prosperity and personal position on the name and wealth that he would obtain with his wife. Lord Alfred had been the very man; but then his girl would have none of Lord Alfred! Eldest sons there might be in plenty ready to take such a bride; and were some eldest son to come to him and ask for his daughter\u0027s hand, some eldest son who would do so almost with a right to claim it if the girl\u0027s consent were gained, how could he refuse? And yet to leave a Hotspur behind him living at Humblethwaite, and Hotspurs who should follow that Hotspur, was all in all to him. \\n\\n \\n\\n Might he venture to think once again of Cousin George? Cousin George was there, coming to the house, and his wife was telling him that it was incumbent on them to ask the young man to dinner. It was incumbent on them, unless they meant to let him know that he was to be regarded absolutely as a stranger,—as one whom they had taken up for a while, and now chose to drop again. A very ugly story had reached Sir Harry\u0027s ears about Cousin George. It was said that he had twice borrowed money from the money-lenders on his commission, passing some document for security of its value which was no security, and that he had barely escaped detection, the two Jews knowing that the commission would be forfeited altogether if the fraud were brought to light. The commission had been sold, and the proceeds divided between the Jews, with certain remaining claims to them on Cousin George\u0027s personal estate. Such had been the story which in a vague way had reached Sir Harry\u0027s ears. It is not easily that such a man as Sir Harry can learn the details of a disreputable cousin\u0027s life. Among all his old friends he had none more dear to him than Lord Milnthorp; and among his younger friends none more intimate than Lord Burton, the eldest son of Lord Milnthorp, Lord Alfred\u0027s brother. Lord Burton had told him the story, telling him at the same time that he could not vouch for its truth. \"Upon my word, I don\u0027t know,\" said Lord Burton, when interrogated again. \"I think if I were you I would regard it as though I had never heard it. Of course, he was in debt.\" \\n\\n \\n\\n \"That is altogether another thing,\" said Sir Harry. \\n\\n \\n\\n \"Altogether! I think that probably he did pawn his commission. That is bad, but it isn\u0027t so very bad. As for the other charge against him, I doubt it.\" So said Lord Burton, and Sir Harry determined that the accusation should go for nothing. \\n\\n \\n\\n But his own child, his only child, the transmitter of all the great things that fortune had given to him; she, in whose hands were to lie the glories of Humblethwaite and Scarrowby; she, who had the giving away of the honour of their ancient family,—could she be trusted to one of whom it must be admitted that all his early life had been disreputable, even if the world\u0027s lenient judgment in such matters should fail to stigmatize it as dishonourable? In other respects, however, he was so manifestly the man to whom his daughter ought to be given in marriage! By such arrangement would the title and the property be kept together,—and by no other which Sir Harry could now make, for his word had been given to his daughter that she was to be his heiress. Let him make what arrangements he might, this Cousin George, at his death, would be the head of the family. Every \"Peerage\" that was printed would tell the old story to all the world. By certain courtesies of the law of descent his future heirs would be Hotspurs were his daughter married to Lord Alfred or the like; but the children of such a marriage would not be Hotspurs in very truth, nor by any courtesy of law, or even by any kindness of the Minister or Sovereign, could the child of such a union become the baronet, the Sir Harry of the day, the head of the family. The position was one which no Sovereign and no Minister could achieve, or touch, or bestow. It was his, beyond the power of any earthly potentate to deprive him of it, and would have been transmitted by him to a son with as absolute security. But—alas! alas! \\n\\n \\n\\n Sir Harry gave no indication that he thought it expedient to change his mind on the subject. When Lady Elizabeth proposed that Cousin George should be asked to dinner, he frowned and looked black as he acceded; but, in truth, he vacillated. The allurements on that side were so great that he could not altogether force upon himself the duty of throwing them from him. He knew that Cousin George was no fitting husband for his girl, that he was a man to whom he would not have thought of giving her, had her happiness been his only object. And he did not think of so bestowing her now. He became uneasy when he remembered the danger. He was unhappy as he remembered how amusing, how handsome, how attractive was Cousin George. He feared that Emily might like him!—by no means hoped it. And yet he vacillated, and allowed Cousin George to come to the house, only because Cousin George must become, on his death, the head of the Hotspurs. \\n\\n \\n\\n Cousin George came on one Sunday, came on another Sunday, dined at the house, and was of course asked to the ball. But Lady Elizabeth had so arranged her little affairs that when Cousin George left Bruton Street on the evening of the dinner party he and Emily had never been for two minutes alone together since the family had come up to London. Lady Elizabeth herself liked Cousin George, and, had an edict to that effect been pronounced by her husband, would have left them alone together with great maternal satisfaction. But she had been told that it was not to be so, and therefore the young people had never been allowed to have opportunities. Lady Elizabeth in her very quiet way knew how to do the work of the world that was allotted to her. There had been other balls, and there had been ridings in the Park, and all the chances of life which young men, and sometimes young women also, know so well how to use; but hitherto Cousin George had kept, or had been constrained to keep, his distance. \\n\\n \\n\\n \"I want to know, Mamma,\" said Emily Hotspur, the day before the ball, \"whether Cousin George is a black sheep or a white sheep?\" \\n\\n \\n\\n \"What do you mean, my dear, by asking such a question as that?\" \\n\\n \\n\\n \"I don\u0027t like black sheep. I don\u0027t see why young men are to be allowed to be black sheep; but yet you know they are.\" \\n\\n \\n\\n \"How can it be helped?\" \\n\\n \\n\\n \"People should not notice them, Mamma.\" \\n\\n \\n\\n \"My dear, it is a most difficult question,—quite beyond me, and I am sure beyond you. A sheep needn\u0027t be black always because he has not always been quite white; and then you know the black lambs are just as dear to their mother as the white.\" \\n\\n \\n\\n \"Dearer, I think.\" \\n\\n \\n\\n \"I quite agree with you, Emily, that in general society black sheep should be avoided.\" \\n\\n \\n\\n \"Then they shouldn\u0027t be allowed to come in,\" said Emily. Lady Elizabeth knew from this that there was danger, but the danger was not of a kind which enabled her specially to consult Sir Harry. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2740/75436.html","bookId":1381,"book":{"id":1381,"title":"Sir Harry Hotspur of Humblethwaite","description":"简介： Sir Harry Hotspur of Humblethwaite was a mighty person in Cumberland, and one who well understood of what nature were the duties, and of what sort the magnificence, which his position as a great English commoner required of him. He had twenty thousan...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2740","creation":"Aug 1, 2019 12:24:58 AM","modification":"Aug 1, 2019 12:24:58 AM"}}
