{"id":31672,"no":7,"title":"CHAPTER VII. LADY ALTRINGHAM.","content":"There was one more meeting between Cousin George and Emily Hotspur, before Sir Harry left London with his wife and daughter. On the Sunday afternoon following the ball he called in Bruton Street, and found Lord Alfred there. He knew that Lord Alfred had been refused, and felt it to be a matter of course that the suit would be pressed again. Nevertheless, he was quite free from animosity to Lord Alfred. He could see at a glance that there was no danger for him on that side. Lord Alfred was talking to Lady Elizabeth when he entered, and Emily was engaged with a bald-headed old gentleman with a little ribbon and a star. The bald-headed old gentleman soon departed, and then Cousin George, in some skilfully indirect way, took an opportunity of letting Emily know that he should not go to Goodwood this July. \n \n \"Not go to Goodwood?\" said she, pretending to laugh. \"It will be most unnatural, will it not? They\u0027ll hardly start the horses without you, I should think.\" \n \n \"They\u0027ll have to start them without me, at any rate.\" Of course she understood what he meant, and understood also why he had told her. But if his promise were true, so much good had been done,—and she sincerely believed that it was true. In what way could he make love to her better than by refraining from his evil ways for the sake of pleasing her? Other bald-headed old gentlemen and bewigged old ladies came in, and he had not time for another word. He bade her adieu, saying nothing now of his hope of meeting her in the autumn, and was very affectionate in his farewell to Lady Elizabeth. \"I don\u0027t suppose I shall see Sir Harry before he starts. Say \u0027good-bye\u0027 for me.\" \n \n \"I will, George.\" \n \n \"I am so sorry you are going. It has been so jolly, coming in here of a Sunday, Lady Elizabeth, and you have been so good to me. I wish Scarrowby was at the bottom of the sea.\" \n \n \"Sir Harry wouldn\u0027t like that at all.\" \n \n \"I dare say not. And as such places must be, I suppose they ought to be looked after. Only why in June? Good-bye! We shall meet again some day.\" But not a word was said about Humblethwaite in September. He did not choose to mention the prospect of his autumn visit, and she did not dare to do so. Sir Harry had not renewed the offer, and she would not venture to do so in Sir Harry\u0027s absence. \n \n June passed away,—as Junes do pass in London,—very gaily in appearance, very quickly in reality, with a huge outlay of money and an enormous amount of disappointment. Young ladies would not accept, and young men would not propose. Papas became cross and stingy, and mammas insinuated that daughters were misbehaving. The daughters fought their own battles, and became tired in the fighting of them, and many a one had declared to herself before July had come to an end that it was all vanity and vexation of spirit. \n \n The Altringhams always went to Goodwood,—husband and wife. Goodwood and Ascot for Lady Altringham were festivals quite as sacred as were Epsom and Newmarket for the Earl. She looked forward to them all the year, learned all she could about the horses which were to run, was very anxious and energetic about her party, and, if all that was said was true, had her little book. It was an institution also that George Hotspur should be one of the party; and of all the arrangements usually made, it was not the one which her Ladyship could dispense with the easiest. George knew exactly what she liked to have done, and how. The Earl himself would take no trouble, and desired simply to be taken there and back and to find everything that was wanted the very moment it was needed. And in all such matters the Countess chose that the Earl should be indulged. But it was necessary to have some one who would look after something—who would direct the servants, and give the orders, and be responsible. George Hotspur did it all admirably, and on such occasions earned the hospitality which was given to him throughout the year. At Goodwood he was almost indispensable to Lady Altringham; but for this meeting she was willing to dispense with him. \"I tell you, Captain Hotspur, that you\u0027re not to go,\" she said to him. \n \n \"Nonsense, Lady Altringham.\" \n \n \"What a child you are! Don\u0027t you know what depends on it?\" \n \n \"It does not depend on that.\" \n \n \"It may. Every little helps. Didn\u0027t you promise her that you wouldn\u0027t?\" \n \n \"She didn\u0027t take it in earnest.\" \n \n \"I tell you, you know nothing about a woman. She will take it very much in earnest if you break your word.\" \n \n \"She\u0027ll never know.\" \n \n \"She will. She\u0027ll learn it. A girl like that learns everything. Don\u0027t go; and let her know that you have not gone.\" \n \n George Hotspur thought that he might go, and yet let her know that he had not gone. An accomplished and successful lie was to him a thing beautiful in itself,—an event that had come off usefully, a piece of strategy that was evidence of skill, so much gained on the world at the least possible outlay, an investment from which had come profit without capital. Lady Altringham was very hard on him, threatening him at one time with the Earl\u0027s displeasure, and absolute refusal of his company. But he pleaded hard that his book would be ruinous to him if he did not go; that this was a pursuit of such a kind that a man could not give it up all of a moment; that he would take care that his name was omitted from the printed list of Lord Altringham\u0027s party; and that he ought to be allowed this last recreation. The Countess at last gave way, and George Hotspur did go to Goodwood. \n \n With the success or failure of his book on that occasion our story is not concerned. He was still more flush of cash than usual, having something left of his cousin\u0027s generous present. At any rate, he came to no signal ruin at the races, and left London for Castle Corry on the 10th of August without any known diminution to his prospects. At that time the Hotspurs were at Humblethwaite with a party; but it had been already decided that George should not prepare to make his visit till September. He was to write from Castle Corry. All that had been arranged between him and the Countess, and from Castle Corry he did write:— \n \n \n Dear Lady Elizabeth,—Sir Harry was kind enough to say last winter that I might come to Humblethwaite again this autumn. Will you be able to take me in on the 2nd September? we have about finished with Altringham\u0027s house, and Lady A. has had enough of me. They remain here till the end of this month. With kind regards to Sir Harry and Emily, \n \n Believe me, yours always, \n \n George Hotspur. \n \n \n Nothing could be simpler than this note, and yet every word of it had been weighed and dictated by Lady Altringham. \"That won\u0027t do at all. You mustn\u0027t seem to be so eager,\" she had said, when he showed her the letter as prepared by himself. \"Just write as you would do if you were coming here.\" Then she sat down, and made the copy for him. \n \n There was very great doubt and there was much deliberation over that note at Humblethwaite. The invitation had doubtless been given, and Sir Harry did not wish to turn against his own flesh and blood,—to deny admittance to his house to the man who was the heir to his title. Were he to do so, he must give some reason; he must declare some quarrel; he must say boldly that all intercourse between them was to be at an end; and he must inform Cousin George that this strong step was taken because Cousin George was a—blackguard! There was no other way of escape left. And then Cousin George had done nothing since the days of the London intimacies to warrant such treatment; he had at least done nothing to warrant such treatment at the hands of Sir Harry. And yet Sir Harry thoroughly wished that his cousin was at Jerusalem. He still vacillated, but his vacillation did not bring him nearer to his cousin\u0027s side of the case. Every little thing that he saw and heard made him know that his cousin was a man to whom he could not give his daughter even for the sake of the family, without abandoning his duty to his child. At this moment, while he was considering George\u0027s letter, it was quite clear to him that George should not be his son-in-law; and yet the fact that the property and the title might be brought together was not absent from his mind when he gave his final assent. \"I don\u0027t suppose she cares for him,\" he said to his wife. \n \n \"She\u0027s not in love with him, if you mean that.\" \n \n \"What else should I mean?\" he said, crossly. \n \n \"She may learn to be in love with him.\" \n \n \"She had better not. She must be told. He may come for a week. I won\u0027t have him here for longer. Write to him and say that we shall be happy to have him from the second to the ninth. Emily must be told that I disapprove of him, but that I can\u0027t avoid opening my house to him.\" \n \n These were the most severe words he had ever spoken about Cousin George, but then the occasion had become very critical. Lady Elizabeth\u0027s reply was as follows:— \n \n \n My dear Cousin George,—Sir Harry and I will be very happy to have you on the second, as you propose, and hope you will stay till the eleventh. \n \n Yours sincerely, \n \n Elizabeth Hotspur. \n \n \n He was to come on a Saturday, but she did not like to tell him to go on a Saturday, because of the following day. Where could the poor fellow be on the Sunday? She therefore stretched her invitation for two days beyond the period sanctioned by Sir Harry. \n \n \"It\u0027s not very gracious,\" said George, as he showed the note to Lady Altringham. \n \n \"I don\u0027t like it the less on that account. It shows that they\u0027re afraid about her, and they wouldn\u0027t be afraid without cause.\" \n \n \"There is not much of that, I fancy.\" \n \n \"They oughtn\u0027t to have a chance against you,—not if you play your game well. Even in ordinary cases the fathers and mothers are beaten by the lovers nine times out of ten. It is only when the men are oafs and louts that they are driven off. But with you, with your cousinship, and half-heirship, and all your practice, and the family likeness, and the rest of it, if you only take a little trouble—\" \n \n \"I\u0027ll take any amount of trouble.\" \n \n \"No, you won\u0027t. You\u0027ll deny yourself nothing, and go through no ordeal that is disagreeable to you. I don\u0027t suppose your things are a bit better arranged in London than they were in the spring.\" She looked at him as though waiting for an answer, but he was silent. \"It\u0027s too late for anything of that kind now, but still you may do very much. Make up your mind to this, that you\u0027ll ask Miss Hotspur to be your wife before you leave—what\u0027s the name of the place?\" \n \n \"I have quite made up my mind to that, Lady Altringham.\" \n \n \"As to the manner of doing it, I don\u0027t suppose that I can teach you anything.\" \n \n \"I don\u0027t know about that.\" \n \n \"At any rate I shan\u0027t try. Only remember this. Get her to promise to be firm, and then go at once to Sir Harry. Don\u0027t let there be an appearance of doubt in speaking to him. And if he tells you of the property,—angrily I mean,—then do you tell him of the title. Make him understand that you give as much as you get. I don\u0027t suppose he will yield at first. Why should he? You are not the very best young man about town, you know. But if you get her, he must follow. She looks like one that would stick to it, if she once had said it.\" \n \n Thus prompted George Hotspur went from Castle Corry to Humblethwaite. I wonder whether he was aware of the extent of the friendship of his friend, and whether he ever considered why it was that such a woman should be so anxious to assist him in making his fortune, let it be at what cost it might to others! Lady Altringham was not the least in love with Captain Hotspur, was bound to him by no tie whatsoever, would suffer no loss in the world should Cousin George come to utter and incurable ruin; but she was a woman of energy, and, as she liked the man, she was zealous in his friendship. \n \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2740/75439.html","bookId":1381,"book":{"id":1381,"title":"Sir Harry Hotspur of Humblethwaite","description":"简介： Sir Harry Hotspur of Humblethwaite was a mighty person in Cumberland, and one who well understood of what nature were the duties, and of what sort the magnificence, which his position as a great English commoner required of him. He had twenty thousan...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2740","creation":"Aug 1, 2019 12:24:58 AM","modification":"Aug 1, 2019 12:24:58 AM"}}
