{"id":26289,"no":14,"title":"CHAPTER XIV MARY CONSULTS MR. BATHURST","content":"There was a tap at the door. “May I come in?” It was Mary Considine’s voice. I remembered what she had asked me in the garden that morning. “I hope I’m not intruding,” she spoke in unusually low tones, “or not interrupting any important conference. Am I? Be sure and tell me if I am.” \n \n “Not at all,” responded Anthony. “Why do you ask?” \n \n “Because I wanted a little consultation with you, Mr. Bathurst—didn’t Bill tell you—I asked him to tell you this morning? Did you forget, Bill?” \n \n I pleaded guilty with apologies to both my companions. \n \n “I am entirely at your service,” exclaimed Anthony. “Where would you like this little chat to take place? Here? Or elsewhere?” \n \n “Here will be as convenient to me as anywhere, Mr. Bathurst—that is if you have no objection?” \n \n “I?” He laughingly disclaimed any such idea. “None at all. Now, what have you got to tell me?” \n 177 \n \n Mary shot him a swift glance from under those long-lashed lids of hers. “What makes you think I have anything to tell you, Mr. Bathurst?” she asked. \n \n He smiled one of his irresistibly-attractive smiles. “I think it’s a fairly safe conclusion to which to come. You want a consultation with me. You would hardly put it in that way if you required any information from me—would you—therefore, I imagine you have something to tell me. Am I wrong?” \n \n She flung herself on to the edge of the billiard-table and sat there—dainty and well-shod. She was always as fit as a fiddle and better at games than a good many men. She played a smashing good game of tennis, was a steady bat and bowled quite a good ball—slow, with a deceptive flight that did a little bit both ways—was a good hand with a golf-club, and could make a hundred on the billiard-table in double quick time. As I’ve said before in this history—Mary Considine was a peach. \n \n “No, you are not wrong, Mr. Bathurst. You are right, of course—but now that I’ve decided to tell it to you, and have arrived at the moment of the telling—I don’t know whether I should or whether it’s of the slightest importance—except to me—and—one other.” \n \n She stopped and Anthony waited for her to continue. \n \n It was plain to me, interested auditor that I was, that Mary was waiting for some sign of encouragement or approbation from Anthony—but it did not come. She glanced at him, but his eyes were inscrutable. \n 178 \n \n “You don’t help me much,” she said, rather deliciously. “You could—you know!” \n \n “I would much prefer you to tell your story entirely in your own way. It is impossible for me, at this stage of the conversation, to judge whether it will possess any significance—please proceed.” \n \n She looked rather aggrieved at this, and I wondered what was coming next. \n \n “I haven’t told my father. I haven’t told my mother—the only person that knows is my sister, Helen—Mrs. Arkwright, you know—I told her soon after it happened. I have had a talk with her over it, Mr. Bathurst, and she approves of my telling you.” She clasped her hands. “‘Nil nisi bonum de mortuis est,’ they say, don’t they, and although I’m not going to say anything at all bad—I feel that I’m betraying a confidence—exposing to the world something that he would have regarded as intimate and private—that’s why I hesitated and seemed to be in a difficulty just now.” She looked at Anthony earnestly, as though probing his mind for his opinion on the matter. \n \n “I appreciate your diffidence, Miss Considine, and I think I can gauge exactly what your feelings are.” \n \n She smiled with gratification. “Do you know, that’s very nice of you ... that will make it easier for me to know that. What I want to tell you is this—Gerald Prescott was in love with me and had asked me to be his wife.” \n 179 \n \n I gasped! Consummate effrontery I called it, even though the man was lying dead now. \n \n Anthony appeared to take the news very quietly. \n \n “When did he ask you that?” he queried. \n \n “During the luncheon interval of Friday—the last day’s cricket we had.” \n \n “I don’t wish to appear inquisitive, and believe me I am not asking idly or frivolously—what was your reply?” \n \n Mary blushed a little and her eyes fluttered in my direction. \n \n “I will tell you, Mr. Bathurst, I told him that I would give him his answer the next day—that was all I told him.” \n \n “I am going a little further then—what was your answer going to be?” \n \n She looked at me again, then shook her head. \n \n “I don’t know, Mr. Bathurst. To be perfectly frank with you, I don’t really know—he was too good an athlete to take chances with.” \n \n Anthony raised his eyes with an expression of bewilderment. “Too good an athlete? I don’t quite understand.” \n \n Mary blushed again—then appealed to me to help her out. \n \n “I forgot for the moment that you haven’t been here lately, Mr. Bathurst—tell him for me, Bill—will you, please?” \n 180 \n \n “Mary swore a fearful oath a few years ago,” I explained, “that she would marry no man that couldn’t beat her at cricket—single wicket and also over eighteen holes at golf—so that if she goes so far in the matter as to play the two matches it’s a kind of half acceptance of his proposal. For if she loses the two games—she pays forfeit. See? Neat plan, I say.” \n \n Anthony grinned. “And Prescott was too good a man with whom to take liberties—eh?” \n \n “I wasn’t sure,” she said, blushing furiously. “I wanted time to think.” \n \n Anthony paced the room with swift steps. He came to her again. “This proposal was made, you say, the day preceding the murder?” \n \n “Yes! To be exact, about twelve hours before.” \n \n “You say your sister, Mrs. Arkwright, was in your confidence regarding Mr. Prescott’s proposal. When did you confide in her?” \n \n Mary looked at him—surprised. “To-day,” she answered. “Not before!” \n \n “So that not a soul knew of it before Prescott’s death?” \n \n “They couldn’t have, Mr. Bathurst!” She spoke with conviction. \n \n “Unless—pardon me making the suggestion—unless Prescott himself spoke of it to somebody.” \n \n “That’s hardly likely, do you think?” she commented, the violet eyes brimming with tears at the recollection of this man who had loved her, and died so tragically in her home, “so improbable that surely we may dismiss the idea?” \n \n “Had Prescott any particular chum in the house-party?” \n 181 \n \n “I don’t think so,” she responded. “Bill might know better than I.” \n \n “Had he, Bill?” Anthony fired the question at me. \n \n “No! I should say not. At any rate I hadn’t noticed any particular ‘Fidus Achates.’” \n \n “I agree with you then, Miss Considine,” broke in Anthony. “It is extremely unlikely that he would have confided in anybody.” \n \n Then she amazed him with her next remark. \n \n “You don’t ask if he had an enemy?” \n \n “What d’you mean?” he said very quietly. \n \n “I mean just this, Mr. Bathurst. I knew very, very little of Gerald Prescott—I had only seen him two or three times before this Cricket Week commenced. And I am positive that during the past week—somebody has been trailing him—spying on him would be the better term.” \n \n I felt myself growing excited. We seemed to go from unexpected to unexpected as we progressed in this affair. What was she going to tell us now? \n \n “I take it you have a definite reason for saying this, Miss Considine?” asked Anthony gravely. “What are your facts?” \n 182 \n \n “I have, Mr. Bathurst, and when you have heard what I am going to tell you, I think you will agree with me. The first time I noticed it was on the Tuesday. After dinner that evening, Gerald Prescott and I walked out into the garden. We came out of the French doors and walked round by the lawn tennis courts. It was a lovely night, and he asked me to sit on the seat at the back of the courts. After we had been sitting there for a little time, I had that peculiar sensation that comes to one, when one is being watched. There are two big trees a few yards away from that seat—at the side of the path that leads to ‘The Meadow’ and then to the Allingham Road. I turned quickly and looked. There was a man there watching us. He was crouching down and I am almost certain had a soft hat pulled down over his face....” She paused and looked at Anthony. \n \n “This is most interesting, Miss Considine—please go on!” \n \n “I did not tell Mr. Prescott what I had seen, but suggested that we should walk back.” \n \n “Would you pass close to the trees on your way back to the house?” \n \n “No. We came up from the corner of the courts and would have the trees on our right.” \n \n “At what distance?” \n \n “About twenty yards away. Still, I could see quite clearly—the figure had disappeared.” \n \n “Could you give any description of him at all?” \n \n She pondered for a moment. “He seemed to be dressed in darkish clothes—that’s all I can say that I could rely upon.” \n \n “Physically—how would you place him?” \n \n Here she shook her head. “He was crouched down—his body wasn’t in a normal position. I couldn’t place him accurately.” \n 183 \n \n “Go on, Miss Considine, tell me of the other times.” \n \n “There were two other occasions, Mr. Bathurst. One, the Thursday evening Mr. Prescott and I were again in the garden—it was before the Bridge party started. I purposely walked in the opposite direction to that we had taken on the Tuesday. We came round by the other path—leading past the billiard room and thence to the front of the house. When we reached there, we didn’t dally but turned quickly—we were afraid we should keep the card party waiting—and I am certain that we had been followed; I saw a figure crouching against the wall by the turn of the house—sheltering in its shadow. When we turned the figure dodged back quickly—and although we walked back quickly, I never saw it again.” \n \n “Did Prescott see it?” queried Anthony. \n \n “He said he didn’t when I mentioned it to him, but I am not sure that he wasn’t disclaiming the idea in order to stifle any fears I might have had.” \n \n “In your opinion, Miss Considine, was it the same man that you had seen on the Tuesday?” \n \n “I couldn’t possibly answer that, Mr. Bathurst. Much as I should like to. On this second occasion all I was able to catch sight of was part of a man’s body flattened against the angle of a wall.” \n \n “I appreciate your difficulty. Now tell me of the third occasion.” \n 184 \n \n “The third time was, comparatively speaking, a trivial incident. On Friday evening—once again, not long after dinner, I was standing with Gerald in the opening of the drawing-room doors leading on to the garden. We were standing just inside the drawing-room. The others were still discussing that ‘detective’ conversation you yourself had started—Gerald Prescott and I had drifted away. In the midst of our conversation I thought I caught the sound of a very low cough coming from somewhere near—in the garden. When Gerald went in to play cards, I had the temerity to go out there. There was a dark patch of shadow just to the right, by the wall again—and Mr. Bathurst”—she paused dramatically—“all around that patch hung the pungent aroma of a recently smoked cigar.” She leaned over and put her hand on his sleeve. “Have I impressed you that some person or persons—was spying on him?” \n \n “What was the conversation between you and Prescott on this last occasion?” \n \n “He was pressing me for a reply to his proposal. The conversation didn’t last five minutes.” \n \n Anthony looked perturbed. Some element in this latest information was worrying him. \n \n “You didn’t give him one, of course, or any indication of your feelings?” \n \n “None. I evaded the issue. We didn’t exchange more than half a dozen sentences.” \n \n “Tell me, Miss Considine,” Anthony became very insistent, “did Prescott, as far as you were able to observe, betray any agitation or emotion, on any one of these three occasions?” \n 185 \n \n “As far as I was able to judge, Mr. Bathurst, none at all. I am not really sure that he ever saw or heard what I did. If he did, I could not detect that he showed it.” \n \n “Thank you. You have told us very plainly and very illuminatingly of what happened. I am very grateful for the information.” \n \n “I feel relieved now that I’ve told you this—it may mean more to you than it has done to me. It may even help you to read this riddle. Frankly, I can’t make it out. It would seem to me that Gerald Prescott brought something with him to Considine Manor, something dark and sinister that caused him to be shadowed and spied upon, yet his mother, who should know him best of all, is emphatic that whatever came to him, had its birth and origin here in Considine. Both of us can’t be right.” \n \n She turned to go. Anthony opened the billiard room door for her, then, as she made her exit, came back to me. I looked at him interrogatively. \n \n “Well?” I asked. \n \n “Well, what, Bill?” \n \n “What next? This is rather a facer, isn’t it? A surprising development. You had been here nearly a week, Bill, before I arrived—had you noticed anything of this admiration of Prescott’s for Mary Considine?” \n \n “Can’t say that I had,” I replied after a little reflection—“of course I saw him talking to her sometimes—naturally—but I didn’t regard it as a frightfully serious business. Let me put it like this, I fancied that he found her attractive—come to that who wouldn’t—but I didn’t realize that he was so absolutely bowled over as Mary says.” \n 186 \n \n Anthony took out his cigarette case, selected a cigarette and tapped it carefully. \n \n “This seat by the tennis courts—do you know exactly where she means?” \n \n “Oh yes. Know it well. Why?” \n \n “Well, before we go and have that look at Prescott’s bedroom that I spoke about, I think I should like to take a glance at this seat.” \n \n “Right-O,” I responded. “I’ll pilot you there.” \n \n We made our way down the garden, turned off to the left, and struck out for the tennis courts. \n \n The trees that Mary had spoken about lay to our left between us and the road to Allingham. \n \n “There’s the seat,” I said. “We’re approaching it the way that Mary says she and Prescott came back. The trees were then, you will remember, on their right.” I pointed. \n \n “Quite correct, Bill,” came his reply. “According to her version of what happened, the watcher had disappeared when they passed the trees on the journey back. Where did he get to?” \n \n “Probably back into the road,” I ventured. “Where he had, doubtless, come from.” \n \n “You think so?” he answered. “Let’s go and have a look. Come over to the trees themselves.” We made our way over. Anthony looked at the seat we had just left, and then turned and gazed across the field to where the Allingham Road lay like a white ribbon across the stretch of Downs. \n 187 \n \n “What’s this shed for?” he inquired. He indicated a wooden building on the opposite side of the path between us and the house. \n \n “It’s used for storing the lawn tennis gear,” I answered. “Sir Charles Considine had it built near the courts for that purpose.” \n \n “Jolly useful place—don’t you think, Bill? Very useful indeed.” \n \n “Yes,” I replied. “Quite a natural idea, though, surely.” \n \n “Oh, eminently. But come on—let’s be getting back. I’ve seen all that I want to see.” \n \n “Are you going to have a look at the other place where Mary thinks she saw this mysterious watcher—at the angle of the wall past the billiard room window? Or don’t you consider it sufficiently important?” \n \n He seemed to have relapsed into a reverie. “Eh—what’s that—the other place? No—I don’t think I want to see that.” He continued. “If I could do what I hinted at in the first place, Bill—sort the actual clues from the false—the whole thing would resolve itself into a plain and simple explanation. There is some evidence that is either merely fortuitous or has been put into the affair with deliberate intent.” \n \n He stopped and regarded me very seriously. Then he spoke. \n \n “Bill, I’m inclined to think I’m crossing swords with a very clever criminal, but at the same time, I’m also inclined to think that his cleverness will be his undoing.” He rubbed his hands with a kind of pleasurable anticipation. \n 188 \n \n “Hallo—there’s Baddeley! Any more news, I wonder?” \n \n “Good-day, Mr. Bathurst. Good-day, Mr. Cunningham.” \n \n “Good-day, Inspector.” Anthony eyed him carefully. “You look a wee bit pleased with yourself, Inspector,” he sallied. \n \n Baddeley smiled. “You aren’t looking too downcast yourself, Mr. Bathurst. All the same I haven’t exactly been wasting my time since I had the pleasure of last seeing you.” \n \n “Good,” replied Anthony. “Going to take me into your confidence at last?” \n \n The Inspector remained silent. \n \n “No? Very unsporting of you——” Anthony grinned. “When are you making your arrest?” \n \n But Baddeley didn’t take too kindly to his raillery. “At the right time, Mr. Bathurst, neither before nor after.” \n \n Anthony purposely overlooked the acerbity in his tone and continued gaily: \n \n “I’m sure of that, Inspector,” then provocatively again—“What I’m afraid of is that you’ll collar the wrong person. And my regard for you is such that I’m anxious that you shouldn’t.” \n \n “I’m not denying it’s a very puzzling case, Mr. Bathurst,” rejoined Baddeley, “neither am I pretending that it’s all as clear as daylight to me—yet—but I’m getting on very nicely, thank you, and the last little ray of sunshine may come at any moment. They very often come when least expected.” \n 189 \n \n Sir Charles Considine, Lady Considine and Jack joined us. \n \n “Ah, Baddeley!” cried Sir Charles—“what luck in your chase—did you get into touch with him all right? Did you get what you wanted?” \n \n “Yes, thank you, Sir Charles—I found him where you said.” \n \n “And you were entirely satisfied, eh, Baddeley?” \n \n Baddeley turned the question aside. It didn’t suit him at the moment to satisfy Sir Charles’ curiosity. “I’ll see you later, Sir Charles,” he answered, “if you don’t mind.” \n \n “Oh—quite—quite—I understand perfectly.” \n \n “One question I should like to ask you, Sir Charles. On my way here, I met a telegraph boy obviously coming away from the house. Anything important happened since I was here last?” \n \n Sir Charles stared at him blankly. “A telegram here—I wasn’t aware——” \n \n Jack Considine cut in. “It was for me, Dad,” he said. “From Tennant.” \n \n “Tennant?” muttered Baddeley. “Wasn’t he a guest here on the night of the murder? What did he want?” \n \n Jack Considine smiled sweetly. \n \n “His pajamas! He’d left them behind in his bedroom.” \n \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2723/74854.html","bookId":1418,"book":{"id":1418,"title":"The Billiard Room Mystery","description":"简介： Seeing Bathurst this evening, after a lapse of eight years, has given me a most insistent inclination to set down, for the first time, the real facts of that cause clbre, that was called by the Press at the time, the Billiard Room Mystery. Considerin...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2723","creation":"Aug 1, 2019 12:25:03 AM","modification":"Aug 1, 2019 12:25:03 AM"}}
