{"id":26292,"no":17,"title":"CHAPTER XVII INSPECTOR BADDELEY PUTS HIS CARDS ON THE TABLE","content":"Baddeley closed the library door behind us and gestured to us to be seated. “I don’t purpose troubling Sir Charles Considine at the moment,” he informed us, “for one or two reasons—but I do feel, gentlemen, that I’ve reached a stage in the investigations of this affair when I’m bound to talk things over with somebody.” He paused and produced his pipe which he proceeded to fill, slowly and deliberately. Then he continued. “Early on, Mr. Bathurst, you had a little joke with me about going fifty-fifty in regard to our discoveries ... well ... it’s like this ... I seem to be properly up against the most baffling set of clues it’s ever been my good fortune—or bad, if you like—to encounter.” He struck a match and lit the tobacco. “In all probability I’ve been able to get information that you haven’t, Mr. Bathurst—that sort of thing’s my job so you’re starting a bit ‘scratch’ as it were—still I’m going to play the game and put all the cards on the table.” \n \n Anthony waved a deprecating hand. “Quite so—Inspector.” \n \n Baddeley eyed him warily—then went on again. \n 219 \n \n “There’s a young fellow murdered and a pearl necklace stolen in the same house on the same night. The robbery is cleared up pretty quickly—thanks to you, Mr. Bathurst—and the question arises—the natural question if I may call it so—what connection, if any, is there between the two?” \n \n Anthony broke in. “Do you want me to answer that?” \n \n Baddeley held up his hand. “Not for the moment, sir! Let me go on for a bit. My reason tells me that there is a connection—because the murdered man was strangled with a shoe-lace, and the man pinched for the robbery has, as far as I can tell—the identical shoe-lace in his pocket. I’m not exactly a scholar, gentlemen, but you can say he’s caught ‘in flagrante delicto.’” He looked at us. \n \n Anthony was smiling. “Go ahead, Inspector,” was all that he said. \n \n “Well, sir—that’s what reason tells me! But instinct tells me just the opposite—I can’t get the times to fit—nothing seems to link up just in the way that it should—and I’ve got a decidedly uneasy feeling that I’ve missed my way somewhere.” He puffed at his pipe. “I’m going to do a lot of talking, gentlemen; can you put up with it?” He proceeded without waiting for our reply. \n 220 \n \n “Usually, there’s a motive sticking out in these cases. But I’m damned if I can find a really satisfactory one here. Robbery? I don’t think so—he had no money on him when he was found—but his chief card winnings hadn’t been paid over, and it isn’t likely he was carrying a very large sum about with him. Robbery for something that he possessed? The I.O.U. for instance? Possibly! Revenge? Again—possibly! But if so for something that has, so far, eluded me. Still—we’ll concede—a distinct possibility. You see—we aren’t nearing probabilities yet. And probabilities are much more satisfactory than mere possibilities. Now there’s that very mysterious piece of work with the Venetian Dagger.” \n \n He stopped again as though to let his words sink well in. Anthony grew very attentive, and I found myself more responsive, so to speak, to the Inspector’s mood. \n \n “The dagger had been used to ‘make sure’ apparently. The murderer was taking no risks—dead men tell no tales—but—and here’s something you probably don’t know, Mr. Bathurst—that Venetian dagger had unmistakable signs of finger-prints.” \n \n Anthony grinned. “It was the dagger, after all, Bill,” he said. Then he addressed Baddeley. “I tumbled to your letter dodge, Inspector,” he explained. “I spotted that you had some prints somewhere and were after an identification. Fire away.” He settled in his chair again. Baddeley gazed at him steadily. \n \n “You miss a hell of a lot. I don’t think,” he muttered. “I fancy I’ve brought my samples to the right market, after all.” \n \n Anthony dismissed the compliment with a wave of the hand. Then came as quickly to the challenging point. “Whose were they?” \n 221 \n \n Baddeley replied very quietly. “They belonged to Major Hornby, Mr. Bathurst.” \n \n This was interesting with a vengeance. \n \n “Really,” said Anthony. “This is very important! Have you approached the Major, or are you holding your hand?” \n \n “I have seen the Major, and informed him of my knowledge.” \n \n “Ah! I am curious to hear what he says.” \n \n “His explanation is that he handled the dagger during the evening.” \n \n “Really.” \n \n “Yes. And what is more, Mr. Bathurst, he is prepared to assert that when he retired for the night, the dagger had been removed from its customary resting-place on the table.” \n \n “Removed from where he had replaced it?” \n \n “Exactly.” \n \n Anthony looked up and studied the Inspector’s face very seriously. “Really—Inspector. Really? This is most illuminating! Taken from the table some time during the evening—eh?” He rubbed his hands. “And do you know, Inspector—do you know—I’m not surprised.” \n \n Baddeley flung him a quizzical glance. “The day that I surprise you, I reckon I’ll surprise myself,” he uttered laconically. “But I’ll go on. I’ve given you one piece of information that I believe you were ignorant of. Now for what happened this morning at the inquest—I fancy you heard a thing or two there for the first time? Am I right?” \n 222 \n \n Anthony pulled at his top lip with his fingers—a favorite trick of his. “You refer to the evidence of Andrew Whitney and the maid, Dennis—I presume?” \n \n Baddeley nodded. “Whitney’s evidence was a stroke of pure good fortune for me. He had seen the account of the case in the papers, read the description of the house, Considine Manor, and knowing of course that his delay occurred in the village of Considine or thereabouts, had no difficulty in recognizing it again when he came to have a second look at it. I tell you I was glad to get my hooks into this piece of evidence, from an absolutely unimpeachable source—but when he swore that the time was past three—well, I was pretty well staggered.” He came right across to us and looked Anthony straight in the face. “Mr. Bathurst, think it over! Dr. Elliott tells us Prescott was killed somewhere about half-past one—perhaps two—‘Spider’ Webb was pulling off his little job of work round about the same time—it all seems to point to a connection between the two—yet I’m not satisfied—I can’t think what was doing in that billiard room after three o’clock that morning.” He stared broodingly at his pipe. Neither Anthony nor I broke the silence—he seemed determined to let Baddeley have his entire say without further interruption. \n 223 \n \n “So much then for Whitney’s evidence. Now we come to Annie Dennis. I am indebted to the butler—Fitch—for getting on to her. When I first questioned her she told me she could tell me nothing. Apparently she had either forgotten the incident or didn’t consider it of sufficient importance to mention. She took it to Fitch who passed it on to me—so I interviewed her. What was a man doing outside the billiard room window at that time—just after nine o’clock—on Friday evening? Once again—was it Webb—or an accomplice of Webb’s? There are too many twists and turns in this for me, Mr. Bathurst. I’m fairly staggered.” \n \n Anthony rose and stretched his long body. \n \n “This inquest to-day, Inspector Baddeley—I was very interested to observe that all reference to Webb’s arrest was avoided. In fact, as far as I can remember not a great deal of mention was made of the theft of Lady Considine’s necklace. Marshall—Mrs. Webb—was treated exactly as an ordinary witness. I presume I am correct, Inspector, in assuming that you stage-managed this?” \n \n Baddeley smiled. “Right again, Mr. Bathurst!” \n \n “May I ask why? I have my own ideas of course—but——” \n \n Baddeley cut in. “Well, I’ll be perfectly frank with you, Mr. Bathurst. In these cases as you are doubtless aware, especially at an inquest, it isn’t always the best policy for the Police to put all their cards on the table—at first that is. The robbery and the murder may be linked up—on the other hand they may not—if they are not—as my instinct tells me—it’s just as well for the real murderer to remain in the dark about Webb.” \n 224 \n \n Anthony pondered for a moment. “All very well, as far as it goes. To have charged Webb and Marshall with the murder might possibly have given this other chap—your murderer—a sense of false security. Don’t you think so?” \n \n “I always believe in keeping people uninformed—as far as possible. They are more likely to betray themselves.” \n \n “But there is an alternative to that,” replied Anthony. “By imparting information—carefully prepared and selected, you sometimes force people to betray themselves. Don’t you see? However, it’s of no particular consequence—I merely desired to know what exactly was your intention. Now I know!” \n \n Baddeley plunged his hands into his jacket pockets. “You asked me just now, Mr. Bathurst, if I wanted you to answer a question that I had raised—and I asked you to refrain from answering it at the moment. I’d like you to answer it now. Has Webb with his robbery any connection with the death of Prescott?” \n \n “You want me to answer that—here and now?” \n \n “If you please, Mr. Bathurst.” \n \n “In my opinion, then, as I read the case, none whatever!” \n \n “None whatever!”—I intervened incredulously—“then what about the shoe-lace? I can’t understand——” \n \n “Neither can I,” reiterated Baddeley. “That beats me—that does.” \n 225 \n \n Anthony smiled. “You asked me a simple question, and I gave you a simple answer. Let’s leave it at that, for the time being. And now allow me to ask you a question!” \n \n Baddeley signified assent. “Very well, sir!” \n \n “Shortly after you were called to this business, Inspector—you definitely stated that Prescott had been out in the grounds of the Manor after twelve o’clock. Do you remember?” \n \n “Decidedly, I do,” came the answer. “What are you getting at?” \n \n “You drew your inference, I supposed, Inspector, from the mud on the brown shoes, and the state of the clothes that Prescott was wearing when found? They were bone-dry, and you argued that had he been out before twelve they would have got very wet—rain was falling pretty steadily—and would still have shown some traces of wet when you arrived. Am I on the lines of your reasoning?” \n \n “You are—pretty conclusive too, don’t you think?” \n \n “It would fit one hypothesis, certainly—but not another.” \n \n “I don’t quite get you.” \n \n “Don’t go too fast. I was merely satisfying myself as to the line your inferences had taken.” \n \n Baddeley looked doubtfully at him. “You think I’ve missed something?” \n 226 \n \n Anthony patted him on the shoulder. “Naturally—we all have, haven’t we—or the murderer would be kicking his heels in Lewes Jail by this time—there’s no urgent necessity for you to be despondent because of that.” \n \n “That’s all very well,” returned the Inspector—“but you see this happens to be my job—my bread and butter depends on it—I can’t afford to miss things and get away with it.” \n \n “Don’t abandon hope yet,” responded Anthony. “I am becoming more optimistic as we progress. You’ll clap your handcuffs on the criminal yet. Now tell me something else. You collared Prescott’s papers when you first ran your eye over his bedroom. Find anything?” \n \n “Nothing of any consequence. Here they are.” He fished in his breast pocket. Then produced an ordinary brown leather wallet which he handed over to my companion. About a shilling’s worth of postage stamps, and half a dozen papers were all it contained. Anthony looked through them. \n \n “Hotel Bill—July—’Varsity Match probably, two letters from his mother”—he scanned them through—“not important—a communication from the O.U.D.S.—another from the ‘Authentics’—and a tailor’s bill. H’m—nothing here apparently.” He returned the wallet to Baddeley. \n \n “Did you get his check-book?” \n \n “You bet your life I did. Care to have a look at that?” He smiled. \n 227 \n \n Anthony turned over the counterfoils for a moment or two. “Nothing here, either, I fancy; only five checks drawn since the beginning of May—four to ‘Self’ and one to the tailor whose account we just handled. Well, I’m not surprised—I didn’t want to find anything startling.” \n \n “Any information helps,” muttered Baddeley somewhat gloomily. \n \n “Not always, Inspector! Consider your own position here—you found pieces of information from time to time that only served to confuse you. You have admitted that yourself! They wouldn’t fit in, as links in the chain—I had the same difficulty——” \n \n “That’s true,” conceded the Inspector. “But you like to feel you’re running freely.” \n \n Anthony went straight across to him. “I do, Inspector. I feel that I’m actually ‘in the straight.’” \n \n But Baddeley refused to be comforted. “I’m not denying that you’ve done one or two smart things, but I’m afraid you’re a bit over-confident. I’ve been at the game longer than——” \n \n Anthony cut in. “Look here, Baddeley, do you think I should say a thing like that, without good and sufficient reason?” \n \n I subjected Baddeley to a careful scrutiny, for I felt myself sympathizing with him. How could Anthony possibly make a statement like that? It seemed to me from what I had seen of the case—which was as much as anybody—that several people lay under suspicion, but none more than any other. Now there was Hornby to add to Webb, Barker, “Marshall” and the rest of them. I could quite see Baddeley’s point of view—a maze of clues and not one, to my outlook, that stood out conspicuously from the others. \n \n Baddeley’s voice broke in upon my reverie. \n \n “No, Mr. Bathurst—I don’t! But since you ask me—I’m dashed if I can follow you—I don’t see my way clearly and that’s a fact.” \n \n Anthony took a cigarette from his case—we did likewise at his invitation. “Do you mind being the third, Inspector?” he asked as we lit up. \n \n “I’m not superstitious, Mr. Bathurst—though I’ve a shrewd idea this little conference will prove unlucky for somebody.” We laughed. \n \n “You do?” said Anthony. “Well, listen to me for a moment.” \n \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2723/74857.html","bookId":1418,"book":{"id":1418,"title":"The Billiard Room Mystery","description":"简介： Seeing Bathurst this evening, after a lapse of eight years, has given me a most insistent inclination to set down, for the first time, the real facts of that cause clbre, that was called by the Press at the time, the Billiard Room Mystery. Considerin...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2723","creation":"Aug 1, 2019 12:25:03 AM","modification":"Aug 1, 2019 12:25:03 AM"}}
