{"id":26278,"no":3,"title":"CHAPTER III MR. BATHURST AND THE BED-CLOTHES","content":"“What!” snapped Baddeley. “Strangled? Strangled with what?” \n \n “I can’t say exactly,” replied the doctor. “Look at this mark”—he pointed decisively—“it runs right round his throat. The thing has been tightened at the back of the neck. String! Tape! Anything that would bear the strain. Look at the mark on the flesh.” We looked. The impressions were certainly vivid. They had been hidden from us, partly by reason of the dress collar, and partly by the position of the body. \n \n “But where is the tape?” muttered Baddeley. \n \n “Rather, Inspector,” cut in Anthony, “ask your question in a slightly different form.” \n \n “What do you mean?” \n \n “Say—Where is the shoe-lace?” \n \n “By Moses—but you’re on the spot, Mr. Bathurst.” He turned with the utmost excitement. “That’s why the lace is missing! I must see everybody, Sir Charles, I really must.” \n \n Anthony leaned over and looked up the dead man’s sleeves, with a curious, quizzical expression. \n \n Baddeley regarded him playfully. \n 32 \n \n “I’ve no doubt somebody in the house has got something up his sleeve, Mr. Bathurst, but I don’t think it can be this poor fellow.” Anthony smiled back. “He has a handkerchief—Inspector!” \n \n The Inspector then delivered a question that was surprising. \n \n I confess it startled me. \n \n “Can any of you tell me reasonably accurately, what time it started raining here last evening?” \n \n “I can,” I answered. “The rain started about ten minutes to seven.” \n \n “And ceased—when?” he followed up. \n \n “It was not raining,” I said, “at a quarter to twelve.” \n \n “How do you know? Were you out?” \n \n “No, Inspector,” I replied. “I happened to look out into the garden about that time and the stars were shining—that’s all.” \n \n “H’m! Sure of your time?” \n \n “Quite.” \n \n “Now, gentlemen,” Baddeley turned to us all with a gesture that contained a certain amount of defiance and, at the same time, the fleeting hint of an apology—and he seemed to gain from it an added sense of dignity—“I need your help. And because I need it—I’m going to ask for it.” \n \n “Ask on,” said Anthony. “I’m your man.” \n \n “Well, I feel like this, Sir Charles and gentlemen, this isn’t an ordinary case. Can any of you; you, Sir Charles, Mr. Bathurst, Mr. Cunningham—or you, gentlemen”—he turned towards Arkwright and Jack—“tell me of anything you know that puts any motive into this affair? Any incident that throws any light on it whatsoever?” \n 33 \n \n We shook our heads. \n \n “Frankly, Inspector,”—Anthony spoke for us—“we are as much in the dark regarding the whole affair as you yourself are.” \n \n Baddeley went on. \n \n “Very well, gentlemen. Then we know where we are. But I may as well tell you that Mr. Prescott was in the garden last night—after 12 o’clock—and he was not alone! But I’ll find out who was with him! And what’s more, I’ll find the scoundrel that murdered him!” He squared his shoulders. \n \n “You’re certain of what you just told us?” queried Anthony. \n \n “I am.” \n \n “How are you certain?” \n \n “That’s my business, Mr. Bathurst. Try your hand at finding things out yourself.” \n \n “Right-o!” Anthony accepted the challenge laughingly. “Shall we go fifty-fifty with our discoveries?” \n \n “If it suits me.” He turned to Sir Charles. \n \n “I should like now, Sir Charles, to see Mr. Prescott’s bedroom.” \n \n “Certainly, Inspector.” \n \n “May we accompany you, Inspector?” suggested Anthony. \n \n “You may—if you keep moderately quiet.” \n \n We ascended the stairs. \n 34 \n \n Sir Charles leading the way, stopped outside Prescott’s door. “Perhaps, Arkwright,” he said, “you and Jack would get back to the others. They must be having a pretty thin time. Tell them to have any breakfast they care to, and that Inspector Baddeley wishes to interview them all before he goes.” \n \n Baddeley called Roper on one side. He seemed to say something quickly and imperatively, and I fancied I heard the words—“and keep your eye on her all the time.” \n \n “A new development—hear that?” I whispered to Anthony. \n \n He came last, preoccupied. \n \n “Nine stairs, Bill! Nine stairs. Nine stairs—Inspector.” \n \n Baddeley looked puzzled. Then walked to the bedroom door. \n \n “Of course,” he said, “anybody could have been in here since, couldn’t they? The door is shut. But not locked. The key is on the inside. But I can’t tell for certain that these facts were so when Prescott left it for the last time, can I?” \n \n “I think you may take it so,” said Sir Charles somewhat pompously. “My people here wouldn’t think of entering another’s room.” \n \n “Somebody here thinks of murder, Sir Charles, say what you like! What about the servants?” \n \n “They have not been on this floor yet.” \n \n “Very good.” \n \n We made our way into the room. \n 35 \n \n As far as I could see there was nothing to excite the slightest comment. Between us and the bed, upon our immediate right and left was the dressing-table and a chair respectively. \n \n With its head to the left-hand wall, as we entered, stood the bed—that is to say, almost in the far left-hand corner of the room. A door opposite to us opened on to the bathroom that I have previously described. In the far right-hand corner stood a large Sheraton wardrobe. \n \n “Well, he went to bed last night, did Mr. Prescott,” said Baddeley. “That’s pretty clear at any rate. And he got up in a hurry!” \n \n The bed certainly showed signs of recent occupation. All the normal and ordinary signs of a person having slept there were clearly and distinctly indicated, the bed-clothes being in disarray and lying trailingly on the floor between the bed and the door of our entrance. \n \n The Inspector was quickly at work. \n \n He crossed to the dressing-table and examined it carefully. He then came back to the bed, lifted the pillows, and peered inquisitively beneath. \n \n “Strange——” I heard him mutter. I turned to Anthony who was standing with his eyes fixed intently on the bed. He seemed to be following an acute train of thought. \n \n “Sir Charles,” broke in Baddeley. “There’s one thing that every man has to a degree, and yet this young fellow Prescott appears to have been entirely without—unless he’d been systematically robbed.” \n \n Sir Charles lifted his eyebrows. “Yes?” he queried. \n 36 \n \n “Money—cash—whatever you call it. How do you account for this? He has no money in his pockets, he has no note-case in his pockets. His pockets are all beautifully empty. I say to myself he dressed in a hurry—I shall find his money in his bedroom. Either on the dressing-table or under his pillow. People have different places of putting their cash you know, gentlemen. But I don’t find it! And it puzzles me!” \n \n “It’s certainly very strange, Inspector,” said Anthony. “But there may be the possibility that his small change had run out, and that he has put a note-case into another jacket. Let’s try the wardrobe.” \n \n Baddeley did so. Two more coats hung there. His deft fingers quickly ran over them. “Nothing there,” he declared. \n \n Anthony thought again. “Try the drawers of the dressing-table.” \n \n Baddeley opened the right-hand drawer. Ties, collars, a handkerchief or two. He tried the left. “Ah!” \n \n He held a wallet—leather—the kind of wallet that is in popular use. He opened it. \n \n “Stamps—and private papers—no money—not a note there—I’ll run through these papers later,” he said. “But not a cent.” \n \n “Is it robbery, Inspector?” questioned Sir Charles. “Appearances, at least, seem to me to be pointing in that direction.” \n 37 \n \n Baddeley shook his head. “Up to now, sir,” he declared—“it’s got me beat! I find out one thing and seem to see a little light, and then I chance on something else, equally important on the face of it, that knocks my first theory into a cocked hat. Nothing fits! Nothing tallies!” \n \n “I confess that to some extent, I share your bewilderment, Inspector,” said Anthony. “If I knew——” \n \n Baddeley suddenly became vividly alive. “Of course—there may be that explanation.” He swung round on to the three of us. “Any cards last night?” \n \n “Yes,” I replied. “Why?” \n \n “Never mind”—impatiently—“Prescott playing?” \n \n “Yes.” \n \n Anthony became all interest. “I see your drift, Inspector.” \n \n Baddeley grinned. “Qualifying for a mental hospital—I’ve been—haven’t I? \n \n “Now, Mr. Cunningham,” he turned to me—“you say you saw Prescott playing—I’ll tell you something more—you saw him lose and lose, now didn’t you? He was cleaned out of all he had, wasn’t he?” he brought his fist down on the dressing-table triumphantly—“he lost the lot?” \n \n Anthony’s eyes held me inquiringly. \n \n “Yes, Bill?” he murmured. “What about it?” \n \n For a brief moment I felt majestic. I had a curious sense of power. “This is my grand minute,” I whispered to myself. \n 38 \n \n Taking a cigarette from my case, I tapped it on the lid with a becoming delicacy. \n \n “On the contrary, Baddeley,” I weighed my words with a meticulous distinctness. “On the contrary—Prescott won! Systematically, consistently, and heavily.” \n \n Baddeley stared as though unable to believe the words. Anthony let out a low whistle. \n \n “Frightfully sorry to upset your pet theories,” I continued airily—“but I know that for an absolute certainty.” \n \n “How?” snapped Baddeley. “Were you playing with him?” \n \n “No,” I replied. “I was watching.” \n \n “And onlookers see most of the game, Inspector,” said Anthony. \n \n “Who was playing?” insisted Baddeley. \n \n “Almost everybody—except Mr. Bathurst, Mr. Jack Considine and myself.” \n \n He scratched his chin, reflectively. \n \n Then came the question that I was half-expecting. \n \n “Anybody in particular lose more than most?” \n \n I hesitated before replying, and I sensed that he detected the hesitation. \n \n I crossed the Rubicon! “I think Lieutenant Barker was the heaviest loser, but he would, doubtless, let you have that information. Surely, you don’t imagine——” \n \n “That’s all right, Bill,” said Anthony. “The Inspector can easily satisfy himself.” \n 39 \n \n I made a mental note to tell Anthony as soon as the coast was reasonably clear of the Barker I. O. U. That had certainly not come to light. \n \n “Any idea who was the last person to be with Prescott, last night?” asked Baddeley. \n \n I reflected. After all, it was best to be candid with this man. \n \n “I can’t answer that for certain,” I said, “but I can tell you this. I went to bed about a quarter to twelve, and on my way I saw Prescott in conversation with Lieutenant Barker.” \n \n “Where?” \n \n “At the foot of the staircase.” \n \n “Anything in the nature of a quarrel?” \n \n “No,” I answered with rapid decision, “the conversation as far as I could gather was just ordinary conversation. Naturally, I didn’t listen to what they were talking about.” \n \n “H’m, I suppose not.” \n \n Baddeley sat on the chair and put his head in his hands. “As soon as I’ve looked round,” he observed, “I shall have to interview everybody.” \n \n Anthony strolled across the room, round to the left-hand side of the bed. \n \n “Not much room here, Inspector,” he said. “Hardly enough space for a fellow to dress—eh?” \n \n Baddeley looked up from his reflections, distinctly unimpressed. \n \n “He would find plenty of room to dress the other side, Mr. Bathurst—there’s every indication of it.” He indicated the appointments. \n 40 \n \n “You think so,” replied Anthony. “So do I. And unless I receive an unexpected set-back I really believe things are moving.” \n \n I was frankly amazed. I turned over all that I had heard, all that I had seen and as I pondered over them, I couldn’t for the life of me see how the slightest light could possibly have come to him. \n \n “I presume, Inspector, you will see the people within a little while, eh?” he inquired. \n \n “That is my intention, Mr. Bathurst. Why do you ask?” \n \n “Well, I’m going to have a little tour outside, if it’s all the same to you, and Bill Cunningham’s coming with me. Let’s hear from you when you’re ready and waiting. Come along, Bill.” \n \n He walked out, down the stairs, through the hall and into the garden. \n \n Anthony took out his pipe and filled it. \n \n “Before I do anything more, Bill,” he said slowly, “I’m going to sit on this seat and smoke this good tobacco—and you can do likewise.” \n \n “Good!” I uttered. “Tell me what you think.” \n \n “No”—shaking his head—“I can’t do that, just yet. For Baddeley will be well on with his work of cross-questioning before very long, and there are some things I wouldn’t tell my mother—just yet.” \n \n “Please yourself,” I grunted. “But what puzzles me,” I said, “is the scene of the crime as the journalists say. What took Prescott to the billiard room?” \n 41 \n \n “There are three reasonable solutions to that,” puffing at his pipe, “one—an assignation, two—he was called, drawn, or attracted there by something he saw, heard—or perhaps was afraid of happening—and three—he was taken there.” \n \n “By force?” I interrupted. \n \n “Perhaps. There were, if you remember, certain signs of a struggle.” \n \n “The fact that he was fully dressed,” I countered, “suggests to me very strongly that there was an assignation.” \n \n “Yes, I concede that, Bill, but against that, you know, I must recall to you the brown shoes he was wearing.” \n \n “Perhaps his dress shoes weren’t handy,” I argued. “The others may have been nearer to his hand.” \n \n “No. I can’t have it, Bill, his dress shoes were under his chair by the bed—just where he put them when he took them off last night. You see, I looked for them.” \n \n “Oh,” I said, rather nettled. “You evidently thought them important.” \n \n “Most assuredly,” he rejoined. “But not so important as the other thing Prescott’s bedroom told us.” He rose and stretched his arms. \n \n “Yes,” I assented. “That money business of Baddeley’s is very mystifying. And yet there may be a perfectly simple explanation.” \n \n “Of course,” said Anthony. “But I wasn’t thinking of that.” \n \n “What do you mean?” I broke in. “What else was there?” \n \n “My dear Bill,” came the reply, “I want you to come with me now and have a look at the ground immediately below the billiard room window.” \n \n “Yes, but—that bedroom—what else did you——?” \n \n “What else did I notice? Let me see, now. What was it? Oh—I found much food for thought, my dear Bill, in the somewhat peculiar disposition of the bed-clothes.” \n \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2723/74843.html","bookId":1418,"book":{"id":1418,"title":"The Billiard Room Mystery","description":"简介： Seeing Bathurst this evening, after a lapse of eight years, has given me a most insistent inclination to set down, for the first time, the real facts of that cause clbre, that was called by the Press at the time, the Billiard Room Mystery. Considerin...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2723","creation":"Aug 1, 2019 12:25:03 AM","modification":"Aug 1, 2019 12:25:03 AM"}}
