{"id":83550,"no":83,"title":"Page 83","content":"“Clotilde’s antics will not break us. They will make a dent, but nothing I cannot recover with a few thrifty seasons,” Elise said, her smile soft and affectionate as she watched her father.\n King Henrik shook his head as he stared at the fathomless wealth. “I knew you were doing a good job managing our finances, else Steffen would have said something. But this… I never expected.”\n Elise’s smile grew indulgent as she strolled up to her Father and placed her head on his shoulder. “So you will stop blaming yourself?”\n King Henrik linked his arms around Elise. “Your vast wealth does not change the fact that what I allowed to happen is unforgiveable.”\n “But it is,” Elise said. “The one thing this wretched trial has taught me is that love covers a multitude of sins. Please, Father. I can’t stand to hear you blame yourself. Forgive yourself.”\n King Henrik’s shoulders heaved. “Alright, my darling. Thank you.”\n “Of course,” Elise said, linking arms with King Henrik as they turned to leave the treasury.\n King Henrik glanced over his shoulder at the glittering wealth. “No wonder your brothers always hated budgeting with you. Nick complains bitterly that you make him itemize everything, and Falk always muttered you stole the royal profits and had unrealistic monetary return expectations for him.”\n “Of course. If he wanted money for agricultural research the expected return had to make it worth it,” Elise said with a mad grin.\n “They don’t deserve you, you know,” King Henrik said.\n “Who?” Elise asked, locking the treasury door.\n “Rune and Falk. Falk is too dense for you, and Rune has the shrewdness of a snake,” King Henrik said.\n “It warms my bones to see how you recommend your sons,” Elise said.\n “Naturally, you always were my favorite,” King Henrik said, his voice rumbling with laughter. “So which one will you choose?”\n “I don’t know. I’m giving them an equal chance right now,” Elise said.\n “Just be careful not to give any lad besides the two of them too much attention,” King Henrik said.\n “Why?”\n “Falk spent years toady-ing up to Mikk so as to use his army of sneaks, and Rune is the country’s best warrior,” King Henrik said.\n “They wouldn’t…” Elise said.\n King Henrik studied the ceiling. “They might have already.”\n “What?”\n King Henrik laughed and patted Elise’s hand. “No matter. I’m sure you’ll be happy no matter which one you choose. They’re good lads.”\n “Thank you, Father.”\n “Of course, my darling daughter.”\n As father and daughter strolled arm in arm, Elise thought of more ways to squeeze money from Falk’s agricultural ventures—especially now that she suspected she would be able to use her feminine charm to her advantage.\n King Henrik, meanwhile, grew misty eyed over the thought that in several years he would very likely be walking in a similar manner with his daughter, only then it would be down the aisle of a cathedral.\n King Henrik knew Elise was dedicated to her work, but he also knew she was a creature of steadfast love and loyalty. It wouldn’t be long before her heart decided between Falk and Rune. He didn’t know for sure, but King Henrik suspected he knew who she would choose…..\n If you believe Elise grows to love Rune, click HERE. If you believe Elise grows to love Falk, click HERE.\n Falk\n After Clotilde was defeated, it took three weeks for loneliness to set in Elise’s heart and two days for her to correctly identify the feeling.\n The idea that she was lonely seemed ludicrous. After all, she could speak as much as she wanted, and her brothers were no longer available to her for only a single hour of each day but at all times. Yes, Brida was not her near-constant companion, but the two frequently shared meals together. Moreover, as a result of the Clotilde fiasco, Elise had grown closer to her brothers, Father, and even Gabrielle—whose friendship she greatly enjoyed.\n But still, the loneliness plagued her.\n It would hit her at odd times, like when she was alone in her office in the evening hours. She would reach for a soft, feathery body that wasn’t there. Sometimes when taking tea, she saved a crust of bread and would turn to give it to…nothing.\n The only logical conclusion was that Elise missed Falk’s constant presence, an outcome Elise did not want to dwell on much less recognize.\n “—Did you even use the paste while I was gone? Your hands are puffy. You’ve been working too much again. Your hands will not heal if you don’t rest them,” Falk said as he rubbed Elise’s hands with a costly lotion he purchased while traveling with Erick. “It’s been weeks since you last picked up a nettle, and your hands still haven’t healed.”\n Yes, Elise really didn’t want to recognize it.\n “Are you even listening to me?”\n “Of course,” Elise said, internally disgusted with herself. How could she miss this?\n “No, you aren’t. Or your hands wouldn’t be so horribly abused. Open your mouth.”\n “Why?” \n","sourceLink":"https://allnovel.net/the-wild-swans-timeless-fairy-tales-2/page-83.html","bookId":1807,"book":{"id":1807,"title":"The Wild Swans (Timeless Fairy Tales #2)","description":"Storyline: \n Elise is the foster-daughter of the King of Arcainia, a mathematician, and the country’s treasurer. She is not a hero. But when her step-mother, a wicked witch, curses Elise’s seven foster-brothers—the princes of Arcainia—and turns them into swans, Elise is the only one who can save them. \n To break the curse, she must knit seven shirts made of stinging nettles, but there’s a catch. She has to complete the shirts without uttering a word, and if she doesn’t finish the task, Arcainia and her foster-brothers will be lost. \n THE WILD SWANS is a retelling of the German Six Swans fairy tale and the Dutch Wild Swans fairy tale. It is a story of humor, love, adventure, and magic, and it is part of the top selling Timeless Fairy Tales series—a series comprised of loosely related adaptations of your favorite fairy tales. All Timeless Fairy Tales take place in the same world and can be read all together, or as individual, stand-alone books.\n \n","cover":"https://allnovel.net/images/the-wild-swans-timeless-fairy-tales-2.jpg","author":"K.M. Shea","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-wild-swans-timeless-fairy-tales-2.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:50:20 PM"}}
