{"id":86691,"no":14,"title":"Page 14","content":"Nicky pasted a smile on his face as the slow music started and Brett spoke up again. “Yes, but this time, the music is softer, more slow and sexy. That way I can pull you up close and hold you all night long.” He put an arm around his mate and pulled him into a kiss, but Evan pushed him gently away, glancing over at Nicky and giving his mate a significant look. Brett dropped his arm and looked over at him. “Oh, sorry, Nicky.” “For what? Don’t be silly, I’m fine.” God, I hate this! Everyone walking around me on eggshells, afraid to mention Marco’s name or show affection to each other in front of me. I hate this! I have to leave. Logan and Ian came in and joined them at the table, and Logan kept up a steady chatter, so out of character for him. Nicky knew he was trying to keep his mind occupied with all this false cheer. Ian went for cake, and came back with a huge piece for Nicky, setting it down in front of him. Nicky smiled and pushed it around his plate with his fork. He’d had little appetite lately, even for the sweets he used to love. Logan, sitting beside him, noticed what he was doing. He whispered to him gently. “Nicky, you’ve lost so much weight. Please try to eat a little. I’m worried about you.” Nicky pushed the cake away. “Don’t be. I know you mean well, but I’m fine, Logan.” “You certainly are.” The voice coming from behind them made everyone at the table turn to look. Dr. Tate stood behind Nicky’s chair, looking down at him warmly. “Hi Nicky,” he said, gazing into his eyes. “Would you dance with me?” Ian and Brett both tensed at the question, though since the dissolution there was nothing to keep Nicky from accepting the invitation. No stupid rules about touching another wolf’s mate. Not one damn thing, he thought furiously. He stood up and smiled. “I’d love to, Jeremy.” As Jeremy led him on the floor, Marco walked in. Perfect timing. Fuck him! Marco’s eyes roamed over Nicky and then flashed to Jeremy Tate. Tate actually nodded at him with a little smile, but Nicky simply turned his head, not dropping it, just turning away in distaste. Why did the damn man have to look so good? He was wearing a dark brown shirt and tight jeans that hugged his body. He hadn’t shaved that morning, apparently, and the shadow of the beard on his face made him look dangerous and bad tempered. Well, that was true enough. Nicky felt Jeremy pull him into a close embrace, actually putting one hand low on his back, on his upper hip really, and used it to pull Nicky’s groin up tight to his. Nicky could feel the hard outline of his cock on his stomach, and he pulled his head back to gaze into Jeremy’s eyes. “It’s all right, sweetheart,” Jeremy murmured to him. “Don’t let him intimidate you. He has nothing to say about this.” Nicky laughed a bitter little laugh. “That never stopped him before. Don’t worry, I’ve never been afraid of him, and I won’t start now.” He allowed Jeremy to pull him along in a dirty dance with lots of grinding and groping of his ass. It did nothing for Nicky, but his desire to get on Marco’s nerves made him grind Jeremy back and run his hands over Jeremy’s shoulders. He glanced over at the table where Logan and Evan sat, and saw them both staring at him with fascination. Feeling reckless, he whispered in Jeremy’s ear. “Let’s go outside to the patio, Jeremy. It’s getting a little close in here.” Jeremy grinned down at him and led him outside, one hand wrapped possessively around Nicky’s waist. Nicky relaxed and let Jeremy steer him into the shadows of the patio. Once there, Jeremy put Nicky against the wall and began kissing him, long passionate kisses that were quite nice. Jeremy was very good-looking, Nicky thought. He wasn’t overly tall, like the wolves, only a few inches taller than Nicky. That made a nice change. His body was lean, yet powerful, and his muscles were compact and lovely. He seemed to be so sure of himself and his place in the world, something Nicky envied. What would it be like to be a cherished partner again? To have Jeremy Tate love him? Perhaps it was time to truly move on. He leaned further into Jeremy’s kiss and Jeremy pulled his head back slightly and smiled down at him. “I told Marco not long ago that there were others who would snap up this beautiful prize. I’m ready to offer you all the love you’ll ever need, sweetheart.” A growl from behind them made them both turn to look. Nicky watched Jeremy suppress a smile. “Well, I wondered how long it would take you to follow us. Marco. Your claim on this man is over. No one wants you here.” Marco grabbed his shoulder and ripped him away. Jeremy reeled back at his attack and fell on his ass, as Marco stepped protectively in front of Nicky. “You gave up your right to protest this, Marco,” Jeremy yelled. “Get out of my way!” Marco turned and seized Nicky possessively around his waist, hauling him to his side, still growling. “Get off my land, Tate, or I won’t be responsible. Leave now!” Jeremy got to his feet and glared once at Marco before addressing Nicky directly. “I’ll be back, Nicky. Don’t let him do this. Stay strong.” Jeremy pushed past them and disappeared inside. Nicky wanted to rail at Marco, but before he could say a word, Marco grabbed his hand and towed him behind him like a child as he walked determinedly into the nearby woods. When Marco first appeared behind Jeremy, Nicky had felt for a fleeting moment like he was cheating on Marco. How stupid was that? Marco had thrown him away, and he had no right to act like this. Marco pulled Nicky along in the dark behind him, and Nicky started to seethe with anger. He dug in his heels and struggled against going forward. Marco stopped and stared down at him, and Nicky could see the wildness in his eyes. He recognized the look, and knew how close Marco’s beast must be to coming forth. Not a good thing, he thought, and shivered to see the beast so close to the surface. Something told Nicky it would be wise not to fight Marco now, and besides, he didn’t want to, anyway. Making a sudden decision, Nicky turned his head and gave Marco his vulnerable throat, and it seemed to do the trick. Marco made a soft, growling, whining sound deep in his throat and pulled Nicky to him, wrapping his arms around his waist and burying his face in Nicky’s neck. He sank down on the ground with Nicky still clutched to his body and tucked him beneath it. He removed Nicky’s clothing with swift, impatient hands, throwing it aside on the trail. Then he sat up and divested himself of his own clothing, as Nicky watched him with a hungry gaze, wanting to devour every inch of the golden flesh he was uncovering. He didn’t care if Marco didn’t love him anymore. Marco’s thick shaft was gorgeous as it was revealed, a thick pearly drop of pre-cum seeping from his slit. Nicky rolled up to his knees, wanting to possess that shaft, wanting to taste, to lick and touch. Marco gazed steadily at him as he came toward him, doing nothing but watching him with glowing eyes. Nicky lowered his mouth, licking at the drops of pre-cum and tasting the sweetness of Marco’s seed. He heard Marco’s sharp intake of breath, but he was too absorbed in what he was doing to look at him. Taking hold of his cock, Nicky rubbed his hands over the pulsing flesh, feeling the heat and reveling in the silky softness of the skin covering his rigid shaft. He stuck his tongue directly into the slit and began to fuck it with his tongue, holding on tightly as Marco bucked his hips beneath him. His ragged breathing told Nicky he was fighting a losing battle for control. Knowing Marco as he did, he knew that probably every nerve ending in his body was screaming at him to throw Nicky on his back and take control, to dominate and possess him. He must be holding on by a slender thread. Nicky smiled wickedly and engulfed his whole shaft with his mouth, taking him all the way down his throat, knowing Marco’s body intimately and what it took to drive him mad with passion. Marco’s hands came up to card through his hair and hold his head, encouraging him in his efforts. Nicky was hard as marble himself just from watching Marco struggle. He grasped his balls and gently kneaded them, enjoying the interesting sounds Marco was making. For a moment at least, Marco was his and he was right where he wanted to be. From the common area, Nicky could hear the Bruno Mars song that was his favorite playing softly, providing a backdrop to this moment. Marco made a sound that Nicky had only rarely heard him make before, a keen, undulating cry and his hips thrust forward, as he came explosively, filling Nicky’s mouth and throat with his sweet essence. Nicky swallowed it down, holding his hips as Marco arched his back and shouted his release. Nicky followed him seconds later, his excitement too great to contain. Nicky sank back on his heels, before leaning forward and kissing Marco, making him taste himself on Nicky’s lips. Then he was being lifted into strong arms and carried. Nicky buried his face against Marco’s chest and closed his eyes, never knowing when Marco entered a side door and carried him upstairs to their bed. The next morning, Marco left Nicky lying curled up in their bed and slipped from the room. He’d been so out of control the night before, he had hardly known what he was doing. When he first walked into the common area and saw Tate dancing with Nicky, a red haze had covered his eyes. He’d clenched his fists as Tate pulled Nicky’s beautiful body up to his, so obscenely, and Marco had barely felt Ian’s hand on his arm or heard his voice, urging caution. When they’d drifted toward the door and Tate had taken Nicky’s hand to pull him outside, Marco had lost his mind with rage and charged toward the door. Only Ian’s hand on his arm, restraining him, had stopped him for even a moment. “I tried to tell you, Marco. You can’t do this—Nicky doesn’t belong to you anymore.” “The hell he doesn’t,” he’d growled and shook off Ian’s hand. By the time he’d gotten outside he was barely rational any longer. His beast had almost taken complete control. When he’d seen Nicky spread wantonly against the wall, and Tate running his hands over what belonged to him, it took everything he had not to kill the man where he stood. Somehow he’d kept from ripping out his throat and allowed him to leave before taking hold of his mate and pulling him to the woods. He had no clear idea of why he took Nicky there, except that his wolf was in charge and the need to run and rut with his mate was strong inside him.","sourceLink":"https://allnovel.net/breaking-up-with-the-alpha-dark-hollow-wolf-pack-6/page-14.html","bookId":2258,"book":{"id":2258,"title":"Breaking Up With The Alpha (Dark Hollow Wolf Pack #6)","description":"Storyline: Breaking Up With The Alpha (Dark Hollow Wolf Pack #6) Nicky’s living his happily ever after with his handsome mate Marco. He thinks he’s finally getting his life together now that the Hunters are gone, and he and Marco have the relationship he always wanted. When Marco falls desperately ill, Nicky sees his world crashing around him. Nicky’s prayers are answered when Marco awakes, but he’s horrified to discover that the illness attacked the bloodmatch, and Marco has no memories of Nicky and their life together. Even worse, Marco has reverted back to the overbearing, dominant alpha Nicky first met. Desperate to regain what they had, Nicky agrees to the D/s relationship he never really wanted, but unable to be submissive, he asks Marco for a separation, only to discover that Marco can’t let him move on. In despair, Nicky runs away. Can Marco find him and regain what they had? Or will they lose each other forever?","cover":"https://allnovel.net/images/breaking-up-with-the-alpha-dark-hollow-wolf-pack-6.jpg","author":"Shannon West","type":"Mystery","source":"allnovel","link":"https://allnovel.net/breaking-up-with-the-alpha-dark-hollow-wolf-pack-6.html","creation":"Oct 5, 2019 8:58:31 AM","modification":"Oct 5, 2019 5:16:41 PM"}}
