{"id":66625,"no":17,"title":"Page 17","content":"De Kere grinned. \"Tricks don\u0027t work here,\" he said. \"This is the real thing. Real sword. Watch it happen, pal.\"\n He prepared to swing again. He was still unsteady, but growing stronger quickly. Chris ducked as the blade whined over his head and slashed into the stacked bags of powder. The air was filled with gray particles. Chris stepped back again, and this time felt his foot against a basin on the floor. He started to kick it aside, then noticed its weight beneath his foot. It wasn\u0027t one of the powder basins, it was a heavy paste. And it had a harsh smell. He recognized it immediately: it was the smell of quicklime.\n Which meant the basin at his feet was filled with automatic fire.\n Quickly, Chris bent over and lifted the basin in his hands.\n De Kere paused.\n He knew what it was.\n Chris took the moment of hesitation and threw the basin directly at de Kere\u0027s face. It struck him in the chest, the brown paste spattering his face and arms and body.\n De Kere snarled.\n Chris needed water. Where was there water? He looked around, desperate, but he already knew the answer: there was no water in this room. He was backed into a corner now. De Kere smiled. \"No water?\" he said. \"Too bad, tricky boy.\" He held his sword horizontally in front of him, and moved forward. Chris felt the stone against his back, and knew that he was finished. At least the others might get away.\n He watched de Kere approach, slowly, confidently. He could smell de Kere\u0027s breath; he was close enough to spit on him.\n Spit on him.\n In the instant that he thought it, Chris spat on de Kere - not in the face, but in the chest. De Kere snorted, disgusted: the kid couldn\u0027t even spit. Wherever spittle touched the paste, it began to smoke and sputter.\n De Kere looked down, horrified.\n Chris spat again. And again.\n The hissing was louder. There were the first sparks. In a moment, de Kere would burst into flames. Frantic, de Kere brushed at the paste with his fingers, but only spread it; now it was sizzling and crackling on his fingertips, from the moisture of his skin.\n \"Watch it happen, pal,\" Chris said.\n He ran for the door. Behind him, he heard a whump! as de Kere burst into flame. Chris glanced back to see that the knight\u0027s entire upper body was engulfed in fire. De Kere was staring at him through the flames.\n Then Chris ran. As hard and as fast as he could, he ran. Away from the arsenal.\n At the middle gate, the others saw him running toward them. He was waving his hands. They didn\u0027t understand why. They stood in the center of the gate, waiting for him to catch up.\n He was shouting, \"Go, go!\" and gesturing for them to move around the corner. Marek looked back, and saw flames begin to leap up through the windows of the arsenal.\n \"Move!\" he said. He pushed the others through the gate and into the next courtyard.\n Chris came running through the gate and Marek grabbed his arm, pulling him to cover, just as the arsenal exploded. A great sphere of flame rose about the wall; the entire courtyard was bathed in fiery light. Soldiers and tents and horses were knocked flat by the shock wave. There was smoke and confusion everywhere.\n \"Forget the hoarding,\" the Professor said. \"Let\u0027s go.\" And they ran straight across the courtyard. They could see the final gatehouse directly ahead.\n 00:02:22\n In the control room, there were screams and cheers. Kramer was jumping up and down. Gordon was pounding Stern on the back. The monitor was showing field fluctuations again. Intense and powerful.\n \"They\u0027re coming home!\" Kramer yelled.\n Stern looked at the video screens, which showed the tanks in the room below. The technicians had already filled several shields with water, and the shields were holding. The remaining tanks were still being filled, though the water level was nearing the top.\n \"How much time?\" he said.\n \"Two minutes twenty.\"\n \"How long to fill the tanks?\"\n \"Two minutes ten.\"\n Stern bit his lip. \"We going to make it?\"\n \"You bet your ass we are,\" Gordon said.\n Stern turned back to the field fluctuations. They were growing stronger and clearer, the false colors shimmering on the spikes. The unstable mountain peak was now stable, protruding above the surface, taking form. \"How many are coming back?\" he said. But he already knew the answer, because the mountain peak was dividing into separate ridges.\n \"Three,\" the technician said. \"Looks like three coming back.\"\n 00:01:44\n The outermost gatehouse was closed: the heavy grill of the portcullis was down and the drawbridge had been raised. Five guards now lay sprawled on the ground, and Marek was raising the portcullis just enough so they could pass beneath it. But the drawbridge was still shut fast.\n \"How do we get it open?\" Chris said.\n Marek was looking at the chains, which ran into the gatehouse itself. \"Up there,\" he said, pointing above. There was a winch mechanism on the second floor.\n \"You stay here,\" Marek said. \"I\u0027ll do it.\"\n \"Come right back,\" Kate said.\n \"Don\u0027t worry. I will.\"\n Hobbling up a spiral staircase, Marek came into a small stone room, narrow and bare, and dominated by the iron winch that raised the drawbridge. Here he saw an elderly man, white-haired, shaking with fear as he held an iron bar in the links of the chain. This iron bar was keeping the drawbridge closed. Marek shoved the old man aside and pulled the bar free. The chain rattled; the drawbridge began to lower. Marek watched it go down. He looked at his counter, and was startled to see that it said 00:01:19.\n \"Andre.\" He heard Chris in his earpiece. \"Come on.\"\n \"I\u0027m on my way.\"\n Marek turned to go. Then he heard running feet, and realized that there were soldiers on the roof of the guardhouse, coming down to see why the drawbridge was being lowered. If he left the room now, they would immediately stop the drawbridge from lowering any farther.\n Marek knew what this meant. He had to stay longer.\n On the ground floor below, Chris watched the drawbridge as it lowered, chains clanking. Through the opening, he could see dark sky and stars. Chris said, \"Andre, come on.\"\n \"There\u0027s soldiers.\"\n \"So?\"\n \"I have to guard the chain.\"\n \"What do you mean?\" Chris said.\n Marek didn\u0027t answer. Chris heard a grunt, and a scream of pain. Marek was up there, fighting. Chris watched the drawbridge continue to descend. He looked at the Professor. But the Professor\u0027s face was expressionless.\n Standing by the staircase leading down from the roof, Marek held his sword high. He killed the first soldier as he came out. He killed the second one, too, kicking the bodies as they fell, keeping the floor clear. The other soldiers on the stairs paused in confusion, and he heard muttering and consternation.\n The drawbridge chain still rattled. The drawbridge continued down.\n \"Andre. Come on.\"\n Marek glanced at his counter. It said 00:01:04. Just a little more than a minute, now. Looking out the window, he saw the others had not waited until the drawbridge was entirely down; they ran to the descending edge, and jumped out onto the field beyond the castle. Now he could hardly see them in the darkness.\n \"Andre.\" It was Chris again. \"Andre.\"\n Another soldier came down the stairs, and Marek swung his sword, which clanged against the winch, spitting sparks. The man hastily backed up, shouting and pushing the others.\n \"Andre, run for it,\" Chris said. \"You have time.\"\n Marek knew that was true. He could just make it. If he left now, the men couldn\u0027t raise the drawbridge before he had run across it and was out on the plain with the others. He knew they were out there, waiting for him. His friends. Waiting to go back.\n As he turned to go down the stairs, his glance fell on the old man, still cowering in the corner. Marek wondered what it must be like to live your entire life in this world. To live and love, constantly on the edge, with disease and starvation and death and killing. To be alive in this world.\n \"Andre. Are you coming?\"\n \"There\u0027s no time,\" Marek said.\n \"Andre.\"\n He looked out on the plain and saw successive flashes of light. They were calling the machines. Getting ready to go.\n The machines were there. They were all standing on their platforms. Cold vapor was drifting from the bases, curling across the dark grass.\n Kate said, \"Andre, come on.\"\n There was a short silence. Then: \"I\u0027m not leaving,\" Marek said. \"I\u0027m staying here.\"\n \"Andre. You\u0027re not thinking right.\"\n \"Yes, I am.\"\n She said, \"Are you serious?\"\n Kate looked at the Professor. He just nodded slowly.\n \"All his life, he\u0027s wanted this.\"\n Chris put the ceramic marker in the slot at his feet.\n Marek watched from the window of the gatehouse.\n \"Hey, Andre.\" It was Chris.\n \"See you, Chris.\"\n \"Take care of yourself.\"\n \"Andre.\" It was Kate. \"I don\u0027t know what to say.\"\n \"Good-bye, Kate.\"\n Then he heard the Professor say: \"Good-bye, Andre.\"\n \"Good-bye,\" Marek said.\n Through his earpiece, he heard a recorded voice say, \"Stand still - eyes open - deep breath - hold it. . . . Now!\"\n On the plain, he saw a brilliant flash of blue light. Then there was another, and another, diminishing in intensity, until there was nothing more.\n Doniger strode back and forth across the darkened stage. In the auditorium, the three corporate executives sat silently, watching him.\n \"Sooner or later,\" he said, \"the artifice of entertainment - constant, ceaseless entertainment - will drive people to seek authenticity. Authenticity will be the buzzword of the twenty-first century. And what is authentic? Anything that is not controlled by corporations. Anything that is not devised and structured to make a profit. Anything that exists for its own sake, that assumes its own shape. And what is the most authentic of all? The past.\n \"The past is a world that already existed before Disney and Murdoch and British Telecom and Nissan and Sony and IBM and all the other shapers of the present. The past was here before they were. The past rose and fell without their intrusion and molding. The past is real. It\u0027s authentic. And this will make the past unbelievably attractive. Because the past is the only alternative to the corporate present.\n \"What will people do? They are already doing it. The fastest-growing segment of travel today is cultural tourism. People who want to visit not other places, but other times. People who want to immerse themselves in medieval walled cities, in vast Buddhist temples, Mayan pyramid cities, Egyptian necropolises. People who want to walk and be in the world of the past. The vanished world.\n \"And they don\u0027t want it to be fake. They don\u0027t want it to be made pretty, or cleaned up. They want it to be authentic. Who will guarantee that authenticity? Who will become the brand name of the past? ITC.\n \"I am about to show you,\" he said, \"our plans for cultural tourism sites around the world. I will concentrate on one in France, but we have many others, as well. In every case, we turn over the site to the government of that country. But we own the surrounding territory, which means we will own the hotels and restaurants and shops, the entire apparatus of tourism. To say nothing of the books and films and guides and costumes and toys and all the rest. Tourists will spend ten dollars to get into the site. But they\u0027ll spend five hundred dollars in living expenses outside it. All that will be controlled by us.\" He smiled. \"To make sure that it is executed tastefully, of course.\"\n A graph came up behind him.\n \"We estimate that each site will generate in excess of two billion dollars a year, including merchandising. We estimate that total company revenues will exceed one hundred billion dollars annually by the second decade of the coming century. That is one reason for making your commitment to us.\n \"The other reason is more important. Under the guise of tourism, we are in effect building an intellectual brand name. Such brand names now exist for software, for example. But none exist for history. And yet history is the most powerful intellectual tool society possesses. Let us be clear. History is not a dispassionate record of dead events. Nor is it a playground for scholars to indulge their trivial disputes.\n \"The purpose of history is to explain the present - to say why the world around us is the way it is. History tells us what is important in our world, and how it came to be. It tells us why the things we value are the things we should value. And it tells us what is to be ignored, or discarded. That is true power - profound power. The power to define a whole society.\n \"The future lies in the past - in whoever controls the past. Such control has never before been possible. Now, it is. We at ITC want to assist our clients in the shaping of the world in which we all live and work and consume. And in doing so, I believe we will have your full and wholehearted support.\"\n There was no applause, just stunned silence. That was the way it always was. It took them a while to realize what he was saying. \"Thanks for your attention,\" Doniger said, and strode off the stage.\n \"This better be good,\" Doniger said. \"I don\u0027t like to cut a session like that short.\"\n \"It\u0027s important,\" Gordon said. They were walking down the corridor, toward the machine room.\n \"They\u0027re back?\"\n \"Yes. We got the shields working, and three of them are back.\"\n \"When?\"\n \"About fifteen minutes ago.\"\n \"And?\"\n \"They\u0027ve been through a lot. One of them is pretty badly injured and will need hospitalization. The other two are okay.\"\n \"So? What\u0027s the problem?\"\n They went through a door.\n \"They want to know,\" Gordon said, \"why they weren\u0027t told ITC\u0027s plans.\"\n \"Because it\u0027s none of their business,\" Doniger said.\n \"They risked their lives - \"\n \"They volunteered.\"\n \"But they - \"\n \"Oh, fuck them,\" Doniger said. \"What is all this sudden concern? Who cares? They\u0027re a bunch of historians - they\u0027re all going to be out of a job, anyway, unless they work for me.\"\n Gordon didn\u0027t answer. He was looking over Doniger\u0027s shoulder. Doniger slowly turned.\n Johnston was standing there, and the girl, who now had her hair hacked short, and one of the men. They were dirty, ragged and covered in blood. They were standing by a video monitor, which showed the auditorium. The executives were now leaving the auditorium, the stage empty. But they must have heard the speech, or at least part of it.\n \"Well,\" Doniger said, suddenly smiling, \"I\u0027m very glad you are back.\"\n \"So are we,\" Johnston said. But he didn\u0027t smile.\n No one spoke.\n They just stared at him.\n \"Oh, fuck you people,\" he said. He turned to Gordon. \"Why did you bring me here? Because the historians are upset? This is the future, whether they like it or not. I don\u0027t have time for this shit. I have a company to run.\"\n But Gordon was holding a small gas cylinder in his hand. \"There have been some discussions, Bob,\" he said. \"We think someone more moderate should run the company now.\"\n There was a hiss. Doniger smelled a sharp odor, like ether.\n He awoke, hearing a loud humming, and what sounded like the scream of rending metal. He was inside the machine. He saw all of them staring at him from behind the shields. He knew not to step out, not once it had started. He said loudly, \"This isn\u0027t going to work,\" and then the violet flash of laser light blinded him. The flashes came quickly now. He saw the transit room rise up around him as he shrank - then the hissing foam as he descended toward it - then the final shriek in his ears, and he closed his eyes, waiting for the impact.\n Blackness.\n He heard the chirp of birds, and he opened his eyes. The first thing he did was look up at the sky. It was clear. So it wasn\u0027t Vesuvius. He was in a primeval forest with huge trees. So it wasn\u0027t Tokyo. The twittering of the birds was pleasant, the air warm. It wasn\u0027t Tunguska.\n Where the hell was he?\n The machine rested at a slight angle; the forest ground sloped downward to the left. He saw light between the tree trunks, some distance away. He got out of the machine and walked down the slope. Somewhere in the distance, he heard the slow beat of a solitary drum.\n He came to a break in the trees and looked down over a fortified town. It was partially obscured by the smoke of many fires, but he recognized it at once. Oh hell, he thought, it\u0027s just Castelgard. What was the big deal, forcing him to come here?\n It was Gordon, of course, who was behind it. That bullshit line about how the academics were disappointed. It was Gordon. The son of a bitch had been running the technology, and now he thought he could run the company, as well. Gordon had sent him back, thinking he couldn\u0027t return.\n But Doniger could return, and he would. He wasn\u0027t worried, because he carried a ceramic with him at all times. He kept it in a slot in the heel of his shoe. He pulled the shoe off, and looked at the slot. Yes, the white ceramic was there. But it was pushed deep in the slot, and it seemed to be stuck there. When he shook the shoe, it didn\u0027t drop out. He tried a twig, poking in the slot, but the twig bent.\n Next he tried to pull the heel off the shoe, but he couldn\u0027t get enough leverage; the heel stayed on. What he needed was a metal tool of some kind, a wedge or a chisel. He could find one in the town, he felt sure.\n He put the shoe back on, stripped off his jacket and tie, and walked down the slope. Looking at the town, he noticed some odd details. He was just above the east gate in the town wall, but the gate was wide open. And there were no soldiers along the walls. That was odd. Whatever year this was, it was obviously a time of peace - there were those times, between English invasions. But still, he\u0027d have thought the gate would always be guarded. He looked at the fields and saw no one tending them. They seemed neglected, with large clumps of weeds.\n What the hell? he thought.\n He passed through the gate and walked into the town. He saw that the gate was unguarded because the soldier on guard lay dead on his back. Doniger leaned over to look at him. There were bright streaks of blood coming from around his eyes. He must have been struck on the head, he thought.\n He turned to the town itself. The smoke, he now saw, was issuing from little pots that had been placed everywhere - on the ground, on walls, or on fence posts. And the town seemed to be deserted, empty in the bright, sunny day. He walked to the market, but nobody was there. He heard the sound of monks chanting; they were coming toward him. And he heard the drum.\n He felt a chill.\n A dozen monks, all dressed in black, rounded the corner in a kind of procession, chanting. Half of them were stripped to the waist, lashing themselves with leather whips studded with bits of metal. Their shoulders and backs were bleeding freely.\n Flagellants.\n That was what they were, flagellants. Doniger gave a low moan and backed away from the monks, who continued past him in stately fashion, ignoring him. He continued to step away, farther and farther, until his back touched something wooden.\n He turned and saw a wooden horse cart, but there was no horse. He saw bundles of cloth piled high on the cart. Then he saw a child\u0027s foot protruding from one of the bundles. A woman\u0027s arm from another. The buzzing of flies was very loud. A cloud of flies, swarming over the bodies.\n Doniger began to shiver.\n The arm had odd blackish lumps on it.\n The Black Death.\n He knew now what year it was. It was 1348. The year the plague first struck Castelgard and killed a third of the population. And he knew how it spread - by the bites of fleas, by touch and by air. Just breathing the air could kill you. He knew that it could kill swiftly, that people just fell over in the street. One minute you were perfectly fine. Then the coughing began, the headache. An hour later you were dead.\n He had been very close to the soldier by the gate. He had been close to the man\u0027s face.\n Very close.\n Doniger slumped down against a wall, feeling the numbness of terror creep over him.\n As he sat there, he began to cough.\n EPILOGUE\n Rain slashed across the gray English landscape. The windshield wipers snicked back and forth. In the driver\u0027s seat, Edward Johnston leaned forward and squinted as he tried to see through the rain. Outside were low, dark green hills, demarcated by dark hedges, and everything blurred by the rain. The last farm had been a couple of miles back.\n Johnston said, \"Elsie, are you sure this is the road?\"\n \"Absolutely,\" Elsie Kastner said, the map open on her lap. She traced the route with her finger. \"Four miles beyond Cheatham Cross to Bishop\u0027s Vale, and one mile later, it should be up there, on the right.\"\n She pointed to a sloping hill with scattered oak trees.\n \"I don\u0027t see anything,\" Chris said, from the back seat.\n Kate said, \"Is the air conditioner on? I\u0027m hot.\" She was seven months pregnant, and always hot.\n \"Yes, it\u0027s on,\" Johnston said.\n \"All the way?\"\n Chris patted her knee reassuringly.\n Johnston drove slowly, looking for a mileage marker at the side of the road. The rain diminished. They could see better. And then Elsie said, \"There!\"\n On the top of the hill was a dark rectangle, with crumbling walls.\n \"That\u0027s it?\"\n \"That\u0027s Eltham Castle,\" she said. \"What\u0027s left of it.\"\n Johnston pulled the car over to the side of the road, and cut the ignition. Elsie read from her guidebook. \"First built on this site by John d\u0027Elthaim in the eleventh century, with several later additions. Notably the ruined keep from the twelfth century, and a chapel in the English Gothic style, from the fourteenth. Unrelated to Eltham Castle in London, which is from a later period.\"\n The rain lessened, now just scattered drops in the wind. Johnston opened the car door and got out, shrugging on his raincoat. Elsie got out on the passenger side, her documents encased in plastic. Chris ran around the car to open the door for Kate, and helped her out. They climbed over a low stone wall, and began climbing up toward the castle.\n The ruin was more substantial than it had seemed from the road; high stone walls, dark with rain. There were no ceilings; the rooms were open to the sky. No one spoke as they walked through the ruins. They saw no signs, no antiquities markers, nothing at all to indicate what this place had been, or even its name. Finally Kate said, \"Where is it?\"\n \"The chapel? Over there.\"\n Walking around a high wall, they saw the chapel, surprisingly complete, its roof rebuilt at some time in the past. The windows were merely open arches in the stone, without glass. There was no door.\n Inside the chapel, the wind blew through cracks and windows. Water dripped from the ceiling. Johnston took out a large flashlight, and shone it on the walls.\n Chris said, \"How did you find out about this place, Elsie?\"\n \"In the documents, of course,\" she said. \"In the Troyes archives, there was a reference to a wealthy English brigand named Andrew d\u0027Eltham who had paid a visit to the Monastery of Sainte-M¨¨re in his later years. He brought his entire family from England, including his wife and grown sons. That started me searching.\"\n \"Here,\" Johnston said, shining his light on the floor.\n They all walked over to see.\n Broken tree branches and a layer of damp leaves covered the floor. Johnston was down on his hands and knees, brushing them away to expose weathered burial stones that had been set in the floor. Chris sucked in his breath when he saw the first one. It was a woman, dressed demurely in long robes, lying on her back. The carving was unmistakably the Lady Claire. Unlike many carvings, Claire was depicted with her eyes open, staring frankly at the viewer.\n \"Still beautiful,\" Kate said, standing with her back arched, her hand pressed into her side.\n \"Yes,\" Johnston said. \"Still beautiful.\"\n Now the second stone was cleared away. Lying next to Claire, they saw Andre Marek. He, too, had his eyes open. Marek looked older, and he had a crease on the side of his face that might have been from age, or might have been a scar.\n Elsie said, \"According to the documents, Andrew escorted Lady Claire back to England from France, and then married her. He didn\u0027t care about the rumors that Claire had murdered her previous husband. By all accounts he was deeply in love with his wife. They had five sons, and were inseparable all their lives.\n \"In his old age,\" Elsie said, \"the old routier settled down to a quiet life, and doted on his grandchildren. Andrew\u0027s dying words were \u0027I have chosen a good life.\u0027 He was buried in the family chapel in Eltham, in June 1382.\"\n \"Thirteen eighty-two,\" Chris said. \"He was fifty-four.\"\n Johnston was cleaning the rest of the stone. They saw Marek\u0027s shield: a prancing English lion on a field of French lilies. Above the shield were words in French.\n Elsie said, \"His family motto, echoing Richard Lionheart, appeared above the coat of arms: Mes compaingnons cui j\u0027amoie et cui j\u0027aim, . . . Me di, chanson.\" She paused. \" \u0027Companions whom I loved, and still do love, . . . Tell them, my song.\u0027 \"\n They stared at Andre for a long time.\n Johnston touched the stone contours of Marek\u0027s face with his fingertips. \"Well,\" he said finally, \"at least we know what happened.\"\n \"Do you think he was happy?\" Chris said.\n \"Yes,\" Johnston said. But he was thinking that however much Marek loved it, it could never be his world. Not really. He must have always felt a foreigner there, a person separated from his surroundings, because he had come from somewhere else.\n The wind whined. A few leaves blew, scraping across the floor. The air was damp and cold. They stood silently.\n \"I wonder if he thought of us,\" Chris said, looking at the stone face. \"I wonder if he ever missed us.\"\n \"Of course he did,\" the Professor said. \"Don\u0027t you miss him?\"\n Chris nodded. Kate sniffled, and blew her nose.\n \"I do,\" Johnston said.\n They went back outside. They walked down the hill to the car. By now the rain had entirely stopped, but the clouds remained dark and heavy, hanging low over the distant hills.\n ACKNOWLEDGMENTS\n Our understanding of the medieval period has changed dramatically in the last fifty years. Although one occasionally still hears a self-important scientist speak of the Dark Ages, modern views have long since overthrown such simplicities. An age that was once thought to be static, brutal and benighted is now understood as dynamic and swiftly changing: an age where knowledge was sought and valued; where great universities were born, and learning fostered; where technology was enthusiastically advanced; where social relations were in flux; where trade was international; where the general level of violence was often less deadly than it is today. As for the old reputation of medieval times as a dark time of parochialism, religious prejudice and mass slaughter, the record of the twentieth century must lead any thoughtful observer to conclude that we are in no way superior.\n In fact, the conception of a brutal medieval period was an invention of the Renaissance, whose proponents were at pains to emphasize a new spirit, even at the expense of the facts. If a benighted medieval world has proven a durable misconception, it may be because it confirms a cherished contemporary belief--that our species always moves forward to ever better and more enlightened ways of life. This belief is utter fantasy, but it dies hard. It is especially difficult for modern people to conceive that our modern, scientific age might not be an improvement over the prescientific period.\n A word about time travel. While it is true that quantum teleportation has been demonstrated in laboratories around the world, the practical application of such phenomena lies in the future. The ideas presented in this book were stimulated by the speculations of David Deutsch, Kip Thorne, Paul Nahin and Charles Bennett, among others. What appears here may amuse them, but they would not take it seriously. This is a novel: time travel rests firmly in the realm of fantasy.\n But the representation of the medieval world has a more substantial basis, and for it I am indebted to the work of many scholars, some of whom are identified in the bibliography that follows. Errors are mine, not theirs.\n I\u0027m grateful as well to Catherine Kanner for the illustrations, and to Brant Gordon for the computer-generated architectural renderings.\n Finally, my particular thanks to historian Bart Vranken for his invaluable insights, and for his companionship while tramping through little-known and neglected ruins of the Perigord.\n BIBLIOGRAPHY\n Allmand, Christopher. The Hundred Years War: England and France at War c. 1300¨Cc. 1450. Cambridge, Eng.: Cambridge University Press, 1988.\n Anonymous. Lancelot of the Lake. Trans. Corin Corley. Oxford: Oxford University Press, 1989.\n Artz, Frederick B. The Mind of the Middle Ages: An Historical Survey, A.D. 200¨C1500. Chicago: University of Chicago Press, 1980.\n Ayton, Andrew. Knights and Warhorses: Military Service and the English Aristocracy under Edward III. Woodbridge, Eng.: Boydell Press, 1994.\n Barber, Richard. Edward, Prince of Wales and Aquitaine. Woodbridge, Eng.: Boydell Press, 1996.\n - - - , ed. and trans. The Life and Campaigns of the Black Prince. London: Folio Society, 1979.\n - - - , and Juliet Barker. Tournaments. Woodbridge, Eng.: Boydell Press, 1989.\n Bentley, James. Fort Towns of France: The Bastides of the Dordogne and Aquitaine. London: Tauris Parke, 1993.\n Berry, Duc de. The Tr¨¨s Riches Heures of Jean, Duke of Berry. Ed. Jean Longnon. New York: George Braziller, 1969.\n Black, Maggie. The Medieval Cookbook. New York: Thames and Hudson, 1992.\n Blair, Claude. European and American Arms, c. 1100¨C1850. New York: Bonanza Books, 1962.\n Bloch, Marc. Feudal Society. Trans. L. A. Mayon. Chicago: University of Chicago Press, 1961.\n Bradbury, Jim. The Medieval Siege. Woodbridge, Eng.: Boydell Press, 1992.\n Burne, Alfred H. The Crecy War. New York: Oxford University Press, 1955.\n Cantor, Norman F. Inventing the Middle Ages. New York: William Morrow, 1991. One of the finest intellectual histories ever written. Informative about medievalists and the period.\n Chretien de Troyes. Cliges. New Haven: Yale University Press, 1998.\n Chretien de Troyes. Lancelot: The Knight of the Cart. New Haven: Yale University Press, 1998.\n Christine de Pizan. The Book of the Duke of True Lovers. Trans. Thelma S. Fenster. New York: Persea Books, 1992.\n Contamine, Philippe. War in the Middle Ages. Trans. Michael Jones. Oxford: Blackwell, 1984.\n Cosman, Madeleine P. Fabulous Feasts: Medieval Cookery and Ceremony. New York: George Braziller, 1995.\n Curry, Anne, and Michael Hughes, eds. Arms, Armies and Fortifications in the Hundred Years War. Woodbridge, Eng.: Boydell Press, 1994. See particularly the chapters by Vale and Hardy.\n Delbruck, Hans. Medieval Warfare. Trans. Walter J. Renfroe, Jr. Lincoln: University of Nebraska Press, 1982.\n Duby, Georges, ed. A History of Private Life, Vol. II: Revelations of the Medieval World. Trans. Arnold Goldhammer. Cambridge, Mass.: Harvard University Press, 1988.\n - - - . France in the Middle Ages: 987¨C1460. Oxford, Eng.: Blackwell, 1991.\n Ferguson, Niall, ed. Virtual History: Alternatives and Counterfactuals. London: Picador, 1977.\n Ffoulkes, Charles. The Armourer and His Craft: From the XIth to the XVth Century. 1912. Reprint, Salem, N.H.: Ayer, 1967.\n Froissart, Jean. Chronicles of England, France and Spain. Trans. Thomas Johnes. New York: Colonial Press, 1901.\n - - - . Froissart: Chronicles. Trans. Geoffrey Brereton. London: Penguin, 1978. A readable translation in a single volume.\n - - - . Froissarts Cronycles. Trans. Lord Berniers. Oxford, Eng.: Blackwell, 1927.\n Geoffroi de Charny. The Book of Chivalry of Geoffroi de Charny. Trans. Richard W. Kaeuper and Elspeth Kennedy. Philadelphia: University of Pennsylvania Press, 1996.\n Gies, Francis and Joseph. Cathedral, Forge and Waterwheel: Technology and Invention in the Middle Ages. New York: HarperCollins, 1994.\n Gillmeister, Heiner. Tennis: A Cultural History. New York: New York University Press, 1998.\n Gimpel, Jean. The Medieval Machine: The Industrial Revolution of the Middle Ages. London: Penguin Books, 1976.\n Goetz, Hans-Werner. Life in the Middle Ages. Trans. Albert Wimmer. Notre Dame, Ind.: University of Notre Dame Press, 1993.\n Goodrich, Michael E. Violence and Miracle in the Fourteenth Century. Chicago: University of Chicago Press, 1995.\n Henisch, Bridget Ann. Fast and Feast: Food in Medieval Society. University Park: Pennsylvania State University Press, 1976.\n Hilton, R. H. English and French Towns in Feudal Society. Cambridge, Eng.: Cambridge University Press, 1992.\n Horn, Walter, and Ernest Born. The Plan of St. Gall. 3 vols. Berkeley: University of California Press, 1979.\n Houston, Mary G. Medieval Costume in England and France: The 13th, 14th and 15th Centuries. London: Adam and Charles Black, 1939.\n Huizinga, Johan. The Autumn of the Middle Ages. Trans. Rodney J. Payton and Ulrich Mammitzsch. Chicago: University of Chicago Press, 1996.\n Huppert, George. After the Black Death: A Social History of Early Modern Europe. Bloomington: Indiana University Press, 1998.\n Hyland, Ann. The Medieval Warhorse. Conshohocken, Pa.: Combined Books, 1994.\n Johnson, Eric A., and Eric H. Monkkonen. The Civilization of Crime: Violence in Town and Country since the Middle Ages. Urbana: University of Illinois Press, 1996.\n Kaeuper, Richard W. War, Justice and Public Order: England and France in the Later Middle Ages. Oxford: Clarendon Press, 1988.\n Keen, Maurice. Chivalry. New Haven: Yale University Press, 1984.\n La Sale, Antoine de. Le Petit Jehan de Saintre. Trans. Irvine Gray. 1931. Reprint, Westport, Conn.: Hyperion, 1978.\n La Tour Landry, Geoffrey de. The Book of the Knight of La Tour Landry. Ed. G. S. Taylor. London: John Hamilton, n.d.\n LaBarge, Margaret Wade. Gascony: England\u0027s First Colony, 1204¨C1453. London: Hamish Hamilton, 1980.\n Lambert, Joseph B. Traces of the Past: Unraveling the Secrets of Archaeology Through Chemistry. Reading, Mass.: Perseus Books, 1997.\n Lodge, Eleanor C. Gascony under English Rule. London: Methuen, 1926.\n McFarlane, K. B. The Nobility of Later Medieval England. Oxford: Clarendon Press, 1973.\n McKisack, May. The Fourteenth Century, 1307¨C1399. New York: Oxford University Press, 1959.\n Mesqui, Jean. Chateaux, Forts et Fortifications en France. Paris: Flammarion Press, 1997.\n Muir, Lynette R. Literature and Society in Medieval France. New York: St. Martin\u0027s Press, 1985.\n Murrin, Michael. History and Warfare in Renaissance Epic. Chicago: University of Chicago Press, 1994.\n Oman, C.W.C. The Art of War in the Middle Ages. Ithaca, N.Y.: Cornell University Press, 1953.\n Origo, Iris. The Merchant of Prato. New York: Alfred A. Knopf, 1957.\n Orser, Charles E., Jr., and Brian M. Fagan. Historical Archaeology. New York: HarperCollins, 1995.\n Ottaway, Patrick. Archaeology in British Towns. New York: Routledge, 1992.\n Partington, J. R. A History of Greek Fire and Gunpowder. Baltimore: Johns Hopkins University Press, 1999. See especially the excellent introduction by Bert S. Hall.\n Paterson, Linda M. The World of the Troubadours: Medieval Occitan Society c. 1000¨Cc. 1300. Cambridge, Eng.: Cambridge University Press, 1993.\n Perroy, Edouard. The Hundred Years War. Trans. W. B. Wells. New York: Oxford University Press, 1951.\n Pirenne, Henri. Medieval Cities: Their Origins and the Revival of Trade. Princeton: Princeton University Press, 1969.\n Prestwich, Michael. Armies and Warfare in the Middle Ages: The English Experience. New Haven: Yale University Press, 1996.\n - - - . The Three Edwards: War and State in England, 1272¨C1377. London: Routledge, 1996.\n Ranoux, Patrick. Atlas de la Dordogne-Perigord. Montrem, France: Saunard, 1996.\n Rossiaud, Jacques. Medieval Prostitution. Oxford: Blackwell, 1995.\n Rowling, Marjorie. Life in Medieval Times. New York: Berkley, 1977.\n Sautman, Francesca Canade, Diana Conchado and Guiseppe Carlo DiScipio, eds. Telling Tales: Medieval Narratives and the Folk Tradition. New York: St. Martin\u0027s Press, 1998.\n Sedgwick, Henry D. The Life of Edward the Black Prince, 1330¨C1376. Indianapolis: Bobbs-Merrill, 1932.\n Singman, Jeffrey L., and Will McLean. Daily Life in Chaucer\u0027s England. Westport, Conn.: Greenwood Press, 1995.\n Speed, Peter, ed. Those Who Fought: An Anthology of Medieval Sources. New York: Italica Press, 1996.\n Strayer, Joseph R. On the Medieval Origins of the Modern State. Princeton: Princeton University Press, 1970.\n Sumption, Jonathan. The Hundred Years War I: Trial by Battle. London: Faber \u0026 Faber, 1991.\n - - - . The Hundred Years War II: Trial by Fire. London: Faber \u0026 Faber, 1999.\n Tuchman, Barbara W. A Distant Mirror: The Calamitous Fourteenth Century. New York: Alfred A. Knopf, 1978.\n Vale, Malcolm. War and Chivalry: Warfare and Aristocratic Culture in England, France and Burgundy at the End of the Middle Ages. Athens: University of Georgia Press, 1981.\n White, Lynn, Jr. Medieval Technology and Social Change. Oxford: Clarendon Press, 1962.\n Wright, Nicholas. Knights and Peasants: The Hundred Years War in the French Countryside. Woodbridge, Eng.: Boydell Press, 1998.\n Wroe, Ann. A Fool and His Money: Life in a Partitioned Town in Fourteenth-Century France. New York: Hill and Wang, 1995.\n Zimmer, Heinrich. The King and the Corpse. Princeton: Princeton University Press, 1971.\n SCIENTIFIC REFERENCES\n Deutsch, David. The Fabric of Reality: The Science of Parallel Universes and Its Implications. New York: Penguin, 1997. A brilliant, stimulating and very well written book. See particularly the photon interference demonstration of multiverses, on which my own text relies.\n - - - , and Michael Lockwood. \"The Quantum Physics of Time Travel.\" Scientific American, March 1994, pp. 68¨C74.\n Kaku, Michio. Hyperspace. New York: Oxford University Press, 1994.\n Milburn, Gerard J. Schr?dinger\u0027s Machines: The Quantum Technology Reshaping Everyday Life. New York: W. H. Freeman, 1997.\n - - - . The Feynman Processor. Reading, Mass.: Perseus Books, 1998.\n Misner, Charles W., Kip S. Thorne and John A. Wheeler. Gravitation. San Francisco: W. H. Freeman, 1973.\n Nahin, Paul J. Time Machines. 2nd ed. New York: Springer-Verlag, 1999. See particularly \"Tech Note 9: Wormhole Time Machines,\" pp. 489¨C525.\n Thorne, Kip S. Black Holes and Time Warps. New York: Norton, 1994.\n Wheeler, John Archibald, with Kenneth Ford. Geons, Black Holes and Quantum Foam. New York: W. W. Norton, 1998.\n Williams, Colin P., and Scott H. Clearwater. Explorations in Quantum Computing. New York: Springer-Verlag, 1998. \n","sourceLink":"https://allnovel.net/timeline/page-17.html","bookId":1708,"book":{"id":1708,"title":"Timeline","description":"Storyline: \n In an Arizona desert, a man wanders in a daze, speaking words that make no sense. Within twenty-four hours he is dead, his body swiftly cremated by his only known associates. Halfway around the world, archaeologists make a shocking discovery at a medieval site. Suddenly they are swept off to the headquarters of a secretive multinational corporation that has developed an astounding technology. Now this group is about to get a chance not to study the past but to enter it. And with history opened up to the present, the dead awakened to the living, these men and women will soon find themselves fighting for their very survival -- six hundred years ago.\n \n","cover":"https://allnovel.net/images/timeline.jpg","author":"Michael Crichton","type":"Thriller","source":"allnovel","link":"https://allnovel.net/timeline.html","creation":"Oct 5, 2019 8:57:53 AM","modification":"Oct 5, 2019 10:01:30 AM"}}
