{"id":100058,"no":12,"title":"Page 12","content":"The snake\u0027s muscles rippled, slowly drawing the helpless frog deeper into its mouth. The frog struggled pitifully, but it was just a harmless, weak thing and no match for the great black serpent. This was the natural way of things, but to Geek, the goblin-turned-frog, it did not seem natural at all.\\n\\n He knew that soon the unhinged jaw would slip beyond his bulbous eyes, and then all the world would be darkness. He had seen engorged snakes before and knew that it would be a long time before he was fully digested. How long would he live in that awful state?\\n\\n \"Dear Geek,\" he heard someone - was it Lady Ceridwen? - say. \"We have no time for such play!\"\\n\\n \"Play!\" he wanted to scream back at the wicked sorceress, but his cry came out as no more than a breathless croak as the snake clamped down on its fairly won quarry.\\n\\n Then Geek saw the tip of a wand dip down before his bulging eyes. The snake started to wriggle away, dragging the helpless frog with it. Ceridwen uttered a few words and there came apop! and a ripping sound, and Geek was a goblin again, lying facedown on the swampy ground.\\n\\n \"Bless you, me lady!\" he groveled, trying to crawl to Ceridwen\u0027s feet. He found himself encumbered by the body of the ten-foot snake, its head and upper torso torn apart by the transformation, but still stubbornly clinging to Geek\u0027s waist and legs. The goblin whimpered and thrashed to get free, thoroughly disgusted.\\n\\n \"Will you please stop playing with that snake?\" Ceridwen said calmly. \"We have much business to attend. And get up out of that mud! You are the personal attendant of Lady Ceridwen! Do try to look the part!\"\\n\\n Geek bit back the curses he wanted to spout at the sorceress and instead resumed his groveling, slobbering kisses all over Ceridwen\u0027s muddy feet. She kicked him in the face and he thanked her over and over.\\n\\n \"I have turned them back from Dvergamal,\" the sorceress explained. \"We must catch them on the plain, before they get south around the mountains, heading up towards the Crahgs.\" Her deadly, icy gaze fell fully over the goblin. \"You must catch them.\"\\n\\n Geek nearly toppled, realizing the price of failure. He looked back to the shredded remains of the black snake and knew that many more such creatures, and even worse creatures, lived in the swamp.\\n\\n \"Geek go get goblins for help,\" he stammered.\\n\\n \"Goblins?\" Ceridwen laughed. \"You would be defeated, as you were defeated on the road.\" Those icy-blue death-promising eyes flashed again. \"We\u0027ll need bigger things than goblins to stop Kelsenellenelvial and his friends - and they have a dwarf with them now.\"\\n\\n \"Bigger?\" Geek dared to ask, though he truly feared to hear the answer.\\n\\n \"You will go into Dvergamal for me,\" Ceridwen explained. \"To a northern valley feared by travelers and even by the dwarfs.\"\\n\\n Geek paled, beginning to understand why he was saved.\\n\\n \"I have some friends there which you must enlist,\" the witch said calmly, as though it was all no more than a minor task.\\n\\n \"Lady...,\" Geek began, thinking then that he preferred being a frog.\\n\\n \"They are big enough to catch the likes of that troublesome elf,\" Ceridwen went on, totally ignoring the whining goblin. \"And cunning enough to resist the foolery of that leprechaun.\" Her description was unnecessary at that moment; Geek knew that she was talking of trolls. Horrid trolls, which even mighty Ceridwen did not wish to face.\\n\\n \"Lady...,\" he gasped again.\\n\\n \"Promise them a hundred gold pieces and a dozen fat sheep,\" Ceridwen went on. \"A purse and mutton, that should bring them running. Two hundred gold pieces and two dozen sheep if they do not kill the elf or any of his friends. Just catch them and bring them to me.\"\\n\\n \"Trolls will eats me!\" Geek cried.\\n\\n \"Oh, Geek,\" Ceridwen laughed. \"You are always thinking of play! You will not be eaten, not if you promise them enough.\"\\n\\n \"Geek bring gold?\" the goblin asked hopefully.\\n\\n Ceridwen laughed again, louder. \"Bring gold?\" she echoed incredulously.\"Promise gold, dear Geek.\\n\\n \"Oh, very well,\" Ceridwen said after Geek did not relinquish his pouting expression. Geek smiled hopefully, a grin that dissipated as soon as Ceridwen handed him a single gold piece.\\n\\n \"Give them this,\" the sorceress explained. \"Promise them the rest.\"\\n\\n Geek looked to the west, to the towering, snow-covered mountains, then back to the torn snake behind him, honestly wondering which fate he preferred.\\n\\n It wasn\u0027t his choice to make.\\n\\n Ceridwen uttered a few words and made a hand gesture or two, and in the blink of the astonished goblin\u0027s eye, Geek found himself far from the swamp and the plain. Jagged snow-packed mountains surrounded him, stretching as high up as he could see.\\n\\n \"No, lady, no,\" he whined through chattering teeth, though he realized that Ceridwen couldn\u0027t hear him, and wouldn\u0027t care anyway.\\n\\n He inched along the trail in a secluded dell on the southern side of Dvergamal. The Cailleac Bheur\u0027s storm had diminished and the temperature had grown more seasonable, but still the paths remained deep with snow. Poor Geek\u0027s progress slowed even further with each step, hindered as much by valid fears as by the icy trails. Somehow, Geek almost found himself homesick for the snake\u0027s unhinged jaw. He rarely dealt with trolls, especially huge and nasty mountain trolls who were always hungry and not particular about what, or who, they stuffed into their yellow-fanged mouths.\\n\\n The pitiful goblin came around a ridge, trying to be as stealthy as possible. He heard the trolls grumbling and arguing (trolls were always grumbling and arguing) in the distance and saw the flickering light of their campfire. Then the world went dark for poor Geek as a sack dropped over his head. In a second, he was hoisted feet-up and slung over a huge shoulder.\\n\\n \"Ten thousand golds and a million sheep!\" Geek cried in terror, smelling disgusting troll breath right through the dirty sack. He managed to poke one hand out of the sack, presenting the troll with a single gold piece, the coin Ceridwen had enchanted with promises of splendid riches.\\n\\n The companions broke camp early the next day. An uncomfortable stillness engulfed them, fed by silent fears of their powerful nemesis and by the heightened surliness of the gruff dwarf. No one dared to ask Geno to help in breaking down the camp, and the dwarf did not offer.\\n\\n Stern-faced and without saying a word, Kelsey led them off. The elf had barely gone a dozen feet when Mickey trotted up ahead of him and turned back sharply.\\n\\n \"Where\u0027re ye going, then?\" the leprechaun asked. \"Ye\u0027re needing a gnome, and Gondabuggan, the gnome burrows, are to the north, not the south.\"\\n\\n Kelsey stared unblinkingly at the sprite.\\n\\n \"Gnomes\u0027re the second best of thieves,\" Mickey went on, somewhat hesitantly, for he was beginning to catch on.\\n\\n \"Second best will not suffice,\" Kelsey replied evenly.\\n\\n Mickey\u0027s sparkling gray eyes narrowed to dart-throwing slits. \"Ye\u0027re beyond the bounds,\" he muttered.\\n\\n \"Then run,\" Kelsey offered, his tone unyielding and his stare promising that he could make Mickey\u0027s life much more unpleasant.\\n\\n Mickey wasn\u0027t overly surprised. He had suspected that Kelsey would force him along from the very beginning. Elfs were usually cheerful folk, especially towards sprites, but life-quests had a way of stealing their mirth.\\n\\n The leprechaun pulled a long drag on his pipe and let Kelsey pass him by. He fell into line beside Gary without saying a word and a short time later had resumed his perch on the young man\u0027s shoulder, book in hand.\\n\\n Gary didn\u0027t mind the leprechaun\u0027s familiarity. After his mistakes of the previous night and the anger both Kelsey and Geno had shown him, he was glad for the company.\\n\\n They trudged on through that day with few words being exchanged. Kelsey kept the point position, far out in front, his hand often resting on his sword hilt, with the others following in no particular order. Geno grumbled every now and again, and spat often, usually in Gary\u0027s general direction. It all seemed unremarkable and quite boring to Gary, except that on several occasions, he noticed Mickey put something resembling a whistle up to his lips. No sound, at least none that Gary could hear, emanated from the little silver instrument when Mickey blew into it, though, so Gary did not question the leprechaun about it and let it fall from his thoughts.\\n\\n He tried to concentrate on his own predicament instead. He had no remaining thoughts whatsoever that this might be a dream. But what, then? The only answer that came into Gary\u0027s mind, the only possible solution, he decided, was that he had gone quite insane. Several times, he tried to look through the guises of his companions, to see them as people from his own world.\\n\\n He gave that up quickly enough, seeing no hint that anything was any different. If he had gone insane, then he obviously could not consciously push that insanity away.\\n\\n So he decided to continue to play it out and made a vow to at least try to enjoy the adventure.\\n\\n He kept thinking of his parents, though, and of the distress he was no doubt causing them.\\n\\n Gary suspected that something out of the ordinary was up as soon as he saw Mickey slip out of camp later that night, that curious silver whistle in hand. He followed the leprechaun in a roundabout way, not wanting to be noticed but not wanting the elusive Mickey to get out of his sight. Mickey did, though, as usual, and, Gary suspected, without too much difficulty. The young man found himself out alone, peering helplessly into the dark tangles of a tree copse.\\n\\n Gary was about to give up and head back to camp when he heard a curious buzzing noise followed by the leprechaun\u0027s voice. He crept slowly in the direction of the noise, and his eyes grew wider when he saw, under the light of a full moon, Mickey\u0027s companion - the same sprite who had stuck Gary with the poisoned arrow and started this whole adventure.\\n\\n \"Ye know what\u0027s to be done,\" he heard Mickey whisper. The sprite\u0027s high-pitched reply came too fast for Gary to decipher any of the words.\\n\\n \"A loss it is,\" Mickey agreed. \"But I\u0027ve no way to get out of it without angering the likes o\u0027 the Tylwyth Teg, and I\u0027ve no desire to walk into Robert\u0027s lair without having a few scoring cards tucked up me sleeve.\"\\n\\n Gary silently mouthed the name Robert, thinking that Mickey couldn\u0027t be referring to the dragon.\\n\\n Again the sprite buzzed a response that Gary couldn\u0027t understand.\\n\\n \"I\u0027ll be getting it back, don\u0027t ye doubt!\" Mickey insisted as forcefully as Gary had ever heard him. \"But me first concern\u0027s getting meself back with me skin still on.\"\\n\\n The sprite buzzed and bowed, and disappeared into the brush. Mickey stared ahead for a few moments, then sighed loudly and took out his pipe.\\n\\n Gary thought it best not to question Mickey about the strange encounter, so he said nothing later that evening when Mickey strolled back into camp, nor all the next day, hiking along the rolling hills east of the mountains.\\n\\n The weather was fine, if the company was not, and they continued to make steady progress that day, and then the next. When the southern edge of Dvergamal at last came into view, Kelsey picked up the pace.\\n\\n But then Geno stopped suddenly and sniffed the air. Mickey uncrossed his ankles and looked up from his book; even Kelsey spun about curiously on the dwarf. Geno didn\u0027t seem to notice either of them. He stood very still, head back and nose up, sniffing at the air.\\n\\n \"What is it?\" Kelsey asked, drawing his sword.\\n\\n Gary could feel the tension growing.\\n\\n \"Uh-oh,\" he heard Mickey whisper.\\n\\n Geno glanced right, then left, then spun right around, his wide and round blue-gray eyes darting every which way.\\n\\n Kelsey\u0027s golden orbs flashed with mounting anxiety. \"What is it?\" the elf demanded again.\\n\\n Geno met his stare head-on. \"Trolls,\" the dwarf announced.\\n\\n \"Uh-oh,\" Mickey said again.\\n\\n Gary turned on the leprechaun. \"That\u0027s enough,\" he growled. \"Ever since we left Dilnamarra, I\u0027ve had the feeling that you and Kelsey know more than you\u0027re telling me. What\u0027s going on? Who\u0027s after us, and why?\"\\n\\n \"Ye wouldn\u0027t understand,\" Mickey replied. \"\u0027Tis of no concern...\"\\n\\n \"You tell me now or I\u0027m done with this adventure and you can send me right back to my own world,\" Gary snapped. He threw his spear to the ground, looped the case with Donigarten\u0027s spear over his shoulder and let that fall, too, and crossed his armored arms defiantly over his chest.\\n\\n \"Tell him as we run,\" Kelsey bade Mickey. Geno was still standing, sniffing the air, his expression growing more and more alarmed.\\n\\n Seeing even the steady dwarf so obviously unnerved, Gary lost the momentum for his argument. He scooped up his belongings and off they went, Geno leading them away from the mountains.\\n\\n \"\u0027Tis Ceridwen, we\u0027re thinking,\" Mickey started to explain to Gary, the leprechaun taking his usual seat.\\n\\n \"You have angered the sorceress?\" Geno cried, overhearing. He skidded to a stop and spun around, eyes flashing and his jaw clenched tight. \"And it was she who roused the Cailleac,\" he said angrily.\\n\\n Mickey nodded gravely.\\n\\n Geno turned on Kelsey. \"You said nothing about battling the likes of Ceridwen!\" he roared. \"You did not mention the witch at all!\"\\n\\n Gary listened to the conversation distantly, his thoughts tied around the name of the witch. So many names in this enchanted land seemed somehow familiar to him, and he was certain that he had heard of Ceridwen before, back in his own world.\\n\\n \"I did not know that the witch was involved,\" Kelsey answered honestly. \"Only when I spied the Cailleac drifting across the peaks of Dvergamal did I come to truly believe that the dangers we have encountered have not been random chances.\"\\n\\n \"For only she could rouse the Cailleac,\" Geno reasoned grimly.\\n\\n \"And the trolls?\" Mickey put in, prodding them all to the realization that this might not be the best opportunity to sit and discuss the matter.\\n\\n The reminder sobered Geno. He spun all about, sniffing anxiously at every direction. \"Trolls,\" he replied. \"And not too far.\"\\n\\n As if on cue, the others suddenly caught the disgusting scent.\\n\\n \"Run!\" Kelsey cried, and he and Geno led them on wildly, Kelsey stopping every few feet to encourage Gary to keep up. Now more comfortable with the armor, Gary was up to the great pace, but still the stench of trolls deepened around them, from every side.\\n\\n Geno led them up a small, bare hillock. \"They are all about!\" the dwarf declared, taking up his two favorite throwing hammers and arranging the others for easy grabbing off his wide belt. \"Set for defense!\"\\n\\n Kelsey pulled his longbow off his shoulder and quickly strung it, while Mickey hopped down from his perch and surveyed the area, wondering what tricks he might play. Gary tried hard to appear busy, though he had little idea of what to do. He clasped his spear tightly in both hands, feeling the balance, and foolishly ran a finger along (instead of across) its metal tip, drawing a line of blood. With Kelsey, Geno, and even Mickey so worried about the trolls, Gary could only pray that the enchanted weapon on his back would aid him when the fighting started.\\n\\n And then Gary watched and waited, wondering what a troll looked like.\\n\\n It wasn\u0027t long before he found out. A huge, humanoid shape appeared over the rolling hills behind, lumbering towards them on legs as thick as the trunk of a mature oak. Another troll appeared behind it, and a third behind that.\\n\\n \"Three of them to the north,\" Gary remarked, squinting through the eye slit on his helmet.\\n\\n \"Three that way,\" Mickey corrected. Following the leprechaun\u0027s motion, Gary turned left and saw another troll, this one close enough for him to get a better view. The creature stood fully ten feet tall, maybe more, and wore filthy hides over its green, wart-covered skin. While its legs and torso were unbelievably thick, its arms were long and lean, made for snatching fleeing prey with long curling fingernails. Scraggly hair, yellow eyes, and even yellower teeth completed the gruesome picture. When he was finally able to pull himself from the approaching spectacle, Gary completed his visual circuit. Two more trolls had gotten ahead of the companions and now came in from the front, the south, and a seventh creature, accompanied by a smaller form, approached the hillock from the east.\\n\\n \"Have ye noticed the sunlight?\" Mickey asked sarcastically. \"When ye get back to yer own world, ye go and tell yer Mr. Tolkien that ye seen trolls moving about in the sunlight!\"\\n\\n \"No regular hunting band,\" Geno remarked, regarding the engulfing formation. \"This group is skilled in catching quarry.\"\\n\\n \"As part o\u0027 that quarry, I\u0027m not pleased to be hearing ye,\" Mickey put in.\\n\\n \"They have not caught us yet,\" Kelsey declared, shooting the sarcastic leprechaun a dangerous glare. He took a bead on the closest troll, the one to the west, and his great bow twanged in rapid succession, sending a line of arrows at the monster.\\n\\n If Gary had been impressed with the elf\u0027s swordsmanship against the goblin raiders, he was even more amazed now. Kelsey had his fifth arrow in the air before the first hit the approaching troll.\\n\\n The elf\u0027s aim was near perfect, though the thin darts seemed to have little effect. One snapped in half against the troll\u0027s shoulder; another nicked the creature\u0027s neck, drawing a bit of blood. But the troll slapped it and the others away as though they were but a minor inconvenience, showing them no more heed than Gary might show a few stinging gnats.\\n\\n But then Kelsey went from near perfect to perfect, driving an arrow into the troll\u0027s eye. The creature howled in agony, swerved to the side, and went down in a heap, screaming and thrashing, its clawing hands and kicking feet digging wide holes on the grassy plain.\\n\\n Geno went to work on the two trolls charging in from the north. Hammers spun in, bonking against the attackers with tremendous force.\\n\\n \"Ow!\" cried the first, catching a hammer squarely on the tip of its stubby thumb.\\n\\n \"Me nose!\" snuffled the other. \"\u0027E breaked me nose!\" Even twenty yards away, Gary could hear the cartilage cracking as the monster grabbed its prominent proboscis in both hands and twisted it back trying to stem the flow of gushing blood.\\n\\n Both of those trolls ducked and dodged, suddenly more concerned with keeping away from the continuing stream of hammers than with attacking the hillock.\\n\\n Gary looked at his spear and at the trolls closing from behind and from the east. The three behind were not an immediate threat, having taken up azigzag route around a wide crack that had suddenly appeared in the ground between them and the hillock. Gary had just crossed that same ground, running in an unhindered straight line. He didn\u0027t have to spy out the concentrating leprechaun to know that Mickey\u0027s illusions had caused the crack.\\n\\n The troll from the east, having left its smaller companion (which Gary now recognized as a goblin) far behind, was not deterred, though, and with Kelsey and Geno deep in their own fights and Mickey busy with his illusion, only Gary stood to block the monster\u0027s way.\\n\\n He looked again at his spear.\\n\\n \"Do not even think of throwing it,\"came the voice in his head.\\n\\n \"I wasn\u0027t!\" Gary retorted aloud.\\n\\n \"A thousand pardons,\"answered the silent voice.\"Take heart, now, young warrior. I will guide thee.\"\\n\\n Gary was glad for the help, but hardly taking heart. The troll hadn\u0027t even started up the side of the hillock, but its evil yellow eyes were even with Gary\u0027s. Up, up, came the monster, holding a huge club at its side.\\n\\n \"Strike before it finds even footing!\"the spear of Cedric Donigarten implored, and Gary did, thrusting straight out, driving the point of his dwarf-forged spear against the troll\u0027s massive chest. The weapon dug in just an inch, then its long tip bent over to the side.\\n\\n \"Blimey!\" screamed the troll, stopping its ascent and looking down in surprise.\\n\\n Gary didn\u0027t hesitate. On his own instincts, he curled his legs under him and leaped out, slamming his heavy shield into the troll\u0027s face and chest.\\n\\n The foolish young man bounced back, stunned, without his breath, and with every metal plate of his armor singing a vibrating tune.\\n\\n \"Never shield-rush a mountain troll!\"scolded Cedric\u0027s spear. Down to his knees, Gary hardly comprehended the call. He noticed his spear lying beside him, and then noticed impossibly huge feet and impossibly thick ankles on either side of him. He understood, somewhere in the back of his spinning mind, that the troll straddling him held its club up, ready to squash him.\\n\\n \"Up! Up!\"cried the sentient spear on his back.\\n\\n The call could have meant several things, Gary noted, but he again went with his instincts, grabbing his dwarven spear in both hands and thrusting it straight up above his head. He heard a sickly squishy sound and watched the monster hop up to its tippy-toes. The troll groaned weakly, then toppled, pulling the spear from Gary\u0027s grasp as it went.\\n\\n A relieved Gary knew that he had done well, but when he looked around for applause, he realized that he could hardly afford to stop and congratulate himself.\\n\\n Geno had run out of throwing hammers and now met the two trolls head-on. A larger hammer in each hand, the dwarf scooted every which way, between the trolls\u0027 legs, around to the side, slapping and smacking wherever he found an opening.\\n\\n Kelsey hadn\u0027t joined the dwarf, though, for two of the trolls from behind had found their way through Mickey\u0027s maze and pressed in on the elf.\\n\\n \"Two trolls?\" Gary muttered. \"Only two?\" He got a terrible feeling and spun about, bringing his shield up more as a matter of reflex than conscious thought.\\n\\n There, right behind him, he found the missing troll, and saw, too, its arcing club. The heavy weapon slammed the top of Gary\u0027s shield, snapping the straps and nearly breaking Gary\u0027s arm, then clipped the young man on the side of the head. Gary\u0027s helmet spun about several times, finally coming to a stop facing backwards.\\n\\n Donigarten\u0027s spear implored him to action, crying for him to dive and roll, or fall back and tumble down the hillock.\\n\\n None of it mattered, for Gary wasn\u0027t seeing anything or hearing anything at that moment. The ground rushed up to catch him, but he didn\u0027t know it.\\n\\n Kelsley\u0027s sword spun and swirled, cut teasingly wide arcs, then darted straight ahead at troll hands or troll faces, or whatever target the elf could find. The two trolls trying to get at Kelsey had a dozen wounds each, but these were minor nicks, for the elf\u0027s sword was a slender weapon, more designed for battling smaller, less mountain-like foes.\\n\\n Still, Kelsey, fighting in a purely defensive manner, managed to keep them at bay for many minutes, though he knew that something dramatic had to happen if he and his companions were to prevail. Two trolls were down - the one Kelsey had blinded with an arrow and the one Gary had pierced through the groin - but five others remained. One was busy now, wrapping Gary in a crude net; Geno had the remaining two fully engaged.\\n\\n The time had come for Kelsey to strike hard.\\n\\n \"Circle \u0027im!\" one of his opponents cried, slipping around to Kelsey\u0027s side. The other, after a moment\u0027s consideration, moved the other way, getting opposite the elf from his companion. Kelsey worked hard to keep them on his sides, where he could watch their every movement. They stepped towards him and back out, lifted their clubs and waved them about menacingly, looking for an opening.\\n\\n Kelsey dipped under a clumsy club swing, but instead of backing away to keep his defensive posture, he leaned forward under the blow and charged straight in. The surprised troll had no way to get its club back in line for any semblance of defense. It waved its free arm frantically, trying to keep Kelsey at bay.\\n\\n The elf drove in fiercely. His crafted sword bent nearly double as he thrust it into the rock-like troll\u0027s chest, but it was a magical blade and it did not break. He heard the troll wheeze as the blade slipped through its ribs, then it fell back, grabbing at its chest.\\n\\n The doomed creature\u0027s companion bellowed and hurled his club, but Kelsey, hearing the roar, was not caught unawares. He tucked his head and rolled to the side, barely dodging the heavy missile. The troll came on, diving after Kelsey and grabbing him by the leg in one huge hand. Quickly the troll scrambled back to its knees and tugged with all its strength, meaning to spin Kelsey around and around.\\n\\n The elf did come off the ground under the troll\u0027s incredibly powerful pull, but Kelsey, veteran of a hundred battles, kept his composure and bent over double against the momentum, hacking at the troll\u0027s hand with all his might. Troll fingers fell to the ground and Kelsey, free of the grasp, went spinning through the air. Agile as any cat, he landed easily and started right back in for the fight.\\n\\n But then a boot fell over his back and he was flattened to the grass. Kelsey felt as if a mountain had fallen on him; he couldn\u0027t even squirm about under the tremendous weight.\\n\\n \"Squish \u0027im, Earl!\" yelled the troll that had thrown him. \"He cut off me fingers!\"\\n\\n Geno Hammerthrower was no novice to troll fighting. The trolls were the very worst enemy of the dwarfs of Dvergamal, and every time one of their hunting parties went anywhere near the thunderous spray of the Firth of Buldre, Geno had personally led the charge.\\n\\n The odds had always been better than this, however. For the first time, Geno found himself outnumbered by trolls two to one, and outweighed by at least twenty to one. Undaunted, the dwarf growled and spat, and used every trick he had ever been taught about fighting giant-kin.\\n\\n \"I\u0027ll puts ye in a sandwi - \" one of the beasts started to say, but it stopped abruptly when Geno\u0027s hurled hammer put out two of its teeth. The troll spit the hammer out, and Geno was quick to reclaim it, preferring to fight with both hands.\\n\\n The other troll, seeing Geno going for the hammer, went for Geno, both its hands outstretched.\\n\\n \"Stupid!\" Geno laughed, spinning about, and he laughed even louder as he realized that the troll\u0027s reaching fingers were straight out and rigid.\\n\\n \"This will hurt!\" Geno promised, and he smashed both his hammers, one after the other, straight into the tips of the monster\u0027s fingers. Suddenly the troll had little desire to grab at the dwarf - or grab anything at all.\\n\\n Geno wasn\u0027t quite finished, though. He scooted through the troll\u0027s widespread legs, but reversed his direction and came right back out the front. His ploy worked perfectly and the stupid monster was still looking over its shoulder as Geno cracked a hammer into its kneecap.\\n\\n Kelsey stared blankly as his own arms became writhing tentacles, horribly tipped by barbed claws. The troll standing over him jerked back in surprise, its foot coming up enough to allow the elf to draw breath.\\n\\n Then Kelsey noticed Mickey standing beside the massive body of the troll that Gary had downed. The elf mouthed a silent thank-you, then started to cry out an alarm as he noticed a goblin creeping up behind the leprechaun, sack in hand.\\n\\n But Kelsey had his own problems. The sack went over Mickey and the tentacle illusion was no more. The troll growled and pressed down again, even more forcefully.\\n\\n \"Squish \u0027im, Earl!\" screamed its wounded companion, and Kelsey surely thought that his life was at an end. But then Earl reached down and grabbed him in both hands, plucked his sword away, and tossed him into the same net that held Gary.\\n\\n \"I gots him, I gots him!\" Geek squealed in glee, holding up the leprechaun-filled sack by its drawstring. But then the bag went limp, giving the illusion that the leprechaun had somehow vanished. Stunned, the goblin grabbed at the sack, stupidly pulling it open.\\n\\n A long-stemmed pipe whipped out and cracked into Geek\u0027s eyes, and the sack fell free.\\n\\n Mickey thought himself quite clever - until a huge hand plucked him out of midair.\\n\\n \"No, ye don\u0027ts, ye trickster!\" growled the nearby troll, holding its sliced groin in one hand and wrapping the other about the leprechaun. The troll gave an uncomfortable squeeze.\\n\\n \"Any more o\u0027 yer tricks, and I\u0027ll squash ye good!\" it warned, and Mickey didn\u0027t have to be told twice.\\n\\n The troll clutched its busted knee and hopped up and down on its good leg. Every time it came down, though, Geno slammed a hammer onto its toes.\\n\\n The gap-toothed troll crept up behind the dwarf, club in hand.\\n\\n \"Quiet as a thunderstorm!\" Geno chided, rolling out of harm\u0027s way just as the sneaking troll launched its swing. The swinging club took the troll\u0027s hopping companion on the side of the good leg and sent the poor monster tumbling down the hillock like an avalanche.\\n\\n The gap-toothed troll flew into a rage, swatting and clubbing frantically, putting huge dents in the soft ground, but never, for all its fury, getting anywhere near to hitting Geno. The dwarf scrambled and dove, appearing desperate, but using each maneuver to better his position for counterstrikes. He came up alongside the club one time and smacked the troll\u0027s hand; another time, he used the down-cutting club to great advantage, tossing a hammer right over it as it descended. The stupid troll never even saw the missile until it rebounded away from its face, taking another tooth with it. Geno was upon the weapon in a split second, coming back up, both hands ready to continue.\\n\\n Then the troll got more cautious. It bent low to the dwarf, keeping its club raised defensively between its face and Geno.\\n\\n Geno shrugged and hurled a hammer into the club, which in turn smacked the troll in the face. The monster roared and lifted its weapon high, just as the dwarf had anticipated. Geno leaped right into its face, grabbing a handful of scraggly hair and flailing away furiously with his remaining weapon. Geno understood and even anticipated the stupid creature\u0027s every move, and he leaped away just as the heavy club came swatting in.\\n\\n The troll\u0027s head snapped over backwards; the club fell to the ground. The monster stood very still for a long moment, regarding Geno through crossed eyes, then fell like a cut tree.\\n\\n But now Earl came stomping over, followed by his seven-fingered companion, and by a gingerly walking troll holding a small sack.\\n\\n \"Sorry to leave you,\" Geno called to his captured companions. \"But fair is fair!\" The dwarf figured his indenture to be at an end; he had never agreed to die beside the elf. When Geno turned to go, though, he found that retreat would not be so easy a feat. Another troll, with a broken arrow protruding from one eye and a murderous look in its other eye, had come around behind the dwarf, and the first troll Geno had felled was also back up, limping and still holding its knee, but blocking that route.\\n\\n The chase and fight went on for several minutes. Geno whipped a hammer here, smacked a hammer there, and put each of the trolls down more than once. But there were too many enemies, and finally Earl put a bag over the stubborn dwarf\u0027s head. \\n\\n","sourceLink":"https://allnovel.net/the-woods-out-back-spearwielder-s-tale-1/page-12.html","bookId":2184,"book":{"id":2184,"title":"The Woods Out Back (Spearwielder\u0027s Tale #1)","description":"Storyline: The Woods Out Back (Spearwielder\u0027s Tale #1) \\n The first in the Spearwielder fantasy adventure series--from the author of the New York Times bestseller The Legacy. In a magical spot in a forest, Gary falls asleep . . . and wakes up in a dangerous realm of elves and dwarves, witches and dragons. There he discovers he is the only one who can wear the armor of the land\u0027s lost hero--and wield a magical spear.\\n","cover":"https://allnovel.net/images/the-woods-out-back-spearwielder-s-tale-1.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-woods-out-back-spearwielder-s-tale-1.html","creation":"Oct 5, 2019 8:58:26 AM","modification":"Oct 5, 2019 6:49:16 PM"}}
