{"id":100064,"no":18,"title":"Page 18","content":"They found Mickey some time later, after a dozen wrong turns and close brushes with goblin guards. The leprechaun was sitting against the wall as he - or at least, as his illusion - had been doing when they left him. Tommy was still hard at work on the wall beside the illusionary dwarf.\n \"Time to go,\" Kelsey said to the leprechaun. \"Has our goblin friend returned?\"\n \"Twice,\" Mickey replied, drawing deeply on his pipe. \"He\u0027s thinking everything\u0027s as it should be.\"\n From somewhere down the halls, there came the roar of a lion.\n \"Time to go,\" Kelsey said again, pulling the frightened goblin prisoner into the room beside him. \"We have a guide.\"\n Gary nodded from Mickey to the giant, who was still oblivious to the fact that the missing group had even entered the room. \"He won\u0027t go unless he thinks he\u0027s finished,\" Gary explained.\n \"Then let him stay,\" whispered Geno. \"Who wants a giant around?\"\n \"We need him,\" Gary said firmly, and he feared that he would have to go into a long and detailed explanation of his tentative escape plans, an explanation that he was sure would make little sense to his companions.\n Mickey trusted him, though. The leprechaun winked Gary\u0027s way and the illusionary dwarf went into a whirlwind of activity that had the hole patched in mere seconds. Tommy blinked at the sight, not quite knowing what to make of it.\n \"Ye must leave now!\" the goblin prisoner heard himself command, though he hadn\u0027t moved his lips. He looked questioningly around the room, but Kelsey\u0027s sword came up beside him in a flash.\n \"If you make any more noise than drawing your breath, I will cut off your head,\" the elf promised.\n \"Duh, is the wall fixed?\" Tommy asked helplessly. He felt around as though he didn\u0027t believe his eyes. \"The wall is not fixed.\"\n \"Now!\" cried the goblin with a leprechaun\u0027s voice. \"The Lady wants ye out o\u0027 the house!\"\n The illusionary dwarf walked over and seemed to blend right in with Geno. \"The wall is fixed,\" Geno answered Tommy, taking the cue, though he gave Gary an angry sidelong glance as he addressed the giant.\n \"Come on, Tommy,\" Gary added. \"I\u0027ll show you something else that will please the Lady.\" That got the giant\u0027s attention, and he shrugged at the somehow-fixed wall, scratched his huge head one final time, and fell into line behind Gary.\n \"One wrong turn costs you your head,\" Kelsey promised, whispering into the goblin\u0027s ear so that the giant would not hear. But the terrified goblin needed no prodding. It had seen quite too much of the powerful companions already to offer any resistance. It led them on at a great pace, pausing every now and then at an intersection to check its bearings.\n They came unexpectedly upon one group of guards, bursting in through open doors before they even noticed that the room was not empty.\n \"I have to get these wretches outa the castle,\" Mickey\u0027s voice explained from the goblin\u0027s mouth, before Kelsey could set his sword into action. Mickey wanted no fights here, not with Ceridwen\u0027s pet in pursuit and a tentative and unpredictable giant by his side.\n A roar erupted from somewhere behind them and the eyes of the goblin guards went wide.\n \"The Lady\u0027s cat\u0027s not too pleased that they\u0027re still around,\" Mickey went on.\n \"Then gets them out of here!\" screamed one of the goblins, and it, and the others, darted out a side passage, scrambling away with all speed from the pursuing cat.\n \"That is Alice,\" Tommy said. The others looked at him curiously. \"The Lady\u0027s cat,\" the giant explained. \"Alice. The Lady lets me play with her sometimes.\"\n \"Go and play with Alice now,\" Geno offered.\n \"Shut up!\" Gary snapped at the dwarf, and he thought himself incredibly stupid for talking that way to the volatile Geno. But Kelsey backed him this time.\n \"We have no time for bickering,\" the elf said, and he prodded the goblin along once more. \"Let us discuss our differences when we are safely outside.\"\n They ran down one long hallway, the outer doors in sight, but then Geek the goblin turned into the hall behind them. \"Where is yous going?\" the spindly-limbed goblin demanded. \"You comes back here!\"\n Tommy spun about, confused, but Mickey was quicker, putting up an illusion of an empty hallway behind them.\n \"Come on, Tommy,\" Gary prodded, grabbing the giant\u0027s thumb in his hand and pulling with all his might.\n \"Duh,\" was all that Tommy replied, giving in to Gary\u0027s tug.\n The distant goblin began shouting again, until a roar silenced his further tirade. \"No, Alice,\" they heard Geek cry as they continued through the doors. \"Nice kitty. Alice!\"\n And then they were outside. Geno closed the doors behind them and popped a spike into the ground at their base for good measure.\n \"If they have any way of contacting Ceridwen...,\" Kelsey warned, but he did not finish the thought, seeing Tommy overly interested in his words. He pulled Gary and Mickey aside, and the goblin prisoner, seeing a chance, wasted no time. As soon as Kelsey let go of it, with Geno busy at the doors, the creature ran off.\n \"How do we get off the island?\" Kelsey asked bluntly, paying no heed to the fleeing goblin.\n Gary still hadn\u0027t actually figured out exactly how they should proceed at that point; retrieving the magical spear and getting out of the castle had come in such a wild rush. Whatever details were yet to be worked out, though, Gary knew what role his companions had to play. \"Get back to the camp and retrieve all of our belongings,\" he instructed. \"And bring one boat along. Go north along the beach until you find a rocky jetty. I\u0027ll meet you there.\"\n \"And what of the giant?\"\n \"He comes with me,\" Gary replied. He looked to Mickey, trying to think things through, trying to figure out what coaxing Tommy might need. \"You had better come with me, too,\" he said.\n Gary had little trouble convincing Tommy to go with him to the lagoon. Thrilled at preparing another surprise for the Lady, the giant even picked Gary and Mickey up and carried them along. Once again, Gary was amazed at the giant\u0027s strength, and glad, for he knew that Tommy would need all of it to carry out the plan.\n When they got back to the lagoon, Gary instructed Tommy to retrieve weeds, both brown and green. The giant shrugged and did as he was asked, though he had no idea what the man had in mind. Mickey\u0027s amused smiled showed that the leprechaun was beginning to catch on, though.\n Gary found the widest hollow tubes of the bunch and glued them together with the sticky goo from the green reeds.\n \"Okay, Tommy,\" he said confidently, \"put this in your mouth.\"\n \"I do not like to eat the water plants,\" Tommy explained.\n \"No, don\u0027t eat them,\" Gary explained. \"Breathe through them.\" Off to the side, Mickey whistled and couldn\u0027t contain a chuckle.\n Tommy scratched his huge head. \"Duh?\"\n \"Don\u0027t you understand?\" Gary asked, as though things should have been obvious. He had to continue to appear confident, he knew, if he was to have any chance of convincing the giant. \"With these, you can walk all the way across the lake.\"\n \"That will not please the Lady,\" Tommy reasoned.\n \"Oh, but it will!\" Gary replied immediately. \"If you can go back and forth without having to jump and scramble, you\u0027ll be able to carry things for Ceri... the Lady.\"\n Tommy scratched his head.\n \"When the Lady has things to bring across to the island, she will no longer have to go back and forth with puny boats,\" Gary went on, revealing his sincere excitement. \"She will have you to simply carry the things across for her.\"\n \"Dun, I do not...,\" the giant began slowly.\n \"Just try it,\" Gary pleaded. \"Go across once, and then come back.\"\n Tommy looked at the reed tube sourly and shook his head. Gary knew that his time was running out. And with all the damage they had done back in the castle, and with the spear back in their possession, he had no desire to be on the island when Ceridwen returned.\n \"You already went across once,\" Gary said grimly, his tone an obvious warning. \"If the Lady finds out, she\u0027ll be mad.\"\n \"You will not tell her?\" Tommy begged.\n Gary shrugged his shoulders noncommittally. \"If this works, though, you can explain to the Lady that you went across only because you wanted to find some way you could help her. Won\u0027t that make her happy?\"\n Tommy thought for a moment, then took the reed tube.\n \"Just put the tube in your mouth and your face in the water,\" Gary explained. \"Keep calm and breathe easy.\"\n Tommy walked into the lagoon and did as Gary asked, but brought the whole tube underwater with him and came up a few seconds later, coughing wildly.\n \"It does not work,\" he complained as soon as the fit had ended.\n \"We\u0027re in trouble, lad,\" Mickey remarked.\n Gary motioned for Tommy to come back to him, then showed the giant how to keep one end of the tube above the lake, so that the air could go into him. The giant shrugged and went back into the water, ducking his head. Again, he came up in mere seconds, panicked and spitting water.\n \"We\u0027re in trouble,\" Mickey said again.\n Gary realized that Tommy\u0027s mouth was simply too big for the tube. He called Tommy back to the shore, then refitted the reeds, this time smearing goo all around them to secure them in the giant\u0027s mouth. Using both hands, he pinched Tommy\u0027s nostrils to show the giant that he could indeed breathe through the tube.\n Tommy shrugged, went back and tried again, and again, and each time he stayed underwater a little longer and came up looking less afraid.\n \"Long way to the shore,\" Mickey remarked. \"Ye\u0027re thinking that the giant can keep calm enough to say underwater all the way, carrying us besides?\"\n \"Would you rather stay here and take your chances with Ceridwen?\" Gary replied dryly.\n \"Good point, lad,\" agreed the leprechaun. He looked down the beach past the jetty and say Kelsey and Geno approaching, Kelsey laden with their belongings and Geno carrying the heavy boat up over his head.\n \"How does he do that?\" Gary remarked, amazed at the diminutive dwarf\u0027s incredible power.\n \"Comes from eating rocks,\" Mickey replied, and Gary couldn\u0027t tell from the leprechaun\u0027s tone if he was kidding or not.\n Tommy came back to Gary and Mickey at about the same time as their other companions joined them. Tommy eyed the boat suspiciously, wondering what Gary had in mind, what this whole business was about.\n \"For the test,\" Gary explained, reading the giant\u0027s thoughts (not a difficult task). \"You carry the boat high above your head; take care that it does not touch the water!\"\n \"Dun, why are they here?\" Tommy asked, pointing particularly at Geno. \"The Lady does not want you to leave the island. You should not have a boat.\"\n Tommy stood motionless, perplexed, trying to remember all that he had learned of his companions\u0027 dilemma. The giant was slow to catch on, but not nearly as stupid as some people assumed.\n \"You want Tommy to carry you past the water,\" he reasoned, his big eyes growing bigger.\n \"Carry us? Don\u0027t be silly!\" Gary lied, flashing a disarming smile. \"Kelsey and Geno will help me to pile rocks in the boat as you walk underwater past the end of the jetty. We have to see how strong you are, how much you can carry, before you go and tell the Lady your surprise.\"\n \"I am strong!\" the giant asserted, an obvious fact that none of the companions were about to argue against.\n Gary bobbed his head. \"But we should know exactly how much you can carry before you tell the Lady about your surprise. The water\u0027s deep enough by the jetty\u0027s end to get the boat down near our level.\" Gary could only hope that the slow-to-catch-on giant wouldn\u0027t simply reason that it would be easier to fill the boat before he even started out. Tommy stood scratching his head, and looking at the lake and mountains beyond, then at the boat, and then, suspiciously, at Geno and Kelsey. Finally, to Gary\u0027s relief, Tommy popped his reed pipe in his mouth and hoisted the boat overhead.\n Gary clapped his hands together and beamed at his friends, but Geno and Kelsey didn\u0027t seem to share his enthusiasm.\n \"You want us to climb in the boat as the giant walks past us?\" the dwarf balked as soon as the giant moved far enough away. \"I have lived too long - and hope to live too long again - for such a stupid trick!\"\n \"You forget that the lake is acid to us,\" Kelsey added sourly.\n Gary motioned to Mickey to give the answer, thinking that the leprechaun\u0027s backing might not be such a bad thing at that time.\n \"Would ye rather stay here and take yer chances with Ceridwen?\" Mickey asked.\n They were all in place on the end of the jagged jetty as Tommy came walking past, still holding the boat high. This was the trickiest part of the whole plan, for Gary couldn\u0027t be sure that the water was deep enough to get over the giant\u0027s head and keep him blinded to their real intentions.\n It was, but just barely, and the giant\u0027s long arms had the boat high up above them, with Gary having no way to instruct Tommy to lower it. They tossed their bundles into the boat, then Gary jumped up and caught the side. He was going to tell his companions to climb up over him, but they hardly needed an invitation. Kelsey verily ran up his back. Mickey, boosted by Geno, barely touched Gary\u0027s shoulders as he flew past, and the dwarf came last - Gary was amazed at how much weight was packed into that little body!\n They pulled Gary in, and then they all sat tight, fearful that the water, which Ceridwen had promised would burn them as acid, was only about six or seven feet below them. Looking over the edge of the boat, when any of them mustered the nerve to look over the edge, they could see the top of Tommy\u0027s head, bobbing along steadily.\n As the giant continued deeper into the lake, his head disappeared altogether, and they grew even more afraid, for the dangerous water came closer and closer.\n \"If he bends his arms, we\u0027re done for,\" Mickey commented, and none of them appreciated the remark.\n \"Stupid plan,\" Geno muttered. \"And I am a stupid dwarf for going along with it!\"\n Fifteen minutes later, Tommy was still walking. They were much closer to the mountainous shoreline than the island, and resting a bit easier. Tommy\u0027s iron-hard arms did not quiver, and the boat was steadily, if gradually, coming up again, for the giant had passed the lake\u0027s deepest point.\n \"Clever lad, to find a way through Ceridwen\u0027s spell,\" Mickey commented, aiming the remark more at Kelsey and Geno than at Gary. \"I feared that the giant\u0027d panic long before he reached the shore, but he\u0027s soon to be breathing without help o\u0027 yer... what did ye call it again?\"\n \"Snorkel,\" Gary replied, peeking over the side. \"When Tommy\u0027s head clears the water, stay still in the middle of the boat,\" Gary warned. \"I don\u0027t know how he\u0027ll react when he finds out we\u0027ve tricked him.\"\n The lake grew more shallow with each giant step, and soon, not only Tommy\u0027s head but the top half of his body were clear of the water. He paused and looked back towards the island, as amazed as anyone that he had come this far.\n The boat shifted suddenly as Tommy let go with one hand. It did not tip too far, though, so strong was the giant\u0027s remaining grip. The companions didn\u0027t know what the giant was up to, but then they heard Tommy pull the snorkel from his mouth.\n \"Duh, the Lady will be happy with me,\" the companions heard him say, to their absolute relief. But then, to their surprise and dismay, Tommy grabbed the boat in both hands again, turned around, and headed back towards the island.\n \"Stop him!\" Kelsey mouthed silently at Gary, the elf\u0027s face contorted with frustration.\n Gary looked around desperately. There was no escape; the land was simply too far away for them to even attempt a jump. Gary took a deep breath and leaned far over the edge of the boat. \"No, Tommy,\" he called. \"Get to the the shore first, then we can go back.\"\n Tommy spit out his snorkel in surprise. \"Duh, what are you doing in my boat?\" asked the confused giant.\n \"I... we,\" Gary stammered.\n Mickey started a spell, but before he could get it off, Tommy lowered the boat down by his chest and looked less than thrilled to see the four companions inside. \"Hey!\" he cried.\n \"You held the boat up too high when you passed us on the jetty,\" Gary blurted suddenly. \"We couldn\u0027t get the rocks inside, so we climbed in instead. The weight is about...\"\n \"You tricked Tommy!\" the giant roared. \"The Lady wants you to stay on the island!\" He started to turn back, but Geno, horrified at the thought of going back to face the witch, whipped a hammer into his chest. The weapon bounced off without doing any serious damage, and, as a pointed reminder to the companions, it dropped into the water and dissolved before their eyes.\n Kelsey rushed up beside the giant, his sword bared and point aimed in towards Tommy\u0027s heart. \"To the shore!\" the elf demanded.\n He almost got his wish. With a great growl, Tommy heaved the boat towards the shore, but it didn\u0027t quite make it, landing with a tremendous splash a few feet from the beach. Ceridwen\u0027s spell began its wicked work immediately - the boat started to sizzle and sputter, white smoke rising up from its timbers.\n Kelsey and Geno went into action, grabbing bundles and hurling them to shore. Geno picked up Mickey and flung him to the beach, then grabbed Gary and, before the stunned man could protest, put him up above his head, spun him about twice to gain momentum, and launched him as well.\n Gary landed heavily on the rocky shore. He rolled to a sitting position, spat sand from his mouth, and regarded Mickey, sitting next to him. \"From eating rocks, huh?\" Gary remarked.\n Kelsey leaped across the ten-foot gap with no trouble, but the dwarf did not follow. Geno considered the jump and considered the consequences of not getting out of the fast-breaking boat, but the dwarf knew that his bandy legs couldn\u0027t possibly propel his body all the way to the shore.\n \"Who is the next best smithy in the world?\" Kelsey, ever the pragmatist, inquired of Geno.\n Geno couldn\u0027t jump the ten feet, but his spit made it across easily enough.\n \"Help him, Tommy!\" Gary cried. \"The water will kill him!\"\n The giant regarded the boat curiously, scratching his head. Geno couldn\u0027t wait for him to make up his mind.\n \"Come and play, blockhead!\" the dwarf roared, and he twirled another hammer Tommy\u0027s way.\n Of all the insults one might throw at a giant, none could stir such a creature more than \"blockhead.\" Tommy growled and charged and Geno got up on the very lip of the boat closest to shore. When Tommy crashed over the back of the splintering boat, the other end, Geno\u0027s end, went high into the air. The dwarf timed his leap perfectly, using the momentum of the tilting boat to send him high and far. As Gary had done with the stone wave back in Dvergamal, Geno easily cleared his friends. He soared past and came down headfirst into a huge chunk of stone, laughing wildly all the way, even after he had bounced off.\n Their troubles were far from over, though, for Tommy bounded up onto the shore, his big fists clenched in rage. \"You told Tommy that it would please the Lady!\" the giant sputtered.\n \"I\u0027m sorry, Tommy,\" Gary replied sincerely, making no move to either run or defend himself. \"But we had to get off that island. Ceridwen would have killed us all.\"\n \"She will be mad at me.\"\n \"Then go back in the lake and drown,\" Geno offered. Tommy\u0027s next words came out as undecipherable, guttural snarls and he advanced upon the dwarf. For the first time since he had met Geno, Gary sensed that the dwarf was afraid.\n \"Why, Tommy?\" Gary asked simply, leaping up to catch hold of the giant\u0027s fist.\n Tommy looked down at him. \"Why?\"\n \"You\u0027re free now,\" Gary explained. \"You don\u0027t have to go back to the island, or if you do go back, you don\u0027t have to tell Ceridwen how we got off the island.\"\n \"She will be mad at me,\" the giant said again.\n \"No, she won\u0027t,\" Gary insisted. \"Not unless she finds out what happened.\" He and the giant stared at each other for a long while, Gary finally slipping from Tommy\u0027s fist back to the ground. Tommy had no further designs on Geno. He went over to the water\u0027s edge and sat down, putting his chin in his huge hands.\n Kelsey intercepted Gary before he could get near his forlorn friend.\n \"Leave him, lad,\" said Mickey, agreeing with the elf. \"We cannot wait here, and if we\u0027re found near the giant, then all the worse for him.\"\n Gary hated to go, but he couldn\u0027t disagree. They scooped up their bundles and set off along the mountain trail, leaving the giant to his staring and his thinking. \n","sourceLink":"https://allnovel.net/the-woods-out-back-spearwielder-s-tale-1/page-18.html","bookId":2184,"book":{"id":2184,"title":"The Woods Out Back (Spearwielder\u0027s Tale #1)","description":"Storyline: \n The Woods Out Back (Spearwielder\u0027s Tale #1) \n The first in the Spearwielder fantasy adventure series--from the author of the New York Times bestseller The Legacy. In a magical spot in a forest, Gary falls asleep . . . and wakes up in a dangerous realm of elves and dwarves, witches and dragons. There he discovers he is the only one who can wear the armor of the land\u0027s lost hero--and wield a magical spear.\n \n","cover":"https://allnovel.net/images/the-woods-out-back-spearwielder-s-tale-1.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-woods-out-back-spearwielder-s-tale-1.html","creation":"Oct 5, 2019 8:58:26 AM","modification":"Oct 5, 2019 6:49:16 PM"}}
