{"id":100066,"no":20,"title":"Page 20","content":"The companions passed through the rolling farmlands between Dvergamal and Penllyn without incident, taking shelter at night in ancient stone farmhouses, long deserted and with nothing left at all of their thatched roofs. In better times, when Ynis Gwydrin had been the seat of goodly power and not in the possession of evil Ceridwen, these farms were among the finest in all of Faerie, Mickey explained grimly to Gary.\\n\\n Gary detected that faraway look in the leprechaun\u0027s gray eyes, that distant longing for times long past. Suddenly Gary found himself wishing that he could see Faerie at its magical glory, that he could walk in the land of twilight fancies and walking fairy tales.\\n\\n This wasn\u0027t it, and if Gary doubted that fact for one moment, all he had to do was conjure an image of mud-filled Dilnamarra or of the poor souls hanging at the crossroads, turning slowly in the stench-filled breeze.\\n\\n As the companions continued east, the rolling hills and rock walls gave way to taller, more imposing mounds.\\n\\n \"The Crahgs,\" Mickey mentioned, obviously not at all pleased by the sight. The mountains appeared as great balled lumps of green grasses, interspersed with stone and plopped down randomly on the rolling fields. They rose up two or three thousand feet, with the tops of many shrouded by low-riding clouds, thick and gray and mysterious. Small but tightly packed groupings of trees sat on the sides of many of the Crahgs, usually huddled in sheltered dells from the unending winds, and every mountainside sported streams of crystalline water, dancing down in trenches of bare stone, leaping over rocky breaks in the otherwise smooth decline.\\n\\n Gary didn\u0027t at first know what to make of this place. It seemed a land of paradoxes, both imposing and inviting, magnificently beautiful yet strangely eerie and untamed. Even the light came in uneven, unexpected bursts. One steep side of two joined mounds disappeared into mist at the top, while only a hundred feet down, the wet grass gleamed and rivulets sparkled in a distinct line of sunny brightness. Just a short distance below the sunshine loomed the shadow of another cloud, dark and foreboding.\\n\\n Full of life, yet full of melancholy. The paradox of existence itself, Gary thought, of vital life and quiet death.\\n\\n The companions spoke little as they hiked their way into the Crahgs, for the wind carried away all but the loudest shouts, and none of them felt secure enough to yell out. Silently they climbed and descended, under rushing clouds, in rain showers that lasted but a few minutes and sunshine that shared a similar, brief life.\\n\\n The first day hadn\u0027t been so bad, and Gary had thought that the second would be easier, on his emotions if not on his body. But the Crahgs were no less eerie that second day, and Gary had the distinct feeling that he and his friends were being watched, every step, by eyes that were not friendly.\\n\\n \"Loch Devenshere,\" Mickey explained on the afternoon of the third day, when the group rounded a rocky outcropping and came in view of a long and narrow lake. The waters continued on beyond sight in the east, cutting between poised and ominous lines of crahgs. All the world seemed a patchwork quilt of green and gray to Gary as he looked out over the sun-speckled landscape. Below him, the waters of Loch Devenshere bristled under the wind, deep and dark - and cold, he could tell from the sudden chilly and moist bite of the breeze.\\n\\n \"Do we feel safe enough to cross?\" Mickey asked Kelsey.\\n\\n The elf looked up to the sky, then back to the loch, finally settling his gaze upon Tommy. \"The waters of the loch are far too deep for a giant to walk them,\" Kelsey quickly explained, seeing Tommy taking out his makeshift snorkel.\\n\\n \"We\u0027ll save days of walking by going across,\" Mickey reasoned, and he didn\u0027t have to add that all of them, that all of their weary feet, could use a break from the difficult hike.\\n\\n \"So spend a day in strapping a raft that will hold the giant,\" Geno put in, casting a none-too-happy glance Tommy\u0027s way. \"Or leave him here - we already decided that he will not go all the way to the Giant\u0027s Thumb.\"\\n\\n Gary grew alarmed at the resigned looks Kelsey and Mickey exchanged, fearing that Geno\u0027s blustery suggestion might actually be accepted. \"You can\u0027t just leave him,\" Gary protested.\\n\\n \"There\u0027s not much wood to be found, lad,\" Mickey explained grimly. \"I\u0027m not for thinking that we\u0027ll get together a boat big enough to hold that one\u0027s weight.\"\\n\\n Gary really couldn\u0027t argue against that reasoning, and he, too, had no desire to continue the brutal hike if it could in any way be avoided. But neither did Gary want to leave Tommy behind, alone in this strange and eerie place. \"Compromise,\" Gary said at length. \"Build the boat for us and keep it close to the shore. Tommy will keep up and keep in sight. He can get around these hills faster than us.\"\\n\\n Mickey nodded, as did Kelsey, in acceptance of the compromise. Tommy had gotten them over obstacles that would have otherwise turned their path to the side many times in the last two days, and no doubt the giant could have crossed on an even straighter path unencumbered by his diminutive companions.\\n\\n \"Are ye up for it?\" Mickey asked the giant. \"The ground\u0027s sure to be hard going.\"\\n\\n \"Tommy likes mountains,\" came the giant\u0027s even-toned reply.\\n\\n Kelsey nodded; he would not so quickly abandon their valuable companion. Even Geno did not seem too upset that the giant would parallel them on the shore, and the dwarf returned Kelsey\u0027s nod with an uncomplaining shrug of his broad shoulders.\\n\\n With Tommy\u0027s powerful assistance, the group soon had two huge logs strapped together and in place on the waters of Devenshere. Gary and Kelsey worked to flatten the top of the raft and lessen its weight, while Geno fashioned oarlocks and a rudder of stone. Thinner logs were soon shaped as oars, and the companions even managed to get a sail up, using Kelsey\u0027s forest-green cloak.\\n\\n Tommy gave them a huge push for a start, and off they cruised, Gary working the sail (which didn\u0027t prove too effective) and Geno pulling tirelessly and mightily at the oars (which kept the raft rushing along at a great pace). Their path was smooth and straight, unlike Tommy\u0027s, but the giant, striding across sharp ravines and stepping over huge boulders, had no trouble keeping pace.\\n\\n Gary worried when Kelsey flatly denied his request that they anchor for the night, allowing Tommy some rest. \"The giant will keep pace with us,\" the elf declared, and he would hear no more of Gary\u0027s arguments. He didn\u0027t have to remind Gary of what they had left behind them, of the pursuit that would surely soon come.\\n\\n They floated on easily through the night, putting many miles behind them. When the sun came back up, a lighter blur through the gray clouds, Gary was quite relieved to see that tireless Tommy had indeed kept pace with them through the hours of darkness. The giant moved easily, incredibly gracefully, across the trails and rocks lining the shore. There loomed no weary shadows on Tommy\u0027s face and he was even singing to himself, Gary noted with some amusement.\\n\\n With his fears for Tommy eased, Gary\u0027s thoughts became as calm and smooth as the cold, dark water below them on the serene loch. He munched his morning meal and purposely kept any thoughts of Robert the dragon from his mind. Instead, the young man from that faraway world concentrated on nothing at all, allowed himself to bathe in the melancholy and majesty of the beautiful land about him. Whatever this adventure might be - even insanity - Gary did not want to lose these incredible images, wanted to engrain them indelibly on his mind and carry them with him for all of his life.\\n\\n A ripple far to the side of the raft caught his attention away from the drifting mountains. Gary blinked many times, his trance dispelled, as a serpentine head appeared above the waters of the loch, rising up five to ten feet, followed in its meandering course by a dark hump and then a second.\\n\\n Gary\u0027s mouth drooped open; his biscuit fell from his hand and rolled into the water.\\n\\n \"Don\u0027t ye be feeding her!\" Mickey barked at him suddenly. The leprechaun darted to the edge of the raft and scooped the biscuit from the water. \"Suren then she\u0027d follow us all the way across!\"\\n\\n \"She?\" Gary barely managed to stammer. Continuing their course towards the center of the loch, away from the raft, the neck and humps slipped gently under the surface.\\n\\n Wide-eyed still, Gary looked to Mickey. \"Nessie?\"\\n\\n The leprechaun didn\u0027t seem to understand. Mickey\u0027s cherubic, bearded face crinkled profoundly.\\n\\n Gary didn\u0027t press the point. He turned back to the open loch, its waters calm again save the bristles from the breeze, and watched, fearful yet intrigued. Too many questions came at him; too many possibilities. Out there, vulnerable on the makeshift raft, Gary desired the predictable days of home.\\n\\n And yet, there remained in the young man that nagging yearn for adventure, that flickering flame of spirit that sent tingles along his spine as he held his gaze steady on the dark waters, searching for a monster on a deep and dark loch in a remote and untamed land.\\n\\n He saw no more of the mysterious \"she,\" but the tingles along his spine did not diminish for a long, long while.\\n\\n As they rounded one bend in the loch, near twilight of that second day, the Crahgs seemed to part before them and Gary was treated to his first sight of the distant, dreaded mountain.\\n\\n It seemed more akin to an obelisk than a mountain, a great cylinder of rock heaved up from the plain by long-past volcanic pressures. From this distance, Gary couldn\u0027t begin to guess how high the Giant\u0027s Thumb truly was, but that didn\u0027t make the spectacle any less imposing. Suddenly Gary found himself wanting to yell out at Kelsey and Mickey for bringing him along, to shake them good and tell them that there was simply no way they could hope to even get up the sides of that gigantic tower of stone. But he said nothing, and the view disappeared as abruptly as it had come when an opaque veil of gray mist floated past in the distant plain.\\n\\n None of the companions, except for Tommy, was thrilled when they came to the eastern shore of Loch Devenshere. Reluctantly Gary pulled his sneakers back on his sore and swollen feet and tightened the many belts of Donigarten\u0027s armor. They camped before sunset, not far from the loch, and set off before sunrise with just a hasty breakfast.\\n\\n Up and down, along winding trails, over boulder ridges and cold, dancing streams. Only the knowledge that they were nearing the end of the Crahgs enabled Gary to continue placing one foot in front of the other. Seeing his weariness, gentle Tommy offered to carry him, but Gary declined, thinking that the giant, without even the short reprieve of floating comfortably on the loch, had gotten the worst of this trip so far.\\n\\n Unexpectedly the ground flattened out soon after, running along the lush and level base of a valley - Glen Druitch, Mickey called the place - for nearly a mile before rising up to form one final barrier to the plains beyond.\\n\\n \"The witch is modest this day,\" Mickey said grimly to Kelsey.\\n\\n \"Ceridwen?\" Gary asked, overhearing.\\n\\n \"Not that witch,\" Mickey explained. The leprechaun pointed ahead to the visible end of the valley, and the end of the Crahgs: twin conical peaks shrouded halfway up to the top by a thick layer of fog. \"The Witch\u0027s Teats,\" said the leprechaun. \"She\u0027s wearing her veil, and that means trouble for wanderers in Glen Druitch, and in all the Crahgs.\"\\n\\n \"Can\u0027t we go around it... them?\" Gary asked, suddenly not liking the look of that last obstacle.\\n\\n \"Too steep,\" Geno answered. \"And too mean. There is just the one trail out from this point. Right through the cleft of the Teats.\"\\n\\n \"Or at least tight to their base,\" Mickey added grimly.\\n\\n Kelsey suggested they pause and eat their lunch there in Glen Druitch before continuing, though the morning was barely half over. None disagreed, and so more than an hour passed before they at last came to the steep-sided twin mountains, sheets of rising green disappearing into low clouds, dotted by bare chunks of stone poking through the grass, and lined by several rushing and chattering streams. Kelsey spent a long moment staring up the Crahg, his gaze curious and, it seemed to Gary, just a bit fearful. Gary really didn\u0027t see anything different about this mound than the hundreds they had left behind, but he could not ignore the sense of dread that had obviously descended over his more knowledgeable companions.\\n\\n Still, Gary was quite surprised when Kelsey announced that they would skirt the bottom of both Crahgs instead of clambering up through their cleft.\\n\\n \"That course will cost us two hours,\" Geno grumbled, considering the wide girth of the Witch\u0027s Teats.\\n\\n \"Skirt them,\" Kelsey said again, casting a sidelong, uncomfortable glance to the concealing cloud high up the slope. Mickey and Geno exchanged worried looks and Geno veered a bit to the side, heading for one small waterfall dancing through a tumble of boulders, as the others started off.\\n\\n Gary spent more time looking behind, to Geno, than ahead, and he inadvertently kicked his foot against a jut of stone and fell headlong to the ground. Kelsey was upon him in an instant, roughly pulling him back to his feet.\\n\\n \"We have no time for blunders,\" the elf said in hushed tones, more sharply than Gary expected.\\n\\n \"I didn\u0027t mean...\"\\n\\n \"What you meant does not matter,\" Kelsey argued as loudly as he dared. \"Not here. Here, all that matters is what you did.\"\\n\\n Gary\u0027s confusion only heightened a moment later when Geno grunted loudly. He and Kelsey turned back and saw the dwarf with his ear pressed against the stone behind the waterfall, a grim expression on his face. Finally Geno came out and looked at his companions, shaking his head resignedly and drawing out two hammers.\\n\\n The moment seemed impossibly silent; not even the wind could disturb the calm.\\n\\n Their emergence from the cloud veil was prefaced by a series of bone-chilling shrieks that stole the strength from Gary Leger\u0027s body.\\n\\n \"Crahg wolves!\" he heard Mickey and Kelsey cry in unison, and he never had to ask what the two were talking about. Down the mountainside charged more than a dozen canine creatures. They resembled hyenas, though were much more slender, with dark gray, bristling fur and long and thick snouts. Their howls were part wolf, part human baby, it seemed, and part something else, something unnatural and evil.\\n\\n They came down the steep slope at full speed, with front legs twice as long as their hind legs, allowing them to run downhill with complete balance. Long before they reached the companions, small groups of the cunning pack fanned out, left and right, flanking and surrounding their prey.\\n\\n Geno darted out from the boulders around the waterfall and ran to another slab of rock set into the sloping side of the Crahg. One edge of this rock stuck out from the earth, allowing the dwarf to squeeze in behind it.\\n\\n Watching the dwarf\u0027s movements, Gary at first thought that Geno had gone into hiding. But he dismissed that notion quickly, reminding himself that cowardice was not a part of the sturdy dwarf\u0027s makeup. Geno would fight any foe fearlessly, no matter the odds. While he took comfort in that knowledge, Gary had to wonder from the concerned looks on the faces of his other two visible companions (Mickey, of course, was nowhere to be found) just how bad these Crahg wolves might be.\\n\\n Kelsey wasted no time in setting his bow to its deadly work. Arrow after arrow zipped up the hill, the elf concentrating his fire on the wolves that had circled to the right. One took a solid hit in the shoulder and began a yelping tumble; another caught an arrow right in the head and dropped straight down to the ground, skidding to an abrupt stop.\\n\\n More shrieks echoed from above and another group of wolves came rushing out of the gray mist.\\n\\n Gary heard a loud crack behind him and turned to see Tommy holding an uprooted tree. The giant shrugged, almost apologetically, and rubbed his foot across the ground where he had torn out the tree, trying to smooth the great divot.\\n\\n It struck Gary then that part of Tommy\u0027s thick black hair was standing up straight, a curious cowlick, and he soon understood where the invisible, and opportunistic, Mickey had made his perch.\\n\\n Kelsey continued to pepper the flanking wolf pack, each arrow finding a mark. The more immediate danger would come from straight ahead, Gary soon discerned, from the advance of the main pack.\\n\\n The largest grouping of Crahg wolves came on fiercely, howling and drooling, eager for flesh. They hopped rocks and dropped over short abutments with ease, hardly slowing, hardly turning from the straight line to their intended victims.\\n\\n The leading wolves came to one large and flat boulder, pressed against the grassy hillside with a sheer seven-foot drop beyond. On the wolves charged, taking no notice of the diminutive form wedged in the narrow opening between the rock slab and the ground behind it.\\n\\n Geno, his back set firmly against the stone, let the first few wolves get past, then tightened his powerful legs and pushed with all his strength. The slab shifted out from the hillside so quickly that those wolves coming next could not adjust the angle of their charge.\\n\\n Long forepaws dropped into the newly created ravine as the first wolf crashed in, slamming the bottom of its neck against the edged lip of stone. The creature\u0027s momentum carried it onward, bending it right over backwards as it rolled across the stone lip and down the hill beyond. Three trailing wolves were able to turn enough or duck enough to avoid a similar fate, but they slammed against the back side of the rock heavily and fell into the opened gully right beside the furious dwarf.\\n\\n Gary shook his head in disbelief at the howl and yelps that came from behind that stone. One wolf clambered over the rock, trying to flee, but a stubby, gnarly hand appeared behind it, grabbing it by the tail and pulling it right back into the fray. Mud flew wildly; hammer-tops came up from behind the lip of the stone, then dove back down ferociously; a wolf paw appeared, sticking out one side of the rock, a wolf tail out the other. One wolf went flying up right above the stone, turning a complete somersault and then dropping back down into the dwarf\u0027s playroom.\\n\\n But even with those four Crahg wolves dead or engaged, and with the pack of four to the right decimated by Kelsey\u0027s arrows, the fight was far from won. The third group of the first wave, also numbering four, rushed in from the left, and the ten more of the second wave came at the companions from above, prudently veering to avoid Geno\u0027s ravine.\\n\\n Tommy hoisted his uprooted tree and rushed out to meet the closest attackers.\\n\\n Up above, ten became nine as Kelsey fired one last arrow before dropping his bow and taking up his sword. The elf looked to Gary and nodded grimly. \"These are not stupid beasts - they will work together to separate us,\" Kelsey explained. \"And then they will work to get at you from behind. Keep on the move, and turn often as you do.\"\\n\\n Kelsey\u0027s predictions rang painfully true as the first wolf rushed in, heading straight for Gary, but then veering at the last moment to leap right between the young man and Kelsey. The creature took a severe hit from Kelsey\u0027s swift sword for its efforts, but its maneuver did the intended work, pushing the companions farther apart.\\n\\n Then the wolves swarmed all about them, four to each, circling and nipping, looking for openings.\\n\\n \"Thou must take the beasts one...,\"the magical spear began to instruct Gary.\\n\\n \"I know how to fight them,\" Gary heard himself asserting, with a surprising (even to Gary) tone of confidence.\\n\\n The spear imparted just one more thought before ending the communication altogether.\"Indeed.\"\\n\\n In the tight quarters of the tiny ravine, the stiff-legged Crahg wolves found themselves at a serious disadvantage. The dwarf could not wind up very far with his hammers, but Geno didn\u0027t need to, popping the wolves with short and powerful chopping strokes. He had one wolf upside down and wedged low in the stone and earth gully, the creature kicking and howling pitifully. Whenever Geno found the opportunity, he smacked a hammer down on its back side, driving it deeper into the wedge.\\n\\n One wolf managed to twist about and snap its jaws over Geno\u0027s forearm, drawing droplets of blood on the dwarf\u0027s stone-like skin. Geno clenched his hand as tightly as he could, flexing his smithy-hardened muscles so forcefully that the wolf\u0027s bite could not continue its penetration; the creature might as well have tried to tear through solid stone!\\n\\n Geno whacked and hammered with his free arm to keep the remaining attacker off of him, then, when the opening presented itself, he used the wolves\u0027 own tactic, biting the muzzle of the wolf that was clamped onto his arm.\\n\\n The beast yipped and thrashed, and let go of Geno\u0027s arm.\\n\\n But Geno, growling every second, held firm his bite, even lifted the creature up before him with his teeth and pressed it against the stone wall, leaning against it with his heavy frame to smother its clawing kicks.\\n\\n Thinking the dangerous dwarf fully engaged, the last wolf came back in.\\n\\n Geno\u0027s hammer was waiting.\\n\\n Tommy One-Thumb was not so fortunate. The giant\u0027s lumbering swipes with the uprooted tree could not match the speed and quickness of the darting wolves. They nipped at Tommy\u0027s heels, rushed between his legs, and kept him spinning and turning so fully that the giant soon found himself thoroughly dizzy.\\n\\n Tommy leaned one way and then the other. A wolf threw its body against his thigh, trying to topple him; another leaped up high and bit Tommy on the hand.\\n\\n Tommy knew that he must not fall. The wolves might cause him pain, but could do no serious damage against his massive legs. If he fell, though, more vital areas would surely be exposed.\\n\\n He felt a pain in his calf, but ignored it, concentrating instead on simply keeping his balance, on stopping the world about him from turning. Gradually he began to reorient himself. The leaper came up again, snapping at Tommy\u0027s palm.\\n\\n Stupid thing.\\n\\n Tommy clamped his hand shut around the wolf\u0027s muzzle. He spun about and heaved with all his might, pitching the wolf head over heels back up the mountainside. It narrowly missed a rock, though that hardly mattered, for it crashed headlong into the slope, contorted weirdly with its tail end coming right up over the back of its head.\\n\\n Tommy had no time to congratulate himself, though. There came again the pain in his calf, and then another bite, inside his thigh. The giant frantically tried to catch up with his attackers, but this only sent him spinning about again, and sent the whole world spinning around in Tommy\u0027s big eyes.\\n\\n Gary wheeled and threw up his shield just in time to deflect a wolf charge from his back side. The young man could not take the time to calculate any maneuvers. He had to trust fully in his instincts now, and so far they had not let him down. Turning, thrusting, feinting, Gary continued to keep the four wolves at bay, but likewise, he did no real damage to them.\\n\\n He knew that time would work against him, that he would tire long before his ravenous attackers.\\n\\n A shriek turned him momentarily to the side, where a wolf lay dead, its head nearly severed. Now Kelsey, too, faced only four, and one of these was not so mobile, having taken a hit on its flank in its initial charge between the elf and Gary.\\n\\n But Gary pushed away any hopes that Kelsey might soon come to his aid. Even if the elf managed to win out against the difficult odds, Gary doubted that Kelsey could get to him before the Crahg wolves tugged at his lifeless limbs.\\n\\n Furthermore, Gary Leger was tired of being the extra baggage on this adventure. For his salvation this time, he would look no further than the end of his own spear.\\n\\n A wolf snapped in low, but Gary dropped to one knee and dipped his shield sidelong to put it in line with the approaching foe. Sensing the creature\u0027s sudden reversal, Gary lifted the shield back upright and thrust straight out under its edge with his spear. The startled wolf, its head up, for it intended to leap over the dipped shield, caught the spear right through the base of its neck and down into its chest.\\n\\n The creature issued a wheezing sound as Gary, realizing that every hit he made left him vulnerable to the other wolves, ripped the weapon out and frantically tried to rise and spin.\\n\\n His clumsy shield hooked on the ground, slowing him, and only the fine armor saved his life, for a wolf leaped onto his back and bit at his neck.\\n\\n Wolf jaws rushed in; Geno punched straight out, driving his hammer right down the creature\u0027s throat. The dwarf smiled grimly as he heard the canine jawbones crack and break. He let the wolf pull itself back from the hammer, but let the weapon fly to follow the creature\u0027s retreat.\\n\\n It popped off of the wolf\u0027s head, blinding it in one eye.\\n\\n Geno slammed his heavy hand against the wolf he still pressed against the stone, pinning it by the throat. He finally pulled his face away, tearing off a chunk of the wolf\u0027s nose in his rock-munching teeth.\\n\\n \"Farewell, little doggie,\" the dwarf laughed, and, after just a moment to inspect his bitten arm, he nodded his satisfaction that the wound was not too serious and pounded home his second hammer, crushing the creature\u0027s skull.\\n\\n Free again, Geno pulled another hammer from his belt and advanced on the half-blinded wolf. Its jaw broken, the creature had no desire to stick around and it had nearly scrambled over the blocking stone wall before Geno clamped his teeth onto its tail and held it in place. The wolf kicked with its short hind legs and tugged mightily, but then the dwarf\u0027s hammers went to work, pounding alternately against its exposed flanks. Wolf bones turned to sand under that brutal beating, and very soon the thrashing stopped.\\n\\n Geno turned on the lone remaining wolf, still helplessly wedged upside down at the base of the stone.\\n\\n \"I would not want to be you right now,\" the dwarf said evenly, and steady, too, was his determined advance.\\n\\n Gary threw himself completely over, throwing his armor-enhanced weight right down on his attacker. The creature yelped briefly - for the split second it had any breath in its lungs - and Gary rolled over it, somehow managing to find his footing before the other two wolves overwhelmed him.\\n\\n The wolf on the ground kicked and wriggled, but couldn\u0027t seem to right itself, indicating that Gary\u0027s crunching fall had snapped a vital bone or two.\\n\\n The other wolves rushed at Gary from opposite sides, though. He flung his shield out to stop one, then tried to turn quickly enough to deflect the second. But again, the heavy shield hooked the ground, leaving Gary vulnerable.\\n\\n He dove forward instead, narrowly dodging the flying creature\u0027s snapping maw.\\n\\n \"How did Cedric ever fight with a spear and this damned shield!\" Gary screamed mentally.\\n\\n \"He did not,\"the sentient spear on Gary\u0027s belt answered.\"King Cedric fought with spear alone. The shield was for ceremony, and for those times when Cedric chose to wield his sword.\"\\n\\n Gary blinked and shook his head. He shook his arm, too, glad to be rid of the cumbersome shield. \"Thanks for telling me,\" came his sarcastic thoughts.\\n\\n \"I am here to serve,\"the spear answered sincerely, taking no offense.\\n\\n Crahg wolves were not overly large creatures, nor were their jaws as powerful as those of normal wolves. Crahg wolves relied on numerical advantage, and also on their speed - jerky movements enhanced by the strange proportions of their legs.\\n\\n In their fight with Kelsey, though, the Crahg wolves held no advantage at all.\\n\\n Whenever a wolf came in at the elf\u0027s heels, it was met by a blinding backhand of Kelsey\u0027s fine sword. And unlike Tommy, Kelsey could spin and twirl endlessly, experiencing not the least bit of dizziness. He kept his balance perfectly, shifting his weight from foot to foot, and always with his sword poised to strike - at whatever angle necessary to turn back the closest wolf.\\n\\n But Kelsey, too, knew that he could not hold a defensive posture for very long. While the elf did not fear that he would quickly tire, he knew that his less skilled and less agile companions would not likely hold out. And if either Geno or Gary was killed, killed, too, would be Kelsey\u0027s quest.\\n\\n A wolf circled to Kelsey\u0027s right. Kelsey spun on it and took one step ahead, but backed off immediately as the creature hopped out of range.\\n\\n A second wolf came in past the first, circling even farther to the elf\u0027s right. This time, Kelsey noticed something that the wolf did not.\\n\\n He spun and charged, and the wolf hopped away. But Kelsey did not halt. Another bold step sent the wolf hopping backwards again, and this time it crashed into its wounded companion, the one Kelsey had first hit when it dove between him and Gary.\\n\\n The wounded wolf faltered as it tried to get out of its comrade\u0027s way, for its sliced hip did not allow it much maneuverability. The healthy wolf scrambled and kicked but could not get away.\\n\\n Kelsey\u0027s sword came thrusting in, once and then again.\\n\\n Knowing two more creatures to be closing from behind, Kelsey rushed past his fresh kill, chopping down the wounded wolf as he passed. He spun about just beyond the bodies, lifting his sword in line for the closest attacker. The wolf veered, but too late; Kelsey hacked its long foreleg clean in half.\\n\\n One against one, the remaining wolf had no heart to continue. It barked an impotent protest, turned, and fled. Kelsey started towards the limping, three-legged beast, but changed his mind and went for his dropped longbow instead.\\n\\n Tommy stopped spinning, but the world did not. Nor did the pain in the giant\u0027s leg relent as the stubborn wolf held on. The giant started to bend low, thinking to grab hold of the wolf and launch it away.\\n\\n The world spun too fast; the ground leaped up at Tommy.\\n\\n Then he was lying on his back, looking curiously at the spinning clouds.\\n\\n A dark form descended over him. Instinctively Tommy punched out with both hands, connecting solidly enough to knock the Crahg wolf aside. But his arms were out helplessly wide when a second dark form hurtled in at his exposed neck.\\n\\n The wolfs snapping maw would have surely found a murderous hold had not a dwarven-hurled hammer intercepted its flight, spinning the creature right about in midair. The giant let out a muffled cry of surprise as the gray-furred beast flopped onto his face.\\n\\n Instinctively again, Tommy\u0027s hands came back in together, wrapping the beast in a bear-like hug. The wolf bit at the giant\u0027s thick limb; Tommy\u0027s great arms squeezed in response. In such tight quarters, it was no contest.\\n\\n Tommy won.\\n\\n Without the encumbering shield, Gary became a whirlwind of movement, spinning, thrusting, and slapping with the butt end of his dwarven-forged spear so effectively that the remaining two wolves never got close to biting him.\\n\\n He didn\u0027t think of tiring, didn\u0027t wonder if these movements were sentient-spear-guided or not. Gary didn\u0027t think of anything at all at that critical moment, reacting on pure instinct, letting his heart guide his movements more quickly than his mind ever could.\\n\\n He almost stumbled but caught himself. The helm hid Gary\u0027s wry smile, for he continued to lean, purposely, and did not show his opponents that he had regained his balance, that he had his legs squarely under him. He even kept his spear out wide, appearing defenseless.\\n\\n Expectedly a Crahg wolf rushed right at him.\\n\\n Gary waited for the very last moment, then jumped straight up in the air, folding his legs under him. The startled wolf stopped abruptly and Gary crashed back down atop its back. The creature\u0027s legs buckled and flew out wide - was that snapping noise its backbone? Gary wondered.\\n\\n Gary didn\u0027t wait to find out. He brought the spear in close and jabbed it straight down, straight through the wolf\u0027s back, with all his weight behind it.\\n\\n The second wolf wasn\u0027t far behind the first. Gary ripped his spear free and reversed his grip on it as he fell over, away from the threat. Like Alice the lion in Ceridwen\u0027s chamber, the wolf\u0027s momentum carried it on, and in its helpless charge, it impaled itself upon Gary\u0027s deadly spear.\\n\\n Gary kept the presence of mind to force the spear over and down to the side as the wolf slipped down its shaft, the doomed creature\u0027s jaws snapping frantically. It thrashed for a few moments longer, then lay very still.\\n\\n Exhausted, his burst of energy spent, Gary dragged himself to his feet. To his right, Kelsey took careful aim and loosed an arrow, dropping the lone fleeing wolf.\\n\\n Worried for the lying giant, Gary stumbled over to Tommy and Geno. Tommy held one squashed Crahg wolf close to his chest while the dwarf\u0027s hammers worked furiously on the wolf that was still stubbornly clamped onto Tommy\u0027s calf.\\n\\n \"It\u0027s dead,\" Gary remarked as he passed by the dwarf. Geno paused long enough to confirm the words.\\n\\n \"And stubborn,\" the dwarf replied, noting that death had down nothing to loosen the beast\u0027s tight jaws. Geno shrugged, put one of his hammers back into a loop on his belt, reached into a pouch, and took out a chisel instead.\\n\\n \"Are you all right?\" Gary asked Tommy.\\n\\n The giant nodded.\\n\\n Geno\u0027s hammer smacked home on the chisel.\\n\\n Tommy screamed and reflexively kicked, sending Geno soaring straight up into the air.\\n\\n Thoughts of the Doppler effect flashed in Gary\u0027s mind as the flying dwarf, too, let out a rapidly diminishing howl. Gary wisely looked up as the dwarf cry again intensified, and he wisely dove to the side, flat to the ground alongside Tommy\u0027s head, as Geno the dwarven cannonball crashed in for a three-bounce landing.\\n\\n Geno hopped right back up to his feet, glancing all about as though he was confused. Gary stayed on the ground, wondering if the dwarf would launch an explosive tirade.\\n\\n \"Hey, giant,\" Geno said instead, excitedly, after he spit out a clump of grass and dirt. \"Remember that trick.\" He looked up again and scratched his brown hair, marveling at how high he had flown. \"We might be using that one in our next fight!\"\\n\\n Tommy\u0027s reply echoed Gary\u0027s thoughts perfectly. \"Duh?\"\\n\\n Gary started to pull himself back up to his feet, but stopped when he realized that something was odd about Tommy\u0027s prone posture. The giant\u0027s head was not flat to the ground, though the grass under it was certainly flattened and lying to the side.\\n\\n Gary remembered then that someone was missing.\\n\\n Mickey faded into view a moment later, looking thoroughly miserable pinned under Tommy\u0027s massive skull.\\n\\n \"Ye\u0027d never guess how much a giant\u0027s head might weigh,\" the leprechaun remarked dryly.\\n\\n Hearing the sprite, Tommy promptly lifted his head and Mickey slithered out.\\n\\n \"Run on!\" Kelsey called to them suddenly, and his warning was surrounded by the distant howls of many more Crahg wolves.\\n\\n Gary didn\u0027t know what to make of it all. The wolves had been formidable opponents, but no more so than many other creatures the companions had faced - and defeated. Why, then, did Kelsey and Mickey, and even gruff Geno, once again wear expressions of such profound fear?\\n\\n \"EEE YA YIP YIP YIP!\"\\n\\n The cry split the air like a chorus of a hundred sirens and a hundred cannons all at once. Gary\u0027s backbone seemed to melt away under that blast and he nearly fell to the ground.\\n\\n \"What the heck was that?\" he gasped, after he had somewhat recovered.\\n\\n \"Run on, lad,\" Mickey said to him. \"It\u0027s better that ye do not know.\" \\n\\n","sourceLink":"https://allnovel.net/the-woods-out-back-spearwielder-s-tale-1/page-20.html","bookId":2184,"book":{"id":2184,"title":"The Woods Out Back (Spearwielder\u0027s Tale #1)","description":"Storyline: The Woods Out Back (Spearwielder\u0027s Tale #1) \\n The first in the Spearwielder fantasy adventure series--from the author of the New York Times bestseller The Legacy. In a magical spot in a forest, Gary falls asleep . . . and wakes up in a dangerous realm of elves and dwarves, witches and dragons. There he discovers he is the only one who can wear the armor of the land\u0027s lost hero--and wield a magical spear.\\n","cover":"https://allnovel.net/images/the-woods-out-back-spearwielder-s-tale-1.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-woods-out-back-spearwielder-s-tale-1.html","creation":"Oct 5, 2019 8:58:26 AM","modification":"Oct 5, 2019 6:49:16 PM"}}
