{"id":16376,"no":11,"title":"Chapter 11","content":"DIGORY AND HIS UNCLE ARE BOTH IN TROUBLE\\n\\n You may think the animals were very stupid not to see at once that Uncle Andrew was the same kind of creature as the two children and the Cabby. But you must remember that the animals knew nothing about clothes. They thought that Polly\u0027s frock and Digory\u0027s Norfolk suit and the Cabby\u0027s howlet hat were as much parts of them as their own fur and feathers. They wouldn\u0027t have known even that those three were all of the same kind if they hadn\u0027t spoken to them and if Strawberry had not seemed to think so. And Uncle Andrew was a great deal taller than the children and a good deal thinner than the Cabby. He was all in black except for his white waistcoat (not very white by now), and the great grey mop of his hair (now very wild indeed) didn\u0027t look to them like anything they had seen in the three other humans. So it was only natural that they should be puzzled. Worst of all, he didn\u0027t seem to be able to talk.\\n\\n He had tried to. When the Bulldog spoke to him (or, as he thought, first snarled and then growled at him) he held out his shaking hand and gasped \"Good Doggie, then, poor old fellow.\" But the beasts could not understand him any more than he could understand them. They didn\u0027t hear any words: only a vague sizzling noise. Perhaps it was just as well they didn\u0027t, for no dog that I ever knew, least of all a Talking Dog of Narnia, likes being called a Good Doggie then; any more than you would like being called My Little Man.\\n\\n Then Uncle Andrew dropped down in a dead faint.\\n\\n \"There!\" said a Warthog, \"it\u0027s only a tree. I always thought so.\" (Remember, they had never yet seen a faint or even a fall.)\\n\\n The Bulldog, who had been sniffing Uncle Andrew all over, raised its head and said, \"It\u0027s an animal. Certainly an animal. And probably the same kind as those other ones.\"\\n\\n \"I don\u0027t see that,\" said one of the Bears. \"An animal wouldn\u0027t just roll over like that. We\u0027re animals and we don\u0027t roll over. We stand up. Like this.\" He rose to his hind legs, took a step backwards, tripped over a low branch and fell flat on his back.\\n\\n \"The Third Joke, the Third Joke, the Third joke!\" said the Jackdaw in great excitement.\\n\\n \"I still think it\u0027s a sort of tree,\" said the Warthog.\\n\\n \"If it\u0027s a tree,\" said the other Bear, \"there might be a bees\u0027 nest in it.\"\\n\\n \"I\u0027m sure it\u0027s not a tree,\" said the Badger. \"I had a sort of idea it was trying to speak before it toppled over.\"\\n\\n \"That was only the wind in its branches,\" said the Warthog.\\n\\n \"You surely don\u0027t mean,\" said the Jackdaw to the Badger, \"that you think its a talking animal! It didn\u0027t say any words.\"\\n\\n \"And yet, you know,\" said the Elephant (the She Elephant, of course; her husband, as you remember, had been called away by Aslan). \"And yet, you know, it might be an animal of some kind. Mightn\u0027t the whitish lump at this end be a sort of face? And couldn\u0027t those holes be eyes and a mouth? No nose, of course. But then - ahem - one mustn\u0027t be narrow-minded. Very few of us have what could exactly be called a Nose.\" She squinted down the length of her own trunk with pardonable pride.\\n\\n \"I object to that remark very strongly,\" said the Bulldog.\\n\\n \"The Elephant is quite right,\" said the Tapir.\\n\\n \"I tell you what!\" said the Donkey brightly, \"perhaps it\u0027s an animal that can\u0027t talk but thinks it can.\"\\n\\n \"Can it be made to stand up?\" said the Elephant thoughtfully. She took the limp form of Uncle Andrew gently in her trunk and set him up on end: upside down, unfortunately, so that two half-sovereigns, three halfcrowns, and a sixpence fell out of his pocket. But it was no use. Uncle Andrew merely collapsed again.\\n\\n \"There!\" said several voices. \"It isn\u0027t an animal at all, It\u0027s not alive.\"\\n\\n \"I tell you, it is an animal,\" said the Bulldog. \"Smell it for yourself.\"\\n\\n \"Smelling isn\u0027t everything,\" said the Elephant.\\n\\n \"Why,\" said the Bulldog, \"if a fellow can\u0027t trust his nose, what is he to trust?\"\\n\\n \"Well, his brains perhaps,\" she replied mildly.\\n\\n \"I object to that remark very strongly,\" said the Bulldog.\\n\\n \"Well, we must do something about it,\" said the Elephant. \"Because it may be the Neevil, and it must be shown to Aslan. What do most of us think? Is it an animal or something of the tree kind?\"\\n\\n \"Tree! Tree!\" said a dozen voices.\\n\\n \"Very well,\" said the Elephant. \"Then, if it\u0027s a tree it wants to be planted. We must dig a hole.\"\\n\\n The two Moles settled that part of the business pretty quickly. There was some dispute as to which way up Uncle Andrew ought to be put into the hole, and he had a very narrow escape from being put in head foremost. Several animals said his legs must be his branches and therefore the grey, fluffy thing (they meant his head) must be his root. But then others said that the forked end of him was the muddier and that it spread out more, as roots ought to do. So finally he was planted right way up. When they had patted down the earth it came up above his knees.\\n\\n \"It looks dreadfully withered,\" said the Donkey.\\n\\n \"Of course it wants some watering,\" said the Elephant.\\n\\n \"I think I might say (meaning no offence to anyone present) that, perhaps, for that sort of work, my kind of nose -\"\\n\\n \"I object to that remark very strongly,\" said the Bulldog. But the Elephant walked quietly to the river, filled her trunk with water, and came back to attend to Uncle Andrew. The sagacious animal went on doing this till gallons of water had been squirted over him, and water was running out of the skirts of his frock-coat as if he had been for a bath with all his clothes on. In the end it revived him. He awoke from his faint. What a wake it was! But we must leave him to think over his wicked deed (if he was likely to do anything so sensible) and turn to more important things.\\n\\n Strawberry trotted on with Digory on his back till the noise of the other animals died away, and now the little group of Aslan and his chosen councillors was quite close. Digory knew that he couldn\u0027t possibly break in on so solemn a meeting, but there was no need to do so. At a word from Aslan, the He-Elephant, the Ravens, and all the rest of them drew aside. Digory slipped off the horse and found himself face to face with Aslan. And Aslan was bigger and more beautiful and more brightly golden and more terrible than he had thought. He dared not look into the great eyes.\\n\\n \"Please - Mr Lion - Aslan - Sir,\" said Digory, \"could you - may I - please, will you give me some magic fruit of this country to make Mother well?\"\\n\\n He had been desperately hoping that the Lion would say \"Yes\"; he had been horribly afraid it might say \"No\". But he was taken aback when it did neither.\\n\\n \"This is the Boy,\" said Aslan, looking, not at Digory, but at his councillors. \"This is the Boy who did it.\"\\n\\n \"Oh dear,\" thought Digory, \"what have I done now?\"\\n\\n \"Son of Adam,\" said the Lion. \"There is an evil Witch abroad in my new land of Narnia. Tell these good Beasts how she came here.\"\\n\\n A dozen different things that he might say flashed through Digory\u0027s mind, but he had the sense to say nothing except the exact truth.\\n\\n \"I brought her, Aslan,\" he answered in a low voice.\\n\\n \"For what purpose?\"\\n\\n \"I wanted to get her out of my own world back into her own. I thought I was taking her back to her own place.\"\\n\\n \"How came she to be in your world, Son of Adam?\"\\n\\n \"By - by Magic.\"\\n\\n The Lion said nothing and Digory knew that he had not told enough.\\n\\n \"It was my Uncle, Aslan,\" he said. \"He sent us out of our own world by magic rings, at least I had to go because he sent Polly first, and then we met the Witch in a place called Charn and she just held on to us when -\"\\n\\n \"You met the Witch?\" said Asian in a low voice which had the threat of a growl in it.\\n\\n \"She woke up,\" said Digory wretchedly. And then, turning very white, \"I mean, I woke her. Because I wanted to know what would happen if I struck a bell. Polly didn\u0027t want to. It wasn\u0027t her fault. I - I fought her. I know I shouldn\u0027t have. I think I was a bit enchanted by the writing under the bell.\"\\n\\n \"Do you?\" asked Asian; still speaking very low and deep. .\\n\\n \"No,\" said Digory. \"I see now I wasn\u0027t. I was only pretending.\"\\n\\n There was a long pause. And Digory was thinking all the time, \"I\u0027ve spoiled everything. There\u0027s no chance of getting anything for Mother now.\"\\n\\n When the Lion spoke again, it was not to Digory.\\n\\n \"You see, friends,\" he said, \"that before the new, clean world I gave you is seven hours old, a force of evil has already entered it; waked and brought hither by this son of Adam.\" The Beasts, even Strawberry, all turned their eyes on Digory till he felt that he wished the ground would swallow him up. \"But do not be cast down,\" said Aslan, still speaking to the Beasts. \"Evil will come of that evil, but it is still a long way off, and I will see to it that the worst falls upon myself. In the meantime, let us take such order that for many hundred years yet this shall be a merry land in a merry world. And as Adam\u0027s race has done the harm, Adam\u0027s race shall help to heal it. Draw near, you other two.\"\\n\\n The last words were spoken to Polly and the Cabby who had now arrived. Polly, all eyes and mouth, was staring at Aslan and holding the Cabby\u0027s hand rather tightly. The Cabby gave one glance at the Lion, and took off his bowler hat: no one had yet seen him without it. When it was off, he looked younger and nicer, and more like a countryman and less like a London cabman.\\n\\n \"Son,\" said Aslan to the Cabby. \"I have known you long. Do you know me?\"\\n\\n \"Well, no, sir,\" said the Cabby. \"Leastways, not in an ordinary manner of speaking. Yet I feel somehow, if I may make so free, as \u0027ow we\u0027ve met before.\"\\n\\n \"It is well,\" said the Lion. \"You know better than you think you know, and you shall live to know me better yet. How does this land please you?\"\\n\\n \"It\u0027s a fair treat, sir,\" said the Cabby.\\n\\n \"Would you like to live here always?\"\\n\\n \"Well you see sir, I\u0027m a married man,\" said the Cabby. \"If my wife was here neither of us would ever want to go back to London, I reckon. We\u0027re both country folks really.\"\\n\\n Aslan threw up his shaggy head, opened his mouth, and uttered a long, single note; not very loud, but full of power. Polly\u0027s heart jumped in her body when she heard it. She felt sure that it was a call, and that anyone who heard that call would want to obey it and (what\u0027s more) would be able to obey it, however many worlds and ages lay between. And so, though she was filled with wonder, she was not really astonished or shocked when all of a sudden a young woman, with a kind, honest face stepped out of nowhere and stood beside her. Polly knew at once that it was the Cabby\u0027s wife, fetched out of our world not by any tiresome magic rings, but quickly, simply and sweetly as a bird flies to its nest. The young woman had apparently been in the middle of a washing day, for she wore an apron, her sleeves were rolled up to the elbow, and there were soapsuds on her hands. If she had had time to put on her good clothes (her best hat had imitation cherries on it) she would have looked dreadful; as it was, she looked rather nice.\\n\\n Of course she thought she was dreaming. That was why she didn\u0027t rush across to her husband and ask him what on earth had happened to them both. But when she looked at the Lion she didn\u0027t feel quite so sure it was a dream, yet for some reason she did not appear to be very frightened. Then she dropped a little half curtsey, as some country girls still knew how to do in those days. After that, she went and put her hand in the Cabby\u0027s and stood there looking round her a little shyly.\\n\\n \"My children,\" said Aslan, fixing his eyes on both of them, \"you are to be the first King and Queen of Narnia.\"\\n\\n The Cabby opened his mouth in astonishment, and his wife turned very red.\\n\\n \"You shall rule and name all these creatures, and do justice among them, and protect them from their enemies when enemies arise. And enemies will arise, for there is an evil Witch in this world.\"\\n\\n The Cabby swallowed hard two or three times and cleared his throat.\\n\\n \"Begging your pardon, sir,\" he said, \"and thanking you very much I\u0027m sure (which my Missus does the same) but I ain\u0027t no sort of a chap for a job like that. I never \u0027ad much eddycation, you see.\"\\n\\n \"Well,\" said Aslan,\"can you use a spade and a plough and raise food out of the earth?\"\\n\\n \"Yes, sir, I could do a bit of that sort of work: being brought up to it, like.\"\\n\\n \"Can you rule these creatures kindly and fairly, remembering that they are not slaves like the dumb beasts of the world you were born in, but Talking Beasts and free subjects?\"\\n\\n \"I see that, sir,\" replied the Cabby. \"I\u0027d try to do the square thing by them all.\"\\n\\n \"And would you bring up your children and grandchildren to do the same?\"\\n\\n \"It\u0027d be up to me to try, sir. I\u0027d do my best: wouldn\u0027t we, Nellie?\"\\n\\n \"And you wouldn\u0027t have favourites either among your own children or among the other creatures or let any hold another under or use it hardly?\"\\n\\n \"I never could abide such goings on, sir, and that\u0027s the truth. I\u0027d give \u0027em what for if I caught \u0027em at it,\" said the Cabby. (All through this conversation his voice was growing slower and richer. More like the country voice he must have had as a boy and less like the sharp, quick voice of a cockney.)\\n\\n \"And if enemies came against the land (for enemies will arise) and there was war, would you be the first in the charge and the last in the retreat?\"\\n\\n \"Well, sir,\" said the Cabby very slowly, \"a chap don\u0027t exactly know till he\u0027s been tried. I dare say I might turn out ever such a soft \u0027un. Never did no fighting except with my fists. I\u0027d try -that is, I \u0027ope I\u0027d try - to do my bit.\"\\n\\n \"Then,\" said Aslan,, \"You will have done all that a King should do. Your coronation will be held presently. And you and your children and grandchildren shall be blessed, and some will be Kings of Narnia, and others will be Kings of Archenland which lies yonder over the Southern Mountains. And you, little Daughter (here he turned to Polly) are welcome. Have you forgiven the Boy for the violence he did you in the Hall of Images in the desolate palace of accursed Charn?\"\\n\\n \"Yes, Aslan, we\u0027ve made it up,\" said Polly.\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/118/238.html","bookId":448,"book":{"id":448,"title":"纳尼亚传奇：魔法师的外甥 The Magician‘s Nephew","description":"简介： First editionMain article: The Magician\u0027s NephewCompleted in February 1954[10] and published by Bodley Head in London on 2 May 1955, the prequel The Magician\u0027s Nephew brings the reader back to the very beginning of Narnia where we learn how Asla...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1290997589ab323.jpg","type":"双语小说","link":"http://novel.tingroom.com/ertong/118","creation":"Aug 1, 2019 12:18:47 AM","modification":"Aug 1, 2019 12:23:43 AM"}}
