{"id":16373,"no":8,"title":"Chapter 8","content":"THE FIGHT AT THE LAMP-POST\n \"Ho! Her-ipress, are you? We\u0027ll see about that,\" said a voice. Then another voice said, \"Three cheers for the Hempress of Colney \u0027Atch\" and quite a number joined in. A flush of colour came into the Witch\u0027s face and she bowed ever so slightly. But the cheers died away into roars of laughter and she saw that they had only been making fun of her: A change came over her expression and she changed the knife to her left hand. Then, without warning, she did a thing that was dreadful to see. Lightly, easily, as if it were the most ordinary thing in the world, she stretched up her right arm and wrenched off one of the cross-bars of the lamp-post. If she had lost some magical powers in our world, she had not lost her strength; she could break an iron bar as if it were a stick of barleysugar. She tossed her new weapon up in the air, caught it again, brandished it, and urged the horse forward.\n \"Now\u0027s my chance,\" thought Digory. He darted between the horse and the railings and began going forward. If only the brute would stay still for a moment he might catch the Witch\u0027s heel. As he rushed, he heard a sickening crash and a thud. The Witch had brought the bar down on the chief policeman\u0027s helmet: the man fell like a nine-pin.\n \"Quick, Digory. This must be stopped,\" said a voice beside him. It was Polly, who had rushed down the moment she was allowed out of bed.\n \"You are a brick,\" said Digory. \"Hold on to me tight. You\u0027d have to manage the ring. Yellow, remember. And don\u0027t put it on till I shout.\"\n There was a second crash and another policeman crumpled up. There came an angry roar from the crowd: \"Pull her down. Get a few paving-stones. Call out the Military.\" But most of them were getting as far away as they could. The Cabby, however, obviously the bravest as well as the kindest person present, was keeping close to the horse, dodging this way and that to avoid the bar, but still trying to catch Strawberry\u0027s head.\n The crowd booed and bellowed again. A stone whistled over Digory\u0027s head. Then came the voice of the Witch, clear like a great bell, and sounding as if, for once, she were almost happy.\n \"Scum! You shall pay dearly for this when I have conquered your world. Not one stone of your city will be left. I will make it as Charn, as Felinda, as Sorlois, as Bramandin.\"\n Digory as last caught her ankle. She kicked back with her heel and hit him in the mouth. In his pain he lost hold. His lip was cut and his mouth full of blood. From somewhere very close by came the voice of Uncle Andrew in a sort of trembling scream. \"Madam - my dear young lady - for heaven\u0027s sake - compose yourself.\" Digory made a second grab at her heel, and was again shaken off. More men were knocked down by the iron bar. He made a third grab: caught the heel: held on tike grim death, shouting to Polly \"Go!\" then Oh, thank goodness. The angry, frightened faces had vanished. The angry, frightened voices were silenced. All except Uncle Andrew\u0027s. Close beside Digory in the darkness, it was wailing on \"Oh, oh, is this delirium? Is it the end? I can\u0027t bear it. It\u0027s not fair. I never meant to be a Magician. It\u0027s all a misunderstanding. It\u0027s all my godmother\u0027s fault; I must protest against this.\n In my state of health too. A very old Dorsetshire family.\"\n \"Bother!\" thought Digory. \"We didn\u0027t want to bring him along. My hat, what a picnic. Are you there, Polly?\"\n \"Yes, I\u0027m here. Don\u0027t keep on shoving.\"\n \"I\u0027m not,\" began Digory, but before he could say anything more, their heads came out into the warm, green sunshine of the wood. And as they stepped out of the pool Polly cried out:\n \"Oh look! We\u0027ve-brought the old horse with us too. And Mr Ketterley. And the Cabby. This is a pretty kettle of fish!\"\n As soon as the Witch saw that she was once more in the wood she turned pale and bent down till her face touched the mane of the horse. You could see she felt deadly sick. Uncle Andrew was shivering. But Strawberry, the horse, shook his head, gave a cheerful whinny, and seemed to feel better. He became quiet for the first time since Digory had seen him. His ears, which had been laid flat back on his skull, came into their proper position, and the fire went out of his eyes.\n \"That\u0027s right, old boy,\" said the Cabby, slapping Strawberry\u0027s neck. \"That\u0027s better. Take it easy.\"\n Strawberry did the most natural thing in the world. Being very thirsty (and no wonder) he walked slowly across to the nearest pool and stepped into it to have a drink. Digory was still holding the Witch\u0027s heel and Polly was holding Digory\u0027s hand. One of the Cabby\u0027s hands was on Strawberry; and Uncle Andrew, still very shaky, had just grabbed on the Cabby\u0027s other hand.\n \"Quick,\" said Polly, with a look at Digory. \"Greens!\"\n So the horse never got his drink. Instead, the whole party found themselves sinking into darkness. Strawberry neighed; Uncle Andrew whimpered. Digory said, \"That was a bit of luck.\"\n There was a short pause. Then Polly said, \"Oughtn\u0027t we to be nearly there now?\"\n \"We do seem to be somewhere,\" said Digory. \"At least I\u0027m standing on something solid.\"\n \"Why, so am I, now that I come to think of it,\" said Polly. \"But why\u0027s it so dark? I say, do you think we got into the wrong Pool?\"\n \"Perhaps this is Charn,\" said Digory. \"Only we\u0027ve got back in the middle of the night.\"\n \"This is not Charn,\" came the Witch\u0027s voice. \"This is an empty world. This is Nothing.\"\n And really it was uncommonly like Nothing. There were no stars. It was so dark that they couldn\u0027t see one another at all and it made no difference whether you kept your eyes shut or open. Under their feet there was a cool, flat something which might have been earth, and was certainly not grass or wood. The air was cold and dry and there was no wind.\n \"My doom has come upon me,\" said the Witch in a voice of horrible calmness.\n \"Oh don\u0027t say that,\" babbled Uncle Andrew. \"My dear young lady, pray don\u0027t say such things. It can\u0027t be as bad as that. Ah - Cabman - my good man - you don\u0027t happen to have a flask about you? A drop of spirits is just what I need.\"\n \"Now then, now then,\" came the Cabby\u0027s voice, a good firm, hardy voice. \"Keep cool everyone, that\u0027s what I say. No bones broken, anyone? Good. Well there\u0027s something to be thankful for straight away, and more than anyone could expect after falling all that way. Now, if we\u0027ve fallen down some diggings - as it might be for a new station on the Underground - someone will come and get us out presently, see! And if we\u0027re dead - which I don\u0027t deny it might be - well, you got to -remember that worse things \u0027appen at sea and a chap\u0027s got to die sometime. And there ain\u0027t nothing to be afraid of if a chap\u0027s led a decent life. And if you ask me, I think the best thing we could do to pass the time would be sing a \u0027ymn.\"\n And he did. He struck up at once a harvest thanksgiving hymn, all about crops being \"safely gathered in\". It was not very suitable to a place which felt as if nothing had ever grown there since the beginning of time, but it was the one he could remember best. He had a fine voice and the children joined in; it was very cheering. Uncle Andrew and the Witch did not join in.\n Towards the end of the hymn Digory felt someone plucking at his elbow and from a general smell of brandy and cigars and good clothes he decided that it must be Uncle Andrew. Uncle Andrew was cautiously pulling him away from the others. When they had gone a little distance, the old man put his mouth so close to Digory\u0027s ear that it tickled, and whispered:\n \"Now, my boy. Slip on your ring. Let\u0027s be off.\"\n But the Witch had very good ears. \"Fool!\" came her voice and she leaped off the horse. \"Have you forgotten that I can hear men\u0027s thoughts? Let go the boy. If you attempt treachery I will take such vengeance upon you as never was heard of in all worlds from the beginning.\"\n \"And,\" added Digory, \"if you think I\u0027m such a mean pig as to go off and leave Polly - and the Cabby - and the horse in a place like this, you\u0027re well mistaken.\"\n \"You are a very naughty and impertinent little boy,\" said Uncle Andrew.\n \"Hush!\" said the Cabby. They all listened.\n In the darkness something was happening at last. A voice had begun to sing. It was very far away and Digory found it hard to decide from what direction it was coming. Sometimes it seemed to come from all directions at once. Sometimes he almost thought it was coming out of the earth beneath them. Its lower notes were deep enough to be the voice of the earth herself. There were no words. There was hardly even a tune. But it was, beyond comparison, the most beautiful noise he had ever heard. It was so beautiful he could hardly bear it. The horse seemed to like it too; he gave the sort of whinney a horse would give if, after years of being a cab-horse, it found itself back in the old field where it had played as a foal, and saw someone whom it remembered and loved coming across the field to bring it a lump of sugar.\n \"Gawd!\" said the Cabby. \"Ain\u0027t it lovely?\"\n Then two wonders happened at the same moment. One was that the voice was suddenly joined by other voices; more voices than you could possibly count. They were in harmony with it, but far higher up the scale: cold, tingling, silvery voices. The second wonder was that the blackness overhead, all at once, was blazing with stars. They didn\u0027t come out gently one by one, as they do on a summer evening. One moment there had been nothing but darkness; next moment a thousand, thousand points of light leaped out - single stars, constellations, and planets, brighter and bigger than any in our world. There were no clouds. The new stars and the new voices began at exactly the same time. If you had seen and heard it, as Digory did, you would have felt quite certain that it was the stars themselves which were singing, and that it was the First Voice, the deep one, which had made them appear and made them sing.\n \"Glory be!\" said the Cabby. \"I\u0027d ha\u0027 been a better man all my life if I\u0027d known there were things like this.\"\n The Voice on the earth was now louder and more triumphant; but the voices in the sky, after singing loudly with it for a time, began to get fainter. And now something else was happening.\n Far away, and down near the horizon, the sky began to turn grey. A light wind, very fresh, began to stir. The sky, in that one place, grew slowly and steadily paler. You could see shapes of hills standing up dark against it. All the time the Voice went on singing.\n There was soon light enough for them to see one another\u0027s faces. The Cabby and the two children had open mouths and shining eyes; they were drinking in the sound, and they looked as if it reminded them of something. Uncle Andrew\u0027s mouth was open too, but not open with joy. He looked more as if his chin had simply dropped away from the rest of his face. His shoulders were stopped and his knees shook. He was not liking the Voice. If he could have got away from it by creeping into a rat\u0027s hole, he would have done so. But the Witch looked as if, in a way, she understood the music better than any of them. Her mouth was shut, her lips were pressed together, and her fists were clenched. Ever since the song began she had felt that this whole world was filled with a Magic different from hers and stronger. She hated it. She would have smashed that whole world, or all worlds, to pieces, if it would only stop the singing. The horse stood with its ears well forward, and twitching. Every now and then it snorted and stamped the ground. It no longer looked like a tired old cab-horse; you could now well believe that its father had been in battles.\n The eastern sky changed from white to pink and from pink to gold. The Voice rose and rose, till all the air was shaking with it. And just as it swelled to the mightiest and most glorious sound it had yet produced, the sun arose.\n Digory had never seen such a sun. The sun above the ruins of Charn had looked older than ours: this looked younger. You could imagine that it laughed for joy as it came up. And as its beams shot across the land the travellers could see for the first time what sort of place they were in. It was a valley through which a broad, swift river wound its way, flowing eastward towards the sun. Southward there were mountains, northward there were lower hills. But it was a valley of mere earth, rock and water; there was not a tree, not a bush, not a blade of grass to be seen. The earth was of many colours: they were fresh, hot and vivid. They made you feel excited; until you saw the Singer himself, and then you forgot everything else.\n It was a Lion. Huge, shaggy, and bright, it stood facing the risen sun. Its mouth was wide open in song and it was about three hundred yards away.\n \"This is a terrible world,\" said the Witch. \"We must fly at once. Prepare the Magic.\"\n \"I quite agree with you, Madam,\" said Uncle Andrew. \"A most disagreeable place. Completely uncivilized. If only I were a younger man and had a gun -\"\n \"Garn!\" said the Cabby. \"You don\u0027t think you could shoot \u0027im, do you?\"\n \"And who would\" said Polly.\n \"Prepare the Magic, old fool,\" said Jadis.\n \"Certainly, Madam,\" said Uncle Andrew cunningly. \"I must have both the children touching me. Put on your homeward ring at once, Digory.\" He wanted to get away without the Witch.\n \"Oh, it\u0027s rings, is it?\" cried Jadis. She would have had her hands in Digory\u0027s pocket before you could say knife, but Digory grabbed Polly and shouted out:\n \"Take care. If either of you come half an inch nearer, we two will vanish and you\u0027ll be left here for good. Yes: I have a ring in my pocket that will take Polly and me home. And look! My hand is just ready. So keep your distance. I\u0027m sorry about you (he looked at the Cabby) and about the horse, but I can\u0027t help that. As for you two (he looked at Uncle Andrew and the Queen), you\u0027re both magicians, so you ought to enjoy living together.\"\n \"\u0027Old your noise, everyone,\" said the Cabby. \"I want to listen to the moosic.\"\n \n \n","sourceLink":"http://novel.tingroom.com/ertong/118/235.html","bookId":448,"book":{"id":448,"title":"纳尼亚传奇：魔法师的外甥 The Magician‘s Nephew","description":"简介： First editionMain article: The Magician\u0027s NephewCompleted in February 1954[10] and published by Bodley Head in London on 2 May 1955, the prequel The Magician\u0027s Nephew brings the reader back to the very beginning of Narnia where we learn how Asla...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1290997589ab323.jpg","type":"双语小说","link":"http://novel.tingroom.com/ertong/118","creation":"Aug 1, 2019 12:18:47 AM","modification":"Aug 1, 2019 12:23:43 AM"}}
