{"id":73665,"no":27,"title":"Page 27","content":"“I’ll go get the ingredients, okay?” I say, making it even easier for her.\n “Okay,” she says and then shrugs playfully, like she’s my girlfriend instead of my mom.\n I rush past her, down the steps, and out the door without even putting on a coat.\n There’s a local grocery about six blocks from our house and I find everything I need there in about ten minutes.\n Milk.\n Eggs.\n Butter.\n Pancake mix.\n Maple syrup.\n Chocolate chips.\n Bananas.\n On the walk home, with the plastic handles of the grocery bag cutting into my hand, I think about how once again, I’m letting Linda off easy.\n I try to concentrate on the pancakes.\n I can taste the chocolate and bananas melting in my mouth.\n Pancakes are good.\n They will fill me.\n They are what I can have.\n When I arrive home, Linda’s in her office yelling at someone on the phone about the color of tulle. “No, I do not want cadmium fucking orange!” She holds up her index finger when she sees me in the doorway and then waves me away.\n In the kitchen I wait five minutes before I decide to do the prep work by myself.\n I slice three bananas on the cutting board. Carefully, I make paper-thin cuts. And then I stir milk and eggs into the mix—adding the chocolate chips and banana slices last. I spray the pan and heat it up.\n “Linda?” I yell. “Mom?”\n She doesn’t answer, so I decide to cook the pancakes, thinking that Linda eating with me can be enough.\n I pour some batter onto the pan and it bubbles and sizzles while I pour out three more pancakes. I flip all four and then heat up the oven so I can keep the finished pancakes warm while I cook Mom’s.\n “Linda?”\n No answer.\n “Mom?”\n No answer.\n I put the finished pancakes into the oven and pour more batter.\n I realize I made way too much, but I just keep cooking pancakes, and by the time I finish, I have enough to feed a family of ten.\n “Mom?”\n I go to her study, and she’s yelling again.\n “Jasmine can go fuck herself!” she says, and then sighs.\n She’s staring out the window.\n She’s oblivious again.\n I sigh.\n I return to the kitchen.\n I eat my banana–chocolate chip pancakes.\n They are delicious.\n Fuck Linda.\n She’s missing out.\n She could have had delicious pancakes for breakfast.\n I would have forgiven her.\n But instead, I use the garbage disposal to grind up all the leftover pancakes.\n A few mirror shards fall in.\n I let the machine crunch away until it finally jams and I can once again hear Linda cursing at her employees.\n She doesn’t come out of her office—not even when I take off and slam the front door behind me so that the whole house shakes.\n THIRTY-EIGHT\n LETTER FROM THE FUTURE NUMBER 4\n Dad,\n It’s S, your daughter.\n I’m writing you on my eighteenth birthday—well, technically, it’s the day after; it’s past midnight. I’m manning the great light because you fell asleep in your chair again and old habits die hard. I’m going to give you this letter tomorrow when I leave Outpost 37 for the first time so you won’t ever forget what a great day we had together.\n (Side note: the stars are amazing tonight—like we could swim in them. Cassiopeia is shining brightly.)\n I have this suspicion: I think you’re mad at me because I want to leave, although you’ve never said as much. You think I’m leaving just so I can find a boyfriend, or at least that’s what you tease me about. (And I swear—if you use the word hormones one more time, I might kill you!) And while I would like to have a boyfriend (BECAUSE THAT IS NORMAL!) and meet people my own age in the horrid “tube city,” there are many other things I’d like to do as well.\n I’d like to see dry land.\n I’ve never seen it.\n I want to stand on earth.\n That’s a simple, but profound thought for a girl who has lived her whole life on water.\n You can surely understand that on some level, even if dry land is “overrated.”\n I’m looking forward to attending classes with other people my age, even though you’ve told me so many times that people aren’t always kind or considerate like Papa was and you and Mom are. Still, I’d like to see for myself—have conversations with so many different people! I’d like to find someone who kisses me every time he sees a shooting star, like you kiss Mom. And I think that maybe I can excel in postschool, especially since I did so well on the entrance exams, and afterward I can make you proud by putting good into the new world somehow.\n Thank you for making me “pancakes” on my birthday.\n Even though you had to use bread mix and you said it wasn’t as good as pancakes back when you were a kid, especially since we had no “syrup” because there are so few “maple trees” left. I appreciated the effort, especially after hearing the story of how your mom and you made them when you were little—with “chocolate chips” and yellow fruits called “bananas.” I hope to see and taste a banana one day. I choose to believe that they still exist in tube city, where all sorts of things exist—things that I have only dreamed about, like stores and restaurants and dogs and cats and movie theaters and sky walks and so many other nouns we’ve seen on the visualizer beam whenever the signal is strong enough.\n And your birthday present to me was also… beautiful.\n When you said we were going to use the last two oxygen tanks, I didn’t want to do it, because it meant that you’d never be able to go scuba diving again, unless the North American Land Collective sends you more bottles, which isn’t likely to happen, now that they’ve declared world order and Outpost 37, Lighthouse 1 is no longer technically operational.\n But I’m glad that I went scuba diving with you down into “Philadelphia” one last time with old Horatio the dolphin following.\n I didn’t believe you when you said there was a red statue that read: “LOVE,” with the LO stacked on top of the VE.\n LOVE\n It sounded like something out of one of the old fairy tales you used to tell me when I was a little girl. I thought you were kidding when you said people in the past believed in love so much that they made statues to celebrate it, so they wouldn’t forget to LOVE… well, that seemed kind of ridiculous—but when we dove down and you shined the thermal lantern, and it turned out to be true, I felt like there were so many possibilities in the world—like I’m only beginning to discover what’s achievable. Maybe I will find a pure love—like what you and Mom have.\n Mom told me that you and Horatio searched for the statue for weeks and then cleaned all the seaweed off, using up most of your oxygen supply, and so I wanted to say it was the best birthday present I have ever received. How many fathers would go to so much work just for their daughter’s eighteenth birthday?\n Not many.\n You told me you spent the day after your eighteenth birthday sitting on a bench in LOVE Park in Philadelphia writing in your notebook.\n From what you’ve told me of your past and dry land—and what I’ve pieced together too—I realize that your childhood was pretty terrible.\n That you had to endure a lot to get to Outpost 37 and become my father.\n I want to say thank you.\n You are a good man, Dad.\n I’ve had a beautiful childhood.\n And I admire you—I hope to be just like you.\n I’ve spent my whole life watching you man the great beam—here at Lighthouse 1.\n No one ever comes.\n We never see any boats.\n But you man the light anyway—just in case.\n And we got to see it—all these years.\n The great light.\n The beautiful sweeping beam!\n We were here to see it, and that was enough.\n I never really understood how important that was and is until now.\n It’s hard for me to leave you here, even though I realize you and Mom will be okay.\n I hope you will come visit me once I am settled in, but I understand if you can’t, and I will come back to visit you as much as I can.\n I’ve cut a thin braid of my hair off for you.\n (Mom said that you cut all your hair off on your eighteenth birthday, but I wasn’t about to do that, because my hair is my best feature!)\n Since you’re reading this, you already have the braid that was folded up inside.\n You once told me that women used to send locks of their hair to the men they loved when knights rode horses across endless dry land and kings and queens ruled the people. You told me about knights back when you were telling me fairy tales, before we started reading Hamlet together.\n I love you, Daddy.\n Never forget it.\n Also, I’ll be okay.\n Mom says you never thought you’d find her when you were my age, but you did.\n You probably never thought you’d find me either, and now I need to find the people in my future too—because that’s just the way of the world maybe.\n You’ll be okay.\n What was it that you and your neighbor used to say? The old man? Was his name Walt?\n “We’ll always have Paris.”\n Well, we’ll always have the LOVE statue at the bottom of Global Common Area Two.\n We’ll always have Outpost 37 and Lighthouse 1 and Horatio the dolphin and Philadelphia Phyllis and Who lived here? and all the rest.\n I’m watching you breathe as you sleep in the chair next to me.\n You look so peaceful.\n You look just like a good dad should.\n I can tell by the little smile on your face that you are having a wonderful dream.\n I’ve watched you sleep for over an hour, just because.\n And the whole time I wished your mind was a sea we could scuba dive in together because I’d like to see the LOVE statue that sits at the bottom of your consciousness.\n I know it’s huge and red and beautiful, because you’ve been pulling the seaweed off it for so many years. I know you weeded the waters of your mind for me, for Mom, so we could celebrate my eighteenth birthday together—and so I could go on and enjoy the life you gave me.\n Keep weeding, Dad.\n Weed your mind.\n And man the great light.\n Even when no one is looking.\n Love, your daughter,\n S \n","sourceLink":"https://allnovel.net/forgive-me-leonard-peacock/page-27.html","bookId":2705,"book":{"id":2705,"title":"Forgive Me, Leonard Peacock","description":"Storyline: \n Not to his former best friend, whose torments have driven him to consider committing something tragic and horrific. \n Nor to his mum who\u0027s moved out and left him to fend form himself. But to his four friends. \n A Humphrey-Bogart-obsessed neighbour \n A teenage violin virtuoso \n A pastor\u0027s daughter \n A teacher \n Most of the time, Leonard believes he\u0027s weird and sad but these friends have made him think that maybe he\u0027s not. \n He wants to thank them, and bid them farewell.\n \n","cover":"https://allnovel.net/images/forgive-me-leonard-peacock.jpg","author":"Matthew Quick","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/forgive-me-leonard-peacock.html","creation":"Oct 5, 2019 8:59:10 AM","modification":"Oct 5, 2019 10:28:07 AM"}}
