{"id":6990,"no":22,"title":"Book 4 Chapter 6 Unpopularity","content":"The archdeacon and the bellringer, as we have already said, were but little loved by the populace great and small, in the vicinity of the cathedral. When Claude and Quasimodo went out together, which frequently happened, and when they were seen traversing in company, the valet behind the master, the cold, narrow, and gloomy streets of the block of Notre-Dame, more than one evil word, more than one ironical quaver, more than one insulting jest greeted them on their way, unless Claude Frollo, which was rarely the case, walked with head upright and raised, showing his severe and almost august brow to the dumbfounded jeerers. Both were in their quarter like \"the poets\" of whom Régnier speaks,-- \"All sorts of persons run after poets, As warblers fly shrieking after owls.\" Sometimes a mischievous child risked his skin and bones for the ineffable pleasure of driving a pin into Quasimodo\u0027s hump. Again, a young girl, more bold and saucy than was fitting, brushed the priest\u0027s black robe, singing in his face the sardonic ditty, \"niche, niche, the devil is caught.\" Sometimes a group of squalid old crones, squatting in a file under the shadow of the steps to a porch, scolded noisily as the archdeacon and the bellringer passed, and tossed them this encouraging welcome, with a curse: \"Hum! there\u0027s a fellow whose soul is made like the other one\u0027s body!\" Or a band of schoolboys and street urchins, playing hop-scotch, rose in a body and saluted him classically, with some cry in Latin: \"~Eia! eia! Claudius cum claudo~!\" But the insult generally passed unnoticed both by the priest and the bellringer. Quasimodo was too deaf to hear all these gracious things, and Claude was too dreamy. 他俩在这种处境中倒有些象雷尼埃在《诗人们》里所说的：各种各样的人跟在诗人们身后行进，好象猫头鹰背后有啭鸟飞鸣。 有时，某个顽童为了获得在伽西莫多的驼背上插进一根针去的那种难以形容的快乐，竟不惜用自己的皮肉去冒险。有时，某个漂亮的姑娘，愉快地羞怯地抓住副主教的黑袍边儿，当面对他唱这支挖苦的曲子：“停下，停下，魔鬼给捉住啦！”有几次，一群妇女并排挤坐在大门前台阶的阴暗处，当副主教和敲钟人走过的时候，她们就嘀嘀咕咕，一面咒骂一面朝他们喊出这类使人心里高兴的话：“咳！这人的灵魂同那人的躯体是一样的呀！”有时一群学生或者正在玩踢石子游戏的孩子，一齐站起来，文雅地用拉丁话向他们致敬：“呀！呀！克洛德同跛子呀！” 但这种伤害往往是在副主教和敲钟人不知不觉之中进行的，伽西莫多太聋，克洛德太耽于梦幻，都听不见所有这些赏心悦耳的话。","sourceLink":"http://novel.tingroom.com/shuangyu/264/2522.html","bookId":227,"book":{"id":227,"title":"巴黎圣母院 Notre-Dame de Paris","description":"简介： 丑聋人卡西莫多被巴黎圣母院的神父克洛德收养，做撞钟人，外貌正经的克洛德神父自从遇见美丽的吉普赛少女爱斯美拉达后，被其美色所诱而神魂颠倒，指使卡西莫多强行掳走爱斯美...","cover":"http://novel.tingroom.com/uploads/110326/1-110326125SJ96.jpg","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/264","creation":"Aug 1, 2019 12:18:25 AM","modification":"Aug 1, 2019 12:18:25 AM"}}
