{"id":7028,"no":60,"title":"Book 11 Chapter 4 The Marriage Of Quasimodo","content":"We have just said that Quasimodo disappeared from Notre- Dame on the day of the gypsy\u0027s and of the archdeacon\u0027s death. He was not seen again, in fact; no one knew what had become of him.\\n\\n During the night which followed the execution of la Esmeralda, the night men had detached her body from the gibbet, and had carried it, according to custom, to the cellar of Montfau?on.\\n\\n Montfau?on was, as Sauval says, \"the most ancient and the most superb gibbet in the kingdom.\" Between the faubourgs of the Temple and Saint Martin, about a hundred and sixty toises from the walls of Paris, a few bow shots from La Courtille, there was to be seen on the crest of a gentle, almost imperceptible eminence, but sufficiently elevated to be seen for several leagues round about, an edifice of strange form, bearing considerable resemblance to a Celtic cromlech, and where also human sacrifices were offered.\\n\\n Let the reader picture to himself, crowning a limestone hillock, an oblong mass of masonry fifteen feet in height, thirty wide, forty long, with a gate, an external railing and a platform; on this platform sixteen enormous pillars of rough hewn stone, thirty feet in height, arranged in a colonnade round three of the four sides of the mass which support them, bound together at their summits by heavy beams, whence hung chains at intervals; on all these chains, skeletons; in the vicinity, on the plain, a stone cross and two gibbets of secondary importance, which seemed to have sprung up as shoots around the central gallows; above all this, in the sky, a perpetual flock of crows; that was Montfau?on.\\n\\n At the end of the fifteenth century, the formidable gibbet which dated from 1328, was already very much dilapidated; the beams were wormeaten, the chains rusted, the pillars green with mould; the layers of hewn stone were all cracked at their joints, and grass was growing on that platform which no feet touched. The monument made a horrible profile against the sky; especially at night when there was a little moonlight on those white skulls, or when the breeze of evening brushed the chains and the skeletons, and swayed all these in the darkness. The presence of this gibbet sufficed to render gloomy all the surrounding places.\\n\\n The mass of masonry which served as foundation to the odious edifice was hollow. A huge cellar had been constructed there, closed by an old iron grating, which was out of order, into which were cast not only the human remains, which were taken from the chains of Montfau?on, but also the bodies of all the unfortunates executed on the other permanent gibbets of Paris. To that deep charnel-house, where so many human remains and so many crimes have rotted in company, many great ones of this world, many innocent people, have contributed their bones, from Enguerrand de Marigni, the first victim, and a just man, to Admiral de Coligni, who was its last, and who was also a just man.\\n\\n As for the mysterious disappearance of Quasimodo, this is all that we have been able to discover.\\n\\n About eighteen months or two years after the events which terminate this story, when search was made in that cavern for the body of Olivier le Daim, who had been hanged two days previously, and to whom Charles VIII. had granted the favor of being buried in Saint Laurent, in better company, they found among all those hideous carcasses two skeletons, one of which held the other in its embrace. One of these skeletons, which was that of a woman, still had a few strips of a garment which had once been white, and around her neck was to be seen a string of adrézarach beads with a little silk bag ornamented with green glass, which was open and empty. These objects were of so little value that the executioner had probably not cared for them. The other, which held this one in a close embrace, was the skeleton of a man. It was noticed that his spinal column was crooked, his head seated on his shoulder blades, and that one leg was shorter than the other. Moreover, there was no fracture of the vertebrae at the nape of the neck, and it was evident that he had not been hanged. Hence, the man to whom it had belonged had come thither and had died there. When they tried to detach the skeleton which he held in his embrace, he fell to dust.\\n\\n \\n\\n 我们刚才说过，伽西莫多在埃及姑娘和副主教死去的那天就从教堂失踪了。人们真的没有再看见过他，不知道他上哪儿去了。\\n\\n 把拉·爱斯梅拉达处死的当天晚上，刽子手的助手们就把她的尸体从绞刑架上解下来，按照当时的惯例，送到隼山的墓窖里去了。\\n\\n 正如索瓦尔所说的，隼山是“王国里最古老最良好的刑台”。在庙堂镇和圣马尔丹之间，在离巴黎城垣约六十哩及距古尔第耶数箭之地，在一个几里外都看得见的高高的安静的山丘顶上，可以望见一个形状古怪的建筑，很象克尔特的环形大石台，那里也是个杀人的场所。\\n\\n 请想象在一个大石灰堆的顶上，有一个砖砌的高大的平行六面体的东西，有十五呎高，三十呎宽，四十呎长。它有一道门，一圈向外的围栏和一个平台。平台上有十六根巨大的石柱，每根三十呎高，排成柱廊，环绕在支撑它们的平台的三面。每两根石柱顶端有粗大的横梁联结起来，横梁上每个间隔里挂着一条铁链，每条铁链上都吊着一具尸骨。在它们周围的平地上，有一个石头十字架和两个差一些的刑台，好象从中央那座刑台上辐射出来似的。它们顶上的天空里永远盘旋着一群乌鸦，那地方就是隼山。\\n\\n 在十五世纪末，那骇人的刑台——上面记明是一三二八年建造的——已经十分老旧。横梁都朽坏了，铁链都生锈了，柱子上布满了绿苔，石子路上到处都是裂缝，青草一直长上了没人踏上去的平台。这个建筑物高耸天际的样子极其可怕，尤其在夜里。当月光照着那些白色头盖骨的时候，夜里凛冽的风使那些铁链和尸骨相撞，使它们在黑暗里不断晃动。那刑台的存在足以使那一带显得阴森恐怖。\\n\\n 那令人憎恶的建筑物的石头底座是中空的，其中筑有一个大地窖，用一道歪歪斜斜的铁格子关住，被抛在那里面的不只是从隼山的铁链上解下的尸骨，还有巴黎各处长期设置的刑台上处死的不幸的人的尸体。在那个深邃的墓窖里，有多少人类的尘灰和多少罪恶同在一起腐烂，世界上有多少伟大人物，多少清白无辜的人的骸骨不断被送到那里，上自昂格安·德·马意尼，他是第一个给送到隼山去的，是一个正直的人，下至郭里尼海军上将，他是最后一个被送去的，也是一个正直的人。\\n\\n 至于伽西莫多的神秘失踪，下面就是我们所能披露的全部情况。\\n\\n 大约在这段故事结尾的情节发生了两年或十八个月之后，人们到隼山的地窖里去寻找奥里维·勒丹的尸体，他是两天前才被绞死的，后来查理八世又恩赐他葬在圣洛昂，和好人葬在一起。人们在那些怕人的骸骨中发现了两具尸骨，一具把另一具抱得很紧。一具尸骨是女的，上面还残留着从前一定是白色布料的衣服的破片，还看见颈骨上有一条阿德雷扎拉珠链，串着一个嵌绿玻璃片的丝绸荷包，荷包已经打开了，掏空了。这些东西值不了几个钱，一定是刽子手不愿要才留下来的。紧抱住那具尸骨的另一具尸骨是个男人，人们只看到他有弯曲的脊梁骨，头盖骨缩在肩胛骨中间，一条腿骨比另一条腿骨短些。他的颈骨上没有一点伤痕，可见他并不是绞死的。那个男子一定是自己去到那里，而且就死在那里了。人们想把他同他抱着的那具尸骨分开，他就倒下去化成了灰尘。\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/shuangyu/264/2560.html","bookId":227,"book":{"id":227,"title":"巴黎圣母院 Notre-Dame de Paris","description":"简介： 丑聋人卡西莫多被巴黎圣母院的神父克洛德收养，做撞钟人，外貌正经的克洛德神父自从遇见美丽的吉普赛少女爱斯美拉达后，被其美色所诱而神魂颠倒，指使卡西莫多强行掳走爱斯美...","cover":"http://novel.tingroom.com/uploads/110326/1-110326125SJ96.jpg","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/264","creation":"Aug 1, 2019 12:18:25 AM","modification":"Aug 1, 2019 12:18:25 AM"}}
