{"id":95682,"no":18,"title":"Page 18","content":"Ptraci let herself slide back down to the chilly stones of the floor. Come in through the door! She wondered how it could manage that. Humans would need to open it first.\\n\\n She crouched in the furthest corner of the cell, staring at the small rectangle of wood.\\n\\n Long minutes went past. At one point she thought she heard a tiny noise, like a gasp.\\n\\n A little later there was subtle clink of metal, so slight as to be almost beyond the range of hearing.\\n\\n More time wound on to the spool of eternity and then the silence beyond the cell, which had been the silence caused by absence of sound, very slowly became the silence caused by someone making no noise.\\n\\n She thought: It\u0027s right outside the door.\\n\\n There was a pause in which Teppic oiled all the bolts and hinges so that, when he made the final assault, the door swished open in heart-gripping noiselessness.\\n\\n \u0027I say?\u0027 said a voice in the darkness.\\n\\n Ptraci pressed herself still further into the corner.\\n\\n \u0027Look, I\u0027ve come to rescue you.\u0027\\n\\n Now she could make out a blacker shadow in the flarelight. It stepped forward with rather more uncertainty than she would have expected from a demon.\\n\\n \u0027Are you coming or not?\u0027 it said. \u0027I\u0027ve only knocked out the guards, it\u0027s not their fault, but we haven\u0027t got a lot of time.\u0027\\n\\n \u0027I\u0027m to be thrown to the crocodiles in the morning,\u0027 whispered Ptraci. \u0027The king himself decreed it.\u0027\\n\\n \u0027He probably made a mistake.\u0027\\n\\n Ptraci\u0027s eyes widened in horrified disbelief.\\n\\n \u0027The Soul Eater will take me!\u0027 she said.\\n\\n \u0027Do you want it to?\u0027\\n\\n Ptraci hesitated.\\n\\n \u0027Well, then,\u0027 said the figure, and took her unresisting hand. He led her out of the cell, where she nearly tripped over the prone body of a guard.\\n\\n \u0027Who is in the other cells?\u0027 he said, pointing to the line of doors along the passage.\\n\\n \u0027I don\u0027t know,\u0027 said Ptraci.\\n\\n \u0027Let\u0027s find out, shall we?\u0027\\n\\n The figure touched a can to the bolts and hinges of the next door and pushed it open. The flare from the narrow window illuminated a middle-aged man, seated cross-legged on the floor.\\n\\n \u0027I\u0027m here to rescue you,\u0027 said the demon. The man peered up at him.\\n\\n \u0027Rescue?\u0027 he said.\\n\\n \u0027Yes. Why are you here?\u0027\\n\\n The man hung his head. \u0027I spoke blasphemy against the king.\u0027\\n\\n \u0027How did you do that?\u0027\\n\\n \u0027I dropped a rock on my foot. Now my tongue is to be torn out.\u0027\\n\\n The dark figure nodded sympathetically.\\n\\n \u0027A priest heard you, did he?\u0027 he said.\\n\\n \u0027No. I told a priest. Such words should not go unpunished,\u0027 said the man virtuously.\\n\\n We\u0027re really good at it, Teppic thought. Mere animals couldn\u0027t possibly manage to act like this. You need to be a human being to be really stupid. \u0027I think we ought to talk about this outside,\u0027 he said. \u0027Why not come with me?\u0027\\n\\n The man pulled back and glared at him.\\n\\n \u0027You want me to run away?\u0027 he said.\\n\\n \u0027Seems a good idea, wouldn\u0027t you say?\u0027\\n\\n The man stared into his eyes, his lips moving silently. Then he appeared to reach a decision.\\n\\n \u0027Guards!\u0027 he screamed.\\n\\n The shout echoed through the sleeping palace. His would-be rescuer stared at him in disbelief.\\n\\n \u0027Mad,\u0027 Teppic said. \u0027You\u0027re all mad.\u0027\\n\\n He stepped out of the room, grabbed Ptraci\u0027s hand, and hurried along the shadowy passages. Behind them the prisoner made the most of his tongue while he still had it and used it to scream a stream of imprecations.\\n\\n \u0027Where are you taking me?\u0027 said Ptraci, as they marched smartly around a corner and into a pillar-barred courtyard.\\n\\n Teppic hesitated. He hadn\u0027t thought much beyond this point.\\n\\n \u0027Why do they bother to bolt the doors?\u0027 he demanded, eyeing the pillars. \u0027That\u0027s what I want to know. I\u0027m surprised you didn\u0027t wander back to your cell while I was in there.\u0027\\n\\n \u0027I - I don\u0027t want to die,\u0027 she said quietly.\\n\\n \u0027Don\u0027t blame you.\u0027\\n\\n \u0027You mustn\u0027t say that! It\u0027s wrong not to want to die!\u0027 Teppic glanced up at the roof around the courtyard and unslung his grapnel.\\n\\n \u0027I think I ought to go back to my cell,\u0027 said Ptraci, without actually making any move in that direction. \u0027It\u0027s wrong even to think of disobeying the king.\u0027\\n\\n \u0027Oh? What happens to you, then?\u0027\\n\\n \u0027Something bad,\u0027 she said vaguely.\\n\\n \u0027You mean, worse than being thrown to the crocodiles or having your soul taken by the Soul Eater?\u0027 said Teppic, and caught the grapnel firmly on some hidden ledge on the flat roof.\\n\\n \u0027That\u0027s an interesting point,\u0027 said Ptraci, winning the Teppic Award for clear thinking.\\n\\n \u0027Worth considering, isn\u0027t it?\u0027 Teppic tested his weight on the cord.\\n\\n \u0027What you\u0027re saying is, if the worst is going to happen to you anyway, you might as well not bother any more,\u0027 said Ptraci. \u0027If the Soul Eater is going to get you whatever you do, you might as well avoid the crocodiles, is that it?\u0027\\n\\n \u0027You go up first,\u0027 said Teppic, \u0027I think someone\u0027s coming.\u0027\\n\\n \u0027Who are you?\u0027\\n\\n Teppic fished in his pouch. He\u0027d come back to Djeli an aeon ago with just the clothes he stood up in, but they were the clothes he\u0027d stood up in throughout his exam. He balanced a Number Two throwing knife in his hand, the steel glinting in the flarelight. It was possibly the only steel in the country; it wasn\u0027t that Djelibeybi hadn\u0027t heard about iron, it was just that if copper was good enough for your great-great-great-great-grandfather, it was good enough for you.\\n\\n No, the guards didn\u0027t deserve knives. They hadn\u0027t done anything wrong.\\n\\n His hand closed over the little mesh bag of caltraps. These were a small model, a mere one inch per spike. Caltraps didn\u0027t kill anyone, they just slowed them down a bit. One or two of them in the sole of the foot induced extreme slowness and caution in all except the terminally enthusiastic.\\n\\n He scattered a few across the mouth of the passage and ran back to the rope, hauling himself up in a few quick swings. He reached the roof just as the leading guards ran under the lintel. He waited until he heard the first curse, and then coiled up the rope and hurried after the girl.\\n\\n \u0027They\u0027ll catch us,\u0027 she said.\\n\\n \u0027I don\u0027t think so.\u0027\\n\\n \u0027And then the king will have us thrown to the crocodiles.\u0027\\n\\n \u0027Oh no, I don\u0027t think-\u0027 Teppic paused. It was an intriguing idea.\\n\\n \u0027He might,\u0027 he ventured. \u0027It\u0027s very hard to be sure about anything.\u0027\\n\\n \u0027So what shall we do now?\u0027\\n\\n Teppic stared across the river, where the pyramids were ablaze. The Great Pyramid was still under construction, by flarelight; a swarm of blocks, dwarfed by distance, hovered near its tip. The amount of labour Ptaclusp was putting on the job was amazing.\\n\\n What a flare that will give, he thought. It\u0027ll be seen all the way to Ankh.\\n\\n \u0027Horrible things, aren\u0027t they,\u0027 said Ptraci, behind him.\\n\\n \u0027Do you think so?\u0027\\n\\n \u0027They\u0027re creepy. The old king hated them, you know. He said they nailed the Kingdom to the past.\u0027\\n\\n \u0027Did he say why?\u0027\\n\\n \u0027No. He just hated them. He was a nice old boy. Very kind. Not like this new one.\u0027 She blew her nose and replaced her handkerchief in its scarcely adequate space in her sequinned bra.\\n\\n \u0027Er, what exactly did you have to do? As a handmaiden, I mean?\u0027 said Teppic, scanning the rooftop panorama to hide his embarrassment.\\n\\n She giggled. \u0027You\u0027re not from around here, are you?\u0027\\n\\n \u0027No. Not really.\u0027\\n\\n \u0027Talk to him, mainly. Or just listen. He could really talk, but he always said no-one ever really listened to what he said.\u0027\\n\\n \u0027Yes,\u0027 said Teppic, with feeling. \u0027And that was all, was it?\u0027\\n\\n She stared at him, and then giggled again. \u0027Oh, that? No, he was very kind. I wouldn\u0027t of minded, you understand, I had all the proper training. Bit of a disappointment, really. The women of my family have served under the kings for centuries, you know.\u0027\\n\\n \u0027Oh yes?\u0027 he managed.\\n\\n \u0027I don\u0027t know whether you\u0027ve ever seen a book, it\u0027s called The Shuttered-\u0027\\n\\n \u0027-Palace,\u0027 said Teppic automatically.\\n\\n \u0027I thought a gentleman like you\u0027d know about it,\u0027 said Ptraci, nudging him. \u0027It\u0027s a sort of textbook. Well, my great-great-grandmother posed for a lot of the pictures. Not recently,\u0027 she added, in case he hadn\u0027t fully understood, \u0027I mean, that would be a bit off-putting, she\u0027s been dead for twenty-five years. When she was younger. I look a lot like her, everyone says.\u0027\\n\\n \u0027Urk,\u0027 agreed Teppic.\\n\\n \u0027She was famous. She could put her feet behind her head, you know. So can I. I\u0027ve got my Grade Three.\u0027\\n\\n \u0027Urk?\u0027\\n\\n \u0027The old king told me once that the gods gave people a sense of humour to make up for giving them sex. I think he was a bit upset at the time.\u0027\\n\\n \u0027Urk.\u0027 Only the whites of Teppic\u0027s eyes were showing.\\n\\n \u0027You don\u0027t say much, do you?\u0027\\n\\n The breeze of the night was blowing her perfume towards him. Ptraci used scent like a battering ram.\\n\\n \u0027We\u0027ve got to find somewhere to hide you,\u0027 he said, concentrating on each word. \u0027Haven\u0027t you got any parents or anything?\u0027 He tried to ignore the fact that in the shadowless flarelight she appeared to glow, and didn\u0027t have much success.\\n\\n \u0027Well, my mother still works in the palace somewhere,\u0027 said Ptraci. \u0027But I don\u0027t think she\u0027d be very sympathetic.\u0027\\n\\n \u0027We\u0027ve got to get you away from here,\u0027 said Teppic fervently. \u0027If you can hide somewhere today, I can steal some horses or a boat or something. Then you could go to Tsort or Ephebe or somewhere.\u0027\\n\\n \u0027Foreign, you mean? I don\u0027t think I\u0027d like that,\u0027 said Ptraci.\\n\\n \u0027Compared to the netherworld?\u0027\\n\\n \u0027Well. Put like that, of course . . .\u0027 She took his arm. \u0027Why did you rescue me?\u0027\\n\\n \u0027Er? Because being alive is better than being dead, I think.\u0027\\n\\n \u0027I\u0027ve read up to number 46, Congress of the Five Auspicious Ants,\u0027 said Ptraci. \u0027If you\u0027ve got some yoghurt, we could-\u0027\\n\\n \u0027No! I mean, no. Not here. Not now. There must be people looking for us, it\u0027s nearly dawn.\u0027\\n\\n \u0027There\u0027s no need to yelp like that! I was just trying to be kind.\u0027\\n\\n \u0027Yes. Good. Thank you.\u0027 Teppic broke away and peered desperately over a parapet into one of the palace\u0027s numerous light wells.\\n\\n \u0027This leads to the embalmers\u0027 workshops,\u0027 he said. \u0027There must be plenty of places to hide down here.\u0027 He unwound the cord again.\\n\\n Various rooms led off the well. Teppic found one lined with benches and floored with wood shavings; a doorway led through to another room stacked with mummy cases, each one surmounted by the same golden dolly face he\u0027d come to know and loathe. He tapped on a few, and raised the lid of the nearest.\\n\\n \u0027No-one at home,\u0027 he said. \u0027You can have a nice rest in here. I can leave the lid open a bit so you can get some air.\u0027\\n\\n \u0027You can\u0027t think I\u0027d risk that? Supposing you didn\u0027t come back!\u0027\\n\\n \u0027I\u0027ll be back tonight,\u0027 said Teppic. \u0027And - and I\u0027ll see if I can drop some food and water in some time today. She stood on tiptoe, her ankle bangles jingling all the way down Teppic\u0027s libido. He glanced down involuntarily and saw that every toenail was painted. He remembered Cheesewright telling them behind the stables one lunch-hour that girls who painted their toenails were . . . well, he couldn\u0027t quite remember now, but it had seemed pretty unbelievable at the time.\\n\\n \u0027It looks very hard,\u0027 she said.\\n\\n \u0027What?\u0027\\n\\n \u0027If I\u0027ve got to lie in it, it\u0027ll need some cushions.\u0027\\n\\n \u0027I\u0027ll put some wood shavings in, look!\u0027 said Teppic. \u0027But hurry up! Please!\u0027\\n\\n \u0027All right. But you will be back, won\u0027t you? Promise?\u0027\\n\\n \u0027Yes, yes! I promise!\u0027\\n\\n He wedged a splinter of wood on the case to allow an airhole, heaved the lid back on and ran for it.\\n\\n The ghost of the king watched him go.\\n\\n The sun rose. As the golden light spilled down the fertile valley of the Djel the pyramid flares paled and became ghost dancers against the lightening sky. They were now accompanied by a noise. It had been there all the time, far too high-pitched for mortal ears, a sound now dropping down from the far ultrasonic\\n\\n KKKkkkkkkhhheeee. . . \\n\\n","sourceLink":"https://allnovel.net/pyramids-discworld-7/page-18.html","bookId":1626,"book":{"id":1626,"title":"Pyramids (Discworld #7)","description":"Storyline: Pyramids (Discworld #7) \\n It\u0027s bad enough being new on the job, but Teppic hasn\u0027t a clue as to what a pharaoh is supposed to do. After all, he\u0027s been trained at Ankh-Morpork\u0027s famed assassins\u0027 school, across the sea from the Kingdom of the Sun. First, there\u0027s the monumental task of building a suitable resting place for Dad -- a pyramid to end all pyramids. Then there are the myriad administrative duties, such as dealing with mad priests, sacred crocodiles, and marching mummies. And to top it all off, the adolescent pharaoh discovers deceit, betrayal - not to mention a headstrong handmaiden - at the heart of his realm.\\n","cover":"https://allnovel.net/images/pyramids-discworld-7.jpg","author":"Terry Pratchett","type":"Humorous","source":"allnovel","link":"https://allnovel.net/pyramids-discworld-7.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:15:50 PM"}}
