{"id":95701,"no":37,"title":"Page 37","content":"In population terms the necropolis outstripped the other cities of the Old Kingdom, but its people didn\u0027t get out much and there was nothing to do on Saturday nights.\n Until now.\n Now it thronged:\n Teppic watched from the top of a wind-etched obelisk as the grey and brown, and here and there somewhat greenish, armies of the departed passed beneath him. The kings had been democratic. After the pyramids had been emptied gangs of them had turned their attention to the lesser tombs, and now the necropolis really did have its tradesmen, its nobles and even its artisans. Not that there was, by and large, any way of telling the difference.\n They were, to a corpse, heading for the Great Pyramid. It loomed like a carbuncle over the lesser, older buildings. And they all seemed very angry about something.\n Teppic dropped lightly on to the wide flat roof of a mastaba, jogged to its far end, cleared the gap on to an ornamental sphinx - not without a moment\u0027s worry, but this one seemed inert enough - and from there it was but the throw of a grapnel to one of the lower storeys of a step pyramid. The long light of the contentious sun lanced across the spent landscape as he leapt from monument to monument, zig-zagging high above the shuffling army.\n Behind him shoots appeared briefly in the ancient stone, cracking it a little, and then withered and died.\n This, said his blood as it tingled around his body, is what you trained for. Even Mericet couldn\u0027t mark you down for this. Speeding in the shadows above a silent city, running like a cat, finding handholds that would have perplexed a gecko - and, at the destination, a victim.\n True, it was a billion tons of pyramid, and hitherto the largest client of an inhumation had been Patricio, the 23-stone Despot of Quirm.\n A monumental needle recording in bas-relief the achievements of a king four thousand years ago, and which would have been more pertinent if the wind-driven sand hadn\u0027t long ago eroded his name, provided a handy ladder which needed only an expertly thrown grapnel from its top, lodging in the outstretched fingers of a forgotten monarch, to allow him a long, gentle arc on to the roof of a tomb.\n Running, climbing and swinging, hastily hammering crampons in the memorials of the dead, Teppic went forth.\n Pinpoints of firelight among the limestone pricked out the lines of the opposing armies. Deep and stylised though the enmity was between the two empires, they both abided by the ancient tradition that warfare wasn\u0027t undertaken at night, during harvest or when wet. It was important enough to save up for special occasions. Going at it hammer and tongs just reduced the whole thing to a farce.\n In the twilight on both sides of the line came the busy sound of advanced woodwork in progress.\n It\u0027s said that generals are always ready to fight the last War over again. It had been thousands of years since the last war between Tsort and Ephebe, but generals have long memories and this time they were ready for it.\n On both sides of the line, wooden horses were taking shape.\n \u0027It\u0027s gone,\u0027 said Ptaclusp IIb, slithering back down the pile of rubble.\n \u0027About time, too,\u0027 said his father. \u0027Help me fold up your brother. You\u0027re sure it won\u0027t hurt him?\u0027\n \u0027Well, if we do it carefully he can\u0027t move in Time, that is, width to us. So if no time can pass for him, nothing can hurt him.\u0027\n Ptaclusp thought of the old days, when pyramid building had simply consisted of piling one block on another and all you needed to remember was that you put less on top as you went up. And now it meant trying to put a crease in one of your sons.\n \u0027Right,\u0027 he said doubtfully. \u0027Let\u0027s be off, then.\u0027 He inched his way up the debris and poked his head over the top just as the vanguard of the dead came round the corner of the nearest minor pyramid.\n His first thought was: this is it, they\u0027re coming to complain. He\u0027d done his best. It wasn\u0027t always easy to build to a budget. Maybe not every lintel was exactly as per drawings, perhaps the quality of the internal plasterwork wasn\u0027t always up to snuff, but . . .\n They can\u0027t all be complaining. Not this many of them.\n Ptaclusp IIb climbed up alongside him. His mouth dropped open.\n \u0027Where are they all coming from?\u0027 he said.\n \u0027You\u0027re the expert. You tell me.\n \u0027Are they dead?\u0027\n Ptaclusp scrutinised some of the approaching marchers.\n \u0027If they\u0027re not, some of them are awfully ill,\u0027 he said.\n \u0027Let\u0027s make a run for it!\u0027\n \u0027Where to? Up the pyramid?\u0027\n The Great Pyramid loomed up behind them, its throbbing filling the air. Ptaclusp stared at it.\n \u0027What\u0027s going to happen tonight?\u0027 he said.\n \u0027What?\u0027\n \u0027Well, is it going to - do whatever it did - again?\u0027\n IIb stared at him. \u0027Dunno.\u0027\n \u0027Can you find out?\u0027\n \u0027Only by waiting. I\u0027m not even sure what it\u0027s done now.\n \u0027Are we going to like it?\u0027\n \u0027I shouldn\u0027t think so, dad. Oh, dear.\u0027\n \u0027What\u0027s up now?\u0027\n \u0027Look over there.\u0027\n Heading towards the marching dead, trailing behind Koomi like a tail behind a comet, were the priests.\n It was hot and dark inside the horse. It was also very crowded.\n They waited, sweating.\n Young Autocue stuttered: \u0027What\u0027ll happen now, sergeant?\u0027\n The sergeant moved a foot tentatively. The atmosphere would have induced claustrophobia in a sardine.\n \u0027Well, lad. They\u0027ll find us, see, and be so impressed they\u0027ll drag us all the way back to their city, and then when it\u0027s dark we\u0027ll leap out and put them to the sword. Or put the sword to them. One or the other. And then we\u0027ll sack the city, bum the walls and sow the ground with salt. You remember, lad, I showed you on Friday.\u0027\n \u0027Oh.\u0027\n Moisture dripped from a score of brows. Several of the men were trying to compose a letter home, dragging styli across wax that was close to melting.\n \u0027And then what will happen, sergeant?\u0027\n \u0027Why, lad, then we\u0027ll go home heroes.\u0027\n \u0027Oh.\u0027\n The older soldiers sat stolidly looking at the wooden walls. Autocue shifted uneasily, still worried about something.\n \u0027My mum said to come back with my shield or on it, sergeant,\u0027 he said.\n \u0027Jolly good, lad. That\u0027s the spirit.\u0027\n \u0027We will be all right, though. Won\u0027t we, sergeant?\u0027\n The sergeant stared into the fetid darkness.\n After a while, someone started to play the harmonica.\n Ptaclusp half-turned his head from the scene and a voice by his ear said, \u0027You\u0027re the pyramid builder, aren\u0027t you?\u0027\n Another figure had joined them in their bolthole, one who was black-clad and moved in a way that made a cat\u0027s tread sound like a one-man band.\n Ptaclusp nodded, unable to speak. He had had enough shocks for one day.\n \u0027Well, switch it off. Switch it off now.\u0027\n IIb leaned over.\n \u0027Who\u0027re you?\u0027 he said.\n \u0027My name is Teppic.\u0027\n \u0027What, like the king?\u0027\n \u0027Yes. Just like the king. Now turn it off.\u0027\n \u0027It\u0027s a pyramid! You can\u0027t turn off pyramids!\u0027 said IIb.\n \u0027Well, then, make it flare.\u0027\n \u0027We tried that last night.\u0027 IIb pointed to the shattered capstone. \u0027Unroll Two-Ay, dad.\u0027\n Teppic regarded the flat brother.\n \u0027It\u0027s some sort of wall poster, is it?\u0027 he said eventually.\n IIb looked down. Teppic saw the movement, and looked down also; he was ankle-deep in green sprouts.\n \u0027Sorry,\u0027 he said. \u0027I can\u0027t seem to shake it off.\u0027\n \u0027It can be dreadful,\u0027 said IIb frantically. \u0027I know how it is, I had this verruca once, nothing would shift it.\u0027\n Teppic hunkered down by the cracked stone.\n \u0027This thing,\u0027 he said. \u0027What\u0027s the significance? I mean, it\u0027s coated with metal. Why?\u0027\n \u0027There\u0027s got to be a sharp point for the flare,\u0027 said IIb.\n \u0027Is that all? This is gold, isn\u0027t it?\u0027\n \u0027It\u0027s electrum. Gold and silver alloy. The capstone has got to be made of electrum.\u0027\n Teppic peeled back the foil.\n \u0027This isn\u0027t all metal,\u0027 he said mildly.\n \u0027Yes. Well,\u0027 said Ptaclusp. \u0027We found, er, that foil works just as well.\u0027\n \u0027Couldn\u0027t you use something cheaper? Like steel?\u0027 Ptaclusp sneered. It hadn\u0027t been a good day, sanity was a distant memory, but there were certain facts he knew for a fact.\n \u0027Wouldn\u0027t last for more than a year or two,\u0027 he said. \u0027What with the dew and so forth. You\u0027d lose the point. Wouldn\u0027t last more than two or three hundred times.\u0027\n Teppic leaned his head against the pyramid. It was cold, and it hummed. He thought he could hear, under the throbbing, a faint rising tone.\n The pyramid towered over him. (IIb could have told him that this was because the walls sloped in at precisely 56 degrees, and an effect known as battering made the pyramid loom even higher than it really was. He probably would have used words like perspective and virtual height as well.\n The black marble was glassy smooth. The masons had done well. The cracks between each silky panel were hardly wide enough to insert a knife. But wide enough, all the same.\n \u0027How about once?\u0027 he said.\n Koomi chewed his fingernails distractedly.\n \u0027Fire,\u0027 he said. \u0027That\u0027d stop them. They\u0027re very inflammable. Or water. They\u0027d probably dissolve.\u0027\n \u0027Some of them were destroying pyramids,\u0027 said the high priest of Juf, the Cobra-Headed God of Papyrus.\n \u0027People always come back from the dead in such a bad temper,\u0027 said another priest.\n Koomi watched the approaching army in mounting bewilderment.\n \u0027Where\u0027s Dios?\u0027 he said.\n The old high priest was pushed to the front of the crowd.\n \u0027What shall I say to them?\u0027 Koomi demanded.\n It would be wrong to say that Dios smiled. It wasn\u0027t an action he often felt called upon to perform. But his mouth creased at the edges and his eyes went half-hooded.\n \u0027You could tell them,\u0027 he said, \u0027that new times demand new men. You could tell them that it is time to make way for younger people with fresh ideas. You could tell them that they are outmoded. You could tell them all that.\u0027\n \u0027They\u0027ll kill me!\u0027\n \u0027Would they be that anxious for your eternal company, I wonder?\u0027\n \u0027You\u0027re still high priest!\u0027\n \u0027Why don\u0027t you talk to them?\u0027 said Dios. \u0027Don\u0027t forget to tell them that they are to be dragged kicking and screaming into the Century of the Cobra.\u0027 He handed Koomi the staff. \u0027Or whatever this century is called,\u0027 he added.\n Koomi felt the eyes of the assembled brethren and sistren upon him. He cleared his throat, adjusted his robe, and turned to face the mummies.\n They were chanting something, one word, over and over again. He couldn\u0027t quite make it out, but it seemed to have worked them up into a rage.\n He raised the staff, and the carved wooden snakes looked unusually alive in the flat light.\n The gods of the Disc - and here is meant the great consensus gods, who really do exist in Dunmanifestin, their semi-detached Valhalla on the world\u0027s impossibly high central mountain, where they pass the time observing the petty antics of mortal men and organising petitions about how the influx of the Ice Giants has lowered property values in the celestial regions - the gods of Disc have always been fascinated by humanity\u0027s incredible ability to say exactly the wrong thing at the wrong time.\n They\u0027re not talking here of such easy errors as \u0027It\u0027s perfectly safe\u0027, or \u0027The ones that growl a lot don\u0027t bite\u0027, but of simple little sentences which are injected into difficult situations with the same general effect as a steel bar dropped into the bearings of a 3,000 rpm, 660 megawatt steam turbine.\n And connoisseurs of mankind\u0027s tendency to put his pedal extremity where his tongue should be are agreed that when the judges\u0027 envelopes are opened then Hoot Koomi\u0027s fine performance in \u0027Begone from this place, foul shades\u0027 will be a contender for all-time bloody stupid greeting.\n The front row of ancestors halted, and were pushed forward a little by the press of those behind.\n King Teppicymon XXVII, who by common consent among the other twenty-six Teppicymons was spokesman, lurched on alone and picked up the trembling Koomi by his arms. \n","sourceLink":"https://allnovel.net/pyramids-discworld-7/page-37.html","bookId":1626,"book":{"id":1626,"title":"Pyramids (Discworld #7)","description":"Storyline: \n Pyramids (Discworld #7) \n It\u0027s bad enough being new on the job, but Teppic hasn\u0027t a clue as to what a pharaoh is supposed to do. After all, he\u0027s been trained at Ankh-Morpork\u0027s famed assassins\u0027 school, across the sea from the Kingdom of the Sun. First, there\u0027s the monumental task of building a suitable resting place for Dad -- a pyramid to end all pyramids. Then there are the myriad administrative duties, such as dealing with mad priests, sacred crocodiles, and marching mummies. And to top it all off, the adolescent pharaoh discovers deceit, betrayal - not to mention a headstrong handmaiden - at the heart of his realm.\n \n","cover":"https://allnovel.net/images/pyramids-discworld-7.jpg","author":"Terry Pratchett","type":"Humorous","source":"allnovel","link":"https://allnovel.net/pyramids-discworld-7.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:15:50 PM"}}
