{"id":39460,"no":13,"title":"CHAPTER XIII THE “HOODOO” STRIKES","content":"“Hello, Sandy! How are you, Dick?” Larry met the returning chums as they climbed to the small estate wharf from the yacht tender, and while they strolled up the path he asked eagerly: \n \n “Anything new? Anything suspicious?” \n \n “Not even our Sandy could discover a thing,” Dick confided. \n \n “Those emeralds aren’t on the yacht,” Sandy declared. “Captain Parks helped us by sending most of the crew ashore while Mr. Everdail took his wife to their woods camp. We went over the yacht——” \n \n “With a fine-tooth comb!” Dick broke in. “We did make one big discovery, though.” \n \n Larry turned toward him quickly. \n \n “What?” \n \n Dick tried to conceal the twinkle in his eye, but it got the better of him as he explained. \n \n “We found a string of beautiful, perfect emeralds in the stewardess’ cabin, hung up on a nail.” \n \n “Honestly?” \n 113 \n \n “Positive-ully, Larry! The finest that ever came out of a ten-cent store!” \n \n “Oh—you——” \n \n “Sandy suspected her right away!” went on the jovial one, “but no arrest was made.” \n \n “What have you discovered?” Sandy asked Larry quickly, to cover his impulse toward assaulting the teasing chum. \n \n “Not a thing—except I learned that the injured pilot was able to sit up and I went to see him.” Dick and Sandy waited anxiously for a revelation, but Larry was unable to give one. \n \n “He is named Tommy Larsen,” Larry informed them. “He’s getting well fast. He was glad that his passenger had been wrong in suspecting the Everdails——” \n \n “You didn’t tell him the emeralds we found were the imitations?” \n \n “No, Sandy. He thinks they were the real ones.” \n \n “What did he say to explain about his passenger not helping him, and then taking the boat?” \n 114 \n \n “The man came while I was there,” Larry told Dick. “He is named Deane, and he’s a nice-looking, quiet chap. It seems that when he landed with his ’chute, he came down and struck some driftwood or an old log, and it knocked the wind out of him. When he got back strength to cut himself loose, he tried to get to the seaplane but his landing, as I explained the location—well, you saw it when you flew over—his landing was made a couple of hundred yards away. I got the gardener to take me to the place, yesterday, in the hydroplane. There was a big, sunken log close to the torn ’chute.” \n \n “Did he see you, that day?” \n \n “No. He tried to swim over, turned sick, crawled onto some mud that was out of water and stayed there. I guess he fainted. When he managed to get there, we had taken Tommy Larsen away—so he’s cleared!” \n \n “I don’t see that!” \n \n “Why—Sandy! We left with the pilot—I mean, Jeff did. Then the hydroplane came for me, and when he got there, afterward, don’t you see that if he was guilty of anything, he’d have taken the chewing gum?” \n \n “He might have seen that one chunk was gone, suspected that the hiding place was discovered and left the rest——” \n \n “Suspicious Sandy!” Dick laughed. “With twenty-nine lovely emeralds to recover—and a rubber boat to get away in!” \n \n “All right! All right! He’s an innocent man.” \n 115 \n \n “As innocent as the man I helped capture—Mr. Everdail’s friend, that man we put on the wrecking tug for five hours.” \n \n “Everybody is innocent,” declared Dick. “Sandy, my advice to you, for your birthday, tomorrow, is to turn over a new leaf and instead of looking for people to suspect, try to think where those emeralds can be.” \n \n “They’re not on the yacht, you say,” Larry said to take away the sting to Sandy’s pride. “They aren’t in the old house. They were taken from the captain’s safe—where did they go?” \n \n “You tell me who knew the way to get into the captain’s safe and I’ll try to get the emeralds.” \n \n “Captain Parks says no one ever was told that combination.” \n \n “All right, Dick,” Sandy replied to the chum who had just spoken. “You’ve answered Larry’s question.” \n \n “Golly-glory-gracious! It does look that way!” \n \n “Who else could be safer? He says the emeralds were gone and his word is his bond! Oh, yes!” \n \n “Then the emeralds won’t be found,” concluded Dick. “Captain Parks has been ashore, and away, hours at a time, here and in Maine.” \n \n “Let’s see if Mr. Everdail won’t listen to us about that, now.” \n 116 \n \n Dick’s suggestion was followed. \n \n The millionaire listened gravely to their statement and broke into a hearty laugh. \n \n “As I live and breathe!” he said. “You members of Jeff’s Sky Patrol are working for the wrong side. You ought to be with that London lad, who suspects my wife and her cousin, Miss Serena, and me! Oh—this is great! You’re helping me a whole lot. I think I must increase the allowances for Suspicious Sandy, Detective Dick and—er—Follow-the-Leader Larry.” \n \n He turned his frowning lips and smiling eyes on the latter. \n \n “I’m amazed at you, though. Jeff says you’ve got good judgment.” \n \n “Captain Parks had opportunity—he knew you would take his word—no one else knew his safe combination. Isn’t that common sense, sir?” \n \n “It’s a kind of sense that’s common enough—but——” \n \n “Who else could get the emeralds?” persisted Sandy. \n \n “Well, let’s see. Besides Captain Parks, there’s—” his voice trailed off; once he shook his head at some thought; once he scowled; finally he shook his head defiantly. \n \n “As I live and breathe—it looks—but I won’t believe it! Not Billy Parks. He’s——” \n 117 \n \n “All right, sir,” Larry said. “We thought we ought to report what came into our minds. But we can’t prove anything, of course.” \n \n “All right, my boy. Watch him, trail him, whatever you like. I’ll give you each a thousand dollars if you can prove——” \n \n “How can we, unless we catch him—and the emeralds are gone——” \n \n The millionaire swung on Sandy as the youth spoke. \n \n “Wait—let me finish. A thousand dollars if you’ll prove—Parks is innocent!” \n \n “Oh!” \n \n He turned, dismissing them as he greeted his cousin, Miss Serena, who had declared that his wife would be better off alone to rest in the quiet camp in Maine. Miss Serena, with a will of her own, had come back, determined, if the rich man proposed to stay at his old estate, that she would assemble a group of servants and manage the house for him. The three chums sidled out, neither of the three counting on the payment of that, to them, large sum. \n \n “There’s money we’ll never get,” said Sandy. \n \n The others agreed. \n \n Sandy’s birthday dawned hot, but clear, with a good, steady south wind blowing. \n 118 \n \n The rich man had not forgotten Sandy. A fine set of books awaited him at the breakfast table, a set of engineering books that he would prize and study for many years. \n \n Larry’s remembrance, a radium-dial wrist watch, and Dick’s gift, the set of drawing implements he coveted, delighted him. Jeff’s modest but earnestly presented “luck charm” secured from his gypsy fortune teller was accepted with a grave, grateful word—but Sandy had hard work not to break into a wild laugh. \n \n “How old are you, buddy,” Jeff asked. \n \n “Thirteen!” \n \n Jeff’s face grew sober. \n \n “And this is Friday!” he murmured. \n \n “Surely it is,” laughed Larry, and then, in a lower tone, he urged, “now, Jeff——” \n \n “No, sir! I won’t go up, today, even if you did plan to surprise——” \n \n “You would spoil it!” Larry was unable to keep from being annoyed, almost angry, because Jeff had spoiled a surprise. \n \n “We might as well tell you, Sandy, now that it’s ‘all off’,” Dick said. “We were going to give you another present—a hop over your own house in Flatbush—with Larry for pilot! But——” \n \n “Oh, never mind Jeff. Let’s go!” \n 119 \n \n “Don’t be silly, Jeff,” Mr. Everdail chided the pilot. “Check over everything and then go up. You know mighty well that accidents don’t come from ‘hoodoos’. They come from lack of precaution on the pilot’s part. The weather charts for today give perfect flying weather. The airplane is in fine shape. Go ahead—give the lads a treat!” \n \n “On your heads be it!” Jeff said somberly. \n \n He did not neglect his duty. For all his nonsense about omens and such things, he gave the airplane a careful checkup, warmed up the engine for Larry himself and made sure that everything he could foresee was provided for. \n \n Sandy, thrilled at the prospect of a hop with his own comrade doing the control job, was full of fun and jokes. \n \n Dick, no less eager to see Larry perform his new duties, wasn’t behind Sandy in good humor. \n \n Larry, though quiet, was both confident and calm. \n \n He did not forget to assure himself, by a final look at the windsock indicating the wind direction, that the breeze had not shifted. \n \n Neither did he “dust” the hangar, nor lose his straight course as he taxied across the field at an angle to turn, without scraping wings or digging up turf with the tail skid. \n 120 \n \n A final test, with chocks under the wheels, the signal for the wheels to be cleared by the caretaker, a spurt of the gun for several seconds to get the craft rolling as the elevators were operated to lift the tail free, a run at increasing speed, picked up quickly because of the short runway—stick back, lifting elevators so the propeller blast drove the tail lower and the nose higher—and they left the ground. \n \n Stick back from neutral, after leveling off for a bare two seconds to regain flying speed, and they climbed, the engine roaring, Jeff nodding but making no comment through the speaking tube he still used. Dick shouted a hurrah! Sandy joined him. \n \n Over the hangar they rose, and Larry, holding a more gentle angle to avert a stall, continued upward until his altimeter gave him a good five hundred feet. \n \n Then, choosing a distant steeple as in direct line with the course he would fly toward Brooklyn, to be out of any airline around the airports, he made a climbing turn, steadied the craft, straightening out, went two thousand feet higher to be doubly safe—and drew back his throttle to cruising speed. \n \n “Who says this airplane is hoodooed?” shouted Sandy, jubilantly. \n \n And then—the hoodoo struck! \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2096/59534.html","bookId":523,"book":{"id":523,"title":"The Haunted Hangar","description":"简介： Neither sixteen-year-old Larry Turner nor Dick Summers, a year his junior, had any more fear than had Sandy Maclaren, hardly thirteen and seated just back of the pilot who, in flying the four-place, low-wing airplane, had called back reassuringly....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2096","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
