{"id":39481,"no":34,"title":"CHAPTER XXXIV THE EMERALDS ARE FOUND","content":"Larry sent his craft into a sharp dive. Tommy, trying to prevent the maneuver, came straight toward the spot they had occupied, but missed. Now the clouds hid them. By use of his instruments he could keep on a level keel, Larry knew, and with the engine throttled off, they could not be traced by its roar. Presently they sailed out into a clear area and Larry sighed thankfully. He watched for a landing field beside a lake shaped like a half-moon. That would tell him he could set down on the landing spot the millionaire had built before going West. Then he saw it. They began to drop swiftly, coming ever closer to the field. And then they set down, safe and unmolested. 271 Before the chums were clear of the runway, Tommy set down his ship, tumbled out and let the woman with him—the yacht stewardess—get out as best she could. “What do you mean, double-crossing me?” screamed Tommy at detective Whiteside. “Why have you tried to get the emeralds after you promised me half of them?” “The man has gone crazy,” said Whiteside. “They are all in it together, Mr. Everdail,” Tommy shouted, turning toward the millionaire. “What are you doing with that stewardess?” demanded Larry. “She joined you on the lawn when you came from behind the trees.” “Be still,” cried Everdail. “We can thresh it out later. Right now let’s get those emeralds.” Larry produced a knife, and Mr. Everdail slashed the life preserver to ribbons. There was a gasp. The life preserver was empty. Then everyone began to talk at once, as accusations flew back and forth. “Boss, I want you to take a look at this-here stuff I brought from your house,” said Jeff, drawing a parcel from his pocket. “Good night!” Sandy was amazed. “Jeff, that’s the family history of the Everdails, that I saw when I visited the farm boys and found out you and Mimi were married.” 272 “That-there is it,” agreed Jeff, taking several tintypes from an envelope. “Boss, read that history of your family and see if it makes it plain why anybody wanted to destroy your gems.” In the light of a flare, Mr. Everdail perused the pages. “As I live and breathe!” he exclaimed. “Yeah,” grinned Jeff. “Thanks to Sandy for leaving the book there, and thanks to—a certain relative of yours for leaving a marker at the right place. Now, take a look at these pictures out of your family album. They are pictures of the man who originally got the emeralds in India, and his son. Whose face that you know is close to being the same?” With the scream of a madman, Mr. Whiteside leaped to the side of the group. “Yes!” he babbled. “Yes! I am the son of the branch of your family that originally had the emeralds. My grandfather, for spite against my father, willed them to your family. Those emeralds ought to be mine—and my sister’s”—here he gestured toward the stewardess. 273 “Yes!” cried Whiteside Everdail—as they now learned his name was—“I grew up hating Atley Everdail’s family. I enlisted in the flying corps, got into his esquadrille, made a buddy of him, won his trust! “I worked into his confidence, and watched every chance to get the emeralds. My time came when his wife went to London. I had my sister—stewardess, she was—already on the yacht. “I beat the yacht to London. With her help—forced by threats—I got into the hotel and destroyed the gems—I thought. But on the way back to my room I saw Captain Parks, and began to suspect. I compelled my sister to admit the truth. The real gems were safe. “I came to America, made the hinged door to the hangar, rewired the switches to get light by day to prepare the amphibian. “I hired Tommy Larsen—he didn’t know the truth at first. Then I saw Jeff was getting suspicious, changed my plans and got a seaplane. I even went with Atley to see my own plan carried out,” he screeched. 274 “But everything went wrong. The life preserver hid the gems. I knew that, and made my sister run off with the wrong preserver, that I took from Jeff’s airplane. I thought the right preserver was in the seaplane, but Tommy was ‘wise,’ and refused to do any more than watch me, and when my sister came to get the emeralds, he tried to prevent me from getting away with it. You can piece out the rest. You’ll never punish me! You’ll never—take me alive!” Eluding them, he dashed straight down to where Jeff’s amphibian, its prop still turning, stood fifty feet from the end of the runway. Tumbling into the cockpit, he threw the throttle wide. Down the few feet the amphibian roared, gathering speed. The rend and crash, the tear of metal, wood and fabric as the craft dashed against a tree, was followed by a shrill scream from the stewardess. In one thing the fanatic prophesied truly. They did not take him alive. But still they did not know where the emeralds were! Next morning the Sky Patrol, the millionaire and others took the train from camp to the harbor. But although Mimi showed which she thought was the right belt—although they ripped apart every life preserver on the yacht—no jewels appeared. 275 “I’ve thought of every possible hiding place,” Sandy told his chums, “and the only thing I can see to do is—if they were in a life preserver at all—what do you say to trying this—” He outlined a plan. So promising did it seem that both Dick and Larry agreed to it. That night an alarm of fire, red glow, yellow and red flames, and suffocating smoke, terrified everyone. Tracing the smoke to the galley, Mr. Everdail was astounded to find Dick and Larry struggling with a man in pajamas—he had rushed in, had seen—too late—the red flares, colored fire powder and smoke pots that burned in buckets, and had been unable to disguise the fact that he had dragged two ice trays from the refrigerator. They contained—green ice! “As I live and breathe!” cried Mr. Everdail, inspecting a tray. Quickly overpowered, their captive confessed. The chef had taken the emeralds from the life preserver and frozen them in ice cubes of a deep emerald-green dye. These he easily preserved during the short times the trays were needed for other cubes, by putting them into one of the deep vegetable trays used in the refrigerating system. 276 That was how the chums were misled the night of Sandy’s birthday party. The trays had been emptied when they looked, and because the trays had just been used for tinted ice and were logically empty, they were fooled. “But I was a coward—my conscience bothered me,” the chef admitted. “I wanted to return ’em, I wanted to take ’em. So, now—I’m glad I only kept them for you!” “Well, Sky Patrol,” said Jeff as the boys pocketed their reward checks, “the sole of that-there right foot of mine itches. That means I’m to go into a new business and prosper—with the help of my Sky Patrol and Ground Crew. How about it?” “drop a signal flare,” urged Sandy. “We’ll come a-flying!” And that was settled! The End","sourceLink":"http://novel.tingroom.com/jingdian/2096/59555.html","bookId":523,"book":{"id":523,"title":"The Haunted Hangar","description":"简介： Neither sixteen-year-old Larry Turner nor Dick Summers, a year his junior, had any more fear than had Sandy Maclaren, hardly thirteen and seated just back of the pilot who, in flying the four-place, low-wing airplane, had called back reassuringly....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2096","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
