{"id":90149,"no":45,"title":"Page 45","content":"The service had been going on for some time when she arrived, but an usher at the door, open and friendly, had guided her in. Goodman Wilson was preaching about tolerance. So far, nothing that she heard suggested anything ominous or particularly different from what she might hear in a sermon at a more commonplace church. “My friends,” Goodman Wilson went on, “we are all here because we choose to be here. The world offers so many subversions. Satan does remain at the door. I say this, because Satan stands at the doors to our souls. We all know that he doesn’t really play out there in the woods, trying to seduce the unwary to dance naked with him!” That brought about a spate of laughter, which, it seemed, the pastor had intended. “Our community is facing a time of trial again. We are often ostracized because our devotion is so deep, and because we see perpetual invitations to sin in those things others often see as innocent. But, my friends, we stand fast in our faith. We do not consider that we rise above others. We only know in our hearts where we want to go. While we practice tolerance—patience with our fellow man, though our fellow man often has no patience for us—we must also realize that we are part of this community. Jesus Christ suffered the mockery and cruelty of others so that we might learn to live our lives with His help to free us from sin. I am asking all of you to open yourselves up to the mockery of others. A terrible injustice is being done now. Though it will open you up to the mockery of others, I’m asking that any who can help in the matter of the deaths of our brother Abraham Smith and his loved ones, look deep into your hearts, and open your hearts, souls and even your lives to those who are so desperately investigating the truth in this matter. My friends, my brothers, my sisters, I don’t ask that you act in haste—I ask that you search your own souls. I don’t believe that anyone in the Smith family was a murderer. I believe that those investigating the case can use all the help they can get.” Angela stared at the pastor. He had just baldly asked his congregation to step forward. “Go in the peace and goodness of our Almighty God!” Goodman Wilson said. “May God’s blessing follow you as you leave this place of worship, and may you do His work in all things. Peace be with you.” With that, the service was over and Angela stood. A number of people eyed her, but most of them shook her hand and welcomed her to the church and asked her to return. She was surprised when Goodman Wilson approached her after the service, but she thought that the pastor would probably welcome any newcomer. “Ah, welcome—Miss Hawkins,” Goodman Wilson said. She smiled. “You know who I am. Was that sermon for my benefit?” “No, Miss Hawkins, it was not. It was written last night as I sat at my desk and pondered all that was going on.” “Do you think that any members of your congregation truly know something?” He hesitated. Angela saw that he was looking toward the door. She turned, and saw a woman hurrying out with a young teen and a little girl with blond hair. “Can I tell you that for a fact? No. But I do have members who have seen their children tormented by other children for their religious affiliations. If any of them does have information, I hope that my words will help them see what is right,” Wilson said. “That’s kind of you,” she said. “No. That’s what my God dictates I do, Miss Hawkins.” He bowed to her slightly. “Good day, Miss Hawkins. I wish you Godspeed in your quest.” He walked away from her. Angela hurried out. She saw that the woman with the teen boy and small girl were getting into a car. She made a mental note of the plate number, hurried to her car and wrote down the number. Then she put a call through to Jake Mallory. Sam and Jackson had just stepped from the shop when Jackson paused to answer his phone. “It’s Will,” he said briefly to Sam. From where they stood, Sam could actually look over the heads of the crowds to see Will’s “magic” tent and the area before it where a number of people, young and old, in costume and not, were already gathering for the next performance. Will, inside the tent area, had his back to them as they talked. “Thanks,” Jackson said briefly. “What?” Sam asked. “The two boys—Joshua Abbott and David Yates—are there. Seated toward the back in a group that’s getting ready to watch the next show.” “Then we’ll watch, too,” Sam said. The boys were in football uniforms. They might have just left a practice, since their white-and-blue uniforms were grass stained. Sam and Jackson walked over to stand at the back of the crowd while Will turned around and welcomed his audience, challenging them to determine what was magic and what was science, and what lay in the magic of the mind. Quite a showman, Sam thought. Will’s act that day was all about light and music. He knew that the beat of the music caused some of the jumping of the light, but he was still amazed at Will’s ability at sleight of hand, because he was definitely maneuvering some of his performance so that he could keep an eye on the crowd’s reaction, but he was doing it with an amazing ability. He made the image of a brilliant fairy that seemed to be composed of colored light appear before one little girl, and when he closed his hand around it, he thrilled her by turning the image into a plastic toy and giving it to her. He repeated the performance, creating a small football and handing it to David Yates, and then creating a toy horned god—and presenting it to Joshua Abbott. Before Abbott could respond, Will hurried on, creating his finale—a large snow globe with a beautiful dancing fairy and presenting it to one of the young women sitting in the first row. He was greeted with thunderous applause, and those who had been sitting rose to move on, though some stayed, eager for the next show. Sam watched as the two boys in their football uniforms stood and walked toward Will. David Yates was angry. Joshua followed behind him. “Hey, hey you—what the hell was that all about?” David demanded of Will. Both boys moved in on him. Sam had the feeling that Will knew how to take care of himself, but he and Jackson seemed to decide simultaneously that it was time to step in. “What’s going on here?” Sam asked. David Yates swung around. Joshua Abbott backed away about half a foot—a telling gesture. On his own, Abbott would crack. David stared at Sam, knowing who he was. The boys were big, but Sam and Jackson were bigger by a few inches. He could see in the boy’s eyes the recognition that he wouldn’t intimidate either of these men. “This freak is playing with our minds. And you—you’re just ripping apart the community. You know who did it all!” David Yates told him. “You know who did it all, and you want to prove that you’re such a hotshot attorney, you can make someone innocent look guilty. He—this freak!” David paused to point at Will, who just grinned. “I’ll bet he’s one of you! He tried to pick on Josh last night just because he was wearing the horned god costume. Tons of people wear that costume and you know it! And now he’s handing him horned god toys, and if you don’t lay off of us, my father is going to come at you!” “Is he?” Sam asked. “Your father seems like a true law-abiding citizen. I think he’ll be more measured in his response than you’re being.” He looked at Joshua Abbott. “So why did you wear that costume last night? You had to know that we picked up Marty Keller trying to scare my colleague in the horned god costume from the school—and that it had Peter Andres’s blood on it.” Joshua Abbott looked at David and didn’t speak. “It’s just a costume that everybody wears around here!” David said. “You know what I think?” Sam said pleasantly. “Joshua, I think you wore that costume because David goaded you into it.” Joshua Abbott turned red. “No, uh, no! It was my choice. I wore it because I wanted to. Hey, the freak is in custody.” “Yes, and, of course, you know Milton Sedge is dead,” Jackson said quietly. Sam thought that the confusion that briefly touched David Yates’s face was real. “It was an accident!” he said. “He died in an accident!” “Maybe,” Sam said. “Maybe not,” Jackson added. “Ah, come on, what the hell is the matter with you guys? You’re wicked idiots!” David said. But he swallowed quickly. “You just want to make something out of nothing—’cause that kid is crazy. And he’s cruel.” “That’s right,” Sam said. “He gave you the ‘evil eye.’ You need him to be crazy—and a homicidal maniac—to make sure you never look like an imaginative young idiot yourself, for beating your own head with a lunch tray.” David Yates turned red. “He gave me the evil eye—I swear it! Hey, you don’t put yourself in the hospital and having to see a shrink on purpose!” “I never suggested that you did it on purpose—I do believe you did it to yourself. So does your dad,” Sam told him. “My dad is a pansy-ass!” David said, apparently before thinking. He winced. “Stop it, please, stop all this!” It was an honest plea. “I’ll stop—when you two stop lying,” Sam said. “I will get you in court. And if you’re caught perjuring yourselves, you will face the law yourselves. Think about that. And—” he grinned, looking up at Will, who had been watching the exchange with his arms folded over his chest “—next time a magician gives you something, just say thanks!” He turned to leave the boys to think over the encounter. Jackson followed him. “Well?” Sam asked him. “How did I do?” “They’re scared,” Jackson said. “They should be. I get the feeling that…all right, well, they are lying. Now, is it just because they want Malachi locked away? Or is it because they’re afraid for someone else?”","sourceLink":"https://allnovel.net/the-evil-inside-krewe-of-hunters-4/page-45.html","bookId":2278,"book":{"id":2278,"title":"The Evil Inside (Krewe of Hunters #4)","description":"Storyline: The Evil Inside (Krewe of Hunters #4) For as long as it has stood overlooking New England\u0027s jagged coastline, Lexington House has been the witness to madness...and murder. But in recent years the inexplicable malice that once tormented so many has lain as silent as its victims. Until now. A member of the nation\u0027s foremost paranormal forensic team, Jenna Duffy has made a career out of investigating the inexplicable. Yet nothing could prepare her for the string of slayings once again plaguing Lexington House, or for the chief suspect ? a boy barely old enough to drive, much less kill. With the young man\u0027s life on the line, Jenna must team up with attorney Samuel Hall to pinpoint who ? or what ? is taking the lives of those who get too close to the past. But everything they learn brings them closer to the forces of evil stalking this tortured ground.","cover":"https://allnovel.net/images/the-evil-inside-krewe-of-hunters-4.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-evil-inside-krewe-of-hunters-4.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:39:16 PM"}}
