{"id":31818,"no":1,"title":"Chapter 1","content":"Gentlemen of the Bunker Hill Monument Association: It is a matter of regret to me that other engagements have compelled my absence from your meetings the two years past, but your printed proceedings upon those occasions were full of interest and contributed material of importance to the student of Revolutionary literature. The Treasurer’s Report shows that the financial condition of the Association is good, although the erection of the new Lodge increases the expenses in much the same proportion that it adds to the comfort of visitors. The most pressing need of the Association is that of a larger permanent fund to improve the grounds and keep the buildings in proper and attractive condition. During the year ten members of our Association have passed away, and one of our Directors, Mr. Richard Devens. They were earnest, active citizens, proud of their heritage, and in their respective fields of work added to the well-being and moral strength of this community. We shall miss them from our membership, but to those who take their places we extend a cordial welcome, confident that the patriotic memories clustering round the 17th of June will inspire them to follow closely in the footsteps of their predecessors. The year’s panorama has unfolded a varied picture, with incidents both of encouragement and of warning. While it has not been a year of marked prosperity, and while accidents by flood and fire have caused terrible losses and suffering,[4] our country has pursued a peaceful and progressive course, and no complications of a dangerous nature have actively threatened. The settlement by arbitration of the Alaskan Question and the Venezuelan troubles is a matter for congratulation, irrespective of the terms of settlement. The assurance of the building of the Panama Canal is of the first importance, not only because it closes a vexed question, but for its effect in changing and opening up new avenues of trade and in knitting together different parts of this union of States. The final step in its accomplishment will probably always be subject to criticism and discussion, but rightful authority having settled the fact that the Canal is to be built, no one will question its desirability and usefulness. The most perplexing problems before the country are, as they have long been, those connected with the continual strife between capital and labor, and it is singular and not altogether encouraging that such conditions should exist and seemingly grow worse in a country affording boundless opportunity for both laboring man and capitalist and where the chances for progress and improvement are so great. One would think that here, if anywhere, justification was wanting for class feeling, for jealousies, or for violent breach of the laws. The constant succession of strikes retards progress, imperils business interests, and brings suffering and disaster to those concerned and to parties having no immediate connections with the strife. The growing strength of the labor unions would not be a subject of regret was it not too often accompanied by a dictatorial and narrow spirit infringing upon the rights of the individual man and frequently leading to public disorder and violation of law. As an educating force to its members the union is of value, and equally so as a protection for the just rights of labor, but its members should never forget that the public peace must be preserved[5] at all hazards, that no grievances can be enforced by violence, and that the rights of non-union men are just as sacred and inviolate as those of men who band themselves together for a common purpose. Liberty is a myth, and despotism usurps its place, unless the individual man may use his own judgment and work where and when he pleases for what he deems sufficient wage without violent interference by others; he may be persuaded, he may be influenced, but no man or body of men have the right to use force. Despotism is despotism, whether under forms of labor unions or capitalistic combinations, and a trust in labor may be just as oppressive and dangerous as a trust to restrict production, affect prices, or for any other purpose, even more so in its tendency to lead to open violence. The great public having no connection with particular combinations must always be considered, and it will not patiently submit to interruption of public traffic or to the lessening of its comforts or conveniences while jarring interests are settling their private quarrels. Public legislation should be impartial in the sense that it should be directed towards bettering conditions and repairing injustice to all classes of people, but none should be enacted except with the understanding that peace is always to be preserved and that the wrongs of special parties shall not be redressed at the expense of the rights of the community as a whole. Outside of our country it is not a cheering prospect that, despite Hague Conferences and all efforts to promote peace between nations, the opening years of this Twentieth Century witness a disastrous and bloody war between great empires of the West and East, and upon questions that seem to involve little else than extensions of territory at the expense of other nations. However sympathies may be divided between the two contending parties, we must all hope that the war may not be of long duration, and that the awful waste, sacrifice, and[6] slaughter may tend to discourage such barbarous methods and to spread the principles of peaceful arbitration. The military spirit prevailing everywhere, even in our own country, and the apotheosis of force, requiring such enormous military and naval appropriations, give food for thought, and in this connection we may well consider whether the alarming increase of crime, the lynchings at the South and West, and the disregard of law in many high quarters, are not the natural result of such a spirit. The Devil’s advocates are uncommonly busy, and if Christian preachers believe in the Gospel of Peace, they have a wide field for Christian work. He who talks of war as anything but a curse to a nation and a crime against humanity should remember these words of General Sherman, who knew what war was: “I confess without shame that I am tired and sick of the war. Its glory is all moonshine. Even success, the most brilliant, is over dead and mangled bodies, the anguish and lamentation of distant families appealing to me for missing sons, husbands, and fathers. It is only those who have not heard a shot, nor heard the shrieks and groans of the wounded and lacerated (friend or foe), that cry aloud for more blood, more vengeance, more desolation.” The Peace Conference, to be held in Boston in the Fall, is a hopeful sign; for this Republic above all others should stand for peace, and this Association and all patriotic societies which venerate the Founders of this Republic and believe that the principles they advocated lead to peace and amity between nations can contribute to the hastening of the time when armaments shall be reduced and the reign of peace in the world be brought nearer. To that end, in the short space of time allotted me to-day, I desire to call your attention to what our Fathers believed as illustrated by their own words, and I turn back by way of text to the interview I once before referred to, which our late member Judge Chamberlain narrated that he had with[7] Captain Preston, who fought at Lexington, and who, when over ninety years of age, could recall no reason for going into the fight other than that America had always governed herself and always meant to.","sourceLink":"http://novel.tingroom.com/duanpian/3287/89898.html","bookId":490,"book":{"id":490,"title":"The Declaration of Independence","description":"简介： It is a matter of regret to me that other engagements have compelled my absence from your meetings the two years past, but your printed proceedings upon those occasions were full of interest and contributed material of importance to the student of Re...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3287","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
