{"id":110255,"no":12,"title":"Page 12","content":"\"I can\u0027t believe you keep coming back,\" Dante told me when I showed up at his shop the next day. To no one\u0027s surprise, the place was empty.\\n\\n \"Me either,\" I admitted. I never felt welcome here, yet I didn\u0027t feel I had anywhere else to go. \"How do you stay in business?\"\\n\\n \"Beats me. I don\u0027t suppose you\u0027re here to give me the best night of my life? You missed your El Gaucho chance, though.\"\\n\\n \"I\u0027m here because I had another dream.\"\\n\\n \"You\u0027re using me, succubus.\" He sighed and sat down at the chintzy table. \"Okay. Give it to me.\"\\n\\n Settling down across from him, I recapped the latest dream events.\\n\\n \"Not really much in the way of new developments,\" he pointed out afterward. \"You got, like, thirty more seconds of plot.\"\\n\\n \"Does it mean anything?\"\\n\\n \"Hell if I know.\"\\n\\n I narrowed my eyes. \"You are the worst dream interpreter ever.\"\\n\\n \"Nah.\" He rested his chin in his hand, elbow propped on the table. His expression was typically lazy. \"I\u0027m a very good interpreter. There\u0027s nothing to interpret in your dream, though, unless it\u0027s just your subconscious lamenting your infertility. Which is likely. It also suggests you have bad taste in music. Is \u0027Sweet Home Alabama\u0027 really playing each time?\"\\n\\n Now I sighed.\\n\\n \"The dreams clearly aren\u0027t prophetic either since we know it\u0027s impossible for you to have a kid.\" He drummed his fingers on the table, face thoughtful. \"You sure you might not adopt or something?\"\\n\\n \"She was mine,\" I said firmly. \"My own flesh and blood. I could feel it.\"\\n\\n \"Okay. Far be it from me to argue delusional maternal instincts. But like I said, it doesn\u0027t really matter. The content, I mean. What matters here, I guess, is the energy loss.\"\\n\\n I could have hugged him. \"Finally, someone fucking thinks that\u0027s important.\"\\n\\n \"It\u0027s a pattern now. Can\u0027t really blame it on anomaly anymore.\"\\n\\n \"So what\u0027s it mean?\"\\n\\n \"You sure you want the opinion of the worst dream interpreter ever?\"\\n\\n \"Good grief! Get on with it.\"\\n\\n \"If you were human, I\u0027d say without a doubt that you were being preyed on.\"\\n\\n I flinched. \"What? What do you mean?\"\\n\\n He reached across the table and caught my hand, flipping it over absentmindedly while he thought. I was too caught on the word preyed to care about him touching me. Little Kayla\u0027s words popped into my head.\\n\\n They\u0027re monsters. They swoop in the air and go in people\u0027s dreams.\\n\\n \"You and I both know there are plenty of supernatural beings walking the world. Some walk the dreamworld and don\u0027t really have humans\u0027 best intentions at heart. Not that you do either. And honestly, some aren\u0027t too different from you. They crave human life and energy, and they can suck it out of dreams.\"\\n\\n \"But they can\u0027t do that to me?\"\\n\\n \"Mmm.\" He let go of my hand. \"I don\u0027t see how. You don\u0027t make your own energy. You steal it too. But who knows?\"\\n\\n I shivered. The idea of some creature - some parasitic creature - latching on and sucking out my life made me ill. I was fully aware of the hypocrisy, however, seeing as I did the exact same thing all the time.\\n\\n \"So...what kind of creature might be capable of doing that?\"\\n\\n \"Dunno. Not my specialty.\"\\n\\n \"But you\u0027re a dream expert! Shouldn\u0027t you know about dream...creatures?\"\\n\\n \"Supernatural creatures are Erik\u0027s thing, not mine. You should ask him.\"\\n\\n \"You\u0027re the worst dream interpreter ever.\"\\n\\n \"So I hear.\" His earlier seriousness flitted away. \"So...are we going to have sex now?\"\\n\\n I stood up. \"No! Of course not.\"\\n\\n Dante threw his hands up. \"What more do you want? I actually gave you useful information this time. And it\u0027s not like you couldn\u0027t use the fix - small or no.\"\\n\\n \"It\u0027s more than that,\" I said. Suddenly, I hesitated. \"I...I know you now.\"\\n\\n \"What\u0027s that supposed to mean?\"\\n\\n \"If you were some anonymous guy, there might be a chance. But now you\u0027re like a...\" Friend wasn\u0027t quite the word I was looking for. \"...an acquaintance.\"\\n\\n He appeared genuinely baffled for once. It was almost amusing. \"I\u0027m really not following this, succubus.\"\\n\\n \"I\u0027ve got a boyfriend, remember? When I have anonymous, casual sex, it\u0027s not really cheating. But if I do it with someone...\"\\n\\n \"...you like?\" Was it my imagination, or was there something hopeful in his eyes when he asked that?\\n\\n \"No, I don\u0027t think I like you. But I don\u0027t exactly dislike you either. The point is, you aren\u0027t anonymous. It would be cheating.\"\\n\\n He stared at me for several moments, and whatever glimmer of hope I thought I\u0027d seen was definitely gone. \"No wonder succubi are so good at passing as human women. You\u0027ve certainly got the head games and complete lack of rationality down.\"\\n\\n \"I\u0027ve got to go.\"\\n\\n \"You always have to go. Where to now? Some anonymous guy?\"\\n\\n I rose. \"No, I\u0027m going to find Erik and see if he can actually give me useful information.\"\\n\\n \"I did give you useful information!\"\\n\\n \"Debatable.\"\\n\\n \"Well, let me lock up, and we\u0027ll see what Lancaster has to say.\"\\n\\n I froze. \"What do you mean \u0027we\u0027?\"\\n\\n Dante grabbed some keys from behind the counter. \"You\u0027ve piqued my curiosity. I want to see how this turns out. Besides, you owe me for my help, seeing as you won\u0027t put out.\"\\n\\n \"\u0027Help,\u0027 indeed,\" I muttered.\\n\\n He walked to the door with me. \"Did it ever occur to you that in spite of how unuseful you think I am, I\u0027m still kind of concerned about what happens to you?\"\\n\\n \"No,\" I said. \"It actually hadn\u0027t.\"\\n\\n But I let him go with me over to Arcana, Ltd. When we stepped inside, we found Erik unpacking a box of books. He smiled without looking up, having sensed me.\\n\\n \"Miss Kincaid, always a - \" He stopped when he noticed Dante. For the first time in our friendship, I saw Erik look angry. It was disturbing. Frightening, even. \"Mr. Moriarty.\"\\n\\n Dante nodded his greeting. \"Always nice to see you.\"\\n\\n The expression on Erik\u0027s face showed the feelings weren\u0027t mutual. He straightened up from his work and walked over to the counter. Crossing his arms over his chest, he peered at both of us.\\n\\n \"What can I do for you?\" No cordial host or tea chats today. The air between the two men suddenly felt thick and oppressive.\\n\\n I spoke uncertainly. \"We...that is, Dante thinks he has an answer to my dream problems.\"\\n\\n Dante laughed, wearing his trademark smirk. If he bore Erik the same animosity, he was hiding it well. \"I wouldn\u0027t call it an answer, succubus. More like a theory.\"\\n\\n \"I\u0027ve had the dream again,\" I told Erik. \"More than once now. And I still keep losing my energy. Dante says it could be some kind of...dream creature preying on me.\" I stumbled over the words. The concept was still too ludicrous. \"But he didn\u0027t know what kind. He said you might know.\"\\n\\n Erik shifted his eyes from Dante to me. I could tell the old man was still unhappy about us being there together, but he cared about me too much and couldn\u0027t stop himself from helping me. I wondered at what point over the years I had earned such regard. And how. He sighed and gestured us to the table. We all sat down, but no tea was offered.\\n\\n \"Something like that going after a succubus is hard to imagine,\" Erik said at last.\\n\\n \"That\u0027s what I thought,\" said Dante.\\n\\n His lighthearted mask had slipped a little. He looked much as he had in the store, thoughtful and curious. He reminded me of a mechanical engineer I\u0027d once known. The guy couldn\u0027t help himself when it came to fixing some technical problem. Give him something in pieces, and he had to analyze it and figure it out. Dante might give me a hard time, but his nature, corrupt or not, couldn\u0027t stay away from this.\\n\\n Erik\u0027s eyes studied me, hard and intent. I was an intriguing puzzle for him too.\\n\\n \"If I had to pick...I\u0027d say the symptoms most match Oneroi.\"\\n\\n I\u0027d heard of them. They\u0027d been in the Greek myths I\u0027d grown up with. \"Dream spirits?\"\\n\\n Dante considered. \"More than spirits. They\u0027re the children of Nyx and Erebus.\"\\n\\n I shuddered. I\u0027d heard of them too. Nyx and Erebus. Night and Darkness. Primordial entities of chaos. They were powerful and dangerous. The world had been born of chaos, true, but it was also a fact - even science agreed - that the universe was always trying to move back toward chaos. Nyx and Erebus were destructive - so much so that they were now locked away, lest they tear the world apart. The possibility that their children could be sucking away my life made me feel sick again.\\n\\n Dante was still turning this theory over in his head. \"Yeah, that\u0027d be the closest. But they still don\u0027t match one hundred percent.\"\\n\\n \"Nothing does,\" admitted Erik. \"I\u0027ve never heard of anything attacking a succubus.\"\\n\\n \"What do Oneroi do exactly?\" I asked.\\n\\n The two men exchanged glances, each waiting for the other to explain. Erik was the one who stepped up.\\n\\n \"They visit mortals in their dreams and feed off the emotions such dreams stir up. Victims of Oneroi wake up drained and sick.\" More irony. Legend said that succubi visited men in their dreams too and took their life.\\n\\n \"That\u0027s what\u0027s happening to me,\" I argued. \"Why couldn\u0027t it be them?\"\\n\\n \"It could be them,\" agreed Dante, \"but like we said, the details don\u0027t fit. Oneroi can seize control and shape what you dream. But the dreams they stir up are usually nightmares. Fear and other dark emotions tend to be more intense - they offer more for the Oneroi to feed off of. Your dreams are short, and they\u0027re...fluffy.\"\\n\\n \"Fluffy?\"\\n\\n \"Well, I don\u0027t know. Not nightmares. They\u0027re intriguing to you. They bring out emotions - fascinated, happy emotions. They\u0027re giving you visceral reactions, I suppose, but not the type that the Oneroi usually go after.\"\\n\\n \"And,\" continued Erik, \"there\u0027s also the fact that you aren\u0027t an ideal choice for them. You\u0027re inefficient. You\u0027re a conduit, a link to the mortal world and their energy. If Oneroi are stealing from you, they have to wait for you to get your power from someone else first. Far simpler for them to take directly from a human.\"\\n\\n I suddenly realized I\u0027d forgotten something. \"One other weird thing happened...more than the energy loss...\" I explained about waking up feeling cold and wet.\\n\\n \"I guess that\u0027s kind of weird,\" said Dante, \"but I don\u0027t know that it\u0027s really related to this.\"\\n\\n \"Well, except later that day, I read this article about a guy who went crazy and tried to swim across the Sound. He thought it would help his family - and it did because he drowned and they got his insurance money. When I read the article, the wet and cold feeling came back. It was like...for a second, I was him. I felt exactly what he\u0027d felt. Like I was drowning too.\"\\n\\n \"Empathy,\" said Dante. \"You read it and imagined what it must be like.\"\\n\\n \"No.\" I frowned, trying to bring the feeling back. \"I...I felt him. I knew it was him I was feeling. That guy. The same way I knew the girl was my daughter. It was in my gut.\"\\n\\n Dante looked annoyed. \"Would have been helpful to know this earlier.\"\\n\\n \"I forgot. I didn\u0027t really see it as relevant until now.\"\\n\\n \"Have you ever had anything like this happen before? Knowledge of something you didn\u0027t experience?\"\\n\\n \"I don\u0027t think so.\"\\n\\n Erik glanced at Dante. \"Clairvoyance?\"\\n\\n \"I don\u0027t know. Unlikely. Too many variables. None of them mesh.\" Dante turned his gaze back on me. \"Have you talked to your own people about this?\"\\n\\n I shook my head. \"Jerome\u0027s been gone. I mentioned the first dream before he left, but he didn\u0027t seem very concerned.\"\\n\\n \"Well, I don\u0027t know what to make of it,\" Dante said.\\n\\n \"Nor I,\" said Erik kindly. \"But I will look into this for you.\"\\n\\n \"Thanks,\" I told him. \"I really appreciate it.\"\\n\\n We stood up, and like that, the momentary truce between Erik and Dante vanished. Erik looked stormy once more. Dante appeared smug and condescending.\\n\\n \"Miss Kincaid,\" Erik began stiffly. \"You know I have nothing but the highest regard for you, and I am more than happy to assist you in any way you need. I also recognize that Mr. Moriarty can also offer you help. But I would prefer it if...\"\\n\\n \"...if you don\u0027t bring me around anymore,\" finished Dante. He saluted. \"Noted, old man. Meet you at the car, succubus.\" He turned and walked out of the shop.\\n\\n Erik\u0027s mood didn\u0027t vanish with Dante\u0027s departure. I could still sense the fury radiating from him. Erik had said Dante was corrupt, but really, so was I. Erik didn\u0027t have this kind of reaction around me. There was something I was missing here.\\n\\n \"I\u0027m sorry,\" I told Erik. \"I didn\u0027t know it would bother you so much.\"\\n\\n \"You couldn\u0027t have known,\" he replied wearily. \"And after all, I was the one who directed you to him.\"\\n\\n \"I\u0027ll keep him away,\" I promised.\\n\\n I thanked him again and went out to meet Dante. He leaned against my car, his thoughts obscured by a lazy smile.\\n\\n \"Why does Erik hate you so much?\" I asked.\\n\\n Dante glanced down at me. \"Because I\u0027m a bad man who does bad things.\"\\n\\n \"There\u0027s more to it than that,\" I said. \"And you don\u0027t seem that bad. The worst things you\u0027ve done are trick customers and offer useless information. Although...well, you actually were pretty helpful just now. But like I said, I don\u0027t think you\u0027re as bad as your reputation implies.\"\\n\\n \"How would you know?\"\\n\\n I shrugged. \"Instinct.\"\\n\\n In one swift motion, Dante snaked his hand behind my neck and pulled me to him. I put a hand on his chest and started to push him away and then stopped. There was a warmth in his body, the eagerness of a man who\u0027d been deprived of something for a very long time. To my surprise, I felt arousal burning in me - a yearning of my own to touch someone who wasn\u0027t all business. I experienced that feeling a lot, and it usually got me into trouble. My succubus nature woke up, wondering if energy might be on its way.\\n\\n And despite my lofty talk earlier about not sleeping with people I was acquainted with, I suddenly wanted him to kiss me. I wanted his energy - just a taste.\\n\\n His mouth moved toward mine. I started to close my eyes and part my lips - then, abruptly, he stiffened. Releasing me, he stepped back. I opened my eyes, staring in astonishment.\\n\\n \"What the hell?\" I asked. \"You backed off. And after all the grief you\u0027ve given me about sleeping with you.\"\\n\\n \"You\u0027re drained and hungry, succubus,\" he said. \"It\u0027d be like taking advantage of a drunk girl.\"\\n\\n \"Right. And you\u0027ve never done anything like that.\"\\n\\n \"Yeah, well, I\u0027m not eighteen anymore.\" He opened the car door. \"Are we going or not?\"\\n\\n I studied him a bit longer, thinking again I saw that hope and compassion from earlier. I was starting to wonder if a lot of his cattiness was just bravado, hiding the same insecurities everyone in the world had. I kept my psychoanalysis to myself, however, and joined him in the car. We drove back to his shop, our usual flippant banter obscuring anything serious that might have happened. \\n\\n","sourceLink":"https://allnovel.net/succubus-dreams-georgina-kincaid-3/page-12.html","bookId":2056,"book":{"id":2056,"title":"Succubus Dreams (Georgina Kincaid #3)","description":"Storyline: Georgina Kincaid Book 3: Succubus Dreams \\n especially when the girl in question is Georgina Kincaid, a shape-shifting succubus who gets her energy from seducing men. First there\u0027s her relationship with gorgeous bestselling writer Seth Mortensen, which is unsatisfying on a number of levels. It\u0027s not just that they can\u0027t have sex in case Georgina inadvertently kills him (generally a turn-off for most guys). Lately, even spending time together is a challenge. Seth\u0027s obsessed with finishing his latest novel, and Georgina\u0027s under demonic orders to mentor the new (and surprisingly inept) succubus on the block.\\n","cover":"https://allnovel.net/images/succubus-dreams-georgina-kincaid-3.jpg","author":"Richelle Mead","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/succubus-dreams-georgina-kincaid-3.html","creation":"Oct 5, 2019 8:58:18 AM","modification":"Oct 5, 2019 11:55:35 PM"}}
