{"id":110246,"no":3,"title":"Page 3","content":"After a good night\u0027s sleep, I went to work the next morning, feeling a bit more optimistic about life. I decided Tawny had probably already scored last night, and Niphon was on his way to the airport. Plus, I\u0027d get to see Seth soon since he had made my place of employment, Emerald City Books \u0026 Caf¨¦, his writing headquarters. Yes, it wouldn\u0027t be such a bad day.\\n\\n Due to my ex-manager\u0027s complicated pregnancy, I\u0027d recently inherited her position. This had left my old assistant-manager position vacant, and we\u0027d ended up hiring Maddie Sato who just happened to be the sister of Doug Sato - the other assistant manager. It had been a stunning display of favoritism, and Doug had thrown a fit, complaining how we\u0027d just lowered his coolness rating by ten points. As it was, Maddie already lived with him. She\u0027d come to visit after his recent hospitalization and never really left. She had a second job as a freelance writer at a feminist magazine, and working at Emerald City gave her a more stable source of income.\\n\\n I liked Maddie. She was smart and capable and had a twisted sense of humor that spoke to mine. She worked well with customers and was always very polite in a professional capacity. For example, she could get caught up talking with Seth about \u0027writerly\u0027 topics and function beautifully. But, when it came to friendlier and more interpersonal stuff, her social skills were a bit lacking. After a particularly analytical writing discussion, Seth had once made an off-hand comment about her childhood, and she\u0027d frozen up. Seeing him with someone even more socially awkward than he was had been amusing, but mostly I\u0027d felt disappointed at her relapse. I\u0027d made good progress in getting her to come out of her shell and knew how fun she could be. I wanted everyone else to see it too.\\n\\n Today I found her upstairs in the caf¨¦, sitting at the table Seth had staked out with his laptop. It apparently wasn\u0027t a writerly day because Doug sat with them. He and Maddie appeared to be in some sort of heated argument. Seth sat between them, looking like he desperately wanted to be somewhere else. Catching my eye, he gave me a pleading look. I purposely slid a chair up beside him, forcing Doug to scoot his own chair over. No one knew Seth and I were dating, and the Sato siblings were so caught up in the discussion they didn\u0027t think anything of the chair placement.\\n\\n \"What\u0027s going on?\" I asked. \"It had better involve the fate of the store to be detaining the entire management team.\" The holidays were nearly upon us, and business was insane lately.\\n\\n Maddie had the grace to look embarrassed, suddenly remembering her duties. She opened her mouth to speak, but Doug interrupted her.\\n\\n \"My illustrious sister\u0027s an insensitive bitch.\"\\n\\n Maddie rolled her eyes. \"He has some crazy ideas about Beth.\"\\n\\n I sighed. \"Look, if this is about the time Beth wore leg warmers here - \"\\n\\n \"Don\u0027t remind me of that,\" grumbled Doug.\\n\\n \"My illustrious brother has this crazy idea that Beth just broke up with someone,\" explained Maddie.\\n\\n Both looked at me as though they expected me to set this matter straight. Puzzled, I glanced back and forth between them.\\n\\n \"Why\u0027s that crazy?\"\\n\\n \"Because she has a cold,\" said Maddie. \"She said she has a cold. That\u0027s why she\u0027s sniffling.\"\\n\\n \"She\u0027s pretending to have a cold,\" cried Doug. \"What kind of sick and twisted world is this when an asshole like me is the one to notice heartache in the masses? For God\u0027s sake, her eyes are all red.\"\\n\\n \"Cold,\" Maddie repeated firmly. She considered. \"Or maybe allergies.\"\\n\\n \"In December?\"\\n\\n The two of them bickered on. Beside me, Seth fought - and failed - to keep a straight face. I studied the way his lips curved into a smile, liking their shape and recalling how they felt. I turned my attention back to the siblings, enjoying the show. Finally, after about five more minutes, I remembered I was an authority figure and not a slacker employee.\\n\\n \"Why is this a big deal?\" I asked.\\n\\n \"Because she\u0027s wrong,\" Doug said. \"I\u0027m just trying to prove that.\"\\n\\n Maddie sighed. \"You\u0027re like a twelve-year-old.\"\\n\\n \"Am not.\" He jabbed her in the arm.\\n\\n \"Okay, enough.\" I pointed to Doug. \"You, register.\" I pointed to Maddie. \"You, my office.\"\\n\\n \"Ooh...you\u0027re in trouble,\" Doug told her.\\n\\n \"I\u0027m going to show her how to process orders,\" I growled.\\n\\n Maddie\u0027s eyes gleamed with anticipation, dimples appearing in her round cheeks. She ate up new tasks.\\n\\n \"Female favoritism,\" said Doug. \"You like her better than me, don\u0027t you? It\u0027s okay. You can tell me. I can take it.\"\\n\\n \"Go. Both of you. I\u0027ll be down in a sec.\"\\n\\n I looked at Seth when they were gone. \"This is why I don\u0027t have children,\" I told him. That wasn\u0027t true, of course. Not true at all. Children simply weren\u0027t in the cards for succubi.\\n\\n \"Although...I think Doug\u0027s actually right,\" I mused. \"As crazy as that is. I saw Beth on my way in.\"\\n\\n Seth smiled. \"Maddie\u0027s a good writer and super smart, but she\u0027s kind of oblivious to other people.\"\\n\\n I gave him a wry look. \"I thought that was true about all writers.\"\\n\\n \"Some are worse than others.\"\\n\\n \"Shocking. You rode in a car with her for, what, four hours? What\u0027d you guys talk about?\"\\n\\n \"Writing.\"\\n\\n I sighed. \"I wish she\u0027d relax around people other than Doug and me. She\u0027s hilarious. She came up with the idea to Silly String Doug\u0027s car after he said Betty Friedan was PMSing when she wrote The Feminine Mystique.\"\\n\\n \"I\u0027m not sure I\u0027d describe that as \u0027hilarious\u0027 so much as \u0027scary.\u0027 Besides, that was your idea,\" he reminded me. \"You two are dangerous. Your whole soul-stealing act seems kind of softcore compared to the stuff you and Maddie concoct.\"\\n\\n I grinned. It was true. I hadn\u0027t really hung out with a lot of women in the last century or so and was discovering I\u0027d been missing out. \"You have no idea. Social awkwardness or not, she\u0027s the best thing that\u0027s happened to me in a while.\"\\n\\n \"Oh?\"\\n\\n \"Well, present company excluded of course.\"\\n\\n \"Sure. Whatever you say.\"\\n\\n \"Hey.\" I almost grabbed his hand, then remembered we were in public. \"There\u0027s no competition. You\u0027re a better cook. And a better kisser.\"\\n\\n \"I didn\u0027t realize you\u0027d tried her out.\"\\n\\n \"Well, you know how much I like writers.\"\\n\\n My smile slipped a little as my mind switched subjects. I\u0027d been thinking about my energy loss all morning, particularly since I\u0027d probably be seeking my hit tonight or tomorrow. Jerome had blown the matter off, but like usual, I couldn\u0027t let it go. I decided then that I\u0027d go visit my friend Erik Lancaster, Seattle\u0027s local mortal source of occult knowledge. He seemed to know more than my cronies half the time.\\n\\n I extended the invitation to Seth, and he agreed to come with me. I was glad. I had often thought it might do him some good to talk to another human who regularly dealt with the supernatural. This was as good of a time as any.\\n\\n Seth met me at my place after work, and we microwaved a quick dinner before heading out. As we walked down the stairs of my building, he teased me about Maddie again.\\n\\n \"You guys were working in the office a while. Sure you weren\u0027t making out?\"\\n\\n \"Not too much,\" I assured him.\\n\\n He laughed and caught hold of my hand. I jerked him toward me. Our lips met in a kiss, and as the warmth of his body stirred mine, I had no doubts about what the best thing in my life was. After a few sweet moments, we followed the drill and separated, our reluctance making the disentanglement a bit awkward in execution.\\n\\n \"Yeah,\" I told him. \"She\u0027s definitely not as good a kisser as - \"\\n\\n I cut myself off, grimacing as I felt Niphon coming toward us. His immortal aura felt slimy and musky. I stepped farther away from Seth and glared down the sidewalk at the approaching imp. Seeing me, he waved a hand in greeting.\\n\\n \"Excuse me a moment,\" I muttered. I skipped down the steps and blocked Niphon from getting within earshot of Seth. \"What do you want?\"\\n\\n \"Attitude, attitude, Letha,\" he tsked. \"Succubi should be charming and cordial at all times.\" He peered beyond me. \"Is that the human boyfriend? Can I meet him?\"\\n\\n \"You can go the fuck away. You\u0027re supposed to be keeping an eye on Tawny.\"\\n\\n \"I have been,\" he said cheerfully. \"That\u0027s why I came to see you. I followed her last night. She was quite confident in her abilities but had some difficulty arranging an assignation in the end. Poor thing. It seems she may take longer than suspected in getting established. Fortunately, I\u0027ll stay with her until the end.\"\\n\\n His mocking concern dug into me, just as he\u0027d intended. \"Is that all you came to tell me? Because I\u0027m leaving now. I\u0027ve got to be somewhere.\"\\n\\n \"Of course, of course,\" he simpered. He gestured vaguely in Seth\u0027s direction. \"I didn\u0027t mean to interrupt your heated moment, even if it looked like it was about to cool down.\" A sudden look of realization crossed his face. \"You don\u0027t sleep with him, do you? You\u0027ve got some sort of noble sense of duty about absorbing his life. That poor, poor man.\" Niphon laughed. \"Oh, Letha. You are one of the most fascinating creatures I\u0027ve ever come across.\"\\n\\n I turned my back on him and stormed up to Seth. \"Come on, we\u0027re leaving.\"\\n\\n \"Who was that?\" he asked as we walked away.\\n\\n \"He\u0027s an imp. And an asshole.\"\\n\\n Even almost a block away, I could still just barely catch Niphon\u0027s taunting laughter. I tried to ignore it as Seth and I walked to his car. Listening to my friends tease me about Seth was annoying enough. From Niphon, it was unbearable. Fortunately, I calmed down by the time Seth and I got on the road. I instead focused on seeing Erik and hopefully getting my mystery solved.\\n\\n Erik ran a store up in Lake City called Arcana, Ltd. Unfortunately placed in a strip mall, it nonetheless possessed a warm, cozy feel. Dim lighting shed a tranquil air, and the bubbling of small fountains mingled with the soft sounds of a CD player emitting harp music. Books, jewelry, candles, and statuary cluttered up every inch of free space. The sweet scent of nag champa hung in the air.\\n\\n \"Neat,\" said Seth, peering around as we entered.\\n\\n Erik glanced up from where he was kneeling behind a stack of books. He\u0027d grown a mustache since last I saw him, and I liked the way the gray hair stood out against his dark brown skin. A gentle smile bloomed on his face.\\n\\n \"Miss Kincaid, what an unexpected pleasure. And you have a friend.\" He rose and walked to us, extending his hand toward Seth.\\n\\n \"Erik, this is Seth Mortensen. Seth, Erik.\"\\n\\n They shook. \"A pleasure, Mr. Mortensen. You keep good company.\"\\n\\n \"Yes,\" said Seth, smiling in return. \"I do.\"\\n\\n \"If we\u0027re lucky,\" I said silkily, \"Erik will have time for tea. He only serves decaf, so that should make you happy.\"\\n\\n \"Of course I have time,\" said Erik. \"I doubt there\u0027s any man who doesn\u0027t have time for you, Miss Kincaid.\"\\n\\n I shot Seth a teasing look when Erik left to put the tea on. \"Ah, now there\u0027s someone who appreciates me. You wouldn\u0027t see him shirking me for a book.\"\\n\\n \"If memory serves, you worship those books. Besides, how else am I supposed to keep you in the lifestyle you\u0027re accustomed to?\"\\n\\n \"If memory serves, I paid the last time we went out.\"\\n\\n \"Well, yeah. I was just letting you play liberated so that you and Maddie wouldn\u0027t go vandalize my car.\"\\n\\n When our tea party commenced around Erik\u0027s small corner table, I was surprised to hear Seth engage Erik in conversation on what it meant to be a mortal among immortals. Seth wasn\u0027t usually so forthcoming, and I wondered just how much immortal weirdness troubled him.\\n\\n \"It puts my sense of time awry,\" remarked Erik. \"I see people like Miss Kincaid who stay young and beautiful forever. It makes me feel as though no time has passed. Then I look at myself and see the new wrinkles. I feel the aches in my bones. I realize I will be left behind...they will go on and continue to shape the world without me.\" He sighed, more with bemusement than sadness. \"I wish I could see what will happen next.\"\\n\\n \"Yes,\" Seth said, surprising me. His eyes looked dark and solemn. \"I know what you mean.\"\\n\\n I glanced over at him, seeing something I\u0027d never noticed before. I knew he must think about the future and his own death - all mortals did - but only now did I realize how much he really thought about those things. Looking at both men, I remembered they would eventually die, and it made something in my chest grow cold. For the space of a heartbeat, I could almost see Seth as wrinkled and gray-haired as Erik.\\n\\n \"Morbid much, you guys?\" I asked, trying to affect a blas¨¦ air. \"I didn\u0027t come here to bring everyone down. I\u0027ve got to pick Erik\u0027s brain.\"\\n\\n \"Pick away,\" he said.\\n\\n \"Well...you know how I need, uh, life and energy to survive, right?\" An idiotic statement. Of course he knew. \"Yesterday morning, I woke up, and my entire stash was gone.\"\\n\\n Erik considered. \"That\u0027s normal, isn\u0027t it? It fades over time.\"\\n\\n \"Not this quickly. Especially since...\" I stopped, suddenly realizing having Seth here might not have been so wise after all. \"I, um, had just gotten a refill the night before.\"\\n\\n Both men kept neutral expressions. \"And you did nothing out of the ordinary?\"\\n\\n \"No, Jerome thinks it was mental stress.\" I shrugged. \"I don\u0027t think I was that stressed. I dreamed...a weird dream...but nothing stressful.\"\\n\\n \"Dreams are powerful,\" Erik said. \"And sometimes stress can take more out of us than we realize. Unfortunately, I know little about dreams, but...\" He frowned, and his gaze suddenly turned inward.\\n\\n \"But what?\"\\n\\n \"I know someone who might be able to help. Someone who specializes in dreams.\"\\n\\n \"Who?\" This sounded promising.\\n\\n Erik took a long time in answering. When he spoke, he seemed unhappy to give up the words. \"Someone who might as well be signed and sealed to your side. His name\u0027s Dante Moriarty.\"\\n\\n I snickered. \"That can\u0027t be his real name.\"\\n\\n \"It\u0027s not, though I\u0027m sure some of your imp and demon friends would know him by any name. He\u0027s a con artist...among other things. Considers himself a magician too.\"\\n\\n \"I deal with corrupt people all the time,\" I pointed out. \"Doesn\u0027t bother me much.\"\\n\\n \"True,\" agreed Erik. He still looked troubled, which I found puzzling. Although not evil himself, he interacted with me and others of my ilk on a regular basis without blinking. I wondered what it was about one human that would bother him so much. \"I\u0027ll get you his contact information.\"\\n\\n He sought out Dante\u0027s card, and I browsed around the store while Seth used the bathroom in the back. The old storekeeper handed me the card when he found it.\\n\\n \"I like Mr. Mortensen a great deal.\"\\n\\n \"Yeah. So do I.\"\\n\\n \"I know. I can tell.\"\\n\\n I looked up from a display of bracelets, waiting for more.\\n\\n \"You talk and move around each other in a way you\u0027re probably not even aware of. It\u0027s like how lovers usually interact...but it\u0027s something more too. You have a continual sense of each other, I think, even when not together. There\u0027s a burning in the air between you.\"\\n\\n I didn\u0027t know what to say to that. It sounded nice - but a little intimidating too.\\n\\n \"I\u0027ve never met another of your kind who\u0027s exactly like you, Miss Kincaid.\" He hesitated, his normally wise-and-competent expression flickering into uncertainty. It was a rare look for him. \"I don\u0027t know how this will turn out.\"\\n\\n Seth emerged then, picking up that he\u0027d interrupted something. He glanced between the two of us, and I rested a reassuring hand on his arm. \"You about ready to go?\"\\n\\n \"Sure.\"\\n\\n I scanned the rest of the jewelry counter, only half-noticing the contents. Suddenly, I did a double-take and leaned over one of the cases. \"Erik, where do you find this stuff?\"\\n\\n He and Seth looked over my shoulder.\\n\\n \"Ah, yes,\" said Erik. \"The Byzantine rings. By the same artist who made your ankh necklace.\"\\n\\n \"Your artist has a real knack for historical detail. They look just like the originals.\"\\n\\n He walked around the counter and lifted out the tray with the rings. I picked one up. It was an ordinary gold band. Rather than any sort of mounted gem on top, it bore a smooth and flat disc, almost the size of a dime. Greek letters were engraved into the metal.\\n\\n \"What do they mean?\" asked Seth.\\n\\n I tried to explain the long-lost custom. \"It\u0027s a benediction. Like a prayer for the couple. This would have been a wedding ring.\"\\n\\n I examined another depicting Christ and the Virgin; still another showed a tiny man and woman facing each other.\\n\\n \"I used to have a ring almost like this,\" I said softly, turning it over in my hands. Neither man said anything, and I finally returned it to its tray.\\n\\n On the way home, Seth gently asked, \"What happened to your ring?\"\\n\\n I stared out the window. \"It\u0027s not important.\"\\n\\n \"Tell me.\"\\n\\n I didn\u0027t respond, and he didn\u0027t ask me again. When we got back to my place, I saw no sign of Vincent and figured he was out investigating with Charlie\u0027s Angels. Newspapers were scattered across my kitchen table; he apparently liked to keep up on current events. Morbid events, at that. One of the headlines was a story I\u0027d heard the other day about a crazy man who\u0027d killed his wife after having a vision of seeing her with another man. Mortals did creepy things sometimes. Okay, a lot of the time.\\n\\n Seth sat on my couch and leaned forward, hands clasped together. I\u0027d sensed his mood shift when I wouldn\u0027t answer in the car.\\n\\n \"Thetis...\"\\n\\n \"You want to know about the ring.\"\\n\\n \"The ring doesn\u0027t matter so much. It\u0027s just...well, I\u0027ve seen you get like this. Something bugs you, something you remember. But you won\u0027t talk to me about it. There are days I feel like you don\u0027t tell me anything.\"\\n\\n I sat down next to him, avoiding eye contact in a way he often did. \"I tell you plenty.\"\\n\\n \"Not about your past.\"\\n\\n \"I have a lot of past, and I talk about it all the time.\"\\n\\n \"Yeah...I guess.\" He absentmindedly stroked my arm. \"But you don\u0027t talk about your mortal past. Before you were a succubus.\"\\n\\n \"So? Does it make a difference? You\u0027re with me now. You know the kind of person I am now.\"\\n\\n \"I do. And I love that person. And I want to know what\u0027s important to you. What made you who you are. I want to know what hurts you so that I can help.\"\\n\\n \"You don\u0027t need to know that to know who I am. My human past doesn\u0027t enter in to anything,\" I said stiffly.\\n\\n \"I can\u0027t believe that.\"\\n\\n Again, I didn\u0027t answer.\\n\\n \"I don\u0027t know anything about that part of your life,\" he continued. \"I don\u0027t know your real name. What you really look like. Where you grew up. I don\u0027t even know how old you are.\"\\n\\n \"Hey, it\u0027s not just me. You have plenty of things you don\u0027t talk about,\" I pointed out, trying to deflect the attention.\\n\\n \"What do you want to know?\"\\n\\n \"Well...\" I groped for something I didn\u0027t know much about. \"You never talk about your dad. How he died.\"\\n\\n Seth answered immediately, without hesitation. \"Not much to tell. Cancer. I was thirteen. According to a therapist Mom made us see, I withdrew into a world of fantasy to cope.\"\\n\\n I leaned my head against his shoulder, knowing he\u0027d expound on anything I wanted to know - in a subdued, Seth sort of way. It was ironic considering his normal conversational reticence, but that was how he operated. He believed relationships had to have an open exchange of honesty and baring of souls. I supposed he was right, but there were too many dark parts of my soul I didn\u0027t want to share. Parts I was afraid would scare him off.\\n\\n I knew Seth well enough to realize he wouldn\u0027t push this issue anymore tonight, but I could also sense his hurt and disappointment. He didn\u0027t ask me these questions to upset me; he did it out of sincere affection. That didn\u0027t make it easier, unfortunately, and I fought my anxiety and long-buried pain to try to offer him something. Anything. Anything to show I was making an effort in this relationship. My original face and name were dead to me, obsolete reminders of the woman I\u0027d left behind, never mind Niphon\u0027s insistence on calling me Letha. Seth would never know those things.\\n\\n We sat together for a long time while I decided what I could give up. Finally, with the words sticking in my mouth, I said, \"I grew up in Cyprus.\" The air grew tense as we both waited for more. \"In the early fifth century. I don\u0027t know exactly what year I was born. We didn\u0027t really keep track of those things.\"\\n\\n He exhaled. I hadn\u0027t realized he\u0027d been holding his breath. Slowly, carefully, he put an arm around me and pressed his lips against my hair. \"Thank you.\"\\n\\n I buried my face against his shoulder, not knowing what I hid from. I\u0027d barely given him anything - just a couple of pieces of trivia. Nonetheless, yielding that tiny bit from a place in me I wanted to hide from was powerful. I felt exposed and vulnerable without fully understanding why. Seth gently stroked my hair.\\n\\n \"Is the ring from around that time?\" he asked.\\n\\n I nodded against him.\\n\\n \"It\u0027d be worth a lot then, I suppose.\"\\n\\n \"I lost it,\" I whispered.\\n\\n He must have picked up on the anguish in my voice. He held me tighter. \"I\u0027m sorry.\"\\n\\n We stayed together a while longer that night, but I knew he wanted to go home and work at his own place. Unable to deny him, I shooed him away, though I had a feeling that he would have stayed if I\u0027d asked it.\\n\\n Once he was gone, I went into my bedroom and closed the door. Kneeling in front of my open closet, I pulled out box after box, setting them haphazardly around the room. My organization lacked something - like, say, organization - and it took me a while to sift through the clutter of junk. Finally, I produced a shoebox covered in dust.\\n\\n Lifting the lid, I felt my breath catch. Old, brown letters lay stacked with a few photographs. A heavy gold cross on a fraying string lay among the papers, along with other small treasures. I carefully hunted around until I found what I wanted: a bronze ring, green with age.\\n\\n I held it in my hands, still able to discern the engraved couple atop the mounted disc. It was a cruder job but still very similar to Erik\u0027s modern renditions. I ran my fingertips along the ring\u0027s edges without knowing what I did. I even tried it on, but it didn\u0027t fit. It had been made for larger fingers than I had now. I refused to shape-shift to the right size.\\n\\n I kept the ring out for a few more minutes, thinking of Seth and Cyprus and all sorts of things. Finally, unable to stand the ache within me, I put the ring back into its box and buried it once more in the closet. \\n\\n","sourceLink":"https://allnovel.net/succubus-dreams-georgina-kincaid-3/page-3.html","bookId":2056,"book":{"id":2056,"title":"Succubus Dreams (Georgina Kincaid #3)","description":"Storyline: Georgina Kincaid Book 3: Succubus Dreams \\n especially when the girl in question is Georgina Kincaid, a shape-shifting succubus who gets her energy from seducing men. First there\u0027s her relationship with gorgeous bestselling writer Seth Mortensen, which is unsatisfying on a number of levels. It\u0027s not just that they can\u0027t have sex in case Georgina inadvertently kills him (generally a turn-off for most guys). Lately, even spending time together is a challenge. Seth\u0027s obsessed with finishing his latest novel, and Georgina\u0027s under demonic orders to mentor the new (and surprisingly inept) succubus on the block.\\n","cover":"https://allnovel.net/images/succubus-dreams-georgina-kincaid-3.jpg","author":"Richelle Mead","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/succubus-dreams-georgina-kincaid-3.html","creation":"Oct 5, 2019 8:58:18 AM","modification":"Oct 5, 2019 11:55:35 PM"}}
