{"id":77703,"no":16,"title":"Page 16","content":"“One of the most beautiful things I’ve ever seen,” said Bond. It was easy to talk. There was hardly a sound in the great steel shaft and the voices of the men clustered below under the tail of the rocket were no more than a murmur.\n Drax pointed upwards. “Warhead,” he explained. “Experimental one now. Full of instruments. Telemeters and so forth. Then the gyros just opposite us here. Then mostly fuel tanks all the way down until you get to the turbines near the tail. Driven by superheated steam, made by decomposing hydrogen peroxide. The fuel, fluorine and hydrogen” (he glanced sharply at Bond. “That’s top-secret by the way”) “falls down the feed tubes and gets ignited as soon as it’s forced into the motor. Sort of controlled explosion which shoots the rocket into the air. That steel floor under the rocket slides away. There’s a big exhaust pit underneath. Comes out at the base of the cliff. You’ll see it tomorrow. Looks like a huge cave. When we ran a static test the other day the chalk melted and ran out into the sea like water. Hope we don’t burn down the famous white cliffs when we come to the real thing. Like to come and have a look at the works?”\n Bond followed silently as Drax led the way down the steep iron ladder that curved down the side of the steel wall. He felt a glow of admiration and almost of reverence for this man and his majestic achievement. How could he ever have been put off by Drax’s childish behaviour at the card-table? Even the greatest men have their weaknesses. Drax must have an outlet for the tension of the fantastic responsibility he was carrying. It was clear from the conversation at dinner that he couldn’t shed much on to the shoulders of his highly-strung deputy. From him alone had to spring the vitality and confidence to buoy up his whole team. Even in such a small thing as winning at cards it must be important to him to be constantly reassuring himself, constantly searching out omens of good fortune and success, even to the point of creating these omens for himself. Who, Bond asked himself, wouldn’t sweat and bite his nails when so much had been dared, when so much was at stake?\n As they filed down the long curve of the stairway, their figures grotesquely reflected back at them by the mirror of the rocket’s chromium skin, Bond almost felt the man-in the-street’s affection for the man whom, only a few hours previously, he had been dissecting without pity, almost with loathing.\n When they reached the steel-plated floor of the shaft, Drax paused and looked up. Bond followed his eyes. Seen from that angle it seemed as if they were gazing up a thin straight shaft of light into the blazing heaven of the arcs, a shaft of light that was not pure white but a shot mother-of-pearl satin. There were shimmers of red in it picked up from the crimson canisters of a giant foam fire-extinguisher that stood near them, a man in an asbestos suit beside it aiming its nozzle at the base of the rocket. There was a streak of violet whose origin was a violet bulb on the board of an instrument panel in the wall, which controlled the steel cover over the exhaust pit. And there was a whisper of emerald green from the shaded light over a plain deal table at which a man sat and wrote down figures as they were called to him from the group gathered directly beneath the Moonraker’s tail.\n Gazing up this pastel column, so incredibly slim and graceful, it seemed unthinkable that anything so delicate could withstand the pressures which it had been designed to meet on Friday-the howling stream of the most powerful controlled explosion that had ever been attempted; the impact of the sound barrier; the unknown pressures of the atmosphere at 15,000 miles an hour; the terrible shock as it plunged back from a thousand miles up and hit the atmospheric envelope of the earth.\n Drax seemed to read his thoughts. He turned to Bond. “It will be like committing murder,” he said. Then surprisingly, he burst into a braying laugh. “Walter,” he called to the group of men. “Come here.” Walter detached himself and came over. “Walter, I was saying to our friend the Commander that when we fire the Moonraker it will be like committing murder.”\n Bond was not surprised to see a look of puzzled incredulity come over the Doctor’s face.\n Drax said irritably, “Child murder. Murder of our child,” he gestured at the rocket. “Wake up. Wake up. What’s the matter with you?”\n Walter’s face cleared. Frostily he beamed his appreciation of the simile. “Murder. Yes, that is good. Ha! ha! And now,\n Sir Hugo. The graphite slats in the exhaust vent. The Ministry is quite happy about their melting-point? They do not feel that…” Still talking, Walter led Drax under the tail of the rocket. Bond followed.\n The faces of the ten men were turned towards them as they came up. Drax introduced him with a wave of the hand. “Commander Bond, our new security officer,” he said briefly.\n The group eyed Bond in silence. There was no move to greet him and the ten pairs of eyes were incurious.\n “Now then, what’s all this fuss about the graphite?…” The group closed round Drax and Walter. Bond was left standing alone.\n He was not surprised by the coolness of his reception. He would have regarded the intrusion of an amateur into the secrets of his own department with much the same indifference mixed with resentment. And he sympathized with these hand-picked technicians who had lived for months among the highest realms of astronautics, and were now on the threshold of the final arbitration. And yet, he reminded himself, the innocent among them must know that Bond had his own duty to perform, his own vital part in this project. Supposing one pair of those uncommunicative eyes concealed a man within a man, an enemy, perhaps at this very moment exulting in his knowledge that the graphite which Walter seemed to mistrust was indeed under-strength. It was true that they had the look of a well-knit team, almost of a brotherhood, as they stood round Drax and Walter, hanging on their words, their eyes intent on the mouths of the two men. But was part of one brain moving within the privacy of some secret orbit, ticking off its hidden calculus like the stealthy mechanism of an infernal machine?\n Bond moved casually up and down the triangle made by the three points of the fins as they rested in their rubber-lined cavities in the steel floor, interesting himself in whatever met his eyes, but every now and then focusing the group of men from a new angle.\n With the exception of Drax they all wore the same tight nylon overalls fastened with plastic zips. There was nowhere a hint of metal and none wore spectacles. As in the case of Walter and Krebs their heads were close-shaved, presumably, Bond would have thought, to prevent a loose hair falling into the mechanism. And yet, and this struck Bond as a most bizarre characteristic of the team, each man sported a luxuriant moustache to whose culture it was clear that a great deal of attention had been devoted. They were in all shapes and tints: fair or mousy or dark; handlebar, walrus, Kaiser, Hitler-each face bore its own hairy badge amongst which the rank, reddish growth of Drax’s facial hair blazed like the official stamp of their paramount chief.\n Why, wondered Bond, should every man on the site wear a moustache? He had never liked the things, but combined with these shaven heads, there was something positively obscene about this crop of hairy tufts. It would have been just bearable if they had all been cut to the same pattern, but this range of individual fashions, this riot of personalized growth, had something particularly horrible about it against the background of naked round heads.\n There was nothing else to notice; the men were of average height and they were all on the slim side-tailored, Bond supposed, more or less to the requirements of their work. Agility would be needed on the gantries, and compactness for manoeuvring through the access doors and around the tiny compartments in the rocket. Their hands looked relaxed and spotlessly clean, and their feet in the felt slippers were, motionless with concentration. He never once caught any of them glancing in his direction and, as for penetrating their minds or weighing up their loyalties, he admitted to himself that the task of unmasking the thoughts of fifty of these robot-like Germans in three days was quite hopeless. Then he remembered. It was fifty no longer. Only forty-nine. One of these robots had blown his top (apt expression, reflected Bond). And what had come out of Bartsch’s secret thoughts? Lust for a woman and a Heil Hitler. Would he be far wrong, wondered Bond, if he guessed that, forgetting the Moonraker, those were also the dominant thoughts inside forty-nine other heads?\n “Doctor Walter! That is an order.” Drax’s voice of controlled anger broke in on Bond’s thoughts as he stood fingering the sharp leading edge of the tail of one of the Columbite fins. “Back to work. We have wasted enough time.”\n The men scattered smartly about their duties and Drax came up to where Bond was standing, leaving Walter hanging about indecisively beneath the exhaust vent of the rocket. Drax’s face was thunderous. “Damn fool. Always seeing trouble,” he muttered. And then abruptly, as if he wanted to clear his deputy out of his mind, “Come along to my office. Show you the flight plan. Then we’ll go off to bed.”\n Bond followed him across the floor. Drax turned a small handle flush with the steel wall and a narrow door opened with a soft hiss. Three feet inside there was another steel door and Bond noticed that they were both edged with rubber. Air-lock. Before closing the outer door Drax paused on the threshold and pointed along the circular wall to a number of similar inconspicuous flat knobs in the wall. “Workshops,” he said. “Electricians, generators, fuelling control, washrooms, stores.” He pointed to the adjoining door. “My secretary’s room.” He closed the outer door before he opened the second and walked into his office and shut the inner door behind Bond.\n It was a severe room painted pale grey, containing a broad desk and several chairs of tubular metal and dark blue canvas. The floor was carpeted in grey. There were two green filing cabinets and a large metal radio set. A half-open door showed part of a tiled bathroom. The desk faced a wide blank wall which seemed to be made of opaque glass. Drax walked up to the walls and snapped down two switches on its extreme right. The whole wall lit up and Bond was faced with two maps each about six feet square traced on the back of the glass.\n The left-hand map showed the eastern quarter of England from Portsmouth to Hull and the adjoining waters from Latitude 50 to 55. From the red dot near Dover which was the site of the Moonraker, arcs showing the range in, ten-mile intervals had been drawn up the map. At a point eighty miles from the site, between the Friesian Islands and Hull, there was a red diamond in the middle of the ocean.\n Drax waved towards the dense mathematical tables and columns of compass readings which filled the right-hand side of the map. “Wind velocities, atmospheric pressure, ready-reckoner for the gyro settings,” he said. “All worked out using the rocket’s velocity and range as constants. We get the weather every day from the Air Ministry and readings from the upper atmosphere every time the RAF jet can get up there. When he’s at maximum altitude he releases helium balloons that can get up still further. The earth’s atmosphere reaches about fifty miles up. After twenty there’s hardly any density to affect the Moonraker. It’ll coast up almost in a vacuum. Getting through the first twenty miles is the problem. The gravity pull’s another worry. Walter can explain all those things if you’re interested. There’ll be continuous weather reports during the last few hours on Friday. And we’ll set the gryos just before the take-off. For the time being, Miss Brand gets together the data every morning and keeps a table of gyro settings in case they’re wanted.” \n","sourceLink":"https://allnovel.net/moonraker-james-bond-3/page-16.html","bookId":2426,"book":{"id":2426,"title":"Moonraker (James Bond #3)","description":"Storyline: \n Moonraker (James Bond (Original Series) #3) \n Moonraker, Britain\u0027s new ICBM-based national defense system, is ready for testing, but something\u0027s not quite right. At M\u0027s request, Bond begins his investigation with Sir Hugo Drax, the leading card shark at M\u0027s club, who is also the head of the Moonraker project. But once Bond delves deeper into the goings-on at the Moonraker base, he discovers that both the project and its leader are something other than they appear to be.\n \n","cover":"https://allnovel.net/images/moonraker-james-bond-3.jpg","author":"Ian Fleming","type":"Mystery","source":"allnovel","link":"https://allnovel.net/moonraker-james-bond-3.html","creation":"Oct 5, 2019 8:58:42 AM","modification":"Oct 5, 2019 3:38:54 PM"}}
