{"id":77710,"no":23,"title":"Page 23","content":"They sat with their backs to a rock and Bond lit a first delicious cigarette, drinking the smoke deeply into his lungs and expelling it slowly through his nostrils. When Gala had done the best she could with her powder and lipstick he lit a cigarette for her and, as he handed it to her, for the first time they looked into each other’s eyes and smiled. Then they sat and looked silently out to sea, at the golden panorama that was the same and yet entirely new. Bond broke the silence. “Well, by God,” he said. “That was close.” “I still don’t know what happened,” said Gala. “Except that you saved my life.” She put her hand on his and then took it away. “If you hadn’t been there I should be dead,” said Bond. “If I’d stayed where I was-” He shrugged his shoulders. Then he turned and looked at her. “I suppose you realize,” he said flatly, “that someone pushed the cliff down on us?” She looked back at him with wide eyes. “If we searched around in all that,” he gestured towards the avalanche of chalk, “we would find the marks of two or three drill-holes and traces of dynamite. I saw the smoke and I heard the bang of the explosion a split second before the cliff came down. And so did the gulls,” he added. “And what’s more,” continued Bond after a pause, “it can’t have been only Krebs. It was done in full view of the site. And it was done by several people, well organized, with spies on us from the moment we went down the cliff path to the beach.” There was comprehension in Gala’s eyes and a flash of fear. “What are we to do?” she asked anxiously. “What’s it all about?” “They want us dead,” said Bond calmly. “So we have to stay alive. As to what it’s all about, we’ll just have to find that out. “You see,” he went on, “I’m afraid even Vallance isn’t going to be much help. When they made up their minds we were properly buried, they’ll have got away from the top of the cliff as fast as they could. They’d know that even if someone saw the cliff-fall, or heard it, they wouldn’t get very excited. There are twenty miles of these cliffs and not many people come here until the summer. If the coastguards heard it they may have made a note in the log. But in the spring I expect they get plenty of falls. The winter frosts thaw out in cracks that may be hundreds of years old. So our friends would wait until we didn’t turn up tonight and then get the police and coastguards to search for us. They’d keep quiet until the high tide had made porridge out of a good deal of this.” He gestured towards the shambles of fallen chalk. “The whole scheme is admirable. And even if Vallance believes us, there’s not enough evidence to make the Prime Minister interfere with the Moonraker. The damn thing’s so infernally important. All the world’s waiting to see if it’ll work or not. And anyway, what’s our story? What the hell’s it all about? Some of those bloody Germans up there seem to want us dead before Friday. But what for?” He paused. “It’s up to us, Gala. It’s a lousy business but we’ve simply got to solve it ourselves.” He looked into her eyes. “What about it?” Gala laughed abruptly. “Don’t be ridiculous,” she said. “It’s what we’re paid for. Of course we’ll take them on. And I agree we’d get nowhere with London. We’d look absolutely ridiculous telephoning reports about cliffs falling on our heads. What are we doing down here anyway, fooling around without any clothes on instead of getting on with our jobs?” Bond grinned. “We only lay down for ten minutes to get dry,” he protested mildly. “How do you think we ought to have spent the afternoon? Taking everybody’s fingerprints all over again? That’s about all you police think about.” He felt ashamed when he saw her stiffen. He held his hand up. “I didn’t really mean that,” he said. “But can’t you see what we’ve done this afternoon? Just what had to be done. We’ve made the enemy show his hand. Now we’ve got to take the next step and find out who the enemy is and why he wanted us out of the way. And then if we’ve got enough evidence that someone’s trying to sabotage the Moonraker we’ll have the whole place turned inside out, the practice shoot postponed, and to hell with politics.” She jumped to her feet. “Oh, of course you’re right,” she said impatiently. “It’s just that I want to do something about it in a hurry.” She looked for a moment out to sea, away from Bond. “You’ve only just come into the picture. I’ve been living with this rocket for more than a year and I can’t bear the idea that something may happen to it. So much seems to depend on it. For all of us. I want to get back there quickly and to find out who wanted to kill us. It may be nothing to do with the Moonraker, but I want to make sure.” Bond stood up, showing nothing of the pain from the cuts and bruises on his back and legs. “Come on,” he said, “it’s nearly six o’clock. The tide’s coming in fast but we can get to St Margaret’s before it catches us. We’ll clean up at the Granville there and have a drink and some food and then we’ll go back to the house in the middle of dinner. I shall be interested to see what sort of a reception we get. After that we’ll have to concentrate on staying alive and seeing what we can see. Can you make it to St Margaret’s?” “Don’t be silly,” said Gala. “Policewomen aren’t made of gossamer.” She gave a reluctant smile at Bond’s ironically respectful ‘Of course not’, and they turned towards the distant tower of the South Foreland lighthouse and set off through the shingle. At half-past eight the taxi from St Margaret’s dropped them at the second guard gate and they showed their passes and walked quietly up through the trees on to the expanse of concrete. They both felt keyed up and in high spirits. A hot bath and an hour’s rest at the accommodating Granville had been followed by two stiff brandies-and-sodas for Gala and three for Bond followed by delicious fried soles and Welsh rarebits and coffee. And now, as they confidently approached the house, it would have needed second sight to tell that they were both dead tired and that they were naked and bruised under their walking clothes. They let themselves quietly in through the front door and stood for a moment in the lighted hall. A cheerful mumble of voices came from the dining-room. There was a pause followed by a burst of laughter which was dominated by the harsh bark of Sir Hugo Drax. Bond’s mouth twisted wryly as he led the way across the hall to the door of the dining-room. Then he fixed a cheerful smile on his face and opened the door for Gala to pass through. Drax sat at the head of the table, festive in his plum-coloured smoking-jacket. A forkful of food, halfway to his open mouth, had stopped in mid-air as they appeared in the doorway. Unnoticed, the food slid off the fork and fell with a soft, distinct ‘plep’ on to the edge of the table. Krebs had been in the act of drinking a glass of red wine and the glass, frozen against his mouth, poured a thin trickle down his chin and thence on to his brown satin tie and yellow shirt. Dr Walter had had his back to the door and it was not until he observed the unusual behaviour of the others, the bulging eyes, the gape of the mouths, and the blood-drained faces, that he whipped his head round towards the door. His reactions, thought Bond, were slower than the others, or else his nerves were steadier. “Ach so,” he said softly. “Die Engldnder.” Drax was on his feet. “My dear chap,” he said thickly. “My dear chap. We were really very worried. Just wondering whether to send out a search party. Few minutes ago one of the guards came in and reported there seemed to have been a cliff-fall.” He came round towards them, his napkin in one hand and the fork still erect in the other. With the movement the blood surged back into his face, which became first mottled and then its usual red. “You really might have let me know,” he spoke to the girl, anger rising in his voice. “Most extraordinary behaviour.” “It was my fault,” said Bond, moving forward into the room so that he could keep them all in view. “The walk was longer than I expected. I thought we might get caught by the tide so we went on to St Margaret’s and had something to eat there and took a taxi. Miss Brand wanted to telephone but I thought we would be back before eight. You must put the blame on me. But please go ahead with your dinner. Perhaps I might join you for coffee and dessert. I expect Miss Brand would prefer to go to her room. She must be tired after her long day.” Bond walked deliberately round the table and took the chair next to Krebs. Those pale eyes, he noticed, after the first shock, had been fixed firmly on his plate. As Bond came up behind him he was delighted to see a large mound of Elastoplast on the crown of Krebs’s head. “Yes, go to bed, Miss Brand, I will talk to you in the morning,” said Drax testily. Gala obediently left the room and Drax went to his chair and sat heavily down. “Most remarkable those cliffs,” said Bond blithely. “Quite awe-inspiring walking along wondering if they’re going to choose just that moment to collapse on one. Reminded me of Russian roulette. And yet one never reads of people being killed by cliffs falling on them. The odds against getting hurt must be terrific.” He paused. “By the way, what was that you were saying about a cliff-fall just now?” There was a faint groan on Bond’s right, followed by a crash of glass and china as Krebs’s head fell forward on to the table. Bond looked at him with polite curiosity. “Walter,” said Drax sharply. “Can’t you see that Krebs is ill? Take the man out and put him to bed. And don’t be too soft with him. The man drinks too much. Hurry up.” Walter, his face crumpled and angry, strode round the table and jerked Krebs’s head out of the debris. He took him by his coat collar and hauled him to his feet and away from his chair. “Du Scheisskerl,” hissed Walter at the mottled, vacant face. “Marsch!” He turned him round and hustled him to the swing door into the pantry and rammed him through. There were muffled sounds of stumbling and cursing and then a door banged and there was silence. “He must have had a heavy day,” said Bond looking at Drax. The big man was sweating freely. He wiped his face with a circular sweep of his napkin. “Nonsense,” he said shortly. “He drinks.” The butler, erect and unperturbed by the apparition of Krebs and Walter in his pantry, brought in the coffee. Bond took some and sipped it. He waited for the pantry door to close again. Another German, he thought. He’ll already have passed the news back to the barracks. Or perhaps all the team weren’t involved. Perhaps there was a team within a team. And if so, did Drax know about it? His behaviour when Bond and Gala had come through the door had been inconclusive. Had part of his astonishment been affronted dignity, the shock of a vain man whose programme had been upset by a chit of a secretary? He had certainly covered up well. And all the afternoon he had been down the shaft supervising the fuelling. Bond decided to probe a little.","sourceLink":"https://allnovel.net/moonraker-james-bond-3/page-23.html","bookId":2426,"book":{"id":2426,"title":"Moonraker (James Bond #3)","description":"Storyline: Moonraker (James Bond (Original Series) #3) Moonraker, Britain\u0027s new ICBM-based national defense system, is ready for testing, but something\u0027s not quite right. At M\u0027s request, Bond begins his investigation with Sir Hugo Drax, the leading card shark at M\u0027s club, who is also the head of the Moonraker project. But once Bond delves deeper into the goings-on at the Moonraker base, he discovers that both the project and its leader are something other than they appear to be.","cover":"https://allnovel.net/images/moonraker-james-bond-3.jpg","author":"Ian Fleming","type":"Mystery","source":"allnovel","link":"https://allnovel.net/moonraker-james-bond-3.html","creation":"Oct 5, 2019 8:58:42 AM","modification":"Oct 5, 2019 3:38:54 PM"}}
