{"id":89646,"no":17,"title":"Page 17","content":"\\n\\n “Shit.”\\n\\n I walked up to the door to where the bouncer was. He gave me a look. I pointed and whispered, “I’m Erin Benson… I’m… uhhh, friends with Lochlan. We’re…uhhh…”\\n\\n He was about to laugh in my face when Mike walked out front and handed him something, “Hey, Erin.”\\n\\n I smiled, relieved, “Hey, Mike.” The lineup went crazy seeing him. He blushed and waved to everyone.\\n\\n He looked at the bouncer, “She’s with Lochlan.” He lifted the rope back for me. The lineup started to grumble.\\n\\n “Hey, she’s fucking the lead singer!” he shouted at them.\\n\\n I ran inside, hiding my face. Mike grabbed my arm, “Hey, I just wanted to tell you I’m sorry. I didn’t know, you and him. I’m a blind idiot… clearly.”\\n\\n I shook my head, “No. I assumed it was never going to be anything with him.”\\n\\n He scoffed, “Yeah, no kidding.” He stopped laughing and looked down, “Sorry.”\\n\\n A grin crossed my lips, “It’s fine. I’ve lived with him for like almost two months. I’ve figured out what he’s like.”\\n\\n “He’s like that for them. When we’re alone and it’s just us guys, he’s normal.”\\n\\n I nodded, “I know.”\\n\\n “We start up in five.” He smiled and walked to the back of the bar.\\n\\n I found my brother sitting at a table with a blonde. She gave me a look. I almost smacked him but he looked up before I could, “Hey. This is Gabby, Gabby, this is my sister—Erin.”\\n\\n She smiled at me, through the glare in her eyes. I felt warmth behind me as a kiss was planted on my head. I should have known he was there; Gabby suddenly had a lost puppy look on her face and was adjusting her shirt.\\n\\n I looked up. He smiled and bent, kissing my cheek, “You came.” He placed a lemonade in front of me.\\n\\n I grinned and turned, meeting his lips with mine, “I needed my fix.”\\n\\n He murmured alongside my mouth, “Uh oh. Someone is becoming a groupie.”\\n\\n I rolled my eyes, “Whatever. Don’t make a big deal about it.”\\n\\n He whispered into my ear, “I missed you anyway. I have some news, I want to share with you. Come backstage after the show.” I pressed my face into his kiss and felt him slip something in my pocket next to my mace.\\n\\n “I see you have your cock with you.”\\n\\n I grinned, “Always.”\\n\\n He looked away from me to sign a girl’s stomach. She giggled and clawed at his hand. She jumped up and down. He laughed and shook his head. Her friends came running over, all getting his autograph on their chests and stomachs. I looked away. I hated the petty jealousy burning through me.\\n\\n He waved at Danny, “See you after, man.” Danny nodded at him, still playing it cool, even though he had probably just peed his pants. He walked away without saying goodbye to me. Girls mauled him the entire way to the back of the stage. I turned around and drank my lemonade.\\n\\n The girl was all doe-eyed now, “You’re dating Lochlan?”\\n\\n I shrugged, “I don’t know. Sort of.”\\n\\n Danny smiled at me, “They’re roommates.”\\n\\n She winked, “Friends with benefits?”\\n\\n A frown replaced my indifferent look, “No. I don’t do benefits.” I turned and looked at the front of the stage. People were milling around the front. Some of them were looking at me and pointing. I sighed and walked to the front of the stage.\\n\\n The lights went down, making the bar black as night. My heart started to pound in anticipation. I could tell by the breath of the people next to me, they felt the same. Lights came on, but instead of shining on the stage, they focused on the fans in the crowd as the song started. The band played in the dark and Lochlan sang softly. I could barely make out his silhouette.\\n\\n All of the light was on the fans. The crowd filled with hands lifted into the air. They were illuminated with pale-blue lights and swaying with the song.\\n\\n When more lights came on, I didn’t watch him, I watched the crowd. The faces of the people were filled with the same emotions, like they were living through him or for him. They felt something deep from the intensity of his words. Seeing their faces, I knew he was giving them his soul and they were taking it... loving every second of it.\\n\\n The exchange was reciprocated; he got a high off of them too. Their devotion and reverence was ever-present, as they hung on every word he sang with all his heart and soul. Every set of lips sang the words with him. Some of them cried with joy, or sorrow, or whatever the puppet master told them to feel. They moved with him, like him.\\n\\n I didn’t have to watch him, I could watch them and know what he was doing.\\n\\n The lights on the stage all flicked on, just as he unleashed the beast, singing loudly into the microphone with fiery anger. Just as it hit, the band crashed with him. They came to life in the crescendo and mellowed for the break.\\n\\n He bent towards the crowd, rocking with them. Each band member was the same. Their individual instruments worked the fans. They caressed the instruments the way Lochlan’s lips did the microphone, and his eyes did the crowd.\\n\\n His sex/singing face, was the most mesmerizing thing to watch. He had me under his spell from the minute the show started to the end. He maintained the emotions and the passion from the start to finish. Watching him sing was like making love to him, truly. Every sin and seduction committed was brought to life by the motion of his body, whether he was singing or fucking. The caress of his lips, and the fiery beast in his eyes were there for both.\\n\\n I hated that every screaming woman was getting the same experience I got. His passions were raw and exposed for everyone to enjoy.\\n\\n I blushed when he said goodnight and the girl next to me threw her underwear on the stage, screaming about wanting to suck his…\\n\\n I turned and walked to the backstage entrance.\\n\\n I held up the thing from my pocket. The bouncer opened the door for me.\\n\\n The guys were all standing around, wiping off and getting drinks. A woman with long blonde hair, tight black pants and a red halter-top was rubbing Lochlan’s arm. She squeezed and gushed and he let her. I frowned as she hugged each of the other guys, but went back to Lochlan. She was excited about something. I watched as he gave her the one-sided smile and winked at her.\\n\\n “Oh God,” I muttered, backing up. He was that rock star boyfriend. I wrinkled my nose. I hated seeing him like that, touching other women.\\n\\n I backed out into the hall. The bouncer gave me a weak smile, “Rock stars.”\\n\\n I winced when Gerry turned to see me watching. His eyes instantly flicked to the woman linking her arm into Lochlan’s. She pressed her chest into his arm and planted a bright-red kiss on his cheek. He blushed, looking down.\\n\\n Why had he done it, if he knew I was coming backstage? Did he want me to see it or had he just forgotten? Why was he letting fans touch him like that?\\n\\n Gerry’s mouth parted, like he wanted to say something but he didn’t. He didn’t even point out that I was there.\\n\\n This was always going to be my reality. He wanted me to be the real world for him, and I wanted him to be the fantasy but only for me.\\n\\n Panic was filling me. I wanted to bail but I was stuck. I wanted to go back and be his flirty friend but I couldn’t. I was going to lose him, if I couldn’t be with him. Seeing her maul him, I knew I couldn’t. My back hit the wall, and my heart hit the ground and broke into a thousand pieces, and scattered across the floor. I left it there, broken and destroyed, and turned to run from the bar. My feet burned from the run to the apartment, but I didn’t slow down. I quickly packed my bags as fast as I could. I wanted to cry but my broken heart was still at the bar, sitting on the cold, black floor. The tears wouldn’t come.\\n\\n I dragged the bags down the stairs and up the road. It was brutal, carrying it all the way to Gerry’s. It was a five-minute ride but an hour walk with the heavy bags.\\n\\n I started to sniffle as I felt under the mailbox for the hide-away key, I remembered from the Costco trip.\\n\\n Self-pity started making attempts at my heartless chest but I shook my head, “You fucking watched him do it at Costco. Fucking fuck.” I smacked myself in the forehead and opened the door, shoving my crap inside. I knew better than to let it be more than a friendship. Now I would lose him forever.\\n\\n I slammed the door and collapsed on the floor on my knees. I bent forward on the tiles and sobbed. Eventually I lay down, pressing my face to the cold floor. Had he done anything really wrong or was it just too much? I’d been exposed to him and my pride was lost, not shamed but gone forever. He’d seen me spread wide open in every way possible. But it wasn’t enough to make him act like he was mine. I closed my eyes, and no matter how hard I tried to make the mental picture I’d taken of him in his underwear play in my head, all I got was the red kiss on his cheek. Another trashy blonde with bleached hair and a round ass.\\n\\n Gerry found me there, passed out. He lifted me off the floor and helped me to the couch. I sobbed inaudible things into his soft dress shirt. He let me. We didn’t need to talk. He knew.\\n\\n After a while he spoke. “It isn’t what you think it is,” he whispered.\\n\\n I shook my head, “It doesn’t matter. It won’t ever change and I knew that. I knew what he was, the minute I met him. He’s charming and alive, in a way that most people aren’t. I’m not, I know I’m not. There will always be some other girl pressing herself into him, and he has to let them, to be the success he wants to be. I hate that it’s me or his dream, and I’m honest-to-God wanting to ask him to pick. It’s me that’s ruining us, not him. I’m the problem. I can’t do this. My first boyfriend cheated on me and I swore I would never date another man whore again. ‘Course that was in eleventh grade. I sort of assumed guys matured.”\\n\\n He lifted my chin and wiped my tears with a tissue, “Never assume guys mature. Erin, he loves you. I can see it. He would never cheat on you.”\\n\\n I shook my head, “It doesn’t matter. I can’t be comfortable with it. She kissed him and mauled him, and he sat there and took it. Even though he asked me to come to the backstage. He knew I was coming. He knew I would see that. He had to risk that.” \\n\\n","sourceLink":"https://allnovel.net/my-side/page-17.html","bookId":2792,"book":{"id":2792,"title":"My Side","description":"Storyline: Erin Benson felt like she\u0027d won the lottery when she arrived all the way from North Dakota with the keys to her first home in hand. \\n Crisp white walls: Check. \\n Breathtaking view of downtown Boston: Check. \\n Minutes from Northeastern School of Law: Check. \\n But home is not always where the heart is. Sometimes it’s where you find Mr. Random shacked up and sprawled out on what was supposed to be your new bed. \\n Between the bear spray and the handcuffs, she discovers a terrible mistake has been made. \\n Lochlan hasn\u0027t broken into her new home to sleep with a seedy barmaid...he owns half. \\n With emotions running on high, Erin is determined to tough it out until a solution can be found. \\n The tight quarters seem smaller with his accumulated clutter and bizarre sleeping schedule. It also doesn\u0027t help that he\u0027s the new lead singer for Thin Ice, an indie band on its rise to fame. \\n What happens when a quiet bookworm gets stuck with a relentless rocker? \\n What happens when the things you see are not the things you get?\\n","cover":"https://allnovel.net/images/my-side.jpg","author":"Tara Brown","type":"Humorous","source":"allnovel","link":"https://allnovel.net/my-side.html","creation":"Oct 5, 2019 8:59:23 AM","modification":"Oct 5, 2019 5:36:24 PM"}}
