{"id":78028,"no":2,"title":"Page 2","content":"At the time, it had seemed an unusually pretty day, the sky a cheerful blue, the air balmy. The sun had been shining down upon the abbey, bathing its Gothic spires and graceful arches in bright golden light, beaming benignly upon the sleepy little village of Belkirk, which boasted the abbey, two shops, thirty-four cottages, and a communal stone well in the center of it, where villagers gathered on Sunday afternoons, as they were doing then. On a distant hill, a shepherd looked after his flock, while in a clearing not far from the well, Jennifer had been playing hoodman-blind with the orphans whom the abbess had entrusted to her care.\n And in that halcyon setting of laughter and relaxation, this travesty had begun. As if she could somehow change events by reliving them in her mind, Jennifer closed her eyes, and suddenly she was there again in the little clearing with the children, her head completely covered with the hoodman\u0027s hood…\n \"Where are you, Tom MacGivern?\" she called out, groping about with outstretched arms, pretending she couldn\u0027t locate the giggling nine-year-old boy, who her ears told her was only a foot away on her right. Grinning beneath the concealing hood, she assumed the pose of a classic \"monster\" by holding her arms high in front of her, her fingers spread like claws, and began to stomp about, calling in a deep, ominous voice, \"You can\u0027t escape me, Tom MacGivern.\"\n \"Ha!\" he shouted from her right. \"You\u0027ll no\u0027 find me, hoodman!\"\n \"Yes, I will!\" Jenny threatened, then deliberately turned to her left, which caused gales of laughter to erupt from the children who were hiding behind trees and crouching beside bushes.\n \"I\u0027ve got you!\" Jenny shouted triumphantly a few minutes later as she swooped down upon a fleeing, giggling child, catching a small wrist in her hand. Breathless and laughing, Jenny yanked off her hood to see whom she\u0027d captured, mindless of the red gold hair tumbling down over her shoulders and arms.\n \"You got Mary!\" the children crowed delightedly. \"Mary\u0027s the hoodman now!\"\n The little five-year-old girl looked up at Jenny, her hazel eyes wide and apprehensive, her thin body shivering with fear. \"Please,\" she whispered, clinging to Jenny\u0027s leg, \"I—I not want to wear th\u0027 hood—\u0027Twill be dark inside it. Do I got to wear it?\"\n Smiling reassuringly, Jenny tenderly smoothed Mary\u0027s hair off her thin face. \"Not if you don\u0027t want.\"\n \"I\u0027m afeert of the dark,\" Mary confided unnecessarily, her narrow shoulders drooping with shame.\n Sweeping her up into her arms, Jenny hugged her tightly. \"Everybody is afraid of something,\" she said and teasingly added, \"Why, I\u0027m afraid of—of frogs!\"\n The dishonest admission made the little girl giggle. \"Frogs!\" she repeated, \"I likes frogs! They don\u0027t sceer me \u0027tall.\"\n \"There, you see—\" Jenny said as she lowered her to the ground. \"You\u0027re very brave. Braver than I!\"\n \"Lady Jenny is afeart of silly of frogs,\" Mary told the group of children as they ran forward.\n \"No she isn—\" young Tom began, quick to rise to the defense of the beautiful Lady Jenny who, despite her lofty rank, was always up to anything—including hitching up her skirts and wading in the pond to help him catch a fat bullfrog—or climbing up a tree, quick as a cat, to rescue little Will who was afraid to come down.\n Tom silenced at Jenny\u0027s pleading look and argued no more about her alleged fear of frogs. \"I\u0027ll wear the hood,\" he volunteered, gazing adoringly at the seventeen-year-old girl who wore the somber gown of a novice nun, but who was not one, and who, moreover, certainly didn\u0027t act like one. Why, last Sunday during the priest\u0027s long sermon, Lady Jenny\u0027s head had nodded forward, and only Tom\u0027s loud, false coughing in the bench behind her had awakened her in time for her to escape detection by the sharp-eyed abbess.\n \" \u0027Tis Tom\u0027s turn to wear the hood,\" Jenny agreed promptly, handing Tom the hood. Smiling, she watched the children scamper off to their favorite hiding places, then she picked up the wimple and short woolen veil she\u0027d taken off in order to be the hoodman. Intending to go over to the communal well where the villagers were eagerly questioning some clansmen passing through Belkirk on their way to their homes from the war against the English in Cornwall, she lifted the wimple, intending to put it on.\n \"Lady Jennifer!\" One of the village men called suddenly, \"Come quick—there\u0027s news of the laird.\"\n The veil and wimple forgotten in her hand, Jenny broke into a run, and the children, sensing the excitement, stopped their game and raced along at her heels.\n \"What news?\" Jenny asked breathlessly, her gaze searching the stolid faces of the groups of clansmen. One of them stepped forward, respectfully removing his helm and cradling it in the crook of his arm. \"Be you the daughter of the laird of Merrick?\"\n At the mention of the name Merrick, two of the men at the well suddenly stopped in the act of pulling up a bucket of water and exchanged startled, malevolent glances before they quickly ducked their heads again, keeping their faces in shadow. \"Yes,\" Jenny said eagerly. \"You have news of my father?\"\n \"Aye, m\u0027lady. He\u0027s comin\u0027 this way, not far behind us, wit a big band o\u0027 men.\"\n \"Thank God,\" Jenny breathed. \"How goes the battle at Cornwall?\" she asked after a moment, ready now to forget her personal concerns and devote her worry to the battle the Scots were waging at Cornwall in support of King James and Edward V\u0027s claim to the English throne.\n His face answered Jenny\u0027s question even before he said, \" \u0027Twas all but over when we left. In Cork and Taunton it looked like we might win, and the same was true in Cornwall, until the devil hisself came to take command \u0027o Henry\u0027s army.\"\n \"The devil?\" Jenny repeated blankly.\n Hatred contorted the man\u0027s face and he spat on the ground. \"Aye, the devil—the Black Wolf hisself, may he roast in hell from whence he was spawned.\"\n Two of the peasant women crossed themselves as if to ward off evil at the mention of the Black Wolf, Scotland\u0027s most hated, and most feared, enemy, but the man\u0027s next words made them gape in fear: \"The Wolf is comin\u0027 back to Scotland. Henry\u0027s sendin\u0027 him here with a fresh army to crush us for supportin\u0027 King Edward. \u0027Twill be murder and bloodshed like the last time he came, only worst, you mark me. The clans are making haste to come home and get ready for the battles. I\u0027m thinkin\u0027 the Wolf will attack Merrick first, before any o\u0027 the rest of us, for \u0027twas your clan that took the most English lives at Cornwall.\"\n So saying, he nodded politely, put on his helmet, then he swung up onto his horse. \n","sourceLink":"https://allnovel.net/a-kingdom-of-dreams-westmoreland-saga-1/page-2.html","bookId":1848,"book":{"id":1848,"title":"A Kingdom of Dreams (Westmoreland Saga #1)","description":"Storyline: \n #1 bestselling author Judith McNaught dazzles with this beloved romantic classic, “one of the best ever” (Rendezvous), in which two defiant hearts clash over a furious battle of wills in a glorious age of chivalry. \n Abducted from her convent school, headstrong Scottish beauty Jennifer Merrick does not easily surrender to Royce Westmoreland, Duke of Claymore. Known as “The Wolf,” his very name strikes terror in the hearts of his enemies. But proud Jennifer will have nothing to do with the fierce English warrior who holds her captive, this handsome rogue who taunts her with his blazing arrogance. Boldly she challenges his will—until the night he takes her in his powerful embrace, awakening in her an irresistible hunger. And suddenly Jennifer finds herself ensnared in a bewildering web…a seductive, dangerous trap of pride, passion, loyalty, and overwhelming love.\n \n","cover":"https://allnovel.net/images/a-kingdom-of-dreams-westmoreland-saga-1.jpg","author":"Judith McNaught","type":"Historical","source":"allnovel","link":"https://allnovel.net/a-kingdom-of-dreams-westmoreland-saga-1.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 3:39:27 PM"}}
