{"id":78104,"no":80,"title":"Page 80","content":"She inclined her head like a queen bestowing a regal favor upon a lesser mortal. \"Everything—for as long as we remain down here.\" \"Stubborn wench,\" he said with sham severity, then his eyes took on a tender, intimate look as he added, \" \u0027Tis time for the bride and groom to join their guests.\" Tucking her hand into the crook of his elbow, he turned, and Jenny realized that while he\u0027d been talking to her, his knights had formed into a line behind him—obviously by prearranged plan—in order to be formally presented to their new duchess. At the head of them stood Stefan Westmoreland, who\u0027d scarcely glanced at her except to scowl at her in the hall at Merrick. Now, he pressed a light, brotherly kiss to her cheek. When he stepped back and grinned at her, Jenny was struck anew by how very much he resembled Royce, especially when he smiled. Stefan\u0027s hair was lighter and his features slightly less rugged; his eyes were blue not gray, but like his brother, he did not lack for charm when he cared to use it—as he did now. \"An apology for the trouble I have caused you is not enough, my lady, but \u0027tis long overdue. I make it now, most sincerely, in hopes you will someday find it in your heart to forgive me.\" The apology was made with such sincerity, and so prettily, that Jenny could not, in the spirit of the evening and the dictates of good manners, do anything but accept it, which she did. Her reward was an irrepressible grin from her new brother-in-law, who leaned forward and said, \"Naturally, I needn\u0027t apologize to my brother, for \u0027twas a grand favor I did him.\" Jenny couldn\u0027t help it; that notion was so outrageous that she burst out laughing. Beside her, she felt Royce look down at her, and when she glanced at him, his gray eyes were warm with approval and something that looked very much like pride. Arik was next, and the stone floor seemed to rumble as the terrifying giant strode forward, each step double the stride of an average man\u0027s. As Jenny expected, the granite-faced giant did not demean himself with an apology, let alone a gallant speech, or even so much as a bow. Instead, he stood before her, looking down his nose at her from his towering height and then, with his strange pale eyes looking into hers, he merely jerked his head in a curt nod. Turning, he stalked off, leaving Jenny feeling as if he had just accepted dominion over her instead of the reverse. Seeing her startled discomfiture, Royce leaned down and chuckled in her ear, \"Don\u0027t be insulted—Arik has never condescended to actually swear fealty to me either.\" Jenny looked into those smiling gray eyes and suddenly the whole evening seemed to stretch before her with all the promise and excitement of the first warm night of spring. The knights who made up Royce\u0027s personal guard came next. Sir Godfrey, a tall, handsome man in his late twenties, was first and instantly became her favorite because, immediately after kissing her hand, he did something that completely dispelled the tension over their past association: Turning to all within hearing, he proclaimed her the only woman alive with wit and courage enough to dupe an entire army. Then he turned back to her and said with an irrepressible grin, \"I trust, my lady, that if you ever decide to escape Claymore as you did our camp a few weeks ago, you\u0027ll spare our pride by leaving us a better trail to follow?\" Jenny, who was partaking of the goblet of wine Royce had pressed into her hand, replied with sham solemnity, \"Should I ever try to escape from here, I shall contrive to do it very badly, to be sure,\" which made Sir Godfrey roar with laughter and kiss her cheek. Sir Eustace, blond and handsome with merry brown eyes, gallantly announced that if her hair had been unbound when she escaped, they\u0027d have spotted its golden flame and been able to find her no matter where she hid, which earned him a mild, quelling look from Royce. Undaunted, Sir Eustace leaned forward and teasingly told Jennifer, \"He\u0027s jealous, you can see—of my superior looks and chivalrous conversation.\" One at a time, they came to stand before her, skilled, deadly knights who once would have killed her at a word from their lord, but who were now bound to protect her, even at the cost of their own lives. Attired in fine velvets and wools, instead of chain mail and helmets, the older knights treated her with differential courtesy while a few of the younger ones actually exhibited an endearing embarrassment for something they had done: \"I trust,\" young Sir Lionel said to Jennifer, \"I didn\u0027t cause your grace any undue discomfort when I—when I—that is, er, grabbed your arm and drag—\" Jenny chuckled and raised her brows, \"and escorted me to my tent that first night?\" \"Yes, escorted,\" he said with a sigh of relief. Gawin, Royce\u0027s young squire, was the last to be formally presented to her as his mistress. Obviously too young and idealistic to follow the older, more experienced knight\u0027s example and let bygones be bygones, he bowed to Jenny, kissed her hand, and then with ill-concealed rancor said, \"I suppose, my lady, \u0027twas not your true intention to make us freeze when you slashed our blankets.\" That remark earned him a hard cuff from Sir Eustace, who had lingered at Jenny\u0027s side, and who said to him with disgust, \"If that\u0027s your idea of gallantry, no wonder young Lady Anne casts her eye at Roderick, not you.\" The mention of Roderick and Lady Anne made the youth stiffen in umbrage and throw an irate look about the room. Issuing a hasty apology to Jennifer, Gawin hastened off in the direction of a pretty brunette who was talking to a man Jenny didn\u0027t recognize, looking more belligerent than gallant. Royce watched him leave and glanced at Jennifer with a look of apologetic amusement. \"Gawin has lost his head over that pretty maid over there, and evidently his sense as well.\" Offering her his arm, he added, \"Come and meet the rest of our guests, my lady.\" The fears Jenny had harbored about her reception from those who were not bound to Royce by pledges of fealty were completely allayed during the next two hours, as she was introduced to each. The unprecedented words Royce had spoken earlier on the castle steps had obviously been repeated far and wide—including to the guests who\u0027d come from neighboring estates—and though Jenny occasionally encountered a hostile gaze, the owner of it was careful to hide it behind a polite smile. When all the introductions had been made, Royce insisted that Jenny should dine, and at the table on the raised dais there was more conversation—all of it gay and pleasant, interrupted only by the blast of trumpets from the gallery that heralded the arrival of each new course from the kitchen. Aunt Elinor was in her glory, with a captive audience of more than three hundred people to converse with, although the person she was most often seen near was none other than Arik! Jenny watched her, amused by the elderly lady\u0027s fascination with the one person who didn\u0027t want to talk to anyone at all.","sourceLink":"https://allnovel.net/a-kingdom-of-dreams-westmoreland-saga-1/page-80.html","bookId":1848,"book":{"id":1848,"title":"A Kingdom of Dreams (Westmoreland Saga #1)","description":"Storyline: #1 bestselling author Judith McNaught dazzles with this beloved romantic classic, “one of the best ever” (Rendezvous), in which two defiant hearts clash over a furious battle of wills in a glorious age of chivalry. Abducted from her convent school, headstrong Scottish beauty Jennifer Merrick does not easily surrender to Royce Westmoreland, Duke of Claymore. Known as “The Wolf,” his very name strikes terror in the hearts of his enemies. But proud Jennifer will have nothing to do with the fierce English warrior who holds her captive, this handsome rogue who taunts her with his blazing arrogance. Boldly she challenges his will—until the night he takes her in his powerful embrace, awakening in her an irresistible hunger. And suddenly Jennifer finds herself ensnared in a bewildering web…a seductive, dangerous trap of pride, passion, loyalty, and overwhelming love.","cover":"https://allnovel.net/images/a-kingdom-of-dreams-westmoreland-saga-1.jpg","author":"Judith McNaught","type":"Historical","source":"allnovel","link":"https://allnovel.net/a-kingdom-of-dreams-westmoreland-saga-1.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 3:39:27 PM"}}
