{"id":78107,"no":83,"title":"Page 83","content":"When she remained silent, watching him with wary suspicion, he said with an irritated sigh, \"Jennifer, this marriage was not of our choosing, but the deed is done, and we will have to find a way to live in harmony with it. We have wronged each other, and nothing can change that. I\u0027d hoped to bury the past, but perhaps it\u0027s best to let you talk about it as you seem determined to do. Very well,\" he said as if reaching a conclusion, \"go ahead and itemize your grievances. What do you want to know?\"\n \"Two things for a start,\" Jenny replied tartly. \"When did you finally come to the realization that I\u0027ve been wronged? And how in God\u0027s holy name can you possibly say I\u0027ve wronged you?\"\n \"I\u0027d prefer to leave the last question unanswered,\" he said evenly. \"Before I came in to see you this evening, I spent two hours in this room, coming to grips with the things you have done, and I\u0027ve decided to put all that behind me.\"\n \"How very virtuous of you,\" Jenny said derisively. \"It so happens, my lord, that I have done nothing, nothing for which I require your forgiveness or for which I owe you explanations, for that matter. However,\" she amended tightly, \"I will be happy to give any explanations you wish once you\u0027ve made yours to me. Is that agreeable?\"\n His lips quirked in a reluctant grin as Royce contemplated the stormy beauty in aquamarine velvet who\u0027d already abandoned fear in favor of anger. He found it acutely painful when she feared him. Making an effort to smooth the grin from his face, he nodded. \"Perfectly agreeable. You may proceed.\"\n Jenny needed no more encouragement. Studying his face, watching for any signs of deceit, she said abruptly, \"Were you or were you not going to let Arik kill that boy in the village today?\"\n \"No,\" he said flatly. \"I was not.\"\n Some of Jenny\u0027s hostility and fear began to dissolve. \"Then why didn\u0027t you say anything?\"\n \"I didn\u0027t need to. Arik does not act except on my orders. He stopped, not because you screamed, but because he was waiting for a decision from me.\"\n \"You—you aren\u0027t lying are you?\" she asked, searching his inscrutable features.\n \"What do you think?\"\n Jenny bit her lip, feeling slightly churlish. \"I apologize. That was needlessly rude.\"\n Accepting her apology with a nod, he said civilly, \"Go on. What\u0027s your next question?\"\n Jenny drew a deep breath and slowly expelled it, knowing she was treading on dangerous ground now. \"I would like to know why you felt compelled to humiliate my father and my family by proving you could breach Merrick\u0027s defenses and stealing me from my own bedchamber?\" Ignoring the sudden angry gleam flaring in his eyes, she continued doggedly, \"You\u0027ve proved your skill and prowess in such things. Why, if you ever wanted us to live in harmony, did you need to prove it in such a petty, small-minded—\"\n \"Jennifer,\" he interrupted in a cutting voice, \"you\u0027ve made a fool of me twice and caused me to make a fool of myself once. That\u0027s quite a record,\" he applauded sarcastically. \"Now take your bow, and let the matter drop!\"\n Fortified with a considerable amount of wine and a good deal of natural stubbornness, Jenny searched his features. Despite his tone of sarcasm, there was a harshness in his gray eyes that told her whatever \"plot\" he was referring to did more than merely anger him, it cut him deeply enough to make him bitter. Trying to ignore the dangerous, magnetic tug that seemed to be pulling her toward him with each moment since he\u0027d begun to answer her questions, she said lightly, \"I shall happily take my bow, but first, I\u0027d like to be absolutely certain what it is I\u0027ve done to deserve such credit.\"\n \"You damn well know what I\u0027m referring to.\"\n \"I\u0027m not entirely—certain. I\u0027d hate to take credit where it wasn\u0027t due,\" she said, raising her glass.\n \"You\u0027re amazing. You can lie and look me straight in the eye. Very well,\" he said, his voice reeking with irony. \"Let\u0027s play your game to its distasteful end. First, there was the little ruse that your sister—who I\u0027d have sworn didn\u0027t have sense enough to dress herself—pulled off with your help and the help of feather pillows…\"\n \"You know about that?\" she said, choking on her wine and trying to hide her smile.\n \"I wouldn\u0027t advise you to laugh,\" he warned.\n \"Why not?\" Jenny said wryly. \" \u0027Twas as much a \u0027joke\u0027 on me as \u0027twas on you.\"\n \"I suppose you knew nothing about it?\" he snapped, studying the telltale flush on her cheeks, wondering if it was due to the wine or lying.\n \"If I had,\" she said, turning serious, \"do you think I\u0027d have been so eager to trade my honor for feathers?\"\n \"I don\u0027t know. Would you?\"\n She lowered her glass and said somberly, \"I\u0027m not certain. To help her escape, I suppose I might have—but not until I\u0027d exhausted every other possibility. So I can\u0027t quite take credit for duping you in this instance. What are the other two?\"\n He slapped his goblet onto the table and started toward her.\n \"I gather you\u0027re referring to my escape with William?\" she prompted uneasily, backing away a step from the ominous expression in his eyes. \"I can\u0027t take credit for that either. He was standing in the woods, and I didn\u0027t notice him until you were about to leave with Arik.\"\n \"Right,\" he said icily, \"and although you are aware of my remark about the queen of Scotland, you aren\u0027t aware that while you were escaping, I was telling Graverley, like a besotted fool, that I intended to marry you. And you aren\u0027t aware that you were leaving for a cloister immediately after our wedding at Merrick? Which would have neatly bound me to you for life at the same time it deprived me of heirs? And if you lie to me just one more time—\" He took the goblet of wine from her and jerked her into his arms.\n \"You were doing what?\" she whispered.\n \"Enough of this nonsense,\" he said shortly, bending his head and taking her lips in a hard, silencing kiss. To his surprise, she didn\u0027t fight him, In fact, she seemed not to know what he was doing to her. When he lifted his head she was staring at him with an expression in her blue eyes he\u0027d not seen before.\n \"You were doing what?\" she breathed again.\n \"You heard me,\" he said shortly.\n An awful, treacherous warmth was seeping through every pore of Jenny\u0027s body as she gazed into his mesmerizing eyes. \"Why?\" she whispered. \"Why did you tell him you intended to marry me?\"\n \"I was insane at the time,\" he said coldly.\n \"About me?\" she whispered, so carried away with what her heart was telling her that she spoke without thinking. \n","sourceLink":"https://allnovel.net/a-kingdom-of-dreams-westmoreland-saga-1/page-83.html","bookId":1848,"book":{"id":1848,"title":"A Kingdom of Dreams (Westmoreland Saga #1)","description":"Storyline: \n #1 bestselling author Judith McNaught dazzles with this beloved romantic classic, “one of the best ever” (Rendezvous), in which two defiant hearts clash over a furious battle of wills in a glorious age of chivalry. \n Abducted from her convent school, headstrong Scottish beauty Jennifer Merrick does not easily surrender to Royce Westmoreland, Duke of Claymore. Known as “The Wolf,” his very name strikes terror in the hearts of his enemies. But proud Jennifer will have nothing to do with the fierce English warrior who holds her captive, this handsome rogue who taunts her with his blazing arrogance. Boldly she challenges his will—until the night he takes her in his powerful embrace, awakening in her an irresistible hunger. And suddenly Jennifer finds herself ensnared in a bewildering web…a seductive, dangerous trap of pride, passion, loyalty, and overwhelming love.\n \n","cover":"https://allnovel.net/images/a-kingdom-of-dreams-westmoreland-saga-1.jpg","author":"Judith McNaught","type":"Historical","source":"allnovel","link":"https://allnovel.net/a-kingdom-of-dreams-westmoreland-saga-1.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 3:39:27 PM"}}
