{"id":14707,"no":2,"title":"CHAPTER I WESTMINSTER PALACE","content":"Scarcely anything remains to-day to remind us of the vast size and the magnificence of the Palace of Westminster, the royal residence of the English Kings from the time of Edward the Confessor until the reign of Henry VIII. For five centuries the monarchs of England kept their Court on the island of Thorney, within the sound of the bells of the great minster raised by the piety of the saintly Edward. Though the early Kings were seldom long in one place, they regarded Westminster as their principal palace, and often kept their Christmas festivals there, a time of general feasting at the royal expense. \n \n Cnut is supposed to be the first King to settle at Westminster, whither he had gone, after his conversion to Christianity, to be near his friend Abbot Wolfstan, and we are told that the incident of his rebuke to his courtiers concerning the tide occurred on the shores of the River Thames. At that time Westminster was surrounded by water, being built on the island of Thorney, an islet that rose out of the low-lying marshy ground overspread by the wide and unembanked river. \n \n It is customary to attribute the ruin of the many beautiful [pg 6] and stately buildings of past ages, to the agency of civil wars, the fanatical zeal of Protestant reformers, or the carelessness of the Cromwellian soldiers; but far more deadly foes than the cannon-balls of enemies or the mistaken energies of religious zealots, were the destructive fires that time and again destroyed the splendid structures that adorned the vanished centuries. Westminster, though immune from other foes, suffered terribly from fires, which have robbed us of the greatest part of one of the most picturesque of palaces. Just after Edward I. had finished repairing his royal dwelling a huge fire broke out, so tremendous that the palace was rendered uninhabitable, obliging the King to accept the hospitality of York Place, the London house of the Archbishops of York. Edward II. rebuilt the palace, which remained the main royal residence until a disastrous fire in 1512 drove the monarchs away for ever. Though much was destroyed, a considerable part of the King\u0027s house remained, together with the beautiful chapel of St. Stephen and the great hall of the palace; but yet another fire attacked this remnant in 1834. From this last conflagration only Westminster Hall, the crypt of the chapel, and an old tower (now hidden away among the narrow byways of the abbey precincts) survived. \n \n The Palace of Westminster, described by Camden as \"large and magnificent, a building not to be equalled in that age,\" was of great extent, stretching from the abbey to the river. It consisted of a mass of rambling buildings erected with little regard to any fixed plan, but resulting in a picturesque medley of gabled roofs, carved stonework, delicate window tracery, noble halls, and exquisite chapels. Medieval palaces required to be large, for all the King\u0027s work was done upon his own premises. [pg 7] Bakers, brewers, chandlers, armourers, blacksmiths, carpenters, furriers, masons, gardeners, barbers, stablemen, embroiderers, weavers—all lived and worked within the palace walls, and received wages and lodging. As Sir Walter Besant tells us, in his fascinating history of Westminster, the palace was \"a crowded city, complete in itself, though it produced nothing and carried on no trade; there were workshops and forges and the hammerings of armourers and blacksmiths, but there were no stalls, no chepe, no clamour of those who shouted their goods and invited the passengers to \u0027Buy, buy, buy.\u0027\" Within this city, crowded within a confined space, dwelt about fifteen thousand people all occupied with the King\u0027s business, from the judges, bishops, and high State officials, down to humble laundry-women. \n \n A strongly-fortified wall ran all round the palace, for medieval Kings needed their royal residences to be places of defence as well as of regal splendour. There were gates leading to the Abbey, to Whitehall, and to the river, where the King\u0027s barges lay to take him down to the Tower of London in the city, or up the river towards Windsor. Immediately beyond the busy throng of the palace and the monastic buildings of the Abbey, lay green fields and pleasant rural scenes. Between the palace and the noisy city, a mile away, stood palatial houses of the great nobles and bishops, facing the broad and sparkling Thames. \n \n Of all the beautiful buildings that once formed the extensive palace only the great hall remains, now known as Westminster Hall. William Rufus built it in 1097, declaring that, large though it might appear, it was \"but a bedchamber\" in comparison to what he intended to make. But practically nothing is left of the work of [pg 8] Rufus, for we learn that three hundred years later, in 1397, Richard II. ordered the \"walls, windows, and roof to be taken down and new made.\" The following year Richard, the most magnificent of the English Kings, kept his royal Christmas in the newly finished hall. Dressed in cloth of gold, adorned with pearls and precious stones, Richard entertained ten thousand people, necessitating the purchase of twenty-eight oxen, three hundred sheep, and numberless fowls every day for the feeding of his guests. He little thought that a few months hence the Parliament meeting in that very hall would depose him. \n \n This famous hall has witnessed some of the most spectacular, splendid, and tragic events in the history of the nation, from the Coronation banquets held within its walls, a-glitter with gorgeous raiment and all the pageantry of the past, to the sombre procedure of State trials. Perhaps the best remembered scene is that of the trial of Charles I., who had been brought hurriedly from Windsor, and was lodged during his trial in part of the old palace, then used as the residence of Sir Ralph Cotton. Standing, a monarch tried by his subjects, Charles Stuart remains for all time a dignified figure, not deigning to plead before such a self-constituted Court. \n \n For many centuries justice was administered from the hall, judges sitting in different parts determining Chancery cases or those of Common Pleas. \n \n The most-to-be-regretted loss caused by the fire of 1834 is that of the chapel royal of the palace, the chapel of St. Stephen. From an account of its architectural detail, which has fortunately been preserved, one gathers that it was a most beautiful and exquisite piece of work, as rich and stately as any in the country. King Stephen is supposed to have founded it, but [pg 9-10] Edward I. rebuilt it, only to have his building burnt down a few years later. His grandson, Edward III., restored it in such splendour that, as Camden says, \"he seems rather to have been the founder than only the repairer.\" He made it a collegiate church, endowing it with so much wealth after his victories in France that it almost rivalled its wealthy neighbour, the Abbey of Westminster. Indeed, this royal munificence brought about considerable quarrelling with the Abbey, whose inmates grudged the Masses being said at St. Stephen\u0027s, when they might have been said in the Abbey and so enriched their coffers. In this new chapel Richard II. married his first wife, Anne of Bohemia. \n \n Westminster Hall. \n \n From an engraving by Hollar. \n \n At the Dissolution of the Monasteries, the King granted to the Commons of England, who had hitherto met in the Chapter House of Westminster Abbey, the use of St. Stephen\u0027s Chapel, and there they have met ever since, except once during the reign of Charles I. For the reception of the members the beautiful chapel was ruthlessly altered, but enough of the original work remained to make the fire of 1834 a disaster to all lovers of graceful architecture. The present House of Commons is built upon the site of the old collegiate buildings, and only the crypt of the church remains to remind us of the royal chapel of our Plantagenet Kings. \n \n All the other historic rooms have vanished. Nothing is left of the Painted Chamber, where Edward the Confessor died, the long room whose painted walls depicted the story of the Confessor\u0027s life upon one side, while the other was devoted to the Wars of the Maccabees. These paintings were unknown until 1800, when the tapestry that covered them was removed, and thus revealed the meaning of the room\u0027s designation. Gone, [pg 11] too, is the old House of Lords, used by the peers until the Commonwealth, where the famous tapestry representing the defeat of the Spanish Armada was hung. In the vaults underneath, originally the Confessor\u0027s kitchen, Guy Fawkes and his fellow-conspirators stored the barrels of gunpowder with which to blow up the Parliament. After the Restoration the Lords removed to the White Hall of the palace, taking the Armada tapestry with them, which, together with so much of fascination and historic interest, perished in the all-embracing fire of 1834. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1866/54006.html","bookId":823,"book":{"id":823,"title":"Peeps at Royal Palaces of Great Britain","description":"简介： If a palace be a royal residence, as the dictionary defines it, then nearly all the famous castles of England would come under that title, for the Norman and Plantagenet Kings were constantly moving from one stronghold to another during the unsettled...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1866","creation":"Aug 1, 2019 12:19:35 AM","modification":"Aug 1, 2019 12:19:35 AM"}}
