{"id":82319,"no":4,"title":"Page 4","content":"He knew what hiding from the world was all about, and he didn\u0027t wish that on anyone. Particularly not on a girl with such beautiful eyes and a shy smile. Perhaps there had been sadness in that smile, too. He sighed. In any case, it was time for him to move along. The smell of advancing rain thickened the air.\n He walked briskly toward the stern. And just past another lifeboat he came upon two figures standing together, peering through binoculars at ship\u0027s lights off in the distance. Michael judged the second vessel to be possibly three or so miles away.\n His sudden approach and footfalls, clumsy rather than careful, caused the two men to lower their glasses and turn toward him. One of the men was Medina, who screwed up his black-bearded face in a rictus of anger. \"What do you think you\u0027re doing, man? You\u0027re not on duty! Why are you out of your bunk?\"\n \"I\u0027m walking,\" was the calm reply.\n \"Walking?\" Medina pressed forward, his chest pushed out and his chin pulled in. \"This isn\u0027t a stadium! It isn\u0027t a road! Tell him what this is, Mr. Kpanga!\"\n \"It\u0027s a ship,\" said Enam Kpanga, but his attention had already returned to focusing the lights on the horizon in his binoculars. Michael thought Kpanga was awfully unconcerned about the fact a first mate had just taken an order from a second mate. The African wore a black suit and an open-collared indigo shirt. Kpanga\u0027s flesh was the hue of purest ebony from the heart of the dark continent. He was thin and tall, about the same height as Michael. He had a cap of close-cropped hair with a widow\u0027s peak. He wore wire-rimmed spectacles with round lenses, and Michael thought he looked more like a first-year law student than the first mate of a rust-gnawed freighter.\n \"Where were you walking to?\" Medina inquired acidly. He grinned, which was almost his undoing. \"Home to your momma?\"\n Michael Gallatin increased the intensity of his green eyes. He said nothing, his face placid. Medina\u0027s grin vanished.\n \"Careful the way you look at me, man!\" the second mate warned, which was nearly his second brush with disembowelment.\n \"Very strange, this is,\" said Kpanga, lowering the binoculars. He had a melodic British accent tinged with the smooth rhythm of his tribal tongue. He cast a gaze at the wayward crewman. The Sofia\u0027s lights sparked off his eyeglasses. \"Return belowdecks, if you please.\"\n \"We ought to make an example of him.\" Medina didn\u0027t quite know when to stop edging toward a fast and brutal reckoning.\n \"Return belowdecks, if you please,\" Kpanga repeated, as if the second mate had not only never spoken but wasn\u0027t even standing there.\n Michael nodded. The African once more peered through the binoculars. Medina waited for a further provocation. Michael thought he could tear the Spaniard\u0027s beard off in about three seconds. He looked toward the distant lights. Another freighter, most likely. Also headed for England? Before Medina could speak again, Michael turned away and went forward to the stairs he\u0027d ascended from his little bunk in Hell.\n Five\n The Captain\n It was a small movement. A small sound. A change in the thudding of waves against the hull. A quietening of the labored diesels.\n Michael Gallatin sat up on his bunk.\n Had he been asleep at all? Maybe for two hours. Everything was still semi-dark. A few other crewmen had felt the change in their sleep as well, and were groggily stirring. Someone spoke out in Polish, as if from a dream. A question that had no answer.\n Michael\u0027s heartbeat had quickened. He swung himself off the bunk and because he was still mostly dressed all he had to do was pull on his boots, his jacket and his woolen cap. Then he was up the stairway into the night.\n A cold, stinging drizzle hit him in the face. He saw, first of all, that the lights of a ship were about five hundred meters off the port beam. The ship\u0027s bow was aimed toward Sofia. Michael judged it was making maybe ten knots. A shrill alarm went off in him. Sofia was slowing nearly to a glide. He saw a signal lamp blinking up at the second ship\u0027s wheelhouse. Sending morse code to Sofia. He took a moment to decipher it.\n Stop your engines. We are overtaking.\n \"Damn it,\" he breathed, and then he went to the stairs leading up along the side of the superstructure and raced to the wheelhouse at the top. At the locked door, he balled up his fist and started hammering.\n The door opened and a startled-looking Enam Kpanga peered out. Raindrops flecked his glasses. He said, \"What are you - \"\n Then he stopped speaking, because Michael shoved him back and walked into the low-lamped wheelhouse, where a Swede with a face like the business end of an axe was manning the helm. Before him, the wide rectangular windowglass was streaked with rain.\n Medina was standing at the engine order telegraph, the brass instrument by which the bridge communicated speed changes to the engine room. Michael saw that the pointer was set to the Ahead Two-Thirds position instead of what would normally be All-Ahead Standard. Medina\u0027s hand was on the pointer and was about to ring the next lowest engine speed, Ahead One-Third.\n \"Keep your speed up!\" Michael commanded.\n The moment was frozen. Rain pattered against the window\u0027s glass. Sofia moved over a wave and down, then began to rise again. She moaned somewhere amidships.\n \"Seaman!\" Kpanga had not shouted it, but nevertheless his voice carried absolute authority. \"Get off the bridge!\"\n Michael turned to face him. \"I want to see the captain.\"\n \"Are you insane?\"\n \"I said, I want to see the - \"\n A pistol\u0027s barrel was placed against the back of his skull.\n \"Get out of here now,\" said the Spaniard, \"or I will blow your fucking head off.\"\n \"My name is Michael Gallatin,\" he said to Kpanga. \"I\u0027m an agent with the British Secret Service. Special Operations. Your German passenger is a weapons expert named Paul Wesshauser. He\u0027s trying to get himself and his family to England and away from the Nazis. Obviously the Nazis don\u0027t want that to happen. We believed a freighter was the safest way over. Their secret police were watching all the airports, civilian ship lines and train stations.\" Loose ends, he thought grimly. Someone in the network had either been paid to talk or had his mouth loosened by the ugly end of a pair of pliers. \"That ship is coming to take him, and I can tell you he doesn\u0027t want to go. Neither do we want him to be taken.\" He turned his head a fraction. \"If you don\u0027t put that gun down in three seconds, I\u0027ll kill you.\"\n The pistol wavered.\n \"I\u0027m counting,\" Michael vowed, smelling fear.\n \"Put it down, Monsieur Medina,\" said another voice, heavy with a French accent.\n The pressure of the pistol against the back of Michael\u0027s head went away.\n Michael turned to the left, toward the voice. A figure emerged from a shadowed corridor at the back of the wheelhouse. It was a man of stocky, broadchested build and Napoleonic height, standing five-feet-six at most. He came forward into the dim glow of the yellow-shaded lamps. He was dressed not as the captain of the Sofia, but as her lowliest and most decrepit ordinary seaman. The front of his grimy once-white shirt was a nasty mural of coffee stains, grease smears, food spatters and other less definable artwork. His belly bulged over his canvas trousers, which in turn bagged around his stubby legs and were held up by a pair of vomit-green suspenders. His shoes were so scuffed it was nearly impossible to tell if they\u0027d been brown or black; they were the washed-out hue of careless despair.\n Captain Gustave Beauchene approached Michael and peered up into the other man\u0027s face. Beauchene had a grizzled gray beard and heavy jowls, his cheeks pitted with the small round scars of smallpox. His eyes, sunken in wrinkles that made Michael think of cargo netting, were nearly the same gray as his beard. His hair, too, was gray and unkempt, ratty in front and hanging down over his ears and the back of his neck. Michael had already caught the noxious fumes of very strong body odor, and also...whiskey, of course. No, that was wrong. Brandy. After all, the captain was a Frenchman.\n Beauchene reached out and took the pistol from Medina\u0027s hand. Without hesitation he put the barrel against the center of Michael Gallatin\u0027s forehead.\n \"I will give you three seconds,\" he said, as a small red glow of fury burned deep in his eyes, \"to convince me you\u0027re not either a liar or a madman.\"\n Michael saw no need to waste time. \"I was placed here to protect the Wesshausers if necessary. But mostly to watch the crew, just in case a member of the secret police got aboard. I know the histories of everyone here. You, Mr. Kpanga, are a very intelligent and ambitious man who did extremely well with his studies at the University of London. Medina, you broke your wife\u0027s right arm in a fight two years ago and your brother-in-law swore to kill you. You wound up putting him in the hospital in Seville with a knife to the belly. And you, captain...well, I know you also. Want me to tell you about the Swede?\"\n \"No,\" said Beauchene.\n Michael nodded. The less said about that child-molester at the helm, the better.\n Beauchene handed the pistol back to Medina. Then, moving surprisingly fast for a man his size, he slapped Michael across the mouth with his right hand so hard the blood bloomed from Michael\u0027s lower lip and for a few seconds tears of pain fogged his vision.\n \"How dare you,\" said the captain, in a voice made of sharp-edged gravel. \"How dare you bring this on my crew and on my ship. You British! You self-centered prigs! Playing your spy games! Fuck you and fuck all of you!\" The spittle flew from his mouth. \"I hope you will be very happy with the outcome of this! Monsieur Medina!\"\n \"Sir!\" said the Spaniard.\n \"All Stop.\"\n Medina moved toward the engine order telegraph.\n \"Don\u0027t touch that,\" Michael said.\n \"Oh, how he threatens!\" Beauchene\u0027s ugly mug twisted in an uglier grin. \"And him without a gun! Go on, give the order!\"\n \"You stop those engines,\" Michael said, \"and every man on this ship is dead.\"\n \"Christ, this one believes in himself, doesn\u0027t he? All right, my fine fucking fellow, how do you propose to kill every member of my crew?\"\n \"I won\u0027t. You will. By stopping those engines. You let that ship take the Wesshausers, and you\u0027ll think that\u0027s the end of it. But then the men on that ship will bring their machine guns and grenades and whatever else they have aboard, and they will begin murdering everyone here. Why? Because the Nazis want no international incident. They don\u0027t want the British press or the press of any other country on earth to get wind that they\u0027ve kidnapped a weapons expert who was trying to get away from them. And taken his family, as well.\" Michael paused to wipe his lip with the back of his hand. The smell of his own blood, to him, filled up the wheelhouse.\n \"You know what they\u0027ll do,\" Michael continued, and now he cast his gaze around at Medina and Kpanga to draw them in. \"They\u0027ll kill everyone and then sink the Sofia. And I\u0027m sure they didn\u0027t come unprepared for that. The Sofia becomes another statistic. A freighter, lost in the North Sea. Who can say what happened? But I can promise you, there will be no one left alive to tell the tale. So, Captain Beauchene, you stop the engines and give the Wesshausers over, and you and I and every man on this ship are dead.\"\n No one spoke.\n No one moved, but for the Sofia herself.\n The rain had strengthened, and thrashed against the glass.\n \"Madre de Dios,\" Medina whispered, his eyes huge above the black beard.\n \"Captain, sir!\" It was a voice from a room along the shadowed corridor. Michael recognized a Russian accent. \"We\u0027re receiving a radio message!\"\n No one stopped Michael when he followed the captain, Kpanga and Medina back to the small radio room. The Russian-born radioman, a sallow long-jawed drink of brine, had his earphones resting around his neck and was tuning the dials on a slab of a radio with louvers in it that displayed the red heartbeat of its tubes.\n Over a noise of static and tones that sounded like a half-drunk Scotsman playing a bagpipe as a scorched cat howled along, a firm and clipped voice from the radio\u0027s speaker said, \"Repeat: this is the German vessel Javelin, to the Norwegian freighter Sofia. Captain Manson Konnig requests you to follow his instruction. Stop engines and prepare to be boarded. Repeat: stop engines and prepare to be boarded.\"\n Then the static and tones increased in tumultuous noise and the radioman had to dial down the volume.\n \"Still jamming us,\" he told Beauchene. \"We can\u0027t get anything out, sir.\"\n \"Merde!\" The captain smacked his fist into the palm of his other hand. \"Merde! Merde! You can\u0027t break it?\"\n \"No, sir.\"\n Beauchene shot a glance of disgust at Michael. \"You see what you\u0027ve done? We can\u0027t even send an SOS! We\u0027re helpless out here!\"\n \"Tell me about their ship.\" Michael was addressing Enam Kpanga. \"When did you first spot it?\"\n \"Just after sundown. Through the binoculars it looks only like another merchant. Maybe one hundred and thirty meters in length. Wheelhouse toward the bow. Normal running lights. Two masts strung with cargo netting. The ship is riding high, so it\u0027s not loaded down. It\u0027s even been flying a Norwegian flag. We tried to hail it by radio and got no reply. Very strange, that was. It held its position for awhile off the portside stern, and then it picked up speed. We saw it drop the flag of Norway and raise a German banner. Right after that the jamming started.\"\n \"Can you determine its speed?\"\n Kpanga adjusted his glasses. Was his hand trembling just a little bit? It was hard to tell. \"If you\u0027re asking if Javelin is faster than Sofia, I would say definitely yes. It caught up very quickly. We can make top speed of seven knots - \"\n \"Eight,\" the captain interrupted with a sneer. \"Shows how little you know!\"\n \"I\u0027d say Javelin can make sixteen,\" Kpanga said to Michael, his face as impassive as stone.\n In layman\u0027s terms, Michael thought, the German ship could run rings around this piece of wallowing wreckage.\n The static and droning tones on the radio ebbed though they did not go away. The Russian dialed up the volume. A clipped voice said, \"German vessel Javelin to Norwegian freighter Sofia. Captain Konnig has generously given you thirty minutes to comply with our request. Repeat: you have thirty minutes to comply with our request or severe action shall be taken.\"\n The jamming increased in volume once more, and again the Russian turned down the racket to spare everyone\u0027s ears.\n \"Do you have guns aboard?\" Michael asked anyone who could answer.\n \"Some in the storeroom,\" Medina said. He looked pale and stunned. \"Four or five rifles. A pistol or two. Mutiny insurance. Ammunition for everything.\" He shook his head, defeated. \"I don\u0027t know.\"\n \"Any machine guns?\"\n \"I\u0027ve got a Thompson in my quarters.\" Beauchene motioned toward another closed door across the way. \"I like to have my mutiny insurance under my bunk.\"\n \"Good. You\u0027re going to need it, I think.\"\n Beauchene\u0027s eyes narrowed. \"What\u0027s your name? Gallatin, you said? Well, Monsieur Gallatin, you\u0027re going to pay for this when we get out of it. Believe me. Monsieur Medina, order engines full ahead. And change course, thirty degrees to starboard. After ten minutes, change course...oh....make it eight degrees to port. Set up a zigzag every ten minutes afterward, but keep that damned ship in our wake.\" The Spaniard was slow in responding. \"Move today!\" the captain growled.\n Medina stumbled toward the helm and the engine order telegraph.\n \"Captain?\" Kpanga asked. \"Do you want me to - \"\n \"I want you to shut your black hole,\" came the reply. \"Gallatin, let me get my Tommy and then you\u0027re coming with me. We\u0027re going to find some men who can handle firearms. Then I want to be introduced to this good German shit who\u0027s put all our necks on the fucking guillotine.\"\n Six\n Freighter Trash\n For all his sourness and bluster, Gustave Beauchene was masterful at managing his crew. Michael stood at the back of the mess hall as the captain addressed his men in no-nonsense terms. Beauchene spelled it all out. German weapons expert and family on board. Trying to get to England. A German ship with probably a Nazi captain now just a few hundred meters away, and the threat of violence to come. And not just the threat of violence, but the probability that the Sofia and her crew would be destroyed even if they bowed down and handed Herr Wesshauser over to the swastika swine.\n \"No one asked for this,\" Beauchene told them as he walked back and forth, a little Napoleon in a dirty shirt and a yellow rainslicker with his hands on his hips. \"You\u0027re not being paid any more for it.\" Michael watched him cast his hard-eyed gaze across his audience: the Norwegians, the Swedes, the Poles, the Spaniards, the French, the Dutch, the young Brit Billy Bowers and Dylan Custis the necklace-festooned Jamaican. Even the dull-witted Olaf Thorgrimsen was paying rapt attention like an Oxford student on exams day.\n \"You\u0027re working men, not fighting men,\" said the captain. \"Well, some of you are. Working men, I mean. We\u0027re here and there\u0027s not much we can do about it.\"\n \"We can get on the lifeboats and get away!\" one of the Norwegians said. \"Get off the ship! Can\u0027t we?\"\n \"And leave this beautiful bitch?\" asked Beauchene, which brought a few harsh barks and bells of nervous laughter. \"Oh, you could do that, very well. Certainement! But did you ever see the lifeboat that could stop a bullet? At least here you\u0027ve got some steel to hide behind. Rotten steel, but there you have it.\" He paced back and forth again. \"Did you men know I used to be a baker? That\u0027s right. A fucking honest-to-God baker. In the City of Light. My family business. Yes, laugh if you want to and I\u0027ll cut your nuts off. I\u0027m talking to you. In the blue shirt. What\u0027s your job? Cock stretcher?\" He turned his attention away from the giggling fool. \"A baker,\" he went on. \"Throw everything into the mix, knead it, beat it, do whatever you want to do. Pray over the fucking thing. But nothing is ready until it passes through the fire.\" He nodded, scanning their faces. \"Gentlemen, whether we like it or not...we\u0027re going to pass through some fire, very soon. I hope we won\u0027t. But I know we will. Those Nazis...they don\u0027t quit, they don\u0027t give up. They\u0027re not going to let a shipful of freighter trash stop them. Now I don\u0027t know what\u0027s going to happen, but when it starts...no one will blame the man who goes to his bunk. Hear that? I said it.\" He swelled his chest out a little. Then he motioned toward the five bolt-action rifles and the two revolvers that lay on the table before him, along with boxes of ammunition. His Thompson submachine gun - the \u0027Tommy gun\u0027 - was propped up in a corner. \"We may have some univited guests. I need seven men who won\u0027t go to their bunks. Seven men who can handle a weapon. And not just their own, with five-fingered Mary. Any takers?\"\n Michael watched. He had Medina\u0027s revolver tucked in his waistband.\n No one moved for a moment. Then a tall Norwegian with a tattoo on the back of his neck stood up and took one of the rifles. \"Stand over there,\" the captain told him.\n Two more men, one Dutch and the other a Swede, took rifles. Billy Bowers stood up and chose one of the pistols. Olaf Thorgrimsen took the second pistol. A Spaniard picked up a rifle. Then the last rifle went to another Norwegian, a squat burly man with thick black eyebrows.\n \"Load up,\" Beauchene told them. \"Get out on the deck. Choose your positions and keep watch. Don\u0027t shoot yourselves.\"\n As the men left the mess hall, the brown-haired and gray-eyed Billy Bowers glanced at Michael, his fellow Brit, and acknowledged him with a lift of the chin.\n \"That\u0027s all. If you\u0027ve got work to do, get to it. Breakfast is up in two hours.\" Beauchene retrieved his Thompson and motioned Michael to follow.\n They went to Wesshauser\u0027s door. Beauchene slammed on it with the butt of his submachine gun. A noise to rouse the dead.\n \"My God! My God! What is it?\" asked the gaunt, pallid man who peered out the door and fumbled with his eyeglasses.\n \"Your cruise is over, pussy,\" said the captain.\n Beauchene pushed in and Michael followed, feeling very ungentlemanly. He averted his gaze from Annaleisa Wesshauser, a striking-looking woman in her early forties with curly blonde hair and the aquamarine eyes of her daughter, as she sat in bed and tied her lavender-colored gown up to the throat.\n \"What\u0027s this about?\" Red swirls had surfaced on Paul Wesshauser\u0027s cheeks. He was wearing a white T-shirt and a pair of gray pajama bottoms. Behind his glasses his eyes were very dark and very angry. He had a thatch of brown hair that stuck up in spikes from its encounter with the pillow. If he was any thinner he would have fit through one of the cracks in the walls. But Michael was sure that a man desperately hiding himself and his family from the Nazis for several weeks before this trip could be arranged did lose some of his appetite for strudel.\n \"This is your Jesus,\" Beauchane told the couple, motioning with a thumb toward Michael. \"Praise him.\"\n Paul and Annaleisa looked at each other as if they\u0027d been awakened to a nautical nuthouse.\n \"My name is Michael Gallatin,\" said the man from London. \"British Secret Service. I was sent to make sure your trip was...\"\n \"Unexciting,\" Beauchane supplied, as he sat down on a floral-printed chair with his submachine gun across his knees.\n \"Unopposed,\" Michael corrected. \"And unfortunately, that no longer is the case.\"\n \"Momma?\" It was Emil, coming in sleepy-eyed and with touselled brown hair nearly like his father\u0027s. Behind him limped Marielle, wearing a long enveloping blue robe. When she saw Michael she jerked herself back out of the room as if the floor under her uneven feet was redhot.\n \"It\u0027s all right,\" Annaleisa said quietly, though Emil had by now seen the submachine gun. \"Don\u0027t worry, it\u0027s all right.\"\n Marielle\u0027s face, her blonde hair falling about her shoulders, peered carefully around the doorjamb.\n \"The German ship Javelin has come to take you,\" Michael said, standing in the center of the room. \"We\u0027re not going to let that happen.\"\n Paul regained his composure. A muscle worked in his jaw. \"How did they find out?\"\n \"Loose lips,\" said the captain, \"sink ships. True a thousand years ago, true today.\"\n \"Torture probably had something to do with it,\" Michael answered. \"Or money. There were several people who knew. One may have been a double-agent. In any case, speculation about that will have to wait for the experts to backtrack the trail. Right now, there\u0027s the Jave - \"\n \"Captain! Excuse me, please!\" Enam Kpanga had come into the room. He nodded at the Wesshausers before he focused his full attention on Beauchene. \"Sir, the ship\u0027s pulled up on the port side. They\u0027re hailing you with a bullhorn.\"\n Beauchene simply stared at the African.\n \"Sir? Did you - \"\n \"Get out of this room,\" Beauchene said, standing up from his chair. \"This is a private room. A nice room. Do you think people in this room want to smell you in here?\"\n Michael winced. He saw Kpanga swallow hard.\n \"Sir?\" the African said, with a note of pleading in his voice. \"I only wanted to - \"\n \"Smell up this room, oui. You\u0027ve done your job. Get out.\"\n Kpanga gave a look to Michael of forlorn indignation. His mouth opened as if he wished to say something, perhaps to make some explanation of the captain\u0027s remarks. But no explanation could be made. Kpanga closed his mouth, straightened his back which had begun to hunch as if readying for the strike of a bullwhip, and strode quickly out of the room.\n \"You and me,\" Beauchene told Michael. \"Up on deck.\" He braced the Thompson against his shoulder and without another word to the Wesshausers or their children he went into the hall.\n \"Wasn\u0027t that a little harsh?\" Michael asked as they walked.\n \"He\u0027s a black nigger,\" came the flat response. \"Worse than that, he\u0027s a college boy.\"\n The rain had again tapered to a nasty drizzle. A smear of faint gray light had begun to show to the east. Javelin was so close to the port side of Sofia the two ships were almost trading paint. Michael took the revolver from his waistband. The other crewmen with weapons were lined along the portside gunwale. They were facing a dozen black-garbed men, also wielding rifles and pistols, who were lined along Javelin\u0027s starboard gunwale. A Javelin searchlight swung back and forth across the scene, stabbing the eyes. Sofia, still at full speed, shuddered over a wave and shards of white foam was flung up between the hulls. The sound of diesels was the muffled beat of wardrums.\n \"Captain of the Sofia!\" called a voice over a bullhorn. \"Show yourself!\" There was a few seconds\u0027 pause. \"Captain of the Sofia! Show yourself!\" That same request and pause was repeated over and over.\n Michael had a good view of Javelin. It did, indeed, look like any ordinary freighter. Its mast and running lights illuminated coils of ropes, lifeboats, ventilation funnels, capstans, nettings, various machines and cables used in hoisting cargo and the like. Michael saw a figure in a black raincoat and a white captain\u0027s cap standing at the railing up at the blue-lit wheelhouse. Just watching, casually examining the scene. Captain Manson Konnig, in the flesh?\n \"Captain of the Sofia! Show - \"\n Gustave Beauchene stepped forward and fired off a short burst from his Tommy that shattered the arrogant searchlight and instantly killed it.\n Seven\n In Sheep\u0027s Clothing\n Two seconds after the searchlight\u0027s death, a rifle was fired from Javelin. A bullet whacked the gunwale in front of Beauchene. Someone else on Sofia pulled the trigger. A bullet sang off Javelin\u0027s superstructure. Then the shooting started overlapping each other, echoing between the ships. A porthole on Sofia was smashed. Everyone crouched down behind whatever cover they could find. A bullet zipped past Michael\u0027s left shoulder as he knelt behind the gunwale. Beauchene\u0027s Thompson chattered and bullets beat against steel.\n Several shots rang out fast upon each other, and there came a cry of pain from one of Sofia\u0027s crew. Michael got off two bullets at a man in a black rainslicker and cap who scurried up a stairway. He saw the man clutch at his left thigh. Bullets slammed into the gunwale before Michael, causing him to duck his head.\n Suddenly from amidships on Javelin there was the noise of a bolt going back.\n A belt-fed machine gun began to speak, its tone deadly. Bullets bit into Sofia\u0027s deck, ricocheted off a capstan and pocked holes through a lifeboat. Michael lifted his head and saw the machine gun and its team up on a metal-shielded platform that a few moments before had been camouflaged with a gray canvas tarp. The gunner swivelled his weapon back and forth, spraying bullets across Sofia. Michael got off two more shots and saw sparks fly off the metal shield. Then the machine gun came hunting for him and nearly chewed through the gunwale in its enthusiasm.\n More of Sofia\u0027s bullets banged into the metal shield. The gunners shifted targets and fired at the annoying hornet\u0027s nest. Michael squeezed the rest of his bullets off and quickly reloaded. A high-pitched klaxon alarm suddenly began, ear-cracking in intensity.\n It was coming from an electric whistle atop the superstructure. Javelin picked up speed and began to move away, changing course to port. The firing kept on, even as the two ships widened their distance.\n At last, there was no use in shooting because the range was too far.\n Michael stood up. Gunsmoke still whirled in the air. He watched Javelin hurry across the gray waves. \"Who\u0027s hit?\" he called, and Olaf shouted back that it was the Dutchman, shot through the right wrist. \"We held them off!\" Gustave Beauchane was on his feet but he was staggering with shock. \"We held them off! Mon Dieu, nous l\u0027avons fait!\" Then he looked to one side and his giddy grin faded. He saw the Spaniard lying a few feet away with the top of his head blown away and glistening bits of brain laid out upon the deckboards.\n His eyes narrowed, Michael was watching Javelin continue to move away at about ten knots. He saw activity at the stern. A dark shape was rising from the deck. Something covered with another tarpaulin. He wondered if an electric winch was at work.\n There was similar activity toward the bow. Something rose up on a platform to a height just above the gunwale. Men moved about in trained and deliberate order. The tarps were removed. Michael realized with a start that he was looking at the steel gun shields and the barrels of two five-inch cannons that had been artfully hidden below the deck.\n Javelin was not a freighter. It was a warship.\n A wolf, he thought. Dressed in sheep\u0027s clothing.\n As he stared across the waves in what for him was nearly shock, Michael saw Javelin swing into a broadside position.\n \"Christ!\" Billy Bowers said, standing a few feet away. He shouted the next: \"They\u0027ve got big guns!\"\n The forward cannon fired with a gout of smoke. There was a thunderclap and a waterspout rose up directly in front of Sofia\u0027s bow. The freighter trembled in a sharp turn to starboard. There was the noise of everything loose crashing together and men lost their footing on the rainslick deck. \n","sourceLink":"https://allnovel.net/the-hunter-from-the-woods-michael-gallatin-2/page-4.html","bookId":2470,"book":{"id":2470,"title":"The Hunter from the Woods (Michael Gallatin #2)","description":"Storyline: \n The Hunter from the Woods (Michael Gallatin #2) \n The Hunter from the Woods marks the much-anticipated return of Michael Gallatin, the lycanthropic hero of Robert McCammon\u0027s 1989 classic, The Wolf\u0027s Hour. These all-new, interlinked stories offer a full measure of McCammon\u0027s trademark narrative excitement, and comprise a fascinating composite portrait of a unique fictional creation. The volume opens with a pair of brief glimpses into Michael\u0027s early life in Russia and his initial recruitment into the British Secret Service. It ends with a haunting vision of the werewolf at twilight. In between, McCammon gives us three stellar novellas depicting different phases of Michael\u0027s long, brutal war against Nazi Germany.\n \n","cover":"https://allnovel.net/images/the-hunter-from-the-woods-michael-gallatin-2.jpg","author":"Robert McCammon","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-hunter-from-the-woods-michael-gallatin-2.html","creation":"Oct 5, 2019 8:58:46 AM","modification":"Oct 5, 2019 4:42:47 PM"}}
