{"id":82324,"no":9,"title":"Page 9","content":"\"Michael.\"\n \"All right, Michael. I will shoot you if you move in any way in the next two minutes. The bullet will go into your knee, and it will be a crippling shot because I am a very good shot. Then, though I desire to take you back as my prisoner, I will leave you here to die. Do you understand that?\"\n Michael nodded. He had no doubt the man would do exactly as he said. It was best to bide his time, to wait for an opportunity, and to seize it when it came. The problem was going to be seizing it with one good arm.\n Gantt removed his shirt and pulled his undershirt up over his face. He positioned it so he could see through the neckhole and his head was covered, and then he put his shirt back on and retrieved the other gear. He recapped the Trumper bottle and slid it in his pack. \"Very obedient of you,\" he said, \"and very smart. You\u0027re a major, I see. But you wear no other insignia. What\u0027s your speciality?\"\n \"Reconnaissance.\"\n \"Ah. So you\u0027re used to walking the untrodden path, is that correct?\" Gantt motioned with the pistol toward what the Berber tribesmen might call the plain of sorrows. \"After you.\"\n They went on.\n The sun was their enemy. Scorpions scuttled amid the stones at their feet. The sky was burned white, and the earth the color of ashes. The land broke into ravines and descended nearer to Hell. Sand began to pull at their boots and the dazzle tortured their eyes. The hot wind came up and tore at their makeshift keffiyehs. As he trudged onward, Michael realized only his physical training - and perhaps his supernatural training - was keeping him on his feet. He thought that Rolfe Gantt must be in excellent physical shape too, or maybe it was the sheer force of will that kept Gantt going.\n The wind strengthened and swirled sand before it. Grit stung the eyes like sharp bits of glass. They kept their faces lowered. Michael began to think that the time to act was approaching. One false stumble might do it. One stumble and sidestep and then...what? An elbow to Gantt\u0027s jaw? A knee to the groin? He doubted he would be fast enough to get through the flyer\u0027s guard; after all, Gantt was an expert at recognizing a developing danger, and it was likely he was expecting something right now. But how much longer did Michael dare go before he tried to overpower the man? He didn\u0027t have a lot of strength left and it was ebbing fast in this heat. Damn the arm! he thought angrily.\n If he had full control over his limbs, this scenario would have been finished to his satisfaction hours ago. But no, no...it was pointless to moan over a broken shoulder. He had to try something. He slowed a step.\n \"Don\u0027t slow down,\" said Gantt, indicating his level of awareness even with sand in his eyes.\n \"I need some water.\"\n \"So do I, but we don\u0027t get any. Not yet.\"\n Michael continued to slow his pace and put a small stumble in it for effect. \"Water,\" he said, calculating inches. If he could manage to knock that gun from Gantt\u0027s hand...but there was the Colt automatic in the man\u0027s waistband. Whatever happened in the next few seconds, it was going to be a dirty, close-run...\n Gantt aimed the pistol at the ground between them and fired. The bullet ricocheted off a stone and screamed away. Then the Walther took steady aim at Michael again.\n \"Don\u0027t try what you\u0027re thinking,\" said the flyer, his voice unnervingly calm. \"You would be much too clumsy. So just keep walking, like a good obedient - \"\n He suddenly spun to the right and held the pistol out before him.\n Michael looked in that direction.\n A figure stood up on a slight hill at the edge of the curtains of blowing sand.\n It was a small figure, dressed in dirty clothes that may have once been white. They were really not much more than rags that flapped in the wind. The figure wore a brown keffiyeh and on top of that sat a khaki-colored Scottish Tam O\u0027Shanter cap, which Michael knew was a common headdress among Commonwealth soldiers.\n \"Come down here!\" Gantt ordered.\n The figure did not move.\n Gantt glanced quickly at Michael. \"Do you know the language?\"\n \"A little.\" He was limited, but he did know a bit from dealing with tribal scouts.\n \"Tell him to come down here.\"\n Michael spoke the command - Come here - in first Tamazight and then Tuareg Berber. The figure turned and ran and in a few seconds was gone from sight.\n Gantt kept the Walther aimed into the swirling sand for awhile longer before he lowered it. \"What do you make of that?\" he asked, probably directing the question to himself. When Michael had no reply, the pistol found him once more. \"Keep moving. And no more playacting, please. You\u0027re no stumbler.\"\n Michael walked forward, with Gantt a few careful paces behind. The lycanthrope had decided to again bide his time, because surely an opportunity was coming. If not, he would find a way to create one before they reached the shadow of an Afrika Korps flag. Behind him, the flyer scanned left and right for more figures in the wind but none emerged.\n Michael figured Gantt must have been spooked by the strange encounter, because a few minutes after the incident the ace said, \"Entertain me. Tell me about yourself.\"\n \"I wouldn\u0027t care to waste my breath.\"\n \"Fair enough. I\u0027ll tell you about myself, then. Did you know that I\u0027ve shot down...well, it would be fifty planes including the ones today. Fifty. Do you know how many pilots have never shot down even one plane? And here I have fifty chalked up! What do you say about that?\"\n \"I say you\u0027re walking through the desert, the same as me.\"\n \"Yes, but there\u0027s a very big difference between our futures. You\u0027ll be a prisoner of war and I\u0027ll be up there again. I belong up there, Michael. It\u0027s where I truly live. Is there a place you truly live?\"\n Michael grunted quietly. The hunter from the woods is a very long way from home, he thought. \"No particular place,\" he replied.\n \"I\u0027m sorry for you, then. All men need a place where they truly live. Where their souls and spirits are free. The sky is my place. I find it beautiful, even on a stormy day when the planes are grounded. It is a woman with a thousand faces, all of them exquisite. Are you married, Michael?\"\n \"No.\"\n \"Me neither.\" He gave a short laugh. \"As if I should ever wear such a chain! The first thing a wife would say to me is, don\u0027t fly so high or so fast. And listening to her, and wanting to please her, would kill me as it has killed so many other pilots with...\" Gantt searched for the right word. \"Attachments,\" he finished. He laughed again, only this time Michael thought it sounded a little forced. \"Men like us don\u0027t need attachments, do we?\"\n \"Men like us?\"\n \"The risk-takers. The men who must be on the battlefront. Take you, for one. Your reconnaissance work. That puts you at great risk, doesn\u0027t it? And you\u0027re out front, blazing a trail through the mines and tank traps? Don\u0027t tell me you\u0027re simply a desk jockey, because I won\u0027t believe it.\"\n \"I\u0027m not simply that,\" Michael said.\n \"A man of action can recognize a man of action,\" Gantt told him. \"It\u0027s in the way you move. And you\u0027re confident, even now, even with your broken shoulder, that I\u0027ll never get you to that outpost, aren\u0027t you? Even with a pistol at your back, you\u0027re confident. You think I\u0027ll make a mistake you can take advantage of. Yes? And I\u0027m confident that I will not make a mistake. So what does that make us?\"\n \"Two confident fools in the desert with a couple of swallows of water in a shot-up canteen,\" Michael answered.\n \"No! It makes us comrades of sorts! Like chess players, you see? Two men of action, reduced to the barest minimum to survive! A challenge, to be overcome.\"\n \"I think you need some more covering for your head.\"\n \"Maybe I do, Englisher, but I\u0027ll tell you...I find your confidence in this situation to be very interesting. And entertaining. I\u0027m just waiting to see what you\u0027re going to do to keep yourself out of a POW camp. Because I know you are going to try.\"\n \"You would,\" Michael said.\n \"Of course I would! I\u0027d never give up trying. And that\u0027s why we\u0027re comrades of sorts, isn\u0027t it?\"\n \"If you say so.\" A movement to the right caught Michael\u0027s attention. When he looked, he saw across the white plain the small figure in the dirty rags and the khaki tam about a hundred meters away, keeping their pace.\n \"Ah, there he is again,\" said Gantt. \"Now...he\u0027s not a Dahlasiffa scout, or he\u0027d be on a camel. In fact, why isn\u0027t he on a camel? I make him out to be...about four feet six? A small boy, I\u0027m thinking? All alone out here? And why might that be?\"\n \"If you want to find out,\" Michael said, \"offer him water.\"\n \"And use up even a swallow of what we have? Now who needs his head covered a little better?\"\n \"If he\u0027s a native, he might know where a well is. In fact, he may be on his way there. So...one swallow of water for him could wind up filling the canteen. Once we get a decent plug in the hole,\" Michael added.\n They walked on in silence, but Michael could tell that Rolfe Gantt was thinking.\n The wind had died and the sand had spun down but the sun had grown hotter. Michael\u0027s mouth was parched. He figured the air temperature had to be at least a hundred and ten, and then the sun\u0027s heat was intensified off the desert\u0027s surface. Still, he was sweating and that was a good sign. When the sweat stopped...not good.\n \"All right,\" Gantt said at last. \"Tell him we have water.\"\n Michael abruptly stopped and Gantt pulled himself up short, then backed away a couple of steps. Out across the plain, the small boy also stopped and stared in their direction.\n Michael made the declaration in, again, both Tamazight and then Tuareg Berber.\n There was no response. \"Hold up the canteen,\" Michael said, and Gantt obeyed. Then Michael called out once more. His voice rolled through the silence, and the silence closed up in its wake.\n No response. The figure just stood there, staring.\n \"He\u0027s not coming in.\" Gantt opened the canteen, put it under his head covering and took a quick sip that he let linger in his mouth for a few seconds before he swallowed. \"Here.\"\n Michael sipped and also let the water, a warm yet delicious nectar, sit in his mouth. He sloshed it around and then, reluctantly, downed it. Gantt put the canteen\u0027s strap back over his shoulder. \"Let\u0027s go,\" said the pilot.\n For the next hour, the figure stayed with them at a distance of never less than a hundred meters. They came upon an area of sand dunes that rose up in tremendous golden waves. What looked like piles of burned black rubble lay about, the perfect shelters for horned vipers and the three-inch-long scorpions they\u0027d seen crawling around. Michael and Gantt at the same time saw the footprints leading from the hard stony surface up one of the dunes and over. Someone was walking ahead of them.\n The small figure had vanished.\n When they reached the top of the first dune, a hard slog for anyone no matter how physically fit, they saw the person who\u0027d made the footprints struggling onward about two hundred meters ahead. It was a man in tan-colored clothes and wearing black boots. He had wrapped a dark green kerchief around his head. He fell and stood up, fell again and stood up again, and kept going.\n \"Oh my God,\" Gantt said softly. \"I think...that\u0027s Hartler. My wingman. He\u0027s wearing on his head the scarf his wife sent him.\" He cupped a hand to his mouth to shout for his friend.\n Before the shout could emerge, a piece of black rubble hit Gantt on the right shoulder. At nearly the same time, Michael saw six men on camels come up over a dune and surround Gantt\u0027s wingman. Hartler fell to his knees. All the six men carried rifles, and one who seemed to be in the lead - a man wearing robes dyed bright crimson and a keffiyeh the same vivid hue - aimed his rifle at Hartler\u0027s head.\n \"Get down,\" Michael quietly told Gantt, who was already lowering himself to the sand. Michael got down on his stomach. Both of them watched over the dune\u0027s rise at the scene as it unfolded, and both knew they were in the presence of the Dahlasiffa.\n Two of the other men threw ropes around Hartler. One of the camels made a braying noise like harsh laughter, and two more got into an argument that involved the snapping of teeth until a short whip settled the disagreement. The man wearing the crimson robes and keffiyeh shot Hartler in the head at close range. The green kerchief took flight. When the rifle went off, Gantt shivered. Hartler pitched forward. His body was dragged between a pair of camels off across the sand and away.\n Neither Gantt nor Michael moved for some time. Gantt\u0027s breathing sounded like a key trying to turn in a rusted lock.\n The Walther was clutched in Gantt\u0027s hand and the hand was there within Michael\u0027s reach. But first things first.\n Michael grabbed up a handful of sand and flung it into the flyer\u0027s eyes. Then he went after the gun hand, even as the blinded Gantt clubbed with it at Michael\u0027s injured shoulder.\n Grappling for the gun, they slid halfway down the massive dune. A blow from the Walther hit Michael\u0027s collarbone on his wounded side and sent pain tearing through him. In that instant of agony his teeth began to lengthen; he could feel them bursting free from the gums. Small hairs rose up on the back of his right hand and along the arm, and the fingers began to change their shape.\n Gantt\u0027s knee crashed into his jaw. Michael fell backward, sliding away. Lights of every color glittered behind his eyes. He felt his spine contort as the change gnawed at him from the inside out. He got up on his knees and was met by a boot to the ribs. The pain of that, and the certainty that Gantt would shoot him if this meeting of men of action were to continue much longer, caused Michael to slam and lock his soul cage. The enraged green-eyed wolf held its anger in check. It slinked back into the dark. Then it settled down again to wait for a more opportune moment in which to sink its teeth into Rolfe Gantt\u0027s throat.\n \"Do you think you\u0027re clever? So damned clever? You\u0027re a fool, is what you are!\" Gantt, his makeshift keffiyeh nearly torn off, was standing over Michael with the pistol aimed at his enemy\u0027s head. \"I should shoot you!\" he seethed. \"One bullet to your brain and I\u0027m finished with you!\"\n Michael looked up at the man with his single good eye. His own keffiyeh had come undone and his face was exposed. He spat out some fresh blood, the smell of which made his thirst and hunger explode. He managed a tight smile, but he had some trouble drawing enough breath to speak. A couple of broken ribs was all he needed. \"If shooting me...is...worth bringing them back...after they hear the noise, then go ahead.\"\n Gantt\u0027s finger twitched on the trigger. But when nothing happened during the next three seconds, Michael knew the shot would not be fired. His shoulder was killing him. Currents of heat and cold coursed through his arm. It had come out of the scarf and Michael had to ease it back into place, his teeth gritted against the torment. So much for the man of action, he thought grimly.\n Gantt\u0027s attention was suddenly diverted from Michael Gallatin. \"What the hell do you want?\" he asked someone, and Michael turned his head to see the boy in the dirty clothes, the brown keffiyeh and the khaki tam standing there next to the rubble pile he must\u0027ve been hiding in. Michael surmised that the boy had seen the Dahlasiffa first, and he\u0027d thrown a piece of rock at Gantt to keep the flyer from calling Hartler and getting them all killed.\n \"Ask him what he wants,\" Gantt directed. Michael did, in the two languages, but he got no answer. \"What\u0027s wrong with him? Can\u0027t he speak?\"\n You can\u0027t speak? Michael asked, choosing the more common Tamazight.\n The boy didn\u0027t move at first. And then he lifted his right hand and made a chopping motion across where his mouth would be under the keffiyeh. He repeated it a second time, with more vicious emphasis. Michael thought he understood. Painfully, he got up and walked to the boy, who began to retreat.\n No danger here, said Michael. Let me see.\n The retreat ceased. The tam and the keffiyeh came off. The boy was about ten, with curly black hair and olive-hued skin and dark sunken eyes that had seen things no boy of ten should have ever witnessed. They were so full of misery and the shadows of sadness that they were frightening to peer into. The boy opened his mouth.\n \"His tongue\u0027s been cut out. Looks recent,\" Michael said to Gantt. Then, to the boy: Your tribe did this? That got a shake of the head and a hand pointing toward a bloody green kerchief that lay in the sand two hundred meters away.\n Dahlasiffa? Michael asked. The boy nodded once and closed his mouth. He wrapped the keffiyeh around his head and face, leaving a slit for the haunted eyes to stare through. The jaunty tam went back on, a soldier\u0027s cap for the walking wounded.\n \"What do you think happened to him?\" Gantt asked, standing behind Michael.\n \"War between tribes, I\u0027m supposing. Maybe the Dahlasiffa raided his village. Could be they left him alive and removed his tongue as a warning. Maybe he\u0027d befriended a Commonwealth soldier and the Dahlasiffa didn\u0027t like that.\" Michael rubbed his ribcage and thought it must be bruised instead of broken. He had gotten his wind back. He looked at his hand and saw no trace of the wolf. For now.\n \"Damn it,\" Gantt said, but whether he was saying it for the sake of the boy\u0027s plight or the fact that they had a straggler in their charge was unclear.\n Michael noticed something the boy was doing with his left hand. It was balled up and he kept shaking it back and forth. There was a clicking sound. Michael reached out and prodded the hand to get him to open it. The boy resisted for a few seconds, the solemn dark eyes revealing nothing.\n Then the hand opened.\n In the palm was a pair of yellowed dice with red pips.\n The boy closed his hand almost at once, and kept shaking the dice within it.\n A gift from the same soldier who\u0027d given him the tam? Michael wondered. \"Give him some water,\" he told Gantt.\n \"Hey, you don\u0027t order me around!\"\n Michael turned to face him. The green eyes were hard and, as Gantt would have put it, supremely confident. \"Water,\" he repeated. The flyer muttered a curse that would have knocked down a B-17, but the canteen\u0027s strap came off his shoulder. He uncapped the flask, stepped forward and gave it to the boy.\n Drink, Michael told him.\n The boy did. One sip under the keffiyeh, and one sip only. He knew from the amount of water in the canteen how desperate their situation was. He handed it back to Gantt, who had already gotten his head covering back into an orderly position.\n Michael was running out of his knowledge of Tamazight. He asked the boy, A well nearby?\n The boy made a motion with his right hand like a bird taking flight. He ended it with a finger pointing to the southwest. Michael took it to mean: A distance.\n Which, to these people, could be many, many miles.\n \"What are you saying to him?\"\n \"Asking him if there\u0027s a well anywhere near. He\u0027s saying...I think...that it\u0027s a distance away, to the southwest.\"\n \"How far?\"\n \"He couldn\u0027t tell me.\"\n \"I intend for us to continue our present course.\"\n \"All right,\" Michael said. \"We probably each have one swallow remaining.\" He began to work his shirt back into position over his head and face. Had he ever been so feeble in his life? he asked himself. Everything was such a damned labor. The heat was sapping even the will to move. \"Continue your present course. I\u0027m going with the boy to find a well.\"\n \"Pardon me?\" The Walther pointed at Michael\u0027s midsection.\n Behind him, Michael heard the dice clicking together in the boy\u0027s hand. What numbers were coming up? What pips of fate? Lucky sevens, or snake-eyes?\n Michael had made his decision. If he could not overpower Rolfe Gantt, he was going to die here in this desert. It would be a death of his own choosing, at least a freedom of sorts, and not a miserable wasting-away behind coils of barbed wire. Besides, when they found out what he was they would likely fly him directly to Berlin, give him over to some bald-headed mad doctor with magnified lenses for eyeglasses and a thirst for dissection, to find out how the creature ticked. He would not tick for anybody. He listened to the dice, and then he spoke.\n \"Use the gun or put it down,\" he said. His voice was calm and even, perhaps a little weary, but strong with the resolve of a man who does not fear the end. \"I\u0027m going with this boy to find a well. Maybe there\u0027s one out there, maybe not. But I\u0027m not going to let you walk me into a POW camp. Yes, I thought I could get away. Now I know I can\u0027t trick you, or beat you. My compliments. But my time is running out. Yours also.\" He paused to let that settle. The Walther did not move an inch.\n Michael said, \"I suggest you take the last of the water and continue your course. You might find a patrol or an outpost later this afternoon, or tonight, or tomorrow. You might run right into the Dahlasiffa. You have two guns, you can hold them off for awhile. Or you might run into a British patrol and then you can sit out the rest of the war but unfortunately the sky will not wait. Whatever you decide to do, Rolfe. It\u0027s your day.\" Michael dared to glance quickly up toward the sun. \"Isn\u0027t it lovely?\"\n \"You\u0027re out of your mind,\" Gantt answered.\n \"I\u0027ve come to my senses. No man will force me to do anything. Certainly not on what may very likely be the last day of my life. So, as they say: lead...follow...or get the hell out of the way.\" Michael turned his attention to the boy: The well. Take me there.\n The boy looked from one man to another. The dice kept clicking together in his hand. Then he stopped shaking them, opened his palm and regarded the number of pips revealed there. Michael thought that he too knew the great and mystic meaning of Fate in the lives of human beings.\n The boy began to walk toward the southwest.\n Michael followed.\n Gantt stood at a crossroads, though beneath him there was only shifting and uncertain sand.\n He watched the two figures, the small and the tall, walk away from him. He gazed along his present course, further to the northwest where he hoped he might find his brothers-in-arms. He looked at the canteen, and putting it alongside his ear he listened to the meager amount move within. Hardly enough to fill three thimbles.\n It was a huge desert. Sometimes an eagle who flew so high could not realize the immensity of the earth below, for he was fixed on sky and currents of air and the desire to remain in that beautiful realm forever.\n But he was fallen now, and he was just a man.\n He let the pistol drop to his side.\n His thought was: If they run into the Dahlasiffa, they\u0027re going to need me.\n Because he was a man of action.\n He drew in a long breath from the furnace. Then he began to follow the two figures, the small and the tall, across the golden dunes toward the far horizon.\n Three\n In the shadow of a rough mound of red rock carved by the Sahara\u0027s wind into a spidery shape more suited for an exhibit of Picasso\u0027s bronze sculptures, the three wanderers rested.\n The sun sat at the position of late afternoon. It, too, was turning red, and the desert landscape itself had taken on a bloody tinge. Silence reigned, but for the soft clicking that came from the dice in the boy\u0027s left hand.\n \"Does he have to do that?\" Gantt asked irritably, as he sat with his back against the rock. He had removed his head covering to let the sweat dry from his face. He was aware that he\u0027d stopped sweating so much. Their water was gone.\n Michael didn\u0027t reply. They were all arranged in various positions on the parachute, which had been laid down to shield their bodies from the heat radiating off the hard surface beneath. Michael, lying on his back with his eyes closed, saw no point in answering. He thought the boy might be a little insane.\n He, too, had removed his keffiyeh. The boy, sitting a distance away with his knees up to his chin, stared straight ahead through his slit of brown cloth, the tam on his head pale with dust.\n There was no longer a need for Gantt to brandish a gun. The Colt had gone into his parachute pack and the Walther into his waistband. They were all equals now, and all equally tired and thirsty.\n Gantt scanned the sky once more, as he had so many times. Searching for the aircraft - preferably German - that were never there. Then he focused his attention on the landscape, looking for six men on camels. Thankfully, they were never there either.\n \"Hartler was a good man,\" said Gantt. His voice was husky, his throat scratched raw by the fine grit that had gotten through his undershirt and into his mouth a few grains at a time. This was the third time he\u0027d said Hartler was a good man. Gantt closed his eyes, his head lolling. \"He was a very efficient wingman,\" he said, repeating himself. \"Trust is an important quality, isn\u0027t it, Michael?\"\n \"Yes, it is.\" Michael\u0027s eyes opened; this was a new avenue of approach.\n \"I trusted Hartler with my life. Many, many times. He had a wife and two beautiful daughters. I told him...Hartler, give this up and go home. Tell them you have a family that you wish to live for. And do you know what he answered?\" Gantt\u0027s eyes, as bloodshot as the sun, opened to take Michael in. \"He said he would go home when he was as big a hero as me.\"\n Again, Michael felt no need to respond. But he was listening, because he\u0027d heard something different in the flyer\u0027s voice.\n \"A hero,\" Gantt repeated. \"And I am, I suppose. No...I know I am. The letters and the newspapers...they say I am. Signal said it, in three issues. Yes, I am a hero. A shining light for the youth of Germany. For her future and her aspirations.\" He once more looked to the empty sky.\n \"But let me tell you...let me please tell you,\" he said quietly, \"what the life of a hero is.\" He swallowed grit and tried to gather saliva in his mouth. \"It\u0027s a hundred flash-bulbs going off in your face, but not one light on in your apartment when you get home.\n \"It\u0027s vows of undying love, faithful loyalty and reckless sex, but not one plate of a home-cooked meal. It\u0027s the look on a young man\u0027s face when he tells you he too wants to be an eagle, and you have already seen so many faces of young men burned beyond human recognition.\" Gantt was silent for awhile. The dice continued to click together in the boy\u0027s closed hand.\n \"I am the hero,\" he went on, quieter still, \"who finds the weakness in weaker men. I am the hero who strikes from below, who gives no quarter and expects none. And to tell you the honest truth, Michael, I smile a little bit when the chutes fail to open. For the hero has done his work that day. He has done his work. But oh dear God, I do love the sky.\"\n Gantt shifted his position against the rock. Michael saw him lift his left arm and regard his wristwatch.\n \"Your Rolex,\" said Gantt, with impudence returning to his voice. \"A nice playtoy, but it can\u0027t compare with a Breitling.\"\n \"Is that so?\"\n \"Absolutely so. Well, just look at the difference! Mine has a much larger face with clearer numbers, in my opinion, since yours does not have numbers but difficult-to-read bars where the numbers should be. Mine has an automatic winder and a chronograph. In fact, it\u0027s been created specificially for use by aviators. I\u0027ve had not a bit of trouble with any part of it in the four happy years of ownership. And your Rolex may be very handsome, if that\u0027s what you feel you need to project, but it doesn\u0027t have the pedigree of the Breitling.\"\n \"Hm,\" Michael commented.\n \"The Breitling brand dates from 1884. I believe the Rolex name was trademarked in 1908. If you care to calculate the difference between those years, you\u0027ll find that Breitling has twenty-four years of experience on the Rolex. What do you say to that?\"\n \"I\u0027d say Rolex caught up very quickly to Breitling and surpassed that brand in short order. They learned from Breitling\u0027s mistakes.\"\n \"Oh, really? And how exactly has Rolex surpassed Breitling?\"\n \"In the areas of waterproofing and shockproofing,\" Michael answered calmly. \"A Rolex was worn by the first British woman to swim the English channel, in October of 1927. You can imagine how cold the water was.\"\n \"Yes, unfortunately I can only imagine,\" said Gantt. \n","sourceLink":"https://allnovel.net/the-hunter-from-the-woods-michael-gallatin-2/page-9.html","bookId":2470,"book":{"id":2470,"title":"The Hunter from the Woods (Michael Gallatin #2)","description":"Storyline: \n The Hunter from the Woods (Michael Gallatin #2) \n The Hunter from the Woods marks the much-anticipated return of Michael Gallatin, the lycanthropic hero of Robert McCammon\u0027s 1989 classic, The Wolf\u0027s Hour. These all-new, interlinked stories offer a full measure of McCammon\u0027s trademark narrative excitement, and comprise a fascinating composite portrait of a unique fictional creation. The volume opens with a pair of brief glimpses into Michael\u0027s early life in Russia and his initial recruitment into the British Secret Service. It ends with a haunting vision of the werewolf at twilight. In between, McCammon gives us three stellar novellas depicting different phases of Michael\u0027s long, brutal war against Nazi Germany.\n \n","cover":"https://allnovel.net/images/the-hunter-from-the-woods-michael-gallatin-2.jpg","author":"Robert McCammon","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-hunter-from-the-woods-michael-gallatin-2.html","creation":"Oct 5, 2019 8:58:46 AM","modification":"Oct 5, 2019 4:42:47 PM"}}
