{"id":73847,"no":8,"title":"Page 8","content":"I can’t believe it myself, but, yeah: I’m into him. For real. And now I need to know, once and for all, if he’s into me.\\n\\n What that means for my friends, the other kids at school … Laurel, I have no idea. But I can’t worry about that just yet—I have to figure it out with Thayer first.\\n\\n We get out of the car. Across the street, two little girls dressed exactly alike are perched on matching bicycles, pedaling around their driveway. The grosgrain ribbons in their pigtails are perfectly coordinated to the piping on their bicycle baskets, and their sandals are the exact same shade of bubble gum pink. Laurel and I used to dress like that, back when we were friends and had less control over our wardrobe. A wave of guilt washes over me as I consider how far apart we’ve grown, and what I may do tonight. Steal Thayer from her. If I can.\\n\\n But I need to keep up the front for a little while longer, because if Thayer doesn’t like me … I hold back a shudder.\\n\\n “You guys, you should have been there last night, in the kitchen,” I say to my friends as we head down the sidewalk. “I’m telling you, Thayer’s, like, in love with me, big-time. I’m going to ask him on a picnic for tomorrow night. I’ll seal the deal there.”\\n\\n “Sweet,” Charlotte chirps.\\n\\n “He deserves it,” Mads adds.\\n\\n I throw back my shoulders confidently as we stride up Nisha’s driveway. Bass pounds from the backyard. Kids stand on the front lawn, too, and, not surprisingly, every boy we pass stares at us. As I turn around to lock Floyd, I even see a curtain flutter next door. If I’m not mistaken, it’s Ethan Landry’s house. Why doesn’t he just come tonight? It’s not like he’s bad-looking—he could totally hang out at a party if he acted normal.\\n\\n Suddenly, I’m bombarded by voices: “Sutton! You look ah-mazing!” “Is that top Thakoon?” Then I hear the distinctive, electronic click of an iPhone camera and look up. Gabby and Lili beam at me, phones in hand.\\n\\n I extend my palm. “Girls, no pictures of me in Twitter-land without my permission.”\\n\\n Gabby peers at the screen, then presents the photo to me for approval. I take in the image of myself on the sidewalk. My smile is wide and surprised. But I look a little nervous, too. A little, dare I say, in love.\\n\\n Lili is already tapping away furiously. “Thank God you guys are here. Making a grand entrance, as usual.” Then she glances at Charlotte. “Oh. Garrett was looking for you.”\\n\\n Charlotte smiles coolly. “Whatev. It never hurts to keep a guy waiting.” But even as she says it, she’s rising on her tiptoes to pick him out of the crowd. I want to make fun of her, but then I remember Garrett showing up on my porch the other day with that weird story about the phone. I’d forgotten to mention it to her—or maybe I didn’t want to. I only hope Garrett doesn’t say anything, either. Char might think I was deliberately hiding it or something.\\n\\n We enter the living room, which is spacious and decorated in stylish neutrals. A cluster of tiny tea lights twinkle from a marble console table, and the smell of gardenia mixed with beer envelops me. Almost all of my classmates are here—at least, the ones who should be here, chatting eagerly and enjoying the very last gasp of summer. Starling Russe, who’s on the tennis team, spots me and waves broadly, brandishing a giant plastic red cup. The florid hue of her pert nose tells me that whatever she’s drinking, it’s not her first. There are discarded red plastic cups on the floor, a bunch of chips spilled on the table, and a splash of something suspicious on one of the walls. The music is so loud it’s making everything vibrate.\\n\\n “Did we miss anything good?” Madeline asks Gabby loudly, craning her neck to take in everything at once.\\n\\n Gabby rolls her eyes. “Not really. Nisha’s freaking, though. I guess she assumed we were going to keep this place spotless or something.”\\n\\n I snort. “She’s wound so tight.”\\n\\n Then I spy Nisha at the foot of the stairs, holding court among a cluster of other girls from the team. But she doesn’t look stressed to me. She’s gesticulating lavishly and tossing her glossy dark ponytail over one shoulder. Several of the tennis girls glance my way and wave, but Nisha just gives me a snottily arched eyebrow. Whatever. My presence here makes the party, and she knows it.\\n\\n I continue surveying the room. There’s Jeff Katz from the football team, and Greg Richter, the actually cool class president. A couple of senior girls dressed in BCBG frocks stand impassively by the sliding-glass doors, glancing at their phones. My gaze sweeps across the faces again and again, but then I realize: Thayer isn’t anywhere. Is it possible he didn’t come?\\n\\n I lean over to Madeline. “It’s too hot in here. I’m gonna get a drink and head to the backyard.”\\n\\n She nods. “Good luck finding my brother.”\\n\\n I freeze, wondering if I’ve somehow given myself away. Does she know how I feel? Does she realize that for me, it’s not a prank anymore? But Madeline is smiling at me excitedly without a trace of guile in her expression. I breathe out, feeling drunk even though I haven’t had a sip of anything yet. Suddenly, I really do need to get outside to cool down.\\n\\n I push through pockets of people, making my way through the house. The kitchen is where the crowd is thickest, kids milling around an overflowing keg, draped across the punch-stained kitchen table, and perched, legs swinging, on the limestone countertop. Garrett works the pump for a throng of beefy jocks, though he doesn’t hold a cup of beer himself. I debate getting his attention to let him know that Charlotte’s arrived, but I quickly decide against it. He might think I deliberately sought him out.\\n\\n Then a wave of Polo cologne almost knocks me on my butt. “Hey, Sutton, looking good,” says a voice, and a freckled, green-eyed face pops up into my field of view. It’s Aidan Grove, my five-second summer crush. Now he’s looking at me eagerly, like tonight might be the night for us. But he’s not who I’m here for.\\n\\n “Hey, Aidan,” I say distractedly, glancing over his shoulder into the backyard. Where is that messy dark hair, those twinkling hazel eyes? What if Thayer decides not to come? I think of the conversation we had in the middle of the night. Are you going to Nisha’s? Probably. Why, do you want me to go?\\n\\n “So how’s your summer been?” Aidan asks. “Looking forward to going back to Hollier?”\\n\\n “Uh, sure,” I say, my eyes still on the crowd. Then I have an epiphany: Maybe Thayer is running late, later than me. Which is infuriating, because I timed our arrival for maximum impact, but maybe Thayer knows how to beat me at my own game.\\n\\n I reach into my bag and pull out my cell. Maybe he texted. But I can see right away that my home screen wallpaper is completely undisturbed. A recent snapshot of Charlotte, Madeline, and me greets me brightly, unmarred by a text bubble or missed call notification.\\n\\n “How’s your tennis game this year?” Aidan asks.\\n\\n I look up, astonished he’s still standing there. “Uh, you know.”\\n\\n “You want a beer?”\\n\\n I barely mumble a response. My insides feel like they’re on fire. I have never been so completely confounded by a member of the opposite sex. I have never not been the one to call the shots. Whatever’s going on with Thayer, it’s totally unfamiliar and new.\\n\\n And honestly? It’s kind of thrilling.\\n\\n My excitement must show on my face, because Aidan’s mouth turns up at the corners. “I’ll get you a beer, then!” he says emphatically. “Let’s party!”\\n\\n I place a hand on his shoulder, cutting him off. “Uh, on second thought, I’m cool. I think I see Madeline outside,” I say, nodding toward the back door. “I have to ask her about something.”\\n\\n He frowns. “Isn’t that Madeline right there?”\\n\\n He points behind me, and lo and behold, there’s Madeline talking to Finn Hadley, the very idiot that ditched her for the au pair earlier this summer. If I weren’t so preoccupied, I’d march over there and give her a stern talking-to.\\n\\n I turn back to Aidan. “Um, I just need …” I offer him an apologetic smile and push past him to the door. Who cares if I don’t have a good excuse? Aidan is history.\\n\\n There are fewer kids outside, and the sound of crickets and the dull buzz of conversation meld together in a pleasant hum. The night air is cool, and the damp, dewy grass tickles at my toes through my strappy wedge sandals. I inhale the scent of the warm summer evening, flavored by the scent of woodsmoke a few houses down.\\n\\n And then, from across the lawn, I see a rustling of the hedges as the gate from the front drive swings open. A boy steps through and onto the back patio. My breath catches in my throat. Thayer.\\n\\n My heart hammers as he saunters through the gate, his thick hair still damp from a shower. One curl falls messily across his forehead. He wears a short-sleeved button-down that hangs perfectly on his solid frame and jeans that outline his muscular legs.\\n\\n “Thayer,” I call out, raising one hand to wave. But then, when my gaze locks on the figure behind him, I lower my hand immediately. The girl shuts the latch of the wooden gate and trots forward to take Thayer’s hand. Her grasp is possessive and showy. He’s mine, it says. All mine.\\n\\n I take a big step back, hoping, praying, he hasn’t heard me call his name. And as the two of them step into the light, I get a good look at that blond ponytail, that compact, trim-from-tennis frame, and the pair of James jeans she only bought because I had them. And my stomach sinks to my feet.\\n\\n The girl holding on to Thayer for dear life is my sister. Laurel.\\n\\n 10\\n\\n TURNABOUT IS FAIR PLAY\\n\\n “Thayer! Hey, man!”\\n\\n I stand, rooted to the edge of Nisha’s backyard, watching as Thayer’s soccer buddies cluster around him greeting him eagerly. It’s a lot of guy-ish back-slapping and understated head-nodding. Laurel remains by Thayer’s side through every second, her eyes glued to his face. When she’s forced to let go of his hand while he says hi to the team, she looks almost like a boat that’s drifted away from its slip. She keeps a pale hand hovering near the small of his back and gazes up at him adoringly, possessively.\\n\\n What I can’t tell, though—and what’s seriously killing me right now—is whether Thayer feels the same way about her. I think about the idiotic, I-don’t-want-to-reveal-my-feelings-so-I’ll-make-you-think-I-don’t-care thing I said last night: I think Laurel wants you to go. She has a crush on you. What if Thayer took it to heart? What if they went back into the clubhouse last night and Thayer confronted her about it? Maybe Laurel was like, Yeah, I really like you. Do you like me? And Thayer, thinking I would never like him, perhaps shrugged and said, Totally. Let’s be a couple.\\n\\n He never actually denied having feelings for her, after all. And they were holding hands. My head starts to spin. I can’t believe I’m jealous of Laurel—because of Thayer. Everything about this night is totally inside out, and I only just got here.\\n\\n “Sutton! Here’s that beer!”\\n\\n I whirl around. Aidan is coming toward me, holding a bottle in his hands. There’s a hopeful expression on his face, meaning he completely missed my signals inside. \\n\\n","sourceLink":"https://allnovel.net/the-first-lie-the-lying-game-0/page-8.html","bookId":2399,"book":{"id":2399,"title":"The First Lie (The Lying Game #0)","description":"Storyline: The First Lie (The Lying Game 0.5) \\n Featuring Sutton Mercer before her tragic death, this stand-alone digital original novella from #1 New York Times bestselling author Sara Shepard is an exciting, must-read companion to the Lying Game series. \\n Back when she was alive, Sutton kept a million secrets. But how she got together with Thayer is her juiciest one of all. . . . \\n It\u0027s the summer before junior year and Sutton Mercer and her friends rule Hollier High. Then Thayer Vega returns home from soccer camp. In two short months he\u0027s gone from being her best friend\u0027s scrawny younger brother to a hot soccer god with a major ego—and a bone to pick with the Lying Game girls. \\n To bring him back down to earth, Sutton\u0027s friends convince her to string Thayer along so she can publicly reject him. But as she gets to know the real Thayer, Sutton starts to wonder: Is flirting with Thayer still just a game to her? Or is the queen of the Lying Game lying . . . to herself?\\n","cover":"https://allnovel.net/images/the-first-lie-the-lying-game-0.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-first-lie-the-lying-game-0.html","creation":"Oct 5, 2019 8:58:41 AM","modification":"Oct 5, 2019 10:29:04 AM"}}
