{"id":96798,"no":60,"title":"Page 60","content":"It had been easy enough to find a blazer. All the thrift shops had them, and he’d been patient enough to search until he found one that was a perfect fit. It was missing one of its cuff buttons, and frayed the least bit at the collar, but that just made it look like a treasured old garment, the veteran of years of faithful service.\n The white duck trousers were new, purchased at the bargain store in Greenpoint, along with a fresh supply of socks and underwear. The Greek fisherman’s cap had been harder to find, and he’d decided that any white cap would do, then happened on a store on Eighth Street that sold nothing but caps and had every imaginable kind, including just the one he was looking for. It was a perfect fit, too, which would probably not have been the case with Shevlin’s.\n The man had had a small head.\n Which, minus its teeth, now rested somewhere on the bottom of this very river, wrapped up tightly in plastic along with the tire iron that had served so well to dent Shevlin’s skull and, in due course, to knock the teeth from his jaw. It had done good service, the Carpenter thought, and deserved burial at sea, as did Shevlin, or what was left of him.\n The teeth, too, were in the river. No need to wrap them up or weigh them down; they sank like the anonymous pebbles they would soon become. And Shevlin’s hands, rendered unidentifiable, had also been consigned to the depths.\n It was, he thought, as if the original Peter Shevlin had ceased to exist, and had been reborn in the person of the Carpenter.\n H E G U I D E D T H E S H I P southward, past the piers where several cruise ships lay at anchor, past the floating museum that was the USS Intrepid, past Battery Park City and, beyond it, the site where the twin towers had stood. And on, around the tip of Manhattan Island, and under the three great bridges in turn, Brooklyn and Manhattan and Williamsburg.\n Once there had been a prominent jazz musician who had a spell when he stopped playing with other musicians, stopped perform-ing in clubs and concert halls, stopped recording. Instead he would walk out to the middle of the Williamsburg Bridge and play for hours.\n Anywhere else in the world, the Carpenter thought, they’d have done one of two things. Either they’d have told him he couldn’t do that, or they’d have all come out to hear him, until the man gave up and went home.\n New York had left him alone.\n H E R A T H E R R E G R E T T E D T H E loss of the tire iron, now resting on the river bottom with the head of Peter Shevlin. It had served him well, like the saw and boning knife, also consigned to a watery grave. And the hammers, and the chisel. A workman, he thought, was as good as his tools.\n But it was in the nature of Providence to provide. Why, it was right there in the word itself! And, even as he lost the tire iron, he’d gained something even more useful.\n It was a handgun, and Peter Shevlin had kept it on the top of the brassbound captain’s chest in the little cabin. A pair of clips held the gun in place, so that it wouldn’t come crashing to the deck when the boat pitched and rolled in high seas. The Carpenter wondered what high seas Shevlin had expected to encounter, and decided they were no less a likelihood than the need to repel pirates, which would seem the gun’s logical purpose.\n A war souvenir? Shevlin was too young for World War II, too old for Vietnam, but he supposed he could have served in Korea.\n The Carpenter considered the gun. He’d never owned one, wasn’t sure he’d ever held one aside from a BB gun at a carnival shooting gallery and the cap pistols he’d played with as a child.\n Handguns, he knew, were of two sorts. Revolvers had cylinders, which revolved; hence their name. The others were pistols, and had clips.\n This one lacked a cylinder, so it was a pistol. And, yes, moving that little lever released the clip, which contained nine little bullets. Or did you call them cartridges? He rather thought you did.\n A drawer in the captain’s chest held a box that contained more cartridges. The label proclaimed them to be .22 caliber, and they were identical to the ones in the clip. Surely military sidearms were of a higher caliber, weren’t they? And the gun looked too new, too modern in design, to be half a century old.\n Shevlin, alone in the world, had bought the gun as a ticket out of the world. Then he’d bought the boat, and decided to live. But kept the gun on the boat, just in case he changed his mind.\n He was pleased with his analysis of the gun’s history, pleased to have the weapon on the boat with him. He liked the way it fit his hand, noted how natural it felt to point it here and there, taking aim, his finger resting lightly on the trigger.\n It might be a useful tool. And, if he needed it, it might serve for the final sacrifice.\n T H E C A R P E N T E R H A D A L W A Y S assumed he would take to sailing like, well, a duck to water. He didn’t see how it could be terribly difficult. Oh, it might be tricky in an actual sailboat, where you had to know how to use the wind, but a boat powered by a gas engine couldn’t be all that difficult, could it? It wasn’t like flying a plane, where you had a third dimension to contend with. You just stayed on the water’s surface, and steered to the left or the right.\n It was, he had learned, a little more complicated than that, but not prohibitively so. And it was his good fortune that boating was evidently a pursuit the late Peter Shevlin had come to in recent years. Perhaps he’d bought it for consolation after he’d been widowed, naming it the Nancy Dee for his late wife. The Dee might stand for either her middle name or her maiden name, he thought.\n Or for Darling, or even Deceased, if Shevlin had had an unhappy marriage and a savage sense of humor.\n Or perhaps a previous owner had named the boat, and Shevlin hadn’t gotten around to changing it.\n In any event, the man had equipped himself with several manu-als on the art of handling small boats on open water, and one in particular the Carpenter found to be remarkably straightforward and easy to understand. He didn’t know that he emerged from it capable of passing a licensing exam, but he found he could take the boat out and make it do more or less what he wanted it to do.\n This gave him a sense of accomplishment, and was a source of real pleasure.\n And there were charts, too. The Carpenter couldn’t read them, but he didn’t have to; someone, Shevlin or someone assisting him, had marked routes on the charts, letting one know just where to steer the vessel.\n Shevlin was neat, probably a core requirement for the owner of a small boat, and kept the place shipshape. There was far less space than the Carpenter had enjoyed in Evelyn Crispin’s flat in Boerum Hill, but what space there was suited the Carpenter just fine. And, best of all, there was no goddamned cat to feed.\n D U R I N G T H E H O U R S O F darkness, the Nancy Dee sailed counterclockwise around the entire island of Manhattan.\n This was the first time the Carpenter had circumnavigated the island. On each of his previous outings he’d ventured a little farther from home, then turned the boat around and gone back. But he knew it was possible to make the full trip. The Circle Line did so every day of the year.\n And it went smoothly enough. He sailed up the East River, passed beneath the bridge built to carry the number 7 subway, the line that ran out to Flushing Meadows and Shea Stadium. He took the West Channel past Roosevelt Island. He went on past Gracie Mansion, the mayor’s residence, then navigated the channel separating Manhattan from Ward and Randall’s Islands. Then he was in the narrow Harlem River, passing under one bridge after another, and eventually he turned sharply left, heading west now, heading back toward the Hudson.\n And he knew (although he doubted they told you as much on the Circle Line) that, while he was circling all of the island of Manhattan, he was not encompassing the entire borough. Because on his right at this very moment was a geopolitical quirk, a little chunk of land that by all rights ought to have been part of the Kingsbridge section of the Bronx, but that was in fact a part of Manhattan. There was an historic reason for this anomaly, and he had known it once, but he couldn’t recall it now. If he had his books . . .\n The Henry Hudson Bridge, and now the Hudson River. He headed the boat south, with the spectacular two-tiered span of the George Washington Bridge in front of him. What a view, thought the Carpenter. What a voyage. What a magnificent city.\n I T W A S S T I L L D A R K when the Carpenter pulled into his slip and tied up his boat. He was tired. It was extremely relaxing to be out on the water, but it was also exhausting. He undressed, hung up his clothes, and got into bed. The boat rocked him quickly to sleep.\n When he awoke, he dressed in the same clothes he had been wearing. His backpack held a pair of dark trousers, and after he left the Boat Basin he’d stop at Barnes \u0026 Noble and change in the men’s room. He’d stow the white pants and the cap in his backpack. The blazer could go there as well, if the day was a hot one.\n Otherwise he’d wear it, as the garment was no less suitable ashore.\n Shevlin had hung a calendar on the wall alongside the bunk bed. It was from Goddard-Riverside, a social service effort, and each page bore the amateurish art of a different senior citizen, with the artist’s name and age listed. Children noted their age on their letters and drawings, the Carpenter had noticed, and so did the elderly. I know this is rubbish, they seemed to be saying, but consider how old I am. Isn’t it remarkable that I can even hold a brush?\n The calendar was hung to display the current month, August.\n Soon it would be time to turn the page, and the Carpenter did so now, to have a look at September’s masterpiece. It was the work of Sarah Handler, who was eighty-three, and it showed a bowl of round objects, which the Carpenter took to be apples.\n He picked up a red marker and circled a date. Then he turned the calendar back to August.\n twenty-eight\n HE HAD Asurprisingly good day at the keyboard. He’d anticipated trouble, having so utterly rearranged the furniture in his life. For months—since whatever happened with Marilyn Fairchild, incredibly enough—he hadn’t had sex. Aside from various cops, Maury Winters, and that rummy of a PI, he hadn’t had anyone in his apartment in longer than he could remember.\n Add in the fact that he’d just quit smoking and it seemed likely that the words would slow to a trickle, or dry up altogether.\n Instead, they poured down in buckets.\n He’d finished for the day, showered and changed, and was sitting at the window when she showed up right on time. They went to Mitali’s for Indian food and he told her the patch was helping.\n “But it was tricky getting it. You need a prescription for the thing, can you believe that? Every newsstand or deli will sell you all the cigarettes you want, but if you want to quit you’ve got to see a doctor. I went to this little drugstore on Bleecker, I don’t know how they stay in business, and I slipped the guy a hundred dollars.”\n “You had to schmear him to sell you a patch?”\n “I told him he’d be saving me time and money, and doing me a big favor. He looked around, like somebody might be watching us.\n I wonder if any of the guys in the hip-hop outfits are selling patches in Union Square. If not, they’re missing a good thing.” Walking back to Bank Street, she slipped her hand into his.\n T H E J A Z Z S T A T I O N O N the radio, with the volume turned low. She said the same thing she’d said yesterday. I’ll do anything you want. \n","sourceLink":"https://allnovel.net/small-town/page-60.html","bookId":2317,"book":{"id":2317,"title":"Small Town","description":"Storyline: \n A beautiful young woman called Marilyn picks up a stranger in a bar and takes him home to her Manhattan apartment. The next morning her housekeeper discovers Marilyn\u0027s body. Marilyn\u0027s life and death have far-reaching effects on others, even people she has never met: a charismatic former police commissioner on the verge of a breakdown; a struggling writer; a folk art dealer plumbing the depths of her own fierce sexuality; a lawyer who prefers murder trials because there\u0027s one witness fewer. And in a city reeling from 9/11, an unlikely mass murderer wages a one-man war against everyone. In this gripping, multi-faceted story, Block not only brings to life in brilliant detail the city of New York, but proves he is one of the most talented, innovative and surprising crime writers in the business.\n \n","cover":"https://allnovel.net/images/small-town.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/small-town.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:21:25 PM"}}
