{"id":114,"no":13,"title":"CHAPTER XIII. The Curtain Falls","content":"THE heavens darken; a new character enters upon the scene. They say that when great men arise they have a mission to accomplish and do not disappear until it is fulfilled. Yet this is not always true. After all his deep study and his daring action Mr. Hampden died on an obscure field, almost before the commencement of that mighty struggle which he seemed born to direct. In the great contention between the patriotic and the cosmopolitan principle which has hardly begun, and on the issue of which the fate of this island as a powerful community depends, Lord George Ben-tinck appeared to be produced to represent the traditionary influences of our country in their most captivating form. Born a natural leader of the people, he was equal to the post. Free from prejudices, his large mind sympathized with all classes of the realm. His courage and his constancy were never surpassed by man. He valued life only as a means of fulfilling duty, and truly it may be said of him, that he feared none but God. A few days after the interview noticed in the last chapter, Lord George Bentinck returned to Welbeck. Some there were who thought him worn by the exertions of the session, and that an unusual pallor had settled upon that mantling and animated countenance. He himself never felt in better health or was ever in higher spirits, and greatly enjoyed the change of life, and that change to a scene so dear to him. On the 21 st of September, after breakfasting with his family, he retired to his room, where he employed himself With some papers, and then wrote three letters, one to Lord Enfield, another to the Duke of Richmond, and the third to the writer of these pages. That letter is now at hand; it is of considerable length, consisting of seven sheets of note-paper, full of interesting details of men and things, and written not only in a cheerful but even a merry mood. Then, when his letters were sealed, about four o’clock he took his staff and went forth to walk to Thoresby, the seat of Lord Manvers, distant between five and six miles from Welbeck, where Lord George was to make a visit of two days. In consequence of this his valet drove over to Thoresby at the same time to meet his master. But the master never came. Hours passed on and the master never came. At length the anxious servant returned to Welbeck, and called up the groom who had driven him over to Thoresby and who was in bed, and inquired whether he had seen anything of Lord George on the way back, as his lord had never reached Thoresby. The groom got up, and accompanied by the valet and two others took lanthorns, and followed the footpath which they had seen Lord George pursuing as they themselves went to Thoresby. About a mile from the Abbey, on the path which they had observed him following, lying close to the gate which separates a water meadow from the deer-park, they found the body of Lord George Bentinck. He was lying on his face; his arms were under his body, and in one hand he grasped his walking-stick. His hat was a yard or two before him, having evidently been thrown off in falling. The body was cold and stiff. He had been long dead. A woodman and some peasants passing near the spot, about two hundred yards from the gate in question, had observed Lord George, whom at the distance they had mistaken for his brother the Marquis of Titchfield, leaning against this gate. It was then about half-past four o’clock, or it might be a quarter to five, so he could not have left his home much more than half an hour. The woodman and his companions thought ‘the gentleman’ was reading, as he held his head down. One of them lingered for a minute looking at the gentleman, who then turned round, and might have seen these passers-by, but he made no sign to them. Thus it seems that the attack, which was supposed to be a spasm of the heart, was not instantaneous in its effects, but with proper remedies might have been baffled. Terrible to think of him in his death-struggle without aid, and so near a devoted hearth! For that hearth, too, what an impending future! The terrible news reached Nottingham on the morning of the 22nd, at half-past nine o’clock, and, immediately telegraphed to London, was announced by a second edition of the ‘Times’ to the country. Consternation and deep grief fell upon all men. One week later, the remains arrived from Welbeck at Harcourt House, to be entombed in the family vault of the Bentincks, that is to be found in a small building in a dingy street, now a chapel of ease, but in old days the parish church among the fields of the pretty village of Marylebone. The day of interment was dark, and cold, and drizzling. Although the last offices were performed in the most scrupulously private manner, the feelings of the community could not be repressed. From nine till eleven o’clock that day all the British shipping in the docks and the river, from London Bridge to Gravesend, hoisted their flags half-mast high, and minute guns were fired from appointed stations along the Thames. The same mournful ceremony was observed in all the ports of England and Ireland; and not only in these, for the flag was half-mast high on every British ship at Antwerp, at Rotterdam, and at Havre. Ere the last minute gun sounded, all was over. Followed to his tomb by those brothers who, if not consoled, might at this moment be sustained by the remembrance that to him they had ever been brothers not only in name but in spirit, the vault at length closed on the mortal remains of George Bentinck. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/mingren/2865/79181.html","bookId":4,"book":{"id":4,"title":"Lord George Bentinck A Political Biography","description":"简介： THE political career of Lord George Bentinck was peculiar. He had, to use his own expression, sate in eight Parliaments without having taken part in any great debate, when remarkable events suddenly impelled him to advance and occupy not only a consi...","cover":"https://cunovel.com/defaultCover.png","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/2865","creation":"Aug 1, 2019 12:18:11 AM","modification":"Aug 1, 2019 12:18:11 AM"}}
