{"id":84650,"no":25,"title":"Page 25","content":"But now she was home, so she supposed she could overlook that fat bitch’s deceit. Blanche rolled off the bed and set her feet down on the velvety softness of her Persian rug. It took some work standing up without feeling nauseous, but slowly she regained her sense of balance and moved into the bathroom. The sun was going down and she was annoyed to see that the generator was off. The lights were dead. She caught her reflection in the mirror and felt a fresh surge of fury well up in her. She had paid good money for her nose job, veneers, and cheek implants. Hopefully once the swelling went down, she would be able to see the full extent of the damage. There had to be a good plastic surgeon out there somewhere still alive and serving her kind. In fact, she was sure the rich and famous were somewhere safe. She had told Stephen they should try to head out on the road to find the enclave of the rich. She was sure it was Malibu. But no, her stupid husband had dragged her out to the godforsaken town he had sunk so much money into in a ridiculous effort to revive it. Finding a box of wet wipes, she took off her clothes and tried to clean off her body to the best of her ability. She slipped on a silk robe and opened her bedroom door. The house was very quiet and she moved slowly through the hallway to the grand staircase. She hadn’t even considered if she was alone or not, but now she was curious. The stupid hicks had brought her home, but she wasn’t sure what it meant. Reaching the main floor, she saw that the doors to the dining room were open. There were boxes on the table and what looked like a piece of paper taped to one of them. Curious, she moved closer and saw that it was a note. Then, slowly, she realized the boxes must be all the supplies Shane and his men had been stockpiling. Looking into one, she saw that it was empty. Frowning, she grabbed the note. “Thanks for the food, thanks for the liquor, thanks for the sex. If you ever make it back here, know that I took the stuff to survive. Good luck, babe. You’re going to need it. By the way, you’re a fucking bitch. Ray.” Blanche growled in anger and grabbed the nearest box. It had been full of fine champagne at one time. All the boxes were empty of all the fine things she had paid Shane good money to collect. Moving into the kitchen she saw one can of chili sitting out. Another note was left on it. Grabbing the note she saw her gun under it. Confused, she read the note. “Here is dinner. Here is your gun. Hope you enjoy both.¯Curtis.” Curtis must have dropped her off here. “Dammit.” She was furious now. Picking up the can of chili, she hurled it across the kitchen and watched it shatter the lead glass of her china cabinet. Turning on her heal, she stalked to Stephen’s office. She would just have to get money out of the safe and take Stephen’s car. It shouldn’t be too hard to find another dumb ass to do her will. When she opened the door, she blinked then swore furiously. The safe was open and empty. Dammit! Shane had said that Ray had once been in prison and would do as she wanted if she paid him. Now she had a good idea what Ray had been in prison for. Stomping to the back hallway, she headed for the garage. She had a horrible fear that Ray had taken Stephen’s Mercedes, but she had to be sure. When she opened the door and found the garage empty, she screamed with frustration. Swearing, she charged back into the kitchen. Grabbing up the notes, she studied them again. Ray had fucked her and so had Curtis. She couldn’t believe they had taken her things. And what the hell had Curtis meant about her enjoying the gun? The sun would be going down soon. She scrounged around until she found a flashlight and some candles. She set up the candles and took a deep breath. The stupid fort people didn’t know who she was and what she was capable of. She had some money stashed in her closet as well as some jewels. She could go out to the stable and get the work truck. They had their own gas pump and she could gas up and leave in the morning. She just wouldn’t be traveling in luxury, but things would be fine. Comforted by this thought, she began to look for something to eat other than the disgusting can of chili. She did not want to be reminded of that gawdawful food from the fort. Finally, she found some chocolates and a bottle of wine. It would have to do. She was halfway through the box of somewhat stale chocolates when she heard the yelling. Moving to the front door, she tilted her head and caught her own name in the shouts. Slowly, she realized it was Ray’s voice. He was yelling for her. “Blanche, open the gawddamn door! Blanche! Open the door!” Hesitating, she turned back and grabbed her gun. “Blanche! Open the door! Open the gawddamn door!” Blanche peered out into the dusk looming outside her window and saw Ray running up her driveway. She started to unlock the door, then considered what his note said. With a snort she stepped back from the door. He hit the door full force. “Blanche! Open the door! I know you’re in there! I saw Curtis drop you off. Open the fucking door!” “Oh, really? And why didn’t you come to save me instead of ripping me off?” “Blanche, the car broke down, okay? I was stuck up the road and saw them leave you off. I came back as soon as I could. Now open the door! Blanche, open the door! They’re coming!” “So, you steal my things and then Stephen’s car breaks down and you come running back here because they are coming, huh?” “Blanche! Open the fucking door!” She smirked. “Ray, let me get this straight. You come to my house, steal from me, take my dead husband’s car, it breaks down, but you happen to see them leave me off, and come running back here expecting me to take you in?” “Blanche! Open the door! Open the door!” Ray’s voice was near hysterics now. “You stole from me, you son of a bitch! You fucking pathetic hick! And you expect me to take you into my home?” “Blanche! Just open the door! Just open the door! I’m out of bullets!” He was pounding hard on the door, desperate, terrified. “Open the fucking door, bitch!” Blanche opened the door and lifted her gun. For a moment, she saw Ray’s terrified expression and figures moving up the drive out of the growing darkness. “Thank God, Blanche, I-” She fired her gun and his head snapped back. He looked suitably shocked before his eyes went utterly blank and he fell back. It was then she saw the mottled, decaying figures moving up the steps toward her. “Stay off my property,”she screamed and aimed her gun. Her finger squeezed the trigger, but the gun only clicked empty. She was hit full force by the horrible reek of the undead creatures, then they were on her, knocking her back into the house and onto her expensive Persian rug. She raised the gun again, pulling the trigger over and over again. One of the zombies, screeched at her and she slapped it. “Get off me!” It didn’t recoil, but grabbed her hand and bit down. Screaming, she tried to get away, but then more were on her and suddenly she realized what Curtis had meant in his note. He had left her one bullet. She had killed Ray. Fuck! Her screams of fury filled the night until they finally gave way to screams of pain. Chapter 9 1. Gateway to Death The front door to the hospital swung open and the zombie in the pink housecoat growled and thrust her hands outward to grab the tasty human before her. Something long and sharp came straight for her and in the next second her muddled brain became nothing more than mush. With a grunt, Ken yanked the spear out of the old woman’s eye socket. The old man in the other wheelchair fumbled toward the open door, trying to reach the enticing opening where the humans were. Roger put his sneaker squarely on the gnarled knees of the dead old woman and shoved her and the wheelchair back. With a loud hiss, the old man launched himself toward Roger, but the delicious human flesh stepped back through the door and the old man landed flat on his stomach. Clawing at the floor, he tried to move through the doorway, but something hard came down on his head. He growled in frustration as the object came down over and over again. Soon, he lay silent, unmoving, his head squashed nearly flat. “That was truly disgusting,” Ken muttered. He watched Bill walk over to the lawn to try to wipe the gore off his boot on the dry overgrown grass. Bill shrugged. Lenore leaned down slowly, her gaze divided between the long expanse of white hallway and the dead old man. Tilting her head, she studied his bracelet. “He’s tagged as bitten,” she said finally. Jenni studied the sign on the door. “They took off and left the infected behind.” The sign read: Evacuated to Madison Rescue Center. Do Not Enter Hospital. Go to Madison Rescue Center. Still rubbing his boot over the rough brown grass, Bill looked up. “That will make it easier for us. Less zombies.” “Of course, we don’t know how many infected they left behind,” Roger pointed out, looking uneasy. Jenni checked her weapons one more time: her ax, one dagger in a sheath on her thigh, two revolvers, rifle, and a short spear. “There will be enough to kill us,” Jenni said honestly.","sourceLink":"https://allnovel.net/siege-as-the-world-dies-3/page-25.html","bookId":2483,"book":{"id":2483,"title":"Siege (As the World Dies #3)","description":"Storyline: Siege (As the World Dies #3) As the survivors continue to seek stability in their lives, forces both inside and outside the fort walls move them toward a final, climactic conflict between the living and the dead. Jenni, Katie and the others discover that they are not alone, that there is another enclave of survivors whose leaders plan to take over the fort. Faced with a series of difficult decisions, each choice they make could lead to the deaths of those they love or, if not careful, their own demise. Meanwhile, an army of the dead is descending on the fort. Soon, the living will face their ultimate fear... ...a siege by the dead. But they will fight to the end to survive... As the world dies.","cover":"https://allnovel.net/images/siege-as-the-world-dies-3.jpg","author":"Rhiannon Frater","type":"Horror","source":"allnovel","link":"https://allnovel.net/siege-as-the-world-dies-3.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 4:58:32 PM"}}
