{"id":84696,"no":71,"title":"Page 71","content":"“You look lost,” Lydia decided, and gently swept Katie’s hair back from her face. “I was looking for Jenni,” Katie answered glumly. “I never see her in my dreams.” “I know, honey.” Lydia smiled sweetly. She reached out and squeezed her hand. “It’s not time yet.” Katie’s mother turned, saw their clasped hands, and quickly turned back to the stove. “I miss her, Lydia. So much. She’s my best friend,” Katie whispered emotionally, tears in her eyes. “I need her here. I am so afraid. I don’t have you or her here to help me through this. I feel so emotional over the baby and so lost. Travis tries, but he doesn’t understand how this feels.” Katie pressed her hand to her stomach. Lydia fastened her gaze firmly to Katie’s face and said, “Katie, look at me.” With tears glittering on the edges of her eyes, Katie obeyed. “You’re going to be okay. You’re going to be fine. Travis will take good care of you and the baby. But you need to be careful. Things are about to become very, very difficult. Very dangerous.” “I can’t deal with anymore loss,” Katie whispered. “I know, honey. I know. But you need to listen to me. You’ve always been strong. You’ve always been confident. Trust your instincts. Do what you know is right and don’t back down.” “I need Jenni,” Katie insisted, her hands trembling. “You know, Jenni,” Lydia said with a smile. “She’ll be there when you need her. She won’t let you down. But until then, you need to be strong and listen to your instincts. Do what you know is right.” Lydia looked up sharply toward the door, then back at Katie. “I need to go now. Remember what I said.” Standing, she kissed Katie gently on the forehead and smoothed her hair before fading away. Katie’s eyes opened to see a sliver of sunlight had found its way through the closed curtains and was drawing a line of glowing light over the floor. The motes of dust swirling in the beam danced like little fairies and she smiled to herself. For some reason, Jenni felt very close in that moment. The door opened and she rolled over to see Travis slip into the room. For a brief moment she saw Juan outside the door. “What’s wrong?” she asked. Travis hesitated, then slid onto the bed. “Recon came back with photos.” “It’s not good, is it?” “No. It’s not.” Katie rolled over and lay on his lap, her arms around him. “You don’t seem surprised.” “Lydia warned me.” “Oh,” Travis answered, his fingers lightly brushing her shoulder. He seemed uncertain of what to say. “I never dream of Jenni,” Katie said finally. “Just Lydia.” Pulling herself up, she kissed his lips lightly. Travis stroked her hair and said, “I’m sure you will dream of Jenni.” “She’s come to Juan and Jason and now Rune. Why not me?” Katie couldn’t help the hurt from leaking into her voice. Travis rubbed her cheek and looked thoughtful. “Maybe it’s just not time yet.” Katie pouted then let out a heavy sigh. “Lydia told me that, too. You two conspiring behind my back?” Sliding off the bed, she tried not to feel put out. With a laugh, her husband stood up and laid his hands on her shoulders and turned her around. “Katie, your spouses got to stick together. You’re kinda tough to handle at times.” Katie made a face at him, then laughed a little. “Fine, okay.” She shook free of her hurt feelings and forced herself to concentrate on the moment at hand. “So the recon wasn’t good.” “Nope. It’s not. We’re meeting in about five minutes. We need you there.” “Does everyone in the fort know yet?” “Not yet. We’re getting the core group together to come up with strategies on how to handle telling the fort populace.” A shadow of fear flickered over Travis’ features and he looked haunted. His hand rested lightly on her belly and he kissed her forehead. “Oh, shit. That bad, huh?” Katie felt her throat tighten and her pulse quicken. “Yeah,” Travis answered. “Yeah.” Katie rubbed her suddenly wet palms against her jeans and headed to the door. Travis opened the door for her and she looked out to see Juan gazing back at her. His forehead was covered in a light sheen of sweat and he looked pale under his tan. “Shit.” “Yeah,” Juan answered. Travis shut the door behind them leaving the room empty save for the stream of sunlight glowing brightly in the darkened room. Then the curtain shifted and the light was gone, leaving the room empty and cold. 4. Facing the Truth “What we are looking at is at least fifteen thousand zombies heading straight our way,” Nerit said as the photos were slid across the table one by one. “Possibly up to twenty thousand,” Kevin added. Travis frowned as he studied one, then passed it on to his wife. “Where did they come from?” Greta shrugged. “Who knows? They’re just there. Moving straight toward us. Rune was right.” Curtis and Bill studied the photos side by side as Katarina sat down sharply and looked rather ill. Eric sighed softly, also looking a bit pale. “Could it be the people from the National Guard rescue center? Wouldn’t that be from the right direction?” “It was completely empty when we went there for supplies,” Greta noted, then shrugged again. “But why’d they leave?” “Who knows what got them started in this direction,” Katie said with a sigh. She sat down slowly in a chair next to the table and her hand pressed firmly against her belly. “We know that once they get started in a direction it’s hard to deter them.” Travis kissed the top of her head softly and rubbed her back. She leaned back into him, trying to find comfort, but not truly finding it. “Will the walls hold them back?” Bill asked abruptly. Juan shifted his weight from foot to foot, his arms crossed against his chest, his brow furrowed, then finally shrugged. “I can’t say.” “That’s not very damn reassuring,” Curtis snapped. His young face was flushed with emotion and his brow was beaded in sweat. “Yeah, well, we have been building pretty damn fast. We haven’t been sitting down and estimating how much stress those walls could take. Up until now we only had to hold off a couple hundred of those things.” Looking calm, thoughtful, but a tiny bit pale, Eric nodded. Dressed in a white shirt and navy trousers, he looked as casual as it got for him. “We haven’t done any stress tests at this point¯” he started. “Well we better hurry the hell up and figure it out,” Curtis wailed, flinging out his hand dramatically. “Cause they’re fucking coming.” “The outer wall is new,” Travis said. “That would be our major concern. I have more faith in the older walls inside,.” “We could always fall back to the inner areas,” Kevin suggested. “Less to protect,” Nerit agreed. “And the walls are thicker around the hotel and entry lock.” “We’re talking like we’re going to get overrun,” was the soft comment from Bill. The stress in the room was growing more and more palpable. Katie’s fingers found Travis hand and she held him. “It has always been a possibility,” Eric answered calmly. “Why are you such a gawddamn Vulcan about this?” Curtis nearly screamed. He backed away from the table and the photos, his eyes wide, terrified, the drops of sweat on his face rolling down to his chin. “Curtis, calm down,” Bill said softly, holding out one hand. “Just calm down.” Running his hand over his hair, Curtis backed all the way into the corner of the room, shaking his head. “We’re going to get overrun, I knew it, I knew this bullshit would happen when we brought in all those people from the mall.” “This has nothing to do with the mall,” Nerit said sharply. “The direction these zombies are coming from indicate they came most likely from the National Guard base or from Fort Worth or Dallas.” “And it doesn’t do any good to panic,” Eric pointed out. “But people are gonna panic,” Peggy’s quivering voice said from the corner. She was smoking a cigarette and her hand was trembling. “Fuck, I’m panicking. That’s a damn lot of zombies. More than we’ve ever seen out in these here parts. And if I’m panicking you know everyone else out there is going to panic, too.” “Then we have a plan in place to deal with all of this before we take it to the general population,” Travis said, his voice raw, but firm. “I agree. We have been working hard to get fire traps up, the catapults and all sorts of other defensive weapons rigged. We can take a good chunk down before they ever hit the wall,” Kevin added. “We plan carefully, then tell the people,” Nerit agreed.","sourceLink":"https://allnovel.net/siege-as-the-world-dies-3/page-71.html","bookId":2483,"book":{"id":2483,"title":"Siege (As the World Dies #3)","description":"Storyline: Siege (As the World Dies #3) As the survivors continue to seek stability in their lives, forces both inside and outside the fort walls move them toward a final, climactic conflict between the living and the dead. Jenni, Katie and the others discover that they are not alone, that there is another enclave of survivors whose leaders plan to take over the fort. Faced with a series of difficult decisions, each choice they make could lead to the deaths of those they love or, if not careful, their own demise. Meanwhile, an army of the dead is descending on the fort. Soon, the living will face their ultimate fear... ...a siege by the dead. But they will fight to the end to survive... As the world dies.","cover":"https://allnovel.net/images/siege-as-the-world-dies-3.jpg","author":"Rhiannon Frater","type":"Horror","source":"allnovel","link":"https://allnovel.net/siege-as-the-world-dies-3.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 4:58:32 PM"}}
