{"id":12182,"no":2,"title":"Chapter 2","content":"THERE wasn’t any sense to what I did then, because of the confusion in my mixed-up mind—if I had any mind at all—but the very minute the light of those three or four—or maybe there were seventeen—flashlights dropped over the edge of the hill and all of them at the same time splashed down upon me, hitting me in the face and all over my red-striped pajamas, I let loose with a wild, trembling-voiced cry like a loon’s eery, half-scared-half-to-death ghostlike quaver, loud enough to be heard as far away as the Sugar Creek bridge. I began to wave my arms wildly, to splash around in the water, and to yell to my watermelon-bronco, “Giddap!... Giddap! You great big green good-for-nothing bronco!” I let out a whole series of those wild loon calls, splashed myself off the watermelon and out of the cement pool and made a fast, wet dash down the path to the opening in the board fence, through which Poetry had already gone ahead of me. I quickly shoved myself through, and a jiffy later was making a wild moonlit run up the winding barefoot boy’s trail through the forest of giant ragweeds toward the swimming hole, crying like a loon all the way until I knew I was out of sight of all those excited girls. Even as I ran, flopping along in my wet pajamas, I had the memory of flashlights splashing in my eyes and some of the things I heard while I was going through the fence. Some of the excited words were, “Help! Help! There’s a wild animal down there in the spring!” Others of the girls had simply screamed like girls do when they are scared, but one of them had shrieked an unearthly shriek, crying, “There’s a zebra down there—a wild zebra, taking a bath in our drinking water!” That, I thought, as I dodged my way along the path, was almost funny. In fact, sometimes a boy feels fine inside if something he has done makes a gang of girls let out an unearthly explosion of screams—most girls screaming not because they’re really scared16 anyway, but because they like to make people think they are. Where, I wondered as I zig-zagged along, was Poetry? I didn’t have to wonder long. By the time I was through the tall weeds and at the edge of Dragonfly’s Pop’s cornfield I had caught up to where he was. His flashlight hit me in the face as he exclaimed in his duck-like voice, “Help! Help! A zebra! A wild zebra!” I stopped stock-still with my wet pajama sleeve in front of my eyes to shield them from the blinding glare of his flashlight. “It’s all your fault!” I half-screamed at him. “If you hadn’t had the silly notion you had to have a drink!” His voice in answer was saucy as he said back, “What a mess you made of things—falling into that water and yelling like a wild Indian! Now those girl scouts will tell your folks, and your father will really sharpen you up with his razor strap!” “Girl scouts?” I exclaimed to him with chattering teeth from being so cold and still all wet with spring water. Also for some reason I didn’t feel very brave—most certainly not very happy. “Sure,” he said, “didn’t you know it? A bunch of girl scouts have got their tents pitched up there by the pawpaw bushes for a week. Old Man Paddler gave them permission; it’s his woods, you know.” And then I was sad. Girl scouts were supposed to be some of the nicest people in the world—even if they were girls, I thought. What would they think of a red-haired freckle-faced creature of some kind that was part loon and part zebra, splashing around in their drinking water, riding like a cowboy on a watermelon and acting absolutely crazy? I would never dare show my face where any of them could see me, or some of them would remember me from having seen me in the light of their flashlights, and they would ask my mother whose boy I was. I knew that one of the very first things some of those girl scouts would do this week would be to come to the Collins’ house to buy eggs and milk and such things as sweet corn and new potatoes. Some of them would be bound to recognize me. “We had better get back to the tent and into bed quick, before17 somebody comes running up to use your telephone to call the police, or the marshal, or the sheriff, to tell them some wild boys have been causing a disturbance at the camp!” Poetry said. It was a good idea even if it was a worried one, so away we went—not the way we had come, but lickety-sizzle straight up through Dragonfly’s Pop’s cornfield, swinging around the east end of the bayou and back down the south side of it until we came to the fence that goes south to Bumblebee Hill. Once we got to Bumblebee Hill we would swing southwest to the place where we always went over the rail fence, which was across the road from our house. Then we would scoot across the road and past “Theodore Collins” on our mailbox, hoping we wouldn’t wake up Theodore Collins himself in the Collins’ west bedroom, and a jiffy after that would be safe in our tent once more! The very thought of safety and the security of Poetry’s nice green tent under the spreading plum tree gave me a spurt of hope, and put wings on my feet, as I followed my lumbering barrel-shaped friend, not realizing there would be more trouble when I got home on account of my very wet red-striped night clothes. We didn’t even bother to stop at Bumblebee Hill where the fiercest fastest fist-fight that ever was had taken place—and which you already know about if you’ve read the story called We Killed a Bear. At the bottom of the hill, you know, is the Little-Jim tree near which Little Jim, the littlest member of our Gang, killed the fierce old mad old mother bear; and at the top of the hill is the abandoned cemetery where the Gang has so many of its meetings. The wind I was making as I ran was blowing against my very wet 89-pounds of red-haired boy, making me feel chilly all over in spite of it being such a hot night. It was a shame not to be able to enjoy such a pretty Sugar Creek summer night—the almost most-wonderful thing in the world. I guess there isn’t anything in the whole wide world that sounds better than a Sugar Creek night when you are down along the creek fishing and you hear the bullfrogs bellowing in the riffles, the katydids rasping voices calling to one another: “Katy-did, Katy-she-did;18 Katy-did, Katy-she-did!” the crickets singing away, vibrating their forewings together, making one of the friendliest lonesome sounds a boy ever hears. Every now and then, you can hear a screech owl crying “Shay-a-a-a-a!” like a baby loon learning to loon. Oh, there are a lot of sounds that make a boy feel good all over, such as Old Topsy, our favorite horse, in her stall crunching corn, the queer sound the chickens make in their sleep, the wind sighing through the pine trees along the bayou, with every now and then somebody’s rooster turning loose with a “Cocka-doodle-do!” like he is so proud of himself he can’t wait until morning to let all the sleeping hens know about it—like it was a waste of good time to sleep when you could listen to such nice noisy music. From across the fields you sometimes hear the sound of a nervous dog barking, and somebody else’s dog answering from across the creek. You even like to listen to the corn blades whispering to each other as the wind blows through them. Summer nights on our farm smell good, too—nearly always there being the smell of new-mown hay or fresh pine-tree fragrance which is always sweeter at night. If you are near the creek you can smell the fish that don’t want to bite, the wild peppermint, the sweet clover and a thousand other half friendly, half lonely smells that make you feel sad and glad at the same time. Things you think at night are wonderful, too. You can lie on the grass in the yard and, in the summertime, look up at the purplish blue sky that is like a big upside-down sieve with a million yellow holes in it and in your mind go sailing out across the Milky Way like a boy skating on the bayou pond, dodging this way and that so you won’t run into any of the stars.... But this wasn’t the right time to hear or see or smell how wonderful a night it was. It was, instead, a time for two worried boys, including a red-haired freckle-faced one to get inside the tent and into bed and to sleep. Pretty soon Poetry and I were at the rail fence across from “Theodore Collins” on our mailbox. There we stopped stock-still and stood and studied the situation, keeping ourselves in the shadow19 of the elderberry bush that grew there. It seemed like the moonlight was never brighter and we couldn’t afford to let ourselves be seen or heard by anybody who hadn’t used a razor strap for a long time but who perhaps hadn’t forgotten how—and not on his razor, either. I was shivering with the cold, and just that second I sneezed. Just that second also, Poetry shushed me with a shush that was almost louder than my sneeze, as he whispered, “Hey, don’t wake anybody up! Do you want your guest to get a licking? Your father has told us for the last time to—” “Shush, yourself!” I ordered him. We decided to go back up the fence, cross the road by the hickory nut trees, climb over into our cornfield and sneak down between the rows to arrive at the tent from the opposite side so nobody could see us from the house, which we did. We had to pass Old Red Addie’s apartment hog house on the way, which is the kind of place on a farm that doesn’t have a nice, clean, sweet farm smell. Pretty soon, still shivering and wishing I had dry night clothes to sleep in, we were behind the tent waiting and listening to see if we could get in without being seen or heard. Right then I sneezed again, and also again, and I knew I was either going to catch a cold or I already had one. I quick lifted the tent flap, swished through the plastic screen door, expecting Poetry to follow me, but he didn’t and wouldn’t. He stood for a second in the clear moonlight that came slanting through a branchless place in the plum tree overhead, then he said, “I’ll be back in a minute.” He started to start toward the house—in the moonlight, mind you, where he could be seen! “Wait!” I called to him, in as quiet a whisper as I could. “Where are you going?” “I’m thirsty,” he whispered back. “I forgot to get a drink at the spring.” “You’ll wake up my father!” I exclaimed to him. “Don’t you dare pump that pump handle!” Poetry couldn’t be stopped. I knew that if Pop ever waked up and came to prove he had meant what he said when he had said20 what he said, there’d really be trouble. Pop would hear me sneeze, or see my wet night clothes and wonder what on earth, and why. So in a jiffy, like the story in one of our school books about a man named Mr. McGregor chasing Peter Rabbit who was all wet from having jumped in a can of water to hide—and Peter Rabbit sneezing—I was acting out that story backwards: I myself was a very wet, very dumb bunny chasing Leslie Poetry Thompson to try to stop him from getting us into even more trouble than we were already in. We arrived at the iron pitcher pump platform at the same time, where I hissed to him not to pump the pump, pushing in between him and the pump, blocking him from doing what his stubborn mind was driving him to do. “I’m thirsty,” he squawked to me. “The pump handle squeaks!” I hissed back to him and shoved him off the pump platform. My left wet pajama sleeve pressed against his face. What happened after that happened so fast and with so much noise it would have wakened seventeen fathers, as Poetry, my almost best friend who had always stood by me when I was in trouble, who was always on my side, all of a sudden didn’t act like he was my friend at all. We weren’t any more than three feet from the large iron kettle filled with innocent water, which up to that moment had been reflecting the moon as clearly as if it had been a mirror—clearly enough, in fact, for you to see the man in the moon in it. The next second Poetry’s powerful arms were around me and he was dragging me toward that big kettle. The next second after that, he swooped my 89 pounds up and with me kicking and squirming and trying to wriggle out of his grasp and not being able to, he sat me down kerplop-splash, double-splashety-slump right in the center of that large kettle of water. “What on earth!” I exclaimed, my voice trembling with temper, my teeth chattering with the cold and my mind whirling. My words exploded out of my mouth at the very minute Pop came out the back door. “‘What on earth!’ is right,” he exclaimed21 in his big father-sounding voice. “What on earth are you doing in the water?” Poetry answered for me, saying politely like he was trying to save somebody from a razor strap, “It’s all my fault, Mr. Collins. We were getting a drink and I—I shouldn’t have done it—but I pushed him. I—.” Then Poetry’s voice took on a mischievous tone, as he said, “The water was so clear and the man in the moon reflected in it was so handsome, I wanted to see what a good-looking boy would look like in it. I couldn’t resist the temptation.” Such an innocent voice! So polite! I was boiling inside as I splashed myself out of the kettle and stood dripping on the pump platform. Then I did get a surprise. Pop’s voice, instead of being like black thunder, which it sometimes is at a time like that, was a sort of husky whisper: “Let’s keep quiet—all of us. We wouldn’t want to wake up your mother, Bill. You boys get back into the tent quick, while I slip into the house and get Bill a pair of dry pajamas. Hurry up! QUICK, into the tent!” Pop turned, tiptoed to the back screen door, opened it quietly, while Poetry and I scooted to the tent. A second later, we were inside in the shadowy moonlight which oozed in through the plastic window above my cot. Pop was back out of the house almost before I was out of my wet pajamas. He whispered to us at the tent door, “Here’s a towel. Dry yourself good. Put these fresh pajamas on—but, BE QUIET!” He whispered the last two words almost savagely. “Here, let me have your old wet ones. I’ll hang them on the line behind the house to dry—and remember, not a word of this to your mother, Bill. Do you hear me?” “Don’t worry,” I said. It was easy to hear anything as easy to listen to as that. And Pop was gone. In only a few jiffies I was dry and had on my nice fresh clean-smelling, Mom-washed stripeless yellow pajamas, and there wasn’t even a sniffle in my nose to hint that maybe I would catch cold. Boy oh boy, was it ever quiet in the tent—the only sounds being22 those in my mind. Everything had happened so fast, it seemed as if it had taken only a minute. It also seemed like a year had passed—so many exciting things had happened—crazy things, too, such as a boy galloping around in a pool of cold water on a green watermelon, and a gang of girls screaming like wild hyenas that there was a zebra taking a bath in the spring. “Wait,” Poetry ordered, as I sat down on the edge of my cot and started to crawl in. “We can’t get in between your mother’s nice clean sheets with feet that have waded through mud and dusty cornfields. I’ll go get the wash pan from the grape arbor, fill it with water, and bring it back.” “You stay here!” I ordered. “I don’t trust you outside this tent one minute! I’ll get the water myself.” Say, do you know what that dumb bunny of a fat boy answered me? He said in his very polite voice, “But I’m thirsty—I haven’t had a chance to get a drink—I—” “Stay here!” I ordered. “I’ll bring you a drink.” “After all I’ve done for you, you won’t even let me go with you?” he begged. “What have you done for me, I’d like to know? You—with your plunking me into the middle of that kettle of water?” Poetry’s strong fat hands grabbed me by the shoulders and shook me. “Listen, Chum,” he said fiercely; “I saved you from getting a licking, didn’t I? I heard your father opening the back door, and I knew he’d be there in a jiffy. If he found you all wet with that spring water, he’d have asked you how come, and you’d really have been in a pretty kettle. So I pushed you in with my bare hands, don’t you see? Besides—look at this!” Poetry turned on his flashlight, reached over to the foot of his cot and picked up a long black something-or-other with a handle on it, and extended it to me. AND IT WAS POP’S RAZOR STRAP! “He had it in his hand when he came out the door,” Poetry told me. “He accidentally left it on the pump platform when he went in for the fresh pajamas. Now, am I your friend, or not?” Looking at the eighteen-inch-long blackish-brown leather razor strap in Poetry’s hand, and remembering the last time Pop had23 given me a few interesting strokes with it, I decided maybe Poetry really had been my friend. Besides, if I let him go to get a pan of water for washing our feet, and if Pop saw and heard him, Pop would probably not say a word—he not wanting to wake Mom up. “All right,” I said to Poetry, “but hurry back.” Which he did. Pretty soon we had our feet washed and dried on the towel, which I noticed when we got through might also have to be washed in the morning. In only a little while we were in our bunks again and sound asleep, and right away I began dreaming a crazy mixed-up dream in which I was running in red-striped pajamas through the woods, leaving the path made by barefoot boys’ bare feet and working my way around to the left along the crest of the hill where the pawpaw bushes were, just to see how many girl campers there were. Then it seemed like I was in the spring again, galloping around on a green no-legged bronco which somebody had stolen and plugged and maybe sold to the girls—or even given to them—or maybe some of the girls had invaded our melon patch that very night and stolen it themselves. I hated to think that, though, ’cause any girl who is a girl scout is supposed to be like a boy who is a boy scout, which is absolutely honest. Besides as much as I didn’t like girls—not most of them anyway—and was scared of them a little—it seemed like there was a small voice inside of me which all my life had been whispering that girls are kind of special—and anybody couldn’t help it if she happened to be born one. Mom had been a girl for quite a few years herself, and it hadn’t hurt her a bit. She had grown up to become one of the most wonderful people in the world. But who had stole my watermelon? And how had it gotten down there in the spring? It was my melon, of course! The idea woke me up. Or else my own voice did, when I heard myself hissing to Poetry: “Hey, you! Poetry! Come on, wake up!” He groaned, turned over in his cot, and groaned again. “Let me sleep, will you?” “No,” I whispered, “wake up! Come on and go with me. I’ve got to go down into our watermelon patch to see—” 24 “I don’t want any more water,” he mumbled, “and I wouldn’t think you would either.” “That melon in the spring,” I said. “I just dreamed it was my prize melon! I think somebody stole it. I want to go down to our truck patch to see if it’s gone.” Poetry showed he hadn’t been asleep at all then, ’cause he rolled over, sat up, swung his feet out over the edge of his cot and onto the canvas floor, and I knew we were both going outside once more—just once more. What we were going to do was one of the most important things we had ever done—even if it might not seem so to a boy’s father if he should happen to wake up and see us in the melon patch and think we were two strange boys out there actually stealing watermelons. Poetry and I were pretty soon outside the tent again in the wonderful moonlight where now most of the cicadas had stopped their wild whirrings and the crickets had begun to take over for the rest of the night. Fireflies were everywhere, too. It seemed like there were thousands of fireflies flashing their green lights on and off in every tree in our orchard and in all the open spaces everywhere. The lights of those that were flying were like short yellowish green chalk marks being made on a schoolhouse blackboard. Poetry, with his flashlight, was leading the way as he and I moved out across our barnyard. When we were passing Old Red Addie’s apartment hog house, I was reminded again that all the smells around a farm are not the kind to write about in a story, so I won’t even mention it but will let you imagine what it was like. At the wooden gate near the barn, Poetry said, “Listen, will you?” I listened, but all I could hear was the sound of pigeons cooing in the haymow, which is one of the friendliest sounds a boy ever hears—the low lonesome cooing of pigeons. There are certainly a lot of different sounds around our farm, nearly all of which I have learned to imitate so well I actually sound like a farmyard full of animals sometimes, Pop says. Mom also says25 that sometimes I actually look like a red-haired freckle-faced pig—which I probably don’t. Say, did you ever stop to think about all the different kinds of sounds a country boy gets to enjoy? While you are imagining Poetry and me cutting across the south pasture to the east side of our melon patch, I’ll mention just a few that we get to hear a hundred times a year, such as the wind roaring in a winter blizzard, Dragonfly’s Pop’s bulls bellowing, Circus’s Pop’s hounds baying or bawling or snarling or growling; Mixy, our black and white cat, meowing or purring; mice squeaking in the corncrib; Old Topsy neighing; Poetry’s Pop’s sheep bleating; all the old setting-hens clucking; the laying hens singing or cackling; Big Jim’s folks’ ducks quacking; honey and bumblebees droning and buzzing; crows cawing; and our old red rooster crowing at midnight or just at daybreak; screech owls screeching; hoot-owls hooting; the cicadas drumming, and the crickets chirping. Yes, and Dragonfly sneezing, especially in ragweed season, which it already was in the Sugar Creek territory. There are a lot of interesting sounds, too, down along the creek and the bayou, such as water singing in the riffles, the big night herons going “Quoke-quoke,” cardinals whistling, bob-whites calling, squirrels barking—and when the gang is together, the happiest sounds of all with everybody talking at once and nobody listening to anybody. There are also a few sounds that hurt your ears, such as Pop filing a saw, Old Red Addie’s family of red-haired pigs squealing, the death squawk of a chicken just before it gets its head chopped off for the Collins’ family dinner, and the wild screams of a bevy of girls calling an innocent boy in red-striped pajamas, a zebra! In only a few jiffies we were out in the middle of our truck patch looking to see if any of the melons were missing. I was just sure that when I came to Ida’s vine, I’d find a long oval indentation where she had been—the dream I had had about her being stolen was so real in my mind. “All this walk for nothing,” Poetry exclaimed all of a sudden,26 when his flashlight landed ker-flash right on the green fat side of Ida Watermelon Collins, as peaceful and quiet as an old setting hen on her nest. I stood looking down at her proudly, then I said in a grumpy voice, “What do you mean, making me get up out of a comfortable bed and drag myself all the way out here for nothing! You see to it that you don’t make me dream such a crazy dream again—do you hear me!” I felt better after saying that, then Poetry beside me grunted grouchily, and said, “And don’t ever rob me of my good night’s rest again either!” With that, we started to wend our barefoot pajama-clad way back across the field of vines and other melons in the direction of the barn again. We hadn’t gone more than fifteen yards when what to my wondering ears should come but the strange sound of something running—that is, that’s what I thought it sounded like at first. I stopped stock-still and looked around in a fast moonlit circle of directions, and saw away over by the new woven-wire fence not more than twenty feet from the iron pitcher pump, something dark about the size of a long, low-bodied extra-large raccoon, moving toward the shadows of the elderberry bushes. I could feel the red hair on the back of my neck and on the top of my head beginning to crawl like the bristles on a dog’s or a cat’s or a hog’s back do when it’s angry—only I wasn’t angry—not yet, anyway. A little later, I was not only angry but my mind was going in excited circles. If you had been me and seen what I saw, and found out what I found out, you’d have felt the way I felt, which was all mixed up in my thoughts, worried and excited and stormy-minded, and ready for a headfirst dive into the middle of one of the most thrilling mysteries that ever started in the middle of a dog day’s night.","sourceLink":"http://novel.tingroom.com/duanpian/2785/77146.html","bookId":1307,"book":{"id":1307,"title":"Watermelon Mystery at Sugar Creek","description":"简介： IF I hadnt been so proud of the prize watermelon I had grown from the packet of special seed Pop had ordered from the State Experiment Station, maybe I wouldnt have been so fighting mad when somebody sneaked into our truck patch that summer night and...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2785","creation":"Aug 1, 2019 12:24:50 AM","modification":"Aug 1, 2019 12:24:50 AM"}}
