{"id":86575,"no":44,"title":"Page 44","content":"\n He\"d told her he loved her, had known how deeply that would disturb her, and yet now he was wrapping it up in this, something impossible, magical, a near out-of-body experience that was happening in her body, because the last thing she wanted to do was leave her body at the moment. It made the impossible possible, and she realized how clever he was. She didn\"t have the brain cells to resist it, or him.\n Her nipples began to tingle and then respond as if being pinched by unseen fingers, stroked, plucked. “Oh…” she cried out as the sensors he\"d put in her anus came to life as well. It was as if a man\"s thick finger, lubricated and ready, had slid into her there while his mouth was so busy at her pussy, more hands and mouths on her nipples.\n Suckling, teasing, as other places were stroked, gripped and pulled. She snapped her head back on her shoulders, then rocked it forward, her hair tangling around her face.\n The book had changed to match the image she was feeling. Two men, taking a woman from the front and behind, as others closed in, pressing a kiss along her thigh, sucking her fingers, biting her throat.\n This time it was a scream he wrested from her, as those sensations descended upon her in full force, engaging her imagination and taking it even further. The tongue was replaced by a definite penetration, a sense of a man\"s cock stretching her, his testicles pushing down on the outside, his cock stretching her enough her clit felt the pressure, the friction. At that same moment, the finger now deep inside her rectum withdrew…she felt it withdraw, and then it was replaced. Burning, as if a thick cock had pushed into her from behind, taking her ass at the same time another man took her pussy.\n The suckling feeling on her nipples increased, as did the sense that a hand was closed on her throat, holding her, reminding her she was her Master\"s slave, all of this done by his will. The stimulation was incredible, overpowering, overwhelming. She was vibrating in the chair, responding to the thrusts, even if she couldn\"t move much.\n The holographic images around her had changed, no longer gentle, sensual nature scenes. It was a crowd of men, rough-looking, raw, alpha men, men with lust in their eyes, watching, waiting, because they would take her like this, over and over again, at her Master\"s behest, bringing her to climax until she was overcome from too many brain-shattering orgasms. She could feel their hot breath, the heat of their lust, sense the arousals pressing against constricted jeans, visualize the flex of muscles under their T-shirts. Many were shirtless, an outright display of virility. She imagined those muscles rippling, firm buttocks pumping as they shoved into her, took her to ecstasy, again and again. They would take, because her Master had decreed they could, because he fed off her pleasure like a drug.\n Where was he in all of this? She needed to see him…she knew his hands were on the controls, but things were so crazy now, had become so fantastic, she needed to see him, needed the reality of him.\n “Master…” she cried out for him, again and again, until suddenly the hologram shimmered to darkness, the tablet gone. She let out a glad cry, tears inexplicably springing to her eyes as his very real hands closed over her throat, his lips on her open mouth. His tongue tangled against hers and she shattered in that red and dark womb of pure lust and need, sheer feeling. Though the hologram was gone, the thrusting, licking, pinching, stroking never stopped, and she screamed out the orgasm, so harshly she felt the pain to her vocal chords, still raw from last night, but she couldn\"t stop.\n Right now there was no conscious thought of that, of anything but how his hands, that flesh and blood collar, and the demand of his lips, made it all his demand, his desire…\n It took her past orgasm and into an even more intense realm, like a trip to the fairy world where time passed so differently. She wasn\"t sure if she ever finished. Her body simply reached the limit of its endurance. She continued to weakly jerk and whimper, emitting sudden long and plaintive cries as she was hit by short, intense aftershocks. It was as if the cocks were still fucking her, the mouths suckling her nipples, the hands elsewhere on her skin, but now they all moved in unhurried, deep rhythms, the suckling and caresses a soft squeezing instead of harder pinches. Those hands on her back, arms, legs, were kneading, like when Jon gave her the massage. She was limp again, waiting for the next onslaught with no ability to resist it. If he was going to cut her into pieces now, she had no objection.\n At long, long last, everything came to a slow, teasing halt. She lay against the chair, her head back as Jon\"s mouth cruised over her brow, her lips, her nose. She was released from the chair, but she had no ability to do anything. He stripped the suit off her, leaving her naked, and lifted her in his arms. Guided by dim wall lights, he carried her back up the stairs. Her eyes were half shut, her body hanging in his grip, but she realized he\"d ascended the stairs to the loft when she was laid in his bed. Looking up, she saw the natural twists of the canopy, the crossed arms of a tree. Those two tall plates of dark blue glass shimmered with the fall of water, a soothing whisper of sound.\n Her arms fell out to either side when he laid her down, because she didn\"t have any strength, but she tried to part her legs, knowing she needed to be in that position. He\"d told her so, right? Always accessible.\n “Good girl,” he said. His expression and voice were as raw and rough as any of those fantasy holographic images. Then he was lying down upon her, and he was as bare as she was. She made a yearning noise as his cock, enormous, hard steel, pushed into her soaked pussy. The inner tissues were so stimulated she kept making the cry.\n His size was because of watching her reaction. Because of her.\n “Just lie there,” he said. “Take your Master.”\n She wanted nothing else, nothing but to feel him inside of her, the way his cock\"s head pushed through those tight walls, then dragged back, then forward again. She couldn\"t possibly orgasm again so soon, but sensations almost as deep and intense as those aftershocks rippled through her. Having him inside her, taking her like this…there was something as fulfilling and satisfying about it as even the strongest orgasm she\"d ever experienced. This was the one thing the marvelous device he\"d created couldn\"t provide, the most important thing. Intimacy.\n “Jon…Master. Please…my arms…”\n He understood. He slid his arms around her waist, up under her shoulders, giving her the support she needed to lift her heavy, quivering arms and wrap them around his neck. She gazed up at him as he held her eyes in his, that midnight blue, the pupils dilated in determined lust.\n “Call me that again.”\n “Master.” She had no hesitation about it right now, not with everything open to him. And he hadn\"t torn her open, as she\"d feared would happen. He\"d simply opened her like sunlight opened a flower, an inexorable compulsion toward life and growth, something no living thing could truly resist. The way he reacted to her calling him that—the flex of his jaw, the concentration in his eyes, the way his thrusts became more demanding, asking more of her body than she thought possible but wasn\"t—made it all so worth it.\n When he came, seed jetting deep inside of her, she realized he hadn\"t worn a condom. But there was no need. Whatever came from this union, she would want with every ounce of her being.\n Only a fool protected herself from something sacred.\n Chapter Fourteen\n Euphoria lingered, a sense that she was caught in a dream and happily content to stay there without questioning anything. Once they\"d both recovered enough, he\"d bundled her in a thick robe, sat her at the bar in his kitchen and cooked her a light early supper—crepes with strawberries and whipped cream. He fed it to her as well, sitting so her knees pressed against the inside of his thighs as he faced her on a matching stool.\n He\"d only pulled on a pair of jeans, leaving the top unbuttoned, and he indulged her desire to touch. She\"d dipped her fingers in the whipped cream, painted them along one pectoral, then leaned in to kiss, lick. Every move lazy, erotic but not driven to sex, not right now. Now was all about feeling every small moment of pleasure, and when he caught her wrist at last, lifted her hand to suck the stickiness off her fingers, she gazed at him, quietly amazed to see her hand being held in the grasp of his with such casual possession.\n When he took her on a more thorough tour of his workshop, he explained some of his work-related projects. She noted he kept her drawn close to his side, making sure she didn\"t trip over anything in the clutter. After that, he helped her back into her dress and comfortable sneakers to take her on a short walk of the property, strolling through the woods as he pointed out different features. He was a patron of local artisans, she saw, having installed a variety of natural sculptures off the paths, interesting shapes and forms that blended into the landscape. When they got to the alligator\"s pond, she saw he had a screened gazebo there with a hammock inside. They took a nap, her lying in his arms, both of them rocking with the wind that passed through the gray and green forest, the calls of nature all around them.\n As they\"d walked through the woods, her arm had been around his waist, thumb hooked in the belt loop of his jeans, his arm draped over her shoulder. They walked well together, the slide and bump of their bodies as natural a rhythm as they\"d found during their coupling. She didn\"t know what she\"d been expecting as an aftermath, but like his device that took into account all the many erogenous points of a woman\"s body, a way to nurture the full range of her emotional needs as well. Jon had chosen to spend the rest of the afternoon letting her see his world, ask questions and simply be with him, feel how easy that was. How right.\n The uneasiness didn\"t start to return until night drew in and she knew they would soon be going to the club. He laid out the clothes he\"d bought for her, enjoyed watching her don them, so much that her body, in a pleasurable languor most of the afternoon, began to stir again. He was already dressed when he told her to finish her makeup and left her for a few minutes, saying he needed to check on something in his workshop.\n Nervous enough already, she didn\"t dare speculate on what he needed from there, but she finished her makeup and hair, straightened up the bathroom, folded his jeans and T-shirt and left them on the dresser before coming downstairs to the main room. \n","sourceLink":"https://allnovel.net/afterlife-knights-of-the-board-room-4/page-44.html","bookId":1903,"book":{"id":1903,"title":"Afterlife (Knights of the Board Room #4)","description":"Storyline: \n Afterlife (Knights of the Board Room #4) \n Part of the Knights of the Board Room series. Rachel gave up seeking a Master years ago. After a failed marriage and terrible tragedy, she\u0027s walled her soul against going down that dangerous path again. Then Jon joins her yoga class. He\u0027s thirteen years younger than she, but his Dominant nature threatens her shields from the moment she recognizes it. Not only does he understand what her body wants-he knows what her soul craves. Part of the five-man executive team of Kensington \u0026 Associates, Jon uses his calm, philosophical nature to defuse volatile acquisition negotiations. He can compel opponents to willingly surrender when he draws the sword that closes the deal. As a sexual Dominant, he employs that same expertise. A spiritually driven Master who enjoys connecting with a woman\u0027s soul, he wins her utter submission with his skills. But with Rachel, it goes beyond that. She\u0027s the submissive his own soul has always hungered to have, and he won\u0027t hesitate to use his talents, as well as that of the other four K\u0026A men, to claim her. Publisher\u0027s Note: Rachel\u0027s sensual journey to healing contains light female/female exploration and group sex.\n \n","cover":"https://allnovel.net/images/afterlife-knights-of-the-board-room-4.jpg","author":"Joey W. Hill","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/afterlife-knights-of-the-board-room-4.html","creation":"Oct 5, 2019 8:58:07 AM","modification":"Oct 5, 2019 5:14:21 PM"}}
