{"id":86538,"no":7,"title":"Page 7","content":"Sparks flew from it, and there was a fresh brand on her flank, the skin red around it and the brazier still set up with ominous intent in the corner. A Master fucked her with a large vibrator. The girl was crying, yet shuddering with what appeared to be an impending climax. “Knees,” her keeper barked, shoving Rachel down so she not only landed on her knees but fell forward. Before she could rise, a foot was on her neck. At close range, the vile-smelling carpet added a combination of cigarette smoke and other unthinkable bodily functions. “You\"ll obey instantly, slave, or you\"ll be up on that stage next.” A new voice, deep and gravelly, issued that terrifying prediction. It was underscored by the icy trill of a woman\"s cruel laughter. “This one\"s new. Turn her over and let\"s see what we\"ve got.” She was rolled over by rough hands and pulled to her feet. Her hair had fallen out of the polished sticks she\"d used to make the style appealing, exotic. But now it was disheveled, a rat\"s nest falling around her shoulders and in her eyes. Tears she couldn\"t stop were probably making her mascara run. With her blouse torn open, she probably looked like an attempted rape. Even as she recognized that seemed like the preferred dress code, her chaotic needs ignored it, kept clawing at her, making her helpless. “Nice.” The gravelly voice belonged to a man dressed in only a body harness. His cock was cinched tight in a leather and silver sleeve. Even semi-erect, the organ seemed thick as her forearm, and just as long. “It\"ll be my pleasure to break this one in for you, Mistress Natasha.” The woman standing next to him was clad in latex. She had fire-red lips and kohl-rimmed eyes, and fingered a whip coiled around her waist. “Give her a good ass fucking for me, Milo. I want to hear her scream when you\"re deep in her hole, then we\"ll put her on the flogging post and I\"ll make that lily white skin red as a split strawberry.” “No…” She was breathing fast. Hands came out of the darkness, holding her arms, pulling at her clothes. “No, I don\"t want…I need to go, I—” An explosion of pain and her head snapped back on her neck. She stared at Milo, stunned, as he followed through with the backhand. She\"d never been hit in the face in her entire life, and it hurt more than she could say, that searing pain across the cheekbone and lip. She tasted blood. He kept the hand lifted. “You want to sass your Mistress or me again, little slave cunt?” Something burst in her then, a volcano erupting. The docile and helpless side vanished and she was fighting, snarling in terror. She\"d known this was a mistake, but this was beyond a mistake. It was blatant, staggering proof that what she wanted was beyond her reach, that she\"d devolved into the most unimaginable, idiotic folly. So what the fuck’s your fantasy, Rachel? Letting me and my golf buddies gang rape you in an alley? Leaving you in some bum’s vomit and piss? Is that what gets you hot? “Stop, stop, stop.” She was screaming at the top of her lungs, and the hands unexpectedly released her. When she stumbled against heated bodies in various states of undress, by some miracle she found her way through them to the heavy metal door. She pushed out of it with both hands, the doorman staring at her as she staggered onto the broken and uneven pavement. She\"d left her purse in her car, with her pepper spray and Taser, but she didn\"t think she could have used them anyhow. She was shaking so badly, she stumbled and fell, scraping her hands and ripping her slacks. It was her favorite pair, because they\"d always made her feel sexy and feminine when she wore them. She was going to burn them as soon as she got home. When hands closed on her arm, she shrieked and rolled to her back, striking out. “Easy there, it\"s okay. Calm down. I\"m a police officer.” The voice was a new one, and unlike Milo or the doorman, it projected firm, steady authority. Not a roaring bark that made her stomach jump as if it had been goaded by that cattle prod. When she managed to stop thrashing, she blinked up at this man. Built with the broad, solid lines of a football player, he was clean shaven, with shrewd, cynical gold-brown eyes. After taking in the jeans and dress shirt, she zeroed in on the shoulder holster for his gun beneath the open coat. Recognizing he probably was what he said he was brought knee-shaking relief, as well as mortified horror, imagining herself on some evening news program. “Are you all right, ma\"am?” He asked it in a tone that, to her way of thinking, sounded like “another twisted deviant hanging out where no decent person went”. She stared up at him and didn\"t know what to say. No, I’m lost. So lost, I’m not sure I’ll find my way back this time. He studied her, then crouched to a squat. “This is my badge,” he said, pulling it out of the inside pocket for her to see. “I just went off shift and changed into my street clothes.” She should have asked for that proof herself, but she wasn\"t thinking clearly enough to manage it. When the doorman strode toward them, she shrank toward the cop, though she despised the weakness of it. The hand he put on her shoulder was surprisingly reassuring, as were his words. “It\"s all right, miss. Cyrus, what the hell\"s happening here?” Cyrus stopped, gave her a look that was a mixture of disgust and exasperation. “Natasha\"s having one of her private parties. Ten girls. I was told to give them the full treatment when they pulled in. I didn\"t know she\"d freak out. Natasha usually goes for the really hardcore ones.” “I…I didn\"t know it was a p-private p-party… I just c-came… Website…” Rachel shut her mouth, closing her eyes. She wished she was back on her cushioned mat in her studio, Jon behind her. His simplest command had made her feel quiet and still. Unsettled, in a good way. Not frightened and humiliated, not like this. “Oh fuck.” Cyrus swore. “Keller, come on. I didn\"t know she wasn\"t one of the guests.” “Goddamn it, Cyrus, we\"ve discussed this before. You guys take way too many fucking risks. She has every right to bring assault charges against you and anyone else in that club who manhandled her, and it would serve you right. I\"d love to throw your asses in that jail cell.” “I don\"t w-want…I j-just w-want t-t-to go…” She was fast losing the ability to talk, and the policeman seemed to realize it, because he curled a strong arm around her, rubbing her back in easy, firm strokes. “You\"re going to come with me, calm down and then we\"ll talk and see what you want to do, miss. For right now, you take it easy.” He threw a glower at Cyrus. “You tell Natasha to keep her floor show inside from now on. She damn well better have an acceptable vetting process at her door by tomorrow night, or I\"ll find every possible freaking code violation in this cesspool. I suppose if someone\"s grandmother had pulled up asking for directions, you\"d have mauled her as well?” “Fuck, she was dressed for it, Keller. Maybe not as blatantly as—” Rachel had her forehead pressed into Officer Keller\"s lapel, so she felt a hardening of impressive chest muscles that matched the sudden, deadly tone in the cop\"s voice. “Trust me, Cyrus. Don\"t go down the „she was asking for it because of the way she was dressed\" road. I\"ll run your ass over.” He didn\"t wait for a response, not that she ever heard Cyrus give one. Though her teeth were chattering, she was cognizant of Cyrus thankfully retreating to the door, muttering. The officer helped her to her feet, keeping a supportive arm around her. “Here we go.” He was directing her toward her car. “Ma\"am, my name is Sergeant Leland Keller. I don\"t have a vehicle here because I just got off shift. We\"re near my place, and I was picking up dinner at that corner deli over there. But I tell you what we\"re going to do. We\"re going to take your car to our precinct and I\"m going to get a cup of coffee into you. We\"ll let you clean yourself up and then we\"ll talk, all right? And if you want a female officer, we have plenty of those.” She shook her head. “Want to go h-home.” “Well, you\"re not doing that until I\"m sure you\"re okay, so there\"s not going to be any arguing on that point, all right?” With that unrelenting assertion, he took her keys from her, still somehow clenched in her fist, so tight the metal had left impressions in her palm. Opening the passenger side, he folded her into the seat, secured her seatbelt around her and then closed the door. As he maneuvered his long frame into the driver\"s side, sliding back the seat to accommodate him in the little compact, he gave her a penetrating glance. “Besides, I don\"t think you want to go home to your husband looking like that.” “Husband?” She followed his look to her left hand, the pale band of pigment that stood out so starkly there. She hadn\"t put the ring back on once Jon had taken it off, a significant statement of its own. However, at the sergeant\"s assumption, a hard spike of sobs tried to choke her breath again. “I\"m not…married. Long story…but not married. No one. I have no one.” It sounded so pathetic, said like that, but she laid her head back against the seat, too tired to say anything else. She didn\"t want anything now except numbness. Mission accomplished, right? In spades. As Sergeant Keller put the car into drive, she stared into the side mirror at the retreating club. It looked like a demon crouched underneath a moonless sky, satisfied that it had devoured another soul. The police precinct was as cheerless as she expected. Dingy tile, fluorescent lighting. Sidelong glances from jaded eyes that had seen it all. Sergeant Keller continued to be kind and attentive, however. Rather than fishing through the lost-and-found, he brought her a clean T-shirt from his own locker and a washcloth to use in the bathroom. Once there, she took one look at her face in the mirror under the harsh lighting—blood on her mouth, tear tracks, smeared mascara. All of it accentuated the crow\"s feet at her eyes and stress lines around her taut mouth. She didn\"t look again, except to steal quick glances to ensure she\"d wiped all of it away that she could.","sourceLink":"https://allnovel.net/afterlife-knights-of-the-board-room-4/page-7.html","bookId":1903,"book":{"id":1903,"title":"Afterlife (Knights of the Board Room #4)","description":"Storyline: Afterlife (Knights of the Board Room #4) Part of the Knights of the Board Room series. Rachel gave up seeking a Master years ago. After a failed marriage and terrible tragedy, she\u0027s walled her soul against going down that dangerous path again. Then Jon joins her yoga class. He\u0027s thirteen years younger than she, but his Dominant nature threatens her shields from the moment she recognizes it. Not only does he understand what her body wants-he knows what her soul craves. Part of the five-man executive team of Kensington \u0026 Associates, Jon uses his calm, philosophical nature to defuse volatile acquisition negotiations. He can compel opponents to willingly surrender when he draws the sword that closes the deal. As a sexual Dominant, he employs that same expertise. A spiritually driven Master who enjoys connecting with a woman\u0027s soul, he wins her utter submission with his skills. But with Rachel, it goes beyond that. She\u0027s the submissive his own soul has always hungered to have, and he won\u0027t hesitate to use his talents, as well as that of the other four K\u0026A men, to claim her. Publisher\u0027s Note: Rachel\u0027s sensual journey to healing contains light female/female exploration and group sex.","cover":"https://allnovel.net/images/afterlife-knights-of-the-board-room-4.jpg","author":"Joey W. Hill","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/afterlife-knights-of-the-board-room-4.html","creation":"Oct 5, 2019 8:58:07 AM","modification":"Oct 5, 2019 5:14:21 PM"}}
