{"id":16685,"no":57,"title":"Chapter XVI","content":"The day of his death was like any other winter day at Karm Abu Girg; or if it was different it was only in one small and puzzling detail, the significance of which did not strike him at first: the servants suddenly ebbing away to leave him alone in the house. All night long now he lay in troubled sleep among the luxuriant growths of his own fantasy, dense as a tropical vegetation; only waking from time to time to be comforted by the soft whewing of the cranes flying overhead in the darkness. It was full winter and the great bird migrations had begun. The long vitreous expanses of the lake had begun to fill up with their winged visitants like some great terminus. All night long one could hear the flights come in — the thick whirring of mallard-wings or the metallic kraonk kraonk of high-flying geese as they bracketed the winter moon. Among the thickets of reed and sedge, in places polished to black or viper-green by the occasional clinging frosts, you could hear the chuckling and gnatting of royal duck. The old house with its mildewed walls where the scorpions and fleas hibernated among the dusty interstices of the earth-brick felt very empty and desolate to him now that Leila had gone. He marched defiantly about it, making as much noise as he could with his boots, shouting at the dogs, cracking his whip across the courtyard. The little toy figures with windmill arms which lined the walls against the ubiquitous evil eye, worked unceasingly, flurried by the winter winds. Their tiny celluloid propellers made a furry sound as they revolved which was somehow comforting. Nessim had pleaded hard with him to accompany Leila and Justine but he had refused — and indeed behaved like a bear though he knew in truth that without his mother the loneliness of the house would be hard to support. He had locked himself into the egg-incubators, and to his brother’s feverish knocking and shouting had opposed a bitter silence. There had been no way of explaining things to Nessim. He would not emerge even when Leila came to plead with him — for fear that his resolve might weaken under her importunities. He had crouched there in silence with his back against the wall, his fist crammed into his mouth to stifle the noiseless sobbing — how heavy was the guilt one bore for filial disobedience! They had abandoned him at last. He heard the horses clatter out of the courtyard. He was alone. Then after that a whole month of silence before he heard his brother’s voice on the telephone. Narouz had walked all day long in a forest of his own heart-beats, attending to the work of the land with a concentrated fury of purpose, galloping along the slow-moving river of his inheritance on horseback, his reflection flying beside him: always with the great whip coiled at his saddle-bow. He felt immeasurably aged now — and yet, at one and the same time, as new to the world as a foetus hanging from the birth-cord. The land, his land, now brown and greasy as an old wineskin under the rain, compelled him. It was all he had left now to care for — trees bruised by frost, sand poisoned by desert salt, water-pans stocked with fish and geese; and silences all day except for the sighing and the groaning of the water-wheels with their eternal message (‘Alexander has asses’ ears’) carried away by the winds to the further corners of the land, to pollinate history once more with the infectious memory of the soldier-god; or the suck and pluck of the black ‘forehead-smasher’ buffalo wallowing in the ooze of the dykes. And then at night the haunting plural syllables of the duck deploying in darkness, calling to one another in anxiety or content — travellers’ codes. Screens of mist, low-lying clouds through which the dawns and sunsets burst with unexampled splendour each one the end of a world, a dying into amethyst and nacre. Normally, this would be the hunter’s season which he loved, brisk with great woodfires and roving gun-dogs: time for the dousing of boots with bear’s fat, for the tuning in of the long punt-guns, the sorting out of shot, the painting of decoys…. This year he had not even the heart to join in the great annual duck-shoot given by Nessim. He felt cut off, in a different world. He wore the bitter revengeful face of a communicant refused absolution. He could no longer exorcize his sadness privately with a dog and gun; he thought only of Taor now, and the dreams he shared with her — the fierce possessive recognition of his dedicated role here, among his own lands, and in the whole of Egypt…. These confusing dreams interlinked, overlapped, intersected — like so many tributaries of the great river itself. Even Leila’s love threatened them now — was like some brilliant parasite ivy which strangles the growth of a tree. He thought vaguely and without contempt of his brother still there in the city — (he was not to leave until later) — moving among people as insubstantial as waxworks, the painted society women of Alexandria. If he thought at all of his love for Clea it was for a love left now like some shining coin, forgotten in a beggar’s pocket…. Thus, galloping in savage exultation along moss-green wharves and embankments of the estuary with its rotting palms fretted by the wind, thus he lived. Once last week Ali had reported the presence of unknown men upon the land, but he had not given the matter a thought. Often a stray Bedouin took a short cut across the plantations or a stranger rode through the property bound for the road to the city. He was more interested when Nessim telephoned to say that he would be visiting Karm Abu Girg with Balthazar who wished to investigate reports of a new species of duck which had been seen on the lake. (From the roof of the house one could sweep the whole estuary with a powerful glass.) This indeed was what he was doing now, at this very moment. Tree by tree, reed-patch by reed-patch, turning a patient and curious eye upon the land through his ancient telescope. It lay, mysterious, unpeopled and silent in the light of the dawn. He intended to spend the whole day out there among the plantations in order to avoid, if possible, seeing his brother. But now the defection of the servants was puzzling, and indeed, inexplicable. Usually when he woke he roared for Ali who brought him a large copper can with a long spout full of hot water and sluiced him down as he stood in the battered Victorian hip-bath, gasping and hissing. But today? The courtyard was silent, and the room in which Ali slept was locked. The key hung in its place upon the nail outside. There was not a soul about. With sudden quick strides he climbed to the balcony for his telescope and then mounted the outer wooden staircase to the roof to stand among the turrets of the dovecots and scan the Hosnani lands. A long patient scrutiny revealed nothing out of the ordinary. He grunted and snapped the glass shut. He would have to fend for himself today. He climbed down from his perch and taking the old leather game-bag made his way to the kitchens to fill it with food. Here he found coffee simmering and some pans set to heat upon the charcoal fire, but no trace of the cooks. Grumbling, he helped himself to a snag of bread which he munched while he assembled some food for lunch. Then an idea struck him. In the courtyard, his shrill angry whistle would normally have brought the gun-dogs growling and fawning about his boots from wherever they had taken refuge from the cold; but today the empty echo of his own whistle was all that the wind threw back to him. Had Ali perhaps taken them out on some excursion of his own? It did not seem likely. He whistled again more loudly and waited, his feet set squarely apart in his jackboots, his hands upon his hips. There was no answer. He went round to the stables and found his horse. Everything was perfectly normal here. He saddled and bridled it and led it round to the hitching post. Then he went upstairs for his whip. As he coiled it, another thought struck him. He turned into the living-room and took a revolver from the writing-desk, checking it to see that the chambers were primed. He stuck this in his belt. Then he set out, riding softly and circumspectly towards the east, for he proposed first of all to make an exploratory circuit of the land before plunging into the dense green plantations where he wished to spend the day. It was crisp weather, rapidly clearing, the marsh-mist full of evanescent shapes and contours but rising fast. Horse and rider moved with smooth deftness along the familiar ways. He reached the desert fringe in half an hour, having seen nothing untoward though he looked about him carefully under his bushy brows. On the soft ground the horse’s hooves made little noise. In the eastern corner of the plantation, he halted for a good ten minutes, combing the landscape once more with his telescope. And once more there was nothing of particular importance. He neglected none of the smaller signs which might indicate a foreign visitation, tracks in the desert, footmarks on the soft embankment by the ferry. The sun was rising slowly but the land slept in its thinning mist. At one place he dismounted to check the depth-pumps, listening to their sullen heart-beats with pleasure, greasing a lever here and there. Then he remounted and turned his horse’s head towards the denser groves of the plantations with their cherished Tripoli olives and acacia, their humus-giving belts of juniper, the wind-breaks of rattling Indian corn. He was still on the alert, however, and rode in short swift spurts, reining in every now and again to listen for a full minute. Nothing but the distant gabble of birds, the slither of flamingo-wings on the lake-water, the melodious horns of teal or the splendour (as of a tuba in full pomp) of honking geese. All familiar, all known. He was still puzzled but not ill at ease. He made his way at last to the great nubk tree standing up starkly in its clearing, its great trophied branches dripping with condensing mist. Here, long ago, he had stood and prayed with Mountolive under the holy branches, still heavy with their curious human fruitage; everywhere blossomed the ex votos of the faithful in strips of coloured cloth, calico, beads. They were tied to every branch and twig and leaf so that it looked like some giant Christmas tree. Here he dismounted to take some cuttings which he wrapped and stowed carefully. Then he straightened up for he had heard the sounds of movement in the green glades around him. Difficult to identify, to isolate — slither of a body among the leaves, or perhaps a pack-saddle catching in a branch as horse and rider moved swiftly out of ambush? He listened and gave a small spicy chuckle, as if at some remembered private joke. He was sorry for anyone coming to molest him in such a place — every glade and ride of which he knew by memory. Here he was on his own ground — the master. He ran back to his horse with his curious bandy-legged stride, but noiselessly. He mounted and rode slowly out of the shadow of the great branches in order to give his long whip a wide margin for wrist-play and to cover the only two entrances to the plantation. His adversaries, if such there were, would have to come upon him down one of two paths. He had his back to the tree and its great stockade of thorns. He gave a small clicking laugh of pleasure as he sat there attentively, his head on one side like a listening gun-dog; he moved the coils of his whip softly and voluptuously along the ground, drawing circles with them, curling them in the grass like a snake…. It would probably turn out to be a false alarm — Ali coming to apologize for his neglect that morning? At any rate, his master’s posture of readiness would frighten him, for he had seen the whip in action before…. The noise again. A water-rat plopped into the channel and swam quickly away. Among the bushes on two sides of the ride he could see indistinct movements. He sat, as immobile as an equestrian statue, his pistol grasped lightly in the left hand, his whip lying slightly behind him, his arm curved in the position of a fisherman about to make a long cast. So he waited, smiling. His patience was endless. ***** The sound of distant shooting upon the lake was a commonplace among the vocabulary of lake-sounds; it belonged to the music of the gulls, visitants from the seashore, and the other water-birds which thronged the reed-haunted lagoons. When the big shoots were on the ripple of thirty guns in action at one and the same time flowed tidelessly out into the air of Mareotis like a cadenza. Habit taught one gradually to differentiate between the various sounds and to recognize them — and Nessim too had spent his childhood here with a gun. He could tell the difference between the deep tang of a punt gun aimed at highflying geese and the flat biff of a twelve-bore. The two men were standing by their horses at the ferry when it came, a small puckering of the air merely, falling upon the ear-drum in a patter: raindrops sliding from an oar, the drip of a tap in an old house, were hardly less in volume. But it was certainly shooting. Balthazar turned his head and gazed out over the lake. ‘That sounded pistolish’ he said; Nessim smiled and shook his head. ‘Small calibre rifle, I should say. A poacher after sitting duck?’ But there were more shots than could be accommodated at one time in the magazine of either weapon. They mounted, a little puzzled that the horses had been sent for them but that Ali had disappeared. He had tied the animals to the hitching-post of the ferry, commending them to the care of the ferryman, and vanished in the mist. They rode briskly down the embankments side by side. The sun was up now and the whole surface of the lake was rising into the sky like the floor of a theatre, pouring upwards with the mist; here and there reality was withered by mirages, landscapes hanging in the sky upside down or else four or five superimposed on each other with the effect of a multiple exposure. The first indication of anything amiss was a figure dressed in white robes which fled into the mist — an unheard-of action in that peaceful country. Who would fly from two horsemen on the Karm Abu Girg road? A vagabond? They stopped in bemused wonder. ‘I thought I heard shouts’ said Nessim at last in a small constrained voice, ‘towards the house.’ As if both were stimulated by the same simultaneous anxiety, they pushed their horses into a brisk gallop, heading them for the house. A horse, Narouz’ horse, now riderless, stood trembling outside the open gates of the manor house. It had been shot through the lips — a profusely-bleeding graze which gave it a weird bloody smile. It whinnied softly as they came up. Before they had time to dismount there came shouts from the palm-grove and a flying figure burst through the trees waving to them. It was Ali. He pointed down among the plantations and shouted the name of Narouz. The name, so full of omens for Nessim, had a curiously obituary ring already, though he was not as yet dead. ‘By the Holy Tree’ shouted Ali, and both men drove their heels into their horses’ flanks and crashed into the plantation as fast as they could go. He was lying on the grass underneath the nubk tree with his head and neck supported by it, an angle which cocked his face forward so that he appeared to be studying the pistol-wounds in his own body. His eyes alone were movable, but they could only reach up to the knee of his rescuers; and the pain had winced them from the normal periwinkle blue to the dull blue of plumbago. His whip had got coiled round his body in some manner, probably when he fell from the saddle. Balthazar dismounted and walked slowly and deliberately over to him, making the little clucking noise he always made with his tongue; it sounded sympathetic, but it was in fact a reproof to his own curiosity, to the elation with which one part of his professional mind responded to human tragedy. It always seemed to him that he had no right to be so interested. Tsck, tsck. Nessim was very pale and very calm but he did not approach the fallen figure of his brother. Yet it had for him a dreadful magnetism — it was as if Balthazar were laying some tremendously powerful explosive which might go off and kill them both. He was merely helping by holding the horse. Narouz said in a small peevish voice — the voice of a feverish child which can count on its illness for the indulgence it seeks — something unexpected. ‘I want to see Clea.’ It ran smoothly off his tongue, as if he had been rehearsing the one phrase in his mind for centuries. He licked his lips and repeated it more slowly. It seemed from Balthazar’s angle of vision that a smile settled upon his lips, but he recognized that the contraction was a grimace of pain. He hunted swiftly for the old pair of surgical scissors which he had brought to use upon the soft wire duck-seals and slit the vest of Narouz stiffly from North to South. At this Nessim drew nearer and together they looked down upon the shaggy and powerful body on which the blue and bloodless bullet-holes had sunk like knots in an oak. But they were many, very many. Balthazar made his characteristic little gesture of uncertainty which parodied a Chinaman shaking hands with himself. Other people had now entered the clearing. Thinking became easier. They had brought an enormous purple curtain with which to carry him back to the house. And now, in some strange way, the place was full of servants. They had ebbed back like a tide. The air was dark with their concern. Narouz ground his teeth and groaned as they lifted him to the great purple cloak and bore him back, like a wounded stag, through the plantations. Once as he neared the house, he said in the same clear child’s voice: ‘To see Clea’ and then subsided into a feverish silence punctuated by occasional quivering sighs. The servants were saying: ‘Praise be to God that the doctor is here! All will be well with him!’ Balthazar felt Nessim’s eyes turned upon him. He shook his head gravely and hopelessly and repeated his clucking sound softly. It was a matter of hours, of minutes, of seconds. So they reached the house like some grotesque religious procession bearing the body of the younger son. Softly mewing and sobbing, but with hope and faith in his recovery, the women gazed down upon the jutting head and the sprawled body in the purple curtain which swelled under his weight like a sail. Nessim gave directions, uttering small words like ‘Gently here’ and ‘Slowly at the corner’. So they gradually got him back to the gaunt bedroom from which he had sallied forth that morning, while Balthazar busied himself, breaking open a packet of medical supplies which were kept in a cupboard against lake-accidents, hunting for a hypodermic needle and a phial of morphia. Small croaks and groans were now issuing from the mouth of Narouz. His eyes were closed. He could not hear the dim conversation which Nessim, in another corner of the house, was having with Clea on the telephone. ‘But he is dying, Clea.’ Clea made an inarticulate moaning noise of protest. ‘What can I do, Nessim? He is nothing to me, never was, never will be. Oh, it is so disgusting — please do not make me come, Nessim.’ ‘Of course not. I simply thought as he is dying ——’ ‘But if you think I should I will feel obliged to.’ ‘I think nothing. He has not long to live, Clea.’ ‘I hear from your voice that I must come. Oh, Nessim, how disgusting that people should love without consent! Will you send the car or shall I telephone Selim? My flesh quails on my bones.’ ‘Thank you, Clea’ said Nessim shortly and with sadly downcast head; for some reason the word ‘disgusting’ had wounded him. He walked slowly back to the bedroom, noticing on the way that the courtyard was thronged with people — not only the house servants but many new curious visitors. Calamity draws people as an open wound draws flies, Nessim thought. Narouz was in a doze. They sat for a while talking in whispers. ‘Then he must really die?’ asked Nessim sadly, ‘without his mother?’ It seemed to him an added burden of guilt that it was through his agency that Leila had been forced to leave. ‘Alone like this.’ Balthazar made a grimace of impatience. ‘It is amazing he’s alive at all still’ he said. ‘And there is absolutely nothing….’ Slowly and gravely Balthazar shook that dark intelligent head. Nessim stood up and said: ‘Then I should tell them that there is no hope of recovery. They will want to prepare for his death.’ ‘Do as you wish.’ ‘I must send for Tobias the priest. He must have the last sacraments — the Holy Eucharist. The servants will know the truth from him.’ ‘Act as seems good to you’ said Balthazar dryly, and the tall figure of his friend slipped down the staircase into the courtyard to give instructions. A rider was to be despatched at once to the priest with instructions to consecrate the holy elements in the church and then come post-haste to Karm Abu Girg to administer the last sacraments to Narouz. As this intelligence went abroad there went up a great sigh of dreadful expectancy and the faces of the servants lengthened with dread. ‘And the doctor?’ they cried in tones of anguish. ‘And the doctor?’ Balthazar smiled grimly as he sat on the chair beside the dying man. He repeated to himself softly, under his breath, ‘And the doctor?’ What a mockery! He placed his cool palm on Narouz’ forehead for a moment, with an air of certitude and resignation. A high temperature, a dozen bullet-holes…. ‘And the doctor?’ Musing upon the futility of human affairs and the dreadful accidents to which life exposed the least distrustful, the most innocent of creatures, he lit a cigarette and went out on to the balcony. A hundred eager glances sought his, imploring him by the power of his magic to restore the patient to health. He frowned heavily at one and all. If he had been able to resort to the old-fashioned magic of the Egyptian fables, of the New Testament, he would gladly have told Narouz to rise. But … ‘And the doctor?’ Despite the internal haemorrhages, the drumming of the pulses in his ears, the fever and pain, the patient was only resting — in a sense — husbanding his energies for the appearance of Clea. He mistook the little flutter of voices and footsteps upon the staircase which heralded the appearance of the priest. His eyelashes fluttered and then sank down again, exhausted to hear the fat voice of the goose-shaped young man with the greasy face and the air of just having dined on sucking-pig. He returned to his own remote watchfulness, content that Tobias should treat him as insensible, as dead even, provided he could husband a small share of his dying space for the blonde image — intractable and remote as ever now to his mind — yet an image which might respond to all this hoarded suffering. Even from pity. He was swollen with desire, distended like a pregnant woman. When you are in love you know that love is a beggar, shameless as a beggar; and the responses of merely human pity can console one where love is absent by a false travesty of an imagined happiness. Yet the day dragged on and still she did not come. The anxiety of the house deepened with his own. And Balthazar, whose intuition had guessed rightly the cause of his patience, was tempted by the thought: ‘I could imitate Clea’s voice — would he know? I could soothe him with a few words spoken in her voice.’ He was a ventriloquist and mimic of the first order. But to the first voice a second replied: ‘No. One must not interfere with a destiny however bitter by introducing lies. He must die as he was meant to.’ And the first voice said bitterly: ‘Then why morphia, why the comforts of religion, and not the solace of a desired human voice imitated, the pressure of a hand imitated? You could easily do this.’ But he shook his dark head at himself and said ‘No’ with bitter obstinacy, as he listened to the unpleasant voice of the priest reading passages of scripture upon the balcony, his voice mixing with the murmuring and shuffling of the human beings in the courtyard below. Was not the evangel all that the imitation of Clea’s voice might have been? He kissed his patient’s brow slowly, sadly as he reflected. Narouz began to feel the tuggings of the Underworld, the five wild dogs of the sense pulling ever more heavily upon the leash. He opposed to them the forces of his mighty will, playing for time, waiting for the only human revelation he could expect — voice and odour of a girl who had become embalmed by his senses, entombed like some precious image. He could hear the-nerves ticking away in their spirals of pain, the oxygen bubbles rising ever more slowly to explode in his blood. He knew that he was running out of funds, running out of time. The slowly gathering weight of a paralysis was settling over his mind, the narcotic of pain. Nessim went away to the telephone again. He was wax pale now, with a hectic spot of pink in each cheek, and he spoke with the high sweet hysterical voice of his mother. Clea had already started for Karm Abu Girg, but it seemed that a part of the road had been washed away by a broken dyke. Selim doubted whether she could get through to the ferry that evening. There now began a tremendous struggle in the breast of Narouz — a struggle to maintain an equilibrium between the forces battling within him. His musculature contracted in heavy bunches with the effort of waiting; his veins bunched out, polished to ebony with the strain, controlled by his will. He ground his teeth savagely together like a wild boar as he felt himself foundering. And Balthazar sat like an effigy, one hand upon his brow and the other fiercely holding the contorted muscles of his wrist. He whispered in Arabic: ‘Rest, my darling. Easily, my loved one.’ His sadness gave him complete mastery of himself, complete calm. Truth is so bitter that the knowledge of it confers a kind of luxury. So it went for a while. Then lastly there burst from the hairy throat of the dying man a single tremendous word, the name of Clea, uttered in the cavernous voice of a wounded lion: a voice which combined anger, reproof and an overwhelming sadness in its sudden roar. So nude a word, her name, as simple as ‘God’ or ‘Mother’ — yet it sounded as if upon the lips of some dying conqueror, some lost king, conscious of the body and breath dissolving within him. The name of Clea sounded through the whole house, drenched by the splendour of his anguish, silencing the little knots of whispering servants and visitors, setting back the ears of the hunting dogs, making them crouch and fawn: ringing in Nessim’s mind with a new and terrifying bitterness too deep for tears. And as this great cry slowly faded, the intelligence of his death dawned upon them with a new and crushing weight — like the pressure of some great tomb door closing upon hope. Immobile, ageless as pain itself, sat the defeated effigy of the doctor at the bedside of pain. He was thinking to himself, full of the bright fight of intellection: ‘A phrase like “out of the jaws of death” might mean something like that cry of Narouz’, its bravery. Or “out of the jaws of Hell”. It must mean the hell of a private mind. No, we can do nothing.’ The great voice thinned softly into the burring comb-andpaper sound of a long death-rattle, fading into the buzz of a fly caught in some remote spider’s web. And now Nessim gave a single sweet sob out there on the balcony — the noise that a bamboo stem makes when it is plucked from the stalk. And like the formal opening bars of some great symphony this small sob was echoed below in the darkness, passed from lip to lip, heart to heart. Their sobs lighted one another — as candles take a light from one another — an orchestral fulfilment of the precious theme of sorrow, and a long quivering ragged moan came up out of the empty well to climb upwards towards the darkening sky, a long hushing sigh which mingled with the hushing of the rain upon Lake Mareotis. The death of Narouz had begun to be borne. Balthazar with lowered head was quoting softly to himself in Greek the lines: Now the sorrow of the knowledge of parting Moves like wind in the rigging of the ship Of the man’s death, figurehead of the white body, The sails of the soul being filled By the Ghost of the Breath, replete and eternal. It was the signal for a release, for now the inescapably terrible scenes of a Coptic wake were to be enacted in the house, scenes charged with an ancient terror and abandon. Death had brought the women into their kingdom, and made them free to deliver each her inheritance of sorrow. They crept forward in a body, gathering speed as they mounted the staircases, their faces rapt and transfigured now as they uttered the first terrible screaming. Their fingers were turned into hooks now, tearing at their own flesh, their breasts, their cheeks, with a lustful abandon as they moved swiftly up the staircase. They were uttering that curious and thrilling ululation which is called the zagreet, their tongues rippling on their palates like mandolines. An ear-splitting chorus of tongue trills in various keys. The old house echoed to the shrieks of these harpies as they took possession of it and invaded the room of death to circle round the silent corpse, still repeating the blood-curdling signal of death, full of an unbearable animal abandon. They began the dances of ritual grief while Nessim and Balthazar sat silent upon their chairs, their heads sunk upon their breasts, their hands clasped — the very picture of human failure. They allowed these fierce quivering screams to pierce them to the very quick of their beings. Only submission now to the ritual of this ancient sorrow was permissible: and sorrow had become an orgiastic frenzy which bordered on madness. The women were dancing now as they circled the body, striking their breasts and howling, but dancing in the slow measured figures of a dance recaptured from long-forgotten friezes upon the tombs of the ancient world. They moved and swayed, quivering from throat to ankles, and they twisted and turned calling upon the dead man to rise. ‘Rise, my despair! Rise, my death! Rise, my golden one, my death, my camel, my protector! O beloved body full of seed, arise!’ And then the ghastly ululations torn from their throats, the bitter tears streaming from their torn minds. Round and round they moved, hypnotized by their own lamentations, infecting the whole house with their sorrow while from the dark courtyard below came the deeper, darker hum of their menfolk sobbing as they touched hands in consolation and repeated, to comfort one another: ‘Ma-a-lesh! Let it be forgiven! Nothing avails our grief!’ So the sorrow multiplied and proliferated. From everywhere now the women came in numbers. Some had already put on the dress of ritual mourning — the dirty coverings of dark blue cotton. They had smeared their faces with indigo and rubbed ash from the fires into their black loosened tresses. They now answered the shrieks of their sisters above with their own, baring their glittering teeth, and climbed the stairs, poured into the upper rooms with the ruthlessness of demons. Room by room, with a systematic frenzy, they attacked the old house, pausing only to utter the same terrifying screams as they set about their work. Bedsteads, cupboards, sofas were propelled out upon the balcony and hurled from there into the courtyard. At each new crash a fresh fever of screaming — the long bubbling zagreet — would break out and be answered from every corner of the house. Now the mirrors were shivered into a thousand fragments, the pictures turned back to front, the carpets reversed. All the china and glass in the house — save for the ceremonial black coffee set which was kept for funerals — was now broken up, trampled on, shivered to atoms. It was all swept into a great mound on the balcony. Everything that might suggest the order and continuity of earthly life, domestic, personal or social, must be discarded now and obliterated. The systematic destruction of the memory of death itself in plates, pictures, ornaments or clothes…. The domestic furnishings of the house were- completely wrecked now, and everything that remained had been covered in black drapes. Meanwhile, down below a great coloured tent had been pitched, a marquee, in which visiting mourners would come and sit through the whole of the ‘Night of Loneliness’ drinking coffee in silence from the black cups and listening to the deep thrilling moaning up above which swelled up from time to time into a new outbreak of screaming or the noise of a woman fainting, or rolling on the ground in a seizure. Nothing must be spared to make this great man’s funeral successful. Other mourners too had now begun to appear, both personal and professional, so to speak; those who had a personal stake in the funeral of a friend came to spend the night in the coloured marquee under the brilliant light. But there were others, the professional mourners of the surrounding villages for whom death was something like a public competition in the poetry of mourning; they came on foot, in carts, on camel-back. And as each entered the gate of the house she set up a long shivering cry, like an orgasm, that stirred the griefs of the other mourners anew, so that they responded from every corner of the house — the low sobbing notes gradually swelling into a blood-curdling and sustained tongue-trill that pierced the nerves. These professional mourners brought with them all the wild poetry of their caste, of memories loaded with years of death-practice. They were often young and beautiful. They were singers. They carried with them the ritual drums and tambourines to which they danced and which they used to punctuate their own grief and stimulate the flagging griefs of those who had already been in action. ‘Praise the inmate of the House’ they cried proudly as with superb and calculated slowness they began their slow dance about the body, turning and twisting in an ecstasy of pity as they recited eulogies couched in the finest poetic Arabic upon Narouz. They praised his character, his rectitude, his beauty, his riches. And these long perfectly turned strophes were punctuated by the sobs and groans of the audience, both above and below; so vulnerable to poetry, even the old men seated on the stiff-backed chairs in the tent below found their throats tightening until a dry sob broke from their lips and they hung their heads, whispering ‘Ma-a-lesh.’ Among them, Mohammed Shebab, the old schoolmaster and friend of the Hosnanis, had pride of place. He was dressed in his best and even wore a pair of ancient pearl spats with a new scarlet tarbush. The memory of forgotten evenings which he had spent on the balcony of the old house listening to music with Nessim and Narouz, gossiping to Leila, smote him now with pain which was not feigned. And since the people of the Delta often use a wake as an excuse to discharge private griefs in communal mourning, he too found himself thinking of his dead sister and sobbing, and he turned to the servant, pressing money into his hand as he said: ‘Ask Alam the singer to sing the recitative of the Image of Women once more, please. I wish to mourn it through again.’ And as the great poem began, he leaned back luxuriously swollen with the refreshment of a sorrow which would achieve catharsis thus in poetry. There were others too who asked for their favourite laments to be sung, offering the singers the requisite payment. In this way the whole grief of the countryside was refunded once again into living, purged of bitterness, reconquered by the living through the dead image of Narouz. Until morning now it would be kept up, the strange circling dances, the ripple and shiver of tambourines, the tongue-trilling screams, and the slow pulse of the dirges with their magnificent plumage of metaphor and image — poetry of the death-house. Some were early overcome with exhaustion and several among the house-servants had fainted from hysteria after two hours of singing thus; the professional keeners, however, knew their own strength and behaved like the ritual performers they were. When overcome by excess of grief or by a long burst of screams, they would sink to the floor and take a short rest, sometimes even smoking a cigarette. Then they would once more join the circle of dancers, refreshed. Presently, however, when the first long passion of grief had been expressed, Nessim sent for the priests who would add the light of tall bloodless candles and the noise of the psalms to the sound of water and sponge — for the body must be washed. They came at last. The body-washers were the two beadles of the little Coptic Church — ignorant louts both. Here a hideous altercation broke out, for the dead man’s clothes are the perquisites of the layer-out, and the beadles could find nothing in Narouz’ shabby wardrobe which seemed an adequate recompense for the trouble. A few old cloaks and boots, a torn nightshirt, and a small embroidered cap which dated from his circumcision — that was all Narouz owned. Nor would the beadles accept money — that would have been unlucky. Nessim began to rage, but they stood there obstinate as mules, refusing to wash Narouz without the ritual payment. Finally both Nessim and Balthazar were obliged to get out of their own suits in order to make them over to the beadles as payment. They put on the tattered old clothes of Narouz with a shiver of dread — cloaks which hung down like a graduate’s gown upon their tall figures. But somehow the ceremony must be completed, so that he could be taken to the church at dawn for burial — or else the ceremonial mourners might keep up the performance for days and nights together: in the olden times such mourning lasted forty days! Nessim also ordered the coffin to be made, and the singing was punctuated all night by the sound of hammers and saws in the wheelwright’s yard hard by. Nessim himself was completely exhausted by now, and dozed fitfully on a chair, being woken from time to time by a burst of keening or by some personal problem which remained to be solved and which was submitted to his arbitration by the servants of the house. Sounds of chanting, rosy flickering of candle-light, swish of sponges and the scratching of a razor upon dead flesh. The experience gave no pain now, but an unearthly numbness of spirits. The sound of water trickling and of sponges crushing softly upon the body of his brother, seemed part of an entirely new fabric of thought and emotion. The groans of the washers as they turned him over; the thump of the body on the table as it turned over. The soft thump of a hare’s dead body when it is thrown on to a kitchen table…. He shuddered. Narouz at last, washed and oiled and sprinkled with rosemary and thyme, lay at ease in his rough coffin clad in the shroud which he, like every Copt, had preserved against this moment; a shroud made of white flax which had been dipped in the River Jordan. He had no jewels or rich costumes to take to the grave with him, but Balthazar coiled the great bloodstained whip and placed it under his pillow. (The next morning the servants were to carry in the body of a wretch whose whole face had been pulped by the blows of this singular weapon; he had run, it seems, screaming, unrecognizable, across the plantation to fall insensible in a dyke and drown. So thoroughly had the whip done its work that he was unidentifiable.) The first part of the work was now complete and it only remained to wait for dawn. Once more the mourners were admitted to the room of death where Narouz lay, once more they resumed their passionate dancing and drumming. Balthazar took his leave now, for there was nothing more he could do to help. The two men crossed the courtyard slowly, arm in arm, leaning on each other as if exhausted. ‘If you meet Clea at the ferry, take her back’ said Nessim. ‘Of course I will.’ They shook hands slowly and embraced each other. Then Nessim turned back, yawning and shivering, into the house. He sat dozing on a chair. It would be three days before the house could be purged of sadness and the soul of Narouz ‘sent away’ by the priestly rituals. First would come the long straggling procession with the torches and banners in the early dawn, before the mist rose, the women with faces blackened now like furies, tearing their hair. The deacons chanting ‘Remember me O Lord when Thou hast come to Thy Kingdom’ in deep thrilling voices. Then on the cold floor of the church the sods raining down on Narouz’ pale face and the voices reciting ‘From dust to dust’, and the rolling periods of the evangel singing him away to heaven. Squeak of the brass screws as the lid went down. All this he saw, foreshadowed in his mind as he drowsed upon the stiff-backed chair beside the rough-hewn coffin. Of what, he wondered, could Narouz be dreaming now, with the great whip coiled beneath his pillow?","sourceLink":"http://novel.tingroom.com/jingdian/2015/57501.html","bookId":638,"book":{"id":638,"title":"The Alexandria Quartet 亚历山大四部曲","description":"简介： 伟大的现代巴洛克风格小说，使中产阶级得以亲近地中海。...","cover":"http://novel.tingroom.com/file/upload/201803/12/13-31-30-67-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/2015","creation":"Aug 1, 2019 12:19:04 AM","modification":"Aug 1, 2019 12:19:04 AM"}}
