{"id":16695,"no":67,"title":"Chapter V","content":"For some considerable time I heard nothing of Pursewarden’s sister, though I knew that she was still up at the summer legation. As for Mountolive, his visits were recorded among the office memoranda, so that I knew he came up from Cairo for the night about every ten days. For a while I half expected a signal from him, but as time wore on I almost began to forget his existence as presumably he had forgotten mine. So it was that her voice, when first it floated over the office telephone, came as an unexpected intrusion — a surprise in a world where surprises were few and not unwelcome. A curiously disembodied voice which might have been that of uncertain adolescence, saying: ‘I think you know of me. As a friend of my brother I would like to talk to you.’ The invitation to dinner the following evening she described as ‘private, informal and unofficial’ which suggested to me that Mountolive himself would be present. I felt the stirring of an unusual curiosity as I walked up the long drive with its very English hedges of box, and through the small coppice of pines which encircled the summer residence. It was an airless hot night — such as must presage the gathering of a khamseen somewhere in the desert which would later roll its dust clouds down the city’s streets and squares like pillars of smoke. But as yet the night air was harsh and clear. I rang the bell twice without result, and was beginning to think that perhaps it might be out of order when I heard a soft swift step inside. The door opened and there stood Liza with an expression of triumphant eagerness on her blind face. I found her extraordinarily beautiful at first sight, though a little on the short side. She wore a dress of some dark soft stuff with a collar cut very wide, out of which her slender throat and head rose as if out of the corolla of a flower. She stood before me with her face thrown upwards, forwards — with an air of spectral bravery — as if presenting her lovely neck to an invisible executioner. As I uttered my own name she smiled and nodded and repeated it back to me in a whisper tense as a thread. ‘Thank goodness, at last you have come’ she said, as though she had lived in the expectation of my visit for years! As I stepped forward she added quickly ‘Please forgive me if I…. It is my only way of knowing.’ And I suddenly felt her soft warm fingers on my face, moving swiftly over it as if spelling it out, I felt a stirring of some singular unease, composed of sensuality and disgust, as these expert fingers travelled over my cheeks and lips. Her hands were small and well-shaped; the fingers conveyed an extraordinary impression of delicacy, for they appeared to turn up slightly at the ends to present their white pads, like antennae, to the world. I had once seen a world-famous pianist with just such fingers, so sensitive that they appeared to grow into the keyboard as he touched it. She gave a small sigh, as if of relief, and taking me by the wrist drew me across the hall and into the living-room with its expensive and featureless official furniture where Mountolive stood in front of the fireplace with an air of uneasy concern. Somewhere a radio softly played. We shook hands and in his handclasp I felt something infirm, indecisive which was matched by the fugitive voice in which he excused his long silence. ‘I had to wait until Liza was ready’ he said, rather mysteriously. Mountolive had changed a good deal, though he still bore all the marks of the superficial elegance which was a prerequisite for his work, and his clothes were fastidiously chosen — for even (I thought grimly) informal undress is still a uniform for a diplomat. His old kindness and attentiveness were still there. Yet he had aged. I noticed that he now needed reading-glasses, for they lay upon a copy of The Times beside the sofa. And he had grown a moustache which he did not trim and which had altered the shape of his mouth, and emphasized a certain finely bred feebleness of feature. It did not seem possible to imagine him ever to have been in the grip of a passion strong enough to qualify the standard responses of an education so definitive as his. Nor now, looking from one to the other, could I credit the suspicions which Clea had voiced about his love for this strange blind witch who now sat upon the sofa staring sightlessly at me, with her hands folded in her lap — those rapacious, avaricious hands of a musician. Had she coiled herself, like a small hateful snake, at the centre of his peaceful life? I accepted a drink from his fingers and found, in the warmth of his smile, that I remembered having liked and admired him. I did so still. ‘We have both been eager to see you, and particularly Liza, because she felt that you might be able to help her. But we will talk about all that later.’ And with an abrupt smoothness he turned away from the real subject of my visit to enquire whether my post pleased me, and whether I was happy in it. An exchange of courteous pleasantries which provoked the neutral answers appropriate to them. Yet here and there were gleams of new information. ‘Liza was quite determined you should stay here; and so we got busy to arrange it!’ Why? Simply that I should submit to a catechism about her brother, who in truth I could hardly claim to have known, and who grew more and more mysterious to me every day — less important as a personage, more and more so as an artist? It was clear that I must wait until she chose to speak her mind. Yet it was baffling to idle away the time in the exchange of superficialities. Yet these smooth informalities reigned, and to my surprise the girl herself said nothing — not a word. She sat there on the sofa, softly and attentively, as if on a cloud. She wore, I noticed, a velvet ribbon on her throat. It occurred to me that her pallor, which had so much struck Clea, was probably due to not being able to make-up in the mirror. But Clea had been right about the shape of her mouth, for once or twice I caught an expression, cutting and sardonic, which was a replica of her brother’s. Dinner was wheeled in by a servant, and still exchanging small talk we sat down to eat it; Liza ate swiftly, as if she were hungry, and quite unerringly, from the plate which Mountolive filled for her. I noticed when she reached for her wineglass that her expressive fingers trembled slightly. At last, when the meal was over, Mountolive rose with an air of scarcely disguised relief and excused himself. ‘I’m going to leave you alone to talk shop to Liza. I shall have to do some work in the Chancery this evening. You will excuse me, won’t you?’ I saw an apprehensive frown shadow Liza’s face for a moment, but it vanished almost at once and was replaced by an expression which suggested something between despair and resignation. Her fingers picked softly, suggestively at the tassel of a cushion. When the door had closed behind him she still sat silent, but now preternaturally still, her head bent downwards as if she were trying to decipher a message written in the palm of her hand. At last she spoke in a small cold voice, pronouncing the words incisively as if to make her meaning plain. ‘I had no idea it would be difficult to explain when first I thought of asking your help. This book….’ There was a long silence. I saw that little drops of perspiration had come out on her upper lip and her temples looked as if they had tightened under stress. I felt a certain compassion for her distress and said: ‘I can’t claim to have known him well, though I saw him quite frequently. In truth, I don’t think we liked each other very much.’ ‘Originally’ she said sharply, cutting across my vagueness with impatience ‘I thought I might persuade you to do the book about him. But now I see that you will have to know everything. It is not easy to know where to begin. I myself doubt whether the facts of his life are possible to put down and publish. But I have been driven to think about the matter, first because his publishers insist on it — they say there is a great public demand; but mostly because of the book which this shabby journalist is writing, or has written. Keats.’ ‘Keats’ I echoed with surprise. ‘He is here somewhere I believe; but I do not know him. He has been put up to the idea by my brother’s wife. She hated him, you know, after she found out; she thought that my brother and I had between us ruined her life. Truthfully I am afraid of her. I do not know what she has told Keats, or what he will write. I see now that my original idea in having you brought here was to get you to write a book which would … disguise the truth somehow. It only became clear to me just now when I was confronted by you. It would be inexpressibly painful to me if anything got out which harmed my brother’s memory.’ Somewhere to the east I heard a grumble of thunder. She stood up with an air of panic and after a moment’s hesitation crossed to the grand piano and struck a chord. Then she banged the cover down and turned once more to me, saying: ‘I am afraid of thunder. Please may I hold your hand in a firm grip.’ Her own was deathly cold. Then, shaking back her black hair she said: ‘We were lovers, you know. That is really the meaning of his story and mine. He tried to break away. His marriage foundered on this question. It was perhaps dishonest of him not to have told her the truth before he married her. Things fall out strangely. For many years we enjoyed a perfect happiness, he and I. That it ended tragically is nobody’s fault I suppose. He could not free himself from my inside hold on him, though he tried and struggled. I could not free myself from him, though truthfully I never wished to until … until the day arrived which he had predicted so many years before when the man he always called “the dark stranger” arrived. He saw him so clearly when he gazed into the fire. It was David Mountolive. For a little while I did not tell him that I had fallen in love, the fated love. (David would not let me. The only person we told was Nessim’s mother. David asked my permission.) But my brother knew it quite unerringly and wrote after a long silence asking me if the stranger had come. When he got my letter he seemed suddenly to realize that our relationship might be endangered or crushed in the way his had been with his wife — not by anything we did, no, but by the simple fact of my existence. So he committed suicide. He explained it all so clearly in his last letter to me. I can recite it by heart. He said: “For so many years I have waited in anguished expectation for your letter. Often, often I wrote it for you in my own head, spelling it out word by magical word. I knew that in your happiness you would at once turn to me to express a passionate gratitude for what I had given you — for learning the meaning of all love through mine: so that when the stranger came you were ready…. And today it came! this long-awaited message, saying that he had read the letters, and I knew for the first time a sense of inexpressible relief as I read the lines. And joy — such joy as I never hoped to experience in my life — to think of you suddenly plunging into the full richness of life at last, no longer tied, manacled to the image of your tormented brother! Blessings tumbled from my lips. But then, gradually, as the cloud lifted and dispersed I felt the leaden tug of another truth, quite unforeseen, quite unexpected. The fear that, so long as I was still alive, still somewhere existing in the world, you would find it impossible truly to escape from the chains in which I have so cruelly held you all these years. At this fear my blood has turned chill — for I know that truthfully something much more definitive is required of me if you are ever to renounce me and start living. I must really abandon you, really remove myself from the scene in a manner which would permit no further equivocation in our vacillating hearts. Yes, I had anticipated the joy, but not that it would bring with it such a clear representation of certain death. This was a huge novelty! Yet it is the completest gift I can offer you as a wedding present! And if you look beyond the immediate pain you will see how perfect the logic of love seems to one who is ready to die for it.” ’ She gave a short clear sob and hung her head. She took the handkerchief from the breast pocket of my coat and pressed it to her trembling lip. I felt stupefied by the sad weight of all this calamitous information. I felt, in the ache of pity for Pursewarden, a new recognition of him growing up, a new enlightenment. So many things became clearer. Yet there were no words of consolation or commiseration which could do justice to so tragic a situation. She was talking again. ‘I will give you the private letters to read so that you can advise me. These are the letters which I was not to open but was to keep until David came. He would read them to me and we would destroy them — or so he said. Is it strange — his certainty? The other ordinary letters were of course read to me in the usual way; but these private letters, and they are very many, were all pierced with a pin in the top left-hand corner. So that I could recognize them and put them aside. They are in that suitcase over there. I would like you to take them away and study them. Oh, Darley, you have not said a word. Are you prepared to help me in this dreadful predicament? I wish I could read your expression.’ ‘Of course I will help you. But just how and in what sense?’ ‘Advise me what to do! None of this would have arisen had not this shabby journalist intervened and been to see his wife.’ ‘Did your brother appoint a literary executor?’ ‘Yes. I am his executor.’ ‘Then you have a right to refuse to allow any of his unsold writings to be published while they’re in copyright. Besides, I do not see how such facts could be made public without your own permission, even in an unauthorized biography. There is no cause whatsoever to worry. No writer in his senses could touch such material; no publisher in the world would undertake to print it if he did. I think the best thing I can do is to try and find out something about this book of Keats’s. Then at least you will know where you stand.’ ‘Thank you, Darley. I could not approach Keats myself because I knew he was working for her. I hate and fear her — perhaps unjustly. I suppose too that I have a feeling of having wronged her without wishing it. It was a deplorable mistake on his part not to tell her before their marriage; I think he recognized it, too, for he was determined that I should not make the same mistake when at last David appeared. Hence the private letters, which leave no one in doubt. Yet it all fell out exactly as he had planned it, had prophesied it. That very first night when I told David I took him straight home to read them. We sat on the carpet in front of the gas-fire and he read them to me one by one in that unmistakable voice — the stranger’s voice.’ She gave a queer blind smile at the memory and I had a sudden compassionate picture of Mountolive sitting before the fire, reading these letters in a slow faltering voice, stunned by the revelation of his own part in this weird masque, which had been planned for him years before, without his knowing. Liza sat beside me, lost in deep thought, her head hanging. Her lips moved slowly as if she were spelling something out in her own mind, following some interior recitation. I shook her hand softly as if to waken her. ‘I should leave you now’ I said softly. ‘And why should I see the private letters at all? There is no need.’ ‘Now that you know the worst and best I would like you to advise me about destroying them. It was his wish. But David feels that they belong to his writings, and that we have a duty to preserve them. I cannot make up my mind about this. You are a writer. Try and read them as a writer, as if you had written them, and then tell me whether you would wish them preserved or not. They are all together in that suitcase. There are one or two other fragments which you might help me edit if you have time or if you think them suitable. He always puzzled me — except when I had him in my arms.’ A sudden expression of savage resentment passed across her white face. As if she had been goaded by a sudden disagreeable memory. She passed her tongue over her dry lips and as we stood up together she added in a small husky voice: ‘There is one thing more. Since you have seen so far into our lives why should you not look right to the bottom? I always keep this close to me.’ Reaching down into her dress she took out a snapshot and handed it to me. It was faded and creased. A small child with long hair done up in ribbons sat upon a park bench, gazing with a melancholy and wistful smile at the camera and holding out a white stick. It took me a moment or so to identify those troubling lines of mouth and nose as the features of Pursewarden himself and to realize that the little girl was blind. ‘Do you see her?’ said Liza in a thrilling whisper that shook the nerves by its strange tension, its mixture of savagery, bitterness and triumphant anguish. ‘Do you see her? She was our child. It was when she died that he was overcome with remorse for a situation which had brought us nothing but joy before. Her death suddenly made him guilty. Our relationship foundered there; and yet it became in another way even more intense, closer. We were united by our guilt from that moment. I have often asked myself why it should be so. Tremendous unbroken happiness and then … one day, like an iron shutter falling, guilt.’ The word dropped like a falling star and expired in the silence. I took this unhappiest of all relics and pressed it into her cold hands. ‘I will take the letters’ I said. ‘Thank you’ she replied with an air now of dazed exhaustion. ‘I knew we had a friend in you. I shall count on your help.’ As I softly closed the front door behind me I heard a chord struck upon the piano — a single chord which hung in the silent air, its vibrations diminishing like an echo. As I crossed among the trees I caught a glimpse of Mountolive sneaking towards the side door of the house. I suddenly divined that he had been walking up and down outside the house in an agony of apprehension, with the air of a schoolboy waiting outside his housemaster’s study to receive a beating. I felt a pang of sympathy for him, for his weakness, for the dreadful entanglement in which he had, found himself. I found to my surprise that it was still early. Clea had gone to Cairo for the day and was not expected back. I took the little suitcase to her flat and sitting on the floor unpacked it. In that quiet room, by the light of her candles, I began to read the private letters with a curious interior premonition, a stirring of something like fear — so dreadful a thing is it to explore the inmost secrets of another human being’s life. Nor did this feeling diminish as I proceeded, rather it deepened into a sort of terror almost a horror of what might be coming next. The letters! Ferocious, sulky, brilliant, profuse — the torrent of words in that close hand flowed on and on endlessly, studded with diamond-hard images, a wild self-analytical frenzy of despair, remorse and passion. I began to tremble as one must in the presence of a great master, to tremble and mutter. With an interior shock I realized that there was nothing in the whole length and breadth of our literature with which to compare them! Whatever other masterpieces Pursewarden may have written these letters outshone them all in their furious, unpremeditated brilliance and prolixity. Literature, I say! But these were life itself, not a studied representation of it in a form — life itself, the flowing undivided stream of life with all its pitiable will-intoxicated memories, its pains, terrors and submissions. Here illusion and reality were fused in one single blinding vision of a perfect incorruptible passion which hung over the writer’s mind like a dark star — the star of death! The tremendous sorrow and beauty which this man expressed so easily — the terrifying abundance of his gifts — filled me with helpless despair and joy at once. The cruelty and the richness! It was as if the words poured from every pore in his body — execrations, groans, mixed tears of joy and despair — all welded to the fierce rapid musical notation of a language perfected by its purpose. Here at last the lovers confronted one another, stripped to the bone, stripped bare. In this strange and frightening experience I caught a glimpse, for a moment, of the true Pursewarden — the man who had always eluded me. I thought with shame of the shabby passages in the Justine manuscript which I had devoted to him — to my image of him! I had, out of envy or unconscious jealousy, invented a Pursewarden to criticize. In everything I had written there I had accused him only of my own weaknesses — even down to completely erroneous estimates of qualities like social inferiorities which were mine, had never been his. It was only now, tracing out the lines written by that rapid unfaltering pen, that I realized that poetic or transcendental knowledge somehow cancels out purely relative knowledge, and that his black humours were simply ironies due to his enigmatic knowledge whose field of operation was above, beyond that of the relative fact-finding sort. There was no answer to the questions I had raised in very truth. He had been quite right. Blind as a mole, I had been digging about in the graveyard of relative fact piling up data, more information, and completely missing the mythopoeic reference which underlies fact. I had called this searching for truth! Nor was there any way in which I might be instructed in the matter — save by the ironies I had found so wounding. For now I realized that his irony was really tenderness turned inside out like a glove! And seeing Purse-warden thus, for the first time, I saw that through his work he had been seeking for the very tenderness of logic itself, of the Way Things Are; not the logic of syllogism or the tide-marks of emotions, but the real essence of fact-finding, the naked truth, the Inkling … the whole pointless Joke. Yes, Joke! I woke up with a start and swore. If two or more explanations of a single human action are as good as each other then what does action mean but an illusion — a gesture made against the misty backcloth of a reality made palpable by the delusive nature of human division merely? Had any novelist before Pursewarden considered this question? I think not. And in brooding over these terrible letters I also suddenly stumbled upon the true meaning of my own relationship to Pursewarden, and through him to all writers. I saw, in fact, that we artists form one of those pathetic human chains which human beings form to pass buckets of water up to a fire, or to bring in a lifeboat. An uninterrupted chain of humans born to explore the inward riches of the solitary life on behalf of the unheeding unforgiving community; manacled together by the same gift. I began to see too that the real ‘fiction’ lay neither in Arnauti’s pages nor Pursewarden’s — nor even my own. It was life itself that was a fiction — we were all saying it in our different ways, each understanding it according to his nature and gift. It was now only that I began to see how mysteriously the configuration of my own life had taken its shape from the properties of those elements which lie outside the relative life — in the kingdom which Pursewarden calls the ‘heraldic universe’. We were three writers, I now saw, confided to a mythical city from which we were to draw our nourishment, in which we were to confirm our gifts. Arnauti, Pursewarden, Darley — like Past, Present and Future tense! And in my own life (the staunchless stream flowing from the wounded side of Time!) the three women who also arranged themselves as if to represent the moods of the great verb, Love: Melissa, Justine and Clea. And realizing this I was suddenly afflicted by a great melancholy and despair at recognizing the completely limited nature of my own powers, hedged about as they were by the limitations of an intelligence too powerful for itself, and lacking in sheer word-magic, in propulsion, in passion, to achieve this other world of artistic fulfilment. I had just locked those unbearable letters away and was sitting in melancholy realization of this fact when the door opened and Clea walked in, radiant and smiling. ‘Why, Darley, what are you doing sitting in the middle of the floor in that rueful attitude? And my dear there are tears in your eyes.’ At once she was down beside me on her knees, all tenderness. ‘Tears of exasperation’ I said, and then, embracing her, ‘I have just realized that I am not an artist at all. There is not a shred of hope of my ever being one.’ ‘What on earth have you been up to?’ ‘Reading Pursewarden’s letters to Liza.’ ‘Did you see her?’ ‘Yes. Keats is writing some absurd book ——’ ‘But I just ran into him. He’s back from the desert for the night.’ I struggled to my feet. It seemed to me imperative that I should find him and discover what I could about his project. ‘He spoke’ said Clea ‘about going round to Pombal’s for a bath. I expect you’ll find him there if you hurry.’ Keats! I thought to myself as I hurried down the street towards the flat; he was also to play his part in this shadowy representation, this tableau of the artist’s life. For it is always a Keats that is chosen to interpret, to drag his trail of slime over the pitiful muddled life of which the artist, with such pain, recaptures these strange solitary jewels of self-enlightenment. After those letters it seemed to me more than ever necessary that people like Keats if possible be kept away from interfering in matters beyond their normal concerns. As a journalist with a romantic story (suicide is the most romantic act for an artist) he doubtless felt himself to be in the presence of what he, in the old days, would have called ‘A stunner. A Story in a Million’. I thought that I knew my Keats — but of course once more I had completely forgotten to take into account the operations of Time, for Keats had changed as we all had, and my meeting with him turned out to be as unexpected as everything else about the city. I had mislaid my key and had to ring for Hamid to open the door for me. Yes, he said, Mr. Keats was there, in the bath. I traversed the corridor and tapped at the door behind which came the sound of rushing water and a cheerful whistling. ‘By God, Darley, how splendid’ he shouted in answer to my call. ‘Come in while I dry. I heard you were back.’ Under the shower stood a Greek god! I was so surprised at the transformation that I sat down abruptly on the lavatory and studied this … apparition. Keats was burnt almost black, and his hair had bleached white. Though slimmer, he looked in first-class physical condition. The brown skin and ashen hair had made his twinkling eyes bluer than ever. He bore absolutely no resemblance to my memories of him! ‘I just sneaked off for the night’ he said, speaking in a new rapid and confident voice. ‘I’m developing one of those blasted desert sores on my elbow, so I got a chit and here I am. I don’t know what the hell causes them, nobody does; perhaps all the tinned muck we eat up there in the desert! But two days in Alex and an injection and presto! The bloody thing dears up again! I say, Darley, what fun to meet again. There’s so much to tell you. This war!’ He was bubbling over with high spirits. ‘God, this water is a treat. I’ve been revelling.’ ‘You look in tremendous shape.’ ‘I am. I am.’ He smacked himself exuberantly on the buttocks ‘Golly though, it is good to come into Alex. Contrasts make you appreciate things so much better. Those tanks get so hot you feel like frying whitebait. Reach my drink, there’s a good chap.’ On the floor stood a tall glass of whisky and soda with an ice cube in it. He shook the glass, holding it to his ear like a child. ‘Listen to the ice tinkling’ he cried in ecstasy. ‘Music to the soul, the tinkle of ice.’ He raised his glass, wrinkled up his nose at me and drank my health. ‘You look in quite good shape, too’ he said, and his blue eyes twinkled with a new mischievous light. ‘Now for some clothes and then … my dear chap, I’m rich. I’ll give you a slap-up dinner at the Petit Coin. No refusals, I’ll not be baulked. I particularly wanted to see you and talk to you. I have news.’ He positively skipped into the bedroom to dress and I sat on Pombal’s bed to keep him company while he did so. His high spirits were quite infectious. He seemed hardly able to keep still. A thousand thoughts and ideas bubbled up inside him which he wanted to express simultaneously. He capered down the stairs into the street like a schoolboy, taking the last flight at a single bound. I thought he would break into a dance along Rue Fuad. ‘But seriously’ he said, squeezing my elbow so hard that it hurt. ‘Seriously, life is wonderful’ and as if to illustrate his seriousness he burst into ringing laughter. ‘When I think how we used to brood and worry.’ Apparently he included me in this new euphoric outlook on life. ‘How slowly we took everything, I feel ashamed to remember it!’ At the Petit Coin we secured a corner table after an amiable altercation with a naval lieutenant, and he at once took hold of Menotti and commanded champagne to be brought. Where the devil had he got this new laughing authoritative manner which instantly commanded sympathetic respect without giving offence? ‘The desert!’ he said, as if in answer to my unspoken question. ‘The desert, Darley, old boy. That is something to be seen.’ From a capacious pocket he produced a copy of the Pickwick Papers. ‘Damn!’ he said. ‘I mustn’t forget to get this copy replaced. Or the crew will bloody well fry me.’ It was a sodden, dog-eared little book with a bullet hole in the cover, smeared with oil. ‘It’s our only library, and some bastard must have wiped himself on the middle third. I’ve sworn to replace it. Actually there’s a copy at the flat. I don’t suppose Pombal would mind my pinching it. It’s absurd. When there isn’t any action we he about reading it aloud to one another, under the stars! Absurd, my dear chap, but then everything is more absurd. More and more absurd every day.’ ‘You sound so happy’ I said, not without a certain envy. ‘Yes’ he said in a smaller voice, and suddenly, for the first time, became relatively serious. ‘I am. Darley, let me make you a confidence. Promise not to groan.’ ‘I promise.’ He leaned forward and said in a whisper, his eyes twinkling, ‘I’ve become a writer at last!’ Then suddenly he gave his ringing laugh. ‘You promised not to groan’ he said. ‘I didn’t groan.’ ‘Well, you looked groany and supercilious. The proper response would have been to shout “Hurrah!” ’ ‘Don’t shout so loud or they’ll ask us to leave.’ ‘Sorry. It came over me.’ He drank a large bumper of champagne with the air of someone toasting himself and leaned back in his chair, gazing at me quizzically with the same mischievous sparkle in his blue eyes. ‘What have you written?’ I asked. ‘Nothing’ he said, smiling. ‘Not a word as yet. It’s all up here.’ He pointed a brown finger at his temple. ‘But now at least I know it is. Somehow whether I do or don’t actually write isn’t important — it isn’t, if you like, the whole point about becoming a writer at all, as I used to think.’ In the street outside a barrel organ began playing with its sad hollow iteration. It was a very ancient English barrel organ which old blind Arif had found on a scrap heap and had fixed up in a somewhat approximate manner. Whole notes misfired and several chords were hopelessly out of tune. ‘Listen’ said Keats, with deep emotion, ‘just listen to old Arif.’ He was in that delicious state of inspiration which only comes when champagne supervenes upon a state of fatigue — a melancholy tipsiness which is wholly inspiriting. ‘Gosh!’ he went on in rapture, and began to sing in a very soft husky whisper, marking time with his finger, ‘Taisez-vous, petit babouin’. Then he gave a great sigh of repletion, and chose himself a cigar from Menotti’s great case of specimens, sauntering back to the table where he once more sat before me, smiling rapturously. ‘This war’ he said at last, ‘I really must tell you…. It is quite different to what I imagined it must be like.’ Under his champagne-bedizened tipsiness he had become relatively grave all at once. He said: ‘Nobody seeing it for the first time could help crying out with the whole of his rational mind in protest at it: crying out “It must stop!” My dear chap, to see the ethics of man at his norm you must see a battlefield. The general idea may be summed up in the expressive phrase: “If you can’t eat it or **** it, then **** on it.” Two thousand years of civilization! It peels off in a flash. Scratch with your little finger and you reach the woad or the ritual war paint under the varnish! Just like that!’ He scratched the air between us languidly with his expensive cigar. ‘And yet — you know what? The most unaccountable and baffling thing. It has made a man of me, as the saying goes. More, a writer! My soul is quite clear, I suppose you could regard me as permanently disfigured! I have begun it at last, that bloody joyful book of mine. Chapter by chapter it is forming in my old journalist’s noodle — no, not a journalist’s any more, a writer’s.’ He laughed again as if at the preposterous notion. ‘Darley, when I look around that … battlefield at night, I stand in an ecstasy of shame, revelling at the coloured lights, the flares wallpapering the sky, and I say: “All this had to be brought about so that poor Johnny Keats could grow into a man.” That’s what. It is a complete enigma to me, yet I am absolutely certain of it. No other way would have helped me because I was too damned stupid, do you see?’ He was silent for a while and somewhat distrait, drawing on his cigar. It was as if he were going over this last piece of conversation in his mind to consider its validity, word by word, as one tests a piece of machinery. Then he added, but with care and caution, and a certain expression of bemused concentration, like a man handling unfamiliar terms: ‘The man of action and the man of reflection are really the same man, operating on two different fields. But to the same end! Wait, this is beginning to sound silly.’ He tapped his temple reproachfully and frowned. After a moment’s thought he went on, still frowning: ‘Shall I tell you my notion about it … the war? What I have come to believe? I believe the desire for war was first lodged in the instincts as a biological shock-mechanism to precipitate a spiritual crisis which couldn’t be done any other how in limited people. The less sensitive among us can hardly visualize death, far less live joyfully with it. So the powers that arranged things for us felt they must concretize it, in order to lodge death in the actual present. Purely helpfully, if you see what I mean!’ He laughed again, but ruefully this time. ‘Of course it is rather different now that the bystander is getting hit harder than the front-line bloke. It is unfair to the men of the tribe who would like to leave the wife and kids in relative safety before stumping off to this primitive ordination. For my part I think the instinct has somewhat atrophied, and may be on the way out altogether; but what will they put in its place — that’s what I wonder? As for me, Darley, I can only say that no half-dozen French mistresses, no travels round the globe, no adventures in the peacetime world we knew could have grown me up so thoroughly in half the time. You remember how I used to be? Look, I’m really an adult now — but of course ageing fast, altogether too fast! It will sound damn silly to you, but the presence of death out there as a normal feature of life — only in full acceleration so to speak — has given me an inkling of Life Everlasting! And there was no other way I could have grasped it, damn it. Ah! well, I’ll probably get bumped off up there in full possession of my imbecility, as you might say.’ He burst out laughing once more, and gave himself three noiseless cheers, raising his cigar-hand ceremoniously at each cheer. Then he winked carefully at me and filled his glass once more, adding with an air of vagueness the coda: ‘Life only has its full meaning to those who co-opt death!’ I could see that he was rather drunk by now, for the soothing effects of the hot shower had worn off and the desert-fatigue had begun to reassert itself. ‘And Pursewarden?’ I said, divining the very moment at which to drop his name, like a hook, into the stream of our conversation. ‘Pursewarden!’ he echoed on a different note, which combined a melancholy sadness and affection. ‘But my dear Darley, it was something like this that he was trying to tell me, in his own rather bloody way. And I? I still blush with shame when I think of the questions I asked him. And yet his answers, which seemed so bloody enigmatic then, make perfect sense to me now. Truth is double-bladed, you see. There is no way to express it in terms of language, this strange bifurcated medium with its basic duality! Language! What is the writer’s struggle except a struggle to use a medium as precisely as possible, but knowing fully its basic imprecision? A hopeless task, but none the less rewarding for being hopeless. Because the task itself, the act of wrestling with an insoluble problem, grows the writer up! This was what the old bastard realized. You should read his letters to his wife. For all their brilliance how he whined and cringed, how despicably he presented himself — like some Dostoievskian character beset by some nasty compulsion neurosis! It is really staggering what a petty and trivial soul he reveals there.’ This was an amazing insight into the tormented yet wholly complete being of the letters which I myself had just read! ‘Keats’ I said, ‘for goodness’ sake tell me. Are you writing a book about him?’ Keats drank slowly and thoughtfully and replaced his glass somewhat unsteadily before saying: ‘No.’ He stroked his chin and fell silent. ‘They say you are writing something’ I persisted. He shook his head obstinately and contemplated his glass with a blurred eye. ‘I wanted to’ he admitted at last, slowly. ‘I did a long review of the novels once for a small mag. The next thing I got a letter from his wife. She wanted a book done. A big rawboned Irish girl, very hysterical and sluttish: handsome in a big way, I suppose. Always blowing her nose in an old envelope. Always in carpet slippers. I must say I felt for him. But I tumbled straight into a hornets’ nest there. She loathed him, and there seemed to be plenty to loathe, I must say. She gave me a great deal of information, and simply masses of letters and manuscripts. Treasure trove all right. But, my dear chap, I couldn’t use this sort of stuff. If for no other reason than that I respect his memory and his work. No. No. I fobbed her off. Told her she would never get such things published. She seemed to want to be publicly martyred in print just to get back at him — old Pursewarden! I couldn’t do such a thing. Besides the material was quite hair-raising! I don’t want to talk about it. Really, I would never repeat the truth to a soul.’ We sat looking thoughtfully, even watchfully at each other, for a long moment before I spoke again. ‘Have you ever met his sister, Liza?’ Keats shook his head slowly. ‘No. What was the point? I abandoned the project right away, so there was no need to try and hear her story. I know she has a lot of manuscript stuff, because the wife told me so. But…. She is here isn’t she?’ His lip curled with the faintest suggestion of disgust. ‘Truthfully I don’t want to meet her. The bitter truth of the matter seems to me that the person old Pursewarden most loved — I mean purely spiritually — did not at all understand the state of his soul, so to speak, when he died: or even have the vaguest idea of the extent of his achievement. No, she was busy with a vulgar intrigue concerned with legalizing her relations with Mountolive. I suppose she feared that her marriage to a diplomat might be imperilled by a possible scandal. I may be wrong, but that is the impression I gathered. I believe she was going to try and get a whitewashing book written. But now, in a sense, I have my own Pursewarden, my own copy of him, if you like. It’s enough for me. What do the details matter, and why should I meet his sister? It is his work and not his life which is necessary to us — which offers one of the many meanings of the word with four faces!’ I had an impulse to cry out ‘Unfair’, but I restrained it. It is impossible in this world to arrange for full justice to be done to everyone. Keats’s eyelids drooped. ‘Come’ I said, calling for the bill, ‘It’s time you went home and got some sleep.’ ‘I do feel rather tired’ he mumbled. ‘Avanti.’ There was an old horse-drawn gharry in a side-street which we were glad to find. Keats protested that his feet were beginning to hurt and his arm to pain him. He was in a pleasantly exhausted frame of mind, and slightly tipsy after his potations. He lay back in the smelly old cab and closed his eyes. ‘D’you know, Darley’ he said indistinctly, ‘I meant to tell you but forgot. Don’t be angry with me, old fellow-bondsman, will you. I know that you and Clea, … Yes, and I’m glad. But I have the most curious feeling that one day I am going to marry her. Really. Don’t be silly about it. Of course I would never breathe a word, and it would happen years after this silly old war. But somewhere along the line I feel I’m bound to hitch up with her.’ ‘Now what do you expect me to say?’ ‘Well, there are a hundred courses open. Myself I would start yelling and screaming at once if you said such a thing to me. I’d knock your block off, push you out of the cab, anything. I’d punch me in the eye.’ The gharry drew up with a jolt outside the house. ‘Here we are’ I said, and helped my companion down into the road. ‘I’m not as drunk as all that’ he cried cheerfully, shaking off my help, ‘ ’tis but fatigue, dear friend.’ And while I argued out the cost of the trip with the driver he went round and held a long private confabulation with the horse, stroking its nose. ‘I was giving it some maxims to live by’ he explained as we wound our weary way up the staircase. ‘But the champagne had muddled up my quotation-box. What’s that thing of Shakespeare’s about the lover and the cuckold all compact, seeking the bubble reputation e’en in the cannon’s mouth.’ The last phrase he pronounced in the strange (man-sawing-wood) delivery of Churchill. ‘Or something about swimmers into cleanness leaping — a pre-fab in the eternal mind no less!’ ‘You are murdering them both.’ ‘Gosh I’m tired. And there seems to be no bombardment tonight.’ ‘They are getting less frequent.’ He collapsed on his bed fully dressed, slowly untying his suede desert boots and wriggling with his toes until they slid slowly off and plopped to the floor. ‘Did you ever see Pursewarden’s little book called select Prayers for English Intellectuals? It was funny. “Dear Jesus, please keep me as eighteenth century as possible — but without the cd….” ’ He gave a sleepy chuckle, put his arms behind his head and started drifting into smiling sleep. As I turned out the light he sighed deeply and said: ‘Even the dead are overwhelming us all the time with kindnesses.’ I had a sudden picture of him as a small boy walking upon the very brink of precipitous cliffs to gather seabirds’ eggs. One slip…. But I was never to see him again. Vale! \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/2015/57511.html","bookId":638,"book":{"id":638,"title":"The Alexandria Quartet 亚历山大四部曲","description":"简介： 伟大的现代巴洛克风格小说，使中产阶级得以亲近地中海。...","cover":"http://novel.tingroom.com/file/upload/201803/12/13-31-30-67-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/2015","creation":"Aug 1, 2019 12:19:04 AM","modification":"Aug 1, 2019 12:19:04 AM"}}
