{"id":107412,"no":10,"title":"Page 10","content":"6\\n\\n The weather was holding up over the undomed area of the Imperial Palace grounds-warm and sunny.\\n\\n It didn\u0027t often happen. Hari remembered Dors telling him once how this particular area with its cold winters and frequent rains had been chosen as the site.\\n\\n \"It wasn\u0027t actually chosen,\" she said. \"It was a family estate of the Morovian family in the early days of the Kingdom of Trantor. When the Kingdom became an Empire, there were numerous sites where the Emperor could live-summer resorts, winter places, sports lodges, beach properties. And, as the planet was slowly domed, one reigning Emperor, living here, liked it so much that it remained undomed. And, just because it was the only area left undomed, it became special-a place apart-and that uniqueness appealed to the next Emperor... and the next... and the next... And so, a tradition was born.\"\\n\\n And as always, when hearing something like that, Seldon would think: And how would psychohistory handle this? Would it predict that one area would remain undomed but be absolutely unable to say which area? Could it go even so far? Could it predict that several areas would remain undomed or none-and be wrong? How could it account for the personal likes and dislikes of an Emperor who happened to be on the throne at the crucial time and who made a decision in a moment of whimsy and nothing more. That way lay chaos-and madness.\\n\\n Cleon I was clearly enjoying the good weather.\\n\\n \"I\u0027m getting old, Seldon,\" he said. \"I don\u0027t have to tell you that. We\u0027re the same age, you and I. Surely it\u0027s a sign of age when I don\u0027t have the impulse to play tennis or go fishing, even though they\u0027ve newly restocked the lake, but am willing to walk gently over the pathways.\"\\n\\n He was eating nuts as he spoke, which resembled what on Seldon\u0027s native world of Helicon would have been called pumpkin seeds, but which were larger and a little less delicate in taste. Cleon cracked them gently between his teeth, peeled the thin shells and popped the kernels into his mouth.\\n\\n Seldon did not like the taste particularly but, of course, when he was offered some by the Emperor, he accepted them and ate a few.\\n\\n The Emperor had a number of shells in his hand and looked vaguely around for a receptacle of some sort that he could use for disposal. He saw none, but he did notice a gardener standing not far away, his body at attention (as it should be in the Imperial presence) and his head respectfully bowed.\\n\\n Cleon said, \"Gardener!\"\\n\\n The gardener approached quickly. \"Sire!\"\\n\\n \"Get rid of these for me,\" he said, tapping the shells into the gardener\u0027s hand.\\n\\n \"Yes, Sire.\"\\n\\n Seldon said, \"I have a few, too, Gruber.\"\\n\\n Gruber held out his hand and said, almost shyly, \"Yes, First Minister.\"\\n\\n He hurried away and the Emperor looked after him curiously. \"Do you know the fellow, Seldon?\"\\n\\n \"Yes, indeed, Sire. An old friend.\"\\n\\n \"The gardener is an old friend? What is he? A mathematical colleague fallen on hard times?\"\\n\\n \"No, Sire. Perhaps you remember the story. It was the time when\"-he cleared his throat, searching for the most tactful way to recall the incident-\"the sergeant threatened my life shortly after I was appointed to my present post through your kindness.\"\\n\\n \"The assassination attempt.\" Cleon looked up to heaven, as though seeking patience. \"I don\u0027t know why everyone is so afraid of that word.\"\\n\\n \"Perhaps,\" said Seldon smoothly, slightly despising himself for the ease with which he had become able to flatter, \"the rest of us are more perturbed at the possibility of something untoward happening to our Emperor than you yourself are.\"\\n\\n Cleon smiled ironically. \"I dare say. And what has this to do with Gruber? Is that his name?\"\\n\\n \"Yes, Sire. Mandell Gruber. I\u0027m sure you will recall, if you cast your mind back, that there was a gardener who came rushing up with a rake to defend me against the armed sergeant.\"\\n\\n \"Ah yes. Was that fellow the gardener who did that?\"\\n\\n \"He was the man, Sire. I\u0027ve considered him a friend ever since and I meet him almost every time I am on the grounds. I think he watches for me, feels proprietary toward me. And, of course, I feel kindly toward him.\"\\n\\n \"I don\u0027t blame you. And while we\u0027re on the subject, how is your formidable lady, Dr. Venabili? I don\u0027t see her often.\"\\n\\n \"She\u0027s a historian, Sire. Lost in the past.\"\\n\\n \"She doesn\u0027t frighten you? She\u0027d frighten me. I\u0027ve been told how she treated that sergeant. One could almost be sorry for him.\"\\n\\n \"She grows savage on my behalf, Sire, but has not had occasion to do so lately. It\u0027s been very quiet.\"\\n\\n The Emperor looked after the disappearing gardener. \"Have we ever rewarded that man?\"\\n\\n \"I have done so, Sire. He has a wife and two daughters and I have arranged that each daughter will have a sum of money put aside for the education of any children she may have.\"\\n\\n \"Very good. But he needs a promotion, I think. Is he a good gardener?\"\\n\\n \"Excellent, Sire.\"\\n\\n \"The Chief Gardener, Malcomber-I\u0027m not quite sure I remember his name-is getting on and is, perhaps, not up to the job anymore. He is well into his late seventies. Do you think this Gruber might be able to take over?\"\\n\\n \"I\u0027m certain he can, Sire, but he likes his present job. It keeps him out in the open in all kinds of weather.\"\\n\\n \"A peculiar recommendation for a job. I\u0027m sure he can get used to administration and I do need someone for some sort of renewal of the grounds. Hmmm. I must think upon this. Your friend Gruber may be just the man I need. By the way, Seldon, what did you mean by saying it\u0027s been very quiet?\"\\n\\n \"I merely meant, Sire, that there has been no sign of discord at the Imperial Court. The unavoidable tendency to intrigue seems to be as near a minimum as it is ever likely to get.\"\\n\\n \"You wouldn\u0027t say that if you were Emperor, Seldon, and had to contend with all these officials and their complaints. How can you tell me things are quiet when reports seem to reach me every other week of some serious breakdown here and there on Trantor?\"\\n\\n \"These things are bound to happen.\"\\n\\n \"I don\u0027t recall such things happening so frequently in previous years.\"\\n\\n \"Perhaps that was because they didn\u0027t, Sire. The infrastructure grows older with time. To make the necessary repairs properly would take time, labor, and enormous expense. This is not a time when a rise in taxes will be looked on favorably.\"\\n\\n \"There\u0027s never any such time. I gather that the people are experiencing serious dissatisfaction over these breakdowns. It must stop and you must see to it, Seldon. What does psychohistory say?\"\\n\\n \"It says what common sense says, that everything is growing older.\"\\n\\n \"Well, all this is quite spoiling the pleasant day for me. I leave it in your hands, Seldon.\"\\n\\n \"Yes, Sire,\" said Seldon quietly.\\n\\n The Emperor strode off and Seldon thought that it was all spoiling the pleasant day for him, too. This breakdown at the center was the alternative he didn\u0027t want. But how was he to prevent it and switch the crisis to the Periphery?\\n\\n Psychohistory didn\u0027t say.\\n\\n 7\\n\\n Raych Seldon felt extraordinarily contented, for it was the first dinner en famille that he had had in some months with the two people he thought of as his father and mother. He knew perfectly well that they were not his parents in any biological sense, but it didn\u0027t matter. He merely smiled at them with complete love.\\n\\n The surroundings were not as warm as they had been at Streeling in the old days, when their home had been small and intimate, a virtual gem in the larger setting of the University. Now, unfortunately, nothing could hide the grandeur of the First Minister\u0027s Palace suite.\\n\\n Raych sometimes stared at himself in the mirror and wondered how it could be. He was not tall, only 163 centimeters in height, distinctly shorter than either parent. He was rather stocky but muscular-and not fat, with black hair and the distinctive Dahlite mustache that he kept as dark and as thick as possible.\\n\\n In the mirror he could still see the street urchin he had once been before the chanciest of great chances had dictated his meeting with Hari and Dors. Seldon had been much younger then and his appearance now made it plain that Raych himself was almost as old now as Seldon had been when they met. Amazingly, Dors had hardly changed at all. She was as sleek and fit as the day Raych had first showed Hari and Dors the way to Mother Rittah\u0027s in Billibotton. And he, Raych, born to poverty and misery, was now a member of the civil service, a small cog in the Ministry of Population.\\n\\n Seldon said, \"How are things going at the Ministry, Raych? Any progress?\"\\n\\n \"Some, Dad. The laws are passed. The court decisions are made. Speeches are pronounced. Still, it\u0027s difficult to move people. You can preach brotherhood all you want, but no one feels like a brother. What gets me is that the Dahlites are as bad as any of the others. They want to be treated as equals, they say, and so they do, but, given a chance, they have no desire to treat others as equals.\"\\n\\n Dors said, \"It\u0027s all but impossible to change people\u0027s minds and hearts, Raych. It\u0027s enough to try and perhaps eliminate the worst of the injustices.\"\\n\\n \"The trouble is,\" said Seldon, \"that through most of history, no one\u0027s been working on this problem. Human beings have been allowed to fester in the delightful game of I\u0027m-better-than-you and cleaning up that mess isn\u0027t easy. If we allow things to follow their own bent and grow worse for a thousand years, we can\u0027t complain if it takes, say, a hundred years to work an improvement.\"\\n\\n \"Sometimes, Dad,\" said Raych, \"I think you gave me this job to punish me.\"\\n\\n Seldon\u0027s eyebrows raised. \"What motivation could I have had to punish you?\"\\n\\n \"For feeling attracted to Joranum\u0027s program of sector equality and for greater popular representation in government.\"\\n\\n \"I don\u0027t blame you for that. These are attractive suggestions, but you know that Joranum and his gang were using it only as a device to gain power. Afterward-\"\\n\\n \"But you had me entrap him, despite my attraction to his views.\"\\n\\n Seldon said, \"it wasn\u0027t easy for me to ask you to do that.\"\\n\\n \"And now you keep me working at the implementation of Joranum\u0027s program, just to show me how hard the task is in reality.\"\\n\\n Seldon said to Dors, \"How do you like that, Dors? The boy attributes to me a kind of sneaky underhandedness that simply isn\u0027t part of my character.\"\\n\\n \"Surely,\" said Dors with the ghost of a smile playing at her lips, \"you are attributing no such thing to your father.\"\\n\\n \"Not really. In the ordinary course of life, there\u0027s no one straighter than you, Dad. But if you have to, you know you can stack the cards. Isn\u0027t that what you hope to do with psychohistory?\"\\n\\n Seldon said sadly, \"So far, I\u0027ve done very little with psychohistory.\"\\n\\n \"Too bad. I keep thinking that there is some sort of psychohistorical solution to the problem of human bigotry.\"\\n\\n \"Maybe there is, but, if so, I haven\u0027t found it.\"\\n\\n When dinner was over, Seldon said, \"You and I, Raych, are going to have a little talk now.\"\\n\\n \"Indeed?\" said Dors. \"I take it I\u0027m not invited.\"\\n\\n \"Ministerial business, Dors.\"\\n\\n \"Ministerial nonsense, Hari. You\u0027re going to ask the poor boy to do something I wouldn\u0027t want him to do.\"\\n\\n Seldon said firmly, \"I\u0027m certainly not going to ask him to do anything he doesn\u0027t want to do.\"\\n\\n Raych said, \"It\u0027s all right, Mom. Let Dad and me have our talk. I promise I\u0027ll tell you all about it afterward.\"\\n\\n Dors\u0027s eyes rolled upward. \"You two will plead \u0027state secrets.\u0027 I know\\n\\n \"As a matter of fact,\" said Seldon firmly, \"that\u0027s exactly what I must discuss. And of the first magnitude. I\u0027m serious, Dors.\"\\n\\n Dors rose, her lips tightening. She left the room with one final injunction. \"Don\u0027t throw the boy to the wolves, Hari.\"\\n\\n And after she was gone, Seldon said quietly, \"I\u0027m afraid that throwing you to the wolves is exactly what I\u0027ll have to do, Raych.\"\\n\\n 8\\n\\n They faced each other in Seldon\u0027s private office, his \"thinking place,\" as he called it. There, he had spent uncounted hours trying to think his way past and through the complexities of Imperial and Trantorian government.\\n\\n He said, \"Have you read much about the recent breakdowns we\u0027ve been having in planetary services, Raych?\"\\n\\n \"Yes,\" said Raych, \"but you know, Dad, we\u0027ve got an old planet here. What we gotta do is get everyone off it, dig the whole thing up, replace everything, add the latest computerizations, and then bring everyone back-or at least half of everyone. Trantor would be much better off with only twenty billion people.\"\\n\\n \"Which twenty billion?\" asked Seldon smiling.\\n\\n \"I wish I knew,\" said Raych darkly. \"The trouble is, we can\u0027t redo the planet, so we just gotta keep patching.\"\\n\\n \"I\u0027m afraid so, Raych, but there are some peculiar things about it. Now I want you to check me out. I have some thoughts about this.\"\\n\\n He brought a small sphere out of his pocket.\\n\\n \"What\u0027s that?\" asked Raych.\\n\\n \"It\u0027s a map of Trantor, carefully programmed. Do me a favor, Raych, and clear off this tabletop.\"\\n\\n Seldon placed the sphere more or less in the middle of the table and placed his hand on a keypad in the arm of his desk chair. He used his thumb to close a contact and the light in the room went out while the tabletop glowed with a soft ivory light that seemed about a centimeter deep. The sphere had flattened and expanded to the edges of the table.\\n\\n The light slowly darkened in spots and took on a pattern. After some thirty seconds, Raych said in surprise, \"It is a map of Trantor.\"\\n\\n \"Of course. I told you it was. You can\u0027t buy anything like this at a sector mall, though. This is one of those gadgets the armed forces play with. It could present Trantor as a sphere, but a planar projection would more clearly show what I want to show.\"\\n\\n \"And what is it you want to show, Dad?\"\\n\\n \"Well, in the last year or two, there have been breakdowns. As you say, it\u0027s an old planet and we\u0027ve got to expect breakdowns, but they\u0027ve been coming more frequently and they would seem, almost uniformly, to be the result of human error.\"\\n\\n \"Isn\u0027t that reasonable?\"\\n\\n \"Yes, of course. Within limits. This is true, even where earthquakes are involved.\"\\n\\n \"Earthquakes? On Trantor?\"\\n\\n \"I admit Trantor is a fairly nonseismic planet-and a good thing, too, because enclosing a world in a dome when the world is going to shake itself badly several times a year and smash a section of that dome would be highly impractical. Your mother says that one of the reasons Trantor, rather than some other world, became the Imperial capital is that it was geologically moribund-that\u0027s her unflattering expression. Still, it might be moribund, but it\u0027s not dead. There are occasional minor earthquakes-three of them in the last two years.\"\\n\\n \"I wasn\u0027t aware of that, Dad.\"\\n\\n \"Hardly anyone is. The dome isn\u0027t a single object. It exists in hundreds of sections, each one of which can be lifted and set ajar to relieve tensions and compressions in case of an earthquake. Since an earthquake, when one does occur, lasts for only ten seconds to a minute, the opening endures only briefly. It comes and goes so rapidly that the Trantorians beneath are not even aware of it. They are much more aware of a mild tremor and a faint rattling of crockery than of the opening and closing of the dome overhead and the slight intrusion of the outside weather-whatever it is.\"\\n\\n \"That\u0027s good, isn\u0027t it?\"\\n\\n \"It should be. It\u0027s computerized, of course. The onset of an earthquake anywhere sets off the key controls for the opening and closing of that section of the dome so that it opens just before the vibration becomes strong enough to do damage.\"\\n\\n \"Still good.\"\\n\\n \"But in the case of the three minor earthquakes over the last two years, the dome controls failed in each case. The dome never opened and, in each case, repairs were required. It took some time, it took some money, and the weather controls were less than optimum for a considerable period of time. Now, what, Raych, are the chances that the equipment would have failed in all three cases?\"\\n\\n \"Not high?\"\\n\\n \"Not high at all. Less than one in a hundred. One can suppose that someone had gimmicked the controls in advance of an earthquake. Now, about once a century, we have a magma leak, which is far more difficult to control-and I\u0027d hate to think of the results if it went unnoticed until it was too late. Fortunately that hasn\u0027t happened and isn\u0027t likely to, but consider-Here on this map you will find the location of the breakdowns that have plagued us over the past two years and that seem to be attributable to human error, though we haven\u0027t once been able to tell to whom each might be attributed.\"\\n\\n \"That\u0027s because everyone is busy protecting his back.\"\\n\\n \"I\u0027m afraid you\u0027re right. That\u0027s a characteristic of any bureaucracy and Trantor\u0027s is the largest in history. But what do you think of the locations?\"\\n\\n The map had lit up with bright little red markings that looked like small pustules covering the land surface of Trantor.\\n\\n \"Well,\" said Raych cautiously, \"they seem to be evenly spread.\"\\n\\n \"Exactly-and that\u0027s what\u0027s interesting. One would expect that the older sections of Trantor, the longest-domed sections, would have the most decayed infrastructure and would be more liable to events requiring quick human decision and laying the groundwork for possible human error. I\u0027ll superimpose the older sections of Trantor on the map in a bluish color and you\u0027ll notice that the breakdowns don\u0027t seem to be taking place any oftener on the blue areas.\"\\n\\n \"And?\"\\n\\n \"And what I think it means, Raych, is that the breakdowns are not of natural origin but are deliberately caused and spread out in this fashion to affect as many people as possible, thus creating a dissatisfaction that is as widespread as possible.\"\\n\\n \"It don\u0027t seem likely.\"\\n\\n \"No? Then let\u0027s look at the breakdowns as spread through time rather than through space.\"\\n\\n The blue areas and the red spots disappeared and, for a time, the map of Trantor was blank-and then the markings began to appear and disappear one at a time, here and there.\\n\\n \"Notice,\" said Seldon, \"that they don\u0027t appear in clumps in time, either. One appears, then another, then another, and so on, almost like the steady ticking of a metronome.\"\\n\\n \"Do ya think that\u0027s on purpose, too?\"\\n\\n \"It must be. Whoever is bringing this about wants to cause as much disruption with as little effort as possible, so there\u0027s no use doing two at once, where one will partially cancel the other in the news and in the public consciousness. Each incident must stand out in full irritation.\"\\n\\n The map went out and the lights went on. Seldon returned the sphere, shrunken back to its original size, to his pocket.\\n\\n Raych said, \"Who would be doing all this?\"\\n\\n Seldon said thoughtfully, \"A few days ago I received a report of a murder in Wye Sector.\"\\n\\n \"That\u0027s not unusual,\" said Raych. \"Even though Wye isn\u0027t one of your really lawless sectors, there must be lots of murders there every day.\"\\n\\n \"Hundreds,\" said Seldon, shaking his head. \"We\u0027ve had bad days when the number of deaths by violence on Trantor as a whole approaches the million-a-day mark. Generally there\u0027s not much chance of finding every culprit, every murderer. The dead just enter the books as statistics. This one, however, was unusual. The man had been knifed-but unskillfully. He was still alive when found, just barely. He had time to gasp out one word before he died and that word was \u0027Chief.\u0027\\n\\n \"That roused a certain curiosity and he was actually identified. He works in Anemoria and we don\u0027t know what he was doing in Wye. But some worthy officer managed to dig up the fact that he was an old Joranumite. His name was Kaspal Kaspalov and he is well known to have been one of the intimates of Laskin Joranum. And now he\u0027s deadknifed.\"\\n\\n Raych frowned. \"Do you suspect another Joranumite Conspiracy, Dad? There aren\u0027t any Joranumites around anymore.\"\\n\\n \"It wasn\u0027t long ago that your mother asked me if I thought that the Joranumites were still active and I told her that any odd belief always retained a certain cadre, sometimes for centuries. They\u0027re usually not very important, just splinter groups that simply don\u0027t count. Still, what if the Joranumites have kept up an organization, what if they have retained a certain strength, what if they are capable of killing someone they consider a traitor in their ranks, and what if they are producing these breakdowns as a preliminary to seizing control?\"\\n\\n \"That\u0027s an awful lot of \u0027what if \u0027s,\u0027 Dad.\"\\n\\n \"I know that. And I might be totally wrong. The murder happened in Wye and, as it so happens, there have been no infrastructure breakdowns in Wye.\"\\n\\n \"What does that prove?\"\\n\\n \"It might prove that the center of the conspiracy is in Wye and that the conspirators don\u0027t want to make themselves uncomfortable, only the rest of Trantor. It also might mean that it\u0027s not the Joranumites at all but members of the old Wyan family who still dream of ruling the Empire once again.\"\\n\\n \"Oh boy, Dad. You\u0027re building all this on very little.\"\\n\\n \"I know. Now suppose it is another Joranumite Conspiracy. Joranum had, as his right-hand man, Gambol Deen Namarti. We have no record of Namarti\u0027s death, no record of his having left Trantor, no record of his life over the last decade or so. That\u0027s not terribly surprising. After all, it\u0027s easy to lose one person among forty billion. There was a time in my life when I tried to do just that. Of course, Namarti may be dead. That would be the easiest explanation, but he may not be.\"\\n\\n \"What do we do about it?\"\\n\\n Seldon sighed. \"The logical thing would be to turn to the security establishment, but I can\u0027t. I don\u0027t have Demerzel\u0027s presence. He could cow people; I can\u0027t. He had a powerful personality; I\u0027m just a-mathematician. I shouldn\u0027t be First Minister at all; I\u0027m not cut out for it. And I wouldn\u0027t be-if the Emperor weren\u0027t fixated on psychohistory to a far greater extent than it deserves.\"\\n\\n \"You\u0027re kinda whipping yourself, ain\u0027t you, Dad?\"\\n\\n \"Yes. I suppose I am, but I have a picture of myself going to the security establishment, for instance, with what I have just shown you on the map\"-he pointed to the now-empty tabletop-\"and arguing that we were in great danger of some conspiracy of unknown consequence and nature. They would listen solemnly and, after I had left, they would laugh among themselves about \u0027the crazy mathematician\u0027-and then do nothing.\"\\n\\n \"Then what do we do about it?\" said Raych, returning to the point.\\n\\n \"It\u0027s what you will do about it, Raych. I need more evidence and I want you to find it for me. I would send your mother, but she won\u0027t leave me under any circumstances. I myself can\u0027t leave the Palace grounds at this time. Next to Dors and myself, I trust you. More than Dors and myself, in fact. You\u0027re still quite young, you\u0027re strong, you\u0027re a better Heliconian Twister than I ever was, and you\u0027re smart.\\n\\n \"Mind you, now, I don\u0027t want you to risk your life. No heroism, no derring-do. I couldn\u0027t face your mother if anything happened to you. Just find out what you can. Perhaps you\u0027ll find that Namarti is alive and operating-or dead. Perhaps you\u0027ll find out that the Joranumites are an active group-or moribund. Perhaps you\u0027ll find out that the Wyan ruling family is active-or not. Any of that would be interesting-but not vital. What I want you to find out is whether the infrastructure breakdowns are of human manufacture, as I think they are, and, far more important still, if they are deliberately caused, what else the conspirators plan to do. It seems to me they must have plans for some major coup and, if so, I must know what that will be.\"\\n\\n Raych said cautiously, \"Do you have some kinda plan to get me started?\"\\n\\n \"Yes indeed, Raych. I want you to go down to the area of Wye where Kaspalov was killed. Find out if you can if he was an active Joranumite and see if you can\u0027t join a Joranumite cell yourself.\"\\n\\n \"Maybe that\u0027s possible. I can always pretend to be an old Joranumite. It\u0027s true that I was pretty young when Jo-Jo was sounding off, but I was very impressed by his ideas. It\u0027s even sorta true.\"\\n\\n \"Well yes, but there\u0027s one important catch. You might be recognized. After all, you\u0027re the son of the First Minister. You have appeared on holovision now and then and you have been interviewed concerning your views on sector equality.\"\\n\\n \"Sure, but-\"\\n\\n \"No buts, Raych. You\u0027ll wear elevated shoes to add three centimeters to your height and we\u0027ll have someone show you how to change the shape of your eyebrows and make your face fuller and change the timbre of your voice.\"\\n\\n Raych shrugged. \"A lotta trouble for nothing.\"\\n\\n \"And,\" said Seldon with a distinct quaver, \"you will shave off your mustache.\"\\n\\n Raych\u0027s eyes widened and for a moment he sat there in appalled silence. Finally he said in a hoarse whisper, \"Shave my mustache?\"\\n\\n \"Clean as a whistle. No one would recognize you without it.\"\\n\\n \"But it can\u0027t be done. Like cutting off your-Like castration.\"\\n\\n Seldon shook his head. \"It\u0027s just a cultural curiosity. Yugo Amaryl is as Dahlite as you are and he wears no mustache.\"\\n\\n \"Yugo is a nut. I don\u0027t think he\u0027s alive at all, except for his mathematics.\"\\n\\n \"He\u0027s a great mathematician and the absence of a mustache does not alter that fact. Besides, it\u0027s not castration. Your mustache will grow back in two weeks.\"\\n\\n \"Two weeks! It\u0027ll take two years to reach this-this-\"\\n\\n He put his hand up, as though to cover and protect it.\\n\\n Seldon said inexorably, \"Raych, you have to do it. It\u0027s a sacrifice you must make. If you act as my spy with your mustache, you may-come to harm. I can\u0027t take that chance.\"\\n\\n \"I\u0027d rather die,\" said Raych violently.\\n\\n \"Don\u0027t be melodramatic,\" said Seldon severely. \"You would not rather die and this is something you must do. However\"-and here he hesitated-\"don\u0027t say anything about it to your mother. I will take care of that.\"\\n\\n Raych stared at his father in frustration and then said in a low and despairing tone, \"All right, Dad.\"\\n\\n Seldon said, \"I will get someone to supervise your disguise and then you will go to Wye by air-jet. Buck up, Raych, it\u0027s not the end of the world.\"\\n\\n Raych smiled wanly and Seldon watched him leave, a deeply troubled look on his face. A mustache could easily be regrown, but a son could not. Seldon knew perfectly well that he was sending Raych into danger. \\n\\n","sourceLink":"https://allnovel.net/forward-the-foundation-foundation-7/page-10.html","bookId":2019,"book":{"id":2019,"title":"Forward the Foundation (Foundation #7)","description":"Storyline: Forward the Foundation (Foundation: Prequel, #2) \\n A stunning testament to his creative genius. Forward The Foundation is a the saga\u0027s dramatic climax -- the story Asimov fans have been waiting for. An exciting tale of danger, intrigue, and suspense, Forward The Foundation brings to vivid life Asimov\u0027s best loved characters: hero Hari Seldon, who struggles to perfect his revolutionary theory of psychohistory to ensure the survival of humanity; Cleon II, the vain and crafty emperor of the Galactic Empire.\\n","cover":"https://allnovel.net/images/forward-the-foundation-foundation-7.jpg","author":"Isaac Asimov","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/forward-the-foundation-foundation-7.html","creation":"Oct 5, 2019 8:58:15 AM","modification":"Oct 5, 2019 11:06:32 PM"}}
