{"id":68177,"no":10,"title":"Page 10","content":"\n “Damn, she must be hungry,” Will said.\n Hilary slid up behind Belinda with a pair of electric clippers in her dainty hand. David still couldn’t see her as the head of the Pretty Ones, or maybe he didn’t want to. Hilary clicked on the clippers and made one buzzing stroke down the top of Belinda’s head. It revealed a wide stripe of scalp.\n Belinda wept and hid her face. Hilary continued, stroke after stroke, shedding shiny ringlets of white hair down onto the black square.\n The school knew Hilary as cruel, even evil. The hottest girl in the hottest gang, who showed no mercy for anyone and never lifted a finger. David couldn’t stand that he was still attracted to her, but he was, even while she shaved a poor fat girl’s head.\n Hilary looked up, right at David, as though she could smell his eyes on her. He tried to read the expression on her face but couldn’t. He wanted to talk to her.\n “Are we goin’?” Will said.\n David turned his head. Will was twenty feet ahead of him, at the exit. He looked back to Hilary one more time, but his view of her was blocked.\n Sam stood in the doorway.\n His blond eyebrows were bunched up like train cars in a horrible accident. David only met the wrath in Sam’s eyes for a moment. He instinctively looked down and scurried out of the market, feeling like the slave who had dared to look the king in his face.\n 7\n THE FOYER SMELLED LIKE A DIRTY OVEN.\n The floor was charred from a trash fire that had gotten out of control a few weeks earlier. It was warped and scarred like a burn victim’s back. Dim light glinted off scratches on the steel entrance doors, They were engraved names put there by each student as they “graduated.” Beside the doors was the graduation booth, as it had come to be called. The small screen above the thumb scanner, inside the booth, played a loop of a series of health videos from the military.\n David hummed one of the cheesy jingles from the video as he waited for Will to finish up in the bathroom. Even though it was barely audible from this distance, he knew it well. It would be stuck in his head all day now.\n Only minutes before, a large crowd of Freaks had gathered to see their gang mate graduate. The kid had scanned his thumb and been verified. The doors opened for him, and he entered the containment cell on the other side, which was a coffin-shaped capsule big enough for only one person. The doors closed, and he was gone. It was a near daily routine.\n Only a handful of Freaks remained in the foyer, telling stories about their friend who made it out and forecasting their own graduation day. David couldn’t wait to be out either, for all the same reasons as anyone else, but at the moment, it was just so that he’d never have to back down from Sam again.\n “Hey!”\n David jumped. He turned and saw Dickie Bellman standing behind him. Dickie was the old student body president.\n He still wore his tie and jacket from the day of the explosion, but now they were stained and rank. His eyes sparkled with excitement, but his teeth were yellow and looked like he slept with a mouth full of coffee every night.\n “Jeezus, Dickie,” David said. “What do you want?” Dickie presented a clipboard with a frayed, water-stained notepad clipped to it and a pen dangling on a string.\n “I’ve got a petition going to get our cell phone service and Internet switched back on. We really need your support on this one,” Dickie said with an insistent nod.\n “No, thanks.”\n Dickie stared back, baffled, “We’ve all got to work together, David. Don’t you want to call people on the outside? Your parents? Doesn’t the student body have a right to communi-cate with the world? We are very close to getting this issue handled.”\n Dickie leaned in as if he was about to let David in on a big secret. Up close, any semblance of competence dissipated. As he whispered, his breath hit David’s nostrils, smelling like pure ass.\n “I’ve got ’em on the ropes, David. I mean, we’re talking about maybe a couple more months. If that.”\n “A couple more months . . .”\n “Until they let us all out. All of us. I’ve got their word.”\n “Their word? The military? You’re talking to them?” David asked.\n Dickie nodded. “Every day. They trust me, David.” David grinned and signed the petition. Dickie beamed and patted him on the arm.\n “You won’t regret it. You’re a friend to the cause, David.\n Remember to vote for me again next year,” Dickie said.\n “I’m graduating.”\n “Right. Well, I’d appreciate it if you put in a good word with your brother for me,” Dickie said, then trotted off, petition in hand. Sometimes David envied Dickie. Physically he was locked in there with the rest of them, but mentally he was somewhere else entirely. In Dickie’s mind there had been more contact with the military since that lieutenant explained everything to them. There was more than just food every two weeks. For him, there was a dialogue happening with the outside, and it gave Dickie constant hope that things were changing for the better. Must be been nice.\n David’s eye was drawn to a girl by the stairs, beyond the Freaks. She had the lightest skin he’d ever seen. She stood out against the blackened backdrop like a dove in a storm cloud. She wore a tattered white dress and clutched a white leather pocketbook in her hand. Her hair was yellow. She was a Pretty One.\n David found himself wandering closer to get a better look.\n Something didn’t feel right. The girl was alone and inching toward the graduation booth. She looked around nervously, stepped inside, then laid her thumb on the scanner. Moments later, a buzz echoed out into the foyer, and a message flashed on the screen in large block letters:\n VIRUS ACTIVE. NO RELEASE SCHEDULED.\n The girl blankly stared up at the screen. She placed her thumb on the scanner again as if she hadn’t even seen the results. Another buzz rang out. This time, she winced at the sound. The girl shook her head and jammed her thumb down a third time. Another buzz. The remaining Freak stragglers watched her and chuckled.\n The girl started to whimper. This was not the place for a breakdown. Her eyes were wide and heartbreakingly vulnerable. David thought she had a face like the angel statues in the cemetery where they’d buried his mother, minus the bird shit.\n David looked for the cursive letter P that was stenciled onto every Pretty One’s white sweater. It wasn’t there. Instead, there was an ugly rip that exposed the skin of her chest.\n He scanned the foyer again. One of the Freaks whistled in her direction. David didn’t like the look of any of them. They must have seen her torn sweater and made the same assumption he did.\n She had no one protecting her anymore.\n Everyone knew that if you messed with a gang member, you had their whole gang to answer to. But if your gang tossed you out, you were back to square one. This girl was too beautiful to just blend into the background. She would always be noticed. If she bluffed that she could handle herself, she might have been able to walk past those Freaks without being bothered. But she was trembling, and they had stopped talking to each other entirely. Their eyes stalked her.\n The girl looked from face to face for a friendly one. With each look, she lost more hope until she locked eyes with David. He looked away; he couldn’t help it. David glanced back to the bathrooms. Where was Will?\n The girl clutched her bag to her belly. She searched for a way out of the foyer, but there were Freaks between her and every exit. She backed toward the booth again, terrified.\n David tightened his grip on his overstuffed backpack. It was filled with everything he had to eat. He’d get a bit more for laundry during the next two weeks, but this was most of it. He couldn’t risk losing it all to help her.\n She tried the thumb pad again. The speakers buzzed. It seemed louder this time. All the Freaks in the foyer pushed off their respective walls at once, like foxhounds who’d just heard the hunting horn.\n This wasn’t David’s problem.\n The guys crept toward her, hungry grins on their faces. She yelped. He wanted her to run. This was her last chance to get away. She huddled farther back into the booth instead and pulled the glass door shut. The guys collectively surged forward. The fox had trapped itself.\n “Whoa. What do we got here?” a voice bellowed out of the shadows. Everyone turned to see Brad Hammond in his football jersey and Nantucket red shorts, party cup in his hand.\n His thick calves crisscrossed as he trudged down the stairs, drunk.\n “These guys bothering you, sweetie?” Brad slurred as he stepped into the foyer. The comment prompted the Freaks to back off, fast. They wanted no trouble with Varsity, especially Brad. He was Sam’s best friend.\n “You guys think you’re gonna get something going with a girl this hot?” Brad broadcast as he approached the testing booth. He stared down every single guy who had been moving in on her. All of them backed down.\n “Nah, none of you little bitches got the ca-HO-nays,” Brad grunted.\n Brad waved them off and spun back to the testing booth.\n He peered through the glass at the girl, who had not moved, her back still pressed against the farthest corner. Brad studied her with the curiosity of a kindergartner staring at a hamster in a cage.\n “What’s the matter?” he said in a softer voice.\n “N-n-nothing,” she said.\n “Why don’t you come out of there?”\n The girl didn’t move. So, Brad opened the door for her.\n There was nothing sudden about the move, but she jumped anyway.\n “Relax,” Brad grinned. “You think I’m gonna hurt you?”\n “No.” She shook her head. Brad squinted his eyes. The big rusty gears in his head were clunking into place. He looked back at the Freaks, still frozen in place. His face darkened with ominous intention.\n “Get lost,” Brad said, and the onlookers scattered. He didn’t seem to see David. Brad turned back to the girl. As soon as he did, the Freaks crept back around the corners to watch. None of them wanted to miss what was bound to be major gossip fodder. They might even be able to spin a trade out of their story. \n","sourceLink":"https://allnovel.net/the-loners-quarantine-1/page-10.html","bookId":1722,"book":{"id":1722,"title":"The Loners (Quarantine #1)","description":"Storyline: \n The Loners (Quarantine #1) \n It was just another ordinary day at McKinley High—until a massive explosion devastated the school. When loner David Thorpe tried to help his English teacher to safety, the teacher convulsed and died right in front of him. And that was just the beginning. \n A year later, McKinley has descended into chaos. All the students are infected with a virus that makes them deadly to adults. The school is under military quarantine. The teachers are gone. Violent gangs have formed based on high school social cliques. Without a gang, you’re as good as dead. And David has no gang. It’s just him and his little brother, Will, against the whole school. \n In this frighteningly dark and captivating novel, Lex Thomas locks readers inside a school where kids don’t fight to be popular, they fight to stay alive.\n \n","cover":"https://allnovel.net/images/the-loners-quarantine-1.jpg","author":"Lex Thomas","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-loners-quarantine-1.html","creation":"Oct 5, 2019 8:57:54 AM","modification":"Oct 5, 2019 10:07:45 AM"}}
