{"id":87960,"no":20,"title":"Page 20","content":"\"Do you live in Boston now?\"\\n\\n \"No.\"\\n\\n She waited for him to continue, and when he didn\u0027t, she asked, \"Where do you live?\"\\n\\n \"Pretty much out of a suitcase these days.\"\\n\\n It wasn\u0027t much of an answer. She wasn\u0027t going to press, though. What did she care where he lived? After tonight she probably would never see him again. \"Any brothers or sisters?\"\\n\\n \"One younger brother. Okay, now it\u0027s your turn. Tell me about your family.\"\\n\\n She was certain he knew all about her family. The background check Phillips and he had done had obviously been thorough, but she decided to play along. Better to humor the man than to alienate him.\\n\\n \"My aunt and uncle live in Emerson. It\u0027s a small town about two and a half hours away from Boston. I have a sister, Charlotte. She\u0027s older, but we\u0027re very close.\"\\n\\n He didn\u0027t say a word. He simply waited for her to tell him more.\\n\\n \"My parents went up in a small plane with a friend. All three of them died in the crash. I was four years old when it happened, and Charlotte was ten. My aunt and uncle took us in. If they hadn\u0027t, we would have had to go into foster care and probably be separated. I\u0027m very grateful to them.\"\\n\\n It wasn\u0027t what she said but how she said it in a flat voice that revealed volumes, as though she\u0027d said it so many times it was now an automatic response.\\n\\n \"I have a cousin,\" she continued. \"His name is Will. He\u0027s two years older than I am, and we aren\u0027t close at all. You know that, too, don\u0027t you?\" \\n\\n \"I do?\"\\n\\n Liam flashed a quick smile that nearly broke her concentration. He really was a sexy devil. She shook away the ridiculous thought and remembered what she wanted to say. \"Now you want me to talk about him, don\u0027t you?\"\\n\\n \"Actually . . .\"\\n\\n \"Yes, Will\u0027s been in trouble with the law. More than once, as a matter of fact, and I\u0027ll admit he can be really obnoxious, and yes, he does have a terrible temper, but he went to anger management classes and has a counselor to get help with that. Okay, so it wasn\u0027t his idea. The court made him go. Still, I\u0027m sure it will make a difference.\" She sighed then and said almost in a whisper, \"No, that\u0027s not true. I don\u0027t think it will make a difference. Will has some bad habits. Running with a group of troublemakers is one of them.\"\\n\\n \"What\u0027s another?\" he asked.\\n\\n \"He\u0027s not willing to work hard to get ahead. He\u0027s after easy money and doesn\u0027t care how he gets it and who he hurts,\" she answered. \"He can justify anything,\" she continued. \"He\u0027s always got a get-rich-quick plan, and of course they all backfire. He\u0027s bounced a lot of checks, but his parents always cover them. The truth is, Will hasn\u0027t grown up, and I\u0027m not sure he ever will. He\u0027s been spoiled all his life. His parents live to please him. It\u0027s disgusting, really-\" She stopped abruptly, realizing she was sharing far more than she should. It was just that, once the feelings surfaced, she couldn\u0027t stop them from spilling out.\\n\\n \"What about computers?\" Liam asked.\\n\\n \"What about them?\"\\n\\n \"How good is Will with computers?\"\\n\\n \"He isn\u0027t a hacker, if that\u0027s what you\u0027re wanting to know. Yes, he knows his way around a computer, and he thinks he\u0027s good, but he isn\u0027t. I\u0027d rate him mediocre.\"\\n\\n \"Does he know what you can do?\"\\n\\n \"I don\u0027t think so, but I can\u0027t be sure.\"\\n\\n Allison stared at the passing streetlights, lost in thought. She had rambled on and on and didn\u0027t have any idea what Liam was thinking now. Had she been disloyal to tell him the truth about Will? The irony was, she\u0027d actually softened the truth. After mulling the question over, she decided she hadn\u0027t told him anything he didn\u0027t already know. She suddenly noticed she was crossing and uncrossing her legs again and immediately stopped.\\n\\n \"Allison?\"\\n\\n \"Yes?\"\\n\\n \"Are you always this uptight?\"\\n\\n \"No, not always,\" she replied. \"But when I\u0027m with an FBI agent who won\u0027t tell me what he wants from me, I do tend to get a little apprehensive.\"\\n\\n Everything about this situation was bizarre. Here she was, riding in a car with a man she knew virtually nothing about, other than the fact that he worked for the FBI and held a great deal of authority. That was obvious in the way the agents answered to him. It was also undeniable that he was very attractive and charismatic. He definitely oozed animal magnetism. Women went weak-kneed over mysterious men like him, but not her. She would never allow herself to be so vulnerable. She didn\u0027t have time.\\n\\n Allison was so caught up in her musings she wasn\u0027t aware that the car had come to a stop.\\n\\n While she was sitting there pondering her circumstances, Liam had walked around the car to open her door. He waited a minute and then asked, \"Are you about ready to get out?\" \\n\\n","sourceLink":"https://allnovel.net/wired-buchanan-renard-13/page-20.html","bookId":1824,"book":{"id":1824,"title":"Wired (Buchanan-Renard #13)","description":"Storyline: A beautiful computer hacker and a bad-boy FBI agent must collaborate—in more ways than one—in the sizzling new novel from #1 New York Times bestselling author Julie Garwood. \\n Allison Trent doesn’t look like a hacker. In fact, when she’s not in college working on her degree, she models on the side. But behind her gorgeous face is a brilliant mind for computers and her real love is writing—and hacking—code. Her dream is to write a new security program that could revolutionize the tech industry. \\n Hotshot FBI agent Liam Scott has a problem: a leak deep within his own department. He needs the skills of a top-notch hacker to work on a highly sensitive project: to secretly break into the FBI servers and find out who the traitor is. But he can’t use one of his own. He finds the perfect candidate in Allison. Only, there’s one problem—she wants nothing to do with his job and turns him down flat. \\n What Liam doesn’t know is that Allison is hiding secrets that she doesn’t want the FBI to uncover. But Liam will do nearly anything to persuade her to join his team, even break a few rules if that’s what it takes. A temptation that could put his job—and both of their futures—on the line… \\n and longing for more . . .\\n","cover":"https://allnovel.net/images/wired-buchanan-renard-13.jpg","author":"Julie Garwood","type":"Romance","source":"allnovel","link":"https://allnovel.net/wired-buchanan-renard-13.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:23:28 PM"}}
