{"id":87970,"no":30,"title":"Page 30","content":"\"How do you want to do this?\" Liam asked.\n \"Do what?\"\n \"What we\u0027ve been talking about all evening. Getting into the FBI system without being detected.\" He smiled as though he could tell her mind was going in an entirely different direction.\n \"Oh,\" she said, pulling herself together. \"I\u0027ve often thought about how I\u0027d do it.\"\n \"You\u0027ve thought about breaking into the FBI?\"\n \"No, I\u0027ve thought about how I\u0027d do it. That\u0027s all. The key is finding a weakness.\"\n \"What if there isn\u0027t one?\"\n \"There\u0027s always a weakness,\" she insisted. \"I just need to find it.\"\n \"When are you going to start?\"\n \"I have to drive to Emerson tomorrow, and I won\u0027t get back until late. Then Sunday I have to finish a paper on algorithms. We don\u0027t have class Monday, so that\u0027s when I\u0027ll start.\"\n He parked in front of her house and handed her his card. It just had his name and a cell phone number. \"You can get hold of me anytime, night or day. I\u0027ll pick you up Monday morning at eight.\"\n \"Why?\"\n \"To drive you to the cyber unit. Phillips is insisting that you work there.\"\n \"But that\u0027s crazy. All I need is my laptop.\"\n \"You\u0027re going to be testing CSA security. He wants you in his unit.\"\n \"What does he think I\u0027ll do at home? Invite people over to watch me?\"\n He didn\u0027t argue the point. \"I\u0027ll pick you up at eight.\"\n \"Meaning, we\u0027re through discussing this.\"\n \"That\u0027s right.\"\n He walked her to her door and patiently waited by her side while she dug through her purse, looking for her house key. She kept handing him things to hold while she searched, and by the time she finally found the key, he held her billfold, her sunglasses, a striped zipper bag, three pens, and a cell phone. She stuffed them all back in her purse.\n \"Thanks,\" she said.\n \"How long do you think it will take?\" he asked.\n \"No time at all. Once I insert the key and turn it, the door will open.\" She saw his expression and began to laugh. He looked as though he wanted to shake her. \"You don\u0027t have a sense of humor, do you?\"\n \"Sure, I do. Now answer the question. How long do you think it will take to get into the CSA?\"\n \"I can work pretty fast,\" she answered with a wry smile as she walked inside and closed the door.\n Liam walked back to the car with the image of her smile still on his mind. Letting out a low whistle, he shook his head. \"She\u0027s gonna be trouble.\"\n NINE\n Emerson was a charming little town with rolling hills, double-wide streets, and weathered clapboard houses that didn\u0027t sit on top of one another. Allison\u0027s aunt and uncle lived on Baltimore Street. The two-story house sat on a corner lot with a spectacular view of Summer Park. The huge red elm in the front yard was in desperate need of a good trim. One of the thick branches draped over part of the roof. A disaster waiting to happen, Allison thought as she pulled into the driveway.\n The couple had moved into the house right after they were married thirty-some years ago and, except for some repairs now and then, hadn\u0027t changed a thing in all that while. The hardwood floors were dull and worn, and the variegated gold shag carpet in the den was threadbare. The kitchen still had the same dark oak cabinets and Formica countertops, and the old linoleum tiles still made a checkerboard on the floor.\n Allison could feel her stomach twisting into knots. After she took a couple of deep breaths, she got up the courage to open the car door.\n Will must have spotted her from the window. He stepped out onto the porch and waved to her. Okay, he was in what he must consider his charming mood. Better than angry, she thought. Then she noticed he had a beer in his hand. It wasn\u0027t even noon yet, and he was already drinking. She didn\u0027t think he was drunk, though, because he wasn\u0027t staggering around. Usually when he was drunk he was belligerent, and he didn\u0027t appear to be scowling . . . at least not yet. Women found him attractive, but Allison couldn\u0027t understand why. Those same women had certainly never seen him go into one of his fits. He wasn\u0027t so handsome when he was sneering and screaming and throwing punches because he wasn\u0027t getting his way.\n Why was he at his parents\u0027 house? Had he also been summoned? Or had he been kicked out of the apartment they had rented for him? She walked up the steps to face him. He looked haggard. His eyes were bloodshot, and there were dark circles under his eyes. If he kept up his twisted lifestyle, she expected him to be dead before he turned thirty-five. The thought saddened her. There was still time to turn his life around, if he was willing . . . and if he could get away from his smothering parents. \n","sourceLink":"https://allnovel.net/wired-buchanan-renard-13/page-30.html","bookId":1824,"book":{"id":1824,"title":"Wired (Buchanan-Renard #13)","description":"Storyline: \n A beautiful computer hacker and a bad-boy FBI agent must collaborate—in more ways than one—in the sizzling new novel from #1 New York Times bestselling author Julie Garwood. \n Allison Trent doesn’t look like a hacker. In fact, when she’s not in college working on her degree, she models on the side. But behind her gorgeous face is a brilliant mind for computers and her real love is writing—and hacking—code. Her dream is to write a new security program that could revolutionize the tech industry. \n Hotshot FBI agent Liam Scott has a problem: a leak deep within his own department. He needs the skills of a top-notch hacker to work on a highly sensitive project: to secretly break into the FBI servers and find out who the traitor is. But he can’t use one of his own. He finds the perfect candidate in Allison. Only, there’s one problem—she wants nothing to do with his job and turns him down flat. \n What Liam doesn’t know is that Allison is hiding secrets that she doesn’t want the FBI to uncover. But Liam will do nearly anything to persuade her to join his team, even break a few rules if that’s what it takes. A temptation that could put his job—and both of their futures—on the line… \n and longing for more . . .\n \n","cover":"https://allnovel.net/images/wired-buchanan-renard-13.jpg","author":"Julie Garwood","type":"Romance","source":"allnovel","link":"https://allnovel.net/wired-buchanan-renard-13.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:23:28 PM"}}
