{"id":87972,"no":32,"title":"Page 32","content":"Despite her determination to turn away, she heard herself say, \"Will, you know I\u0027ll help you if I can.\"\\n\\n \"I know.\"\\n\\n \"You might want to stay out here while I talk to your parents. It\u0027s not going to be pleasant.\" She didn\u0027t explain further. She guessed he\u0027d hear his parents bellowing soon enough and get the gist of the conversation. Bracing herself for the inevitable fight ahead of her, she opened the door and went inside.\\n\\n Her aunt and uncle were sitting across from each other at the dining room table.\\n\\n They hadn\u0027t heard her come in, and as she stood there in the entry hall looking at them, her mind flashed back to that day all those years ago when she and Charlotte sat next to each other, holding hands, at this very table.\\n\\n It was the week after the worst week of their young lives. They had been at home with a babysitter when the knock on the door came and they were told their mother and father had been in a terrible accident. Allison didn\u0027t remember much about the rest of that week. It was all a blur of people coming and going, neighbors stepping forward to make sure she and Charlotte were not left alone, a huge church full of people wearing black, she and her sister sitting in a big black car in a line of black cars, the whispers What about the girls? Where will they go? and Charlotte crying. The clearest memory she had was of Charlotte. No matter how Allison had tried, she couldn\u0027t get Charlotte to stop crying. Allison felt sad, but she was too young to comprehend death. She kept waiting for her mother and father to come home. \\n\\n Reality began to sink in when Aunt Jane and Uncle Russell came to take the girls to their house. Allison knew her aunt and uncle, but not well. She had seen them only a few times. Charlotte later told her it was because her father and her uncle had not gotten along. Allison could understand. Her father was a gregarious and kind man. Uncle Russell seemed sour and detached, and he had married a woman who was domineering and never satisfied. Their son, Will, was a brat.\\n\\n Allison and Charlotte hadn\u0027t even taken off their coats before Aunt Jane told them to sit down at the dining room table. There were a few things she and Uncle Russell needed to make clear. The first was how lucky the girls were to have an aunt and uncle willing to take them in. If they hadn\u0027t stepped up, she said, the girls would have been placed in foster care. Allison didn\u0027t know what foster care was, but the way her aunt said the words made her imagine some sort of dark and scary dungeon where they would be chained up and fed scraps of rancid food. The second thing her aunt told them was how much of a burden this was going to be, not only for her and Uncle Russell, but also for Will. They were not a wealthy family, after all, but they were willing to make a sacrifice for the girls out of love and respect for their dear dead parents. In return, the girls were expected to be well behaved and hardworking.\\n\\n Uncle Russell then showed them to the small room she and Charlotte were to share. The walls were painted a drab tan, and there were no curtains, just aluminum blinds covering the windows. The furnishings were sparse: two twin beds with a nightstand between them and a tall dresser on the opposite wall. This was nothing like her pink-and-white bedroom at home with the matching polka-dot curtains and bedspread. Charlotte sat down on her bed and began to weep, but Allison was too relieved to cry. Anything was better than going to that \"foster\" place. If Uncle Russell and Aunt Jane were willing to let them stay here, she would do her very best to make them happy. She never wanted them to regret giving her a place to live.\\n\\n She had been on that mission ever since. Until today. She had had enough.\\n\\n Her uncle sat hunched over the table with a notepad in front of him, and next to it was a tall glass filled with an amber-colored liquid she knew was his favorite whiskey. He was using a small calculator to add numbers Aunt Jane was reading to him. Uncle Russell was much younger than he looked. Years of alcohol abuse and stress had taken a toll on him. These days, it seemed to Allison he was angry all the time. He was mean drunk and mean sober, but as long as she agreed with whatever he told her to do, there weren\u0027t any arguments or threats. In the past she had always tried to humor him. It was so much easier to get along and do what he demanded than to argue. Her aunt had told her that her uncle lost his job when the company he worked for decided to downsize, but a couple of years ago she had overheard an argument and known then she\u0027d been told a lie. Her aunt had been screaming at Allison\u0027s uncle, dredging up all his past sins, and in the litany was the reminder that he wouldn\u0027t have been fired if he hadn\u0027t been drinking on the job. The fight had been a real blowout. Even Allison\u0027s headphones couldn\u0027t block the noise. She heard her aunt say he was lucky there hadn\u0027t been sufficient documentation for firing him so the union could force the company to give him a pension. Allison guessed it was easier to pay him off than to take the matter to court. Easier and cheaper. \\n\\n","sourceLink":"https://allnovel.net/wired-buchanan-renard-13/page-32.html","bookId":1824,"book":{"id":1824,"title":"Wired (Buchanan-Renard #13)","description":"Storyline: A beautiful computer hacker and a bad-boy FBI agent must collaborate—in more ways than one—in the sizzling new novel from #1 New York Times bestselling author Julie Garwood. \\n Allison Trent doesn’t look like a hacker. In fact, when she’s not in college working on her degree, she models on the side. But behind her gorgeous face is a brilliant mind for computers and her real love is writing—and hacking—code. Her dream is to write a new security program that could revolutionize the tech industry. \\n Hotshot FBI agent Liam Scott has a problem: a leak deep within his own department. He needs the skills of a top-notch hacker to work on a highly sensitive project: to secretly break into the FBI servers and find out who the traitor is. But he can’t use one of his own. He finds the perfect candidate in Allison. Only, there’s one problem—she wants nothing to do with his job and turns him down flat. \\n What Liam doesn’t know is that Allison is hiding secrets that she doesn’t want the FBI to uncover. But Liam will do nearly anything to persuade her to join his team, even break a few rules if that’s what it takes. A temptation that could put his job—and both of their futures—on the line… \\n and longing for more . . .\\n","cover":"https://allnovel.net/images/wired-buchanan-renard-13.jpg","author":"Julie Garwood","type":"Romance","source":"allnovel","link":"https://allnovel.net/wired-buchanan-renard-13.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:23:28 PM"}}
