{"id":87974,"no":34,"title":"Page 34","content":"Charlotte broke free and begged Allison to do the same. She and Oliver had been asking her to move in with them ever since they were married, and they once again urged her to consider it. Allison loved being with Charlotte and Oliver, but she was preparing to enter Boston College, and they were moving to Seattle soon, so that option was off the table. Besides, the sense of responsibility still had a grip on her, holding her back. Charlotte called their aunt and uncle toxic, and although Allison wholeheartedly agreed, she hadn\u0027t been able to get past the guilt. Every time her aunt called her ungrateful, she was reminding Allison of the sacrifice she had made by taking her and her sister into their home. For years Allison had heard how much money they had spent on the girls\u0027 expenses because Uncle Russell knew that was what his older brother would have wanted. Yes, they had spent a fortune on the girls, and what thanks did they get? Precious little, according to Aunt Jane. On and on the lectures continued until Allison was weighed down with guilt because she had been the burden that made her aunt\u0027s and uncle\u0027s lives less than perfect. Would she ever feel she\u0027d done enough to repay the debt she owed them? She honestly didn\u0027t know. What she did know was that for years her aunt and uncle had been using fear and guilt to get Allison to cooperate, and it was time for a change. She finally decided their criticism of her wasn\u0027t going to work any longer. Her aunt looked up from the page she was reading and, seeing Allison, motioned for her to come into the dining room. Allison pulled out a chair at the head of the table so that she wouldn\u0027t have to sit next to either one of them. Then she folded her hands in her lap and waited for them to start in on her. Her aunt held up the paper, which had a list of names with lines crossed through them. \"Do you see, Allison? These are the attorneys who have turned us down. They refused to take on Will\u0027s case. They all said the same thing: they couldn\u0027t do any better than Will\u0027s current attorney. No matter how much money we offered, they all said no.\" \"I thought you liked Will\u0027s attorney. What\u0027s his name?\" \"Stephen . . . Stephen Kelly,\" she said. \"And we did like him. He\u0027s done a good job until now.\" Her uncle adjusted his glasses and looked up from his notepad. \"He\u0027s given up on Will and thinks my boy will have to go to prison this time. That\u0027s out of the question, of course. I can\u0027t let that happen.\" Aunt Jane nodded vigorously. \"No, we can\u0027t let that happen. Will is too . . . sensitive. And none of this is his fault.\" She added, \"We were able to get a copy of the video in the bar.\" \"Kelly got it for us,\" Uncle Russell interjected. Her aunt insisted that Allison watch the video and pushed her laptop in front of her. In the beginning of the clip, it looked as though three men did crowd Will and threaten him, but Will threw the first punch . . . and the second . . . and the third. It was frightening to watch. When he became angry, he lost all control. \"Will could have killed one of them,\" she whispered, shaken by what she\u0027d just seen. Aunt Jane slapped the laptop shut and snatched it away from Allison. \"Will\u0027s the victim here. Get that straight,\" she snapped. Always the victim, Allison thought. She was amazed her aunt could look at the same video and come up with that conclusion. Uncle Russell removed his glasses and pinched the bridge of his nose. \"This is going to be very expensive.\" \"No matter what it costs, we have to keep Will out of prison,\" Aunt Jane said. \"He couldn\u0027t handle it, and neither could we. What would our friends and neighbors think?\" Uncle Russell became incensed. \"What do you care what the neighbors think?\" He picked up his glass and took a long swallow. \"Use your head for once. Keeping Will out of prison is all you should care about. Just how stupid are you?\" He snarled the question. \"You\u0027re more concerned about yourself than your own son.\" Aunt Jane half lifted herself out of her chair. \"We have to live in this town,\" she shouted. \"And I always put Will first. How dare you say that I don\u0027t?\" And they were off on another fight. Whenever they started a squabble, Allison was always reminded of a horse race where the announcer talks faster and faster as the horses pound toward the home stretch. She wished she had her headphones now to block out the cacophony. The argument continued for a good five minutes before it wound down. Allison was even more determined now to tell them she\u0027d had enough. She was actually becoming a bit giddy thinking about never having to come back to this house again. It had never been her home. Never.","sourceLink":"https://allnovel.net/wired-buchanan-renard-13/page-34.html","bookId":1824,"book":{"id":1824,"title":"Wired (Buchanan-Renard #13)","description":"Storyline: A beautiful computer hacker and a bad-boy FBI agent must collaborate—in more ways than one—in the sizzling new novel from #1 New York Times bestselling author Julie Garwood. Allison Trent doesn’t look like a hacker. In fact, when she’s not in college working on her degree, she models on the side. But behind her gorgeous face is a brilliant mind for computers and her real love is writing—and hacking—code. Her dream is to write a new security program that could revolutionize the tech industry. Hotshot FBI agent Liam Scott has a problem: a leak deep within his own department. He needs the skills of a top-notch hacker to work on a highly sensitive project: to secretly break into the FBI servers and find out who the traitor is. But he can’t use one of his own. He finds the perfect candidate in Allison. Only, there’s one problem—she wants nothing to do with his job and turns him down flat. What Liam doesn’t know is that Allison is hiding secrets that she doesn’t want the FBI to uncover. But Liam will do nearly anything to persuade her to join his team, even break a few rules if that’s what it takes. A temptation that could put his job—and both of their futures—on the line… and longing for more . . .","cover":"https://allnovel.net/images/wired-buchanan-renard-13.jpg","author":"Julie Garwood","type":"Romance","source":"allnovel","link":"https://allnovel.net/wired-buchanan-renard-13.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:23:28 PM"}}
