{"id":87986,"no":46,"title":"Page 46","content":"\"No. You\u0027re the priority.\"\n She realized he was still holding her hand when they stepped into the elevator. She didn\u0027t feel inclined to pull away.\n There was a different guard on duty at the desk. She introduced herself and shook his hand, much to his surprise. As he retrieved her laptop and purse, he told her his name was Lawrence, and he would have given her his life story if Liam hadn\u0027t dragged her away.\n He had just opened the car door for her when his cell phone rang. He saw who was calling and said, \"I\u0027ve got to take this.\"\n After fastening her seat belt, Allison decided she might as well check her messages while she waited. There were two voice messages. Both were upsetting.\n The first was from Giovanni. He had called at ten in the morning to report that her aunt had left word for him that she would be by that afternoon to pick up a check for twelve thousand dollars he owed for work Allison had done.\n \"Don\u0027t worry,\" Giovanni said. \"I won\u0027t be giving her any money. I won\u0027t even open the door. I do have your check ready, and I\u0027d love it if you could drive up and spend the evening with me. My guest room\u0027s always ready for you, but if you can\u0027t work it into your schedule, let me know where you want me to mail the check. And, darling, let me say one more time how thrilled I am that you finally got away from those vipers.\"\n The second voice mail was from her housemate Mark. He called at four o\u0027clock to let her know that her uncle was parked in front of the house, obviously waiting to ambush her as soon as she returned home.\n Liam finished his call and came around the car. He looked serious as he removed his jacket and placed it in the backseat before getting in. She wondered if his call was good news or bad news. His expression wasn\u0027t giving anything away.\n \"I\u0027m starving,\" he said. \"Let\u0027s go to dinner.\"\n She didn\u0027t have much of an appetite after listening to the messages, but she knew her uncle was waiting for her and she wasn\u0027t in any hurry to go home. \"I\u0027m not really hungry now,\" she said. \"If you don\u0027t mind dropping me off at the library, I think I\u0027ll do some work.\"\n One look at her and Liam knew something was wrong. She was so easy to read, and he liked that about her. She couldn\u0027t hide what she was feeling.\n He started the engine and drove out of the parking lot. \"You have to eat,\" he urged. \"I have just the place in mind. I think you\u0027ll like it. What do you say?\"\n \"Thank you for the offer, but it\u0027s been a long day and I\u0027m not really in the mood for a crowded restaurant.\"\n \"Then I know you\u0027ll like this place,\" he assured her.\n \"Where is it?\" she asked.\n \"You\u0027ll see,\" he said with a sly grin.\n Curious, she relented. \"Okay.\"\n She sat back and closed her eyes, letting the day\u0027s work fade to the back of her mind. She didn\u0027t want to think about it or anything else right now.\n A half hour later, Liam turned toward the Charles River and pulled into a small parking lot. Coming around the car, he opened her door, took her hand, and led her down a path to an area shaded by large trees. A green wooden park bench sat before a cluster of tall forsythia bushes, and in front of it a long grassy area sloped down to the river.\n Pointing to the bench, he said, \"Have a seat and I\u0027ll be right back.\"\n Allison was a little puzzled, but she trusted Liam and did what he said. After a few moments of sitting on the bench and watching the river, she felt an increasing calm, as though her worries were flowing away with the current. In the distance she could see people walking and biking along the river path, some exerting themselves for exercise, others simply enjoying an evening stroll. A row team out for practice drifted past in their long, sleek boat, the smooth, rhythmic strokes gliding them across the water. The entire scene was hypnotic, and once she allowed it to take over, the noise and commotion of the city faded into the background.\n A few minutes later, Liam appeared carrying two cans of soda in one hand and two hot dogs wrapped in foil in the other. \"I hope you like mustard,\" he said as he handed her a can and a hot dog.\n \"Of course,\" she said, smiling. When he had taken his seat beside her and opened the wrapper for a big bite of his hot dog, she remarked, \"You were right. I do like this place.\"\n He popped the tab on his soda. \"My favorite spot in Boston,\" he said, taking a big swig.\n They sat quietly enjoying the view and eating their hot dogs. When they were finished, Liam stretched his long legs in front of him and folded his hands behind his head. Sitting there with him in this place of perfect tranquillity, Allison felt stress-free for the first time in days. She didn\u0027t want to talk about or even think about problems, so she asked Liam to tell her about some of the places he\u0027d been assigned. He began with London and worked his way around the globe. Each city or country he mentioned seemed to have a story attached to it, and each story was either heartwarming or hilariously funny. She couldn\u0027t take her eyes off him. When he smiled, she felt a little catch in her pulse. The more he talked, the more she wanted to hear. Contrary to her initial assessment of him, she could see he had a wonderful sense of humor. \n","sourceLink":"https://allnovel.net/wired-buchanan-renard-13/page-46.html","bookId":1824,"book":{"id":1824,"title":"Wired (Buchanan-Renard #13)","description":"Storyline: \n A beautiful computer hacker and a bad-boy FBI agent must collaborate—in more ways than one—in the sizzling new novel from #1 New York Times bestselling author Julie Garwood. \n Allison Trent doesn’t look like a hacker. In fact, when she’s not in college working on her degree, she models on the side. But behind her gorgeous face is a brilliant mind for computers and her real love is writing—and hacking—code. Her dream is to write a new security program that could revolutionize the tech industry. \n Hotshot FBI agent Liam Scott has a problem: a leak deep within his own department. He needs the skills of a top-notch hacker to work on a highly sensitive project: to secretly break into the FBI servers and find out who the traitor is. But he can’t use one of his own. He finds the perfect candidate in Allison. Only, there’s one problem—she wants nothing to do with his job and turns him down flat. \n What Liam doesn’t know is that Allison is hiding secrets that she doesn’t want the FBI to uncover. But Liam will do nearly anything to persuade her to join his team, even break a few rules if that’s what it takes. A temptation that could put his job—and both of their futures—on the line… \n and longing for more . . .\n \n","cover":"https://allnovel.net/images/wired-buchanan-renard-13.jpg","author":"Julie Garwood","type":"Romance","source":"allnovel","link":"https://allnovel.net/wired-buchanan-renard-13.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:23:28 PM"}}
