{"id":88022,"no":83,"title":"Page 83","content":"\"Don\u0027t play innocent with me. Are you aware of how many lives you\u0027ve ruined?\"\\n\\n He was becoming more agitated, and Allison could see there was no reasoning with the man. She took a quick step to the side and passed him. As she walked away, he shouted after her, \"Gloat while you can. This isn\u0027t over.\" \\n\\n Her heart was still pounding from her encounter with Bale when she reached Phillips\u0027s office and found it empty. She looked up and down the hall, and there was no sign of him or Liam. Checking the time, she realized it was already night. She needed to calm down, and because she hadn\u0027t had anything to eat since the disgusting granola bar that morning, she took the steps to the cafeteria. Even though it was Saturday, she knew it would be stocked with meals for the weekend techs. The dining room was empty except for a table of four men, who were having an animated discussion as they munched on their sandwiches and chips. They stopped talking and turned in her direction when she walked in. Feeling a bit self-conscious, she smiled as she passed their table and walked over to the refrigerated case. She took out a salad with chicken. When she turned around and started for an empty table, one of the men waved to her.\\n\\n \"Come join us,\" he called. He stood and pulled up another chair to the table as the other men scooted theirs aside to make room. Once she was seated, he introduced himself. \"I\u0027m Sean,\" he said, and extended his hand. He pointed to each of the others, saying, \"And this is Jeff, Paul, and Andy.\"\\n\\n They greeted her with smiles, and then Andy said, \"We\u0027ve seen you around. You must be doing something pretty important to have that office all to yourself.\"\\n\\n Allison\u0027s answer was deliberately vague. \"I\u0027ve been given specific assignments. I\u0027m under contract for only a few months.\"\\n\\n Paul spoke up. \"I\u0027ll bet they\u0027re complicated assignments. I was in the security room when you came in and found that breach a couple of months ago. I have to tell you, I\u0027ve never seen anybody get to a source that fast, especially one that intricate. You were amazing.\"\\n\\n Embarrassed by his comment, she said, \"I had seen something very similar before, so I just used what I knew.\"\\n\\n \"Still, that was mighty impressive work,\" Paul said.\\n\\n \"Where did you go to school?\" Andy asked.\\n\\n \"I just graduated from Boston College,\" she answered. When she told them she had lived in the Boston area her whole life, the conversation turned to more personal topics, everything from which restaurant served the best chowder to who was their favorite Red Sox player. At one point Sean pulled out his wallet and showed her a picture of his one-year-old son dressed in an infant Red Sox uniform.\\n\\n \"I\u0027m definitely going to miss Boston,\" she admitted.\\n\\n \"Where are you going?\" Jeff wondered.\\n\\n \"I plan to move to California when my contract is up,\" she answered. \"I\u0027d like to start my own software company.\"\\n\\n \"That\u0027s a shame,\" he responded. \"We could sure use your talents around here.\"\\n\\n While the men around her continued to talk, her thoughts began to wander toward her future. She had planned everything so carefully. Just as soon as she could, she would move to California and start her company. No more long hours under Phillips\u0027s thumb. No more interruptions to her life by FBI agents. In California, she would be her own boss. It was exactly what she wanted, wasn\u0027t it?\\n\\n On the other hand, she loved Boston. This was her home and she had good friends here. Why did she have to go to Silicon Valley to take on the boys? She could do that here . . . anywhere, actually, as long as she had a computer. As surprising as it was to admit, the idea of staying was appealing. Who knew she was going to like the work at the cyber unit so much? Certainly not her. She did like it, though-very much, as a matter of fact. Who wouldn\u0027t have loved solving problems all day? The men at the table were friendly and intelligent and interesting. Working alongside them would be fun.\\n\\n Jordan had asked to be part of the new venture, and together they could build a great company. Both of them could continue to write code and design software. Jordan could also fine-tune what Allison had already created. The two of them had other commitments, so it would be a slow-growing company, but that didn\u0027t bother Allison. If she stayed in Boston, she\u0027d be able to continue her work at the cyber unit, though she would have to renegotiate the terms of her employment. She absolutely was not going to continue to work eighty-hour weeks. The more she thought about the possibilities, the more excited she became. She felt as though a weight had just been lifted, and she couldn\u0027t wait to tell Jordan. \\n\\n","sourceLink":"https://allnovel.net/wired-buchanan-renard-13/page-83.html","bookId":1824,"book":{"id":1824,"title":"Wired (Buchanan-Renard #13)","description":"Storyline: A beautiful computer hacker and a bad-boy FBI agent must collaborate—in more ways than one—in the sizzling new novel from #1 New York Times bestselling author Julie Garwood. \\n Allison Trent doesn’t look like a hacker. In fact, when she’s not in college working on her degree, she models on the side. But behind her gorgeous face is a brilliant mind for computers and her real love is writing—and hacking—code. Her dream is to write a new security program that could revolutionize the tech industry. \\n Hotshot FBI agent Liam Scott has a problem: a leak deep within his own department. He needs the skills of a top-notch hacker to work on a highly sensitive project: to secretly break into the FBI servers and find out who the traitor is. But he can’t use one of his own. He finds the perfect candidate in Allison. Only, there’s one problem—she wants nothing to do with his job and turns him down flat. \\n What Liam doesn’t know is that Allison is hiding secrets that she doesn’t want the FBI to uncover. But Liam will do nearly anything to persuade her to join his team, even break a few rules if that’s what it takes. A temptation that could put his job—and both of their futures—on the line… \\n and longing for more . . .\\n","cover":"https://allnovel.net/images/wired-buchanan-renard-13.jpg","author":"Julie Garwood","type":"Romance","source":"allnovel","link":"https://allnovel.net/wired-buchanan-renard-13.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:23:28 PM"}}
