{"id":88027,"no":88,"title":"Page 88","content":"Feeling stronger and more determined than ever, she decided she should do this on her own. She didn\u0027t need anyone at her side. \"Why are you coming with me? You don\u0027t need to,\" she insisted. \"Yes, I do need to.\" \"Why?\" \"I protect what belongs to me.\" It wasn\u0027t until the words were out of his mouth that Liam realized what he was saying, and he grimaced inside. She nodded. \"I understand. Because I\u0027m the asset. Phillips keeps telling me that.\" She sighed. \"He says I can be dangerous with a computer.\" \"Yeah, sure. You\u0027re the bureau\u0027s asset. That\u0027s why.\" The woman was clueless, and he was thankful for that. Otherwise, he\u0027d have to explain what he\u0027d meant, and he wasn\u0027t ready to do that. He didn\u0027t know his own mind anymore. He was thinking one thing and doing another. He couldn\u0027t stay away from her, and the thought of any other man touching her infuriated him. He wanted her to belong to him and only him. Liam knew he was acting like a caveman, but that didn\u0027t matter. Damn, he really needed to get it together. Allison leaned forward and took a good look at Liam\u0027s face. \"Are you all right? You\u0027re frowning. Are you worried about tonight? Do you think Brett will cause trouble? Do you-\" He stopped her before she could get more worked up. \"It\u0027ll be fine.\" \"You can\u0027t possibly know that.\" \"Sure, I can,\" he replied. \"Noah\u0027s meeting us at the hotel. He promised Jordan and Alec he\u0027d see that there was a recording of the presentation so he could e-mail it to them. He\u0027s already checked with security to make sure their cameras are working. He even checked out the ballroom. It\u0027s not a real big space. A platform has been set up at the far end of the room and serves as a stage. A large screen covers the wall behind it, and there are folding chairs facing the platform with a podium in the center. Brett must have a little educational film for us to see on the screen.\" \"On what? How to steal and get away with it?\" Her voice was filled with hostility. \"But he isn\u0027t going to get away with it, is he?\" He sounded a little too reasonable to suit Allison. \"No, he isn\u0027t.\" \"And when you prove he\u0027s stolen your property, you aren\u0027t going to cheer or gloat, are you? At least not there.\" \"Oh, all right,\" she agreed grudgingly. \"No fighting, no tackling him to the floor, no biting . . .\" \"I can\u0027t promise no tackling.\" Liam flashed a smile. He couldn\u0027t imagine her hurting anyone. She was so soft and feminine. And gentle and kind. Too kind for her own good. The longer he\u0027d known her, the more he\u0027d learned about the little things she\u0027d done to help others get through school. She was even trying to help that worthless cousin of hers. \"Just behave yourself.\" \"My sister raised me to be a lady,\" she said. \"You had just started sixth grade when Charlotte left for college. You were on your own from then on, weren\u0027t you?\" She shrugged. \"Lots of people are on their own.\" \"When they\u0027re twelve?\" \"I\u0027d rather not discuss my home life now.\" Or ever, she added silently. He agreed with a nod. \"Like I said, behave yourself tonight.\" \"What exactly do you think I\u0027m going to do? Don\u0027t worry. I won\u0027t punch him in his phony tan face. I may want to, but I won\u0027t.\" He laughed. \"That\u0027s my girl.\" He pulled into the hotel\u0027s circle drive and parked to the side. The attendant came running, but when Liam waved him off, he turned around and hurried to assist another driver. \"The ballrooms are on the lower level,\" Liam said as they stepped out of the revolving glass door and into the lobby. \"I know. I pulled up the schematic.\" He wasn\u0027t surprised. Allison liked to be prepared. \"You didn\u0027t hack into the hotel\u0027s private server, did you?\" \"No, of course not. I didn\u0027t need to.\" She hastily added, \"And I don\u0027t do that anymore.\" Noah was waiting for them in a hallway off the lobby. His attire was casual. Nothing in his appearance said FBI agent. He smiled as they approached. \"Are you ready for this?\" \"She\u0027s ready,\" Liam said. They turned and walked toward a service elevator. Allison led the way and the two men followed. In a low voice Noah said to Liam, \"I thought you were supposed to be on your way to San Antonio.\" \"I gave the assignment to someone else,\" Liam answered. \"How come?\" Liam didn\u0027t respond. Allison pretended she wasn\u0027t listening to the conversation, but she wanted Liam to tell why he was still here. He didn\u0027t seem to have an answer for Noah. Would he get into trouble for turning down an assignment? Probably not, she decided. He was too important.","sourceLink":"https://allnovel.net/wired-buchanan-renard-13/page-88.html","bookId":1824,"book":{"id":1824,"title":"Wired (Buchanan-Renard #13)","description":"Storyline: A beautiful computer hacker and a bad-boy FBI agent must collaborate—in more ways than one—in the sizzling new novel from #1 New York Times bestselling author Julie Garwood. Allison Trent doesn’t look like a hacker. In fact, when she’s not in college working on her degree, she models on the side. But behind her gorgeous face is a brilliant mind for computers and her real love is writing—and hacking—code. Her dream is to write a new security program that could revolutionize the tech industry. Hotshot FBI agent Liam Scott has a problem: a leak deep within his own department. He needs the skills of a top-notch hacker to work on a highly sensitive project: to secretly break into the FBI servers and find out who the traitor is. But he can’t use one of his own. He finds the perfect candidate in Allison. Only, there’s one problem—she wants nothing to do with his job and turns him down flat. What Liam doesn’t know is that Allison is hiding secrets that she doesn’t want the FBI to uncover. But Liam will do nearly anything to persuade her to join his team, even break a few rules if that’s what it takes. A temptation that could put his job—and both of their futures—on the line… and longing for more . . .","cover":"https://allnovel.net/images/wired-buchanan-renard-13.jpg","author":"Julie Garwood","type":"Romance","source":"allnovel","link":"https://allnovel.net/wired-buchanan-renard-13.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:23:28 PM"}}
