{"id":17873,"no":12,"title":"CHAPTER XII — MRS. ESTABROOK\u0027S PLANS","content":"Grant was going home with Mr. Reynolds at the close of the fourth day, when it occurred to him to say what had been in his mind for some time: “Isn\u0027t it time, Mr. Reynolds, for me to be looking out for a boarding place?” The broker smiled, and said with assumed concern: “Are you dissatisfied with your present boarding place?” “How could I be, sir?” returned Grant, earnestly. “But you told me I could stay with you a week, while I was looking about for a suitable place to board.” “That is true. Now, however, there is a difficulty about your making a change.” “What is that, sir?” “Herbert would not give his consent. The fact is, Grant, Herbert finds so much pleasure in your society, and derives so much advantage from the increased exercise you lead him to take, that I think you will have to make up your mind to stay.” Grant\u0027s face showed the pleasure he felt. “I shall be very glad to stay, Mr. Reynolds,” he answered, “if you are willing to have me.” “I had this in view from the first,” said the broker, “but I wanted to see how you and Herbert got along. I wished to be sure, also, that your influence on him would be good. Of that I can have no doubt, and I am glad to receive you as a member of my family.” There was one member of the household, however, who was not so well pleased with the proposed arrangement. This was Mrs. Estabrook, the housekeeper. As the week drew to a close, she said, one evening after the boys had retired: “How much longer is the office boy to stay here, Mr. Reynolds?” “Why do you ask?” inquired the broker. “Only with reference to domestic arrangements,” answered the housekeeper, disconcerted. “He will remain for a considerable time, Mrs. Estabrook.” “I—I thought he was only going to stay a week.” “He is company for Herbert, and I think it desirable to keep him.” “Herbert soils his clothes a deal more now than he used to do,” said the housekeeper, discontentedly. “I am sure I don\u0027t know where the other boy carries him.” “Nor I, but I am not afraid to trust him with Grant. As to the clothes, I consider them of very small account, compared with my boy\u0027s health.” Mrs. Estabrook knitted in silence for five minutes. She was by no means pleased with her employer\u0027s plan, having taken a dislike to Grant, for which, indeed, her chief reason was jealousy. She had a stepson, a young man of twenty-one, in Mr. Reynolds\u0027 office, whom she would like to have in the house in place of Grant. But Mr. Reynolds had never taken notice of her occasional hints to that effect. The housekeeper\u0027s plans were far-reaching. She knew that Herbert was delicate, and doubted if he would live to grow up. In that case, supposing her stepson had managed to ingratiate himself with the broker, why might he not hope to become his heir? Now this interloper, as she called Grant, had stepped into the place which her own favorite—his name was Willis Ford—should have had. Mrs. Estabrook felt aggrieved, and unjustly treated, and naturally incensed at Grant, who was the unconscious cause of her disappointment. She returned to the charge, though, had she been wiser, she would have foreborne. “Do you think a poor boy like this Grant Thornton is a suitable companion for a rich man\u0027s son, Mr. Reynolds? Excuse me for suggesting it, but I am so interested in dear Herbert.” “Grant Thornton is the son of a country minister, and has had an excellent training,” said the broker, coldly. “The fact that he is poor is no objection in my eyes. I think, Mrs. Estabrook, we will dismiss the subject. I think myself competent to choose my son\u0027s associates.” “I hope you will excuse me,” said the housekeeper, seeing that she had gone too far. “I am so attached to the dear child.” “If you are, you will not object to the extra trouble you may have with his clothes, since his health is benefited.” “That artful young beggar has wound his way into his employer\u0027s confidence,” thought Mrs. Estabrook, resentfully, “but it may not be always so.” A few minutes later, when the housekeeper was in her own sitting-room, she was told that Willis Ford wanted to see her. Mrs. Estabrook\u0027s thin face lighted up with pleasure, for she was devotedly attached to her stepson. “Bring him up here at once,” she said. A minute later the young man entered the room. He was a thin, sallow-complexioned young man, with restless, black eyes, and a discontented expression—as of one who thinks he is not well used by the world. “Welcome, my dear boy,” said the housekeeper, warmly. “I am so glad to see you.” Willis submitted reluctantly to his stepmother\u0027s caress, and threw himself into a rocking chair opposite her. “Are you well, Willis?” asked Mrs. Estabrook, anxiously. “Yes, I\u0027m well enough,” muttered the young man. “I thought you looked out of sorts.” “I feel so.” “Is anything the matter?” “Yes; I\u0027m sick of working at such starvation wages.” “I thought fifteen dollars a week a very good salary. Only last January you were raised three dollars.” “And I expected to be raised three dollars more on the first of July.” “Did you apply to Mr. Reynolds?” “Yes, and he told me I must wait till next January.” “I think he might have raised you, if only on account of the connection between our families.” “Perhaps he would if you would ask him, mother.” “I will when there is a good opportunity. Still, Willis, I think fifteen dollars a week very comfortable.” “You don\u0027t know a young man\u0027s expenses, mother.” “How much do you pay for board, Willis?” “Six dollars a week. I have a room with a friend, or I should have to pay eight.” “That leaves you nine dollars a week for all other expenses. I think you might save something out of that.” “I can\u0027t. I have clothes to buy, and sometimes I want to go to the theatre, and in fact, nine dollars don\u0027t go as far as you think. Of course, a woman doesn\u0027t need to spend much. It\u0027s different with a young man.” “Your income would be a good deal increased if you had no board to pay.” “Of course. You don\u0027t know any generous minded person who will board me for nothing, do you?” “There\u0027s a new office boy in your office, isn\u0027t there?” “Yes, a country boy.” “Did you know he was boarding here?” “No; is he?” “Mr. Reynolds told me to-night he was going to keep him here permanently, as a companion for his little son.” “Lucky for him.” “I wish Mr. Reynolds would give you a home here.” “I would rather he would make it up in money, and let me board where I please.” “But you forget. It would give you a chance to get him interested in you, and if Herbert should die, you might take his place as heir.” “That would be a splendid idea, but there\u0027s no prospect of it. It isn\u0027t for me.” “It may be for the office boy. He\u0027s an artful boy, and that\u0027s what he\u0027s working for, in my opinion.” “I didn\u0027t think the little beggar was so evil-headed. He seems quiet enough.” “Still waters run deep. You\u0027d better keep an eye on him, and I\u0027ll do the same.” “I will.” The next day Grant was puzzled to understand why Willis Ford spoke so sharply to him, and regarded him with such evident unfriendliness. “What have I done to offend you?” he thought.","sourceLink":"http://novel.tingroom.com/ertong/2976/82011.html","bookId":347,"book":{"id":347,"title":"Helping Himself","description":"简介： I wish we were not so terribly poor, Grant, said Mrs. Thornton, in a discouraged tone....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2976","creation":"Aug 1, 2019 12:18:37 AM","modification":"Aug 1, 2019 12:18:37 AM"}}
