{"id":94041,"no":32,"title":"Page 32","content":"\\n\\n Where were you headed?\\n\\n First to our assigned patrol sector, just so everything would initially seem normal. After that, no one knew.\\n\\n A new home, at least for the time being, was out of the question. By this point the blight had spread to every corner of the planet. No neutral country, no matter how remote, could guarantee our safety.\\n\\n What about coming over to our side, America, or another Western country?\\n\\n [He flashes a cold, hard stare.]\\n\\n Would you? The Zheng carried sixteen JL-2 ballistic missiles; all but one carried four multiple reentry warheads, with a ninety-kiloton yield. That made her equivalent to one of the strongest nations in the world, enough power to murder entire cities with just the turn of a key. Would you turn that power over to another country, the one country up until that point that had used nuclear weapons in anger? Again, and for the last time, we were not traitors. No matter how criminally insane our leadership might have been, we were still Chinese sailors.\\n\\n So you were alone.\\n\\n All alone. No home, no friends, no safe harbor no matter how harsh the storm. The Admiral Zheng He was our entire universe: heaven, earth, sun, and moon.\\n\\n That must have been very difficult.\\n\\n The first few months passed as though it was merely a regular patrol. Missile subs are designed to hide, and that’s what we did. Deep and silent. We weren’t sure if our own attack subs were out looking for us. In all probability our government had other worries. Still, regular battle drills were conducted and the civilians trained in the art of noise discipline. The chief of the boat even rigged special soundproofing for the mess hall so it could be both a schoolroom and play area for the children. The children, especially the younger ones, had no idea what was happening. Many of them had even traveled with their families across infested areas, some barely escaping with their lives. All they knew was that the monsters were gone, banished to their occasional nightmares. They were safe now, and that’s all that mattered. I guess that is how we all felt those first few months. We were alive, we were together, we were safe. Given what was happening to the rest of the planet, what more could we want?\\n\\n Did you have some way of monitoring the crisis?\\n\\n Not immediately. Our goal was stealth, avoiding both commercial shipping lanes and submarine patrol sectors…ours, and yours. We speculated, though. How fast was it spreading? Which countries were the most affected? Was anyone using the nuclear option? If so, that would be the end for all of us. In a radiated planet, the walking dead might be the only creatures left “alive.” We weren’t sure what high doses of radiation would do to a zombie’s brain. Would it eventually kill them, riddling their gray matter with multiple, expanding tumors? That would be the case for a regular human brain, but since the living dead contradicted every other law of nature, why should this reaction be any different? Some nights in the wardroom, speaking in low voices over our off-duty tea, we conjured images of zombies as fast as cheetahs, as agile as apes, zombies with mutated brains that grew and throbbed and burst from the confines of their skulls. Lieutenant Commander Song, our reactor officer, had brought aboard his watercolors and had painted the scene of a city in ruins. He tried to say that it wasn’t any city in particular but we all recognized the twisted remains of the Pudong skyline. Song had grown up in Shanghai. The broken horizon glowed a dull magenta against the pitch-black sky of nuclear winter. A rain of ash peppered the islands of debris that rose from lakes of melted glass. Snaking through the center of this apocalyptic backdrop was a river, a greenish-brown snake that rose up into a head of a thousand interconnected bodies: cracked skin, exposed brain, flesh dripping from bony arms that reached out from openmouthed faces with red, glowing eyes. I don’t know when Commander Song began his project, only that he secretly unveiled it to a few of us after our third month at sea. He never intended to show it to Captain Chen. He knew better. But someone must have talked and the Old Man soon put a stop to it.\\n\\n Song was ordered to paint over his work with something cheerful, a summer sunset over Lake Dian. He then followed up with several more “positive” murals on any space of exposed bulkhead. Captain Chen also ordered a halt to all off-duty speculation. “Detrimental to the morale of the crew.” I think it pushed him, though, to reestablish some semblance of contact with the outside world.\\n\\n Semblance as in active communication, or passive surveillance?\\n\\n The latter. He knew Song’s painting and our apocalyptic discussions were the result of our long-term isolation. The only way to quell any further “dangerous thought” was to replace speculation with hard facts. We’d been in total blackout for almost a hundred days and nights. We needed to know what was happening, even if it was as dark and hopeless as Song’s painting.\\n\\n Up until this point, our sonar officer and his team were the only ones with any knowledge of the world beyond our hull. These men listened to the sea: the currents, the “biologics” such as fish and whales, and the distant thrashing of nearby propellers. I said before that our course had taken us to the most remote recesses of the world’s oceans. We had intentionally chosen areas where no ship would normally be detected. Over the previous months, however, Liu’s team had been collecting an increasing number of random contacts. Thousands of ships were now crowding the surface, many of them with signatures that did not match our computer archive.\\n\\n The captain ordered the boat to periscope depth. The ESM mast went up and was flooded with hundreds of radar signatures; the radio mast suffered a similar deluge. Finally the scopes, both the search and main attack periscopes, broke the surface. It’s not like you see in the movies, a man flipping down the handles and staring through a telescopic eyepiece. These scopes don’t penetrate the inner hull. Each one is a video camera with its signal relayed to monitors throughout the boat. We couldn’t believe what we were seeing. It was as if humanity was putting everything they had to sea. We spotted tankers, freighters, cruise ships. We saw tugboats towing barges, we saw hydrofoils, garbage scows, bottom dredgers, and all of this within the first hour.\\n\\n Over the next few weeks, we observed dozens of military vessels, too, any of which could have probably detected us, but none of which seemed to care. You know the USS Saratoga? We saw her, being towed across the South Atlantic, her flight deck now a tent city. We saw a ship that had to be HMS Victory, plying the waves under a forest of improvised sails. We saw the Aurora, the actual World War I–era heavy cruiser whose mutiny had sparked the Bolshevik Revolution. I don’t know how they got her out of Saint Petersburg, or how they found enough coal to keep her boilers lit.\\n\\n There were so many beat-up hulks that should have been retired years ago: skiffs, ferries, and lighters that had spent their careers on quiet lakes or inland rivers, coastal crafts that should have never left the harbor for which they’d been designed. We saw a floating dry dock the size of an overturned skyscraper, her deck now stuffed with construction scaffolding that served as makeshift apartments. She was drifting aimlessly, no tug or support vessel in sight. I don’t know how those people survived, or even if they survived. There were a lot of drifting ships, their fuel bunkers dry, no way to generate power.\\n\\n We saw many small private boats, yachts, and cabin cruisers that had lashed themselves together to form giant directionless rafts. We saw many purpose-built rafts as well, made from logs or tires.\\n\\n We even came across a nautical shantytown constructed atop hundreds of garbage bags filled with Styrofoam packing peanuts. It reminded us all of the “Ping-Pong Navy,” the refugees who, during the Cultural Revolution, had tried to float to Hong Kong on sacks filled with Ping-Pong balls.\\n\\n We pitied these people, pitied what could only be their hopeless fate. To be adrift in the middle of the ocean, and prey to hunger, thirst, sunstroke, or the sea herself…Commander Song called it “humanity’s great regression.” “We came from the sea,” he would say, “and now we’re running back.” Running was an accurate term. These people clearly hadn’t put any thought into what they would do once they reached the “safety” of the waves. They just figured it was better than being torn apart back on land. In their panic they probably didn’t realize they were just prolonging the inevitable.\\n\\n Did you ever try to help them? Give them food or water, maybe tow them…\\n\\n To where? Even if we had some idea where the safe ports might have been, the captain wouldn’t dare take the risk of detection. We didn’t know who had a radio, who might be listening to that signal. We still didn’t know if we were a hunted boat. And there was another danger: the immediate threat of the undead. We saw a lot of infested ships, some where the crews were still fighting for their lives, some where the dead were the only crew left. One time off Dakar, Senegal, we came across a forty-five-thousand-ton luxury liner called the Nordic Empress. Our search scope’s optics were powerful enough to see every bloody handprint smeared on the ballroom’s windows, every fly that settled on the deck’s bones and flesh. Zombies were falling into the ocean, one every couple of minutes. They would see something in the distance, a low-flying aircraft, I think, or even the feather of our scope, and try to reach for it. It gave me an idea. If we surfaced a few hundred meters away, and did everything we could to lure them over the side, we might be able to clear the ship without firing a shot. Who knows what the refugees might have brought aboard with them? The Nordic Empress might turn out to be a floating replenishment depot. I presented my proposal to the master at arms and together we approached the captain.\\n\\n What did he say?\\n\\n “Absolutely not.” There was no way of knowing how many zombies were onboard the dead liner. Even worse, he motioned to the video screen and pointed to some of the zombies falling overboard. “Look,” he said, “not all of them are sinking.” He was right. Some had reanimated wearing life jackets, while others were beginning to bloat up with decomposition gases. That was the first time I had ever seen a floating ghoul. I should have realized then that they would become a common occurrence. Even if 10 percent of the refugee ships were infested, that was still 10 percent of several hundred thousand vessels. There were millions of zombies falling randomly into the sea, or else pouring in by the hundreds when one of those old hulks capsized in rough weather. After a storm, they would blanket the surface to the horizon, rising waves of bobbing heads and flailing arms. Once we raised the search scope and were confronted with this distorted, greenish-gray haze. At first we thought it was an optical malfunction, as if we’d hit some floating debris, but then the attack scope confirmed that we’d speared one of them right under the rib cage. And it was still struggling, probably even after we lowered the scope. If ever something brought the threat home…\\n\\n But you were underwater? How could they…\\n\\n If we surfaced and one was caught on deck, or on the bridge. The first time I cracked the hatch, a fetid, waterlogged claw darted in and had me by the sleeve. I lost my footing, fell onto the lookout below me, and landed on the deck with the severed arm still clamped to my uniform. Above me, silhouetted in the bright disc of the open hatch, I could see the arm’s owner. I reached for my sidearm, fired straight up without thinking. We were showered in bone and bits of brain. We were lucky…if any of us had had any kind of open wound…I deserved the reprimand I got, although I deserved worse. From that point on, we always did a thorough scope sweep after surfacing. I would say that, at least one in every three instances, a few of them were crawling about on the hull.\\n\\n Those were the observation days, when all we did was look and listen to the world around us. Besides the scopes we could monitor both civilian radio traffic and even some satellite television broadcasts. It wasn’t a pretty picture. Cities were dying, whole countries. We listened to the last report from Buenos Aires, the evacuation of the Japanese home islands, too. We heard sketchy information about mutinies in the Russian military. We heard after reports of the “limited nuclear exchange” between Iran and Pakistan, and we marveled, morbidly, at how we had been so sure that either you, or the Russians, would be the ones to turn the key. There were no reports from China, no illegal or even official government broadcasts. We were still detecting naval transmissions, but all the codes had been shifted since our departure. While this presented something of a personal threat—we didn’t know if our fleet had orders to hunt down and sink us—at least it proved our whole nation hadn’t disappeared into the stomachs of the undead. At this point in our exile any news was welcome.\\n\\n Food was becoming an issue, not immediately, but soon enough to begin considering options. Medicine was a bigger problem; both our Western-style drugs and various traditional herb remedies were beginning to run low because of the civilians. Many of them had special medical needs.\\n\\n Mrs. Pei, the mother of one of our torpedo men, was suffering from chronic bronchial problems, an allergic reaction to something on the boat, the paint or perhaps machine oil, something you couldn’t simply remove from the environment. She was consuming our decongestants at an alarming rate. Lieutenant Chin, the boat’s weapons officer suggested, matter-of-factly, that the old woman be euthanized. The captain responded by confining him to quarters, for a week, on half-rations, with all but the most life-threatening sickness to go untreated by the boat’s pharmacist. Chin was a coldhearted bastard, but at least his suggestion brought our options into the light. We had to prolong our supply of consumables, if not find a way of recycling them altogether.\\n\\n Raiding derelicts was still strictly forbidden. Even when we spotted what looked like a deserted vessel, at least a few zombies could be heard banging belowdecks. Fishing was a possibility, but we had neither the material to rig any kind of net, nor were we willing to spend hours on the surface dropping hooks and lines over the side. \\n\\n","sourceLink":"https://allnovel.net/world-war-z-an-oral-history-of-the-zombie-war/page-32.html","bookId":2579,"book":{"id":2579,"title":"World War Z: An Oral History of the Zombie War","description":"Storyline: The Zombie War came unthinkably close to eradicating humanity. Max Brooks, driven by the urgency of preserving the acid-etched first-hand experiences of the survivors from those apocalyptic years, traveled across the United States of America and throughout the world, from decimated cities that once teemed with upwards of thirty million souls to the most remote and inhospitable areas of the planet. He recorded the testimony of men, women, and sometimes children who came face-to-face with the living, or at least the undead, hell of that dreadful time. \"World War Z\" is the result. Never before have we had access to a document that so powerfully conveys the depth of fear and horror, and also the ineradicable spirit of resistance, that gripped human society through the plague years. \\n Ranging from the now infamous village of New Dachang in the United Federation of China, where the epidemiological trail began with the twelve-year-old Patient Zero, to the unnamed northern forests where untold numbers sought a terrible and temporary refuge in the cold, to the United States of Southern Africa, where the Redeker Plan provided hope for humanity at an unspeakable price, to the west-of-the-Rockies redoubt where the North American tide finally started to turn, this invaluable chronicle reflects the full scope and duration of the Zombie War. \\n Most of all, the book captures with haunting immediacy the human dimension of this epochal event. Facing the often raw and vivid nature of these personal accounts requires a degree of courage on the part of the reader, but the effort is invaluable because, as Mr. Brooks says in his introduction, \"By excluding the human factor, aren\u0027t we risking the kind of personal detachment from history that may, heaven forbid, lead us one day to repeat it? And in the end, isn\u0027t the human factor the only true difference between us and the enemy we now refer to as \u0027the living dead\u0027?\" \\n Note: Some of the numerical and factual material contained in this edition was previously published under the auspices of the United Nations Postwar Commission. Eyewitness reports from the first truly global war\\n","cover":"https://allnovel.net/images/world-war-z-an-oral-history-of-the-zombie-war.jpg","author":"Max Brooks","type":"Horror","source":"allnovel","link":"https://allnovel.net/world-war-z-an-oral-history-of-the-zombie-war.html","creation":"Oct 5, 2019 8:58:53 AM","modification":"Oct 5, 2019 6:04:56 PM"}}
