{"id":94045,"no":36,"title":"Page 36","content":"\\n\\n So typically Norteamericano, reaching for the stars with their asses still stuck in the mud. I guess, if this was a gringo movie, you’d see some idiot get up and start clapping slowly, then the others would join in and then we’d see a tear roll down someone’s cheek or some other contrived bullshit like that. Everyone was silent. No one moved. The president announced that we would recess for the afternoon to consider his proposal, then reconvene at dusk for a general vote.\\n\\n As naval attaché, I wasn’t allowed to participate in that vote. While the ambassador decided the fate of our beloved Chile, I had nothing to do but enjoy the Pacific sunset. I sat on the flight deck, wedged in between the windmills and solar cells, killing time with my opposite numbers from France and South Africa. We tried not to talk shop, searching for any common subject as far from the war as we could get. We thought we were safe with wine. As luck might have it, each of us had either lived near, worked on, or had family connected with a vineyard: Aconcagua, Stellenboch, and Bordeaux. Those were our bonding points and, as with everything else, they led right back to the war.\\n\\n Aconcagua had been destroyed, burned to the ground during our country’s disastrous experiments with napalm. Stellenboch was now growing subsistence crops. Grapes were considered a luxury when the population was close to starvation. Bordeaux was overrun, the dead crushing its soil underfoot like almost all of continental France. Commander Emile Renard was morbidly optimistic. Who knows, he said, what the nutrients of their corpses would do for the soil? Maybe it would even improve on the overall taste once Bordeaux was retaken, if it was retaken. As the sun began to dip, Renard took something from his kit bag, a bottle of Chateau Latour, 1964. We couldn’t believe our eyes. The ’64 was an extremely rare prewar vintage. By sheer chance, the vineyard had had a bumper crop that season and had chosen to harvest its grapes in late August as opposed to the traditional early September. That September was marked by early, devastating rains, which inundated the other vineyards and elevated Chateau Latour to almost Holy Grail status. The bottle in Renard’s hand might be the last of its kind, the perfect symbol of a world we might never see again. It was the only personal item he’d managed to save during the evacuation. He carried it with him everywhere, and was planning to save it for…ever, possibly, seeing as it looked like none of any vintage would ever be made again. But now, after the Yankee president’s speech…\\n\\n [He involuntarily licks his lips, tasting the memory.]\\n\\n It hadn’t traveled that well, and the plastic mugs didn’t help. We didn’t care. We savored every sip.\\n\\n You were pretty confident about the vote?\\n\\n Not that it would be unanimous, and I was damn right. Seventeen “No” votes and thirty-one “Abstain.” At least the no voters were willing to suffer the long-term consequences of their decision…and they did. When you think that the new UN only consisted of seventy-two delegates, the showing of support was pretty poor. Not that it mattered for me or my other two amateur “sommeliers.” For us, our countries, our children, the choice had been made: attack.\\n\\n ABOARD THE MAURO ALTIERI,\\n\\n THREE THOUSAND FEET ABOVE VAALAJARVI, FINLAND\\n\\n [I stand next to General D’Ambrosia in the CIC, the Combat Information Center, of Europe’s answer to the massive U.S. D-29 command and control dirigible. The crew work silently at their glowing monitors. Occasionally, one of them speaks into a headset, a quick, whispered acknowledgment in French, German, Spanish, or Italian. The general leans over the video chart table, watching the entire operation from the closest thing to a God’s-eye view.]\\n\\n “Attack”—when I first heard that word, my gut reaction was “oh shit.” Does that surprise you?\\n\\n [Before I can answer…]\\n\\n Sure it does. You probably expected “the brass” to be just champing at the bit, all that blood and guts, “hold ’em by the nose while we kick ’em in the ass” crap.\\n\\n [Shakes his head.] I don’t know who created the stereotype of the hard-charging, dim-witted, high school football coach of a general officer. Maybe it was Hollywood, or the civilian press, or maybe we did it to ourselves by allowing those insipid, egocentric clowns—the MacArthurs and Halseys and Curtis E. LeMays—to define our image to the rest of the country. Point is, that’s the image of those in uniform, and it couldn’t be further from the truth. I was scared to death of taking our armed forces on the offensive, more so because it wouldn’t be my ass hanging out in the fire. I’d only be sending others out to die, and here’s what I’d be sending them up against.\\n\\n [He turns to another screen on the far wall, nodding to an operator, and the image dissolves into a wartime map of the continental United States.]\\n\\n Two hundred million zombies 1 . Who can even visualize that type of number, let alone combat it? At least this time around we knew what we were combating, but when you added up all the experience, all the data we’d compiled on their origin, their physiology, their strengths, their weaknesses, their motives, and their mentality, it still presented us with a very gloomy prospect for victory.\\n\\n The book of war, the one we’ve been writing since one ape slapped another, was completely useless in this situation. We had to write a new one from scratch.\\n\\n All armies, be they mechanized or mountain guerilla, have to abide by three basic restrictions: they have to be bred, fed, and led. Bred: you need warm bodies, or else you don’t have an army; fed: once you’ve got that army, they’ve got to be supplied; and led: no matter how decentralized that fighting force is, there has to be someone among them with the authority to say “follow me.” Bred, fed, and led; and none of these restrictions applied to the living dead.\\n\\n Did you ever read All Quiet on the Western Front? Remarque paints a vivid picture of Germany becoming “empty,” meaning that toward the end of the war, they were simply running out of soldiers. You can fudge the numbers, send the old men and little boys, but eventually you’re going to hit the ceiling…unless every time you killed an enemy, he came back to life on your side. That’s how Zack operated, swelling his ranks by thinning ours! And it only worked one way. Infect a human, he becomes a zombie. Kill a zombie, he becomes a corpse. We could only get weaker, while they might actually get stronger.\\n\\n All human armies need supplies, this army didn’t. No food, no ammo, no fuel, not even water to drink or air to breathe! There were no logistics lines to sever, no depots to destroy. You couldn’t just surround and starve them out, or let them “wither on the vine.” Lock a hundred of them in a room and three years later they’ll come out just as deadly.\\n\\n It’s ironic that the only way to kill a zombie is to destroy its brain, because, as a group, they have no collective brain to speak of. There was no leadership, no chain of command, no communication or cooperation on any level. There was no president to assassinate, no HQ bunker to surgically strike. Each zombie is its own, self-contained, automated unit, and this last advantage is what truly encapsulates the entire conflict.\\n\\n You’ve heard the expression “total war”; it’s pretty common throughout human history. Every generation or so, some gasbag likes to spout about how his people have declared “total war” against an enemy, meaning that every man, woman, and child within his nation was committing every second of their lives to victory. That is bullshit on two basic levels. First of all, no country or group is ever 100 percent committed to war; it’s just not physically possible. You can have a high percentage, so many people working so hard for so long, but all of the people, all of the time? What about the malingerers, or the conscientious objectors? What about the sick, the injured, the very old, the very young? What about when you’re sleeping, eating, taking a shower, or taking a dump? Is that a “dump for victory”? That’s the first reason total war is impossible for humans. The second is that all nations have their limits. There might be individuals within that group who are willing to sacrifice their lives; it might even be a relatively high number for the population, but that population as a whole will eventually reach its maximum emotional and physiological breaking point. The Japanese reached theirs with a couple of American atomic bombs. The Vietnamese might have reached theirs if we’d dropped a couple more, 2 but, thank all holy Christ, our will broke before it came to that. That is the nature of human warfare, two sides trying to push the other past its limit of endurance, and no matter how much we like to talk about total war, that limit is always there…unless you’re the living dead.\\n\\n For the first time in history, we faced an enemy that was actively waging total war. They had no limits of endurance. They would never negotiate, never surrender. They would fight until the very end because, unlike us, every single one of them, every second of every day, was devoted to consuming all life on Earth. That’s the kind of enemy that was waiting for us beyond the Rockies. That’s the kind of war we had to fight.\\n\\n DENVER, COLORADO, USA\\n\\n [We have just finished dinner at the Wainios. Allison, Todd’s wife, is upstairs helping their son, Addison, with his homework. Todd and I are downstairs in the kitchen, doing the dishes.]\\n\\n It was kinda like stepping back in time, the new army, I mean. It couldn’t have been any more different from the one I’d fought, and almost died with, at Yonkers. We weren’t mechanized anymore—no tanks, no arty, no tread jobs 1 at all, not even the Bradleys. Those were still in reserve, being modified for when we’d have to take back the cities. No, the only wheeled vehicles we had, the Humvees and a few M-trip-Seven ASVs, 2 were used to carry ammo and stuff. We hoofed it, all the way, marching in column like you see in Civil War paintings. There was a lot of references to “the Blue” versus “the Gray,” mainly because of Zack’s skin color and the shade of our new BDUs. They didn’t bother with camo schemes anymore; in any case, what was the point? And, I guess, navy blue was the cheapest dye they had back then. The BDU itself looked more like a SWAT team’s coverall. It was light and comfortable and interwoven with Kevlar, I think it was Kevlar, 3 bite-proof threads. It had the option of gloves and a hood that would cover your whole face. Later, in urban hand-to-hand, that option saved a lot of lives.\\n\\n Everything had kind of a retro feel about it. Our Lobos looked like something out of, I don’t know, Lord of the Rings? Standard orders were to use it only when necessary, but, trust me, we made it necessary a lot. It just felt good, you know, swingin’ that solid hunk a’ steel. It made it personal, empowering. You could feel the skull split. A real rush, like you were taking back your life, you know? Not that I minded pulling the trigger.\\n\\n Our primary weapon was the SIR, standard infantry rifle. The wood furniture made it look like a World War II gun; I guess composite materials were too hard to mass-produce. I’m not sure where the SIR supposedly came from. I’ve heard it was a modcop of the AK. I’ve also heard that it was a stripped-down version of the XM 8, which the army was already planning as its next-gen assault weapon. I’ve even heard that it was invented, tested, and first produced during the siege of the Hero City, and the plans were transmitted to Honolulu. Honestly, I don’t know, and I so don’t care. It might have kicked hard, and it only fired on semi, but it was super accurate and it never, ever jammed! You could drag it through the mud, leave it in the sand, you could drop it in saltwater and let it sit there for days. No matter what you did to this baby, it just wouldn’t let you down. The only bells and whistles it had was a conversion kit of extra parts, furniture, and additional barrels of different lengths. You could go long-range sniper, midrange rifle, or close-combat carbine, all in the same hour, and without reaching farther than your ruck. It also had a spike, this little flip-out job, about eight inches long, that you could use in a pinch if your Lobo wasn’t handy. We used to joke “careful, you’ll poke somebody’s eye out,” which, of course, we did plenty. The SIR made a pretty good close combat weapon, even without the spike, and when you add all the other things that made it so awesome, you can see why we always referred to it, respectfully, as “Sir.”\\n\\n Our staple ammo was the NATO 5.56 “Cherry PIE.” PIE stands for pyrotechnically initiated explosive. Outstanding design. It would shatter on entry into Zack’s skull and fragments would fry its brain. No risk of spreading infected gray matter, and no need for wasteful bonfires. On BS 4 duty, you didn’t even have to decap before you buried them. Just dig the trench and roll the whole body in.\\n\\n Yeah, it was a new army, as much the people as anything else. Recruitment had changed, and being a grunt meant something very different now. You still had the old requirements—physical stamina, mental competence, the motivation and discipline to master difficult challenges in extreme conditions—but all that was mouse farts if you couldn’t hack long-term Z-shock. I saw a lot of good friends just lose it under the strain. Some of them collapsed, some turned their weapons on themselves, some on their buddies. It didn’t have anything to do with being brave or anything like that. I once read this British SAS survival guide that talked all about the “warrior” personality, how your family’s supposed to be emotionally and financially stable, and how you’re not even supposed to be attracted to girls when you’re real young. [Grunts.] Survival guides…[Jerks his hand in a masturbatory movement.]\\n\\n But the new faces, they could have been from anywhere: your neighbor, your aunt, that geeky substitute teacher, or that fat, lazy slob at the DMV. From former insurance salesmen to a guy who I’m damn sure was Michael Stipe, although I never got him to admit it. I guess it all made sense; anyone who couldn’t roll wouldn’t have made it this far in the first place. Everyone was already a veteran in some sense. My battle buddy, Sister Montoya, fifty-two years old, she’d been a nun, still was I guess. Five three and a buck even, she’d protected her whole Sunday school class for nine days with nothing but a six-foot iron candlestick. I don’t know how she managed to hump that ruck, but she did, without complaining, from our assembly area in Needles, all the way to our contact site just outside of Hope, New Mexico. \\n\\n","sourceLink":"https://allnovel.net/world-war-z-an-oral-history-of-the-zombie-war/page-36.html","bookId":2579,"book":{"id":2579,"title":"World War Z: An Oral History of the Zombie War","description":"Storyline: The Zombie War came unthinkably close to eradicating humanity. Max Brooks, driven by the urgency of preserving the acid-etched first-hand experiences of the survivors from those apocalyptic years, traveled across the United States of America and throughout the world, from decimated cities that once teemed with upwards of thirty million souls to the most remote and inhospitable areas of the planet. He recorded the testimony of men, women, and sometimes children who came face-to-face with the living, or at least the undead, hell of that dreadful time. \"World War Z\" is the result. Never before have we had access to a document that so powerfully conveys the depth of fear and horror, and also the ineradicable spirit of resistance, that gripped human society through the plague years. \\n Ranging from the now infamous village of New Dachang in the United Federation of China, where the epidemiological trail began with the twelve-year-old Patient Zero, to the unnamed northern forests where untold numbers sought a terrible and temporary refuge in the cold, to the United States of Southern Africa, where the Redeker Plan provided hope for humanity at an unspeakable price, to the west-of-the-Rockies redoubt where the North American tide finally started to turn, this invaluable chronicle reflects the full scope and duration of the Zombie War. \\n Most of all, the book captures with haunting immediacy the human dimension of this epochal event. Facing the often raw and vivid nature of these personal accounts requires a degree of courage on the part of the reader, but the effort is invaluable because, as Mr. Brooks says in his introduction, \"By excluding the human factor, aren\u0027t we risking the kind of personal detachment from history that may, heaven forbid, lead us one day to repeat it? And in the end, isn\u0027t the human factor the only true difference between us and the enemy we now refer to as \u0027the living dead\u0027?\" \\n Note: Some of the numerical and factual material contained in this edition was previously published under the auspices of the United Nations Postwar Commission. Eyewitness reports from the first truly global war\\n","cover":"https://allnovel.net/images/world-war-z-an-oral-history-of-the-zombie-war.jpg","author":"Max Brooks","type":"Horror","source":"allnovel","link":"https://allnovel.net/world-war-z-an-oral-history-of-the-zombie-war.html","creation":"Oct 5, 2019 8:58:53 AM","modification":"Oct 5, 2019 6:04:56 PM"}}
