{"id":39853,"no":5,"title":"CHAPTER V.","content":"Meanwhile the fateful year 1820, when I was to be translated from the world of Harrow, and know nothing more of its friendships, quarrels, and politics, was at hand. At the election of July in that year was to begin my Winchester life. I certainly looked forward to it with a feeling of awe approaching terror, yet not untempered by a sense of increased dignity and the somewhat self-complacent feeling of one destined by fate to meet great and perilous adventures, and acquire large stores of experience. The sadness of departure was tempered also, as I remember, by the immediate delight of a journey to be performed. Certainly it was not the unmixed delight with which Rousseau contemplated his voyage à faire et Paris au bout. Something very different lay at the end of my voyage. Nevertheless, so intense was my delight in “the road” at that time (and to a great degree ever since), that the sixty miles journey to be performed was a great alleviation. The expedition was to be made with my father in his gig. A horse was to be sent on to Guildford,{95} and by dint of starting at a very early hour, and there changing horses, the distance was to be performed in one day. We were to travel, not by the more generally used coach road by Hounslow and Bagshot, but over the district called the Hog’s Back from Guildford to Farnham—chiefly, as I remember, for the sake of showing me that beautiful bit of country. For to my father beautiful scenery was as great a delight as it has always been to myself. At Farnham there was time, while the horse was being baited at “The Bush,” for us, after snatching a morsel of cold meat, to visit hurriedly the park and residence of the Bishop of Winchester. I, very contentedly trotting by the side of my father’s long strides, was much impressed by the beauty of the park. But, as I remember, my mind was very much exercised by the fact, then first learned, that the Bishop’s diocese extended all the way to London. And I think that it seemed somehow to my child’s mind that the dignity of my position as one of William of Wykeham’s scholars was enhanced by the enormous extent of the diocese of his successor. We reached Winchester late in the evening of the day before the election, putting up, not at “The George,” or at “The White Hart,” as most people would have done, but at the “Fleur de Lys,” pronounced “Flower de Luce,” a very ancient, but then third-rate hostelry, which my father preferred, partly probably because he thought the charges might be less there, but mainly because it is situated in the vicinity of the college, and he had known and used{96} it of old. We spent the evening at the house of Dr. Gabell, the head master, an old friend of my father’s, where his eldest daughter, an intimate friend of my mother’s, who had often been a visitor in Keppel Street, made much of me. And the next day I became a Wykehamist! And the manner of so becoming was in this wise. The real serious business of the six electors—three sent from New College, and three belonging to Winchester, as has been set forth on a previous page—consisted in the examination of those scholars, who, standing at the top of the school, were in that year candidates for New College. All the eighteen “prefects,” who formed the highest class in the school, were examined; but the most serious part of the business was the examination of the first half dozen or so, who were probably superannuated at the age of eighteen that year, and who might have a fair chance of finding a vacancy at New College (if there were not one at that present moment) in the course of the ensuing twelve months. And this was a very fateful and serious examination, for the examiners in “the election chamber” would, if the examination disclosed due cause, change the order of the roll as it came up to them, placing a boy, who had distinguished himself, before another, who had not done so. And as the roll thus settled was the order in which vacancies at New College were taken, the work in “the chamber” was of life-long importance to the subjects of it. {97} Very different was the “election” of the children, who were to go into Winchester. Duly instructed as to the part we were to play, we went marvelling up the ancient stone corkscrew stair to the mysterious chamber situated over the “middle gate,” i.e. the gateway between the outer court and the second quadrangle where the chapel, the hall, and the chambers are. The “election chamber” always maintained a certain character of mystery to us, because it was never opened or used save on the great occasion of the annual election. In that chamber we found the six solemn electors in their gowns waiting for us; especially the Bishop of Hereford, who was then Warden of Winchester College, an aged man with his peculiar wig and gown was an object of awe. No Bishop had in those days dreamed as yet of discarding the episcopal wig. And then the examination began as follows: “Well, boy, can you sing?” “Yes, sir.” “Let us hear you.” “‘All people that on earth do dwell,’” responded the neophyte—duly instructed previously in his part of the proceeding—without attempting in the smallest degree to modify in any way his ordinary speech. “Very well, boy. That will do!” returned the examiner. The examination was over, and you were a member of William of Wykeham’s college, Sancta Mari? de Winton prope Winton. “Prope Winton,” observe, for the college is situated outside the ancient city walls. The explanation of this survival of the simulacrum of an examination is that the ancient statutes require{98} that candidates for admission as scholars must be competently instructed in plano cantu—in plain chant; the intention of the founder being that all his scholars should take part in the choral service of the chapel. I and my fellow novices thus admitted as scholars in that July of 1820 were not about to join the school immediately. We had the six weeks holidays before us, the election taking place at the end of the summer half year. Election week was the grand festival of the Wykehamical year. For three days high feast was held in the noble old hall. The “high table” was spread on the dais, and all old Wykehamists were welcome at it. The boys in the lower part of the hall were regaled with mutton pies and “stuckling.” That was their appointed fare; but in point of fact they feasted on dishes or portions of dishes sent down from the abundantly-spread high table, and the pies were carried away for the next morning’s breakfast. I do not think anybody ate much “stuckling” beyond a mouthful pro forma. It was a sort of flat pastry made of chopped apples and currants. And the specialty of it was that the apples must be that year’s apples. They used to be sent up from Devonshire or Cornwall, and sometimes were with difficulty obtained. Then there was the singing of the Latin grace, with its beautiful responses, performed by the chapel choir and as many others as were capable of taking part in it. The grace with its music has been published, and I need not occupy these pages with a{99} reprint of it. And then in the afternoon came the singing of “Domum” on the fives court behind the school, by the whole strength of the company. Nine such election weeks did I see, counting from that which made me a Wykehamist in 1820 to that which saw me out a superannuate in 1828. I did not get a fellowship at New College, having narrowly missed it for want of a vacancy by one. I was much mortified at the time, but have seen long since that probably all was for the best for me. It was a mere chance, as has been shown at a former page, whether a boy at the head or nearly at the head of the school went to New College or not. The interesting event of a vacancy having occurred at New College, whether by death, marriage, or the acceptance of a living, was announced by the arrival of “speedyman” at Winchester College. “Speedyman,” in conformity with immemorial usage, used to bring the news on foot from Oxford to Winchester. How well I remember the look of the man, as he used to arrive with all the appearance of having made a breathless journey, a spare, active-looking fellow, in brown cloth breeches and gaiters covered with dust. Of course letters telling the facts had long outstripped “speedyman.” But with the charming and reverent spirit of conservatism, which in those days ruled all things at Winchester, “speedyman” made his journey on foot all the same! Of course one of the first matters in hand when{100} this fateful messenger arrived was to regale him with college beer, and right good beer it was in those days. In connection with it may be mentioned the rather singular fact, that, whereas all other supplies from the college buttery to the boys—the bread, the cheese, the butter, the meat—were accurately measured, the beer was given absolutely ad libitum. In fact it was not given out at all, but taken. Thrice a day the way to the cellar was open, a back stair leading from the hall to the superb old vaulted cellar, with its central pillar and arches springing from it in every direction. All around were the hogsheads, and the proper tools for tapping one as soon as another should be out. And to this cellar the boys—or rather the junior boys at each mess—went freely to draw as much as they chose. And the beer thus freely supplied was our only beverage, for not only was tea or coffee not furnished, it was not permitted. Some of the prefects (the eighteen first boys in college) would have “tea-messes,” provided out of their own pocket money, and served by their “fags.” But if, as would sometimes happen, either of the masters chanced to appear on the scene before the tea-things could be got out of the way, he used to smash them all, using his large pass key for the purpose, and saying “What are all these things, sir? William of Wykeham knew nothing, I think, of tea!” We used to breakfast at ten, after morning school, on bread and butter and beer, having got up at{101} half-past five, gone to chapel at half-past six, and into school at half-past seven. At a quarter to one we again went up into hall. It was a specialty of college phraseology to suppress the definite article. We always said “to hall,” “to meads” (the playground), “to school,” “to chambers,” and the like. The visit to hall at that time was properly for dinner, though it had long ceased to be such. The middle of the day “hall” served in my day only for the purpose of luncheon (though no such modern word was ever used), and only those “juniors” attended whose office it was to bring away the portions of bread and cheese and “bobs” (i.e. huge jugs) of beer for consumption in the afternoon. Sunday formed an exception to this practice. We all went up into “hall” in the middle of the day on Sunday, and dined on roast beef, the noontide dinner consisting of roast beef on that day, boiled beef on Monday, Tuesday, Wednesday, and Thursday, and baked plum pudding on Friday and Saturday. But the boiled beef, with the exception of certain portions reserved for the next morning’s breakfast of the seniors of the messes, or companies into which the “inferiors” (i.e., non-prefects) were divided, was not eaten, but given away. During the war Winchester had been one of the depots of French prisoners, and the beef in question was then given to them. When there were no more Frenchmen it was given to twenty-four old women who were appointed to do the weeding of the college quad{102}rangles. It must be understood that this arrangement was entirely spontaneous on the part of the boys, though it would have been quite out of the question for any individual to say that he for his part would eat his own beef. How all this may be now I know not. Probably the college, under the enlightened guidance of Her Majesty’s Commissioners, have seen the propriety of providing the youthful Wykehamists with table napkins and caper sauce, while the old women go without their dole of beef. On the Friday and Saturday the pudding was carried down out of hall by the juniors for consumption during the afternoon. At about a quarter-past six, at the conclusion of afternoon school, we went up into hall for dinner—originally, of course, supper. This consisted of mutton, roast or boiled, every evening of the year, with potatoes and beer. But it was such mutton as is not to be found in English butchers’ shops nowadays, scientific breeding having improved it from off the face of the land. It was small Southdown mutton, uncrossed by any of the coarser, rapidly-growing, and fat-making breeds. And that it should be such was insured by the curious rule, that, though only a given number of pounds of mutton were required and paid for to the contractor, the daily supply was always to be one sheep and a half. So that if large mutton was sent it was to the loss of the contractor. Furthermore it was the duty of the “prefect of tub” to see that the mutton was in all ways satisfactory. {103}The “prefect of tub” was one of the five boys at the head of the school; another was the “prefect of hall”; a third “prefect of school”; and the fourth and fifth “prefects of chapel.” These offices were all positions of emolument. That of the “prefect of tub” was far the most so, and was usually held by the senior college “founder,” or boy of “founder’s kin,” during his last year before going to New College. The titles of the other offices explain themselves, but that of “prefect of tub” requires some elucidation. In the hall, placed just inside the screen which divided the buttery hatches from the body of the hall, there was an ancient covered “tub.” In the course of my eight years’ stay at Winchester this venerable tub—damnosa quid non diminuit dies?—had to be renewed. It was replaced by a much handsomer one; but, as I remember, the change had rather the effect on the popular mind in college of diminishing our confidence in the permanency of human institutions generally. The original purpose of this tub was to receive fragments and remains of food, together with such portions—“dispers” we called them—of the evening mutton supper as were not duly claimed by the destined recipient of them at his place at the table, that they might be given to the poor; and the “prefect of tub” was so called because it was part of his office to see that this was duly done. It was also his duty to preside over the distribution of the aforesaid “dispers”—not quasi dispars, as might be supposed by those who can appreciate the difference between a prime cut{104} out of a leg of mutton and a bit of the breast of a sheep, but “dispers” from dispertio. Now the distribution in question was effected in this wise. The joints were cut up in the kitchen always accurately in the same manner. The leg made eight “dispers,” the shoulder seven, and so on. The “dispers” thus prepared were put into four immense pewter dishes, and these were carried up into hall by four choristers under the superintendence of the “prefect of tub” and distributed among the fifty-two “inferiors”—i.e., non-prefects. The eighteen prefects dined at two tables by themselves. Their joints were not cut into “dispers,” but were dressed by the cook according to their own orders, paid for by themselves according to an established tariff drawn with reference to the extra expense of the mode of preparation ordered. The long narrow tables were six in number, ranged on either side of the noble hall, exactly as in a monastic refectory. The dais was left unoccupied, save at election time, when the “high table” was spread there. At the first two tables on the left hand side as one entered the hall, the eighteen prefects dined. This bloated aristocracy was supplied with plates to eat their dinner from. The populace—mere mutton consumere nati—the fifty-two inferiors, had only “trenchers,” flat pieces of wood about nine inches square. These fifty-two “inferiors” were divided into eight companies, and occupied the remaining four tables. But this division was so arranged that one of the eight seniors of the{105} “inferiors” was at the head of each company, and one of the eight juniors at the bottom of each, the whole body being similarly distributed. And each of these companies occupied a different table every day, the party who sat at the lowest table on Monday occupying the highest on Tuesday, and so on. So that when the “prefect of tub” entered the hall at the head of the procession of four choristers, carrying the four “gomers” (such was the phrase) of dispers, he proceeded first to the table on the opposite side of the hall to that of the prefects, and saw that the senior of the mess occupying that table selected as many of the most eligible dispers as there were persons present. If any junior were absent by authority of, or on the business of, any prefect, his disper was allowed to be taken for him. This senior of the mess, it may be mentioned obiter was called, for some reason hidden in the obscurity of time, the “candlekeeper.” Assuredly neither he nor his office had any known connection with the keeping of candles. Any dispers remaining unclaimed at the end of his tour of the hall belonged to “the tub.” In return for the performance of this important office, the “prefect of tub” was entitled to the heads, feet, and all such portions of the sheep as were not comprised in legs, shoulders, necks, loins, and breasts, as well as to the dispers of any individuals who might from any cause be absent from college. Of course he did not meddle personally with any of these perquisites, but had a contract{106} with the college manciple, the value of which was, I believe, about ￡80 a year. Such was the “prefect of tub.” Orderly conduct in hall generally, which did not imply any degree of violence, was maintained by the “prefect of hall,” the dignity of whose office, though it was by no means so profitable as that of the “prefect of tub,” ranked above that of all the other “officers.” No master was ever present in hall. But the most onerous and important duty of the prefect of hall consisted in superintending the excursion to “hills,”—i.e. to St. Catherine’s Hill, which took place twice on every holiday, once on every half-holiday during the year, and every evening during the summer months. On these occasions the “prefect of hall” had under his guidance and authority not only William of Wykeham’s seventy scholars, but the whole of the hundred and thirty pupils of the head master, who were called commoners. The scholars marched first, two and two (with the exception of the prefects who walked as they pleased), and then followed the commoners. And it was the duty of the prefect of hall to keep the column in good and compact order until the top of the hill was reached. Then all dispersed to amuse themselves as they pleased. But the prefect of hall still remained responsible for his flock keeping within bounds. St. Catherine’s Hill is a notably isolated down in the immediate neighbourhood of Winchester, and{107} just above the charming little village of St. Cross. There is a clump of firs on the top, and the unusually well marked circumvallation of a Roman (or British?) camp around the circle of the hill. The ditch of this circumvallation formed our “bounds.” The straying beyond them, however, in the direction of the open downs away from the city, and from St. Cross, was deemed a very venial offence by either the prefect of hall or the masters. But not so in the direction of the town. It was the duty of the three “juniors” in college—one of whom I was during my first half-year—to “call domum.” When the time came for returning to college one of those three walked over the top of the hill from one side to the other, while the other two went round the circumvallation—each one half of it—calling perpetually “Domum ... domum” as loudly as they could. All the year round we went to “morning hills” before breakfast, and to afternoon hills about three. In the summer we went, as I have said, every evening after “hall,” but not to the top of the hill, only to the water-meads at the foot of it, the object being to bathe in the Itchen. Many of the Winchester recollections most indelibly fixed in my memory are connected with “hills.” It seems impossible that sixty years can have passed since I stood on the bank of the circumvallation facing towards Winchester, and gazed down on the white morning mist that entirely concealed the city and valley. How many mornings{108} in the late autumn have I stood and watched the moving, but scarcely moving masses of billowy white cloud! And what strange similitudes and contrasts suggested themselves to my mind as I recently looked down from the heights of Monte Gennaro on the Roman Campagna similarly cloud hidden! The phenomenon exhibited itself on an infinitely larger scale in the latter case, but it did not suggest to me such thick-coming fancies and fantastic imaginings as the water-mead-born mists of the Itchen! There were two special amusements connected with our excursions to St. Catherine’s Hill—badger baiting and “mouse-digging,” the former patronised mainly by the bigger fellows, the latter by their juniors. There was a man in the town, a not very reputable fellow I fancy, who had constituted himself “badger keeper” to the college. It was his business to provide a badger and dogs, and to bring them to certain appointed trysting places at “hill times” for the sport. The places in question were not within our “bounds,” but at no great distance in some combe or chalk-pit of the neighbouring downs. Of course it was not permitted by the authorities; but I think it might easily have been prevented had any attempt to do so been made in earnest. It seems strange, considering my eight years’ residence in college, that I never once was present at a badger baiting. I am afraid that my absence was not caused by distinct disapproval of the cruelty of the sport, but simply by the fact that{109} my favourite “hill-times” occupations took me in other directions. Nor, probably for the same reason, was I a great mouse-digger. Very many of us never went to “hills” unarmed with a “mouse-digger.” This was a sort of miniature pickaxe, which was used to dig the field-mice out of their holes. The skill and the amusement consisted in following the labyrinthine windings of these, which are exceedingly numerous on the chalk downs, in such sort as to capture the inmate and her brood without injuring her, and carry her home in triumph to be kept in cages provided ad hoc. There was—and doubtless is—a clump of firs on the very centre and summit of St. Catherine’s Hill. They are very tall and spindly trees, with not a branch until the tuft at the top is reached. And my great delight when I was in my first or second year was to climb these. Of course I was fond of doing what few, if any, of my compeers could do as well. And this was the case as regarded “swarming up” those tall and slippery stems. I could reach the topmost top, and gloried much in doing so. But during my later years the occupation of a hill morning which most commended itself to me was ranging as widely as possible over the neighbouring hills. Like the fox in the old song, I was “off to the downs O!” As I have said, the straying beyond bounds in this direction, away from the town, was considered a very light offence; but I was apt to make it a somewhat more serious one by not getting{110} back from my rambling, despite good running, till it was too late to return duly with the main body to college. It was very probable that this might pass without detection, if there were no roll-call on the way back. But it frequently happened that “Gaffer” (such was Dr. Williams’s sobriquet among us) on his white horse met us on our homeward march, and stopped the column, while the prefect of hall called names. As these escapades in my case occurred mainly during my last three years, I being a prefect myself owed no allegiance to the authority of the prefect of hall. But the roll-call revealing my absence would probably issue in my having to learn by heart one of the epistles of Horace. Prefects learned their “impositions” by heart, “inferiors” wrote them. Every here and there the sides of these downs are scored by large chalk-pits. There is a very large one on St. Catherine’s Hill on the side looking towards St. Cross; and this was a favourite scene of exploits in which I may boast myself (’tis sixty years since!) to have been unrivalled. There was a very steep and rugged path by which it was possible to descend from the upper edge of this chalk-pit to the bottom of it. And it was a feat, in which I confess I took some pride, to take a fellow on my shoulders (not on my back), while he had a smaller boy on his shoulders, and thus with two living stories on my shoulders to descend the difficult path in question. And the boy in the middle—the first story—could not be a very small one, for it was{111} requisite that he also should hold and balance his burthen thoroughly well. I think I could carry one very little boy down now! It was the “prefect of hall” who managed the whole business of our holidays—as they would be called elsewhere—which we called “remedies.” A “holiday” meant at Winchester a red-letter day; and was duly kept as such. But if no such day occurred in the week, the “prefect of hall” went on the Tuesday morning to the head master (Wiccamice “informator”) and asked for a “remedy,” which, unless there were any reason, such as very bad weather, or a holiday coming later in the week, was granted by handing to the prefect a ring, which remained in his keeping till the following morning. This symbol was inscribed “Commendat rarior usus.” But in addition to these important duties the “prefect of hall” discharged another, of which I must say a few words, with reference to the considerable amount of interest which the outside world was good enough to take in the subject a few years ago, with all that accurate knowledge of facts, and that discrimination which people usually display when talking of what they know nothing about. It was the “prefect of hall,” who ordered the infliction of a “public tunding.” The strange phrase, dropped by some unlucky chance into ears to which it conveyed no definite meaning, seems to have inspired vague terrors of the most terrific kind. Very much nonsense was talked and printed at the{112} time I refer to. But the following simple and truthful statement of what a public tunding was, may enable those, who take an interest in the matter, to form some reasonable opinion whether the infliction of such punishment were a good or a bad thing. At the conclusion of the evening dinner or supper, whichever it may be called, the “prefect of hall” summoned the boys to the dais for the singing of grace. Some dozen or so of boys, who had the best capacities for the performance, were appointed by him for the purpose, and the whole assembly stood around the dais, while the hymn, Te de Profundis, was sung. When all were thus assembled, and before the singers commenced, the culprit who had been sentenced to a tunding stepped out, pulled off his gown, and received from the hands of one deputed by the “prefect of hall,” and armed with a tough, pliant ground-ash stick, a severe beating. I never had a tunding; but I have no doubt that the punishment was severe, though I never heard of any boy disabled by it from pursuing his usual work or his usual amusements. It was judiciously ordered by the “prefect of hall” for offences deemed unbecoming the character of a Wykehamist and a gentleman, and only for such. Any such petty larceny exploits as the scholars at some other “seats of learning” are popularly said to be not unfrequently guilty of, such as robberies of orchards or poultry-yards or the like, would have inevitably entailed a public tunding. Any attempt{113} whatsoever to appropriate unduly either by fraud or violence anything sent to another boy from home—any portion of a “cargo,” as such despatches were called—and à fortiori any money or money’s value, would have necessitated a public tunding. The infliction was rare. Many half years passed without any public tunding having been administered. And my own impression is, that the practice was eminently calculated to foster among us a high tone of moral and gentlemanlike feeling. These reminiscences of the penal code that was in vigour among ourselves are naturally connected with those referring to the subject of corporal punishment in its more official form. On one of the whitewashed walls of the huge schoolroom was an inscription conceived and illustrated as follows: “Aut disce!” and there followed a depicted book and inkstand; “Aut discede!” followed by a handsomely painted sword, as who should say, “Go and be a soldier!” (offering that as an alternative for which no learning was needed, after the fashion of a day before examinations for commissions were dreamed of!); and then lastly, “Manet sors tertia c?di,” followed by the portraiture of a rod. But this rod is of so special and peculiar a kind, and so dissimilar from any such instrument as used elsewhere, that I must try to explain the nature of it to my non-Wiccamical readers. A stick of some hard wood, beech I think it was, turned into{114} a shape convenient to the hand, about a yard long, and with four grooves about three inches long and as large as a cedar pencil, cut in the extremity of it, formed the handle. Into these four grooves were fitted four slender apple twigs about five feet long. They were sent up from Herefordshire in bundles, cut and prepared for the purpose, and it was the duty of the “prefect of school” to provide them. These twigs, fitted into the grooves, were fixed by a string which bound them tightly to the handle, and a rod was thus formed, the four-fold switches of which stood out some foot—or more than that towards the end—from each other. The words “flog,” or “flogging,” it is to be observed, were never heard among us, in the mouth either of the masters or of the boys. We were “scourged.” And a scourging was administered in this wise. At a certain spot in the school—near the seat of the “informator,” when he was the executioner, and near that of the “hostiarius” or under master when he had to perform—in front of a fixed form, the patient kneeled down. Two boys, any who chanced to be at hand, stepped behind the form, turned the gown of a collegian or the coat tails of a commoner over his shoulders, and unbuttoned his brace buttons, leaving bare at the part where the braces join the trousers a space equal to the diameter of a crown-piece—such was the traditional rule. And aiming at this with more or less exactitude the master inflicted three cuts. Such was a “scourging.{115}” Prefects, it may be observed, were never scourged. The “best possible instructors” of this enlightened age, who never treat of subjects the facts of which they are not conversant with, have said much of the “cruelty,” and the “indecency” of such infliction of corporal punishment, and of the moral degradation necessarily entailed on the sufferers of it. As to the cruelty, it will be readily understood from the above description of the rod, that it was quite as likely as not that no one of the four twigs, at either of the three cuts, touched the narrow bare part; especially as the operator—proceeding from one patient to another with the utmost possible despatch, and with his eyes probably on the list in his left hand of the culprits to be operated on—had little leisure or care for aiming. The fact simply was that the pain was really not worth speaking of, and that nobody cared the least about it. The affair passed somewhat in this wise. It is ten o’clock; the morning school is over; and we are all in a hurry to get out to breakfast. There are probably about a dozen or a score of boys to be scourged. Dr. Williams, as well beloved a master as ever presided over any school in the world, has come down from his seat, elevated three steps above the floor of the school, putting on his great cocked hat as he does so. He steps to the form where the scourging is to be done; the list of those to be scourged, with the reasons why, is handed to him{116} by the prefect, charged for the week with this duty, together with the rod. He calls “Jones” ... swish, swish, swish!... “Brown” ... swish, swish, swish!... “Robinson” ... swish, swish, swish! as rapidly as it can be done. Each operation takes perhaps twenty seconds. Having got through the list, he flings the rod on the ground, makes a demi-volte so as to face the whole school, taking off his hat as he does so, and the “prefect of school” who has been waiting on the steps of the master’s seat, with the prayer-book open in his hand, instantly reads the short prayer with which the school concludes, while those who have been scourged stand in the background hurriedly readjusting their brace buttons so as not to be behind hand at the buttery hatch for breakfast. Of any disgrace attached to the reception of a scourging, no one had any smallest conception. Of the cruelty of the infliction the reader may judge for himself. Of the indecent talk about indecency he may also know from the above accurate account what to think. The degree of “moral degradation” inflicted on the sufferers may perhaps be estimated by a reference to the roll of those whom Winchester has supplied to serve their country in Church and State. The real and unanswerable objection to the infliction of “corporal punishment,” as it was used in my day at Winchester, was that it was a mere form and farce. It caused neither pain nor disgrace, and assuredly morally degraded nobody. I{117} have been scourged five times in the day; not because, as might be supposed, I was so incorrigible that the master found it necessary to go on scourging me, but simply because it so chanced. I had, say, come into chapel “tardè,” i.e. after the service had commenced; I had omitted to send in duly my “vulgus”; I had been “floored” in my Horace; I had missed duly answering “sum,” when on returning from “hills” “Gaffer” had met the procession on his grey horse and caused the “prefect of hall” “to call names,” the reason being that I had been far away over the downs to Twyford, and had not been able to run back in time; and an unlucky simultaneousness of these or of a dozen other such sins of omission or commission had occurred, which had to be wiped off by a scourging by the “hostiarius” at the morning school, and another by the “informator;” by a third from the former at “middle school,” when the head master did not attend; by a fourth from the “hostiarius” at evening school, and a fifth from the “informator” the last thing before going out to dinner at six. But this was a rare tour de force, scarcely likely to occur again. I was rather proud of it, and wholly unconscious of any “moral degradation.” I have spoken of the “informator” putting on his cocked hat when about to commence his work of scourging. I am at a loss to account for his having worn this very unacademical costume. It was a huge three-cornered cocked hat very much like that of a coachman on state occasions; and must, I take{118} it, have been a survival from about the time of Charles the Second. It has, I believe, been since discarded. The mention above of a “vulgus” requires some explanation. Every “inferior,” i.e. non-prefect, in the school was required every night to produce a copy of verses of from two to six lines on a given theme; four or six lines for the upper classes, two for the lowest. This was independent of a weekly “verse task” of greater length, and was called a “vulgus,” I suppose, because everybody—the vulgus—had to do it. The prefects were exercised in the same manner but with a difference. Immediately before going out from morning or from evening school, at the conclusion of the day’s lesson, the “informator” would give a theme, and each boy was expected then and there without the assistance of pen, paper, or any book, to compose a couple, or two couple, of lines, and give them viva voce. He got up, and scraped with his foot to call the master’s attention when he was ready; and as not above five or ten minutes were available for the business, a considerable degree of promptitude was requisite. The theory was that these compositions—“varying” was the term in the case of the prefects, as “vulgus” in that of the inferiors—should be epigrammatic in their nature, and that Martial rather than Ovid should be the model. Of course but little of an epigrammatic nature was for the most part achieved; but great readiness was made habitual by the practice. And sometimes the{119} result was creditable to something more than readiness. I am tempted to give one instance of such a “varying.” It belonged to an earlier time than mine—the time when Decus et tutamen was adopted as the motto cut on the rim of the five-shilling pieces. The author of the “varying” in question had been ill with fever, and his head had been shaved, causing him to wear a wig. Decus et tutamen was the theme given. In a minute or two he was ready, stood up, and taking off his wig, said, “Aspicite hos crines! duplicem servantur in usum! Hi mihi tutamen nocte”—putting the wig on wrong side outwards; “Dieque decus,” reversing it as he spoke the words. The memory of this “varying” lives—or lived!—at Winchester. But I do not think it has ever been published, and really it deserves preservation. I wish I could give the author’s name. When at the end of the summer holidays in that year, 1820, I returned to college, again brought down to Winchester by my father in his gig, I confess to having felt for some short time a very desolate little waif. As I, at the time a child barely out of the nursery, look back upon it, it seems to my recollection that the strongest sense of being shoved off from shore without guidance, help, or protection, arose from never seeing or speaking to a female human being. To be sure there was at the sick-house the presiding “mother”—Gumbrell her name was, usually pronounced “Grumble{120}”—but she was not a fascinating representative of the sex. An aged woman once nearly six feet high, then much bent by rheumatism, rather grim and somewhat stern, she very conscientiously administered the prescribed “black-dose and calomel pill” to those under her care at the sick-house. To be there was called being “continent;” to leave it was “going abroad”—intelligibly enough. Tea was provided there for those “continent” instead of the usual breakfast of bread and butter and beer; and I remember overhearing Mother Gumbrell, oppressed by an unusual number of inmates, say, “Talk of Job indeed! Job never had to cut crusty loaves into bread and butter!” I saw the old woman die! I was by chance in the sick-house kitchen—in after years, when a prefect—and “Dicky Gumbrell,” the old woman’s husband, who had been butler to Dean Ogle, and who by special and exceptional favour was allowed to live with his wife in the sick-house, was reading to her the story of Joseph and his Brethren, while she was knitting a stocking, and sipping occasionally from a jug of college beer which stood between them, when quite suddenly her hands fell on to her lap and her head on to her bosom, and she was dead! while poor old Dicky quite unconsciously went on with his reading. But I mentioned Mother Gumbrell only to observe that she, the only petticoated creature whom we ever saw or spoke with, was scarcely calculated to supply, even to the imagination, the feminine ele{121}ment which had till then made so large a part of the lives of ten-year-old children fresh from their mother’s knee. Perhaps the most markedly distinctive feature of the school life was the degree in which we were uninterfered with by any personal superintendence. The two masters came into the school-room to hear the different classes at the hours which have been mentioned, also, when we were “in chambers” in the evening, either during the hour of study which intervened between the six o’clock dinner and the eight o’clock prayers in the chapel, or during the subsequent hour between that and nine o’clock, when all went, or ought to have gone, to bed; and subsequently to that, when all were supposed to be in bed and asleep, we were at any moment liable to the sudden unannounced visit of the “hostiarius” or second master. The visit was a mere “going round.” If all was in order, it passed in silence, and was over in a minute. If any tea-things were surprised, they were broken, as before mentioned. If beer, or traces of the consumption of beer, were apparent, that was all right. The supply of a provision of that refreshment was recognised, it being a part of the duty of the bedmakers to carry every evening into each of the seven “chambers” a huge “nipperkin” of beer, “to last,” as I remember one of the bedmakers telling me when I first went into college, “for all night.” The supply, as far as my recollection goes, was always considerably in excess of the consumption. If all was not in order, “the{122} prefect in course”—i.e. the prefect who in each chamber was responsible for due order during the current week—was briefly told to speak with the master next morning. And this comprises about all the personal intercourse that took place between us and the masters. Not that it is to be understood that any hour of our lives was left to our own discretion as to the employment of it; but this was attained by no immediate personal superintendence or direction. The systematised routine was so perfect, and so similar in its operation to the movements of some huge irresistible machine, that the disposal of each one of our hours seemed to be as natural, as necessary, and as inevitable as the waxing and waning of the moon. And the impression left on my mind by eight years’ experience of such a system is, that it was pre-eminently calculated to engender and foster habitual conceptions of the paramount authority of law, as distinguished from the dictates of personal notions or caprices; of self-reliance, and of conscious responsibility in the individual as forming an unit in an organised whole. Of course the eighteen prefects were to a much smaller degree coerced by the machine, and to a very great degree active agents in the working of it. And I was a prefect during three years of my eight in college. But at first, when a little fellow of, say, ten years old, entered this new world, it was not without a desolate sensation of abandonment, which it needed a month or two’s experience to get the better of.{123} All this, however, was largely corrected and modified by one admirable institution, which was a cardinal point in the Wiccamical system. To every “inferior” was appointed one of the prefects as a “tutor.” It was the duty of this tutor to superintend and see to the learning of his lessons by the inferior, and the due performance of his written “prose” and “verse tasks,” to protect him against all ill-usage or “bullying,” and to be in all ways his providence and friend. These appointments were made by the “informator.” The three or four senior prefects had as many as seven pupils, the junior prefects one or two only; and the tutor received from the parents of each pupil, by the hands of the master, two guineas yearly. In order rightly to understand the working of all these arrangements, it must be explained that each individual’s place in “the school” and his place “in college” were two entirely different things. The first depended on his acquirements when he entered the college and his subsequent scholastic progress. The latter depended solely on his seniority “in college.” The junior in college was the last boy whose nomination succeeded in finding a vacancy in any given year; and he remained “junior” till the admission of another boy next year, when he had one junior below him, and so on. Thus it might happen, and constantly did happen, that a boy’s junior in college might be much above him in the school, either from having come in at a later age, or from being a better prepared or cleverer{124} boy. And all the arrangements of the domestic college life, the fagging, \u0026c., depended wholly on juniority “in college,” and had no reference to the place held by each in the school. But all this seniority and juniority “in college” ceased to operate in any way as soon as the individual in question became a prefect. He had then equal authority over every “inferior,” whether such inferior were his senior or junior in college. It is evident, therefore, that the prefect’s authority was frequently exercised over individuals older, bigger, stronger than himself; and for the due and regular working of this system it was necessary that the authority of the prefect should be absolute and irresistible. It was traditionally supposed in college that for an “inferior” to raise his hand against a prefect would be a case of expulsion. Whether expulsion would have actually followed, I cannot say, for during my eight years’ residence in college I never remember such a case to have occurred. I have heard my father and other old Wykehamists of his day declare that no such absolute authority as that of a prefect at Winchester existed in England, save in the case of the captain of a man-of-war. It should be observed, however, in modification of this, that any abuse of this authority in the way of bullying or cruelty would at once have been interfered with by that other prefect, the victim’s tutor. An appeal to the master would have been about as much thought of as an appeal to Jupiter or Mars.","sourceLink":"http://novel.tingroom.com/duanpian/2773/76745.html","bookId":1329,"book":{"id":1329,"title":"What I Remember","description":"简介： I have no intention of writing an autobiography. There has been nothing in my life which could justify such a pretension. But I have lived a long time. I remember an aged porter at the monastery of the Sagro Eremo, above Camaldoli, who had taken brev...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2773","creation":"Aug 1, 2019 12:24:51 AM","modification":"Aug 1, 2019 12:24:51 AM"}}
