{"id":14250,"no":6,"title":"CHAPTER VI.—THE WAYS OF SOCIETY.","content":"The Monday following was the first and the best of some bad days at the farm; for Missy had never written to tell Mr. Teesdale when and where he might call for her, so he could not call at all, and she did not come out by herself. This they now firmly expected her to do, and David wasted much time in meeting every omnibus; but when the last one had come in without Missy, even he was forced to give her up for that day. There would be a letter of explanation in the morning, said David, and shut his ears to his wife\u0027s answer. She had been on tenter-hooks all day, for ever diving into the spare room with a duster, dodging out again to inquire what time it was now, and then scolding David because he had not his watch—a circumstance for which that simpleton was reproaching himself before long. For there was no letter in the morning, and no Missy next day, or the next, or the next after that. It was then that Mr. Teesdale took to lying awake and thinking much of the friendly ticking that had cheered his wakefulness for thirty years, and even more of a few words in the Thursday\u0027s Argus, which he had not shown to a soul. And strange ideas concerning the English girl were bandied across the family board; but the strangest of all were John William\u0027s, who would not hear a word against her; on the contrary, it was his father, in his opinion, who was to blame for the whole matter, which the son of the house declared to be a mere confusion of one Monday with another. \"You own yourself,\" said he, \"that the girl wanted a new rig-out before she\u0027d come here to stay. Did she say so, father, or did she not? Very well, then. Do you mean to tell me she could get measured, and tried on, and fixed up all round in four days, and two of \u0027em Saturday and Sunday? Then I tell you that\u0027s your mistake, and it wasn\u0027t Monday she said, but Monday week, which is next Monday. You mark my words, we\u0027ll have her out here next Monday as ever is!\" How John William very nearly hit the mark, and how shamefully Arabella missed it with the big stones she had been throwing all the week—how rest returned to the tortured mind of Mr. Teesdale, and how Mrs. T. was not sorry that she had left the clean good sheets on the spare bed in spite of many a good mind to put them away again—all this is a very short story indeed. For Missy reappeared on the Saturday afternoon while they were all at tea. Arabella was the one who caught first sight of the red sunshade bobbing up the steep green ascent of the farmhouse, for Arabella sat facing the window; but it was left to John William to turn in his chair and recognise the tall, well-dressed figure at a glance as it breasted the hill. \"Here she is—here\u0027s Miriam!\" he cried out instantly. \"Now what did I tell you all?\" He was rolling down his shirt-sleeves as he spoke, flushed with triumph. Mr. Teesdale had risen and pressed forward to peer through the window, and as he did so the red sunshade waved frantically. Beneath it was a neat straw hat, and an unmistakable red-fringed face nodding violently on top of a frock of vestal whiteness. Arabella flew out to meet the truant, and John William to put on a coat. \"Well, well!\" said Mr. Teesdale, holding both her hands when the girl was once more among them. \"Well, to be sure; but you\u0027re just in time for tea, that\u0027s one good thing.\" \"Nay, I must make some fresh,\" cried his wife, without a smile. \"Mind, I do think you might have written, Miriam. You have led us a pretty dance, I can tell you that.\" She caught up the teapot and whisked out of the room. \"Have I?\" the girl asked meekly of the old man. \"No, no, my dear,\" and \"Not you,\" the two Teesdales answered in one breath; though the father added, \"but you did promise to write.\" \"I know I did. But you see——\" Missy laughed. \"You should have written, my dear,\" David said gently, as she got no further, and he had no wish to cross-question her. \"I didn\u0027t know what had got you.\" \"None of us could think,\" added Arabella. \"Except me, Miriam,\" said John William, proudly. \"You were getting your new rig-out; wasn\u0027t that it?\" The girl nodded and beamed at him as she said that it was. The sunshade was lying on the sofa now, and Missy sitting at the table in Arabella\u0027s place. \"I thought,\" said Mr. Teesdale, \"that you had gone off to Sydney, and weren\u0027t coming near us any more. Do you know why? There was a Miss Oliver in the list of the overland passengers in Thurday\u0027s Argus.\" \"Indeed,\" said the girl. \"Yes, and it was a Miss M. Oliver, and all.\" \"Well, I never! That\u0027s what you\u0027d call a coincident, if you like.\" \"I\u0027m very glad it was nothing worse,\" said Mr. Teesdale heartily. \"I made that sure it was you.\" \"You never mentioned it, father?\" said John William. \"No, because I was also quite sure that she would write if we only gave her time. You ought to have written, Missy, and then I\u0027d have gone in and fetched you——\" \"But that\u0027s just what I didn\u0027t want. All this way! No, the \u0027bus was quite good enough for me.\" \"But what about your trunk?\" Arabella inquired. Missy made answer in the fewest words that her trunk was following by carrier; and because Mrs. Teesdale entered to them now, with a pot of fresh tea, Missy said little more just then, except in specific apology for her remissness in not writing. This apology was made directly to Mrs. Teesdale, whose manner of receiving it may or may not have discouraged the visitor from further conversation at the moment. But so it seemed to one or two, who heard and saw and felt that such discouragement would exist eternally between that old woman and that young girl. Milking-time was at hand, however, and Missy was left to finish her tea with only Mr. Teesdale to look after her. John William and his mother were the two best milkers on the farm, and Arabella was a fair second to them when she liked, but that was not this evening. Her heart was with Missy in the parlour. But Missy herself was far better suited in having the old farmer all to herself. With him she was entirely at her ease. The moment they were alone she was thanking David for the twenty pounds duly received at the post-office, and his immediate stipulation that the matter of the loan must be a secret made it also an additional bond of sympathy between these two. They sat chatting about England and Miriam\u0027s parents, but not more than Missy could help. She referred but lightly to a home-letter newly received, as though there was no news in it; she was much more ready to hear how Mr. Teesdale had had the coat torn off his back in rescuing his first home-letters from the tiny post-office of the early days, which had been swept away by the first wave of the gold-rush. Again he spoke of that golden age, and of his own lost chances, without a perceptible shade of regret, and again Missy marvelled; as did Mr. Teesdale yet again, and in his turn, at her tone about money who had been brought up in the midst of it. It only showed the good sense of his old friend in keeping his children simple and careful amid all their rich surroundings; but Mr. Oliver had been ever the most sensible, as well as the kindest of men. The farmer said this as he was walking slowly in the paddock, with a pipe in his mouth and Missy on his arm, and his downcast eyes upon the long, broken shadow of his own bent figure. Missy\u0027s trunk came about this time, but she let it alone. And these two were feeding the chickens together—old David\u0027s own department—when Arabella came seeking Missy, having escaped from the milking-stool a good hour before her time. \"Oh, here you are! Come, and I\u0027ll help you unpack. Mother said I was to,\" said she hurriedly. She was only in a hurry for Missy\u0027s society. So Missy went with her, getting a good-humoured nod from the old man, whose side she was sorry to leave. And David watched her out of sight, smiling his calm, kind smile. \"She\u0027s her father\u0027s daughter,\" said he to the chickens. \"Her ways are a bit new to me—but that\u0027s where I like \u0027em. Mannerisms she may have—I wouldn\u0027t have her otherwise. She\u0027s one of the rising generation—but she has her father\u0027s heart, and that\u0027s the best kind that ever beat time.\" In Missy\u0027s bedroom much talking was being done by Arabella. Her curiosity was insatiable, but she herself never gave it a chance. She wanted to know this, but before there was time for an answer she must know that. One thing, when the trunk was unpacked and its contents put away in drawers, she was left entirely unable to understand; and that was, how Missy came to have everything brand-new. \"Why, because everything was spoilt,\" said Missy, in apparent wonder at the other\u0027s wonderment. \"By that one wave?\" \"Why, of course.\" \"But how did it happen?\" \"Didn\u0027t I tell you? We\u0027d left the window open, and in comes a green sea and half fills the cabin. The captain, he was ever so wild, and, oh my! didn\u0027t he give it us! Of course, all our things were spoilt—me and the other girls. We finished the voyage in borrowed everything, and in borrowed everything I came here the other day. Did you think them things were mine? Not much, my dear. Not much! But I was forced to have things of my own before I could come out here and stay.\" Arabella, sitting on the bed, studied the tall figure with arms akimbo that struck sharp through the dusk against the square-paned window. She was wondering whether the Olivers were such well-to-do people after all. Her own English was not perfect, but her ear was better than her tongue, and the young ladies in the Family Cherub spoke not at all as Missy spoke. Arabella\u0027s next question seemed irrelevant. \"Did you see much society at home, Missy?\" \"You bet I did!\" was the answer, and the fuzzy head was nodding against the window. \"Real high society, like you read about in tales, Missy?\" \"Rather!\" \"Lords?\" \"Any jolly quantity of lords!\" \"You really mean it, Missy?\" \"Mean it? What do you mean? Look here, I won\u0027t tell you no more if you think I\u0027m telling lies.\" \"Missy, I never thought of such a thing—never!\" Arabella hastened to aver. \"I was only surprised, that\u0027s all I was.\u0027Tisn\u0027t likely I meant to doubt your word.\" \"Didn\u0027t you? That\u0027s all right, then. Why, bless your heart, do you think it so wonderful to know a few lords?\" \"I didn\u0027t think they were as common as all that,\" said Arabella, meekly. \"Common as mud,\" cried Missy grandly. \"Why, you can\u0027t swing a cat without knocking a lord\u0027s topper off—not in England!\" Arabella laughed. Then her questions ceased for the time being, and Missy was curious to know how she had impressed a rather tiresome interlocutor, for now in the bedroom it was impossible for them to see each other\u0027s faces. A few minutes later Missy was satisfied on this point. At the supper-table she had no more attentive listener than Arabella, who watched her in the lamplight as one who has merely read watches another who has seen and done, while Missy rattled on more freely than she had done yet before Mrs. Teesdale. Even Mrs. Teesdale was made to smile this time, though she did her best to conceal it. The visitor was in such racy form. \"I may have to go back home again any day,\" she told them all. \"It\u0027ll depend how my mother is, and how they all get on without me. I\u0027ll bet they manage pretty badly. But while I am here I mean to make the most of my time. A short life and a merry one, them\u0027s my sentiments, ladies and gentlemen! So I want to learn to shoot and milk and do everything but ride. I could ride if I wanted to; I learnt when I was a kid; but a horse once——\" She broke off, laughing and nodding knowingly at Mr. Teesdale, who explained how Missy had been once bitten and was twice shy. John William said that he could very well understand it; and he offered to take Missy out \u0027possum-shooting as soon as ever there was a moon. \"Have you ever fired a gun, Missy?\" said Mr. Teesdale; and Missy shook her head. \"P\u0027r\u0027aps you wouldn\u0027t like to try?\" said John William. \"Wouldn\u0027t I so!\" cried the girl, with flashing eyes. \"You show me how, and I\u0027ll try to-morrow.\" \"To-morrow\u0027s Sunday,\" Mrs. Teesdale said solemnly. \"Is your cup off, Miriam?\" It was not, and because the cocoa was too hot for her Missy poured it into the saucer, and drank until her face was all saucer and red fringe. This impressed Arabella. \"We\u0027ll soon teach Missy to shoot,\" remarked Mr. Teesdale, smiling into his plate, \"if she\u0027ll hold the gun tight and not mind the noise.\" \"I\u0027ll do my level,\" said Missy gamely. John William proceeded to assure her that she could not be taught by a better man than his father, whom he declared to be the best shot in that colony for his age. The old man looked pleased, praise from his son being a very rare treat to him. But Arabella had been neglecting her supper to watch and listen to the guest, and now she asked, \"Do the fine ladies shoot in England, Missy?\" \"Not they!\" replied Missy promptly. \"I should like to catch them.\" \"What ladies do you mean, my dear?\" asked the farmer of his daughter. \"Grand ladies—countesses and viscountesses and the rest. Missy knows heaps of them—don\u0027t you, Missy?\" \"Well, a good few,\" said Missy, with some show of modesty. \"To be sure you would,\" murmured Mr. Tees-dale, adding, as his eyes glistened, \"and yet you\u0027ll come and stay with the likes of us! You aren\u0027t too proud to take us as you find us—you aren\u0027t above drinking cocoa with your supper.\" \"What do the lords and ladies drink with their suppers?\" asked Arabella, as Missy smiled and blushed. But the farmer cried, \"Their dinners, she means; I\u0027ll warrant they dine late every night o\u0027 their lives.\" Missy nodded to this. \"But what do they drink with their dinners?\" repeated Arabella. \"Oh, champagne.\" \"What else?\" \"What else? Oh! claret, and port, and sherry wine. And beer and spirits for them that prefers \u0027em!\" \"All that with their dinners?\" \"Rather! I should think they did. The whole lot, one after the other!\" \"What! Beer and brandy and sherry wine?\" Arabella\u0027s incredulity was disagreeably apparent. \"Yes, everything you can think of; but look here, if you don\u0027t want to believe me, you needn\u0027t, you know!\" said Missy, turning as red as her fringe as she stared the other girl full in the eyes across the supper-table. In the awkward pause following John William turned and glared furiously at his sister; but it was their father who cleared the air by saying mildly: \"Arabella, my dear, I\u0027m afraid you don\u0027t know a joke when you hear one.\" Then Arabella coloured in her turn. \"Do you mean to say you were joking, Missy?\" she leant forward to ask; as though she could no more believe this than recent statements. But Missy had given one quick glance at Mr. Teesdale, and then, with a little gasp, had burst into an immoderate fit of laughter. \"Of course I was,\" she cried out as soon as she could speak; \"of course I was joking—you old silly!\"","sourceLink":"http://novel.tingroom.com/jingdian/1600/47521.html","bookId":1252,"book":{"id":1252,"title":"The Unbidden Guest","description":"简介： Arabella was the first at the farm to become aware of Mr. Teesdale\u0027s return from Melbourne. She was reading in the parlour, with her plump elbows planted upon the faded green table-cloth, and an untidy head of light-coloured hair between her hands; l...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1600","creation":"Aug 1, 2019 12:24:43 AM","modification":"Aug 1, 2019 12:24:43 AM"}}
