{"id":97988,"no":16,"title":"Page 16","content":"Aria looked up from the shirt she had been sewing as Jack stepped into the room. She hated sewing, she\u0027d stabbed herself numerous times already, but she needed the shirt. She swore as she jabbed herself again and stuck her wounded finger in her mouth.\n Jack quirked an eyebrow at her. \"You\u0027re not very good at that.\"\n \"I know,\" she mumbled. He rocked slowly back on his heels as he folded his hands behind him. She frowned as she dropped the shirt down. \"What\u0027s wrong?\"\n \"I need to speak with you.\"\n \"Ok.\"\n \"Not here. Take a walk with me?\"\n She wasn\u0027t sure why he would want to take a walk, there was no one around. \"Uh yeah, sure.\"\n Placing the shirt on top of the table, she climbed to her feet and followed him as he led the way out of the house. Braith had gone with Gideon, Xavier, her father, and Daniel to meet with the rebels her father had gathered to fight, to look over the supplies they\u0027d accrued, and to do some hunting. Aria had opted to stay behind, she was tired, and she thought that perhaps it would be a chance for Braith to bond with her family. He hadn\u0027t liked it in the beginning, but Jack and Ashby had agreed to stay behind.\n Ashby was standing by the woods when they emerged from the house. Remorse radiated from his eyes as he fell into step beside them. She glanced between the two of them, suddenly feeling very small and vulnerable. Why hadn\u0027t she grabbed her bow? She shook off the crazy thought. This was Jack and Ashby, they wouldn\u0027t hurt her.\n \"What\u0027s going on?\" Neither of them answered her. Aria became aware of the pounding of her pulse in her ears. \"Jack?\" She was ashamed of the tremor in her voice.\n \"Just going for a walk Aria, we have to talk.\"\n \"About what?\" He didn\u0027t answer her. She stopped abruptly, refusing to take one more step until she received some answers. \"About what?\" she demanded.\n \"The lake is just ahead, ok?\"\n Aria bristled at his placating tone. She almost refused to move further, almost turned around and walked away. She was certain she didn\u0027t want to hear what they had to say. She knew she couldn\u0027t run away though. \"Fine,\" she relented.\n Aria fell back as Jack led the way to a pristine lake. She stood for a moment, taking in the scene before her as it spread out in a glimmering array of sunshine and blue. Something inside of her chest eased, she took a deep breath, inhaling the fresh scent of the crisp water. Forgetting all about Jack and Ashby, she took a step closer to the water. She itched to dive into it, to swim out as far as she could and simply be.\n The clearing of Jack\u0027s throat alerted her to the fact that was not going to happen. Sighing impatiently, Aria turned to him. \"What do you want to talk to me about?\"\n Jack and Ashby exchanged a look, but it was Jack that spoke. \"Braith.\"\n Aria folded her arms over her chest as she studied them both. Ashby could barely meet her gaze; his eyes darted continuously away from her as if he were ashamed. There was a hollow pit in her stomach; it felt as if a rock had settled in there. She could barely breathe anymore. No, she definitely was not going to like this. \"Perhaps you should talk to him then.\"\n \"I\u0027ve tried, and so have Ashby, and Gideon. He needs to lead Aria.\"\n Her heart hammered, coldness was seeping into her bones, stealing into her soul. \"He does,\" she agreed.\n Jack shifted nervously. \"You know I love you Aria, I think of you like a sister.\"\n \"Just say it Jack.\"\n \"You have to let him go.\" She felt as if she\u0027d been punched in the gut. She had braced herself for those words, had even suspected they were coming, but they still knocked the air from her. She was unable to stay upright as she rested her hand on a tree and leaned against it. \"Aria...\"\n She held up a hand to stall him. She needed a moment, just one moment to gather her thoughts and hold back her tears. She\u0027d suspected all along, no she\u0027d known, that this was a distinct possibility. That in the end, she would have to give him up, that she would have to leave him, again. She just wasn\u0027t ready to hear it confirmed by someone else.\n Ashby, looking to soothe her reached for her shoulder. She pushed his hand away, unable to take his pity at the moment. \"Braith feels that when this is over he can simply walk away. That he can take you, disappear, and never look back. He thinks that he can leave Gideon, Ashby, or even I in charge. We know that he can\u0027t, and I think you know it too.\"\n Aria lifted her head. She had to blink away the tears burning her eyes to focus upon him. \"Our family line is the strongest, it always has been. Our bloodline has been traced back to the first vampire, it is the only line that can claim such a feat, and actually prove that it\u0027s true. It wasn\u0027t often that our line wasn\u0027t ruling, and as you\u0027ve witnessed, even the most powerful vampires on our side have turned to Braith as a leader.\"\n She stared silently at the lake, felt the rough bark of the tree beneath her hand. She needed these things to connect her, to join her to the earth. She felt completely disconnected right now, disjointed and broken. \"Since the moment he was born it was expected that Braith would rise to power if our father died. He\u0027s been groomed for such an endeavor, trained for it; he is the one that can control the chaos that will follow the dethroning of our father. Even those within the palace, the non-aristocrats will follow him, because that\u0027s what they expected to do for the past nine hundred years. Nine hundred years Aria, that is how long it has been accepted that Braith would eventually rule.\n \"They won\u0027t follow me in the same way, and to be honest I can\u0027t control them the way that Braith will be able to. It\u0027s not in me, it never has been. They will look to destroy me in a way that they will not look to destroy Braith. Nor will they follow Ashby. He\u0027s not a part of our line and even if he marries Melinda, they will not accept him, and Melinda isn\u0027t strong enough to rule. Gideon is Braith\u0027s other option. But Gideon has been gone for a hundred years, and he has no tie to our line. He\u0027s not even a part of the second most powerful family, he is simply older than the rest of us, only a mere fifty years younger than Braith.\"\n They spoke of fifty years as if it were nothing; to her it was a lifetime. \"Xavier? Saul?\" she managed to choke out. \"Calista or Barnaby?\"\n \"Xavier is a record keeper; he prefers to loiter in the shadows. Most see Saul as weak due to his defect, and the others are mere children. The oldest is Barnaby and he\u0027s barely three hundred. They can\u0027t take control.\"\n \"The second most powerful...\"\n \"My mother\u0027s line,\" Jack said flatly. \"My father had all of them destroyed in order to ensure they would no longer be a threat. He also decimated the third, fourth, and sixth in line. He eradicated any one he deemed a possible threat.\"\n \"The fifth?\"\n \"Gideon.\" The lump in her throat was threatening to choke her. \"Ashby is part of the seventh, as is his cousin who has remained in the palace. He has stepped into what should have been Ashby\u0027s role, assuming power as my father\u0027s second in command.\"\n Ashby scowled, showing some emotion other than pity for the first time. \"Coward,\" he muttered.\n \"I\u0027m sure Braith understands this,\" she whispered.\n \"He does understand it,\" Jack confirmed. \"But to him, you are the only thing that matters. He\u0027s stubborn Aria, he thinks that the vampire lines will accept one of us in place of him, as will the people, but he\u0027s wrong.\"\n She didn\u0027t realize she was crying until a drop landed upon her hand. She wiped the tears hastily away, hating herself for crying in front of them. \"We can\u0027t convince him to let you go, and we can\u0027t convince him to try and change you. Our people might accept you then; it\u0027s a rare feat for a human to survive the change. They may not embrace you with open arms after, but they won\u0027t deny you either, and the ones that did would be few.\n \"He is unwilling to realize these facts, but you need to.\" A sob escaped her. She shoved her fist into her mouth, trying to stifle her cries as something inside of her began to break. \"It\u0027s for the greater good Aria. Think of the people, your people that will be freed. The future generations that will never know the fear and oppression that you have known. Think of the fact that they will not know starvation, filth, and enslavement as you have known it; as Max has known it.\"\n Max, oh Max. His time as a blood slave had destroyed him. It had taken a proud, vibrant man and turned him into someone filled with hate and bitterness. It had broken him, as it had broken so many others before they were mercifully destroyed. Then there were the ones that never made it to blood slave status. She recalled the boy she\u0027d been captured with, so young and vulnerable. He\u0027d been selected for death.\n \"Oh.\" Her legs gave out; she slid limply to the forest floor. \"Oh.\"\n \"He believes that he can make everything alright in the end. It\u0027s not possible Aria.\" Jack\u0027s tone had become softer, she could hear the ragged pain in it, but it was nothing compared to the anguish savaging her soul. \"We need for you to agree to leave him when this war is over.\"\n She knew it was the right thing to do, she knew it was the best thing for everyone involved, even if it destroyed her and Braith. But even so, hope flared hotly through her as she realized something. \"But that\u0027s not possible!\" she blurted. \"He can track me anywhere, his blood is in me; we are bound in that way. Ashby said I\u0027m his bloodlink, that we can\u0027t live without each other.\"\n \"You have started the bond, but it\u0027s not complete, is it?\"\n \"No, but...\"\n \"As long as you don\u0027t allow it to be completely forged there is a chance that the bloodlink will not destroy either of you. As for his blood in your system, we\u0027re hoping that if you don\u0027t accept it again his blood will thin out and eventually leave your system.\"\n \"I was gone from the palace for over a month and he still found me.\"\n Jack and Ashby exchanged a look. \"We think that if another vampire\u0027s blood is added to your system, most likely mine, it may dilute his enough so that he won\u0027t be able to track you for long, if at all.\"\n She recoiled; revulsion filled her, nausea surged up her throat at the mere thought. She was shaking her head no when Jack bent and grabbed hold of her shoulders. \"Aria...\"\n \"He\u0027ll die without me,\" she groaned. She didn\u0027t add she would die without him, she was dying now, and though she would continue to move through her days, she knew she would never live again, not without him.\n \"Maybe not, if the bond isn\u0027t completely forged.\"\n The noise that escaped her was guttural. \"He went berserk when I left him last time.\"\n \"We hope that having so many lives in his hands will help to keep him in control. He didn\u0027t have that responsibility before. No matter how upset and furious he is, we\u0027re hoping that the good in him will win out because of that.\"\n \"That\u0027s a lot of hoping.\"\n \"It\u0027s all we have, and one day, you will die Aria. Your death may sever whatever bond remains between you at the time, freeing him.\"\n Freeing her also, she realized as she bent over, her arms wrapping around her stomach. \"He will be blind again.\"\n \"He will, but he was blind for a hundred years before you, it never slowed him down. The world was dark to him, but it was not a weakness for him. Ashby, Melinda, Gideon, and many others will be there to protect him.\"\n She almost laughed at the mention of Ashby, the one who had blinded him to begin with, but there was no humor in her. It was all too awful to even remotely be funny. \"I know this is a lot to ask of you Aria, I know that you are young and in love, but...\"\n \"Stop,\" she whispered.\n Ashby clasped hold of her hands as he knelt before her. She almost jerked away from him, but the tears in his bright green eyes held her immobile. He was actually crying, not for himself, but for her. \"Jack doesn\u0027t understand what you\u0027re going through; I know that, you know that, but I understand. I couldn\u0027t do this; I couldn\u0027t let Melinda go if someone asked me to. She is everything to me. No matter what they did to me it didn\u0027t matter as long as she was safe, and alive. I am so unbelievably sorry, I cannot...\" his words broke off as tears slid down his cheeks. \"I cannot imagine and I do not want to imagine your pain or his. It\u0027s not fair, I know.\"\n His tears were her undoing. She wept as she fell against him, finding no solace in his arms. There would never be any comfort again. She was unable to regain control as Ashby rocked her, his tears mingling with her own. Jack stood away from them with his shoulders set stiffly, and his jaw locked as he stared into the dense forest.\n Slowly, her sobs started to subside simply because there was no water left inside her to shed. Ashby continued to hold her, but he didn\u0027t pretend that anything he offered would do her any good. Braith\u0027s sense of rightness would prevail, she was sure of it. He may become irrational and explosive when she left, but she had faith that his good would win out in the end.\n \"There\u0027s more Aria.\" She could barely lift her head to look at Jack, never mind hear more of what he had to say. \"He can\u0027t know about this. You have to act normal around him.\"\n Horror filled her. \"You mean we\u0027re not leaving now?\"\n \"No. He\u0027ll tear these woods apart looking for you rather than fight. You can\u0027t leave until the war is over and he\u0027s been established as the leader. He has to realize he has a duty to thousands upon thousands rather than just himself and you.\"\n \"My family?\" she whispered.\n \"Your father will be informed of our intentions when the time is right, he will not be able to leave though.\" So she would never see him again either. She\u0027d thought she didn\u0027t have any more tears left in her. She was wrong as agony clenched at her. \"Daniel will also have to remain behind as your father\u0027s second in command and most likely successor, but I think William will go with you.\"\n She nodded slowly. Yes, William would come with her, even if she told him to stay and enjoy the life that he was going to fight for, he would come with her. \"And I think he should, even if you don\u0027t. I will also be going with you.\"\n Aria blinked at him in surprise. \"You can\u0027t leave him, Jack.\"\n \"I can\u0027t leave you either, not unprotected...\"\n \"William...\"\n \"You will need more than just William. Braith is going to look for you and we will have to get far from him as fast as we can. I\u0027m asking this of you, and I will follow it through with you.\"\n \"And return after I\u0027m dead?\"\n Jack shook his head. \"No, I will never return. Even if time and distance ease his suffering and rage, he will still kill me if I return.\"\n Aria bit on her lip, her head bowed, she felt as if she were being crushed. She couldn\u0027t find the right words, not anymore. Ashby rubbed her hair in an awkward attempt to soothe her further.\n \"I know it\u0027s going to be difficult Aria but you have to act normal around him.\" She blinked up at Jack; her lashes were sticky from the tears coating them. \"If he suspects anything he\u0027ll take you and he\u0027ll never look back.\"\n \"I don\u0027t know how I\u0027m going to do that.\"\n \"I know this is a lot to ask of you, I understand that I can\u0027t fathom what you are going through, what you will have to endure, but you are one of the strongest people I know, human or vampire, and I know that you can do this. I have absolute faith in you.\"\n She was glad someone did, because she sure as hell didn\u0027t. Not about this. How on earth was she going to act normal around Braith? How the hell was she going to hide her misery and pretend that everything was fine, when her heart was shattering and her body was already aching with loss? How was she going to look him in the eye knowing that she was going to break his heart by leaving him again?\n He would never forgive her. Even if it was for the best, even if it was for the good of so many, he would never get over her abandonment of him again. He would hate her. That realization was even worse than their time together coming to an end.\n \"He\u0027ll never forgive me either,\" she whispered, giving voice to her thoughts. \"What if you\u0027re wrong? What if he loses it completely?\"\n \"Then we\u0027ll deal with the consequences of that when it happens. Whether we bring you back or he steps down...\"\n \"People could be killed before then.\"\n \"I don\u0027t think he\u0027ll go that route again Aria. Last time he was confused. He didn\u0027t know what was going on inside himself and his pride wouldn\u0027t let him go after you. This time he\u0027ll know, and once he calms down he\u0027ll understand that this is for the best. You\u0027ll leave him a note...\"\n \"A note,\" she laughed humorlessly, as if that would be enough. As if a simple piece of paper would be enough to convey her regret over leaving him. How could she put her sorrow into words? How could she possibly write down how much faith she has in him or how she knows that he will be the best leader for all those depending on him? She didn\u0027t think they had enough paper for that. Even worse, Jack would have to write it for her.\n \"And he\u0027ll come to realize that though it\u0027s not fair, it is for the best. For everyone.\"\n \"Maybe they would accept me,\" she whispered.\n \"I\u0027m sorry Aria,\" Ashby squeezed her shoulders, pulling her against him. \"But that will never happen. Saul and Barnaby have already inquired about your relationship. Braith believes he can keep the true nature of your relationship from them, but they will eventually figure it out. They\u0027re on our side for now, but human and vampire bloodlines are not to be mixed, the children are shunned if they are human, tormented if they\u0027re not...\"\n \"Children?\"\n \"It never ends well for them Aria,\" Jack told her.\n \"There have been children?\" she demanded stunned by this revelation.\n \"Yes, though if it is a blood slave carrying the child, she is usually killed before she can give birth.\" Horror shuddered through her body, her hand instinctively rested on her stomach. \"The vampire children that have been created are relegated to a life nearly as bad as the human servants within the palace. I wouldn\u0027t be surprised if there aren\u0027t a good number of half-breed vampire children amongst the troops in that cave; a lot of them left soon after my father took over.\"\n \"Children,\" Aria breathed awed by the possibility. She had never given much thought to children, she\u0027d assumed she probably wouldn\u0027t live long enough to have them, and she certainly didn\u0027t want them exposed to the hardships of her life. She hadn\u0027t thought a child with Braith was even a possibility, but now...\n Jack knelt before her. \"You cannot allow your relationship to progress Aria.\"\n Everything inside her shriveled up like a plant without water. Fresh tears fell. It had all been right there in front of her: happiness, security, a family. And now it was gone, all of it, just gone. She felt empty.\n Jack took hold of her cheeks, cradling them. \"I\u0027m sorry. I know this is a lot to ask of you, and this isn\u0027t fair, you deserve a happy ending, you both do, but...\"\n She grasped hold of his hands, squeezing them firmly as she leaned toward him. \"But so do many others... I know... I get it,\" she whispered.\n Jack\u0027s steel gray eyes were intense. \"That\u0027s not what I was going to say. You know well enough that the world isn\u0027t fair, that bad things happen to good people but you\u0027re the only one that can do this.\"\n She released his hands and looked away. The lake shimmered in the light of the sun, it was beautiful, but she found no joy in it. She didn\u0027t think she\u0027d find joy in anything for a long time if ever again. She didn\u0027t know how she was going to do this but she knew she had to. Jack was right, Braith had to lead. He was strong, he was powerful, he was bred for leadership and they would all follow him.\n Jack leaned back as he studied her. \"Aria?\"\n She turned slowly toward Jack. \"I\u0027ve always done what\u0027s needed to be done, as has Braith. I\u0027ll do it now, and he will do it when I\u0027m gone. I don\u0027t know how I\u0027ll do it, how I\u0027ll pretend everything is fine, but I\u0027ll figure it out.\"\n Jack grimaced as he closed his eyes. For the first time Aria realized a part of him had hoped she wouldn\u0027t agree, that she would absolutely refuse to go along with it. That she would go back to Braith and not care about the consequences of her actions. Jack didn\u0027t want to be the one to inflict this pain on his brother, or her, but now that she had made her choice, his road had been mapped out for him too. For the first time since he\u0027d brought her out here she didn\u0027t see him as her enemy, as the person who had just ruined her life, but more of an ally in her despair.\n \"I\u0027m sorry,\" Ashby apologized.\n Aria had no idea how she was going to deceive Braith in such a way, but hopefully their lives would continue to be as hectic as they had been and he wouldn\u0027t notice if she was a little distant.\n \"We should return,\" Jack said.\n She hated the idea of going back, but she couldn\u0027t hide here forever, and as of now Braith could still track her anywhere. It was possible that he would always be able to do so. Jack hoped that there was a way to dilute Braith\u0027s blood but she wasn\u0027t so certain. She knew full well that Braith\u0027s blood was a part of her now. Perhaps someone else\u0027s blood could alter that, but she didn\u0027t see how.\n She started to share her thoughts with Jack but stopped herself. She knew she had to leave Braith, but it may be impossible for her to ever truly separate from him. There was nothing that Jack could do about that, or at least nothing that he would do. Jack was willing to take this road with her, willing to give up his old life for good, but if it became necessary he would not do the one thing that may be required to truly separate her and Braith.\n He was like a brother to her and he was almost as stubborn as Braith. If she told Jack what she was thinking, he would only insist that someone else\u0027s blood would be enough to dilute Braith\u0027s within her, enough to separate them, even if it wasn\u0027t.\n Jack would not consider the fact that there may be only one way to truly sever her bond from Braith. But she knew someone that would. \n","sourceLink":"https://allnovel.net/refugee-the-captive-3/page-16.html","bookId":2166,"book":{"id":2166,"title":"Refugee (The Captive #3)","description":"Storyline: \n Refugee (The Captive #3) \n Whispers, rumors, and horror stories abound about The Barrens and the strange creatures that lurk within them. Determined to find the remaining vampires that stood against his father in the war, Braith knows that it’s dangerous to enter the inhospitable land, but that they must if they are to have a chance at gaining allies to help overthrow the king. Though he once knew the powerful vampires that are rumored to reside within The Barrens, he is unsure what to expect if they succeed in finding them. He will do whatever is necessary though to ensure a future for himself and Aria. \n Aria is fearful of entering into the land she’s heard nothing but cautionary tales about, but she’s determined to help Braith locate the vampires that may help them with their cause. She is fascinated and amazed by the world they uncover within, one that is unlike anything she has ever seen before. However, the more immersed they become in a world that she doesn’t entirely understand, the more she realizes that it won’t be the war, or even the king that will eventually tear her and Braith apart. \n It will be her.\n \n","cover":"https://allnovel.net/images/refugee-the-captive-3.jpg","author":"Erica Stevens","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/refugee-the-captive-3.html","creation":"Oct 5, 2019 8:58:25 AM","modification":"Oct 5, 2019 6:30:31 PM"}}
