{"id":97977,"no":5,"title":"Page 5","content":"\"What did Gideon send you for?\" Braith grated from between clenched teeth. The woman\u0027s smile widened, she provocatively stuck a hip out as she grinned at them. \"What do you think?\" she taunted as she pushed her hair back to reveal her slender, unmarked neck. \"I was instructed to provide you with anything you might require, and then bring you to him afterward.\" She ignored Aria with an ease that was astounding, and infuriating, as her gaze wandered lustfully between Braith and Ashby. \"You can take us to him now.\" The woman was taken aback, her eyes finally focused on Aria for a brief moment before she shook her head, obviously finding nothing remarkable in her. Aria was half tempted to hit her. \"Braith,\" Ashby hissed. \"If you\u0027d like to feed from her go ahead.\" Braith\u0027s words were clipped and harsh. His body vibrated with tension. Ashby was staring at him as if he\u0027d lost his mind. \"Do what you must, but do it quickly. I plan to leave before nightfall.\" Braith turned away, leaving them staring questioningly at his retreating back as he moved deeper into the dwelling. Aria remained unmoving, dismayed by what had just happened. \"Aria.\" She couldn\u0027t turn her head to look at Ashby, couldn\u0027t bring herself to meet his gaze as she stared at the doorway Braith had disappeared through. \"Aria you have to talk to him.\" Finally she was able to look away long enough to meet Ashby\u0027s fevered gaze. \"He needs to feed Aria, he\u0027s weakening and he\u0027s becoming more unbalanced. Giving you his blood drained him further. He needs this Aria.\" She managed a small nod as she slowly closed her mouth. \"He has to understand that you can\u0027t be his only human supply, it\u0027s not possible.\" He was right, she knew he was right, but it caused a physical ache in her chest to even think about another woman nourishing Braith. \"I don\u0027t like to do it either, it\u0027s most certainly not something I enjoy, but I must, and so must Melinda. Maybe if there were more animals around and you hadn\u0027t been wounded it would be different. He\u0027s not going to put up much of a fight if he\u0027s malnourished, he\u0027ll get injured.\" It was those last three words that spurred her forward. She had to go quickly, or she wouldn\u0027t go at all. If she stopped to think about it...well no, she couldn\u0027t think about it. She just had to focus on getting him to feed, getting him strong again and making sure that he didn\u0027t get hurt. She found him outside, leaning against the house, his arms folded over his chest and his legs crossed before him. \"Braith.\" She broke off, unable to get the words out as her chest and throat constricted. It took her a few tries before she was finally able to speak. \"Braith you must.\" He kept his head bowed, refusing to look at her. \"Braith...\" \"And you would approve of this?\" She swallowed heavily; her eyes burned. She tried to tell herself it was from all the sand and dust, but she knew it was from the tears she was struggling not to shed. Not in front of him anyway, not if she had any hope of convincing him to do this. \"I don\u0027t like it.\" She hedged, unable to lie to him. \"But you\u0027re weakened, and you need blood. If it can\u0027t be mine...\" \"Then it will be no one\u0027s.\" \"You can\u0027t deny yourself. You need it to survive.\" \"I need you more.\" \"Braith...\" \"I\u0027m not arguing with you on this Arianna. It won\u0027t do any good anyway.\" She started in surprise. \"Of course it will.\" He lifted his head and finally looked at her. \"No Aria, it won\u0027t. Yours is the only blood I crave. None of them, none of those blood slaves after you satisfied me.\" The words were almost purred; they caused the hair on Aria\u0027s arms to stand up. \"Then take mine.\" His nostrils flared and though she had sensed his interest in the woman, it was nothing compared to the blast of hunger that vibrated from him now. Her mouth went dry. She thought self-preservation should kick in, that she should run screaming back into the house and away from him, instead she found herself wanting to run to him. She was losing her mind, and it was all because of him. \"No.\" She inhaled deeply, straightened her shoulders and thrust out her chin. \"If you\u0027re going to be stubborn about feeding from others, then you can\u0027t be stubborn about this. You don\u0027t have to take much, just enough...\" \"It\u0027s never enough!\" he snapped. \"That\u0027s what you don\u0027t understand. It\u0027s never enough. Every time I taste you I think maybe my thirst for you will weaken, that maybe it will ease, and I won\u0027t crave you so badly. But the yearning only increases and I find myself insatiably craving more and more.\" She was stunned speechless. She hadn\u0027t known, she hadn\u0027t understood, she couldn\u0027t understand, not as a human anyway. But she did know one thing, he needed nourishment, he was stubborn, and she was here. Without thinking, she pulled at the knots on her arm as she stalked toward him. The cloth fell free, exposing the gashes as she thrust her arm out to him. Yes, she had completely lost her mind, tempting him like this, but there were some things that needed to be done, even if he couldn\u0027t see that. His weakness could get them all killed, it could get him killed. Her life was a small thing compared to their far greater goal, and the lives of so many others. \"You being unable to fight won\u0027t do us any good. I will not stand by and watch you starve yourself because you think you will hurt me. You will not hurt me. It\u0027s either me or her Braith.\" Though shadowed by his glasses, she knew his eyes were latched onto her arm, and the droplets of blood that glimmered on her skin. \"Either way I upset you Aria,\" he grated. \"I am offering my blood to you and so is that woman. You have to pick one.\" She tried to keep her face impassive, tried to control the beat of her heart as she stared stubbornly up at him. She couldn\u0027t reveal how much it would upset her if he went to that other woman, it would only stop him if he knew, and he couldn\u0027t be stopped. Not this time. He clasped hold of her wrist, his long fingers gentle as they wrapped around her. He could kill her; with a simple flick of that hand he could kill her so easily, but he would kill himself before he ever injured her. She waited breathlessly to see what he would do, as ever so slowly he bent his head and licked the blood from her arm. A shiver raced down her spine, her breath was frozen inside of her as he pressed his lips against the inside of her elbow and rose slowly over her. She thought that she had won, that he was conceding defeat as he brushed the hair back from her neck. His fingers lingered upon his marks still on her skin, pressing ever so briefly against them. Then his hand entwined in her hair as he rested his forehead against hers. \"You really are reckless,\" he muttered. She managed a wan smile as he kissed the tip of her nose. \"And you are stubborn.\" \"Soon,\" he said tenderly. \"When you\u0027re stronger...\" \"The woman.\" \"When you are stronger. Let this go, it will not happen.\" Aria gave the battle up on a sigh. She leaned into him, simply enjoying the feel of him as they stood together in a stolen moment of peaceful silence. He was starving, simply on fire with the necessity to feed. His veins felt as arid as the desert surrounding them. His body was sore, muscles he hadn\u0027t known he had burned from the blaze licking through them. It was shear willpower that drove him forward now. He should have fed, he knew that, he needed it so badly right now but he\u0027d sensed Aria\u0027s unhappiness, sensed her anguish over the idea. She wouldn\u0027t deny him the woman, she would understand, but he couldn\u0027t bring himself to do that to her. Instead, he was walking a thin line, bordering on complete loss of control. He was becoming even more of a threat to her with each passing moment. It didn\u0027t help that Ashby looked far better than he had before. The color was back in his face and the spring was back in his step. He was whistling merrily, and annoyingly, as they followed the woman across the desolate landscape. The woman was a little paler but appeared otherwise uninjured. He could smell the fresh blood from the bites on her inner wrist, but it was nowhere near as sweet and potent as the scent of Aria\u0027s blood on the rags covering her arms. She was wearing William\u0027s cloak now, the hood pulled over her bent head shadowed her features and hid her hair. He felt that simply touching her might help to ease the fire inside him, but he didn\u0027t dare touch her in front of the woman that obviously held some loyalty to Gideon. Gideon may very well have been one of the strongest, and most human rights friendly aristocrats that Braith had known before and during the war. He\u0027d fought adamantly against the enslavement of the humans, but Braith had no idea what a hundred years of living in these Barrens had done to him. He wasn\u0027t entirely certain what to expect from Gideon, but Braith sure as hell wasn\u0027t going to alert Gideon to the fact that Aria was his biggest weakness. Not until he knew if he could trust the once powerful aristocrat. They rounded the top of another dune and like a beautiful mirage a town came into view. Heat rose from the sand in waves that made everything shift and blur. But the town was there, green and lush for as far as the eye could see. \"How is this possible?\" Awe laced Aria\u0027s voice as she gazed over the town. \"At one time all of these lands were lush and fertile.\" Braith forced the words out. \"It was the war itself that left everything so desolate. Gideon must have found a water supply out here, probably deep within the earth.\" \"Amazing, simply amazing,\" she whispered to herself. He gazed at her for a moment before turning his attention back to the town before them. There were already vampires lining the streets, waiting for them as they moved down the dune and onto the main thoroughfare. For a moment he hesitated. He should have fed. It was too soon for Aria, and the thought of feeding off the woman was enough to make his stomach turn, but he was in no condition to fight if that was what this became. Aria went to touch him, but her hand fell limply back to her side. He almost grabbed hold of her hand to make it abundantly clear that she was off limits to everyone in this town. He didn\u0027t want any more talk of someone possibly buying her, or her brother. However, he also had to keep her alive and there was no way to know what they were walking into. He shouldn\u0027t have brought her here, but in the end there had been no choice. They would need help if they were going to take down the king, and there was no one that hated the king more than the aristocrats that had stood against him during the war. Aristocrats that had power and followers of their own, or at least they used to, and judging by the growing crowd, they still did. The people and vampires all appeared healthy, the buildings were in good repair, and it was obvious that they had established some sort of unbiased system here as human and vampire stood side by side. There was astonishment on some of the faces surrounding them, a couple of which he vaguely recognized from the years before the war. They were almost to the end of the street when a figure separated themselves from the crowd. Braith\u0027s growing need for blood diminished under the shock of seeing a face he had never thought to see again. Uneasiness twisted through his gut. It took everything he had not to grab hold of Aria and shove her behind him, but though there was no surprise on Gideon\u0027s features, there was also no hostility. \"Braith,\" Gideon greeted blandly. Braith stepped in front of Aria as Gideon\u0027s gaze slid over them. He didn\u0027t miss the flicker in Gideon\u0027s hazel eyes as his attention momentarily focused upon Aria and William before moving swiftly away. His eyes gleamed with amusement as they landed on Ashby, and a disbelieving smile curved his thin lips. He shook back his light brown hair and studied them over his hawkish nose. \"Well, if nothing else, it looks as if I\u0027m in for an interesting story. Come along.\" They followed silently behind as Gideon led them down the streets and into a home that, while it was not opulently furnished, was appointed nicely. Aria pressed closer to him as her horrified gaze slid over the brutal scenes of death and violence depicted on the numerous canvases lining the walls. It was the first time he sensed any true fright from her as she fidgeted nervously with her hands. This was a world she didn\u0027t understand and probably never would. \"Are those human?\" William\u0027s eyes were narrowed as he stared at a shelf displaying jars full of teeth. \"Some,\" Gideon replied flippantly. \"Others are vampire.\" William looked horrified as his head turned slowly toward Gideon. Aria\u0027s lips parted, a small breath escaped her as her hands pressed against her belly. Even though she\u0027d worn a hood throughout most of their journey the sun had still caught her face and reddened her cheeks and nose. At the moment she was deathly pale beneath her sun kissed skin. \"Why?\" she breathed. \"Souvenirs,\" Gideon answered with a negligent shrug. Aria took a small step back. She looked ready to bolt as her gaze darted wildly around the room before landing on her brother and the jars. \"Don\u0027t look at them,\" Braith told her. She couldn\u0027t seem to stop looking at them though, as her eyes were riveted upon them. \"Souvenirs of what?\" William demanded more angry than mortified. \"Better times.\" \"Gideon,\" Braith hissed. Gideon met his gaze head on. \"This is my home Braith, you came here. I won\u0027t put on airs for two humans that you\u0027ve brought along as your food supply.\" Braith bristled, his hands fisted at his sides. Aria tugged on his shirtsleeve as she shot him a reproving look. Gideon rested his fingertips on his desk as he pinned Ashby with his unyielding gaze. \"Some of us didn\u0027t exactly enjoy the war, or the outcome, right Ash?\" Ashby shook his head, his lip curled in distaste. He hated to be called Ash, he always had, always would. \"Whatever you say, Giddy.\" \"Did you enjoy my gift?\" Gideon inquired, refusing to acknowledge Ashby\u0027s dig at him. \"Was she to your liking?\" \"She was fine,\" Ashby answered absently. \"How did you know where we were?\" Gideon grinned at him, his fingers bounced lightly on the desk as he pushed himself off of it. \"I have eyes all over these lands; a man in my position must always be alert. So, to what do I owe the honor of the heir apparent and the fallen brother-in-law coming into my humble town?\" \"We\u0027ve come to gain your support,\" Braith informed him bluntly, knowing that Gideon didn\u0027t do well with subterfuge. Gideon was thoughtful, his eyes doubtful and questioning as he frowned at Braith. For the first time he didn\u0027t appear even faintly amused or smug. In fact, he seemed almost hopeful. \"Support for what?\" \"To overthrow the king.\" Gideon released a low curse; his fingers stopped their incessant moving as he leaned forward. \"You\u0027re serious.\" \"I am.\" Gideon was speechless, he gawked for a moment. Then his jaw snapped closed, his nostrils flared, and his dark eyebrows drew sharply together as his focus became riveted upon Aria. He came out from around the desk, striding forcefully toward her. Braith instinctively stepped in front of her, pulling her back as Gideon reached for her. \"Don\u0027t!\" Braith snapped slamming his hand into Gideon\u0027s chest and knocking him back a step. Ashby seized hold of Gideon\u0027s upper arm when Gideon lunged at Aria again. \"Are you an idiot?\" Ashby demanded. \"Let go of me,\" Gideon snarled as he shoved Ashby\u0027s hands away. Braith widened his stance, bracing himself for Gideon as the vampire spun back on them. He was prepared to kill the man they had come to seek help from. Gideon\u0027s eyes were fevered as they raked Braith from head to toe. Aria\u0027s head popped out from around him, the hood had fallen back from her face to reveal her cascade of auburn hair and the paleness of her features. Braith was afraid to take his focus off of Gideon for even a moment to pull her hood back up. \"You can see,\" Gideon said in amazement. Braith remained silent, he wasn\u0027t going to respond to him, wasn\u0027t going to relax until Gideon moved away from them. \"And it\u0027s because of her.\" \"Gideon,\" Ashby cautioned. \"You did not feed from my gift.\" \"We are not here to discuss this,\" Braith informed him. \"Have you lost your mind!?\" Gideon exploded. \"She\u0027s a human Braith.\" \"We are not here to discuss this!\" Braith roared trying to control his rising temper as Gideon focused on Aria again. \"This topic is off limits, for now,\" he amended, knowing that it would have to be addressed one day, but not today. Gideon stalked back to his desk. \"I should just have you all killed now,\" he muttered. \"Save myself the aggravation.\" Fury boiled through Braith at the mere thought that Gideon might do something to one of them, to her. It took everything he had not to leap over the desk and beat Gideon into a bloody pulp, but beating him senseless, or just flat out killing him, wouldn\u0027t do any of them any good. \"If you think you could,\" Braith grated. Gideon glared at him. \"You\u0027re in my world now Braith, I rule here!\" \"And just what do you rule?\" Braith demanded. \"Some brothels and bars, farms, a trade ring, a smuggling business? You rule nothing Gideon. This is a poor substitute for the life you used to have and you know it. With your help Gideon, we may be able to get that life back for you. But don\u0027t think I won\u0027t destroy you if you try to harm one of us. You don\u0027t have to help us, but you will not threaten us.\" Gideon turned slowly back toward Braith, but it was not Braith he focused on. His fascination with Aria was pushing Braith closer and closer to a deadly precipice. \"What is it that you require?\" \"You must still have friends; you must have stayed in contact with the other collaborators that were against my father.\" Gideon grunted in displeasure and slid into the chair behind his desk. \"I may still have contacts, but what exactly is your plan here Braith? What do you propose?\" \"To take control from my father.\" Surprise flickered briefly over his features. \"And you are going to lead? You are going to be the man that rights the wrongs?\" Gideon\u0027s tone was sarcastic, almost hostile as his gaze focused on Aria again. Braith pressed Aria against the wall, pinning her against his side. Her displeasure was obvious as she tried to push away but he was not going to let her out. \"It doesn\u0027t have to be me.\" Gideon motioned to someone behind them. Aria inhaled sharply as a servant girl hurried passed them wearing almost no clothing. Bite marks marred her neck, but she didn\u0027t seem overly used as she flashed a smile at Braith and Ashby before bending to pour a glass of liquor for Gideon. Gideon smiled at her and lifted the glass in salute. \"Thank you Dara, my friend here might like to meet with you later.\" \"Anything he desires,\" she replied with a saucy smile that lingered on Braith. Aria shot the girl a dark look that would have amused Braith at any other time. Right now though, he was too hungry and too tense about this situation to find anything humorous. \"I\u0027m fine Gideon,\" Braith grated. \"Oh not you Braith, I can tell you\u0027re not relinquishing your meal anytime soon. I meant Ashby.\" \"I\u0027m fine also,\" Ashby assured him. \"Oh well then, perhaps the young human, he seems rather interested.\" William closed his mouth as he ducked his head and blushed just as vibrantly as Aria suddenly did. Her discomfort was nearly palpable as her fingers curled into his shirt. Braith hated this, hated that she had to be in this awful place, exposed to some of the worst forms of debauchery he knew. But for all of his numerous faults and all of his sinful tastes, Gideon was a strong vampire and a natural leader. At his core he was not an evil being. It wasn\u0027t easy to discern that at first glance but Braith had known Gideon for a lengthy amount of time. He knew what resided inside of Gideon, or at least what had resided inside of him. If Gideon was anywhere near the vampire he had once been than this servant girl was here willingly and was not abused. \"Gideon...\" Braith started. \"Perhaps I can even introduce him to some of the things that we used to enjoy,\" Gideon continued as if Braith hadn\u0027t spoken. He idly twirled his goblet and watched Aria intently as he weighed her reaction to his words. \"Or perhaps you would like me to teach her. That is, of course, unless you haven\u0027t already.\" \"Enough!\" Braith snapped as Aria went completely still. \"If you mean to punish me for the past hundred years, then so be it. But unless you would like to stay here for another hundred years than you need to get over it, or I\u0027m going to rip out your damn tongue so you can\u0027t say another word!\" Gideon became thoughtful again, staring at Braith from under hooded lids. \"Protective aren\u0027t we?\" \"Gideon.\" This time it was Ashby who spoke in a low, warning tone. \"Oh, it\u0027s all in fun. Dara why don\u0027t you show our two young humans to a room so they can get cleaned up?\" \"They aren\u0027t going anywhere alone,\" Braith informed him. \"Lighten up Braith. You\u0027re nowhere near as much fun as you used to be. Why don\u0027t we all take a small break and meet back in an hour then. You can replenish.\" Gideon\u0027s eyebrows quirked as his gaze ran pointedly over Aria. \"And clean yourselves. How does that sound?\" It really was taking all Braith had not to punch Gideon. His increasing need for blood wasn\u0027t helping the situation much. He didn\u0027t have the patience to deal with Gideon\u0027s taunting and candid manner. Not right now. \"Show them to the guestrooms upstairs please Dara.\" Braith held tight to Aria as they followed the semi-nude woman up the stairs. He led Aria into the first bedroom the girl pointed to, eager to get her away from the girl and Gideon, eager to have just a moment alone as he closed the door and leaned against it. \"Can we trust him?\" she blurted instantly. Braith closed his eyes and rubbed the bridge of his nose. \"I still think we can, he\u0027s far more bitter than I had anticipated, but I don\u0027t think he\u0027s dangerous.\" \"Maybe we should leave Braith. This place...\" For the first time she glanced at the walls, relief filled her as she realized that they were free of the \"artwork\" that the downstairs possessed. \"This place is awful, and strange. We\u0027re going to bring these creatures back to help us, and then give them positions of power? What would they do to the rest of us?\" \"At one time these were the vampires that fought for human equality. No matter Gideon\u0027s anger, I believe that he still wants that equality. The people in this town are amongst the vampires Aria, they are living with them. It won\u0027t be easy, but it can and will be done.\" She stared inquisitively at him. \"Is this what you liked? That girl...\" \"I was never like Gideon, or even Ashby, and most certainly never like Caleb. I\u0027ve never stooped to rape, even after you left the palace and I thought I\u0027d lost you. Though, I suppose taking someone\u0027s blood by force is a form of rape.\" The color drained from her face, her lower lip trembled slightly as she took a small step back. Any reminder of his past was distressing to her, especially that one. He hated doing this to her, but she needed to hear and understand some things. \"As far as I know neither Ashby, nor Gideon, has ever done such a thing either. \"If Gideon is anything like he used to be, that girl is here willingly. He never abused a human that didn\u0027t agree to it and he never would have possessed a blood slave. His tastes are more salacious than most, but he was never cruel.\" \"Those teeth, the paintings...\" \"I\u0027m sure there\u0027s an explanation, and perhaps he will eventually give it to us, but until then you need to be a little more understanding and open minded. Though there may be things in our pasts that we are not proud of, we are not all monsters. If you are willing to look past my faults and the sins of my past, you should be willing to at least give Gideon and the others a chance. \"I wouldn\u0027t have brought you here if I thought Gideon was dangerous.\" \"Vampires and people change,\" she whispered, her eyes raking over him. Self-hatred flared through him, he shook his head as he looked away from her. \"I don\u0027t think he\u0027s changed as much as he\u0027s trying to portray. That girl is not unhappy here Aria.\" She shook her head as she turned away. Her fingers trembled as she untied the knot of her cloak. Though he wasn\u0027t sure if she wanted his help right now he pulled it free of her. The material slithered to the floor; she didn\u0027t bother to pick it up. He watched her as she placed her bow and arrows by the bed; he was disturbed by how thin she had become again. \"Oh, a shower!\" With those excited words, she was gone, vanishing through the doorway in a flash. He couldn\u0027t help but smile as the sound of running water filled the room. He admired the delight she found in things that he had taken for granted. He remained by the door as she moved around the bathroom gathering soaps and shampoos in her arms with an eagerness that caused him to laugh softly. His laughter vanished in an instant as she shed the bindings from her arms and dropped them to the floor. The smell of her blood assaulted him. She disappeared from sight again, the water flow changed as she stepped beneath the shower head. He hurt. It was a physical ache so intense that he couldn\u0027t focus on anything else. She was humming in the shower, a melodious sound that drew him forward a step, and then another, and another. He was trembling, trying so hard to stop moving that his muscles throbbed from the restraint he tried, and failed, to exert over himself. The water turned off. She was wrapping a towel around herself when he stepped into the bathroom doorway. He didn\u0027t know what he was doing, didn\u0027t know what it was he intended as she finished tucking the towel into place. Her back was to him, her head bowed as her dark hair tumbled about her shoulders in curly wet waves. He could hear the beat of her heart and smell her blood in the cloying steam that filled the air. She grabbed a brush then wiped the mirror with the palm of her hand. Her eyes widened, she jumped in surprise as she spotted him in the reflective surface. There was a brief moment where her surprise turned into a small smile, which swiftly faded away. Her hands grasped the towel as she turned slowly toward him, her heartbeat accelerating. He should leave, but instead he found himself drawn toward her like a moth to a flame. He found himself standing before her when he\u0027d had every intention of turning away and leaving the room. He should get as far from her as possible until he was well fed and stable enough to trust himself in her presence again. His hand trembled as he brushed the hair back from her very fragile, very delicate neck. Her pulse leapt wildly, a subtle breath escaped her as his fingers pressed against the previous marks he\u0027d left upon her. His fangs sprang forward; his vision was clouded by the hunger pulsing through him. \"Yes,\" she breathed. \"Too soon.\" They were the only two words he was able to choke out. \"It\u0027s been almost a day, I\u0027m fine. Your blood strengthened me.\" She pulled his hand away, tilting her neck so that he had a better view of his marks on her. He wanted to fight, wanted to tell her no. But it didn\u0027t matter, he was no longer in control of himself, no longer sensible enough to tell her no, to tell himself no. He was tempted to lurch forward and drive his fangs into her as he bit deep, finally easing the fire that had almost consumed him. He somehow found the strength not to give into that urge; he couldn\u0027t injure her in such a way. She shuddered as he pulled her against him; darkened by desire her eyes were fearless as her arms entwined around his neck. She clung to him, so trusting and giving, so unknowing of the ferocious thirst clamoring through him as she offered her vein to him. He was braced against her as he struggled to find the strength to pull away, to walk out of this room and find someone else. But there was no one else, there was only her. The scent of her blood engulfed him; her heartbeat invaded his body and took over his senses. As he bit deep, her sweet life giving blood surged into his mouth, flowed through his body and filled his dehydrated cells. Instantly the clamoring that had encased him began to ease. A groan of ecstasy escaped him as he became lost in her.","sourceLink":"https://allnovel.net/refugee-the-captive-3/page-5.html","bookId":2166,"book":{"id":2166,"title":"Refugee (The Captive #3)","description":"Storyline: Refugee (The Captive #3) Whispers, rumors, and horror stories abound about The Barrens and the strange creatures that lurk within them. Determined to find the remaining vampires that stood against his father in the war, Braith knows that it’s dangerous to enter the inhospitable land, but that they must if they are to have a chance at gaining allies to help overthrow the king. Though he once knew the powerful vampires that are rumored to reside within The Barrens, he is unsure what to expect if they succeed in finding them. He will do whatever is necessary though to ensure a future for himself and Aria. Aria is fearful of entering into the land she’s heard nothing but cautionary tales about, but she’s determined to help Braith locate the vampires that may help them with their cause. She is fascinated and amazed by the world they uncover within, one that is unlike anything she has ever seen before. However, the more immersed they become in a world that she doesn’t entirely understand, the more she realizes that it won’t be the war, or even the king that will eventually tear her and Braith apart. It will be her.","cover":"https://allnovel.net/images/refugee-the-captive-3.jpg","author":"Erica Stevens","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/refugee-the-captive-3.html","creation":"Oct 5, 2019 8:58:25 AM","modification":"Oct 5, 2019 6:30:31 PM"}}
