{"id":12231,"no":14,"title":"Chapter 15 The Daemon Cages","content":"It wasn\u0027t Lyra\u0027s way to brood; she was a sanguine and practical child, and besides, she wasn\u0027t imaginative. No one with much imagination would have thought seriously that it was possible to come all this way and rescue her friend Roger; or, having thought it, an imaginative child would immediately have come up with several ways in which it was impossible. Being a practiced liar doesn\u0027t mean you have a powerful imagination. Many good liars have no imagination at all; it\u0027s that which gives their lies such wide-eyed conviction.\\n\\n So now that she was in the hands of the Oblation Board, Lyra didn\u0027t fret herself into terror about what had happened to the gyptians. They were all good fighters, and even though Pantalaimon said he\u0027d seen John Faa shot, he might have been mistaken; or if he wasn\u0027t mistaken, John Faa might not have been seriously hurt. It had been bad luck that she\u0027d fallen into the hands of the Samoyeds, but the gyptians would be along soon to rescue her, and if they couldn\u0027t manage it, nothing would stop lorek Byrnison from getting her out; and then they\u0027d fly to Svalbard in Lee Scoresby\u0027s balloon and rescue Lord Asriel.\\n\\n In her mind, it was as easy as that.\\n\\n So next morning, when she awoke in the dormitory, she was curious and ready to deal with whatever the day would bring. And eager to see Roger-in particular, eager to see him before he saw her.\\n\\n She didn\u0027t have long to wait. The children in their different dormitories were woken at half-past seven by the nurses who looked after them. They washed and dressed and went with the others to the canteen for breakfast.\\n\\n And there was Roger.\\n\\n He was sitting with five other boys at a table just inside the door. The line for the hatch went right past them, and she was able to pretend to drop a handkerchief and crouch to pick it up, bending low next to his chair, so that Pantalaimon could speak to Roger\u0027s daemon Salcilia.\\n\\n She was a chaffinch, and she fluttered so wildly that Pantalaimon had to be a cat and leap at her, pinning her down to whisper. Such brisk fights or scuffles between children\u0027s daemons were common, luckily, and no one took much notice, but Roger went pale at once. Lyra had never seen anyone so white. He looked up at the blank haughty stare she gave him, and the color flooded back into his cheeks as he brimmed over with hope, excitement, and joy; and only Pantalaimon, shaking Salcilia firmly, was able to keep Roger from shouting out and leaping up to greet his best friend, his comrade in arms, his Lyra.\\n\\n But he saw how she looked away disdainfully, and he followed her example faithfully, as he\u0027d done in a hundred Oxford battles and campaigns. No one must know, of course, because they were both in deadly danger. She rolled her eyes at her new friends, and they collected their trays of cornflakes and toast and sat together, an instant gang, excluding everyone else in order to gossip about them.\\n\\n You can\u0027t keep a large group of children in one place for long without giving them plenty to do, and in some ways Bolvangar was run like a school, with timetabled activities such as gymnastics and \"art.\" Boys and girls were kept separate except for breaks and mealtimes, so it wasn\u0027t until midmorning, after an hour and a half of sewing directed by one of the nurses, that Lyra had the chance to talk to Roger. But it had to look natural; that was the difficulty. All the children there were more or less at the same age, and it was the age when most boys talk to boys and girls to girls, each making a conspicuous point of ignoring the opposite sex.\\n\\n She found her chance in the canteen again, when the children came in for a drink and a biscuit. Lyra sent Pantalaimon, as a fly, to talk to Salcilia on the wall next to their table while she and Roger kept quietly in their separate groups. It was difficult to talk while your daemon\u0027s attention was somewhere else, so Lyra pretended to look glum and rebellious as she sipped her milk with the other girls. Half her thoughts were with the tiny buzz of talk between the daemons, and she wasn\u0027t really listening, but at one point she heard another girl with bright blond hair say a name that made her sit up.\\n\\n It was the name of Tony Makarios. As Lyra\u0027s attention snapped toward that, Pantalaimon had to slow down his whispered conversation with Roger\u0027s daemon, and both children listened to what the girl was saying.\\n\\n \"No, I know why they took him,\" she said, as heads clustered close nearby. \"It was because his daemon didn\u0027t change. They thought he was older than he looked, or summing, and he weren\u0027t really a young kid. But really his daemon never changed very often because Tony hisself never thought much about anything. I seen her change. She was called Ratter...\"\\n\\n \"Why are they so interested in daemons?\" said Lyra.\\n\\n \"No one knows,\" said the blond girl.\\n\\n \"I know,\" said one boy who\u0027d been listening. \"What they do is kill your daemon and then see if you die.\"\\n\\n \"Well, how come they do it over and over with different kids?\" said someone. \"They\u0027d only need to do it once, wouldn\u0027t they?\"\\n\\n \"I know what they do,\" said the first girl.\\n\\n She had everyone\u0027s attention now. But because they didn\u0027t want to let the staff know what they were talking about, they had to adopt a strange, half-careless, indifferent manner, while listening with passionate curiosity.\\n\\n \"How?\" said someone.\\n\\n \" \u0027Cause I was with him when they came for him. We was in the linen room,\" she said.\\n\\n She was blushing hotly. If she was expecting jeers and teasing, they didn\u0027t come. All the children were subdued, and no one even smiled.\\n\\n The girl went on: \"We was keeping quiet and then the nurse came in, the one with the soft voice. And she says, Come on, Tony, I know you\u0027re there, come on, we won\u0027t hurt you....And he says, What\u0027s going to happen? And she says, We just put you to sleep, and then we do a little operation, and then you wake up safe and sound. But Tony didn\u0027t believe her. He says-\"\\n\\n \"The holes!\" said someone. \"They make a hole in your head like the Tartars! I bet!\"\\n\\n \"Shut up! What else did the nurse say?\" someone else put in. By this time, a dozen or more children were clustered around her table, their daemons as desperate to know as they were, all wide-eyed and tense.\\n\\n The blond girl went on: \"Tony wanted to know what they was gonna do with Ratter, see. And the nurse says, Well, she\u0027s going to sleep too, just like when you do. And Tony says, You\u0027re gonna kill her, en\u0027t yer? 1 know you are. We all know that\u0027s what happens. And the nurse says, No, of course not. It\u0027s just a little operation. Just a little cut. It won\u0027t even hurt, but we put you to sleep to make sure.\\n\\n All the room had gone quiet now. The nurse who\u0027d been supervising had left for a moment, and the hatch to the kitchen was shut so no one could hear from there.\\n\\n \"What sort of cut?\" said a boy, his voice quiet and frightened. \"Did she say what sort of cut?\"\\n\\n \"She just said, It\u0027s something to make you more grown up. She said everyone had to have it, that\u0027s why grownups\u0027 daemons don\u0027t change like ours do. So they have a cut to make them one shape forever, and that\u0027s how you get grown up.\"\\n\\n \"But-\"\\n\\n \"Does that mean-\"\\n\\n \"What, all grownups\u0027ve had this cut?\"\\n\\n \"What about-\"\\n\\n Suddenly all the voices stopped as if they themselves had been cut, and all eyes turned to the door. Sister Clara stood there, bland and mild and matter-of-fact, and beside her was a man in a white coat whom Lyra hadn\u0027t seen before.\\n\\n \"Bridget McGinn,\" he said.\\n\\n The blond girl stood up trembling. Her squirrel daemon clutched her breast.\\n\\n \"Yes, sir?\" she said, her voice hardly audible.\\n\\n \"Finish your drink and come with Sister Clara,\" he said. \"The rest of you run along and go to your classes.\"\\n\\n Obediently the children stacked their mugs on the stainless-steel trolley before leaving in silence. No one looked at Bridget McGinn except Lyra, and she saw the blond girl\u0027s face vivid with fear.\\n\\n The rest of that morning was spent in exercise. There was a small gymnasium at the station, because it was hard to exercise outside during the long polar night, and each group of children took turns to play in there, under the supervision of a nurse. They had to form teams and throw balls around, and at first Lyra, who had never in her life played at anything like this, was at a loss what to do. But she was quick and athletic, and a natural leader, and soon found herself enjoying it. The shouts of the children, the shrieks and hoots of the daemons, filled the little gymnasium and soon banished fearful thoughts; which of course was exactly what the exercise was intended to do.\\n\\n \\n\\n At lunchtime, when the children were lining up once again in the canteen, Lyra felt Pantalaimon give a chirrup of recognition, and turned to find Billy Costa standing just behind her.\\n\\n \"Roger told me you was here,\" he muttered.\\n\\n \"Your brother\u0027s coming, and John Faa and a whole band of gyptians,\" she said. \"They\u0027re going to take you home.\"\\n\\n He nearly cried aloud with joy, but subdued the cry into a cough.\\n\\n \"And you got to call me Lizzie,\" Lyra said, \"never Lyra. And you got to tell me everything you know, right.\"\\n\\n They sat together, with Roger close by. It was easier to do this at lunchtime, when children spent more time coming and going between the tables and the counter, where bland-looking adults served equally bland food. Under the clatter of knives and forks and plates Billy and Roger both told her as much as they knew. Billy had heard from a nurse that children who had had the operation were often taken to hostels further south, which might explain how Tony Makarios came to be wandering in the wild. But Roger had something even more interesting to tell her.\\n\\n \"I found a hiding place,\" he said.\\n\\n \"What? Where?\"\\n\\n \"See that picture...\" He meant the big photogram of the tropical beach. \"If you look in the top right corner, you see that ceiling panel?\"\\n\\n The ceiling consisted of large rectangular panels set in a framework of metal strips, and the corner of the panel above the picture had lifted slightly.\\n\\n \"I saw that,\" Roger said, \"and I thought the others might be like it, so I lifted \u0027em, and they\u0027re all loose. They just lift up. Me and this boy tried it one night in our dormitory, before they took him away. There\u0027s a space up there and you can crawl inside....\"\\n\\n \"How far can you crawl in the ceiling?\"\\n\\n \"I dunno. We just went in a little way. We reckoned when it was time we could hide up there, but they\u0027d probably find us.\"\\n\\n Lyra saw it not as a hiding place but as a highway. It was the best thing she\u0027d heard since she\u0027d arrived. But before they could talk any more, a doctor banged on a table with a spoon and began to speak.\\n\\n \"Listen, children,\" he said. \"Listen carefully. Every so often we have to have a fire drill. It\u0027s very important that we all get dressed properly and make our way outside without any panic. So we\u0027re going to have a practice fire drill this afternoon. When the bell, rings you must stop whatever you\u0027re doing and do what the nearest grownup says. Remember where they take you. That\u0027s the place you must go to if there\u0027s a real fire.\"\\n\\n Well, thought Lyra, there\u0027s an idea.\\n\\n During the first part of the afternoon, Lyra and four other girls were tested for Dust. The doctors didn\u0027t say that was what they were doing, but it was easy to guess. They were taken one by one to a laboratory, and of course this made them all very frightened; how cruel it would be, Lyra thought, if she perished without striking a blow at them! But they were not going to do that operation just yet, it seemed.\\n\\n \"We want to make some measurements,\" the doctor explained. It was hard to tell the difference between these people: all the men looked similar in their white coats and with their clipboards and pencils, and the women resembled one another too, the uniforms and their strange bland calm manner making them all look like sisters.\\n\\n \"I was measured yesterday,\" Lyra said.\\n\\n \"Ah, we\u0027re making different measurements today. Stand on the metal plate-oh, slip your shoes off first. Hold your daemon, if you like. Look forward, that\u0027s it, stare at the little green light. Good girl...\"\\n\\n Something flashed. The doctor made her face the other way and then to left and right, and each time something clicked and flashed.\\n\\n \"That\u0027s fine. Now come over to this machine and put your hand into the tube. Nothing to harm you, I promise. Straighten your fingers. That\u0027s it.\"\\n\\n \"What are you measuring?\" she said. \"Is it Dust?\"\\n\\n \"Who told you about Dust?\"\\n\\n \"One of the other girls, I don\u0027t know her name. She said we was all over Dust. I en\u0027t dusty, at least I don\u0027t think I am. I had a shower yesterday.\"\\n\\n \"Ah, it\u0027s a different sort of dust. You can\u0027t see it with your ordinary eyesight. It\u0027s a special dust. Now clench your fist- that\u0027s right. Good. Now if you feel around in there, you\u0027ll find a sort of handle thing-got that? Take hold of that, there\u0027s a good girl. Now can you put your other hand over this way- rest it on this brass globe. Good. Fine. Now you\u0027ll feel a slight tingling, nothing to worry about, it\u0027s just a slight anbaric current....\"\\n\\n Pantalaimon, in his most tense and wary wildcat form, prowled with lightning-eyed suspicion around the apparatus, continually returning to rub himself against Lyra.\\n\\n She was sure by now that they weren\u0027t going to perform the operation on her yet, and sure too that her disguise as Lizzie Brooks was secure; so she risked a question.\\n\\n \"Why do you cut people\u0027s daemons away?\"\\n\\n \"What? Who\u0027s been talking to you about that?\"\\n\\n \"This girl, I dunno her name. She said you cut people\u0027s daemons away.\"\\n\\n \"Nonsense...\"\\n\\n He was agitated, though. She went on:\\n\\n \u0027\"Cause you take people out one by one and they never come back. And some people reckon you just kill \u0027em, and other people say different, and this girl told me you cut-\"\\n\\n \"It\u0027s not true at all. When we take children out, it\u0027s because it\u0027s time for them to move on to another place. They\u0027re growing up. I\u0027m afraid your friend is alarming herself. Nothing of the sort! Don\u0027t even think about it. Who is your friend?\"\\n\\n \"I only come here yesterday, I don\u0027t know anyone\u0027s name.\"\\n\\n \"What does she look like?\"\\n\\n \"I forget. I think she had sort of brown hair...light brown, maybe...! dunno.\"\\n\\n The doctor went to speak quietly to the nurse. As the two of them conferred, Lyra watched their daemons. This nurse\u0027s was a pretty bird, just as neat and incurious as Sister Clara\u0027s dog, and the doctor\u0027s was a large heavy moth. Neither moved. They were awake, for the bird\u0027s eyes were bright and the moth\u0027s feelers waved languidly, but they weren\u0027t animated, as she would have expected them to be. Perhaps they weren\u0027t really anxious or curious at all.\\n\\n Presently the doctor came back and they went on with the examination, weighing her and Pantalaimon separately, looking at her from behind a special screen, measuring her heartbeat, placing her under a little nozzle that hissed and gave off a smell like fresh air.\\n\\n In the middle of one of the tests, a loud bell began to ring and kept ringing.\\n\\n \"The fire alarm,\" said the doctor, sighing. \"Very well. Lizzie, follow Sister Betty.\"\\n\\n \"But all their outdoor clothes are down in the dormitory building, Doctor. She can\u0027t go outside like this. Should we go there first, do you think?\"\\n\\n He was annoyed at having his experiments interrupted, and snapped his fingers in irritation.\\n\\n \"I suppose this is just the sort of thing the practice is meant to show up,\" he said. \"What a nuisance.\"\\n\\n \"When I came yesterday,\" Lyra said helpfully, \"Sister Clara put my other clothes in a cupboard in that first room where she looked at me. The one next door. I could wear them.\"\\n\\n \"Good idea!\" said the nurse. \"Quick, then.\"\\n\\n With a secret glee, Lyra hurried there behind the nurse and retrieved her proper furs and leggings and boots, and pulled them on quickly while the nurse dressed herself in coal silk.\\n\\n Then they hurried out. In the wide arena in front of the main group of buildings, a hundred or so people, adults and children, were milling about: some in excitement, some in irritation, many just bewildered.\\n\\n \"See?\" one adult was saying. \"It\u0027s worth doing this to find out what chaos we\u0027d be in with a real fire.\"\\n\\n Someone was blowing a whistle and waving his arms, but no one was taking much notice. Lyra saw Roger and beckoned. Roger tugged Billy Costa\u0027s arm and soon all three of them were together in a maelstrom of running children.\\n\\n \"No one\u0027ll notice if we take a look around,\" said Lyra. \"It\u0027ll take \u0027em ages to count everyone, and we can say we just followed someone else and got lost.\"\\n\\n They waited till most of the grownups were looking the other way, and then Lyra scooped up some snow and rammed it into a loose powdery snowball, and hurled it at random into the crowd. In a moment all the children were doing it, and the air was full of flying snow. Screams of laughter covered completely the shouts of the adults trying to regain control, and then the three children were around the corner and out of sight.\\n\\n The snow was so thick that they couldn\u0027t move quickly, but it didn\u0027t seem to matter; no one was following. Lyra and the others scrambled over the curved roof of one of the tunnels, and found themselves in a strange moonscape of regular hummocks and hollows, all swathed in white under the black sky and lit by reflections from the lights around the arena.\\n\\n \"What we looking for?\" said Billy.\\n\\n \"Dunno. Just looking,\" said Lyra, and led the way to a squat, square building a little apart from the rest, with a low-powered anbaric light at the corner.\\n\\n The hubbub from behind was as loud as ever, but more distant. Clearly the children were making the most of their freedom, and Lyra hoped they\u0027d keep it up for as long as they could. She moved around the edge of the square building, looking for a window. The roof was only seven feet or so off the ground, and unlike the other buildings, it had no roofed tunnel to connect it with the rest of the station.\\n\\n There was no window, but there was a door. A notice above it said ENTRY STRICTLY FORBIDDEN in red letters.\\n\\n Lyra set her hand on it to try, but before she could turn the handle, Roger said:\\n\\n \"Look! A bird! Or-\"\\n\\n His or was an exclamation of doubt, because the creature swooping down from the black sky was no bird at all: it was someone Lyra had seen before.\\n\\n \"The witch\u0027s daemon!\"\\n\\n The goose beat his great wings, raising a flurry of snow as he landed.\\n\\n \"Greetings, Lyra,\" he said. \"I followed you here, though you didn\u0027t see me. I have been waiting for you to come out into the open. What is happening?\"\\n\\n She told him quickly.\\n\\n \"Where are the gyptians?\" she said. \"Is John Faa safe? Did they fight off the Samoyeds?\"\\n\\n \"Most of them are safe. John Faa is wounded, though not severely. The men who took you were hunters and raiders who often prey on parties of travelers, and alone they can travel more quickly than a large party. The gyptians are still a day\u0027s journey away.\"\\n\\n The two boys were staring in fear at the goose daemon and at Lyra\u0027s familiar manner with him, because of course they\u0027d never seen a daemon without his human before, and they knew little about witches.\\n\\n Lyra said to them, \"Listen, you better go and keep watch, right. Billy, you go that way, and Roger, watch out the way we just come. We en\u0027t got long.\"\\n\\n They ran off to do as she said, and then Lyra turned back to the door.\\n\\n \"Why are you trying to get in there?\" said the goose daemon.\\n\\n \"Because of what they do here. They cut-\" she lowered her voice, \"they cut people\u0027s daemons away. Children\u0027s. And I think maybe they do it in here. At least, there\u0027s something here, and I was going to look. But it\u0027s locked....\"\\n\\n \"I can open it,\" said the goose, and beat his wings once or twice, throwing snow up against the door; and as he did, Lyra heard something turn in the lock.\\n\\n \"Go in carefully,\" said the daemon.\\n\\n Lyra pulled open the door against the snow and slipped inside. The goose daemon came with her. Pantalaimon was agitated and fearful, but he didn\u0027t want the witch\u0027s daemon to see his fear, so he had flown to Lyra\u0027s breast and taken sanctuary inside her furs.\\n\\n As soon as her eyes had adjusted to the light, Lyra saw why.\\n\\n In a series of glass cases on shelves around the walls were all the daemons of the severed children: ghostlike forms of cats, or birds, or rats, or other creatures, each bewildered and frightened and as pale as smoke.\\n\\n The witch\u0027s daemon gave a cry of anger, and Lyra clutched Pantalaimon to her and said, \"Don\u0027t look! Don\u0027t look!\"\\n\\n \"Where are the children of these daemons?\" said the goose daemon, shaking with rage.\\n\\n Lyra explained fearfully about her encounter with little Tony Makarios, and looked over her shoulder at the poor caged daemons, who were clustering forward pressing their pale faces to the glass. Lyra could hear faint cries of pain and misery. In the dim light from a low-powered anbaric bulb she could see a name on a card at the front of each case, and yes, there was an empty one with Tony Makarios on it. There were four or five other empty ones with names on them, too.\\n\\n \"I want to let these poor things go!\" she said fiercely. \"I\u0027m going to smash the glass and let \u0027em out-\"\\n\\n And she looked around for something to do it with, but the place was bare. The goose daemon said, \"Wait.\"\\n\\n He was a witch\u0027s daemon, and much older than she was, and stronger. She had to do as he said.\\n\\n \"We must make these people think someone forgot to lock the place and shut the cages,\" he explained. \"If they see broken glass and footprints in the snow, how long do you think your disguise will last? And it must hold out till the gyptians come. Now do exactly as I say: take a handful of snow, and when I tell you, blow a little of it against each cage in turn.\"\\n\\n She ran outside. Roger and Billy were still on guard, and there was still a noise of shrieking and laughter from the arena, because only a minute or so had gone by.\\n\\n She grabbed a big double handful of the light powdery snow, and then came back to do as the goose daemon said. As she blew a little snow on each cage, the goose made a clicking sound in his throat, and the catch at the front of the cage came open.\\n\\n When she had unlocked them all, she lifted the front of the first one, and the pale form of a sparrow fluttered out, but fell to the ground before she could fly. The goose tenderly bent and nudged her upright with his beak, and the sparrow became a mouse, staggering and confused. Pantalaimon leaped down to comfort her.\\n\\n Lyra worked quickly, and within a few minutes every daemon was free. Some were trying to speak, and they clustered around her feet and even tried to pluck at her leggings, though the taboo held them back. She could tell why, poor things; they missed the heavy solid warmth of their humans\u0027 bodies; just as Pantalaimon would have done, they longed to press themselves against a heartbeat.\\n\\n \"Now, quick,\" said the goose. \"Lyra, you must run back and mingle with the other children. Be brave, child. The gyptians are coming as fast as they can. I must help these poor daemons to find their people....\" He came closer and said quietly, \"But they\u0027ll never be one again. They\u0027re sundered forever. This is the most wicked thing I have ever seen....Leave the footprints you\u0027ve made; I\u0027ll cover them up. Hurry now....\"\\n\\n \"Oh, please! Before you go! Witches...They do fly, don\u0027t they? I wasn\u0027t dreaming when I saw them flying the other night?\"\\n\\n \"Yes, child; why?\"\\n\\n \"Could they pull a balloon?\"\\n\\n \"Undoubtedly, but-\"\\n\\n \"Will Serafina Pekkala be coming?\"\\n\\n \"There isn\u0027t time to explain the politics of witch nations. There are vast powers involved here, and Serafina Pekkala must guard the interests of her clan. But it may be that what\u0027s happening here is part of all that\u0027s happening elsewhere. Lyra, you\u0027re needed inside. Run, run!\"\\n\\n She ran, and Roger, who was watching wide-eyed as the pale daemons drifted out of the building, waded toward her through the thick snow.\\n\\n \"They\u0027re-it\u0027s like the crypt in Jordan-they\u0027re daemons!\"\\n\\n \"Yes, hush. Don\u0027t tell Billy, though. Don\u0027t tell anyone yet. Come on back.\"\\n\\n Behind them, the goose was beating his wings powerfully, throwing snow over the tracks they\u0027d made; and near him, the lost daemons were clustering or drifting away, crying little bleak cries of loss and longing. When the footprints were covered, the goose turned to herd the pale daemons together. He spoke, and one by one they changed, though you could see the effort it cost them, until they were all birds; and like fledglings they followed the witch\u0027s daemon, fluttering and falling and running through the snow after him, and finally, with great difficulty, taking off. They rose in a ragged line, pale and spectral against the deep black sky, and slowly gained height, feeble and erratic though some of them were, and though others lost their will and fluttered downward; but the great gray goose wheeled round and nudged them back, herding them gently on until they were lost against the profound dark.\\n\\n Roger was tugging at Lyra\u0027s arm.\\n\\n \"Quick,\" he said, \"they\u0027re nearly ready.\"\\n\\n They stumbled away to join Billy, who was beckoning from the corner of the main building. The children were tired now, or else the adults had regained some authority, because people were lining up raggedly by the main door, with much jostling and pushing. Lyra and the other two slipped out from the corner and mingled with them, but before they did, Lyra said:\\n\\n \"Pass the word around among all the kids-they got to be ready to escape. They got to know where the outdoor clothes are and be ready to get them and run out as soon as we give the signal. And they got to keep this a deadly secret, understand?\"\\n\\n Billy nodded, and Roger said, \"What\u0027s the signal?\"\\n\\n \"The fire bell,\" said Lyra. \"When the time comes, I\u0027ll set it off.\"\\n\\n They waited to be counted off. If anyone in the Oblation Board had had anything to do with a school, they would have arranged this better; because they had no regular group to go to, each child had to be ticked off against the complete list,\\n\\n and of course they weren\u0027t in alphabetical order; and none of the adults was used to keeping control. So there was a good deal of confusion, despite the fact that no one was running around anymore.\\n\\n Lyra watched and noticed. They weren\u0027t very good at this at all. They were slack in a lot of ways, these people; they grumbled about fire drills, they didn\u0027t know where the outdoor clothes should be kept, they couldn\u0027t get children to stand in line properly; and their slackness might be to her advantage.\\n\\n They had almost finished when there came another distraction, though, and from Lyra\u0027s point of view, it was the worst possible.\\n\\n She heard the sound as everyone else did. Heads began to turn and scan the dark sky for the zeppelin, whose gas engine was throbbing clearly in the still air.\\n\\n The one lucky thing was that it was coming from the direction opposite to the one in which the gray goose had flown. But that was the only comfort. Very soon it was visible, and a murmur of excitement went around the crowd. Its fat sleek silver form drifted over the avenue of lights, and its own lights blazed downward from the nose and the cabin slung beneath the body.\\n\\n The pilot cut the speed and began the complex business of adjusting the height. Lyra realized what the stout mast was for: of course, it was a mooring mast. As the adults ushered the children inside, with everyone staring back and pointing, the ground crew clambered up the ladders in the mast and prepared to attach the mooring cables. The engines were roaring, and snow was swirling up from the ground, and the faces of passengers showed in the cabin windows.\\n\\n Lyra looked, and there was no mistake. Pantalaimon clutched at her, became a wildcat, hissed in hatred, because looking out with curiosity was the beautiful dark-haired head of Mrs. Coulter, with her golden daemon in her lap.\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/kehuan/52/200.html","bookId":390,"book":{"id":390,"title":"The Golden Compass黄金罗盘","description":"简介： If Pullman\u0027s imagination dazzled in the Victorian thrillers that culminated with The Tin Princess, in this first volume of a fantasy trilogy it is nothing short of breathtaking. Here Earth is one of only five planets in the solar system, every human h...","cover":"http://novel.tingroom.com/uploads/allimg/101230/128540315751ce4.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/52","creation":"Aug 1, 2019 12:18:41 AM","modification":"Aug 1, 2019 12:18:41 AM"}}
