{"id":27407,"no":24,"title":"CHAPTER XXIV. THE BALL.","content":"The people came of course, but not in such numbers as had been expected. Many of those in Rufford had heard of the accident, and having been made acquainted with Nokes\u0027s report, stayed away. Everybody was told that supper would be on the table at twelve, and that it was generally understood that the house was to be cleared by two. Nokes seemed to think that the sufferer would live at least till the morrow, and it was ascertained to a certainty that the music could not affect him. It was agreed among the party in the house that the ladies staying there should stand up for the first dance or two, as otherwise the strangers would be discouraged and the whole thing would be a failure. This request was made by Lady Penwether because Miss Penge had said that she thought it impossible for her to dance. Poor Miss Penge, who was generally regarded as a brilliant young woman, had been a good deal eclipsed by Arabella and had seen the necessity of striking out some line for herself. Then Arabella had whispered a few words to Lord Rufford, and the lord had whispered a few words to his sister, and Lady Penwether had explained what was to be done to the ladies around. Lady Augustus nodded her head and said that it was all right. The other ladies of course agreed, and partners were selected within the house party. Lord Rufford stood up with Arabella and John Morton with Lady Penwether. Mr. Gotobed selected Miss Penge, and Hampton and Battersby the two Miss Godolphins. They all took their places with a lugubrious but business-like air, as aware that they were sacrificing themselves in the performance of a sad duty. But Morton was not allowed to dance in the same quadrille with the lady of his affections. Lady Penwether explained to him that she and her brother had better divide themselves,—for the good of the company generally,—and therefore he and Arabella were also divided. A rumour had reached Lady Penwether of the truth in regard to their guests from Bragton. Mr. Gotobed had whispered to her that he had understood that they certainly were engaged; and, even before that, the names of the two lovers had been wafted to her ears from the other side of the Atlantic. Both John Morton and Lady Augustus were \"somebodies,\" and Lady Penwether generally knew what there was to be known of anybody who was anybody. But it was quite clear to her,—more so even than to poor John Morton,—that the lady was conducting herself now as though she were fettered by no bonds, and it seemed to Lady Penwether also that the lady was very anxious to contract other bonds. She knew her brother well. He was always in love with somebody; but as he had hitherto failed of success where marriage was desirable, so had he avoided disaster when it was not. He was one of those men who are generally supposed to be averse to matrimony. Lady Penwether and some other relatives were anxious that he should take a wife;—but his sister was by no means anxious that he should take such a one as Arabella Trefoil. Therefore she thought that she might judiciously ask Mr. Morton a few questions. \"I believe you knew the Trefoils in Washington?\" she said. Morton acknowledged that he had seen much of them there. \"She is very handsome, certainly.\" \"I think so.\" \"And rides well I suppose.\" \"I don\u0027t know. I never heard much of her riding.\" \"Has she been staying long at Bragton?\" \"Just a week.\" \"Do you know Lord Augustus?\" Morton said that he did not know Lord Augustus and then answered sundry other questions of the same nature in the same uncommunicative way. Though he had once or twice almost fancied that he would like to proclaim aloud that the girl was engaged to him, yet he did not like to have the fact pumped out of him. And if she were such a girl as she now appeared to be, might it not be better for him to let her go? Surely her conduct here at Rufford Hall was opportunity enough. No doubt she was handsome. No doubt he loved her,—after his fashion of loving. But to lose her now would not break his heart, whereas to lose her after he was married to her, would, he knew well, bring him to the very ground. He would ask her a question or two this very night, and then come to some resolution. With such thoughts as these crossing his mind he certainly was not going to proclaim his engagement to Lady Penwether. But Lady Penwether was a determined woman. Her smile, when she condescended to smile, was very sweet,—lighting up her whole face and flattering for the moment the person on whom it shone. It was as though a rose in emitting its perfume could confine itself to the nostrils of its one favoured friend. And now she smiled on Morton as she asked another question. \"I did hear,\" she said, \"from one of your Foreign Office young men that you and Miss Trefoil were very intimate.\" \"Who was that, Lady Penwether?\" \"Of course I shall mention no name. You might call out the poor lad and shoot him, or, worse still, have him put down to the bottom of his class. But I did hear it. And then, when I find her staying with her mother at your house, of course I believe it to be true.\" \"Now she is staying at your brother\u0027s house,—which is much the same thing.\" \"But I am here.\" \"And my grandmother is at Bragton.\" \"That puts me in mind, Mr. Morton. I am so sorry that we did not know it, so that we might have asked her.\" \"She never goes out anywhere, Lady Penwether.\" \"And there is nothing then in the report that I heard?\" Morton paused a moment before he answered, and during that moment collected his diplomatic resources. He was not a weak man, who could be made to tell anything by the wiles of a pretty woman. \"I think,\" he said, \"that when people have anything of that kind which they wish to be known, they declare it.\" \"I beg your pardon. I did not mean to unravel a secret.\" \"There are secrets, Lady Penwether, which people do like to unravel, but which the owners of them sometimes won\u0027t abandon.\" Then there was nothing more said on the subject. Lady Penwether did not smile again, and left him to go about the room on her business as hostess, as soon as the dance was over. But she was sure that they were engaged. In the meantime, the conversation between Lord Rufford and Arabella was very different in its tone, though on the same subject. He was certainly very much struck with her, not probably ever waiting to declare to himself that she was the most beautiful woman he had ever seen in his life, but still feeling towards her an attraction which for the time was strong. A very clever girl would frighten him; a very horsey girl would disgust him; a very quiet girl would bore him; or a very noisy girl annoy him. With a shy girl he could never be at his ease, not enjoying the labour of overcoming such a barrier; and yet he liked to be able to feel that any female intimacy which he admitted was due to his own choice and not to that of the young woman. Arabella Trefoil was not very clever, but she had given all her mind to this peculiar phase of life, and, to use a common phrase, knew what she was about. She was quite alive to the fact that different men require different manners in a young woman; and as she had adapted herself to Mr. Morton at Washington, so could she at Rufford adapt herself to Lord Rufford. At the present moment the lord was in love with her as much as he was wont to be in love. \"Doesn\u0027t it seem an immense time since we came here yesterday?\" she said to him. \"There has been so much done.\" \"There has been a great misfortune.\" \"I suppose that is it. Only for that how very very pleasant it would have been!\" \"Yes, indeed. It was a nice run, and that little horse carried you charmingly. I wish I could see you ride him again.\" She shook her head as she looked up into his face. \"Why do you shake your head?\" \"Because I am afraid there is no possible chance of such happiness. We are going to such a dull house to-morrow! And then to so many dull houses afterwards.\" \"I don\u0027t know why you shouldn\u0027t come back and have another day or two;—when all this sadness has gone by.\" \"Don\u0027t talk about it, Lord Rufford.\" \"Why not?\" \"I never like to talk about any pleasure because it always vanishes as soon as it has come;—and when it has been real pleasure it never comes back again. I don\u0027t think I ever enjoyed anything so much as our ride this morning,—till that tragedy came.\" \"Poor Caneback!\" \"I suppose there is no hope?\" He shook his head. \"And we must go on to those Gores to-morrow without knowing anything about it. I wonder whether you could send me a line.\" \"Of course I can, and I will.\" Then he asked her a question looking into her face. \"You are not going back to Bragton?\" \"Oh dear, no.\" \"Was Bragton dull?\" \"Awfully dull;—frightfully dull.\" \"You know what they say?\" \"What who say, Lord Rufford? People say anything,—the more ill-natured the better they like it, I think.\" \"Have you not heard what they say about you and Mr. Morton?\" \"Just because mamma made a promise when in Washington to go to Bragton with that Mr. Gotobed. Don\u0027t you find they marry you to everybody?\" \"They have married me to a good many people. Perhaps they\u0027ll marry me to you to-morrow. That would not be so bad.\" \"Oh, Lord Rufford! Nobody has ever condemned you to anything so terrible as that.\" \"There was no truth in it then, Miss Trefoil?\" \"None at all, Lord Rufford. Only I don\u0027t know why you should ask me.\" \"Well; I don\u0027t know. A man likes sometimes to be sure how the land lies. Mr. Morton looks so cross that I thought that perhaps the very fact of my dancing with you might be an offence.\" \"Is he cross?\" \"You know him better than I do. Perhaps it\u0027s his nature. Now I must do one other dance with a native and then my work will be over.\" \"That isn\u0027t very civil, Lord Rufford.\" \"If you do not know what I meant, you\u0027re not the girl I take you to be.\" Then as she walked with him back out of the ball-room into the drawing-room she assured him that she did know what he meant, and that therefore she was the girl he took her to be. She had determined that she would not dance again and had resolved to herd with the other ladies of the house,—waiting for any opportunity that chance might give her for having a last word with Lord Rufford before they parted for the night,—when Morton came up to her and demanded rather than asked that she would stand up with him for a quadrille. \"We settled it all among ourselves, you know,\" she said. \"We were to dance only once, just to set the people off.\" He still persisted, but she still refused, alleging that she was bound by the general compact; and though he was very urgent she would not yield. \"I wonder how you can ask me,\" she said. \"You don\u0027t suppose that after what has occurred I can have any pleasure in dancing.\" Upon this he asked her to take a turn with him through the rooms, and to that she found herself compelled to assent. Then he spoke out to her. \"Arabella,\" he said, \"I am not quite content with what has been going on since we came to this house.\" \"I am sorry for that.\" \"Nor, indeed, have I been made very happy by all that has occurred since your mother and you did me the honour of coming to Bragton.\" \"I must acknowledge you haven\u0027t seemed to be very happy, Mr. Morton.\" \"I don\u0027t want to distress you;—and as far as possible I wish to avoid distressing myself. If it is your wish that our engagement should be over, I will endeavour to bear it. If it is to be continued,—I expect that your manner to me should be altered.\" \"What am I to say?\" \"Say what you feel.\" \"I feel that I can\u0027t alter my manner, as you call it.\" \"You do wish the engagement to be over then?\" \"I did not say so. The truth is, Mr. Morton, that there is some trouble about the lawyers.\" \"Why do you always call me Mr. Morton?\" \"Because I am aware how probable it is that all this may come to nothing. I can\u0027t walk out of the house and marry you as the cookmaid does the gardener. I\u0027ve got to wait till I\u0027m told that everything is settled; and at present I\u0027m told that things are not settled because you won\u0027t agree.\" \"I\u0027ll leave it to anybody to say whether I\u0027ve been unreasonable.\" \"I won\u0027t go into that. I haven\u0027t meddled with it, and I don\u0027t know anything about it. But until it is all settled as a matter of course there must be some little distance between us. It\u0027s the commonest thing in the world, I should say.\" \"What is to be the end of it?\" \"I do not know. If you think yourself injured you can back out of it at once. I\u0027ve nothing more to say about it.\" \"And you think I can like the way you\u0027re going on here?\" \"If you\u0027re jealous, Mr. Morton, there\u0027s an end of it. I tell you fairly once for all, that as long as I\u0027m a single woman I will regulate my conduct as I please. You can do the same, and I shall not say a word to you.\" Then she withdrew her arm from him, and, leaving him, walked across the room and joined her mother. He went off at once to his own room resolving that he would write to her from Bragton. He had made his propositions in regard to money which he was quite aware were as liberal as was fit. If she would now fix a day for their marriage, he would be a happy man. If she would not bring herself to do this, then he would have no alternative but to regard their engagement as at an end. At two o\u0027clock the guests were nearly all gone. The Major was alive, and likely to live at least for some hours, and the Rufford people generally were glad that they had not put off the ball. Some of them who were staying in the house had already gone to bed, and Lady Penwether, with Miss Penge at her side, was making her last adieux in the drawing-room. The ball-room was reached from the drawing-room, with a vestibule between them, and opening from this was a small chamber, prettily furnished but seldom used, which had no peculiar purpose of its own, but in which during the present evening many sweet words had probably been spoken. Now, at this last moment, Lord Rufford and Arabella Trefoil were there alone together. She had just got up from a sofa, and he had taken her hand in his. She did not attempt to withdraw it, but stood looking down upon the ground. Then he passed his arm round her waist and lifting her face to his held her in a close embrace from which she made no effort to free herself. As soon as she was released she hastened to the door which was all but closed, and as she opened it and passed through to the drawing-room said some ordinary word to him quite aloud in her ordinary voice. If his action had disturbed her she knew very well how to recover her equanimity.","sourceLink":"http://novel.tingroom.com/duanpian/2716/74668.html","bookId":1435,"book":{"id":1435,"title":"The American Senator","description":"简介： I never could understand why anybody should ever have begun to live at Dillsborough, or why the population there should have been at any time recruited by new comers. That a man with a family should cling to a house in which he has once established h...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2716","creation":"Aug 1, 2019 12:25:06 AM","modification":"Aug 1, 2019 12:25:06 AM"}}
