{"id":66812,"no":17,"title":"Page 17","content":"46.\\n\\n I figure if I\u0027m going to haul my ass out to Huntington High by six a.m., then I was going to reward myself with some Krispy Kremes.\\n\\n Which I did, along with two containers of chocolate milk. I don\u0027t drink coffee, and since I\u0027m still looking to add some weight, whole chocolate milk has the kind of calories I\u0027m looking for.\\n\\n It was cool enough for the heater, and since I didn\u0027t want to waste all my precious calories shivering, I went ahead and cranked it up. With the ocean to my right, I drove languidly south along Pacific Coast Highway. I was not in a hurry and I had my donuts to keep me company. The ocean was slate gray and choppy this morning, but that did not stop the handful of faithful surfers, who dotted the breakers like so much flotsam.\\n\\n I turned up a street called Mariner, which, coincidentally, just happened to be Huntington High\u0027s mascot, and neatly finished the last of the Krispy Kremes, slugging it down with the remainder of the chocolate milk. I pulled into the visitor parking spot. My gun had traveled on the seat next to me; these days I kept it particularly handy.\\n\\n I licked my fingers clean before grabbing the gun and shoving it in my shoulder holster. I just hate sticky gun handles.\\n\\n I was waiting outside room 107 when I heard footsteps coming from the adjoining hallway. Instinctively I reached inside my jacket and rested my hand on the handle of the Browning. A man appeared from around the corner. He was young-looking and in his early thirties, thick black hair and a nice build. His face was narrow and clean-shaven. He was a handsome guy; worse, he knew it.\\n\\n When he saw me, he paused in mid-step.\\n\\n \"Bryan Dawson?\" I asked.\\n\\n He made an effort to smile broadly. It was a good smile, the kind that would melt any impressionable high schooler. However, I was not an impressionable high schooler.\\n\\n \"You are the detective,\" he said, brushing past me, knocking a shoulder into mine. It was a calculated shoulder strike, but I didn\u0027t move. He careened briefly off-balance and only recovered by grabbing the door handle.\\n\\n \"Pardon you,\" I said. \"Are you okay?\"\\n\\n \"Oh, yes, sorry. A little clumsy this early in the morning.\"\\n\\n He had known of me, which I found interesting. Someone had hired the thug, too; someone who had known of me as well.\\n\\n \"Don\u0027t worry about it. I\u0027m just glad your shoulder is okay,\" I said jovially. \"How do you know me?\"\\n\\n \"Someone pointed you out the other day when the police arrived for Coach Castleton. Weren\u0027t you the one who found him?\"\\n\\n \"Yes.\"\\n\\n \"Must have been awful,\" he said. \"Seeing his brains and shit all over the place.\"\\n\\n His gaze was unwavering and challenging. I didn\u0027t like him. He was cocky, loud, and too sure of himself.\\n\\n \"It was more awful that he found it necessary to end his life. The murder of Amanda Peterson has had significant repercussions. Not to mention an innocent boy is in jail for the crime.\"\\n\\n \"The police don\u0027t seem to think he\u0027s so innocent. For them it\u0027s an open and shut case.\"\\n\\n \"Luckily for Derrick, I don\u0027t think it\u0027s so open and shut.\"\\n\\n \"Which means what? You\u0027re only a private dick.\"\\n\\n \"Means I\u0027m going to find the killer.\"\\n\\n \"So what can I do for you?\"\\n\\n \"May I come in?\"\\n\\n \"No.\"\\n\\n \"Did you have a relationship with Amanda?\"\\n\\n \"I was her band director.\"\\n\\n \"Did you have a relationship with her outside of school?\"\\n\\n \"Of course not.\"\\n\\n \"Where were you on the night of Amanda Peterson\u0027s murder?\"\\n\\n \"I have nothing left to say to you.\"\\n\\n \"Of course you don\u0027t.\"\\n\\n And he promptly shut the door in my face.\\n\\n Jim Knighthorse, master interrogator.\\n\\n 47.\\n\\n It was late and we were at a restaurant called Waters in the city of Irvine. Coincidentally, a small, foul-smelling, man-made lake sat next to the restaurant. I wondered what came first: The lake or the restaurant?\\n\\n Vice Principal Dana Williams had pushed hard for this meeting, so I agreed to meet her here. I sensed she liked me. I also sensed she was a very lonely woman. So why had I agreed? I didn\u0027t know entirely. She was loosely connected to my case, so I could always justify the meeting in that way. I was also lonely myself. Very lonely. Perhaps we were just two lost souls meeting in the night, at a pretentiously named restaurant.\\n\\n \"Do you talk to your ex-girlfriend much?\" asked Mrs. Williams. She emphasized the ex part a little too much.\\n\\n \"She\u0027s not my ex. We\u0027re just taking a break from all the action.\"\\n\\n \"What sort of action?\" she asked.\\n\\n \"Nevermind,\" I said. I didn\u0027t feel like talking about it, especially someone who was all for my break up with Cindy. Anyone who was all for my break up with Cindy was no friend of mine.\\n\\n \"Do you always speak in football jargon?\" she asked.\\n\\n We were seated outside, on the wide, wooden deck that wrapped around the entire restaurant. We had a great view of the fake lake. A duck floated nearby. It could have been fake, too, but I doubted it.\\n\\n \"Yes,\" I said simply.\\n\\n \"I see,\" she said. She toyed with the red straw sticking out of her margarita. If my lack of enthusiasm for our meeting was making her uncomfortable, she didn\u0027t show it. I sensed that she saw me as a challenge. \"Do you think I\u0027m pretty?\" she asked suddenly.\\n\\n Admittedly, the question caught me off-guard. I looked at her from across the table. She was looking ravishing, to say the least. A tight blouse that showed way too much of her chest. Make-up that seemed expertly applied. Hair perfectly framing her pretty face.\\n\\n \"Yeah,\" I said. I wasn\u0027t in the mood to dance around the subject.\\n\\n She beamed, pleased.\\n\\n Our food arrived. Clams for her. A burger for me. I ate the fries first. She watched me eat. She was about to ask me something, probably something about Cindy, when I cut her off. Enough of the bullshit.\\n\\n \"So how long have you been separated?\" I asked.\\n\\n She shrugged, sipped her drink. \"I don\u0027t know.\"\\n\\n \"You don\u0027t know?\"\\n\\n She leveled her stare at me and I was reminded again that she was very much the vice principal of discipline at Huntington High. When she spoke, she lowered her voice ominously. \"I don\u0027t remember, exactly. A few years I suppose. Is that okay?\"\\n\\n \"Hey, I\u0027m okay if you\u0027re okay,\" I said, and very much wanted to get the hell out of here. Mrs. Williams\u0027s apparent ability to go from flirtatious to bitch was alarming at best.\\n\\n We ate our food in silence. Actually, I ate and she toyed. I wondered what the clams thought about being killed only to be toyed with.\\n\\n Probably be pissed off.\\n\\n \"Do you think Derrick killed Amanda?\" I asked suddenly. Hey, might as well get some work done. In the least, I could write the dinner off for tax purposes.\\n\\n \"Yes,\" she said immediately.\\n\\n \"Why?\"\\n\\n \"He had motive and he had the murder weapon.\"\\n\\n \"Damning evidence,\" I said. \"Except that all indications seem to point that he was truly in love with Amanda.\"\\n\\n \"Which would make his jealousy all the more unpredictable,\" she said. \"Wouldn\u0027t it?\"\\n\\n I shrugged. I didn\u0027t like answering leading questions.\\n\\n We continued to eat. Just beyond, the duck floated unmovingly. I was now certain it was fake. Or asleep.\\n\\n While we ate, I could sense Mrs. Williams watching me. Her watching me made me uncomfortable in a way I couldn\u0027t quite put my finger on. Perhaps I sensed in her an unpredictability. She reminded me of my father in that way. Happy one moment, a real piece of work the next.\\n\\n And for perhaps the hundredth time that evening, I wished with all my heart that Cindy was sitting across from me. I missed her laugh, her smile, her scent. Her everything.\\n\\n When the bill came, I quickly paid it and we left. As we exited the restaurant, Mrs. Williams looped her arm through mine. I think I shuddered a little.\\n\\n I walked her to her car, where we stood awkwardly for a few moments. I wanted to leave but she wouldn\u0027t release my arm. Above, the tiny sliver of moon reflected the hollow feeling inside me.\\n\\n \"I had a great time tonight,\" she said.\\n\\n Her words took me by surprise. What date had she been on? I had been miserable.\\n\\n \"We should do it again sometime,\" she added.\\n\\n I nodded dumbly and just wanted to leave. Finally she released my arm and surprised me again by planting a big, wet kiss on my lips. She pulled away and grinned warmly, then got in her massive SUV and drove off.\\n\\n I stood there in the parking lot, watching her go.\\n\\n I wanted to run to Cindy.\\n\\n But I didn\u0027t. Instead, on the way home, I bought a case of beer and drank the night away.\\n\\n 48.\\n\\n I went on a seven mile jog the next morning. I kept an easy pace, and my leg only hurt a little, which was encouraging. I showered and shaved at home, then headed for the office, where I kept my office door locked and the Browning on the desk next to me.\\n\\n I called Donna Trigger. A girl answered and told me that Donna had classes this morning but I could try later in the afternoon. I said I would, she said cool, popped a bubble and hung up.\\n\\n Next I called Sanchez on his cell and asked him to run Bryan Dawson\u0027s name through his data base and see what turned up. He said no problem and that if it weren\u0027t for me he wouldn\u0027t have shit to do, nevermind his caseload of homicides to solve. I hung up on him in mid-rant.\\n\\n I sat back in my chair and realized I had no real clues or suspects, other than two lecherous men with a fondness for young girls. This was so depressing that I felt it necessary to take a nap. I usually don\u0027t need much convincing when it comes to naps.\\n\\n The phone woke me. It was just before noon.\\n\\n \"Hi,\" said a soft voice. My heart lurched. It was Cindy.\\n\\n \"Hello.\"\\n\\n \"Can I see you?\"\\n\\n \"Sure.\"\\n\\n \"I\u0027ll be there in twenty minutes.\"\\n\\n I hung up and sat at my desk for a minute or two until I realized I was holding my breath. I let it out slowly. Within the next few minutes the course of my life would be set. Amazingly, it was out of my hands, and in Cindy\u0027s alone.\\n\\n I stood off to the side of my window, looking down onto Beach Blvd, the blinds partly open. Hauling ass down the street and turning dangerously in front of a white pickup, Cindy arrived in her silver Lexus. I could hear the pickup\u0027s angry horn from here.\\n\\n And trailing behind Cindy was a blue Taurus. Not normally a big deal, granted, but sitting in the driver\u0027s seat was my friend the hitman. He continued on past my building and made a left and disappeared.\\n\\n He made two mistakes: the first was that I made his plate. The second was that he had involved Cindy.\\n\\n My phone rang. I grabbed it.\\n\\n \"You\u0027re girlfriend\u0027s cute. Back off, or she\u0027s dead.\" The line went dead.\\n\\n I immediately called Sanchez and got his voice mail. I left the plate number for him to run. Now I was going to owe Sanchez another dinner. So what else was new?\\n\\n Next I unlocked the door and paced before my couch, trying like hell to get the killer out of my mind and focus on Cindy. To focus on us.\\n\\n Moving along the cement walkway, heals clicking rapidly along, I could hear Cindy coming.\\n\\n My hands were sweating; my shoulders were knotted. I resented her for putting me through this. We had been serious for eight years. She knew the dangers inherent to my profession, but she also knew that I could handle them. The only new twist was my interest in resuming my football career; well, and the drinking.\\n\\n The door to my office opened, and she stood there holding a beautiful bouquet of wildflowers. She came in and set the flowers down on the desk, then threw her arms around me. Her lips found mine and we kissed like lost lovers, which, for a few days, we were. We fumbled our way to the couch, and there we made up for lost time.\\n\\n And the direction of my life became clear again.\\n\\n Damn clear. \\n\\n","sourceLink":"https://allnovel.net/dark-horse-jim-knighthorse-1/page-17.html","bookId":2351,"book":{"id":2351,"title":"Dark Horse (Jim Knighthorse #1)","description":"Storyline: Dark Horse (Jim Knighthorse #1) \\n When high school student Derrick Booker, the only black student at a posh Orange County high school, is accused of killing his white girlfriend, ex-college football hero and detective Jim Knighthorse is hired to dig a little deeper into the murder. It doesn\u0027t take long for Knighthorse to realize that not all is as it seems at tranquil Huntington High, from a band director who preys on the innocent to a vice-principal with a secret agenda of her own. Not to mention someone\u0027s hired a professional killer to keep Knighthorse permanently off the case. As the investigation continues, Knighthorse\u0027s personal life is shattered by the discovery of new evidence relating to his mother\u0027s unsolved murder, a murder dating back twenty years. Reeling from the discovery, a determined Jim Knighthorse sets out to bring two killers to justice.\\n","cover":"https://allnovel.net/images/dark-horse-jim-knighthorse-1.jpg","author":"J.R. Rain","type":"Mystery","source":"allnovel","link":"https://allnovel.net/dark-horse-jim-knighthorse-1.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:02:10 AM"}}
