{"id":66799,"no":4,"title":"Page 4","content":"7.\\n\\n The field was wet with dew, and a low wispy mist hung over the grass. The mist made the morning look colder than it really was. Sanchez and I had been doing sprints along the width of Long Beach State\u0027s football field for the past twenty minutes. Sweat streamed down my face, and I probably had a healthy, athletic glow about me. I tried desperately to ignore the pain in my right leg. But the pain was there. Persistent, throbbing and threatening to become something more serious. But I pushed on.\\n\\n \"You\u0027re pretty fast,\" I said to Sanchez. \"For a cop.\"\\n\\n \"I\u0027ve got to work off the donuts.\"\\n\\n We finished another set of sprints and were now standing around, sucking wind like we had done at UCLA years earlier, when we had both been young and not so innocent. When the world had been my oyster. Before I had shattered my leg, and before Sanchez had become an LAPD homicide detective.\\n\\n There were now two female joggers circling the track around us, dressed in long black nylon jogging pants and wearing white baseball caps. They moved spryly, their identical ponytails swishing along their angular shoulder blades.\\n\\n \"Sooner or later we\u0027re going to have to run to the other side of the field,\" said Sanchez. He spoke with a slight Hispanic accent when he wasn\u0027t careful, or when he was tired. He was tired. He was watching the two joggers. \"Unless you prefer to watch them all morning long.\"\\n\\n \"Worse ways of spending a morning.\"\\n\\n \"How\u0027s the leg holding up?\"\\n\\n I shrugged.\\n\\n Sanchez grinned. \"That good, huh?\"\\n\\n We ran back to the other side of the field, just in time to meet the two women again, who swished past us with a casual glance or two. One of them said something and the other giggled.\\n\\n \"They\u0027re laughing at you,\" said Sanchez.\\n\\n \"Wouldn\u0027t be the first time,\" I said. \"By the way, I beat you this time. Bum leg and all. How does that make you feel?\"\\n\\n \"Maybe I should shoot myself.\"\\n\\n \"Got a gun in my gym bag.\"\\n\\n \"So do I.\"\\n\\n We raced back and as far as I could tell we were dead even this time, pulling up just past the far sidelines. The throb in my leg was feeling unhealthy. We had done this for the past thirty minutes.\\n\\n \"We\u0027re even on that last run,\" said Sanchez. \"So I say we call it a morning. Baby steps. This is your first day back in training. Want to take it easy on the leg, especially a man your age.\"\\n\\n \"You\u0027re only a month younger.\"\\n\\n \"Lot can happen in a month.\"\\n\\n \"True.\"\\n\\n We sat on a bench wet with dew. The mist was all pervasive, leaving nothing untouched. I enjoyed the solitude it allowed.\\n\\n \"You going back with me to San Diego?\" I asked. \"To try out?\"\\n\\n He laughed, and kept his dark eyes on the joggers. \"I wasn\u0027t the one they asked to come out of retirement.\"\\n\\n \"You could make it.\"\\n\\n \"I was good, but not that good,\" he said. The mist was dispersing and more light was getting through. There were also more joggers now, three males, but these were not as interesting to look at.\\n\\n Sanchez checked his watch. \"Most people with respectable jobs have to get going now.\"\\n\\n \"Luckily, neither of us have respectable jobs.\"\\n\\n \"True,\" said Sanchez. \"So who do you think did this girl?\"\\n\\n \"Don\u0027t know,\" I said. \"That\u0027s the part I\u0027m working on.\"\\n\\n \"Isn\u0027t it just your job to get the kid off? And to give a damn who really killed the girl?\"\\n\\n \"But I do give a damn who killed her.\"\\n\\n \"You always do. But you shouldn\u0027t. It\u0027s not your job, at least not on this case. Your job is to spring the kid before he goes to trial.\"\\n\\n I said nothing.\\n\\n \"I know,\" said Sanchez, \"I know. You\u0027ll do it your way.\"\\n\\n I smiled brightly. \"Exactly.\"\\n\\n 8.\\n\\n I was sitting outside Huntington High in my car, on a stretch of road that overlooked the Pacific Ocean. My windows were down and the engine was off; a cool breeze wafted through the car. Life was good at the Beach.\\n\\n It was three o\u0027clock and school was just getting out. High schoolers nowadays are younger and smaller than I remember, although the occasional curvy creature sashayed by. Most of the girls wore unflattering jeans that rode low on the hip, showed a lot of tanned flesh and a surprising amount of lower back tattoos. The high school boys were spiked, pierced and dyed. Those who weren\u0027t natural blonds, wanted to be. Huntington High probably had a very popular surfing club. My old high school in Inglewood did not have a surfing club. We had metal detectors and hired security that were referred to as The Staff.\\n\\n More than one Mercedes whipped out of the student parking lot, followed by nineteen different Mustangs, and twenty-two of the new Volkswagen bugs. I saw exactly seventeen near-fatal car accidents in the span of forty-five seconds.\\n\\n The less fortunate, and those not of driving age, waited in line and boarded the various yellow school buses. Other students walked, some passing my Cobra. I was promptly ignored, being an Old Man, and Not Very Interesting.\\n\\n I didn\u0027t blame them, although my ego was crushed a little.\\n\\n All in all, I saw a fair share of Asians and Hispanics, but no blacks.\\n\\n Teachers on duty did their best to clear out the lingering students from the front halls. The buses pulled away. And the potential smash-up derby that was the student parking lot cleared away shockingly fast and without a single incident. I waited another ten minutes, then left my car there on the hill, and headed up to the administration building at the front of the school.\\n\\n The building, and much of the school, was old cinder block, bright with a fresh coat of powder blue. A very school-like color. I stepped into the mostly empty admin office. There was a receptionist behind her desk, pen in hand and working furiously. She was young and pretty, probably a school senior. I stepped up to the front desk.\\n\\n \"Hello,\" I said.\\n\\n She jumped. She had been writing a personal letter, probably when she should have been working. Should I be tempted to read her musings, she quickly covered the letter with her folded hands. But not well enough. I saw the words: asshole, love and booty used repeatedly. Further proof that there\u0027s nothing so sweet in life as love\u0027s young dream.\\n\\n When she had recovered enough to speak, she said, \"Can I help you?\"\\n\\n I smiled engagingly and showed her my investigator license.\\n\\n A hell of a picture.\\n\\n \"Doesn\u0027t look like you.\"\\n\\n \"It\u0027s me, I swear.\" I struck a similar pose, turning my head a little to the side, and blasted her with the same full wattage smile. \"See?\"\\n\\n She shrugged. \"The guy in the picture is cuter.\"\\n\\n I wasn\u0027t sure if I should be offended. After all, it was me in the picture, and she was calling that guy cute.\\n\\n \"So you\u0027re a private investigator?\"\\n\\n \"Yep.\"\\n\\n She nodded, but her interest was already waning.\\n\\n \"I give autographs, too,\" I said.\\n\\n \"I don\u0027t want your autograph.\"\\n\\n \"Of course not. Who would I see about gaining permission to access your school?\"\\n\\n \"You need to speak with Mrs. Williams.\"\\n\\n \"Great.\"\\n\\n \"Let me see if she\u0027s in.\"\\n\\n \"That would be fantastic.\"\\n\\n \"Are you always this cheery?\"\\n\\n \"Yes!\"\\n\\n \"Hold on.\"\\n\\n \"Super!\"\\n\\n She removed herself from her post, snatched up her letter, and stepped down the hall and peeked into one of the open doors. I sat down in one of the plastic chairs lining the wall and made it a point to look cheery as hell. The office was covered with senior year group photographs, dating back to the forties. The photos were lined end to end and circled the room above the windows.\\n\\n \"Mrs. Williams will see you now, Mr. Knighthorse.\"\\n\\n \"Keen.\"\\n\\n \"Keen?\"\\n\\n \"I was running out of superlatives.\"\\n\\n 9.\\n\\n The brass nameplate on Mrs. Williams\u0027s desk designated her as vice principal in charge of discipline. Ah, she would be the one the students hated and likened to Hitler, as all students did in all high schools to any vice principal in charge of discipline.\\n\\n One difference.\\n\\n She couldn\u0027t have been prettier.\\n\\n Mrs. Williams stood from behind her desk and shook my hand vigorously. She gestured for me to sit and I did. She was young, perhaps the same age as me. Her hair hung loose around her shoulders and I had the impression she had recently set it free from a tight bun. Of course, the three bobby pins sitting next to her computer mouse were a dead giveaway.\\n\\n I am, of course, a detective.\\n\\n Mrs. Williams wore a white blouse with a wide collar that fanned across her collar bones. Her face was thin and pleasantly narrow. Of course, the intelligence behind her emerald eyes were the dead giveaway that she was something more than just a pretty face. A lot more. The eyes were arresting and disarming, true. But, good Christ, they were penetratingly cold. Chips of ice. She leveled them at me now and I squirmed in my seat.\\n\\n \"You seem a bit preoccupied, Mr. Knighthorse,\" said Mrs. Williams. \"You must have a lot on your mind.\"\\n\\n Her voice was a little husky, and a lot of sexy. The chest beneath her blouse seemed full, and heaved slightly with each breath.\\n\\n \"I was just wishing I had had you as my vice principal in high school.\"\\n\\n She did not blush, and her gaze did not flick away from mine. \"What are you implying?\"\\n\\n \"You are a looker, Mrs. Williams.\"\\n\\n She cracked a smile, and placed one hand carefully on top of the other. I could see her wedding band clearly. A plain gold band.\\n\\n \"A looker?\"\\n\\n \"Means I think you\u0027re swell.\"\\n\\n \"Lord. Is this some sort of come-on line?\"\\n\\n \"You\u0027re married, and I\u0027m happily dating the love of my life. I am simply warming you up to get what I need.\"\\n\\n \"At least you\u0027re honest about your intentions.\"\\n\\n \"That, and I think you\u0027re a looker.\"\\n\\n \"What do you need, Knighthorse?\"\\n\\n \"What happened to the mister?\"\\n\\n \"Anyone who calls me a looker loses that formal courtesy.\"\\n\\n \"Is that a fancy way of saying I\u0027m warming up to you?\"\\n\\n \"Yes.\"\\n\\n \"Good. Because I need access to your school.\"\\n\\n \"What sort of access?\"\\n\\n Behind her the blinds were open, and I had a shot of an open quad. From here, Mrs. Williams could see much of the school. It was a good view for the vice principal of discipline to have.\\n\\n \"I\u0027m here to investigate the murder of Amanda Peterson,\" I said. Her eyes did not waiver. I forged on. \"To do so I will need to speak to witnesses.\"\\n\\n \"There are no witnesses to Amanda\u0027s murder here.\"\\n\\n \"But there are those here who could provide me some assistance, including yourself.\"\\n\\n She leaned forward and looked down at her ring. Her smooth face had the beginnings of crow\u0027s feet. She used her thumb to toy with the ring, spinning it around her narrow finger. I wondered if perhaps she was regretting the ring was on, and thus losing an opportunity to be with yours truly. Or perhaps not.\\n\\n \"I\u0027ll give you access, but not during school hours, and no speaking with students.\"\\n\\n \"Agreed.\"\\n\\n \"Now what do you need from me?\"\\n\\n \"Was Derrick the only African-American in school?\"\\n\\n \"No. There are three others. The papers were incorrect.\"\\n\\n \"Was he a good student?\"\\n\\n \"Exceptional. He carried a 4.0 GPA. Was on his way to USC for a full football scholarship. The world was his oyster.\"\\n\\n \"Well, I certainly wouldn\u0027t call USC an oyster, Mrs. Williams. Maybe a parasitic tiger mussel that\u0027s currently infesting the Great Lakes.\"\\n\\n \"Nice imagery. UCLA fan?\"\\n\\n \"And their best fullback.\"\\n\\n She raised an eyebrow. \"Yes, I can see that. You are a big boy.\"\\n\\n \"Was Derrick capable of killing?\" I asked.\\n\\n She spread her hands flat on the desk and smiled at me. \"Derrick was strong and excelled at a violent sport. Physically he could have done it. If you are inquiring about his psyche, you are barking up the wrong tree. Derrick and I rarely crossed paths. He kept his nose clean, as my father would say.\"\\n\\n \"And being in charge of discipline, you would know.\"\\n\\n \"I would.\"\\n\\n \"Can you tell me anything about Amanda?\"\\n\\n \"She was more trouble. But petty stuff, really. Nothing serious.\"\\n\\n \"Like what?\"\\n\\n \"Skipping class, smoking on school grounds.\"\\n\\n \"She and Derrick an item?\"\\n\\n \"Yes. The whole school knew that. He was our star athlete.\"\\n\\n \"And black in a nearly all-white school. Did he ever have any problems with racism?\"\\n\\n \"As far as I knew, he was wildly popular among his fellow class mates.\"\\n\\n \"Amanda was in the school band?\"\\n\\n She paused, then shrugged. \"I do not know. Maybe.\"\\n\\n \"I was told she quit. Any reason why?\"\\n\\n \"Refer to my prior comment.\"\\n\\n I didn\u0027t like the answer. Mrs. Williams probably had access to Amanda\u0027s file, and certainly would have read it since the murder. Band membership would have been in the official records.\\n\\n \"And Knighthorse,\" she said, \"I am definitely not the kind of principal you wish you had in high school. Students are never, ever pleased to be sitting where you are now.\"\\n\\n I smiled. \"I\u0027m not a student. And it\u0027s not a bad view from here, Mrs. Williams.\"\\n\\n Most women would have blushed. She did not.\\n\\n I left her office. \\n\\n","sourceLink":"https://allnovel.net/dark-horse-jim-knighthorse-1/page-4.html","bookId":2351,"book":{"id":2351,"title":"Dark Horse (Jim Knighthorse #1)","description":"Storyline: Dark Horse (Jim Knighthorse #1) \\n When high school student Derrick Booker, the only black student at a posh Orange County high school, is accused of killing his white girlfriend, ex-college football hero and detective Jim Knighthorse is hired to dig a little deeper into the murder. It doesn\u0027t take long for Knighthorse to realize that not all is as it seems at tranquil Huntington High, from a band director who preys on the innocent to a vice-principal with a secret agenda of her own. Not to mention someone\u0027s hired a professional killer to keep Knighthorse permanently off the case. As the investigation continues, Knighthorse\u0027s personal life is shattered by the discovery of new evidence relating to his mother\u0027s unsolved murder, a murder dating back twenty years. Reeling from the discovery, a determined Jim Knighthorse sets out to bring two killers to justice.\\n","cover":"https://allnovel.net/images/dark-horse-jim-knighthorse-1.jpg","author":"J.R. Rain","type":"Mystery","source":"allnovel","link":"https://allnovel.net/dark-horse-jim-knighthorse-1.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:02:10 AM"}}
