{"id":17579,"no":172,"title":"CHAPTER XI.","content":"1712-1756. MONTCALM. War declared ? State of Europe ? Pompadour and Maria Theresa ? Infatuation of the French Court ? The European War ? Montcalm to command in America ? His early Life ? An intractable Pupil ? His Marriage ? His Family ? His Campaigns ? Preparation for America ? His Associates ? Lévis, Bourlamaque, Bougainville ? Embarkation ? The Voyage ? Arrival ? Vaudreuil ? Forces of Canada ? Troops of the Line, Colony Troops, Militia, Indians ? The Military Situation ? Capture of Fort Bull ? Montcalm at Ticonderoga. On the eighteenth of May, 1756, England, after a year of open hostility, at length declared war. She had attacked France by land and sea, turned loose her ships to prey on French commerce, and brought some three hundred prizes into her ports. It was the act of a weak Government, supplying by spasms of violence what it lacked in considerate resolution. France, no match for her amphibious enemy in the game of marine depredation, cried out in horror; and to emphasize her complaints and signalize a pretended good faith which her acts had belied, ostentatiously released a British frigate captured by her cruisers. She in her turn declared war on the ninth of June: and now began the most terrible conflict of the eighteenth century; 353 V1 one that convulsed Europe and shook America, India, the coasts of Africa, and the islands of the sea. In Europe the ground was trembling already with the coming earthquake. Such smothered discords, such animosities, ambitions, jealousies, possessed the rival governments; such entanglements of treaties and alliances, offensive or defensive, open or secret,—that a blow at one point shook the whole fabric. Hanover, like the heel of Achilles, was the vulnerable part for which England was always trembling. Therefore she made a defensive treaty with Prussia, by which each party bound itself to aid the other, should its territory be invaded. England thus sought a guaranty against France, and Prussia against Russia. She had need. Her King, Frederic the Great, had drawn upon himself an avalanche. Three women—two empresses and a concubine—controlled the forces of the three great nations, Austria, Russia, and France; and they all hated him: Elizabeth of Russia, by reason of a distrust fomented by secret intrigue and turned into gall by the biting tongue of Frederic himself, who had jibed at her amours, compared her to Messalina, and called her \"infame catin du Nord;\" Maria Theresa of Austria, because she saw in him a rebellious vassal of the Holy Roman Empire, and, above all, because he had robbed her of Silesia; Madame de Pompadour, because when she sent him a message of compliment, he answered, \"Je ne la connais pas,\" forbade his ambassador to visit her, and in his 354 V1 mocking wit spared neither her nor her royal lover. Feminine pique, revenge, or vanity had then at their service the mightiest armaments of Europe. The recovery of Silesia and the punishment of Frederic for his audacity in seizing it, possessed the mind of Maria Theresa with the force of a ruling passion. To these ends she had joined herself in secret league with Russia; and now at the prompting of her minister Kaunitz she courted the alliance of France. It was a reversal of the hereditary policy of Austria; joining hands with an old and deadly foe, and spurning England, of late her most trusty ally. But France could give powerful aid against Frederic; and hence Maria Theresa, virtuous as she was high-born and proud, stooped to make advances to the all-powerful mistress of Louis XV., wrote her flattering letters, and addressed her, it is said, as \"Ma chère cousine.\" Pompadour was delighted, and could hardly do enough for her imperial friend. She ruled the King, and could make and unmake ministers at will. They hastened to do her pleasure, disguising their subserviency by dressing it out in specious reasons of state. A conference at her summer-house, called Babiole, \"Bawble,\" prepared the way for a treaty which involved the nation in the anti-Prussian war, and made it the instrument of Austria in the attempt to humble Frederic,—an attempt which if successful would give the hereditary enemy of France a predominance over Germany. France engaged to aid the cause with twenty-four thousand men; but in the zeal of her 355 V1 rulers began with a hundred thousand. Thus the three great Powers stood leagued against Prussia. Sweden and Saxony joined them; and the Empire itself, of which Prussia was a part, took arms against its obnoxious member. Never in Europe had power been more centralized, and never in France had the reins been held by persons so pitiful, impelled by motives so contemptible. The levity, vanity, and spite of a concubine became a mighty engine to influence the destinies of nations. Louis XV., enervated by pleasures and devoured by ennui, still had his emotions; he shared Pompadour\u0027s detestation of Frederic, and he was tormented at times by a lively fear of damnation. But how damn a king who had entered the lists as champion of the Church? England was Protestant, and so was Prussia; Austria was supremely Catholic. Was it not a merit in the eyes of God to join her in holy war against the powers of heresy? The King of the Parc-aux-Cerfs would propitiate Heaven by a new crusade. Henceforth France was to turn her strength against her European foes; and the American war, the occasion of the universal outbreak, was to hold in her eyes a second place. The reasons were several: the vanity of Pompadour, infatuated by the advances of the Empress-Queen, and eager to secure her good graces; the superstition of the King; the anger of both against Frederic; the desire of D\u0027Argenson, minister of war, that the army, and not the navy, should play the foremost 356 V1 part; and the passion of courtiers and nobles, ignorant of the naval service, to win laurels in a continental war,—all conspired to one end. It was the interest of France to turn her strength against her only dangerous rival; to continue as she had begun, in building up a naval power that could face England on the seas and sustain her own rising colonies in America, India, and the West Indies: for she too might have multiplied herself, planted her language and her race over all the globe, and grown with the growth of her children, had she not been at the mercy of an effeminate profligate, a mistress turned procuress, and the favorites to whom they delegated power. Still, something must be done for the American war; at least there must be a new general to replace Dieskau. None of the Court favorites wanted a command in the backwoods, and the minister of war was free to choose whom he would. His choice fell on Louis Joseph, Marquis de Montcalm-Gozon de Saint-Véran. Montcalm was born in the south of France, at the Chateau of Candiac, near N?mes, on the twenty-ninth of February, 1712. At the age of six he was placed in the charge of one Dumas, a natural son of his grandfather. This man, a conscientious pedant, with many theories of education, ruled his pupil stiffly; and, before the age of fifteen, gave him a good knowledge of Latin, Greek, and history. Young Montcalm had a taste for books, continued his reading in such intervals 357 V1 of leisure as camps and garrisons afforded, and cherished to the end of his life the ambition of becoming a member of the Academy. Yet, with all his liking for study, he sometimes revolted against the sway of the pedagogue who wrote letters of complaint to his father protesting against the \"judgments of the vulgar, who, contrary to the experience of ages, say that if children are well reproved they will correct their faults.\" Dumas, however, was not without sense, as is shown by another letter to the elder Montcalm, in which he says that the boy had better be ignorant of Latin and Greek \"than know them as he does without knowing how to read, write, and speak French well.\" The main difficulty was to make him write a good hand,—a point in which he signally failed to the day of his death. So refractory was he at times, that his master despaired. \"M. de Montcalm,\" Dumas informs the father, \"has great need of docility, industry, and willingness to take advice. What will become of him?\" The pupil, aware of these aspersions, met them by writing to his father his own ideas of what his aims should be. \"First, to be an honorable man, of good morals, brave, and a Christian. Secondly, to read in moderation; to know as much Greek and Latin as most men of the world; also the four rules of arithmetic, and something of history, geography, and French and Latin belles-lettres, as well as to have a taste for the arts and sciences. Thirdly, and above all, to be obedient, docile, and very submissive to your orders and those of my 358 V1 dear mother; and also to defer to the advice of M. Dumas. Fourthly, to fence and ride as well as my small abilities will permit.\" [361] [361] This passage is given by Somervogel from the original letter. If Louis de Montcalm failed to satisfy his preceptor, he had a brother who made ample amends. Of this infant prodigy it is related that at six years he knew Latin, Greek, and Hebrew, and had some acquaintance with arithmetic, French history, geography, and heraldry. He was destined for the Church, but died at the age of seven; his precocious brain having been urged to fatal activity by the exertions of Dumas. Other destinies and a more wholesome growth were the lot of young Louis. At fifteen he joined the army as ensign in the regiment of Hainaut. Two years after, his father bought him a captaincy, and he was first under fire at the siege of Philipsbourg. His father died in 1735, and left him heir to a considerable landed estate, much embarrassed by debt. The Marquis de la Fare, a friend of the family, soon after sought for him an advantageous marriage to strengthen his position and increase his prospects of promotion; and he accordingly espoused Mademoiselle Angélique Louise Talon du Boulay,—a union which brought him influential alliances and some property. Madame de Montcalm bore him ten children, of whom only two sons and four daughters were living in 1752. \"May God preserve them all,\" he writes in his autobiography, \"and make them prosper for this world and the next! Perhaps 359 V1 it will be thought that the number is large for so moderate a fortune, especially as four of them are girls; but does God ever abandon his children in their need?\" \"\u0027Aux petits des oiseaux il donne la pature, Et sa bonté s\u0027étend sur toute la nature.\u0027\" He was pious in his soldierly way, and ardently loyal to Church and King. His family seat was Candiac; where, in the intervals of campaigning, he found repose with his wife, his children, and his mother, who was a woman of remarkable force of character and who held great influence over her son. He had a strong attachment to this home of his childhood; and in after years, out of the midst of the American wilderness, his thoughts turned longingly towards it. \"Quand reverrai-je mon cher Candiac!\" In 1741 Montcalm took part in the Bohemian campaign. He was made colonel of the regiment of Auxerrois two years later, and passed unharmed through the severe campaign of 1744. In the next year he fought in Italy under Maréchal de Maillebois. In 1746, at the disastrous action under the walls of Piacenza, where he twice rallied his regiment, he received five sabre-cuts,—two of which were in the head,—and was made prisoner. Returning to France on parole, he was promoted in the year following to the rank of brigadier; and being soon after exchanged, rejoined the army, and was again wounded by a musket-shot. The peace of Aix-la-Chapelle now 360 V1 gave him a period of rest. [362] At length, being on a visit to Paris late in the autumn of 1755, the minister, D\u0027Argenson, hinted to him that he might be appointed to command the troops in America. He heard no more of the matter till, after his return home, he received from D\u0027Argenson a letter dated at Versailles the twenty-fifth of January, at midnight. \"Perhaps, Monsieur,\" it began, \"you did not expect to hear from me again on the subject of the conversation I had with you the day you came to bid me farewell at Paris. Nevertheless I have not forgotten for a moment the suggestion I then made you; and it is with the greatest pleasure that I announce to you that my views have prevailed. The King has chosen you to command his troops in North America, and will honor you on your departure with the rank of major-general.\" [362] The account of Montcalm up to this time is chiefly from his unpublished autobiography, preserved by his descendants, and entitled Mémoires pour servir à l\u0027Histoire de ma Vie. Somervogel, Comme on servait autrefois; Bonnechose, Montcalm et le Canada; Martin, Le Marquis de Montcalm; éloge de Montcalm; Autre éloge de Montcalm; Mémoires sur le Canada, 1749-1760, and other writings in print and manuscript have also been consulted. The Chevalier de Lévis, afterwards Marshal of France, was named as his second in command, with the rank of brigadier, and the Chevalier de Bourlamaque as his third, with the rank of colonel; but what especially pleased him was the appointment of his eldest son to command a regiment in France. He set out from Candiac for the Court, and occupied himself on the way with reading Charlevoix. \"I take great pleasure in 361 V1 it,\" he writes from Lyons to his mother; \"he gives a pleasant account of Quebec. But be comforted; I shall always be glad to come home.\" At Paris he writes again: \"Don\u0027t expect any long letter from me before the first of March; all my business will be done by that time, and I shall begin to breathe again. I have not yet seen the Chevalier de Montcalm [his son]. Last night I came from Versailles, and am going back to-morrow. The King gives me twenty-five thousand francs a year, as he did to M. Dieskau, besides twelve thousand for my equipment, which will cost me above a thousand crowns more; but I cannot stop for that. I embrace my dearest and all the family.\" A few days later his son joined him. \"He is as thin and delicate as ever, but grows prodigiously tall.\" On the second of March he informs his mother, \"My affairs begin to get on. A good part of the baggage went off the day before yesterday in the King\u0027s wagons; an assistant-cook and two liverymen yesterday. I have got a good cook. Estève, my secretary, will go on the eighth; Joseph and Déjean will follow me. To-morrow evening I go to Versailles till Sunday, and will write from there to Madame de Montcalm [his wife]. I have three aides-de-camp; one of them, Bougainville, a man of parts, pleasant company. Madame Mazade was happily delivered on Wednesday; in extremity on Friday with a malignant fever; Saturday and yesterday, reports favorable. I go there twice a day, and am just going now. She 362 V1 has a girl. I embrace you all.\" Again, on the fifteenth: \"In a few hours I set out for Brest. Yesterday I presented my son, with whom I am well pleased, to all the royal family. I shall have a secretary at Brest, and will write more at length.\" On the eighteenth he writes from Rennes to his wife: \"I arrived, dearest, this morning, and stay here all day. I shall be at Brest on the twenty-first. Everything will be on board on the twenty-sixth. My son has been here since yesterday for me to coach him and get him a uniform made, in which he will give thanks for his regiment at the same time that I take leave in my embroidered coat. Perhaps I shall leave debts behind. I wait impatiently for the bills. You have my will; I wish you would get it copied, and send it to me before I sail.\" Reaching Brest, the place of embarkation, he writes to his mother: \"I have business on hand still. My health is good, and the passage will be a time of rest. I embrace you, and my dearest, and my daughters. Love to all the family. I shall write up to the last moment.\" No translation can give an idea of the rapid, abrupt, elliptical style of this familiar correspondence, where the meaning is sometimes suggested by a single word, unintelligible to any but those for whom it is written. At the end of March Montcalm, with all his following, was ready to embark; and three ships of the line, the \"Léopard,\" the \"Héros,\" and the \"Illustre,\" fitted out as transports, were ready to 363 V1 receive the troops; while the General, with Lévis and Bourlamaque, were to take passage in the frigates \"Licorne,\" \"Sauvage,\" and \"Sirène.\" \"I like the Chevalier de Lévis,\" says Montcalm, \"and I think he likes me.\" His first aide-de-camp, Bougainville, pleased him, if possible, still more. This young man, son of a notary, had begun life as an advocate in the Parliament of Paris, where his abilities and learning had already made him conspicuous, when he resigned the gown for the sword, and became a captain of dragoons. He was destined in later life to win laurels in another career, and to become one of the most illustrious of French navigators. Montcalm, himself a scholar, prized his varied talents and accomplishments, and soon learned to feel for him a strong personal regard. The troops destined for Canada were only two battalions, one belonging to the regiment of La Sarre, and the other to that of Royal Roussillon. Louis XV. and Pompadour sent a hundred thousand men to fight the battles of Austria, and could spare but twelve hundred to reinforce New France. These troops marched into Brest at early morning, breakfasted in the town, and went at once on board the transports, \"with an incredible gayety,\" says Bougainville. \"What a nation is ours! Happy he who commands it, and commands it worthily!\" [363] Montcalm and he embarked in the \"Licorne,\" and sailed on the third of April, leaving 364 V1 Lévis and Bourlamaque to follow a few days after. [364] [363] Journal de Bougainville. This is a fragment; his Journal proper begins a few weeks later. [364] Lévis à——, 5 Avril, 1756. The voyage was a rough one. \"I have been fortunate,\" writes Montcalm to his wife, \"in not being ill nor at all incommoded by the heavy gale we had in Holy Week. It was not so with those who were with me, especially M. Estève, my secretary, and Joseph, who suffered cruelly,—seventeen days without being able to take anything but water. The season was very early for such a hard voyage, and it was fortunate that the winter has been so mild. We had very favorable weather till Monday the twelfth; but since then till Saturday evening we had rough weather, with a gale that lasted ninety hours, and put us in real danger. The forecastle was always under water, and the waves broke twice over the quarter-deck. From the twenty-seventh of April to the evening of the fourth of May we had fogs, great cold, and an amazing quantity of icebergs. On the thirtieth, when luckily the fog lifted for a time, we counted sixteen of them. The day before, one drifted under the bowsprit, grazed it, and might have crushed us if the deck-officer had not called out quickly, Luff. After speaking of our troubles and sufferings, I must tell you of our pleasures, which were fishing for cod and eating it. The taste is exquisite. The head, tongue, and liver are morsels worthy of an epicure. Still, I would not advise anybody to make the voyage for their sake. My health is as good as it has been for a long 365 V1 time. I found it a good plan to eat little and take no supper; a little tea now and then, and plenty of lemonade. Nevertheless I have taken very little liking for the sea, and think that when I shall be so happy as to rejoin you I shall end my voyages there. I don\u0027t know when this letter will go. I shall send it by the first ship that returns to France, and keep on writing till then. It is pleasant, I know, to hear particulars about the people one loves, and I thought that my mother and you, my dearest and most beloved, would be glad to read all these dull details. We heard Mass on Easter Day. All the week before, it was impossible, because the ship rolled so that I could hardly keep my legs. If I had dared, I think I should have had myself lashed fast. I shall not soon forget that Holy Week.\" This letter was written on the eleventh of May, in the St. Lawrence, where the ship lay at anchor, ten leagues below Quebec, stopped by ice from proceeding farther. Montcalm made his way to the town by land, and soon after learned with great satisfaction that the other ships were safe in the river below. \"I see,\" he writes again, \"that I shall have plenty of work. Our campaign will soon begin. Everything is in motion. Don\u0027t expect details about our operations; generals never speak of movements till they are over. I can only tell you that the winter has been quiet enough, though the savages have made great havoc in Pennsylvania and Virginia, and carried off, according to their custom, men, women, and 366 V1 children. I beg you will have High Mass said at Montpellier or Vauvert to thank God for our safe arrival and ask for good success in future.\" [365] [365] These extracts are translated from copies of the original letters, in possession of the present Marquis de Montcalm. Vaudreuil, the governor-general, was at Montreal, and Montcalm sent a courier to inform him of his arrival. He soon went thither in person, and the two men met for the first time. The new general was not welcome to Vaudreuil, who had hoped to command the troops himself, and had represented to the Court that it was needless and inexpedient to send out a general officer from France. [366] The Court had not accepted his views; [367] and hence it was with more curiosity than satisfaction that he greeted the colleague who had been assigned him. He saw before him a man of small stature, with a lively countenance, a keen eye, and, in moments of animation, rapid, vehement utterance, and nervous gesticulation. Montcalm, we may suppose, regarded the Governor with no less attention. Pierre Fran?ois Rigaud, Marquis de Vaudreuil, who had governed Canada early in the century; and he himself had been governor of Louisiana. He had not the force of character which his position demanded, lacked decision in times of crisis; and though tenacious of authority, was more jealous in asserting than self-reliant in exercising it. One of his traits was a sensitive egotism, which 367 V1 made him forward to proclaim his own part in every success, and to throw on others the burden of every failure. He was facile by nature, and capable of being led by such as had skill and temper for the task. But the impetuous Montcalm was not of their number; and the fact that he was born in France would in itself have thrown obstacles in his way to the good graces of the Governor. Vaudreuil, Canadian by birth, loved the colony and its people, and distrusted Old France and all that came out of it. He had been bred, moreover, to the naval service; and, like other Canadian governors, his official correspondence was with the minister of marine, while that of Montcalm was with the minister of war. Even had Nature made him less suspicious, his relations with the General would have been critical. Montcalm commanded the regulars from France, whose very presence was in the eyes of Vaudreuil an evil, though a necessary one. Their chief was, it is true, subordinate to him in virtue of his office of governor; [368] yet it was clear that for the conduct of the war the trust of the Government was mainly in Montcalm; and the Minister of War had even suggested that he should have the immediate command, not only of the troops from France, but of the colony regulars and the militia. An order of the King to this effect was sent to Vaudreuil, with instructions to communicate it to 368 V1 Montcalm or withhold it, as he should think best. [369] He lost no time in replying that the General \"ought to concern himself with nothing but the command of the troops from France;\" and he returned the order to the minister who sent it. [370] The Governor and the General represented the two parties which were soon to divide Canada,—those of New France and of Old. [366] Vaudreuil au Ministre, 30 Oct. 1755. [367] Ordres du Roy et Dépêches des Ministres, Fév. 1756. [368] Le Ministre à Vaudreuil, 15 Mars, 1756. Commission du Marquis de Montcalm. Mémoire du Roy pour servir d\u0027Instruction au Marquis de Montcalm. [369] Ordres du Roy et Dépêches des Ministres, 1756. Le Ministre à Vaudreuil, 15 Mars, 1756. [370] Vaudreuil au Ministre, 16 Juin, 1756. \"Qu\u0027il ne se mêle que du commandement des troupes de terre.\" A like antagonism was seen in the forces commanded by the two chiefs. These were of three kinds,—the troupes de terre, troops of the line, or regulars from France; the troupes de la marine, or colony regulars; and lastly the militia. The first consisted of the four battalions that had come over with Dieskau and the two that had come with Montcalm, comprising in all a little less than three thousand men. [371] Besides these, the battalions of Artois and Bourgogne, to the number of eleven hundred men, were in garrison at Louisbourg. All these troops wore a white uniform, faced with blue, red, yellow, or violet, [372] 369 V1 a black three-cornered hat, and gaiters, generally black, from the foot to the knee. The subaltern officers in the French service were very numerous, and were drawn chiefly from the class of lesser nobles. A well-informed French writer calls them \"a generation of petits-ma?tres, dissolute, frivolous, heedless, light-witted; but brave always, and ready to die with their soldiers, though not to suffer with them.\" [373] In fact the course of the war was to show plainly that in Europe the regiments of France were no longer what they had once been. It was not so with those who fought in America. Here, for enduring gallantry, officers and men alike deserve nothing but praise. [371] Of about twelve hundred who came with Montcalm, nearly three hundred were now in hospital. The four battalions that came with Dieskau are reported at the end of May to have sixteen hundred and fifty-three effective men. état de la Situation actuelle des Bataillons, appended to Montcalm\u0027s despatch of 12 June. Another document, Dêtail de ce qui s\u0027est passé en Canada, Juin, 1755, jusqu\u0027à Juin, 1756, sets the united effective strength of the battalions in Canada at twenty-six hundred and seventy-seven, which was increased by recruits which arrived from France about midsummer. [372] Except perhaps, the battalion of Béarn, which formerly wore, and possibly wore still, a uniform of light blue. [373] Susane, Ancienne Infanterie Fran?aise. In the atlas of this work are colored plates of the uniforms of all the regiments of foot. The troupes de la marine had for a long time formed the permanent military establishment of Canada. Though attached to the naval department, they served on land, and were employed as a police within the limits of the colony, or as garrisons of the outlying forts, where their officers busied themselves more with fur-trading than with their military duties. Thus they had become ill-disciplined and inefficient, till the hard hand of Duquesne restored them to order. They originally consisted of twenty-eight independent companies, increased in 1750 to thirty companies, at first of fifty, and afterwards of sixty-five men each, forming a total of nineteen hundred and fifty rank and file. In March, 1757, ten more 370 V1 companies were added. Their uniform was not unlike that of the troops attached to the War Department, being white, with black facings. They were enlisted for the most part in France; but when their term of service expired, and even before, in time of peace, they were encouraged to become settlers in the colony, as was also the case with their officers, of whom a great part were of European birth. Thus the relations of the troupes de la marine with the colony were close; and they formed a sort of connecting link between the troops of the line and the native militia. [374] Besides these colony regulars, there was a company of colonial artillery, consisting this year of seventy men, and replaced in 1757 by two companies of fifty men each. [374] On the troupes de la marine,—Mémoire pour servir d\u0027Instruction à MM. Jonquière et Bigot, 30 Avril, 1749. Ordres du Roy et Dépêches des Ministres, 1750. Ibid., 1755. Ibid., 1757. Instruction pour Vaudreuil, 22 Mars, 1755. Ordonnance pour l\u0027Augmentation de Soldats dans les Compagnies de Canada, 14 Mars, 1755. Duquesne au Ministre, 26 Oct. 1753. Ibid., 30 Oct. 1753. Ibid., 29 Fév. 1754. Duquesne à Marin, 27 Ao?t, 1753. Atlas de Susane. All the effective male population of Canada, from fifteen years to sixty, was enrolled in the militia, and called into service at the will of the Governor. They received arms, clothing, equipment, and rations from the King, but no pay; and instead of tents they made themselves huts of bark or branches. The best of them were drawn from the upper parts of the colony, where habits of bushranging were still in full activity. Their fighting qualities were much like those of the Indians, whom they rivalled in endurance 371 V1 and in the arts of forest war. As bush-fighters they had few equals; they fought well behind earthworks, and were good at a surprise or sudden dash; but for regular battle on the open field they were of small account, being disorderly, and apt to break and take to cover at the moment of crisis. They had no idea of the great operations of war. At first they despised the regulars for their ignorance of woodcraft, and thought themselves able to defend the colony alone; while the regulars regarded them in turn with a contempt no less unjust. They were excessively given to gasconade, and every true Canadian boasted himself a match for three Englishmen at least. In 1750 the militia of all ranks counted about thirteen thousand; and eight years later the number had increased to about fifteen thousand. [375] Until the last two years of the war, those employed in actual warfare were but few. Even in the critical year 1758 only about eleven hundred were called to arms, except for two or three weeks in summer; [376] though about four thousand were employed in transporting troops and supplies, for which service they received pay. [375] Récapitulation des Milices du Gouvernement de Canada, 1750. Dénombrement des Milices, 1758, 1759. On the militia, see also Bougainville in Margry, Rélations et Mémoires inédits, 60, and N. Y. Col. Docs., X. 680. [376] Montcalm au Ministre, 1 Sept. 1758. To the white fighting force of the colony are to be added the red men. The most trusty of them were the Mission Indians, living within or near the settled limits of Canada, chiefly the Hurons of Lorette, the Abenakis of St. Francis and Batiscan, 372 V1 the Iroquois of Caughnawaga and La Présentation, and the Iroquois and Algonkins at the Two Mountains on the Ottawa. Besides these, all the warriors of the west and north, from Lake Superior to the Ohio, and from the Alleghanies to the Mississippi, were now at the beck of France. As to the Iroquois or Five Nations who still remained in their ancient seats within the present limits of New York, their power and pride had greatly fallen; and crowded as they were between the French and the English, they were in a state of vacillation, some leaning to one side, some to the other, and some to each in turn. As a whole, the best that France could expect from them was neutrality. Montcalm at Montreal had more visits than he liked from his red allies. \"They are vilains messieurs,\" he informs his mother, \"even when fresh from their toilet, at which they pass their lives. You would not believe it, but the men always carry to war, along with their tomahawk and gun, a mirror to daub their faces with various colors, and arrange feathers on their heads and rings in their ears and noses. They think it a great beauty to cut the rim of the ear and stretch it till it reaches the shoulder. Often they wear a laced coat, with no shirt at all. You would take them for so many masqueraders or devils. One needs the patience of an angel to get on with them. Ever since I have been here, I have had nothing but visits, harangues, and deputations of these gentry. The Iroquois ladies, who always take 373 V1 part in their government, came also, and did me the honor to bring me belts of wampum, which will oblige me to go to their village and sing the war-song. They are only a little way off. Yesterday we had eighty-three warriors here, who have gone out to fight. They make war with astounding cruelty, sparing neither men, women, nor children, and take off your scalp very neatly,—an operation which generally kills you. \"Everything is horribly dear in this country; and I shall find it hard to make the two ends of the year meet, with the twenty-five thousand francs the King gives me. The Chevalier de Lévis did not join me till yesterday. His health is excellent. In a few days I shall send him to one camp, and M. de Bourlamaque to another; for we have three of them: one at Carillon, eighty leagues from here, towards the place where M. de Dieskau had his affair last year; another at Frontenac, sixty leagues; and the third at Niagara, a hundred and forty leagues. I don\u0027t know when or whither I shall go myself; that depends on the movements of the enemy. It seems to me that things move slowly in this new world; and I shall have to moderate my activity accordingly. Nothing but the King\u0027s service and the wish to make a career for my son could prevent me from thinking too much of my expatriation, my distance from you, and the dull existence here, which would be duller still if I did not manage to keep some little of my natural gayety.\" 374 V1 The military situation was somewhat perplexing. Iroquois spies had brought reports of great preparations on the part of the English. As neither party dared offend these wavering tribes, their warriors could pass with impunity from one to the other, and were paid by each for bringing information, not always trustworthy. They declared that the English were gathering in force to renew the attempt made by Johnson the year before against Crown Point and Ticonderoga, as well as that made by Shirley against forts Frontenac and Niagara. Vaudreuil had spared no effort to meet the double danger. Lotbinière, a Canadian engineer, had been busied during the winter in fortifying Ticonderoga, while Pouchot, a captain in the battalion of Béarn, had rebuilt Niagara, and two French engineers were at work in strengthening the defences of Frontenac. The Governor even hoped to take the offensive, anticipate the movements of the English, capture Oswego, and obtain the complete command of Lake Ontario. Early in the spring a blow had been struck which materially aided these schemes. The English had built two small forts to guard the Great Carrying Place on the route to Oswego. One of these, Fort Williams, was on the Mohawk; the other, Fort Bull, a mere collection of storehouses surrounded by a palisade, was four miles distant, on the bank of Wood Creek. Here a great quantity of stores and ammunition had imprudently been collected against the opening campaign. In February Vaudreuil sent Léry, a 375 V1 colony officer, with three hundred and sixty-two picked men, soldiers, Canadians, and Indians, to seize these two posts. Towards the end of March, after extreme hardship, they reached the road that connected them, and at half-past five in the morning captured twelve men going with wagons to Fort Bull. Learning from them the weakness of that place, they dashed forward to surprise it. The thirty provincials of Shirley\u0027s regiment who formed the garrison had barely time to shut the gate, while the assailants fired on them through the loopholes, of which they got possession in the tumult. Léry called on the defenders to yield; but they refused, and pelted the French for an hour with bullets and hand-grenades. The gate was at last beat down with axes, and they were summoned again; but again refused, and fired hotly through the opening. The French rushed in, shouting Vive le roi, and a frightful struggle followed. All the garrison were killed, except two or three who hid themselves till the slaughter was over; the fort was set on fire and blown to atoms by the explosion of the magazines; and Léry then withdrew, not venturing to attack Fort Williams. Johnson, warned by Indians of the approach of the French, had pushed up the Mohawk with reinforcements; but came too late. [377] [377] Bigot au Ministre, 12 Avril, 1756. Vaudreuil au Ministre, 1 Juin, 1756. Ibid., 8 Juin, 1756. Journal de ce qui s\u0027est passé en Canada depuis le Mois d\u0027Octobre, 1755, jusqu\u0027au Mois de Juin, 1756. Shirley to Fox, 7 May, 1756. Conduct of Major-General Shirley briefly stated. Information of Captain John Vicars, of the Fiftieth (Shirley\u0027s) Regiment. Eastburn, Faithful Narrative. Entick, I. 471. The French accounts place the number of English at sixty or eighty. 376 V1 Vaudreuil, who always exaggerates any success in which he has had part, says that besides bombs, bullets, cannon-balls, and other munitions, forty-five thousand pounds of gunpowder were destroyed on this occasion. It is certain that damage enough was done to retard English operations in the direction of Oswego sufficiently to give the French time for securing all their posts on Lake Ontario. Before the end of June this was in good measure done. The battalion of Béarn lay encamped before the now strong fort of Niagara, and the battalions of Guienne and La Sarre, with a body of Canadians, guarded Frontenac against attack. Those of La Reine and Languedoc had been sent to Ticonderoga, while the Governor, with Montcalm and Lévis, still remained at Montreal watching the turn of events. [378] Hither, too, came the intendant Fran?ois Bigot, the most accomplished knave in Canada, yet indispensable for his vigor and executive skill; Bougainville, who had disarmed the jealousy of Vaudreuil, and now stood high in his good graces; and the Adjutant-General, Montreuil, clearly a vain and pragmatic personage, who, having come to Canada with Dieskau the year before, thought it behooved him to give the General the advantage of his experience. \"I like M. de Montcalm very much,\" he writes to the minister, \"and will do the impossible to deserve his confidence. I have spoken to him in the same terms as to M. Dieskau; thus: \u0027Trust only the French regulars for an expedition, 377 V1 but use the Canadians and Indians to harass the enemy. Don\u0027t expose yourself; send me to carry your orders to points of danger.\u0027 The colony officers do not like those from France. The Canadians are independent, spiteful, lying, boastful; very good for skirmishing, very brave behind a tree, and very timid when not under cover. I think both sides will stand on the defensive. It does not seem to me that M. de Montcalm means to attack the enemy; and I think he is right. In this country a thousand men could stop three thousand.\" [379] [378] Correspondance de Montcalm, Vaudreuil, et Lévis. [379] Montreuil au Ministre, 12 Juin, 1756. The original is in cipher. \"M. de Vaudreuil overwhelms me with civilities,\" Montcalm writes to the Minister of War. \"I think that he is pleased with my conduct towards him, and that it persuades him there are general officers in France who can act under his orders without prejudice or ill-humor.\" [380] \"I am on good terms with him,\" he says again; \"but not in his confidence, which he never gives to anybody from France. His intentions are good, but he is slow and irresolute.\" [381] [380] Montcalm au Ministre, 12 Juin, 1756. [381] Ibid., 19 Juin, 1756. \"Je suis bien avec luy, sans sa confiance, qu\u0027il ne donne jamais à personne de la France.\" Erroneously rendered in N. Y. Col. Docs., X. 421. Indians presently brought word that ten thousand English were coming to attack Ticonderoga. A reinforcement of colony regulars was at once despatched to join the two battalions already there; a third battalion, Royal Roussillon, was sent after them. The militia were called out and ordered to 378 V1 follow with all speed, while both Montcalm and Lévis hastened to the supposed scene of danger. [382] They embarked in canoes on the Richelieu, coasted the shore of Lake Champlain, passed Fort Frederic or Crown Point, where all was activity and bustle, and reached Ticonderoga at the end of June. They found the fort, on which Lotbinière had been at work all winter, advanced towards completion. It stood on the crown of the promontory, and was a square with four bastions, a ditch, blown in some parts out of the solid rock, bomb-proofs, barracks of stone, and a system of exterior defences as yet only begun. The rampart consisted of two parallel walls ten feet apart, built of the trunks of trees, and held together by transverse logs dovetailed at both ends, the space between being filled with earth and gravel well packed. [383] Such was the first Fort Ticonderoga, or Carillon,—a structure quite distinct from the later fort of which the ruins still stand on the same spot. The forest had been hewn away for some distance around, and the tents of the regulars and huts of the Canadians had taken its place; innumerable bark canoes lay along the strand, and gangs of men toiled at the unfinished works. [382] Montcalm au Ministre, 26 Juin, 1756. Détail de ce qui s\u0027est passé, Oct. 1755—Juin, 1756. [383] Lotbinière au Ministre, 31 Oct. 1756. Montcalm au Ministre, 20 Juillet, 1756. Ticonderoga was now the most advanced position of the French, and Crown Point, which had before held that perilous honor, was in the second line. Lévis, to whom had been assigned the 379 V1 permanent command of this post of danger, set out on foot to explore the neighboring woods and mountains, and slept out several nights before he reappeared at the camp. \"I do not think,\" says Montcalm, \"that many high officers in Europe would have occasion to take such tramps as this. I cannot speak too well of him. Without being a man of brilliant parts, he has good experience, good sense, and a quick eye; and, though I had served with him before, I never should have thought that he had such promptness and efficiency. He has turned his campaigns to good account.\" [384] Lévis writes of his chief with equal warmth. \"I do not know if the Marquis de Montcalm is pleased with me, but I am sure that I am very much so with him, and shall always be charmed to serve under his orders. It is not for me, Monseigneur, to speak to you of his merit and his talents. You know him better than anybody else; but I may have the honor of assuring you that he has pleased everybody in this colony, and manages affairs with the Indians extremely well.\" [385] [384] Montcalm au Ministre, 20 Juillet, 1756. [385] Lévis au Ministre, 17 Juillet, 1756. The danger from the English proved to be still remote, and there was ample leisure in the camp. Duchat, a young captain in the battalion of Languedoc, used it in writing to his father a long account of what he saw about him,—the forests full of game; the ducks, geese, and partridges; the prodigious flocks of wild pigeons that darkened 380 V1 the air, the bears, the beavers; and above all the Indians, their canoes, dress, ball-play, and dances. \"We are making here,\" says the military prophet, \"a place that history will not forget. The English colonies have ten times more people than ours; but these wretches have not the least knowledge of war, and if they go out to fight, they must abandon wives, children, and all that they possess. Not a week passes but the French send them a band of hairdressers, whom they would be very glad to dispense with. It is incredible what a quantity of scalps they bring us. In Virginia they have committed unheard-of cruelties, carried off families, burned a great many houses, and killed an infinity of people. These miserable English are in the extremity of distress, and repent too late the unjust war they began against us. It is a pleasure to make war in Canada. One is troubled neither with horses nor baggage; the King provides everything. But it must be confessed that if it costs no money, one pays for it in another way, by seeing nothing but pease and bacon on the mess-table. Luckily the lakes are full of fish, and both officers and soldiers have to turn fishermen.\" [386] [386] Relation de M. Duchat, Capitaine au Régiment de Languedoc, écrite au Camp de Carillon, 15 Juillet, 1756. Meanwhile, at the head of Lake George, the raw bands of ever-active New England were mustering for the fray.","sourceLink":"http://novel.tingroom.com/jingdian/2857/78974.html","bookId":409,"book":{"id":409,"title":"Pioneers Of France In The New World: France and England in North America","description":"简介： The springs of American civilization, unlike those of the elder world, lie revealed in the clear light of History. In appearance they are feeble; in reality, copious and full of force. Acting at the sources of life, instruments otherwise weak become...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2857","creation":"Aug 1, 2019 12:18:44 AM","modification":"Aug 1, 2019 12:18:44 AM"}}
