{"id":17596,"no":189,"title":"CHAPTER XXVIII.","content":"1759. FALL OF QUEBEC. After the Battle ? Canadians resist the Pursuit ? Arrival of Vaudreuil ? Scene in the Redoubt ? Panic ? Movements of the Victors ? Vaudreuil\u0027s Council of War ? Precipitate Retreat of the French Army ? Last Hours of Montcalm ? His Death and Burial ? Quebec abandoned to its Fate ? Despair of the Garrison ? Lévis joins the Army ? Attempts to relieve the Town ? Surrender ? The British occupy Quebec ? Slanders of Vaudreuil ? Reception in England of the News of Wolfe\u0027s Victory and Death ? Prediction of Jonathan Mayhew. \"Never was rout more complete than that of our army,\" says a French official. [784] It was the more so because Montcalm held no troops in reserve, but launched his whole force at once against the English. Nevertheless there was some resistance to the pursuit. It came chiefly from the Canadians, many of whom had not advanced with the regulars to the attack. Those on the right wing, instead of doing so, threw themselves into an extensive tract of bushes that lay in front of the English left; and from this cover they opened a fire, too distant for much effect, till the victors advanced in their turn, when the shot of the hidden marksmen told severely upon them. Two battalions, therefore, deployed before the bushes, fired volleys into them, and drove their occupants out. [784] Daine au Ministre, 9 Oct. 1759. 300 V2 Again, those of the Canadians who, before the main battle began, attacked the English left from the brink of the plateau towards the St. Charles, withdrew when the rout took place, and ran along the edge of the declivity till, at the part of it called C?te Ste.-Geneviève, they came to a place where it was overgrown with thickets. Into these they threw themselves; and were no sooner under cover than they faced about to fire upon the Highlanders, who presently came up. As many of these mountaineers, according to their old custom, threw down their muskets when they charged, and had no weapons but their broadswords, they tried in vain to dislodge the marksmen, and suffered greatly in the attempt. Other troops came to their aid, cleared the thickets, after stout resistance, and drove their occupants across the meadow to the bridge of boats. The conduct of the Canadians at the C?te Ste.-Geneviève went far to atone for the shortcomings of some of them on the battle-field. A part of the fugitives escaped into the town by the gates of St. Louis and St. John, while the greater number fled along the front of the ramparts, rushed down the declivity to the suburb of St. Roch, and ran over the meadows to the bridge, protected by the cannon of the town and the two armed hulks in the river. The rout had but just begun when Vaudreuil crossed the bridge from the camp of Beauport. It was four hours since he first heard the alarm, and his quarters were not much more than two miles from the 301 V2 battle-field. He does not explain why he did not come sooner; it is certain that his coming was well timed to throw the blame on Montcalm in case of defeat, or to claim some of the honor for himself in case of victory. \"Monsieur the Marquis of Montcalm,\" he says, \"unfortunately made his attack before I had joined him.\" [785] His joining him could have done no good; for though he had at last brought with him the rest of the militia from the Beauport camp, they had come no farther than the bridge over the St. Charles, having, as he alleges, been kept there by an unauthorized order from the chief of staff, Montreuil. [786] He declares that the regulars were in such a fright that he could not stop them; but that the Canadians listened to his voice, and that it was he who rallied them at the C?te Ste.-Geneviève. Of this the evidence is his own word. From other accounts it would appear that the Canadians rallied themselves. Vaudreuil lost no time in recrossing the bridge and joining the militia in the redoubt at the farther end, where a crowd of fugitives soon poured in after him. [785] Vaudreuil au Ministre, 21 Sept. 1759. [786] Ibid., 5 Oct. 1759. The aide-de-camp Johnstone, mounted on horseback, had stopped for a moment in what is now the suburb of St. John to encourage some soldiers who were trying to save a cannon that had stuck fast in a marshy hollow; when, on spurring his horse to the higher ground, he saw within musket-shot a long line of British troops, who immediately 302 V2 fired upon him. The bullets whistled about his ears, tore his clothes, and wounded his horse; which, however, carried him along the edge of the declivity to a windmill, near which was a roadway to a bakehouse on the meadow below. He descended, crossed the meadow, reached the bridge, and rode over it to the great redoubt or hornwork that guarded its head. The place was full of troops and Canadians in a wild panic. \"It is impossible,\" says Johnstone, \"to imagine the disorder and confusion I found in the hornwork. Consternation was general. M. de Vaudreuil listened to everybody, and was always of the opinion of him who spoke last. On the appearance of the English troops on the plain by the bakehouse, Montguet and La Motte, two old captains in the regiment of Béarn, cried out with vehemence to M. de Vaudreuil \u0027that the hornwork would be taken in an instant by assault, sword in hand; that we all should be cut to pieces without quarter; and that nothing would save us but an immediate and general capitulation of Canada, giving it up to the English.\u0027\" [787] Yet the river was wide and deep, and the hornwork was protected on the water side by strong palisades, with cannon. Nevertheless there rose a general cry to cut the bridge of boats. By doing so more than half the army, who had not yet crossed, would have been sacrificed. The 303 V2 axemen were already at work, when they were stopped by some officers who had not lost their wits. [787] Confirmed by Journal tenu à l\u0027Armée, etc. \"Divers officiers des troupes de terre n\u0027hésitèrent point à dire, tout haut en présence du soldat, qu\u0027il ne nous restoit d\u0027autre ressource que celle de capituler promptement pour toute la colonie,\" etc. \"M. de Vaudreuil,\" pursues Johnstone, \"was closeted in a house in the inside of the hornwork with the Intendant and some other persons. I suspected they were busy drafting the articles for a general capitulation, and I entered the house, where I had only time to see the Intendant, with a pen in his hand, writing upon a sheet of paper, when M. de Vaudreuil told me I had no business there. Having answered him that what he had said was true, I retired immediately, in wrath to see them intent on giving up so scandalously a dependency for the preservation of which so much blood and treasure had been expended.\" On going out he met Lieutenant-colonels Dalquier and Poulariez, whom he begged to prevent the apprehended disgrace; and, in fact, if Vaudreuil really meant to capitulate for the colony, he was presently dissuaded by firmer spirits than his own. Johnstone, whose horse could carry him no farther, set out on foot for Beauport, and, in his own words, \"continued sorrowfully jogging on, with a very heavy heart for the loss of my dear friend M. de Montcalm, sinking with weariness, and lost in reflection upon the changes which Providence had brought about in the space of three or four hours.\" Great indeed were these changes. Montcalm was dying; his second in command, the Brigadier Senezergues, was mortally wounded; the army, routed and demoralized, was virtually without a 304 V2 head; and the colony, yesterday cheered as on the eve of deliverance, was plunged into sudden despair. \"Ah, what a cruel day!\" cries Bougainville; \"how fatal to all that was dearest to us! My heart is torn in its most tender parts. We shall be fortunate if the approach of winter saves the country from total ruin.\" [788] [788] Bougainville à Bourlamaque, 18 Sept. 1759. The victors were fortifying themselves on the field of battle. Like the French, they had lost two generals; for Monckton, second in rank, was disabled by a musket-shot, and the command had fallen upon Townshend at the moment when the enemy were in full flight. He had recalled the pursuers, and formed them again in line of battle, knowing that another foe was at hand. Bougainville, in fact, appeared at noon from Cap-Rouge with about two thousand men; but withdrew on seeing double that force prepared to receive him. He had not heard till eight o\u0027clock that the English were on the Plains of Abraham; and the delay of his arrival was no doubt due to his endeavors to collect as many as possible of his detachments posted along the St. Lawrence for many miles towards Jacques-Cartier. Before midnight the English had made good progress in their redoubts and intrenchments, had brought cannon up the heights to defend them, planted a battery on the C?te Ste.-Geneviève, descended into the meadows of the St. Charles, and taken possession of the General Hospital, with its crowds of sick and wounded. Their 305 V2 victory had cost them six hundred and sixty-four of all ranks, killed, wounded, and missing. The French loss is placed by Vaudreuil at about six hundred and forty, and by the English official reports at about fifteen hundred. Measured by the numbers engaged, the battle of Quebec was but a heavy skirmish; measured by results, it was one of the great battles of the world. Vaudreuil went from the hornwork to his quarters on the Beauport road and called a council of war. It was a tumultuous scene. A letter was despatched to Quebec to ask advice of Montcalm. The dying General sent a brief message to the effect that there was a threefold choice,—to fight again, retreat to Jacques-Cartier, or give up the colony. There was much in favor of fighting. When Bougainville had gathered all his force from the river above, he would have three thousand men; and these, joined to the garrison of Quebec, the sailors at the batteries, and the militia and artillerymen of the Beauport camp, would form a body of fresh soldiers more than equal to the English then on the Plains of Abraham. Add to these the defeated troops, and the victors would be greatly outnumbered. [789] Bigot gave his voice for 306 V2 fighting. Vaudreuil expressed himself to the same effect; but he says that all the officers were against him. \"In vain I remarked to these gentlemen that we were superior to the enemy, and should beat them if we managed well. I could not at all change their opinion, and my love for the service and for the colony made me subscribe to the views of the council. In fact, if I had attacked the English against the advice of all the principal officers, their ill-will would have exposed me to the risk of losing the battle and the colony also.\" [790] [789] Bigot, as well as Vaudreuil, sets Bougainville\u0027s force at three thousand. \"En réunissant le corps M. de Bougainville, les bataillons de Montréal [laissés au camp de Beauport] et la garnison de la ville, il nous restoit encore près de 5,000 hommes de troupes fra?ches.\" Journal tenu à l\u0027Armée. Vaudreuil says that there were fifteen hundred men in garrison at Quebec who did not take part in the battle. If this is correct, the number of fresh troops after it was not five thousand, but more than six thousand; to whom the defeated force is to be added, making, after deducting killed and wounded, some ten thousand in all. [790] Vaudreuil au Ministre, 5 Oct. 1759. It was said at the time that the officers voted for retreat because they thought Vaudreuil unfit to command an army, and, still more, to fight a battle. [791] There was no need, however, to fight at once. The object of the English was to take Quebec, and that of Vaudreuil should have been to keep it. By a march of a few miles he could have joined Bougainville; and by then intrenching himself at or near Ste.-Foy he would have placed a greatly superior force in the English rear, where his position might have been made impregnable. Here he might be easily furnished with provisions, and from hence he could readily throw men and supplies into Quebec, which the English were too few to invest. He could harass the besiegers, or attack them, should opportunity offer, and either raise the siege or so protract it that they would be forced by approaching winter to sail homeward, robbed of the fruit of their victory. [791] Mémoires sur le Canada, 1749-1760. 307 V2 At least he might have taken a night for reflection. He was safe behind the St. Charles. The English, spent by fighting, toil, and want of sleep, were in no condition to disturb him. A part of his own men were in deadly need of rest; the night would have brought refreshment, and the morning might have brought wise counsel. Vaudreuil would not wait, and orders were given at once for retreat. [792] It began at nine o\u0027clock that evening. Quebec was abandoned to its fate. The cannon were left in the lines of Beauport, the tents in the encampments, and provisions enough in the storehouses to supply the army for a week. \"The loss of the Marquis de Montcalm,\" says a French officer then on the spot, \"robbed his successors of their senses, and they thought of nothing but flight; such was their fear that the enemy would attack the intrenchments the next day. The army abandoned the camp in such disorder that the like was never known.\" [793] \"It was not a retreat,\" says Johnstone, who was himself a part of it, \"but an abominable flight, with such disorder and confusion that, had the English known it, three hundred men sent after us would have been sufficient to cut all our army to pieces. The soldiers were all mixed, scattered, dispersed, and running as hard as they could, as if the English army were at their heels.\" They passed Charlesbourg, Lorette, and St. Augustin, till, on the fifteenth, they found rest on the impregnable hill 308 V2 of Jacques-Cartier, by the brink of the St. Lawrence, thirty miles from danger. [792] Livre d\u0027Ordres, Ordre du 13 Sept. 1759. [793] Foligny, Journal mémoratif. In the night of humiliation when Vaudreuil abandoned Quebec, Montcalm was breathing his last within its walls. When he was brought wounded from the field, he was placed in the house of the Surgeon Arnoux, who was then with Bourlamaque at Isle-aux-Noix, but whose younger brother, also a surgeon, examined the wound and pronounced it mortal. \"I am glad of it,\" Montcalm said quietly; and then asked how long he had to live. \"Twelve hours, more or less,\" was the reply. \"So much the better,\" he returned. \"I am happy that I shall not live to see the surrender of Quebec.\" He is reported to have said that since he had lost the battle it consoled him to have been defeated by so brave an enemy; and some of his last words were in praise of his successor, Lévis, for whose talents and fitness for command he expressed high esteem. When Vaudreuil sent to ask his opinion, he gave it; but when Ramesay, commandant of the garrison, came to receive his orders, he replied: \"I will neither give orders nor interfere any further. I have much business that must be attended to, of greater moment than your ruined garrison and this wretched country. My time is very short; therefore pray leave me. I wish you all comfort, and to be happily extricated from your present perplexities.\" Nevertheless he thought to the last of those who had been under his command, and sent the following note to Brigadier Townshend: 309 V2 \"Monsieur, the humanity of the English sets my mind at peace concerning the fate of the French prisoners and the Canadians. Feel towards them as they have caused me to feel. Do not let them perceive that they have changed masters. Be their protector as I have been their father.\" [794] [794] I am indebted to Abbé Bois for a copy of this note. The last words of Montcalm, as above, are reported partly by Johnstone, and partly by Knox. Bishop Pontbriand, himself fast sinking with mortal disease, attended his death-bed and administered the last sacraments. He died peacefully at four o\u0027clock on the morning of the fourteenth. He was in his forty-eighth year. In the confusion of the time no workman could be found to make a coffin, and an old servant of the Ursulines, known as Bonhomme Michel, gathered a few boards and nailed them together so as to form a rough box. In it was laid the body of the dead soldier; and late in the evening of the same day he was carried to his rest. There was no tolling of bells or firing of cannon. The officers of the garrison followed the bier, and some of the populace, including women and children, joined the procession as it moved in dreary silence along the dusky street, shattered with cannon-ball and bomb, to the chapel of the Ursuline convent. Here a shell, bursting under the floor, had made a cavity which had been hollowed into a grave. Three priests of the Cathedral, several nuns, Ramesay with his officers, and a throng of towns-people were present at the rite. After the service 310 V2 and the chant, the body was lowered into the grave by the light of torches; and then, says the chronicle, \"the tears and sobs burst forth. It seemed as if the last hope of the colony were buried with the remains of the General.\" [795] In truth, the funeral of Montcalm was the funeral of New France. [796] [795] Ursulines de Québec, III. 10. [796] See Appendix J. It was no time for grief. The demands of the hour were too exigent and stern. When, on the morning after the battle, the people of Quebec saw the tents standing in the camp of Beauport, they thought the army still there to defend them. [797] Ramesay knew that the hope was vain. On the evening before, Vaudreuil had sent two hasty notes to tell him of his flight. \"The position of the enemy,\" wrote the Governor, \"becomes stronger every instant; and this, with other reasons, obliges me to retreat.\" \"I have received all your letters. As I set out this moment, I pray you not to write again. You shall hear from me to-morrow. I wish you good evening.\" With these notes came the following order: \"M. de Ramesay is not to wait till the enemy carries the town by assault. As soon as provisions fail, he will raise the white flag.\" This order was accompanied by a memorandum of terms which Ramesay was to ask of the victors. [798] [797] Mémoire du Sieur de Ramesay. [798] Mémoire pour servir d\u0027Instruction à M. de Ramesay, 13 Sept. 1759. Appended, with the foregoing notes, to the Mémoire de Ramesay. \"What a blow for me,\" says the unfortunate commandant, \"to find myself abandoned so soon 311 V2 by the army, which alone could defend the town!\" His garrison consisted of between one and two hundred troops of the line, some four or five hundred colony troops, a considerable number of sailors, and the local militia. [799] These last were in a state of despair. The inhabitants who, during the siege, had sought refuge in the suburb of St. Roch, had returned after the battle, and there were now twenty-six hundred women and children, with about a housand invalids and other non-combatants to be supported, though the provisions in the town, even at half rations, would hardly last a week. Ramesay had not been informed that a good supply was left in the camps of Beauport; and when he heard at last that it was there, and sent out parties to get it, they found that the Indians and the famished country people had carried it off. [799] The English returns give a total of 615 French regulars in the place besides sailors and militia. \"Despondency,\" he says again, \"was complete; discouragement extreme and universal. Murmurs and complaints against the army that had abandoned us rose to a general outcry. I could not prevent the merchants, all of whom were officers of the town militia, from meeting at the house of M. Daine, the mayor. There they declared for capitulating, and presented me a petition to that effect, signed by M. Daine and all the principal citizens.\" Ramesay called a council of war. One officer alone, Fiedmont, captain of artillery, was for 312 V2 reducing the rations still more, and holding out to the last. All the others gave their voices for capitulation. [800] Ramesay might have yielded without dishonor; but he still held out till an event fraught with new hope took place at Jacques-Cartier. [800] Copie du Conseil de Guerre tenu par M. de Ramesay à Québec, 15 Sept. 1759. This event was the arrival of Lévis. On the afternoon of the battle Vaudreuil took one rational step; he sent a courier to Montreal to summon that able officer to his aid. [801] Lévis set out at once, reached Jacques-Cartier, and found his worst fears realized. \"The great number of fugitives that I began to meet at Three Rivers prepared me for the disorder in which I found the army. I never in my life knew the like of it. They left everything behind in the camp at Beauport; tents, baggage, and kettles.\" [801] Lévis à Bourlamaque, 15 Sept. 1759. Lévis, Guerre du Canada. He spoke his mind freely; loudly blamed the retreat, and urged Vaudreuil to march back with all speed to whence he came. [802] The Governor, stiff at ordinary times, but pliant at a crisis, welcomed the firmer mind that decided for him, consented that the troops should return, and wrote afterwards in his despatch to the Minister: \"I was much charmed to find M. de Lévis disposed to march with the army towards Quebec.\" [803] [802] Bigot au Ministre, 15 Oct. 1759. Malartic à Bourlamaque, 28 Sept. 1759. [803] \"Je fus bien charmé,\" etc. Vaudreuil au Ministre, 5 Oct. 1759. Lévis, on his part, wrote: \"The condition in which I found the army, bereft of everything, did 313 V2 not discourage me, because M. de Vaudreuil told me that Quebec was not taken, and that he had left there a sufficiently numerous garrison; I therefore resolved, in order to repair the fault that had been committed, to engage M. de Vaudreuil to march the army back to the relief of the place. I represented to him that this was the only way to prevent the complete defection of the Canadians and Indians; that our knowledge of the country would enable us to approach very near the enemy, whom we knew to be intrenching themselves on the heights of Quebec and constructing batteries to breach the walls; that if we found their army ill posted, we could attack them, or, at any rate, could prolong the siege by throwing men and supplies into the town; and that if we could not save it, we could evacuate and burn it, so that the enemy could not possibly winter there.\" [804] [804] Lévis au Ministre, 10 Nov. 1759. Lévis quickly made his presence felt in the military chaos about him. Bigot bestirred himself with his usual vigor to collect provisions; and before the next morning all was ready. [805] Bougainville had taken no part in the retreat, but sturdily held his ground at Cap-Rouge while the fugitive mob swept by him. A hundred of the mounted Canadians who formed part of his command were now sent to Quebec, each with a bag of biscuit across his saddle. They were to circle round to the Beauport side, where there was no enemy, and whence they could cross the 314 V2 St. Charles in canoes to the town. Bougainville followed close with a larger supply. Vaudreuil sent Ramesay a message, revoking his order to surrender if threatened with assault, telling him to hold out to the last, and assuring him that the whole army was coming to his relief. Lévis hastened to be gone; but first he found time to write a few lines to Bourlamaque. \"We have had a very great loss, for we have lost M. de Montcalm. I regret him as my general and my friend. I found our army here. It is now on the march to retrieve our fortunes. I can trust you to hold your position; as I have not M. de Montcalm\u0027s talents, I look to you to second me and advise me. Put a good face on it. Hide this business as long as you can. I am mounting my horse this moment. Write me all the news.\" [806] [805] Livre d\u0027Ordres, Ordre du 17-18 Sept. 1759. [806] Lévis a Bourlamaque, 18 Sept. 1759. The army marched that morning, the eighteenth. In the evening it reached St. Augustin; and here it was stopped by the chilling news that Quebec had surrendered. Utter confusion had reigned in the disheartened garrison. Men deserted hourly, some to the country, and some to the English camp; while Townshend pushed his trenches nearer and nearer to the walls, in spite of the cannonade with which Fiedmont and his artillerymen tried to check them. On the evening of the seventeenth, the English ships of war moved towards the Lower Town, and a column of troops was seen approaching over the meadows of the St. Charles, as if to storm the Palace Gate. 315 V2 The drums beat the alarm; but the militia refused to fight. Their officers came to Ramesay in a body; declared that they had no mind to sustain an assault; that they knew he had orders against it; that they would carry their guns back to the arsenal; that they were no longer soldiers, but citizens; that if the army had not abandoned them they would fight with as much spirit as ever; but that they would not get themselves killed to no purpose. The town-major, Joannès, in a rage, beat two of them with the flat of his sword. The white flag was raised; Joannès pulled it down, thinking, or pretending to think, that it was raised without authority; but Ramesay presently ordered him to go to the English camp and get what terms he could. He went, through driving rain, to the quarters of Townshend, and, in hope of the promised succor, spun out the negotiation to the utmost, pretended that he had no power to yield certain points demanded, and was at last sent back to confer with Ramesay, under a promise from the English commander that, if Quebec were not given up before eleven o\u0027clock, he would take it by storm. On this Ramesay signed the articles, and Joannès carried them back within the time prescribed. Scarcely had he left the town, when the Canadian horsemen appeared with their sacks of biscuit and a renewed assurance that help was near; but it was too late. Ramesay had surrendered, and would not break his word. He dreaded an assault, which he knew he could not withstand, and he but half believed in the 316 V2 promised succor. \"How could I trust it?\" he asks. \"The army had not dared to face the enemy before he had fortified himself; and could I hope that it would come to attack him in an intrenched camp, defended by a formidable artillery?\" Whatever may be thought of his conduct, it was to Vaudreuil, and not to him, that the loss of Quebec was due. The conditions granted were favorable, for Townshend knew the danger of his position, and was glad to have Quebec on any terms. The troops and sailors of the garrison were to march out of the place with the honors of war, and to be carried to France. The inhabitants were to have protection in person and property, and free exercise of religion. [807] [807] Articles de Capitulation, 18 Sept. 1759. In the afternoon a company of artillerymen with a field-piece entered the town, and marched to the place of arms, followed by a body of infantry. Detachments took post at all the gates. The British flag was raised on the heights near the top of Mountain Street, and the capital of New France passed into the hands of its hereditary foes. The question remained, should they keep, or destroy it? It was resolved to keep it at every risk. The marines, the grenadiers from Louisbourg, and some of the rangers were to reimbark in the fleet; while the ten battalions, with the artillery and one company of rangers, were to remain behind, bide the Canadian winter, and defend the ruins of Quebec against the efforts of 317 V2 Lévis. Monckton, the oldest brigadier, was disabled by his wound, and could not stay; while Townshend returned home, to parade his laurels and claim more than his share of the honors of victory. [808] The command, therefore, rested with Murray. [808] Letter to an Honourable Brigadier-General [Townshend], printed in 1760. A Refutation soon after appeared, angry, but not conclusive. Other replies will be found in the Imperial Magazine for 1760. The troops were not idle. Levelling their own field-works, repairing the defences of the town, storing provisions sent ashore from the fleet, making fascines, and cutting firewood, busied them through the autumn days bright with sunshine, or dark and chill with premonition of the bitter months to come. Admiral Saunders put off his departure longer than he had once thought possible; and it was past the middle of October when he fired a parting salute, and sailed down the river with his fleet. In it was the ship \"Royal William,\" carrying the embalmed remains of Wolfe. Montcalm lay in his soldier\u0027s grave before the humble altar of the Ursulines, never more to see the home for which he yearned, the wife, mother, and children whom he loved, the olive-trees and chestnut-groves of his beloved Candiac. He slept in peace among triumphant enemies, who respected his memory, though they hardly knew his resting-place. It was left for a fellow-countryman—a colleague and a brother-in-arms—to belittle his achievements and blacken his name. The jealous 318 V2 spite of Vaudreuil pursued him even in death. Leaving Lévis to command at Jacques-Cartier, whither the army had again withdrawn, the Governor retired to Montreal, whence he wrote a series of despatches to justify himself at the expense of others, and above all of the slain general, against whom his accusations were never so bitter as now, when the lips were cold that could have answered them. First, he threw on Ramesay all the blame of the surrender of Quebec. Then he addressed himself to his chief task, the defamation of his unconscious rival. \"The letter that you wrote in cipher, on the tenth of February, to Monsieur the Marquis of Montcalm and me, in common, [809] flattered his self-love to such a degree that, far from seeking conciliation, he did nothing but try to persuade the public that his authority surpassed mine. From the moment of Monsieur de Montcalm\u0027s arrival in this colony, down to that of his death, he did not cease to sacrifice everything to his boundless ambition. He sowed dissension among the troops, tolerated the most indecent talk against the government, attached to himself the most disreputable persons, used means to corrupt the most virtuous, and, when he could not succeed, became their cruel enemy. He wanted to be Governor-General. He privately flattered with favors and promises of patronage every officer of the colony troops who adopted his ideas. He spared no pains to gain over the people of whatever calling, and persuade 319 V2 them of his attachment; while, either by himself or by means of the troops of the line, he made them bear the most frightful yoke (le joug le plus affreux). He defamed honest people, encouraged insubordination, and closed his eyes to the rapine of his soldiers.\" [809] See ante, p. 167. This letter was written to Vaudreuil\u0027s official superior and confidant, the Minister of the Marine and Colonies. In another letter, written about the same time to the Minister of War, who held similar relations to his rival, he declares that he \"greatly regretted Monsieur de Montcalm.\" [810] [810] Vaudreuil au Ministre de la Guerre, 1 Nov. 1759. His charges are strange ones from a man who was by turns the patron, advocate, and tool of the official villains who cheated the King and plundered the people. Bigot, Cadet, and the rest of the harpies that preyed on Canada looked to Vaudreuil for support, and found it. It was but three or four weeks since he had written to the Court in high eulogy of Bigot and effusive praise of Cadet, coupled with the request that a patent of nobility should be given to that notorious public thief. [811] The corruptions which disgraced his government were rife, not only in the civil administration, but also among the officers of the colony troops, over whom he had complete control. They did not, as has been seen already, extend to the officers of the line, who were outside the circle of peculation. It was these who were the habitual associates of Montcalm; and when Vaudreuil 320 V2 charges him with \"attaching to himself the most disreputable persons, and using means to corrupt the most virtuous,\" the true interpretation of his words is that the former were disreputable because they disliked him (the Governor), and the latter virtuous because they were his partisans. [811] See ante, p. 31. Vaudreuil continues thus: \"I am in despair, Monseigneur, to be under the necessity of painting you such a portrait after death of Monsieur the Marquis of Montcalm. Though it contains the exact truth, I would have deferred it if his personal hatred to me were alone to be considered; but I feel too deeply the loss of the colony to hide from you the cause of it. I can assure you that if I had been the sole master, Quebec would still belong to the King, and that nothing is so disadvantageous in a colony as a division of authority and the mingling of troops of the line with marine [colony] troops. Thoroughly knowing Monsieur de Montcalm, I did not doubt in the least that unless I condescended to all his wishes, he would succeed in ruining Canada and wrecking all my plans.\" He then charges the dead man with losing the battle of Quebec by attacking before he, the Governor, arrived to take command; and this, he says, was due to Montcalm\u0027s absolute determination to exercise independent authority, without caring whether the colony was saved or lost. \"I cannot hide from you, Monseigneur, that if he had had his way in past years Oswego and Fort George [William Henry] would never have been attacked or 321 V2 taken; and he owed the success at Ticonderoga to the orders I had given him.\" [812] Montcalm, on the other hand, declared at the time that Vaudreuil had ordered him not to risk a battle, and that it was only through his disobedience that Ticonderoga was saved. [812] Vaudreuil au Ministre de la Marine, 30 Oct. 1759. Ten days later Vaudreuil wrote again: \"I have already had the honor, by my letter written in cipher on the thirteenth of last month, to give you a sketch of the character of Monsieur the Marquis of Montcalm; but I have just been informed of a stroke so black that I think, Monseigneur, that I should fail in my duty to you if I did not tell you of it.\" He goes on to say that, a little before his death, and \"no doubt in fear of the fate that befell him,\" Montcalm placed in the hands of Father Roubaud, missionary at St. Francis, two packets of papers containing remarks on the administration of the colony, and especially on the manner in which the military posts were furnished with supplies; that these observations were accompanied by certificates; and that they involved charges against him, the Governor, of complicity in peculation. Roubaud, he continues, was to send these papers to France; \"but now, Monseigneur, that you are informed about them, I feel no anxiety, and I am sure that the King will receive no impression from them without acquainting himself with their truth or falsity.\" Vaudreuil\u0027s anxiety was natural; and so was the action of Montcalm in making known to the Court 322 V2 the outrageous abuses that threatened the King\u0027s service with ruin. His doing so was necessary, both for his own justification and for the public good; and afterwards, when Vaudreuil and others were brought to trial at Paris, and when one of the counsel for the defence charged the late general with slanderously accusing his clients, the Court ordered the charge to be struck from the record. [813] The papers the existence of which, if they did exist, so terrified Vaudreuil, have thus far escaped research. But the correspondence of the two rivals with the chiefs of the departments on which they severally depended is in large measure preserved; and while that of the Governor is filled with defamation of Montcalm and praise of himself, that of the General is neither egotistic nor abusive. The faults of Montcalm have sufficiently appeared. They were those of an impetuous, excitable, and impatient nature, by no means free from either ambition or vanity; but they were never inconsistent with the character of a man of honor. His impulsive utterances, reported by retainers and sycophants, kept Vaudreuil in a state of chronic rage; and, void as he was of all magnanimity, gnawed with undying jealousy, and mortally in dread of being compromised by the knaveries to which he had lent his countenance, he could not contain himself within the bounds of decency or sense. In another letter he had the baseness to say that Montcalm met his death in trying to escape from the English. [813] Procès de Bigot, Cadet, et autres. 323 V2 Among the Governor\u0027s charges are some which cannot be flatly denied. When he accuses his rival of haste and precipitation in attacking the English army, he touches a fair subject of criticism; but, as a whole, he is as false in his detraction of Montcalm as in his praises of Bigot and Cadet. The letter which Wolfe sent to Pitt a few days before his death, written in what may be called a spirit of resolute despair, and representing success as almost hopeless, filled England with a dejection that found utterance in loud grumblings against the Ministry. Horace Walpole wrote the bad news to his friend Mann, ambassador at Florence: \"Two days ago came letters from Wolfe, despairing as much as heroes can despair. Quebec is well victualled, Amherst is not arrived, and fifteen thousand men are encamped to defend it. We have lost many men by the enemy, and some by our friends; that is, we now call our nine thousand only seven thousand. How this little army will get away from a much larger, and in this season, in that country, I don\u0027t guess: yes, I do.\" Hardly were these lines written when tidings came that Montcalm was defeated, Quebec taken, and Wolfe killed. A flood of mixed emotions swept over England. Even Walpole grew half serious as he sent a packet of newspapers to his friend the ambassador. \"You may now give yourself what airs you please. An ambassador is the only man in the world whom bullying becomes. All precedents are on your side: Persians, Greeks, Romans, always insulted their neighbors when they took 324 V2 Quebec. Think how pert the French would have been on such an occasion! What a scene! An army in the night dragging itself up a precipice by stumps of trees to assault a town and attack an enemy strongly intrenched and double in numbers! The King is overwhelmed with addresses on our victories; he will have enough to paper his palace.\" [814] [814] Letters of Horace Walpole, III. 254, 257 (ed. Cunningham, 1857). When, in soberer mood, he wrote the annals of his time, and turned, not for the better, from the epistolary style to the historical, he thus described the impression made on the English public by the touching and inspiring story of Wolfe\u0027s heroism and death: \"The incidents of dramatic fiction could not be conducted with more address to lead an audience from despondency to sudden exaltation than accident prepared to excite the passions of a whole people. They despaired, they triumphed, and they wept; for Wolfe had fallen in the hour of victory. Joy, curiosity, astonishment, was painted on every countenance. The more they inquired, the more their admiration rose. Not an incident but was heroic and affecting.\" [815] England blazed with bonfires. In one spot alone all was dark and silent; for here a widowed mother mourned for a loving and devoted son, and the people forbore to profane her grief with the clamor of their rejoicings. [815] Walpole, Memoirs of George II., II. 384. New England had still more cause of joy than Old, and she filled the land with jubilation. The 325 V2 pulpits resounded with sermons of thanksgiving, some of which were worthy of the occasion that called them forth. Among the rest, Jonathan Mayhew, a young but justly celebrated minister of Boston, pictured with enthusiasm the future greatness of the British-American colonies, with the continent thrown open before them, and foretold that, \"with the continued blessing of Heaven, they will become, in another century or two, a mighty empire;\" adding in cautious parenthesis, \"I do not mean an independent one.\" He read Wolfe\u0027s victory aright, and divined its far-reaching consequence. Note.—The authorities of this chapter are, in the main, the same as those of the preceding, with some additions, the principal of which is the Mémoire du Sieur de Ramezay, Chevalier de l\u0027Ordre royal et militaire de St.-Louis, cy-devant Lieutenant pour le Roy commandant à Québec, au sujet de la Reddition de cette Ville, qui a été suivie de la Capitulation du 18 7bre, 1759 (Archives de la Marine). To this document are appended a number of important \"pièces justificatives.\" These, with the Mémoire, have been printed by the Quebec Historical Society. The letters of Vaudreuil cited in this chapter are chiefly from the Archives Nationales. If Montcalm, as Vaudreuil says, really intrusted papers to the care of the Jesuit missionary Roubaud, he was not fortunate in his choice of a depositary. After the war Roubaud renounced his Order, adjured his faith, and went over to the English. He gave various and contradictory accounts of the documents said to be in his hands. On one occasion he declared that Montcalm\u0027s effects left with him at his mission of St. Francis had been burned to prevent their falling into the hands of the enemy (see Verreau, Report on Canadian Archives, 1874, p. 183). Again, he says that he had placed in the hands of the King of England certain letters of Montcalm (see Mr. Roubaud\u0027s Deplorable Case, humbly submitted to Lord North\u0027s Consideration, in Historical Magazine, Second Series, VIII. 283). Yet again, he speaks of these same letters as \"pretended\" (Verreau, as above). He complains that some of them had been published, without his consent, \"by a Lord belonging to His Majesty\u0027s household\" (Mr. Roubaud\u0027s Deplorable Case). The allusion here is evidently to a pamphlet printed in London, in 1777, in French and English, and entitled, Lettres de Monsieur le Marquis de Montcalm, Gouverneur-Général en Canada, à Messieurs de Berryer et de 326 V2 la Molé, écrites dans les Années 1757, 1758, et 1759, avec une Version Angloise. They profess to be observations by Montcalm on the English colonies, their political character, their trade, and their tendency to independence. They bear the strongest marks of being fabricated to suit the times, the colonies being then in revolt. The principal letter is one addressed to Molé, and bearing date Quebec, Aug. 24, 1759. It foretells the loss of her colonies as a consequence to England of her probable conquest of Canada. I laid before the Massachusetts Historical Society my reasons for believing this letter, like the rest, an imposture (see the Proceedings of that Society for 1869-1870, pp. 112-128). To these reasons it may be added that at the date assigned to the letter all correspondence was stopped between Canada and France. From the arrival of the English fleet, at the end of spring, till its departure, late in autumn, communication was completely cut off. It was not till towards the end of November, when the river was clear of English ships, that the naval commander Kanon ran by the batteries of Quebec and carried to France the first news from Canada. Some of the letters thus sent were dated a month before, and had waited in Canada till Kanon\u0027s departure. Abbé Verreau—a high authority on questions of Canadian history—tells me a comparison of the handwriting has convinced him that these pretended letters of Montcalm are the work of Roubaud. On the burial of Montcalm, see Appendix J. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/2857/78991.html","bookId":409,"book":{"id":409,"title":"Pioneers Of France In The New World: France and England in North America","description":"简介： The springs of American civilization, unlike those of the elder world, lie revealed in the clear light of History. In appearance they are feeble; in reality, copious and full of force. Acting at the sources of life, instruments otherwise weak become...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2857","creation":"Aug 1, 2019 12:18:44 AM","modification":"Aug 1, 2019 12:18:44 AM"}}
