{"id":17447,"no":40,"title":"CHAPTER IX.","content":"1637. CHARACTER OF THE CANADIAN JESUITS. Jean de Brébeuf ? Charles Garnier ? Joseph Marie Chaumonot ? No?l Chabanel ? Isaac Jogues ? Other Jesuits ? Nature of their Faith ? Supernaturalism ? Visions ? Miracles Before pursuing farther these obscure, but noteworthy, scenes in the drama of human history, it will be well to indicate, so far as there are means of doing so, the distinctive traits of some of the chief actors. Mention has often been made of Brébeuf,—that masculine apostle of the Faith,—the Ajax of the mission. Nature had given him all the passions of a vigorous manhood, and religion had crushed them, curbed them, or tamed them to do her work,—like a dammed-up torrent, sluiced and guided to grind and saw and weave for the good of man. Beside him, in strange contrast, stands his co-laborer, Charles Garnier. Both were of noble birth and gentle nurture; but here the parallel ends. Garnier\u0027s face was beardless, though he was above thirty years old. For this he was laughed at by his friends in Paris, but admired by 100 the Indians, who thought him handsome. [1] His constitution, bodily or mental, was by no means robust. From boyhood, he had shown a delicate and sensitive nature, a tender conscience, and a proneness to religious emotion. He had never gone with his schoolmates to inns and other places of amusement, but kept his pocket-money to give to beggars. One of his brothers relates of him, that, seeing an obscene book, he bought and destroyed it, lest other boys should be injured by it. He had always wished to be a Jesuit, and, after a novitiate which is described as most edifying, he became a professed member of the Order. The Church, indeed, absorbed the greater part, if not the whole, of this pious family,—one brother being a Carmelite, another a Capuchin, and a third a Jesuit, while there seems also to have been a fourth under vows. Of Charles Garnier there remain twenty-four letters, written at various times to his father and two of his brothers, chiefly during his missionary life among the Hurons. They breathe the deepest and most intense Roman Catholic piety, and a spirit enthusiastic, yet sad, as of one renouncing all the hopes and prizes of the world, and living for Heaven alone. The affections of his sensitive nature, severed from earthly objects, found relief in an ardent adoration of the Virgin Mary. With none of the bone and sinew of rugged manhood, he entered, not only without hesitation, but with 101 eagerness, on a life which would have tried the boldest; and, sustained by the spirit within him, he was more than equal to it. His fellow-missionaries thought him a saint; and had he lived a century or two earlier, he would perhaps have been canonized: yet, while all his life was a willing martyrdom, one can discern, amid his admirable virtues, some slight lingerings of mortal vanity. Thus, in three several letters, he speaks of his great success in baptizing, and plainly intimates that he had sent more souls to Heaven than the other Jesuits. [2] [1] \"C\u0027est pourquoi j\u0027ai bien gagne à quitter la France, où vous me fesiez la guerre de n\u0027avoir point de barbe; car c\u0027est ce qui me fait estimer beau des Sauvages.\"—Lettres de Garnier, MSS. [2] The above sketch of Garnier is drawn from various sources. Observations du P. Henri de St. Joseph, Carme, sur son Frère le P. Charles Garnier, MS.—Abrégé de la Vie du R. Père Charles Garnier, MS. This unpublished sketch bears the signature of the Jesuit Ragueneau, with the date 1652. For the opportunity of consulting it I am indebted to Rev. Felix Martin, S. J.—Lettres du P. Charles Garnier, MSS. These embrace his correspondence from the Huron country, and are exceedingly characteristic and striking. There is another letter in Carayon, Première Mission.—Garnier\u0027s family was wealthy, as well as noble. Its members seem to have been strongly attached to each other, and the young priest\u0027s father was greatly distressed at his departure for Canada. Next appears a young man of about twenty-seven years, Joseph Marie Chaumonot. Unlike Brébeuf and Garnier, he was of humble origin,—his father being a vine-dresser, and his mother the daughter of a poor village schoolmaster. At an early age they sent him to Chatillon on the Seine, where he lived with his uncle, a priest, who taught him to speak Latin, and awakened his religious susceptibilities, which were naturally strong. This did not prevent him from yielding to the persuasions of one of his companions to run off to Beaune, a town of Burgundy, where the fugitives proposed to 102 study music under the Fathers of the Oratory. To provide funds for the journey, he stole a sum of about the value of a dollar from his uncle, the priest. This act, which seems to have been a mere peccadillo of boyish levity, determined his future career. Finding himself in total destitution at Beaune, he wrote to his mother for money, and received in reply an order from his father to come home. Stung with the thought of being posted as a thief in his native village, he resolved not to do so, but to set out forthwith on a pilgrimage to Rome; and accordingly, tattered and penniless, he took the road for the sacred city. Soon a conflict began within him between his misery and the pride which forbade him to beg. The pride was forced to succumb. He begged from door to door; slept under sheds by the wayside, or in haystacks; and now and then found lodging and a meal at a convent. Thus, sometimes alone, sometimes with vagabonds whom he met on the road, he made his way through Savoy and Lombardy in a pitiable condition of destitution, filth, and disease. At length he reached Ancona, when the thought occured to him of visiting the Holy House of Loretto, and imploring the succor of the Virgin Mary. Nor were his hopes disappointed. He had reached that renowned shrine, knelt, paid his devotions, and offered his prayer, when, as he issued from the door of the chapel, he was accosted by a young man, whom he conjectures to have been an angel descended to his relief, and who was probably some penitent or devotee bent on works of charity or 103 self-mortification. With a voice of the greatest kindness, he proffered his aid to the wretched boy, whose appearance was alike fitted to awaken pity and disgust. The conquering of a natural repugnance to filth, in the interest of charity and humility, is a conspicuous virtue in most of the Roman Catholic saints; and whatever merit may attach to it was acquired in an extraordinary degree by the young man in question. Apparently, he was a physician; for he not only restored the miserable wanderer to a condition of comparative decency, but cured him of a grievous malady, the result of neglect. Chaumonot went on his way, thankful to his benefactor, and overflowing with an enthusiasm of gratitude to Our Lady of Loretto. [3] [3] \"Si la moindre dame m\u0027avoit fait rendre ce service par le dernier de ses valets, n\u0027aurois-je pas dus lui en rendre toutes les reconnoissances possibles? Et si après une telle charité elle s\u0027étoit offerte à me servir toujours de mesme, comment aurois-je d? l\u0027honorer, lui obéir, l\u0027aimer toute ma vie! Pardon, Reine des Anges et des hommes! pardon de ce qu\u0027après avoir re?u de vous tant de marques, par lesquelles vous m\u0027avez convaincu que vous m\u0027avez adopté pour votre fils, j\u0027ai eu l\u0027ingratitude pendant des années entières de me comporter encore plut?t en esclave de Satan qu\u0027en enfant d\u0027une Mère Vierge. O que vous êtes bonne et charitable! puisque quelques obstacles que mes péchés ayent pu mettre à vos graces, vous n\u0027avez jamais cessé de m\u0027attirer au bien; jusque là que vous m\u0027avez fait admettre dans la Sainte Compagnie de Jésus, votre fils.\"—Chaumonot, Vie, 20. The above is from the very curious autobiography written by Chaumonot, at the command of his Superior, in 1688. The original manuscript is at the H?tel Dieu of Quebec. Mr. Shea has printed it. As he journeyed towards Rome, an old burgher, at whose door he had begged, employed him as a servant. He soon became known to a Jesuit, to whom he had confessed himself in Latin; and as his acquirements were considerable for his years, he was eventually employed as teacher of a low 104 class in one of the Jesuit schools. Nature had inclined him to a life of devotion. He would fain be a hermit, and, to that end, practised eating green ears of wheat; but, finding he could not swallow them, conceived that he had mistaken his vocation. Then a strong desire grew up within him to become a Récollet, a Capuchin, or, above all, a Jesuit; and at length the wish of his heart was answered. At the age of twenty-one, he was admitted to the Jesuit novitiate. [4] Soon after its close, a small duodecimo volume was placed in his hands. It was a Relation of the Canadian mission, and contained one of those narratives of Brébeuf which have been often cited in the preceding pages. Its effect was immediate. Burning to share those glorious toils, the young priest asked to be sent to Canada; and his request was granted. [4] His age, when he left his uncle, the priest, is not mentioned. But he must have been a mere child; for, at the end of his novitiate, he had forgotten his native language, and was forced to learn it a second time. \"Jamais y eut-il homme sur terre plus obligé que moi à la Sainte Famille de Jésus, de Marie et de Joseph! Marie en me guérissant de ma vilaine galle ou teigne, me délivra d\u0027une infinité de peines et d\u0027incommodités corporelles, que cette hideuse maladie qui me rongeoit m\u0027avoit causé. Joseph m\u0027ayant obtenu la grace d\u0027être incorporé à un corps aussi saint qu\u0027est celui des Jésuites, m\u0027a preservé d\u0027une infinité de misères spirituelles, de tentations très dangereuses et de péchés très énormes. Jésus n\u0027ayant pas permis que j\u0027entrasse dans aucun autre ordre qu\u0027en celui qu\u0027il honore tout à la fois de son beau nom, de sa douce présence et de sa protection spéciale. O Jésus! O Marie! O Joseph! qui méritoit moins que moi vos divines faveurs, et envers qui avez vous été plus prodigue?\"—Chaumonot, Vie, 37. Before embarking, he set out with the Jesuit Poncet, who was also destined for Canada, on a pilgrimage from Rome to the shrine of Our Lady of Loretto. They journeyed on foot, begging alms 105 by the way. Chaumonot was soon seized with a pain in the knee, so violent that it seemed impossible to proceed. At San Severino, where they lodged with the Barnabites, he bethought him of asking the intercession of a certain poor woman of that place, who had died some time before with the reputation of sanctity. Accordingly he addressed to her his prayer, promising to publish her fame on every possible occasion, if she would obtain his cure from God. [5] The intercession was accepted; the offending limb became sound again, and the two pilgrims pursued their journey. They reached Loretto, and, kneeling before the Queen of Heaven, implored her favor and aid; while Chaumonot, overflowing with devotion to this celestial mistress of his heart, conceived the purpose of building in Canada a chapel to her honor, after the exact model of the Holy House of Loretto. They soon afterwards embarked together, and arrived among the Hurons early in the autumn of 1639. [5] \"Je me recommandai à elle en lui promettant de la faire conno?tre dans toutes les occasions que j\u0027en aurois jamais, si elle m\u0027obtenoit de Dieu ma guérison.\"—Chaumonot, Vie, 46. No?l Chabanel came later to the mission; for he did not reach the Huron country until 1643. He detested the Indian life,—the smoke, the vermin, the filthy food, the impossibility of privacy. He could not study by the smoky lodge-fire, among the noisy crowd of men and squaws, with their dogs, and their restless, screeching children. He had a natural inaptitude to learning the language, and 106 labored at it for five years with scarcely a sign of progress. The Devil whispered a suggestion into his ear: Let him procure his release from these barren and revolting toils, and return to France, where congenial and useful employments awaited him. Chabanel refused to listen; and when the temptation still beset him, he bound himself by a solemn vow to remain in Canada to the day of his death. [6] [6] Abrégé de la Vie du Père No?l Chabanel, MS. This anonymous paper bears the signature of Ragueneau, in attestation of its truth. See also Ragueneau, Relation, 1650, 17, 18. Chabanel\u0027s vow is here given verbatim. Isaac Jogues was of a character not unlike Garnier. Nature had given him no especial force of intellect or constitutional energy, yet the man was indomitable and irrepressible, as his history will show. We have but few means of characterizing the remaining priests of the mission otherwise than as their traits appear on the field of their labors. Theirs was no faith of abstractions and generalities. For them, heaven was very near to earth, touching and mingling with it at many points. On high, God the Father sat enthroned; and, nearer to human sympathies, Divinity incarnate in the Son, with the benign form of his immaculate mother, and her spouse, St. Joseph, the chosen patron of New France. Interceding saints and departed friends bore to the throne of grace the petitions of those yet lingering in mortal bondage, and formed an ascending chain from earth to heaven. These priests lived in an atmosphere of supernaturalism. Every day had its miracle. Divine 107 power declared itself in action immediate and direct, controlling, guiding, or reversing the laws of Nature. The missionaries did not reject the ordinary cures for disease or wounds; but they relied far more on a prayer to the Virgin, a vow to St. Joseph, or the promise of a neuvaine, or nine days\u0027 devotion, to some other celestial personage; while the touch of a fragment of a tooth or bone of some departed saint was of sovereign efficacy to cure sickness, solace pain, or relieve a suffering squaw in the throes of childbirth. Once, Chaumonot, having a headache, remembered to have heard of a sick man who regained his health by commending his case to St. Ignatius, and at the same time putting a medal stamped with his image into his mouth. Accordingly he tried a similar experiment, putting into his mouth a medal bearing a representation of the Holy Family, which was the object of his especial devotion. The next morning found him cured. [7] [7] Chaumonot, Vie, 73. The relation between this world and the next was sometimes of a nature curiously intimate. Thus, when Chaumonot heard of Garnier\u0027s death, he immediately addressed his departed colleague, and promised him the benefit of all the good works which he, Chaumonot, might perform during the next week, provided the defunct missionary would make him heir to his knowledge of the Huron tongue. [8] And he ascribed to the deceased Garnier\u0027s 108 influence the mastery of that language which he afterwards acquired. [8] \"Je n\u0027eus pas plut?t appris sa glorieuse mort, que je lui promis tout ce que je ferois de bien pendant huit jours, à condition qu\u0027il me feroit son héritier dans la connoissance parfaite qu\u0027il avoit du Huron.\"—Chaumonot, Vie, 61. The efforts of the missionaries for the conversion of the savages were powerfully seconded from the other world, and the refractory subject who was deaf to human persuasions softened before the superhuman agencies which the priest invoked to his aid. [9] [9] As these may be supposed to be exploded ideas of the past, the writer may recall an incident of his youth, while spending a few days in the convent of the Passionists, near the Coliseum at Rome. These worthy monks, after using a variety of arguments for his conversion, expressed the hope that a miraculous interposition would be vouchsafed to that end, and that the Virgin would manifest herself to him in a nocturnal vision. To this end they gave him a small brass medal, stamped with her image, to be worn at his neck, while they were to repeat a certain number of Aves and Paters, in which he was urgently invited to join; as the result of which, it was hoped the Virgin would appear on the same night. No vision, however, occurred. It is scarcely necessary to add, that signs and voices from another world, visitations from Hell and visions from Heaven, were incidents of no rare occurrence in the lives of these ardent apostles. To Brébeuf, whose deep nature, like a furnace white hot, glowed with the still intensity of his enthusiasm, they were especially frequent. Demons in troops appeared before him, sometimes in the guise of men, sometimes as bears, wolves, or wild-cats. He called on God, and the apparitions vanished. Death, like a skeleton, sometimes menaced him, and once, as he faced it with an unquailing eye, it fell powerless at his feet. A demon, in the form of a woman, assailed him with the temptation which beset St. Benedict among the rocks of Subiaco; but Brébeuf signed the cross, and the infernal siren melted into air. He saw the vision 109 of a vast and gorgeous palace; and a miraculous voice assured him that such was to be the reward of those who dwelt in savage hovels for the cause of God. Angels appeared to him; and, more than once, St. Joseph and the Virgin were visibly present before his sight. Once, when he was among the Neutral Nation, in the winter of 1640, he beheld the ominous apparition of a great cross slowly approaching from the quarter where lay the country of the Iroquois. He told the vision to his comrades. \"What was it like? How large was it?\" they eagerly demanded. \"Large enough,\" replied the priest, \"to crucify us all.\" [10] To explain such phenomena is the province of psychology, and not of history. Their occurrence is no matter of surprise, and it would be superfluous to doubt that they were recounted in good faith, and with a full belief in their reality. [10] Quelques Remarques sur la Vie du Père Jean de Brébeuf, MS. On the margin of this paper, opposite several of the statements repeated above, are the words, signed by Ragueneau, \"Ex ipsius autographo,\" indicating that the statements were made in writing by Brébeuf himself. Still other visions are recorded by Chaumonot as occurring to Brébeuf, when they were together in the Neutral country. See also the long notice of Brébeuf, written by his colleague, Ragueneau, in the Relation of 1649; and Tanner, Societas Jesu Militans, 533. In these enthusiasts we shall find striking examples of one of the morbid forces of human nature; yet in candor let us do honor to what was genuine in them,—that principle of self-abnegation which is the life of true religion, and which is vital no less to the highest forms of heroism.","sourceLink":"http://novel.tingroom.com/jingdian/2857/78842.html","bookId":409,"book":{"id":409,"title":"Pioneers Of France In The New World: France and England in North America","description":"简介： The springs of American civilization, unlike those of the elder world, lie revealed in the clear light of History. In appearance they are feeble; in reality, copious and full of force. Acting at the sources of life, instruments otherwise weak become...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2857","creation":"Aug 1, 2019 12:18:44 AM","modification":"Aug 1, 2019 12:18:44 AM"}}
