{"id":17506,"no":99,"title":"Part IV PREFACE.","content":"“The physiognomy of a government,” says De Tocqueville, “can best be judged in its colonies, for there its characteristic traits usually appear larger and more distinct. When I wish to judge of the spirit and the faults of the administration of Louis XIV., I must go to Canada. Its deformity is there seen as through a microscope.” The monarchical administration of France, at the height of its power and at the moment of its supreme triumph, stretched an arm across the Atlantic and grasped the North American continent. This volume attempts to show by what methods it strove to make good its hold, why it achieved a certain kind of success, and why it failed at last. The political system which has fallen, and the antagonistic system which has prevailed, seem, at first sight, to offer nothing but contrasts; yet out of the tomb of Canadian absolutism come voices not without suggestion even to us. Extremes meet, and Autocracy and Democracy often touch hands, at least in their vices. The means of knowing the Canada of the past are ample. The pen was always busy in this outpost of the old monarchy. The king and the minister demanded to know every thing; and officials of high and low degree, soldiers and civilians, friends and foes, poured letters, despatches, and memorials, on both sides of every question, into the lap of government. These masses of paper have in the main survived the perils of revolutions and the incendiary torch of the Commune. Add to them the voluminous records of the Superior Council of Quebec, and numerous other documents preserved in the civil and ecclesiastical depositories of Canada. The governments of New York and of Canada have caused a large part of the papers in the French archives, relating to their early history, to be copied and brought to America, and valuable contributions of material from the same quarter have been made by the State of Massachusetts and by private Canadian investigators. Nevertheless, a great deal has still remained in France, uncopied and unexplored. In the course of several visits to that country, I have availed myself of these supplementary papers, as well as of those which had before been copied, sparing neither time nor pains to explore every part of the field. With the help of a system of classified notes, I have collated the evidence of the various writers, and set down without reserve all the results of the examination, whether favorable or unfavorable. Some of them are of a character which I regret, since they cannot be agreeable to persons for whom I have a very cordial regard. The conclusions drawn from the facts may be matter of opinion, but it will be remembered that the facts themselves can be overthrown only by overthrowing the evidence on which they rest, or bringing forward counter evidence of equal or greater strength; and neither task will be found an easy one. * I have received most valuable aid in my inquiries from the great knowledge and experience of M. Pierre Margry, Chief of the Archives of the Marine and Colonies at Paris. I beg also warmly to acknowledge the kind offices of Abbé Henri Raymond Casgrain and Grand Vicar Cazeau, of Quebec, together with those of James LeMoine, Esq., M. Eugène Taché, Hon. P. J. O. Chauveau, and other eminent Canadians, and Henry Harrisse, Esq. The few extracts from original documents, which are printed in the appendix, may serve as samples of the material out of which the work has been constructed. In some instances their testimony * Those who wish to see the subject from a point of view opposite to mine cannot do better than consult the work of the Jesuit Charlevoix, with the excellent annotation of Mr. Shea. (History and General Description of New France, by the Rev. P. F. X. de Charlevoix, S.J., translated with notes by John Gilmary Shea. 6 vols. New York: 1866-1872.) might be multiplied twenty-fold. When the place of deposit of the documents cited in the margin is not otherwise indicated, they will, in nearly all cases, be found in the Archives of the Marine and Colonies. In the present book we examine the political and social machine; in the next volume of the series we shall see this machine in action. Boston, July 1, 1874.","sourceLink":"http://novel.tingroom.com/jingdian/2857/78901.html","bookId":409,"book":{"id":409,"title":"Pioneers Of France In The New World: France and England in North America","description":"简介： The springs of American civilization, unlike those of the elder world, lie revealed in the clear light of History. In appearance they are feeble; in reality, copious and full of force. Acting at the sources of life, instruments otherwise weak become...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2857","creation":"Aug 1, 2019 12:18:44 AM","modification":"Aug 1, 2019 12:18:44 AM"}}
