{"id":110212,"no":13,"title":"Page 13","content":"\n “I had you pegged for some corporate James Bond,” she said, and shook her head. “Licensed to kill. Driving some kind of high-tech armored spy vehicle with rocket launchers. Jesus, you have a car seat.”\n “Wouldn’t let my kid ride without it,” he said. “I’ve got three. Oldest is Jeff; he’s seven. Then Harry; she’s five. Juliet’s the baby.”\n “I guess you’ve got a wife to go with that.”\n “Kylie,” he said. “Best wife in the world. Best mom, too.” He sounded quietly proud. “Here. Pictures.” He opened the glove box, and there was an honest-to-God brag book in there, of charming kids and a pretty wife. Fideli looked like a different person in those pictures, relaxed and happy, a little goofy. It was … adorable.\n And it reminded Bryn, with a cold shock, that her life was never going that way. Not now. She stared down at the picture of Juliet, a happy, giggling little baby in her mother’s arms, and her eyes filled with tears. “I can’t have kids now, can I?” she asked.\n Fideli said nothing. When she looked over at him, his mouth was set in a pained, grim line, and his knuckles were tight where he gripped the steering wheel. She closed the picture album and put it in the glove compartment. The silence held until they were pulled up in front of the glowing marquee with all of the not-healthy choices.\n “I’ll have a Monster Burger with fries and a Coke,” he said to the speaker, and then glanced at Bryn. “How about you?”\n “Same thing,” she said, and tried for a smile as she wiped her eyes. “Guess cholesterol’s not an issue, right?”\n “Bright side,” he agreed, and conveyed the order. “Might as well get extra cheese with that.”\n The smell of the food filled the cab as they pulled away from the payment window, and Bryn realized that she was actually hungry. Funny, she hadn’t expected to feel that at all, for some reason. Sensation, yes, but needs? It just seemed strange.\n French fries still tasted as salty-delicious as ever. She munched on them as Fideli drove the last two miles to her apartment. It wasn’t much, a lower-middle-class kind of neighborhood with hardworking people. The apartments were generic and cheaply made, but affordable. Fideli didn’t ask what building she lived in, which indicated a little more knowledge about her than she felt strictly comfortable with; he parked the big SUV and said, “You mind if I take off? I like to eat with the family when I can.”\n “Sure,” she said. She felt strange, suddenly, as if she were looking at a building she didn’t know, facing an evening with a total stranger: herself. She took her Coke and bagged food, but made no move to get out of the truck. It idled gently, waiting. Fideli watched her in silence.\n “Hey,” he finally said. “Better idea. How about you come with me?”\n She jerked a little in surprise, because she really hadn’t expected that. She’d been waiting for him to impatiently order her out. “What?”\n “Home,” he said. “You look like you don’t need to sit alone and watch your burger get cold, Bryn. It’s been a pretty full couple of days for you, I’d say.” What he wasn’t saying was that he saw the fear in her. Fear of facing life alone, the way she was now. Whatever she was.\n “Joe …” She didn’t mean to use his first name; it was just instinct. She bit her lip. “Mr. Fideli … there’s no chance I could be … contagious, is there? I mean, I don’t want to put your family in any danger.”\n He shook his head. “Can’t share the nanites, even through an open wound. They’re keyed to your DNA, cease to function outside your body. I wouldn’t let you around the kids if there were any risk, believe me.”\n “And you’re sure that I’m not going to get a craving for brains or anything.”\n He laughed this time. “You let me know if that happens. But no. It ain’t your zombie apocalypse scenario, not this time. You’re just … you. On permanent, portable life support.” That was a sobering thought, and even he stopped laughing. He put the truck in reverse. “No arguments—you’re eating with us. We’ve got a guest room, too. Kylie’s got some stuff that’ll fit you.”\n Bryn wasn’t really in the mood to stand her ground, not tonight. She was, deep inside, sobbingly grateful to him for the kindness. If she’d faced those blank, generic walls of her apartment alone …\n She wasn’t sure what she would have done.\n “Hey,” she said. “Can I bring my dog?”\n Fideli raised his eyebrows. “Sure.”\n The messes inside the house really weren’t something Bryn wanted to face, but she forced herself to clean up the worst of it. It wasn’t the dog’s fault, after all; she’d been busy getting herself killed and revived for almost a full day. In fact, Mr. French, her bulldog, was well behaved even in Fideli’s wildly interesting SUV; he contented himself with sniffing the interior door and then poking his head out of Bryn’s passenger window, tongue out and ears flapping all the way.\n Fideli’s house was a rambling ranch style in a typical suburban neighborhood, nothing really special about it except the old-growth trees that made it seem hidden and protected. There were more signs it was a house with kids that she spotted as soon as she drove up—the mommy van in the driveway, a boy’s bike lying on its side in the grass, a brightly colored Big Wheel nearby. A candy-colored plastic playhouse made for a little girl.\n The windows of the house glowed with warmth.\n Bryn put Mr. French on his leash and carried her own food as she followed Fideli up the walk to the side door—the kitchen door, as it turned out, and the kitchen was busy. Bryn had to immediately back up against the wall to avoid a pair of running children, a boy and a girl, who whizzed by. The girl stopped to awkwardly pat Mr. French on the head, then dashed off.\n Mr. French woofed and sneezed, then sat down with his head cocked, assessing his new situation.\n “Jeff, Harry, I’m warning you, one more time….” The woman from Fideli’s picture book rounded the corner carrying a stack of dirty dishes and stopped, glancing from Joe to Bryn and back again. The hesitation lasted for only a second, and then she came up with a bright, nearly genuine smile. “Hey, honey. Who’s this?”\n Joe took the dirty dishes from her and put them down in the sink, then kissed her. It was a warm, comfortable kind of kiss, not self-conscious at all, and then the kids came racing back around yelling and flung themselves on his legs, and he hugged them.\n Bryn stood there clutching the leash, her Coke, and her bagged food, feeling like this had been a massive mistake, feeling more isolated than ever … until Kylie came forward, wiping her hands on a towel, and took the Coke and bag from her to put them on the counter. “My husband doesn’t know how to introduce people,” she said, “so I’ll just jump in. Kylie, and that’s Jeff and Harry. Harriet, but we all call her Harry.” The two kids, one blond, one dark, waved. “The baby’s still in her chair in the dining room—honey, check her, would you?”\n “Yep,” Joe said, and walked out of the kitchen trailing children.\n The noise level dropped to almost nothing, and Bryn felt awkward again. “Hi,” she said, and held out her hand. “I’m Bryn. Bryn Davis. I, ah …” How was she supposed to explain any of this? How top-secret was it, anyway? “I work with Joe. Oh, and this is Mr. French. I promise he’s housebroken.”\n Kylie smiled at the dog, then shook hands. She had fine blue eyes, and Bryn sensed a sharp, lively intelligence behind them. “I never heard him mention you before.”\n Joe appeared in the doorway again with a baby on his hip, comfortably braced in his big arm. “She’s new,” he said. “Honey, take her a minute; I have to lock up the boom sticks.”\n “Jesus, Joe, you’re walking around with her and your guns?” Kylie rolled her eyes and took the little girl, who cooed and nestled against her with more trust than Bryn thought she’d ever had shown to her in her entire life. “Go. Shoo. Get less dangerous.”\n “Impossible,” Joe said. “I’m a lethal weapon, baby.”\n “Shut up.”\n He blew her a kiss and disappeared again. Kylie jiggled the baby—Juliet—on her hip and exchanged another smile with Bryn. “So,” she said, “he talked you into the heart-attack special, right? I hardly ever let him eat that stuff, which is probably why he’s running late. Here, let me get you a plate; go on into the dining room.” She raised her voice to a yell. “Jeff, come in here and rinse the dishes!”\n “Mooooooom, the show’s starting!”\n “It’s recorded, honey; put it on pause and just do what I tell you.” Kylie handed Bryn a plate, picked up the food and drink, and followed her into the dining room. It was a warm kind of room, all earth tones and wood, with family photos on the walls. Bryn felt a little odd eating fast food there, until Joe Fideli came back, plunked his own down on the table, and began digging in. Kylie settled in across from him.\n Bryn found out quickly that she wasn’t just hungry; she was ravenous. The burger disappeared, and so did the fries. The fizzy sweetness of the Coke tasted so good it almost made her weep.\n She didn’t feel quite as dead anymore. Especially when Mr. French stretched himself out in a warm blanket across her feet.\n Kylie and Joe chatted about family stuff, occasionally asking her a question or two; it was all unforced and comfortable, and Joe finally got around to telling his wife that he’d invited Bryn to use the guest room. That got another second of hesitation, as if she were trying to figure out his motivations, and then a quick agreement. Kylie got up to fix the room while Joe slurped the last of his drink.\n “Do they know?” Bryn asked softly. “I mean, about what you do.” Whatever that was.\n “They know I’m in corporate security,” Joe said. “And that my work is top-secret. So she won’t ask you any questions. She’s just going to assume you’re someone I’m protecting. Which is true.” \n","sourceLink":"https://allnovel.net/working-stiff-revivalist-1/page-13.html","bookId":2538,"book":{"id":2538,"title":"Working Stiff (Revivalist #1)","description":"Storyline: \n Working Stiff (Revivalist #1) \n Bryn Davis knows working at Fairview Mortuary isn\u0027t the most glamorous career choice, but at least it offers stable employment--until she discovers her bosses using a drug that resurrects the clientele as part of an extortion racket. Now, Bryn faces being terminated--literally, and with extreme prejudice. \n Wit the help of corporate double-agent Patrick McCallister, Bryn has a chance to take down the bigger problem--pharmaceutical company Pharmadene, which treats death as the ultimate corporate loyalty program. She\u0027d better do it fast, before she becomes a zombie slave--a real working stiff. She\u0027d be better off dead...\n \n","cover":"https://allnovel.net/images/working-stiff-revivalist-1.jpg","author":"Rachel Caine","type":"Horror","source":"allnovel","link":"https://allnovel.net/working-stiff-revivalist-1.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 5, 2019 11:51:32 PM"}}
