{"id":110220,"no":22,"title":"Page 22","content":"\n And then Irene Harte strode in.\n Bryn’s immediate first impression was that she was in the presence of someone whose face she ought to recognize—a high-powered politician, actress, royalty. Someone who was important. The smile Irene bestowed on her confirmed it—it was warm and professional, but somehow also definitely superior.\n Bryn came around the desk as Ms. Harte held out her very well-manicured hand and said, “Miss Davis? Irene Harte, Pharmadene Pharmaceuticals. Very pleased to meet you.”\n The handshake that followed was brief and impersonal, and Bryn managed a polite smile and indicated the chair opposite her desk. Ms. Harte ignored the offer to sit, and instead stood there in her six-hundred-dollar pumps and studied Bryn with the impersonal intensity of an accountant reading a spreadsheet. “I understand that you’ve been briefed on the trouble we had with Mr. Fairview and his operations,” Harte said, “and that you are unable to provide us with the identity of the person from whom he was obtaining his … supplies. Is that correct?”\n Behind her, Patrick McCallister quietly entered the room, closed the door, and took up a post with his back to it—at parade rest, like the other security men. But as Bryn met his eyes, he gave her a slight nod and what was almost a smile.\n Bryn cleared her throat. “No, ma’am, that’s not correct.”\n “No?” Harte’s eyebrows climbed in astonished, perfectly shaped arcs. “Please enlighten me.”\n “I’m not unable to provide you with that information. I just don’t yet have all the facts.”\n “Excuse me?” Harte’s smile was gone now, and her strong, beautiful face had gone still and expressionless. “Either you know or you don’t, Miss Davis.”\n “I’m in a position to get that information for you. It will just take some time. I’m in contact with the supplier.”\n “Time is something that I don’t like to spend, not on something as volatile and sensitive as this. Pharmadene has a significant intellectual capital risk at stake, and I can’t afford to fund your fact-finding expedition. Nor can I afford to spend valuable supplies of Returné in hopes that you can one day provide some small return on my investment.” Harte’s eyes were ice-cold, so cold that Bryn didn’t actually register them as being any particular kind of color. “I’m afraid that Mr. McCallister overstepped his authority in green-lighting this project. I’ll have to terminate the funding.”\n “Why don’t you say what you mean?” Bryn asked, feeling her fists clench at her sides. “You’re not terminating money. You’re terminating me. Personally.”\n “All right. You’re in a very unfortunate position, Miss Davis, there’s no doubt about that, but this is a business decision. Your life ended in a brutal and unnatural way, but Pharmadene is not a charity, and even if it were, extending your life support indefinitely is something even charities are reluctant to do when no hope exists for recovery. You won’t recover, you know. Ever.”\n There was, Bryn realized, no reaching her on any human level. Irene Harte had no emotional buttons to press; her control and the smooth, untroubled way she said these things made it clear that Bryn’s play was over.\n So change the game, Bryn thought. “How much is your leak inside the company costing you?”\n “Excuse me?”\n “You’re losing product. I’ll bet it’s costing you plenty, but that’s not the real problem, is it? If your competitors get their hands on it, they can do some reverse engineering and come out with a cheaper version, undermining your patent opportunities before you really get the drug out there. Right? That’s worth millions. Billions. Bill Gates money.”\n Harte still didn’t answer, but Bryn definitely had her attention.\n “What’s it worth to you in the boardroom to save the day instead of being the one to fall on your sword? A few millions in bonuses to you, personally? A promotion? I’ll bet you’re at the level that it’s hard to get another step up on the ladder.” No reaction still, but Bryn kept going. She had, she realized, nothing at all to lose. “And how many of the men above you are looking for an excuse to kick you down a rung or two?”\n That created a flicker in Harte’s calm, just a second of real emotion, and Bryn felt an immense surge of relief. Not that she’d won, far from it. But she’d actually reached her.\n Whether it would matter was a different thing altogether.\n It took an obscenely long time for Harte to say anything, but when she finally did, it wasn’t to Bryn at all. The woman turned to stare at McCallister, and said, “Patrick, this was your idea. Will you stand by it?”\n “Yes,” he said. Just the one word, as solid as concrete. He didn’t try to explain, or coax, or threaten. He just gave her the certainty of his conviction, and waited.\n It took a while, but Harte nodded. “All right. Miss Davis has a point; solving this problem may be worth a minimal investment of time. May be. I’ll give you two weeks, fourteen doses, from today. If nothing solid happens in that time, I’ll roll this up, and everyone involved will be rolled up with it. Are you clear on that, Patrick?”\n “Yes, ma‘am,” he said. He wasn’t looking at Harte; he was, Bryn realized with a shock, watching her. “Will there be anything else?”\n “No.” Harte checked her very expensive diamond-encrusted watch. “I have a dinner engagement. Keep my assistant informed daily on progress.”\n She didn’t wait for any good-byes; she strode toward McCallister and the door, and simply assumed that it would swing open for her, and he’d get out of the way.\n Which was exactly what happened. McCallister made it look as if it were his idea, which was an excellent trick, Bryn thought. As the two guards quickly left, ghosting Harte’s sharp, staccato footsteps, McCallister stayed behind. Bryn took in a deep breath and sat down in the nearest chair. Suddenly, her legs felt weak, and she thought she might actually pass out. She lowered her head and sucked down deep breaths, but still felt as if she were suffocating.\n McCallister’s warm hand touched her shoulder lightly. “Breathe,” he said, and she squeezed her eyes shut and tried to bottle up the black genie of panic that was expanding inside her. She was shuddering now, as the alarm that had been flooding her veins began to subside, and she felt absurdly cold and nauseated. Something warm settled over her shoulders, and when she clutched for it with shaking hands, she realized it was McCallister’s suit coat.\n Bryn looked up and saw him crouched down level with her, making needless adjustments to the jacket he’d draped over her. He wore a shoulder holster, one that appeared to be a match to what she had, and there was not a wrinkle or stain on his perfect white shirt. Even now, he looked calm, composed, absolutely in control of himself and everything around him.\n Bryn said, “She just said she’d kill you, too, didn’t she?”\n And McCallister shrugged, such a small movement that she almost missed it. “I doubt she’d actually try, and if she did, she certainly wouldn’t succeed. You made a good pitch,” he said. “And we’ve got two weeks. It’s something.”\n “She’s going to kill you. And Joe.”\n “Not a chance, and she won’t try to kill anybody if we find the answers, Bryn. Including you.”\n “But—”\n McCallister cut her off. “We got ourselves in it, and I’m not sorry we made the choices we did. Don’t be afraid for us. Concentrate on what you were brought here to do. Relax. Breathe.”\n She did, big, slow, trembling breaths that she dragged in through her nose, blew out through her mouth, until her heartbeat slowed and her nausea began to subside.\n As he started to get up, she said, “Thank you, Mr. McCallister.” And she meant it—not for dragging her back into this—God, no—but for not throwing her to the wolves when he could have. When he should have. He was in it with her now, all the way to his neck. And not just him—Joe Fideli, a family man, too. Not my fault. No, it wasn’t, but that didn’t matter anymore. They’d all go down together.\n Perversely, that made her feel better. Maybe it was just having someone, anyone, at her back.\n McCallister smiled, just a little, and there was a ghost of something warm in his eyes. He was surprisingly nice when he smiled. “Don’t thank me yet,” he said. She started to take off the coat, but he put his hands over hers, stilling them. “Keep it until you really feel better. I’ll be down the hall, talking to Joe. Take your time, Bryn.”\n She watched him leave, and felt a frown grooving its way across her forehead. McCallister didn’t actually care, did he? He couldn’t. Not possible. And, of course, she had no reason to care about him, either. Absolutely none.\n But she did. Hugging his jacket close, she felt the warmth not just of the fabric, but of his body, and when she held the collar closer to her nose she caught a ghost of his cologne, rich and dark. Like his eyes.\n I don’t like him. I’m not going to like him.\n But she kept the coat on for far longer than she needed to, in the end, and when McCallister asked her if she wanted a drink, after dropping off her dog, she found herself saying yes.\n I should have known it wasn’t a date, she thought, as McCallister pushed her cosmo across to her, along with a thumb drive, and said, “I need you to study all of the material on this, and see if you spot anything out of the ordinary.” At least, that was what she thought he said. He was drowned out by someone’s drunken horse laugh at the next table.\n She reached for the cosmo, not the portable storage device. “Why? What is it?” She had to raise her voice to be heard, because the bar was loud, trendy, and full of yelling and thumping music. He’d chosen the highest-volume pickup joint within easy driving distance. At first, she’d thought it had been some sort of odd date thing, but no. McCallister was never off duty, really. He was just using old-school noise canceling to discourage surveillance. \n","sourceLink":"https://allnovel.net/working-stiff-revivalist-1/page-22.html","bookId":2538,"book":{"id":2538,"title":"Working Stiff (Revivalist #1)","description":"Storyline: \n Working Stiff (Revivalist #1) \n Bryn Davis knows working at Fairview Mortuary isn\u0027t the most glamorous career choice, but at least it offers stable employment--until she discovers her bosses using a drug that resurrects the clientele as part of an extortion racket. Now, Bryn faces being terminated--literally, and with extreme prejudice. \n Wit the help of corporate double-agent Patrick McCallister, Bryn has a chance to take down the bigger problem--pharmaceutical company Pharmadene, which treats death as the ultimate corporate loyalty program. She\u0027d better do it fast, before she becomes a zombie slave--a real working stiff. She\u0027d be better off dead...\n \n","cover":"https://allnovel.net/images/working-stiff-revivalist-1.jpg","author":"Rachel Caine","type":"Horror","source":"allnovel","link":"https://allnovel.net/working-stiff-revivalist-1.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 5, 2019 11:51:32 PM"}}
