{"id":110221,"no":23,"title":"Page 23","content":"\\n\\n The taste of the cosmo, sour-sweet, lingered in her mouth like a kiss as McCallister pushed the drive closer. Their fingers brushed when she reached for it, and she glanced up into his face for one quick instant. Lights flashed in her eyes, blinding her, and then the moment was over and he was sitting back, as remote as ever.\\n\\n “It’s surveillance we’ve compiled on Fairview,” he said. “Video, phone taps, e-mails, chat logs—”\\n\\n “Mr. Fairview chatted? Online?” She honestly would have bet he couldn’t manage a computer at all.\\n\\n He raised his eyebrows. “Brace yourself for that, if you still had any illusions about his character; it’s not pretty. We’ve also included his known associates. We’ve been through it, but you’ve got a better chance of spotting something we didn’t.”\\n\\n She nodded and slipped the drive into her purse’s zippered pocket, and toyed with her drink for a moment before downing a courage gulp. Then she said, “You had a choice, didn’t you? Which of us who died in the prep room to revive?”\\n\\n “I don’t understand the question.”\\n\\n “Me or Fast Freddy. Or Mr. Fairview.”\\n\\n “Mr. Fairview had a head wound. He wasn’t revival material from the start.”\\n\\n “You couldn’t bring him back?”\\n\\n “Not in any condition that would allow us to question him. There are limits to what the drug can do.”\\n\\n “But … Fast Freddy. You could have brought him back.”\\n\\n “We didn’t know he was already on the drug, so it’s a good thing we didn’t.”\\n\\n She gazed at him, not blinking this time despite the bright lights strobing in her eyes. He was still just a shadow against them, but she caught the random outlines of his jaw, his mouth, his eyes. All in flickers. “You chose me over Freddy. Knowing he probably had a better shot of telling you what was going on. I know Joe asked you to do it, but you didn’t have to. You must have had another reason.”\\n\\n McCallister was quiet for a long moment, the pause filled with the thunder and howl of the music around them. Then he tossed back the rest of his drink—she didn’t know what it was, except it was light amber—and stood up. “I have to go,” he said. “Tell me what you think about the files, and if you have any leads that come out of it.”\\n\\n She wanted to tell him to wait, to come back, but he walked out, weaving around the drunken, laughing crowds, and disappeared.\\n\\n Bryn stared hard at her cosmo, frowning, and took another sip. No sense letting it go to waste.\\n\\n A man slipped into McCallister’s abandoned chair—not her type, an aging surfer whose tan was starting to curdle, wearing a chest-baring open shirt. He looked sweaty, and a little mean.\\n\\n “No,” she said, before he opened his mouth. “Just go. Don’t waste your time.”\\n\\n He grinned, all teeth. The gold chain around his neck shot bright reflections at her eyes. “No, pretty lady, you are definitely coming home with me.”\\n\\n And the oddest thing happened. Bryn blinked and said, “Okay,” although that wasn’t at all what she was thinking or feeling. “Okay”? What the hell was that? “No,” she said, quickly. “No, I don’t think so.”\\n\\n “Well, which is it? Okay, or no?”\\n\\n “No. Ugh.”\\n\\n “Let’s try this again.” The man leaned over the table, looming over her, and fixed her with a stare. “You. Are coming. Home. With me.”\\n\\n And again, Bryn immediately and uncontrollably said, “Okay,” and this time—this time …\\n\\n This time she reached for her purse.\\n\\n No, she thought in utter disbelief. I’m not doing this. I can’t be doing this. What the fuck?\\n\\n She forced herself to stop, and looked at the man with furious intensity. “What are you doing to me?” she demanded.\\n\\n He said, “All right, enough screwing around. Condition Sapphire. Verify.”\\n\\n “Yes,” she said, although she had no idea why. “Verified.”\\n\\n “Stand up and take your purse.”\\n\\n She obeyed immediately, and the man took her elbow and guided her through the crowd. Her body was on autopilot, and her brain was shrieking, but there was nothing, absolutely nothing, she could do to fight it. She passed laughing people, bright eyed and chattering, and wanted to scream, Help me, God, please, but nothing came out.\\n\\n Something in my drink, she thought frantically. But what kind of date-rape drug did this? She didn’t feel drunk, or sick, or woozy—she was just out of control.\\n\\n The bouncer eyed her oddly as they left the club, and she wondered what he saw in her face. A terrified, desperate woman? Someone who needed help? Or just another sad hookup?\\n\\n The man put his hand at the small of her back and steered her away from the bouncer, from the lights, from people, from safety, and her feet obediently made the steps. “You have no idea what’s happening to you, do you?” he asked, and moved his hand up to stroke the sweating nape of her neck. Disgustingly intimate. “Oh, sweetheart, you’ve got so much to learn. They didn’t tell you, did they? Didn’t warn you? Typical corporate bullshit. Come on; walk faster. Don’t speak.”\\n\\n She couldn’t have, even if she’d wanted to. It was as if she’d become a puppet, completely under his control, and it made her want to vomit. Something was going on far bigger than she could understand, but she clung to one, burning thought: Typical corporate bullshit.\\n\\n Patrick McCallister must have known about this, whatever it was. And hadn’t told her.\\n\\n The man fished in his pocket and came up with a set of car keys. He pointed the remote at a row of cars ahead, and one beeped and flashed lights. “Now, you’re going to get in the car and be a good girl,” he said. “Say you understand.”\\n\\n “I understand.”\\n\\n “Oh, and before I forget, give me the drive that McCallister handed over.”\\n\\n Bryn’s fingers moved quickly and precisely to the zippered pocket in her purse, retrieved the storage device, and handed it over. He slid it into his shirt pocket and opened the passenger side of the car. “In,” he said. He wasn’t trying to sound charming anymore. He just sounded impatient.\\n\\n Bryn’s body, oblivious to the consequences that were bound to be coming, complied, and she settled into the soft leather interior. He was a smoker, and the cabin reeked of it; the metallic, burned taste filled her mouth as completely as if she’d licked the ashes off the floor. She felt wetness on her cheeks. She was crying. Some part of her body, at least, was still operating outside of his control—not that it would help her in the least.\\n\\n As the man started to shut her door, she heard a sound from outside. It wasn’t loud, but it was a crisp, metallic snap, followed by a solid, meaty thud.\\n\\n Her door swung open again as the man stumbled, cried out, and turned.\\n\\n Patrick McCallister stepped out of the shadows, face pale and very tight. He had always been so self-contained, but now, Bryn saw something blazing in him, something so full of rage that it scared her.\\n\\n He had a riot baton in his hand. That had been the metallic snap she’d heard—the baton extending. The thud was pretty obvious, as the man who’d been abducting her yelled, “You fucker, you broke my ribs!”\\n\\n McCallister didn’t bother to say anything to that. He stepped forward, swung the baton again, with precision, and put the man down on the pavement. There was some groaning and twitching, but the fight was over, and as the man slipped into unconsciousness and his blood trickled out onto the concrete, McCallister moved around him to crouch down next to Bryn, still in the car.\\n\\n “Bryn, can you get out?”\\n\\n She tried. Tried desperately. “No,” she whispered, and felt the tears overflow again. “I can’t.”\\n\\n He didn’t seem surprised. “Cancel Sapphire,” he said, and she fell forward with a surprised cry, almost smacking herself into the dashboard. She’d been fighting so fiercely for control of her muscles that when she regained it, they tensed with crippling force. Bryn sucked in deep, whooping breaths, shuddering, gagging on the stale taste of cigarettes until McCallister reached in and helped her step out and over the fallen man. He was still holding the baton, and when she looked at it, he snapped it back to its original collapsed length.\\n\\n “What the hell?” she managed to gasp out. Her whole body felt violated, even though she’d hardly been touched. She yanked free of McCallister’s hand and put a lot of empty space between them.\\n\\n Then she reached to her shoulder holster and pulled the weapon that still nestled there. She hadn’t bothered to take it off for the club because they’d just been going for a quick drink; now the weight of it in her hand felt like salvation.\\n\\n She aimed it first at the man unconscious on the street, but he wasn’t a threat, so she focused the muzzle squarely on McCallister’s chest. Her pulse was pounding so hard it was giving her a headache, and she still wanted to throw up, though her nausea was starting to subside with the clean taste of the outside air. “What the hell?” This time, beyond her control again, it came out in a raw scream.\\n\\n McCallister slowly put his hands up. “Easy, Bryn. Easy.”\\n\\n “Fuck easy, you son of a bitch. What just happened to me? What did you put in my drink?” She shot a burning glance at the unconscious guy between them. “Is he one of yours?”\\n\\n “No,” McCallister said. “And I didn’t put anything into your drink. Neither did he.”\\n\\n “Then what the hell just happened to me? What?”\\n\\n McCallister glanced around. The bouncer at the club had walked out into the street and was staring their way, attracted by the raised voices. “We shouldn’t talk about it here,” he said, “and if you keep waving that gun around, we’ll have a lot more problems than we already do. Come on, Bryn; my car is across the street. We need to go before the police arrive. Please.”\\n\\n “And if I don’t want to go with you?”\\n\\n “Then you don’t have to,” he said. “You can choose to put the gun up and walk away. I understand how you feel, Bryn. I won’t tell you what to do.” \\n\\n","sourceLink":"https://allnovel.net/working-stiff-revivalist-1/page-23.html","bookId":2538,"book":{"id":2538,"title":"Working Stiff (Revivalist #1)","description":"Storyline: Working Stiff (Revivalist #1) \\n Bryn Davis knows working at Fairview Mortuary isn\u0027t the most glamorous career choice, but at least it offers stable employment--until she discovers her bosses using a drug that resurrects the clientele as part of an extortion racket. Now, Bryn faces being terminated--literally, and with extreme prejudice. \\n Wit the help of corporate double-agent Patrick McCallister, Bryn has a chance to take down the bigger problem--pharmaceutical company Pharmadene, which treats death as the ultimate corporate loyalty program. She\u0027d better do it fast, before she becomes a zombie slave--a real working stiff. She\u0027d be better off dead...\\n","cover":"https://allnovel.net/images/working-stiff-revivalist-1.jpg","author":"Rachel Caine","type":"Horror","source":"allnovel","link":"https://allnovel.net/working-stiff-revivalist-1.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 5, 2019 11:51:32 PM"}}
