{"id":110206,"no":7,"title":"Page 7","content":"“Had,” he said, and tilted his head slightly, still watching her. “How the hell old are you, anyway?”\\n\\n “Twenty-six.”\\n\\n “Damn. You ought to be an actress; you could do those teen shows. You look sixteen.”\\n\\n Bryn ground her teeth and said nothing. She was so tired of people assuming she was high school age. She supposed when she was forty, she’d be grateful for the baby face, but up to now it had been a total pain in the ass.\\n\\n Probably not the most important thing on the radar at the moment, from a macro point of view.\\n\\n “Anyway,” Fideli said, “I’m just here to do some reconnaissance. You know what that means?”\\n\\n He clearly didn’t know her past. “Check out the lay of the land.”\\n\\n “Ding. I wasn’t planning on running into anybody. Where’s your car?”\\n\\n “I don’t have one. I ride the bus.”\\n\\n “No shit. Is that one of those save-the-planet things, or I’m-too-poor-to-afford-it things?”\\n\\n “Both. Mostly the latter, honestly.” Sadly.\\n\\n “Well, good for you, I guess. Bad for me, though. Tougher for me to get you out of here.” Fideli fell silent, staring at her.\\n\\n She felt compelled to say something. “What do you want? We don’t have a lot here that’s worth taking, if that’s what this is about. I mean, the furniture, maybe, but—”\\n\\n “I’m not a thief.”\\n\\n “Well, there’s not a load of opportunity for industrial espionage in this business,” she said. It was a joke, but he didn’t smile. His eyes certainly didn’t. “What did you want in the prep room?” Preparation, Bryn remembered, too late. Fairview always wanted to be formal about it with the customers. Not that Mr. Fideli was shaping up to be a customer, after all.\\n\\n “I’m supposed to find out if Mr. Fairview and Fast Freddy are running drugs,” he said. “Prescription drugs. Stolen.”\\n\\n “What? Of course not!”\\n\\n “No offense, but you’re what, a day into this job? How would you know?”\\n\\n “This is a successful business. Why would they do something so stupid?” Then again, she’d met Freddy. And she wouldn’t put anything past him. “Unless—maybe it’s not Mr. Fairview? Just Freddy?”\\n\\n Fideli’s head came back upright, and there was a new tension in his body. “You know something about the guy?”\\n\\n “Not that much. Just … he’s a creep. You know the type.”\\n\\n “Explain it to me.”\\n\\n “He came on to me. Downstairs.”\\n\\n “Romantic.”\\n\\n “Exactly.” She cleared her throat. “Look, I’m not Wonder Woman—do you think you could put the gun down?”\\n\\n “What?” He seemed genuinely surprised, and then smiled. “Yeah. I already went through the drawers of your desk. Just in case you had a thirty-eight-caliber surprise in there. So I guess you’re safe enough.”\\n\\n She was startled. “When did you do that?”\\n\\n “While you were downstairs.” His gaze shifted, and the easy friendliness disappeared instantly. “Hold up. Don’t move.” She didn’t. He got up and went to the window, looking without moving the blinds. “You know of any reason why your boss and Freddy would come back here after hours tonight?”\\n\\n “No.”\\n\\n “Well, they’re parking cars right now.” Fideli backed up next to her, and the gun made an unpleasant reappearance. “Not a word, Miss Davis.”\\n\\n “You’re not going to kill me are you?”\\n\\n “Why would I do that?”\\n\\n “Because you’re the one with the gun?”\\n\\n He looked at it. “This old thing? Family heirloom. I hardly ever shoot anybody with it.” He was lying, but he was doing it with style and a sense of humor, and whether she wanted to or not, she felt a little bit better about being held hostage. “You’ll be quiet?”\\n\\n “Absolutely.”\\n\\n He sent her a sassy wink, which wasn’t nearly as creepy as when Fast Freddy did it. “Good girl.”\\n\\n Fideli moved to the closed door and listened with great concentration—but still keeping an eye on her; she was sure about that. Bryn didn’t move. Straining her ears, she heard the front door opening and the door chime faintly making the announcement. Then nothing. Soundproofing worked in bad ways, too.\\n\\n Fideli, however, had heard something she hadn’t. “They’re heading downstairs,” he said. “Okay, let’s get you out of here, miss.”\\n\\n “Excuse me?”\\n\\n “No place for bystanders right now. Up and out.”\\n\\n Not that waiting in the dark for the bus was going to be her favorite thing, either. “Can’t I just wait here? You know, until you‘re, ah, done?” Whatever that might mean.\\n\\n “No,” he said. “Get your stuff, Bryn.”\\n\\n The kinder Joe Fideli was gone again, replaced by one highly mission-focused. She got her purse and coat and followed him as he cat-footed it down the hall to the lobby door.\\n\\n She grabbed his arm. “The bell!” she whispered. “They’ll hear it!”\\n\\n “You’ve got reason to be here, and reason to be leaving,” he whispered back. “Play it cool, whatever they do. Just pretend like everything’s normal, and leave. Go catch your bus.”\\n\\n Then he opened the door, the bell dinged, and he disappeared into the shadows, moving so fast that Bryn was left standing there, openmouthed, with the door swinging back shut against her outstretched hand.\\n\\n Nowhere to go but out.\\n\\n Bryn didn’t get far. She was less than ten feet from the door when she heard the muffled chime of the bell again, and looked over her shoulder to see Mr. Fairview standing there.\\n\\n “Bryn,” he said, still using that soothing working-hours voice. “Well. This is a surprise. We thought you’d already left, especially after the day you’ve had.”\\n\\n “I got caught up in reading over the materials. There’re a lot of things to learn. I’m sorry if I broke any rules…. I’m not putting in for overtime, I promise.”\\n\\n She felt nervous, and she knew he could see it—but hopefully, he’d put it down to the natural uneasiness of a new employee caught doing something slightly odd, and God, how had she gotten herself into this, anyway? Working with the dead was supposed to be peaceful. That was the whole point.\\n\\n The silence seemed to stretch on. Bryn felt sweat break out under her arms. She had a choice to make—tell Fairview about Joe Fideli’s quiet infiltration, or stay quiet and risk being wrong about him. He’s a man with a gun, skulking around at night. You should tell Fairview.\\n\\n And she would have … except that he said, “Did you go into the preparation room after Mr. Watson left tonight, Bryn?”\\n\\n “Why?”\\n\\n “We have a silent alarm that operates when we’re off premises. To prevent any, ah, tampering with the bodies. I’ve turned it off now, since we’re here.” Fairview’s eyes were in shadow, his face rendered into a blank mask by the lighting in the parking lot. There was nothing in his voice, either, but Bryn’s instincts screamed that there was something wrong. Very wrong.\\n\\n “I realized that Freddy left Mr. Granberry out on the table,” she said. “I just went in to put him in the freezer. I hope I didn’t do anything wrong. I do have the keys. Nobody told me the area was off-limits.”\\n\\n “Oh, it’s not—not normally, of course. I was just concerned, based on the alarm.” Fairview smiled. “Why don’t you come on back inside, my dear? It’s chilly out here at night, and the fog’s coming in.”\\n\\n He was right; she was shivering, and the gray mist had rolled over the coast and faded out the lights of the town in the distance. Even the bus-stop lights seemed smeared and indistinct.\\n\\n “I need to get home,” she said. “The last bus is on the way any moment.”\\n\\n “Oh, no need to worry about that,” Fairview said. “I’ll drive you home, Bryn. But come back inside; have some coffee. I have something I need to discuss with you first.”\\n\\n She swallowed. The night felt dark, deep, and icily empty; she was fifty feet from the bus stop, but the shelter was empty at this hour, and although there were cars going by on the road, they weren’t going to notice anything happening here. Running seemed stupid. At best, it would let him know she suspected something was going on inside; at worst, at least Joe Fideli was somewhere nearby, with his gun.\\n\\n She wasn’t sure why, but she felt that she trusted Fideli more than the man who’d hired her. The man she’d admired so much for his compassion and composure just this morning. Standing here in the chilly dark, watching his face, she thought he might be more of a killer than the guy with the gun.\\n\\n The thought of lying cold on one of those trays robbed her of the will to run—not that there was anywhere to go; the bus wasn’t even in view. She stayed where she was as Mr. Fairview descended the steps and came toward her. He took her arm and escorted her back into the mortuary.\\n\\n “Nothing to worry about,” he said, still using that soothing professional tone. “I just want to explain about some of our procedures, Bryn. You’re in no trouble, I promise. If you’d wait in your office for a bit, I have to meet with someone else first. I’ll come right up, and after we’ve talked I’ll give you a ride home. I hate making you wait out there in the dark. It’s just not safe.”\\n\\n “Okay,” she said. This was a really bad idea, but she couldn’t think of anything else to do except go along with him. Mr. Fairview hustled her, quietly and irresistibly, back into the mortuary and down the hall to her office. She fumbled with the keys and opened it, and Mr. Fairview gave her a reassuring smile.\\n\\n “Just a few minutes,” he assured her, and closed the door. She listened, but couldn’t hear a thing … and then she heard his footsteps on the stairs leading down to the basement.\\n\\n I really need to get out of here. Whatever the hell was going on, it wasn’t her business. Not at all. In fact, Bryn decided then and there that she was officially quitting. She could get another job, and she could get it at some big-city mortuary where there were lots of people coming and going. \\n\\n","sourceLink":"https://allnovel.net/working-stiff-revivalist-1/page-7.html","bookId":2538,"book":{"id":2538,"title":"Working Stiff (Revivalist #1)","description":"Storyline: Working Stiff (Revivalist #1) \\n Bryn Davis knows working at Fairview Mortuary isn\u0027t the most glamorous career choice, but at least it offers stable employment--until she discovers her bosses using a drug that resurrects the clientele as part of an extortion racket. Now, Bryn faces being terminated--literally, and with extreme prejudice. \\n Wit the help of corporate double-agent Patrick McCallister, Bryn has a chance to take down the bigger problem--pharmaceutical company Pharmadene, which treats death as the ultimate corporate loyalty program. She\u0027d better do it fast, before she becomes a zombie slave--a real working stiff. She\u0027d be better off dead...\\n","cover":"https://allnovel.net/images/working-stiff-revivalist-1.jpg","author":"Rachel Caine","type":"Horror","source":"allnovel","link":"https://allnovel.net/working-stiff-revivalist-1.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 5, 2019 11:51:32 PM"}}
