{"id":11665,"no":18,"title":"CHAPTER XVIII. CIRCUMSTANTIAL EVIDENCE.","content":"When Naball left the two young men, he went straight to the Detective Office in order to get some one to look after Keith Stewart, and see that he did not leave Melbourne. Naball did not believe that he was going to meet any one that night, and wanted to find out why he was going to the station. \\n\\n \\n\\n \"If he wanted to give me the slip,\" he thought, \"he wouldn\u0027t have told me he was going to the railway station--humph! can\u0027t make out what he\u0027s up to.\" \\n\\n \\n\\n The gentleman who was to act as Mr. Stewart\u0027s shadow was a short, red-nosed man with a humbled appearance and a chronic sniffle. He was sparing of words, and communicated with his fellow-man by a series of nods and winks which did duty with him for conversation. \\n\\n \\n\\n \"Tulch!\" said Naball, when this extraordinary being appeared, \"I want you to go to Vance\u0027s boarding-house, Powlett Street, East Melbourne, and keep your eye on a man called Keith Stewart.\" \\n\\n \\n\\n An interrogatory sniff from Tulch. \\n\\n \\n\\n \"Ah, I forgot you don\u0027t know his personal appearance,\" said Naball thoughtfully; \"he\u0027s tall, with fair hair, wears a suit of home-spun--humph;--that won\u0027t do, there are dozens of young men of that description. Here!--tell you what, I\u0027ll give you a note to deliver to him personally; muffle yourself up in an ulster when you deliver it, so that he won\u0027t know you--understand?\" \\n\\n \\n\\n Mr. Tulch sniffed in the affirmative. \\n\\n \\n\\n \"Follow him wherever he goes, and tell me what he\u0027s up to,\" said Naball, scribbling a note to Stewart and handing it to Tulch. \"That\u0027s all--clear out.\" \\n\\n \\n\\n A farewell sniffle, and Tulch was gone. \\n\\n \\n\\n \"Humph,\" muttered Naball to himself, \"now I\u0027d like to know the meaning of all this--I don\u0027t believe this cock-and-bull story about Stewart having money left him in this mysterious manner--people don\u0027t do that sort of thing now-a-days--I believe he\u0027s been robbing the old man for some time and was found out--so silenced him by using his knife. Knife,\" repeated Naball, \"that\u0027s not been found yet--I must see about this--now there\u0027s Villiers--I wonder if he could help me? It was curious that he should have been about the shop at that special time--he\u0027s a bad lot--gad, I\u0027ll go and see what I can find out from him.\" \\n\\n \\n\\n Knowing Mr. Villiers\u0027 habits, he had no difficulty in discovering his whereabouts. Ah Goon\u0027s was where Villiers generally dwelt, so, after Naball had partaken of a nice little dinner, he went off to Little Bourke Street. \\n\\n \\n\\n It was now between seven and eight o\u0027clock, which was the time Villiers generally dined, so, Naball not finding him at Ah Goon\u0027s, betook himself to a cook-shop in the neighbourhood, to which he was directed by a solid-looking Chinaman. \\n\\n \\n\\n It was a low-roofed place, consisting of a series of apartments all opening one into the other by squat little door-ways. The atmosphere was dull and smoky, and the acrid smell of burning wood saluted Naball\u0027s nostrils when he entered. Near the door-way a Chinaman was rolling out rice bread to the thinness of paper; then, cutting it into little squares, he wrapped each round a kind of sausage meat, and placed the rolls thus prepared on a tray for cooking. \\n\\n \\n\\n In the next apartment was a large boiler, with the lid off, filled with water, in which ten or twelve turkeys, skewered and trussed, were bobbing up and down amid the froth and scum of the boiling water. A crowd of Chinese, all chattering in their high shrill voices, were moving about half seen in the smoky atmosphere, through which candle and lamp light flamed feebly. \\n\\n \\n\\n Villiers, in a kind of little cell apartment, was having his supper when the detective entered. Before him was a large bowl filled with soup, and in this were squares of thin rice bread, and portions of turkey and duck mixed up into a savoury mess, and flavoured with the dark brown fluid which the Chinese use instead of salt. \\n\\n \\n\\n \"Oh, it\u0027s you,\" growled Villiers, looking up with a scowl, \"what do you want?\" \\n\\n \\n\\n \"You, my friend,\" said Naball cheerfully, taking a seat. \\n\\n \\n\\n \"Oh, do you?\" said Villiers, rubbing his bleared eyes, inflamed by the pungent smoke of the wood-fire. \"I s\u0027pose you think I killed old Lazarus?\" \\n\\n \\n\\n \"No, I don\u0027t,\" retorted the detective, looking straight at him, \"but I think you know more than you tell.\" \\n\\n \\n\\n \"He! he!\" grinned the other sardonically. \"Perhaps I do--perhaps I don\u0027t--it\u0027s my business.\" \\n\\n \\n\\n \"And mine also,\" said Naball, somewhat nettled. \"You forget the case is in my hands.\" \\n\\n \\n\\n \"Don\u0027t care whose hands it\u0027s in,\" retorted Villiers, finishing his soup, \"t\u0027aint any trouble of mine.\" \\n\\n \\n\\n The detective bit his lip at the impenetrable way in which Villiers met his advances. Suddenly a thought flashed across his mind, and he bent forward with a meaning smile. \\n\\n \\n\\n \"Got any more diamonds?\" \\n\\n \\n\\n Villiers pushed back his chair from the table, and stared at Naball. \\n\\n \\n\\n \"What diamonds?\" he asked, in a husky voice. \\n\\n \\n\\n \"Come now,\" said Naball, with a wink, \"we know all about that--eh? Ah Goon is a good pawnbroker, isn\u0027t he?\" \\n\\n \\n\\n \"Ah Goon!\" gasped Villiers, turning a little pale. \\n\\n \\n\\n \"Yes; though he did only lend twenty pounds on those diamonds.\" \\n\\n \\n\\n \"Look here, Mr. Jack-o\u0027-Dandy,\" said Villiers, bringing his fist down on the table, \"I don\u0027t want no beating about the bush, I don\u0027t. What do you mean, curse you?\" \\n\\n \\n\\n \"I mean that I know all about your little games,\" replied Naball, leaning over the table. \\n\\n \\n\\n \"I know Caprice stole her own jewels for some purpose, and gave you some of the swag to shut your mouth, and I know that you\u0027re going to tell me all you know about this Russell Street business, or, by Jove, I\u0027ll have you arrested on suspicion.\" \\n\\n \\n\\n Villiers gave a howl like a wild beast, and, flinging himself across the table, tried to grapple with the detective, but recoiled with a shriek of wrath and alarm as he saw the shining barrel of a revolver levelled at his head. \\n\\n \\n\\n \"Won\u0027t do, Villiers,\" said Naball smoothly; \"try some other game.\" \\n\\n \\n\\n Whereupon Villiers, seeing that the detective was too strong for him, sat down sulkily in his chair, and after invoking a blessing on Naball\u0027s eyes, invited him to speak out. The detective replaced the revolver in his pocket, whence it could be easily seized if necessary, and smiled complacently at his sullen-faced friend. \\n\\n \\n\\n \"Aha!\" he said, producing a dainty cigarette, \"this is much better. Have you a light?\" \\n\\n \\n\\n Villiers flung down a lucifer match with a husky curse, which Naball, quite disregarding, took up the match and lighted his cigarette. Watching the blue smoke curling from his lips for a few moments, he turned languidly to Villiers, and began to talk. \\n\\n \\n\\n \"You see, I know all about it,\" he said quietly; \"you were too drunk to remember that night when you tried to take a diamond crescent off that woman, and I expect Ah Goon never told you!\" \\n\\n \\n\\n \"It was you who took it, then,\" growled Villiers fiercely. \\n\\n \\n\\n \"In your own words, perhaps it was, perhaps it wasn\u0027t,\" replied Naball, in an irritating tone; \"at all events, it\u0027s quite safe. You had better answer all my questions, because you bear too bad a character not to be suspected of the crime, particularly as you were about Russell Street on that night.\" \\n\\n \\n\\n \"Yes, I was,\" said Villiers angrily; \"and who saw me--Keith Stewart--a mighty fine witness he is.\" \\n\\n \\n\\n \"Aha!\" thought the astute Naball, \"he does know something, then.\" \\n\\n \\n\\n \"I could put a spoke in Stewart\u0027s wheel,\" grumbled the other viciously. \\n\\n \\n\\n \"I don\u0027t think so,\" replied the detective, fingering his cigarette, \"he is far above you--he\u0027s got money, is going to make a name by a successful play, and, if report speaks truly, Caprice loves him. \\n\\n \\n\\n \"I don\u0027t care a farthing whether she does or not,\" said Villiers loudly; \"she\u0027d love any one who has money. Stewart\u0027s got some, has he; where did he get it?\" \\n\\n \\n\\n \"I\u0027m sure I don\u0027t know.\" \\n\\n \\n\\n \"I do!\" \\n\\n \\n\\n \"Indeed! where?\" \\n\\n \\n\\n \"Never you mind,\" said Villiers suspiciously. \"I know my own knowing.\" \\n\\n \\n\\n \"Remember what I said,\" observed Naball quietly, \"and tell me all.\" \\n\\n \\n\\n \"If I tell you all, what will you do?\" asked Villiers. \\n\\n \\n\\n \"I\u0027ll save your neck from the gallows,\" replied Naball smoothly. \\n\\n \\n\\n \"Not good enough.\" \\n\\n \\n\\n \"Oh, very well,\" said the detective rising, \"I\u0027ve no more to say. I\u0027m off to the magistrate.\" \\n\\n \\n\\n \"What for?\" \\n\\n \\n\\n Naball fixed his keen eyes on the bloated face of the other. \\n\\n \\n\\n \"To get a warrant for your arrest.\" \\n\\n \\n\\n \"You can\u0027t do that.\" \\n\\n \\n\\n \"Can\u0027t I--you\u0027ll see.\" \\n\\n \\n\\n \"No; wait a bit,\" said Villiers in alarm; \"I can easily prove myself innocent.\" \\n\\n \\n\\n \"Indeed; then you\u0027d better do so now, before a warrant is out for your arrest.\" \\n\\n \\n\\n \"You won\u0027t give me any money?\" \\n\\n \\n\\n \"Not a cent--it\u0027s not a question of money with you, but life or death.\" \\n\\n \\n\\n Villiers deliberated for a moment, and then apparently made up his mind. \\n\\n \\n\\n \"Sit down,\" he said sullenly. \"I\u0027ll tell you all I know.\" \\n\\n \\n\\n Naball resumed his seat, lighted a fresh cigarette, and prepared to listen. \\n\\n \\n\\n \"I was rather drunk on the night of the murder,\" he said, \"but not so bad as Stewart thought me. He saw me at the shop-door at two o\u0027clock, but I was there a quarter of an hour before.\" \\n\\n \\n\\n \"Did you see anything?\" \\n\\n \\n\\n \"I saw the gate which led into the alley open,\" replied Villiers. \"No one was about, so I walked in.\" \\n\\n \\n\\n \"What for?\" asked Naball, glancing at him keenly. \\n\\n \\n\\n \"Oh, nothing,\" replied Villiers indifferently; \"the fact was, I saw a policeman coming along, and though I was pretty drunk, I\u0027d sense enough to know I might be run in, so I went into the alley and closed the gate till he passed.\" \\n\\n \\n\\n \"And then you came out.\" \\n\\n \\n\\n \"No, I didn\u0027t. I walked to the back of the house just to see where it led to. I saw the window wide open, and looked in and saw--\" \\n\\n \\n\\n \"The murdered man?\" \\n\\n \\n\\n Villiers nodded. \\n\\n \\n\\n \"Yes; the moonlight was streaming in at the window, and I could see quite plainly. I was in a fright, as I thought, seeing I had no business on the premises, I might be accused, so I got down from the window and went off, closing the gate of the alley after me.\" \\n\\n \\n\\n \"It wasn\u0027t wise of you to stay about the premises,\" said Naball. \\n\\n \\n\\n \"I know that,\" rejoined Villiers tartly; \"but I couldn\u0027t get away, because I saw Stewart coming up the street just as I was wondering where to go; I then pretended to be drunk, so that I could get away without suspicion.\" \\n\\n \\n\\n \"Why didn\u0027t you run?\" asked Naball. \\n\\n \\n\\n \"Because he was too close, and besides, he might have given chase, thinking I had been robbing the shop; then, with the open window and the murdered man, it would have been all up with me.\" \\n\\n \\n\\n \"I don\u0027t know if it isn\u0027t all up with you now,\" said Naball drily. \"How do I know you are innocent!\" \\n\\n \\n\\n \"Because I know who killed Lazarus.\" \\n\\n \\n\\n \"The deuce you do--who?\" \\n\\n \\n\\n \"Stewart himself.\" \\n\\n \\n\\n \"Humph! that\u0027s what I thought; but what proof have you?\" \\n\\n \\n\\n Villiers put his hand in his pocket and brought out a large knife. \\n\\n \\n\\n \"I found this just under the window,\" he said, handing it to Naball. \"You\u0027ll see there\u0027s blood on the handle, so I\u0027m sure it was with it the crime was committed.\" \\n\\n \\n\\n \"But how do you know it\u0027s Stewart\u0027s knife?\" asked Naball. \\n\\n \\n\\n Villiers placed his finger on one side of the handle. \\n\\n \\n\\n \"Read that,\" he said briefly. \\n\\n \\n\\n \"From Meg,\" read Naball. \\n\\n \\n\\n \"Exactly,\" said Villiers. \"Meg is Kitty Marchurst\u0027s child, and she gave it to Keith Stewart.\" \\n\\n \\n\\n \"By Jove, it looks suspicious,\" said Naball. \"He is in possession of a large sum of money, and can\u0027t tell how he got it. He can\u0027t account for his time on the night of the murder, and this knife with his name on it is found close to the window through which the murderer entered--humph!--things look black against him.\" \\n\\n \\n\\n \"I suppose you\u0027ll arrest him at once?\" said Villiers malignantly. \\n\\n \\n\\n \"Then you suppose wrong,\" retorted Naball. \"I\u0027ll have him looked after so that he won\u0027t escape; but I\u0027ll hold my tongue about this, and so will you.\" \\n\\n \\n\\n \"Until when?\" \\n\\n \\n\\n \"Until I find out more about Stewart. I must discover if the knife was in his possession on the night of the murder, and also if this story about his money is true; again, I want to wait till some of these stolen bank notes are in circulation, so as to get more evidence against him.\" \\n\\n \\n\\n \"But what am I to do?\" asked Villiers sulkily. \\n\\n \\n\\n \"You are to hold your tongue,\" said Naball, rising to his feet, \"or else I may make things unpleasant for you--it\u0027s a good thing for your own sake you have told me all.\" \\n\\n \\n\\n \"Told you all,\" muttered Villiers, as Naball took his departure. \"I\u0027m not so sure about that.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1861/53897.html","bookId":829,"book":{"id":829,"title":"Miss Mephistopheles","description":"简介： A wet Sunday--dreary, dismal, and infinitely sloppy. Even the bells ringing the people into evening service seemed to feel the depressing influence of the weather, and their brazen voices sounded hoarse and grumbling, as if they rang under protest. C...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1861","creation":"Aug 1, 2019 12:19:37 AM","modification":"Aug 1, 2019 12:19:37 AM"}}
