{"id":11670,"no":23,"title":"CHAPTER XXIII. THE CYPHER.","content":"When the messenger had been despatched, Naball drew his seat up to the table, and began to make some notes, after which he turned to Eugénie. \n \n \"I was firmly convinced of Stewart\u0027s guilt,\" he said quietly; \"but what you have told me throws a new light on the subject. I said you could not do that--I beg your pardon--you can.\" \n \n Eugénie bowed her head in acknowledgment of the apology, and asked him a question in a hesitating manner. \n \n \"You don\u0027t think Caprice is guilty?\" \n \n \"I think nothing at present,\" he replied evasively; \"not even that Stewart is innocent. When I see the boy, I\u0027ll tell you what I think.\" \n \n They talked on together for a few minutes, and then there came a knock at the door. In reply to Ezra\u0027s permission to enter, the door opened, and Isaiah appeared on the threshold, holding some papers in his hand. \n \n \"Oh, you\u0027ve come,\" said Ezra, as the boy shut the door after him. \n \n \"Yes; did you want me?\" demanded Isaiah in a jerky manner, \"\u0027cos I never knowed you did.\" \n \n \"Didn\u0027t you meet a messenger?\" asked Naball, turning his head round. \n \n Isaiah deposited the papers he carried on Ezra\u0027s desk, and shook his head. \n \n \"No, I never met any one, I didn\u0027t,\" he answered. \"Mr. Ezra asked me to bring all letters that came to the old \u0027un, so as these came, I did.\" \n \n \"That\u0027s right,\" said Lazarus, looking through the letters. \"By-the-way, Isaiah, this gentleman wants to ask you a few questions.\" \n \n \"What, Mr. Naball?\" said Isaiah in alarm. \"Oh, sir, I never had nothing to do with it.\" \n \n Naball smiled. \n \n \"No! no! that\u0027s all right,\" he said good-naturedly. \"It would take a bigger man than a sprat like you to commit such a crime; but, tell me, do you know Caprice?\" \n \n Isaiah leered significantly. \n \n \"I\u0027ve seen her on the stage, that\u0027s all.\" \n \n \"Never off?\" \n \n \"Drivin\u0027 about the streets.\" \n \n \"Anywhere else?\" \n \n Isaiah glanced uneasily at Ezra, who laughed. \n \n \"Go on, Isaiah; it\u0027s all right.\" \n \n \"Well, I\u0027ve seen her at the old \u0027un\u0027s place.\" \n \n \"Oh, indeed,\" said Naball quickly. \"Often?\" \n \n \"Yes--lots of times--at night--came to do business, I s\u0027pose.\" \n \n \"When did you see her last?\" \n \n \"Oh, not for a long time,\" replied Isaiah; \"but do you remember the week them diamonds were stolen?\" \n \n \"Yes, yes,\" said Naball eagerly. \n \n Isaiah nodded. \n \n \"Well, she came to see the old \u0027un, then.\" \n \n Naball suppressed his exultation with difficulty, and asked Isaiah another question. \n \n \"I say--those bank-notes that were stolen--\" \n \n \"I never stole \u0027em.\" \n \n \"No one said you did,\" retorted Naball tartly; \"but you wrote something on the back of one of \u0027em.\" \n \n Isaiah turned scarlet, and shifted from one leg to the other. \n \n \"Well, you see,\" he murmured apologetically, \"Mr. Stewart wanted to know a good \u0027un to back for the Cup, so I was afraid of the old \u0027un hearing, and as there wasn\u0027t no paper, I wrote on the back of one of \u0027em, \u0027Back Flat-Iron.\u0027\" \n \n \"In pencil?\" \n \n \"No, in ink. Mr. Stewart, he laughs and nods, then puts the notes in the cash box, and puts \u0027em in the safe.\" \n \n \"That\u0027s all right,\" said Naball, dismissing him; \"you can go.\" \n \n Isaiah put on his hat, put his hands in his pockets, and departed, whistling a tune. When the door closed on him, Naball turned to his two companions with an exulting light in his eyes. \n \n \"What do you think now, Mr. Naball?\" asked Eugénie. \n \n \"Think. I think as I\u0027ve done all along,\" he replied. \"Caprice stole those jewels herself, and sold them to old Lazarus.\" \n \n \"But what\u0027s that got to do with the death of my father?\" asked Ezra. \n \n \"Perhaps nothing--perhaps a lot,\" said the detective. \"I don\u0027t know but that boy\u0027s evidence has given me a clue. Suppose--I\u0027m only supposing, mind you--Caprice stole her own diamonds, with Villiers as an accomplice. Suppose she took them to old Lazarus and sold \u0027em. Suppose Villiers, thinking the old man has them in his safe, goes to rob him, and commits the murder to do so. Suppose all that--I should think there would be a very pretty case against Villiers.\" \n \n \"Yes; but Keith\u0027s knife?\" said Eugénie. \n \n \"Ah, now you have me,\" answered Naball, puzzled. \"I don\u0027t know, unless Villiers managed to get it while Stewart was fighting with him on that night, and covered it in blood in order to throw suspicion on him.\" \n \n \"All your ideas are theoretical,\" said Ezra drily. \"Perhaps Caprice never stole her own jewels, or sold them to my father.\" \n \n \"Yes, she did, I\u0027ll swear,\" retorted Naball decisively. \"Why wouldn\u0027t she prosecute? why did I find Villiers with one of the jewels? You bet, she stole them for some freak, and I daresay Villiers committed the murder to get them back.\" \n \n \"I don\u0027t think my father would have kept such valuable jewels as that about the premises.\" \n \n \"No; he\u0027d put \u0027em in the bank.\" \n \n \"No, he wouldn\u0027t,\" retorted Ezra; \"he sent all his jewels to Amsterdam. And here,\" holding up a letter, \"is an envelope with the Dutch postmark.\" \n \n \"By Jove!\" ejaculated Naball, under his breath, \"what a queer thing if it should turn out to be those diamonds of Caprice\u0027s. Open the letter.\" \n \n \"Suppose it does turn out to be the diamonds,\" said Ezra, slowly tearing the envelope. \n \n \"Well\"--Naball drew a long breath--\"it will be the beginning of the end.\" \n \n \"I hope it will end in Keith\u0027s being released,\" said Eugénie, looking at Ezra with intense anxiety. \n \n That gentleman took out the letter, and glancing at it for a moment, gave vent to an ejaculation of disgust. \n \n \"What\u0027s the matter?\" asked Eugénie and Naball together. \n \n \"The letter is in cypher,\" said Lazarus, tossing it over to the detective. \"I don\u0027t think we\u0027ll be able to read it.\" \n \n \"Oh, we\u0027ll have a try,\" said Naball, quickly spreading oat the letter. \"Let\u0027s have a look at it.\" \n \n The letter was as follows:-- \n \n \"Dsidanmo seaf utnes teh ssteon ryiks sgenlil gto teher tdhnoaus sgennid it lses teher hduenrd bneiertns.\" \n \n \"What the deuce does it mean?\" asked Naball in a puzzled tone. \n \n \"It\u0027s a cypher, evidently, of which my father alone possesses the key,\" said Ezra. \"I\u0027ll have a look among his papers, and if I find it, it will soon make sense of this jumble of words.\" \n \n \"It\u0027s like a Chinese puzzle,\" observed Naball, glancing at it. \"I never could find out these things.\" \n \n \"Let me look,\" said Eugénie, taking the letter. \"I used to be rather good at puzzles.\" \n \n \"We\u0027ll find this one out,\" said Naball significantly, \"and you\u0027ll do some good for Stewart.\" \n \n \"You think it\u0027s about Caprice\u0027s diamonds?\" she asked. \n \n \"I think it\u0027s about Caprice\u0027s diamonds,\" he replied. \n \n \"I think the words have been written backwards,\" said Ezra, looking over her shoulder. \n \n Eugénie shook her head. \n \n \"I don\u0027t think so,\" she replied, scanning the letter closely. \"If so, the word \u0027it\u0027 would have been written \u0027ti.\u0027\" \n \n \"Try a word of three letters, if there\u0027s one,\" suggested Naball, \"and you can see how the letters are placed.\" \n \n \"Here\u0027s one spelt \u0027g-t-o.\u0027 What word can be made out of that.\" \n \n \"Got,\" said Ezra eagerly. \n \n \"Well, if so, in the cypher it reads, the first letter \u0027g,\u0027 the last, letter \u0027t,\u0027 and the middle letter at the end.\" \n \n \"What do you think of that?\" asked Naball bluntly. \n \n \"That the sender of this has taken the first and last letters of a word, and written them in rotation.\" \n \n \"I don\u0027t understand,\" said Naball in a puzzled tone. \n \n \"I think I do,\" said Eugénie quickly. \"Let us take another word, and instead of guessing it, try my idea, Here is a word, \u0027teher.\u0027 Now, Mr. Naball, take a sheet of paper and write down what I say.\" \n \n Naball got some paper and a pencil. \n \n \"Now,\" said Eugénie, \"this word \u0027teher.\u0027 The first letter is \u0027t,\u0027 now the second letter, which, I think, is the end one of the proper word, is \u0027e\u0027--place that at the end.\" \n \n Naball wrote \"t--e.\" \n \n \"The third letter of the cypher, and the second of the proper word, is \u0027h\u0027--put that next the \u0027t;\u0027 and the fourth letter of the cypher, and third of the proper word, is \u0027e\u0027--place that at the end also.\" \n \n Naball added two letters as instructed, \"t,h--e,e.\" \n \n \"Now,\" said Eugénie, \"there\u0027s only one letter left, which must naturally be in the middle.\" \n \n Naball finished his writing thus: t-h-r-e-e. \n \n \"That is three,\" he said, with a cry of triumph. \"By Jove! Miss Rainsford, you are clever; let\u0027s make certain, by trying another letter.\" \n \n \"Take \u0027s-s-t-e-o-n,\u0027\" suggested Ezra. \n \n Naball wrote the letters as follows:-- \n \n s -- s \n \n t -- e \n \n o -- n \n \n Then he wrote them in a line, down the first column and up the second, which made the word \"stones.\" \n \n \"Glad we\u0027ve got it right, after all,\" he said delightedly, and then the whole three of them went to work on the same system, with the result that the letter read thus:-- \n \n \"Diamonds safe, unset the stones, risky selling, got three thousand, sending it less three hundred, bernstein.\" \n \n \"Ah!\" said Naball when he read this, \"wasn\u0027t I right?\" \n \n \"So I think,\" said Ezra sadly; \"my father evidently bought the jewels from her, and sent them to Amsterdam to be sold.\" \n \n \"Still,\" said Eugénie impatiently, \"this does not clear up the mystery of the murder.\" \n \n \"You don\u0027t think Caprice did it?\" said Ezra. \n \n \"No,\" replied the detective; \"but Villiers might have done it in order to recover the jewels. But I tell you what, there\u0027s only one thing to be done, we\u0027ll go down and see Caprice.\" \n \n This was agreed to, and without losing a moment they started. \n \n \"I may be wrong, as I was before,\" said Naball when they were in the train, \"but I\u0027ll lay any money that Villiers has seen Caprice since the murder.\" \n \n \"You don\u0027t think she\u0027s an accomplice?\" cried Eugénie. \n \n \"I think nothing,\" retorted Naball, \"till I see Caprice.\" \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1861/53902.html","bookId":829,"book":{"id":829,"title":"Miss Mephistopheles","description":"简介： A wet Sunday--dreary, dismal, and infinitely sloppy. Even the bells ringing the people into evening service seemed to feel the depressing influence of the weather, and their brazen voices sounded hoarse and grumbling, as if they rang under protest. C...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1861","creation":"Aug 1, 2019 12:19:37 AM","modification":"Aug 1, 2019 12:19:37 AM"}}
