{"id":64475,"no":43,"title":"Page 43","content":"\"There it is,\" Peta said, pointing through the helicopter\u0027s bubble window.\n Arthur grinned. \"You\u0027re sure?\" He sat to her left at the helm of the sprightly little Chief-8, his right hand firm on the stick. He winked at her. \"It\u0027s so hard to tell Ray\u0027s casino from the others.\"\n The wink said it all. Even among the gallimaufry of brightly lit, high-concept, high-rise casinos lining the Las Vegas Strip, ferro-concrete behemoths in drag watching the endless parade of tourists, Ray\u0027s wedged-shaped Daredevil Casino stood out. Maybe it was its shape, apex aimed like a spearhead at the sidewalk. Or maybe it was the space shuttle that appeared to be launching from the right side. Or perhaps it was the realistic Godzilla-like creature, with animatronic head and arms, bursting through the left wall.\n She noticed a crowd beginning to gather around the monster and glanced at her watch; almost half past eleven. Ray\u0027s stuntmen-cum-actors must be about to begin their assault on the giant fire-breathing lizard.\n \"Anything wrong?\" The flight had been glide smooth until a moment ago, when she\u0027d noticed a little pitch and roll.\n \"Some strange updrafts around the casino.\"\n The Daredevil\u0027s rooftop helipad loomed before them. Peta dug into her shoulder bag. She found what she was looking for but didn\u0027t remove it. \"I want you to see something before we land,\" she said. \"I didn\u0027t want to be the only one in on the secret.\"\n \"Maybe it should wait till after we land.\" Arthur kept his eyes straight ahead.\n \"I really think you\u0027ll want to see this now.\"\n She opened her hand and held the piece up where he wouldn\u0027t have to turn his head too far to see it. After a quick first glance he stiffened and took another look.\n \"What in the world?\"\n \"It\u0027s my piece, the one you gave me.\"\n \"But I thought - \"\n \"I had Ralphie make a phony - and he did a masterful job. That\u0027s what I gave Frik.\"\n \"So he thinks he\u0027s got three but he\u0027s only got two. I love it! Doesn\u0027t Ray know - ?\"\n \"Uh-uh. At the time I wasn\u0027t quite sure about Ray. I mean, whether or not he had something to do with your, um, death, or if he and Frikkie were in cahoots. So I didn\u0027t tell him. I\u0027ve learned the truth, but I haven\u0027t exactly had time to call him.\"\n \"So you and I will be the only ones who know.\" He grinned. \"How do you want to work it? We can let them assemble it with the fake, and when nothing happens, pull out the real things and say, \u0027See if this works better.\u0027 Or we can - \"\n The interior of the cabin filled with a bright blue light. The helicopter dipped. Arthur fought the stick.\n \"Oh, God!\" Peta cried. The light had centered on the piece in her hand, but it was coming from outside. When she looked through the window, she could follow a tightly focused beam straight back to Ray\u0027s penthouse atop the casino. \"What are they trying to do to us?\"\n She saw four figures rush out onto the helipad. The one she recognized as Ray began waving at her. Was he warning her off or telling her to hurry in?\n The chopper was bucking like a wild stallion. Arthur forced it into a stuttering descent toward the helipad. \"It\u0027s that thing, that piece you\u0027ve got there. Somehow it\u0027s set off something below that\u0027s affecting the controls.\"\n \"Should I toss it out?\" Peta said.\n \"Hell no! We\u0027re notout of control, just having some difficulty is all.\"\n \"How much difficulty?\"\n A tight grin. \"Oh, I\u0027d say something akin to flying through a Midwest supercell.\"\n \"With or without tornadoes?\"\n \"Without. But that could change any moment.\" He glanced at her. \"Look. An actual touchdown might be too dicey with these controls the way they are. But I can get low enough so that you can toss the piece onto the pad.\"\n \"And then what?\"\n \"Then we see what happens. If I get the helm back, we\u0027ll land. If not, we\u0027ll fly off and look for a place in the desert to put down. Either way, we\u0027ll know the piece will be safe with Ray until we make it back to the casino.\"\n \"Bring her down as low as you can,\" Peta said. \"These pieces seem to be indestructible, but let\u0027s not take any chances.\"\n Arthur fought the Chief-8 downward. When the landing runners wobbled between eight and ten feet above the helipad, Peta pushed her door open. Noise and wind swirled through the cabin. Looking below, she saw Ray, Keene, and McKendry backed against the wall of the penthouse.\n Frik stood at the edge of the landing circle, where the tornadic downwash whipped his hair and clothing. Peta saw his face, his tight, angry posture. He knows, she thought. He must have tried to assemble the device with the fake piece.\n Was that why the chopper was acting crazy?\n She cataloged her options. Fast. The way she did during emergency surgery. She could toss out the real fragment, surrendering it to Frik, or keep it in the chopper and risk a crash. Or - \"Hold her steady!\" She unclasped her seat harness.\n \"What are you doing?\"\n She tucked her piece of the device into her bra. The beam followed it, making her chest glow with the same eerie blue light. \"See you below,\" she said.\n Swiveling onto her belly, she slipped her legs through the door.\n \"Peta!\" Arthur shouted, panic wild in his face. \"Get back in here! You\u0027ll break your neck!\"\n Feeling nothing except the need to take action, Peta continued her outward slide. The vortex from the whirling blades tore at her skirt, whipping it above her knees. She wished she\u0027d worn jeans - she\u0027d have a better view of her feet. Inching down, she kicked back and forth until her boots found the landing runner. She hooked her heels on the steel tubing, reached down and grabbed it with her left hand, then her right. Finally she kicked her feet free and swung down to hang with her boot soles only three or four feet above the helipad. She was about to release her grip when the chopper suddenly veered up and away from the roof.\n The beam of blue light followed her, targeted like a laser on her chest. She repressed a scream as she looked down through hundreds of feet of empty air at the top of the giant lizard monster\u0027s head. On the ground below, people in the gathering crowd began to look up and point. She wanted to shout, I\u0027m not part of the damn Daredevil show! This is the real thing!\n She felt her fingers slipping and tightened her grip, envisioning herself splattered on the pavement below while the onlookers applauded the realistic gore effects. The little chopper began to angle back down toward the roof. The parapet hove within reach, the chopper dipped, and Peta saw the upper edge of the wall rushing at her.\n She cried out and nearly lost her grip as her right hip and thigh slammed against the concrete.\n The chopper wobbled away and back again, ramming the small of her back against the edge of the parapet, twisting her body and tearing her right hand free of the runner. Clinging by one hand, she felt wind catch her skirt and wrench her back and forth.\n With her free hand, Peta tore open the skirt\u0027s hook and loop closure, and the skirt dropped away. Arthur must have regained a modicum of control because the chopper lifted and angled back over the helipad, bringing her shoes to within a yard or so of the surface.\n That was more than good enough for Peta. She released her grip and dropped onto the hard concrete surface.\n The relief of feeling something solid beneath her gave way to a blast of pain as her right ankle buckled. Instinctively she rolled as she fell, and felt the piece slip from her bra and tumble away...\n ...to land at Frik\u0027s feet...almost as if it wanted to be there.\n He snatched it up and raised it above his head. The beam of light focused on the piece, making it look like he held a blue sun against the night sky.\n \"You gave me a bad moment there, Peta!\" Frik said, shouting over the noise of the chopper. \"I thought we were going to lose this!\"\n He ran toward the penthouse, brushing past Ray, McKendry, and Keene, who were hurrying forward to help Peta. She struggled to her feet. Her ankle blazed with gut-wrenching agony. She glanced up and saw that Arthur had full control of the chopper now. Removing the piece had worked. She gave him a thumbs-up. He nodded gravely through the bubble.\n She turned back to the other men and pointed toward Frik\u0027s retreating back. \"Stop him!\"\n Her shout was lost in the wind and the engine noise, and she doubted McKendry and Keene would have been much use anyway. They stood frozen on the helipad, eyes fixed on the chopper, gaping at Arthur. She saw Keene grab Ray by his shirt and point to the chopper, shouting something she couldn\u0027t hear, doubtless something about a dead man piloting an aircraft.\n No help there. Ignoring the stab of pain each step sent up her leg, she hobbled after Frik on her own. He had all of the pieces now. If she didn\u0027t do something right away, he would assemble the artifact and take possession of it. Too many people had died because of his obsession. She couldn\u0027t let him have control of it.\n She stepped through the sliding glass door into the great room and stopped. Frik was nowhere to be seen. He had what he wanted. Could he already have gone?\n A bright blue glow from the rear doorway answered her. She reached the lab and found Frik hovering over the four assembled pieces, guiding hers - the fifth and last - toward its position.\n apparently inert on the workbench, looking for all the world like nothing more than an oddly mottled Easter egg with an extra nodule on one side.\n It was as if Frik had turned off a light.\n He turned to face her. \"What is this, Peta? Another goddamn fake?\" He pulled over a metallic briefcase that sat open on the lab table. \"I\u0027ll just have to take this back to my own labs and figure it out.\" He extended his scarred left hand toward the object.\n She lunged, reaching for it with both hands. Though she did not yet fully understand why she felt so passionately about it, every instinct told her to stop Frik from removing the device. He grabbed her arms. She struggled to release herself from his grasp.\n Suddenly, time seemed to slow down. She watched as if through a heat mirage as a ripple ran over the surface of the spheroid, followed by another and another, blurring the edges of the separate pieces. Fusing them into a single object.\n At its center, a tiny spot of bright white began to glow, and then light was everywhere, blasting through Peta like a storm wind through a screen door, engulfing her in heat like the heart of the sun. Consuming her and everything around her. \n","sourceLink":"https://allnovel.net/artifact/page-43.html","bookId":1691,"book":{"id":1691,"title":"Artifact","description":"Storyline: \n Artifact \n by F. Paul Wilson, Janet Berliner, Matthew Costello \n Six adrenalin junkies who call themselves the Daredevils Club hold the fate of the world in their hands. In an ancient undersea cavern, one of them, oil man Frik van Alman, discovers a set of stones that are unlike anything else on Earth. Fitted together, the stones form an object that promises limitless free energy for the world. \n After a terrified scientist scatters the pieces, the club members race to retrieve them. Each knows that whoever reassembles the unique device will have unlimited power at his or her fingertips. Can anyone be trusted? \n In a thrilling adventure that stretches from deep beneath the Caribbean to the penthouses of Las Vegas, friend battles friend for control of the Artifact.\n \n","cover":"https://allnovel.net/images/artifact.jpg","author":"F. Paul Wilson","type":"Thriller","source":"allnovel","link":"https://allnovel.net/artifact.html","creation":"Oct 5, 2019 8:57:52 AM","modification":"Oct 5, 2019 9:54:06 AM"}}
