{"id":64440,"no":8,"title":"Page 8","content":"To Frik, the next hour seemed like a lifetime. Arthur had called on his way to the airport and issued instructions for what would be needed. Frik jotted them down and repeated each one, a slur creeping into his voice. When he put down the phone, he handed the list to Saaliim and told him to go out and collect everything Arthur wanted.\\n\\n Saaliim was also given a second mission.\\n\\n After showing Saaliim the piece of the artifact that he\u0027d rescued from the fire, Frik ordered his assistant to search the remains of the lab and Trujold\u0027s house and car for the three missing components of the strange object.\\n\\n Reluctant to leave Frik alone for long, Saaliim returned in less than an hour. He had gathered everything Arthur needed, but he\u0027d found nothing that in any way resembled the pieces of the artifact. Maybe he\u0027d made the wrong choice, not taking Paul directly to the hospital. Chances were, they would have ignored his babblings there, but they could have done something to keep him alive - at least long enough for Frik to extract from him the whereabouts of the missing pieces.\\n\\n Then again, he\u0027d learned to trust his first instinct, which in this case was to keep things under tight control.\\n\\n Leaving the matter of the artifact to be dealt with later, Frik settled down to wait for Arthur. Every car he saw on the road had to be his...until it was swallowed by the balmy night. He cursed himself for not arranging to have a helicopter waiting for Arthur at Piarco. The airport was only forty or fifty kilometers from the house. Marryshow, an accomplished pilot, could have been here long ago. Christ, how he hated inefficiency, especially his own, he thought, as the pain came back and he gulped more scotch. He couldn\u0027t risk taking morphine and losing control of this situation. Have to make Arthur help me, he kept telling himself.\\n\\n Car lights cut through the darkened room.\\n\\n Paul, finally knocked out by the drugs, didn\u0027t stir. Frik turned on a light. Seconds later, Arthur came into the house.\\n\\n \"Frikkie, I\u0027ve just sent Saaliim to get some more things. I need you to tell me exactly what happened. By the way, you look like hell.\"\\n\\n Frik realized that he hadn\u0027t done anything to clean himself up. \"Like I told you, there was a fire. I - \"\\n\\n Arthur was already standing beside Paul. He pulled back the sheet exposing the black splotches where fire had seared the skin. \"My God. If you\u0027re up to it, hand me my bag.\"\\n\\n Frik handed him a medical bag that looked more like an oversized attache. \"We have to talk,\" he said.\\n\\n \"Let me check him first. I\u0027ll listen to what you have to say later.\"\\n\\n Arthur checked Paul\u0027s vitals. \"His pulse is thready. His breathing\u0027s ragged at best.\"\\n\\n Frik ventured closer. To his astonishment, Trujold had opened his eyes. Clearly, he was struggling to say something, but what emerged from his scorched lips was little more than a series of croaks. He seemed to be saying \"Anny.\"\\n\\n \"He\u0027s trying to say Manny,\" Frik said. \"Manny carried him out of the flaming building.\"\\n\\n \"Easy, Paul,\" Arthur said. \"Don\u0027t try to speak.\" He motioned Frik to follow him out of Paul\u0027s earshot. \"He\u0027s a mess. Chances are he\u0027s not going to make it. His only hope is to be moved out now.\"\\n\\n \"No.\"\\n\\n \"Excuse me? Paul needs things I can\u0027t do for him here.\"\\n\\n Frik glanced over at Paul. He had closed his eyes and seemed to have fallen unconscious again. \"Listen to me, Arthur,\" he said. \"We\u0027re talking about the man\u0027s life.\" Arthur\u0027s harsh whisper held both contempt and anger.\\n\\n \"You have to know there\u0027s a reason I didn\u0027t take him straight to Mount Hope,\" Frik said. \"Not onlya reason, but one that\u0027s more important than Paul or you or me.\"\\n\\n \"I must move him to the hospital right away, Frik,\" Arthur said. \"And I should take a look at you, too.\"\\n\\n Frik shook his head. \"We found something, Arthur. In the deep test drilling area. I wanted to hide it, but Paul had already - \"\\n\\n Arthur looked over at Paul.\"Found something?\"\\n\\n Frik nodded. He described - as best he could - the indescribable, and watched Arthur\u0027s eyes narrow. This had to be a strange night for him. Flying here, seeing both of them burned, now this. Frik anticipated a barrage of questions, but when he\u0027d finished, Arthur only asked, \"Where is it?\"\\n\\n Frik shook his head. \"That\u0027s the point. I thought I had it. I thought I was bringing the device out of the lab. When it started melting in the heat, I knew most of it was only a goddamn replica Paul had made. Only one piece of the real thing was left. It\u0027s right over there.\" Frik nodded in the direction of a side table. On it, under a lamp, sat the one piece of the artifact Frik had. It reflected the artificial light with an unnatural eeriness. From the confused look on Arthur\u0027s face Frik concluded that he sensed it too.\\n\\n Saaliim came into the room with some ice and glasses and a small pitcher of water. Arthur grabbed the bottle of Lagavulin and poured himself a few fingers\u0027 worth.\\n\\n \"Tell me...what did you plan on doing with the...whatever it was?\"\\n\\n Frik moistened his lips and looked over at Paul. Best-case scenario, the man regained consciousness long enough to disclose the whereabouts of the fragments to Frik - and then died. If he lived, the truth would come out. Or at least Paul\u0027s fantasies of the truth.\\n\\n \"What were you going to do with this incredible device?\" Arthur asked again.\\n\\n \"If I couldn\u0027t figure out how to replicate it...control it? I was going to hide it. For as long as I could,\" Frik said.\\n\\n As if he had heard Frik\u0027s words, Paul groaned slightly. An intake of air. Arthur walked over to him, looked at Paul, then at Frik. \"I must move Paul now. There\u0027s nothing more I can do for him here. Have Saaliim call for an ambulance.\"\\n\\n At that moment, Frik\u0027s assistant returned to the room. \"I took the liberty, Dr. Marryshow, of ordering Oilstar\u0027s medevac chopper. It should be here shortly.\" His words were punctuated by thethump thump thump of the emergency helicopter approaching.\\n\\n Frik said, \"Most efficient of you. Thank you, Saaliim,\" but his words lacked true conviction, and the younger man averted his eyes.\\n\\n Arthur turned back to Paul and rechecked the burned man\u0027s vitals. The thumping outside became a torrent against the side of the house, and then quieted.\\n\\n Two EMS techs ran into the room pushing a gurney. Frik watched them gently shift Paul from the small daybed.\\n\\n \"Careful,\" Arthur said.\\n\\n The techs looked from Arthur to Frik. One asked, in accented English, \"You \u0027kay, Mr. Van Alman?\"\\n\\n Frik nodded.\\n\\n \"Get him on the chopper.\" Arthur indicated Paul. \"I\u0027ll be right out.\" The tech nodded, and they wheeled Paul out.\\n\\n \"Frikkie, you need medical attention too. You need to come with us to the hospital.\"\\n\\n Frik poured another scotch. \"Arthur - I want our club to find those pieces. The Daredevils.\"\\n\\n He turned toward his old friend. Arthur\u0027s face showed consternation, even anger. \"I have a patient to deal with, Frik. We\u0027ll have to have this discussion another time.\"\\n\\n \"But - \"\\n\\n Arthur cut off Frik\u0027s response by turning on his heel and walking through the door. Over his shoulder he called out, \"If Paul has any relatives, I suggest you contact them.\"\\n\\n Frikkie downed the scotch and reached for the bottle. As he sank back into the cushions of his leather sofa, the torrent of noise outside returned. Small twigs and leaves battered the windows and walls of the house as the medevac chopper took off.\\n\\n Frikkie snapped awake at the sound of the telephone. His first sensation was pain, searing, aching pain. He reached for the bottle of Lagavulin and knocked it over, but nothing poured out. Empty.\\n\\n \"Master Frik, you\u0027re awake.\" Saaliim\u0027s voice was soft and full of concern. \"Dr. Marryshow is on the line.\"\\n\\n \"What time is it?\"\\n\\n \"Half-four. Should I bring you the phone?\"\\n\\n Frik waggled his head to try to clear it. It took a few moments for all of the previous day\u0027s events to return to him. \"Yes,\" he said at last. \"Also some coffee and anything you can find for this pain, short of morphine.\"\\n\\n As Saaliim left, Frik tried to stand. A wave of nausea passed over him and he dropped back onto the leather sofa he\u0027d been sleeping on. His left hand was a mass of pain. His mouth tasted as if he\u0027d washed down the embers of a campfire with a bottle of whiskey, which he supposed wasn\u0027t far from the truth.\\n\\n Suddenly the receiver of a telephone appeared in front of him. He picked it up and croaked, \"Hello, Arthur?\"\\n\\n \"You don\u0027t sound good, Frik.\"\\n\\n \"I\u0027m fine if you discount the pain, and the aftereffects of a bottle of scotch. The important question is, how\u0027s Paul?\"\\n\\n There was a pause on the line, and Frik knew the answer to his question.\\n\\n \"He died twenty minutes ago.\"\\n\\n \"Damn it. Wasn\u0027t there anything you could do?\" As soon as he\u0027d asked the question, Frikkie knew it was a mistake.\\n\\n \"Had he been brought straight to a hospital instead of your house, maybe. But - \"\\n\\n That line of discussion wouldn\u0027t get them anywhere, so Frik cut in, saying, \"His wife died years ago, as did his parents. Saaliim is trying to locate Paul\u0027s daughter.\" The smell of fresh coffee wafted into the study.\\n\\n \"I think I\u0027ve got that taken care of,\" Arthur said. \"Manny stopped by to see how Paul was doing. He just left. He said he can get a message to...Selene, right?\"\\n\\n Frik inhaled deeply of the comforting coffee aroma. \"Yes. Selene. She\u0027s not particularly fond of me. She\u0027s one of those environmentalists.\" Saaliim returned with a cup of coffee and a Vicodin. Frikkie washed down the pain pill with a swig of the liquid, which his assistant had cooled just enough with the addition of milk.\\n\\n \"I\u0027m sorry to bring it up at a time like this, but...\" Frik paused and took a deep breath. \"The Daredevils Club meeting is less than two weeks away. Tell me that you\u0027ll support me in this, Arthur. We have to find that device.\"\\n\\n \"We\u0027ll talk about it tomorrow.\"\\n\\n Frik took another swallow of coffee. He couldn\u0027t wait. The sense of dread that had seized him in the lab was eating at him, trying to get another grip. \"Tell me you\u0027ll help, damn it. You\u0027re my friend.\"\\n\\n Arthur would have to back him in this. You owe me, he thought again, but as they had done right after the accident, the words remained unspoken. There was silence on the line. Were it not for the background murmur of the nurses at the station from which Arthur was making the call, Frikkie would have thought that his friend had hung up.\\n\\n \"Your answer?\"\\n\\n \"No, Frik. I don\u0027t think so. The club has never been for the aggrandizement of any individual member. Besides, there\u0027s something unsavory about all this - \"\\n\\n \"You don\u0027t understand. You could be throwing away the key to the universe.\"\\n\\n That made Arthur laugh. \"Some lids are meant to remain locked, Frikkie. I\u0027m not willing to be Pandora, here.\"\\n\\n \"Damn it, Arthur - \"\\n\\n \"Over my dead body, Frik. The whole thing smells wrong to me. I suppose you can bring it up at the meeting New Year\u0027s Eve, but I\u0027ll fight you on it.\"\\n\\n This time, the silence on the line was absolute.\\n\\n Frikkie put the receiver in its cradle and lay back on the sofa. The alcohol he had consumed had not fully left his system and the narcotic was beginning to numb his extremities. He tried to focus on the events of the day, and on how to proceed, but things quickly got hazy. One diaphanous plan melted into another, until he passed out cold.\\n\\n At around midmorning, Frik awoke again, stiff and groggy and in his own bed. He assumed he\u0027d been carried there by Saaliim. Wouldn\u0027t be the first time, he thought. He didn\u0027t know which was worse, the pain in his hand, the tightness in his chest from the smoke-filled lab, or his pounding hangover headache.\\n\\n \"Saaliim!\"\\n\\n His call instantly brought his assistant into the room.\\n\\n \"Coffee, my man. And something for this pain.\"\\n\\n \"Dr. Marryshow, he sent you some medicinals,\" Saaliim said. \"Right there on your nightstand.\"\\n\\n The younger man left the room and Frik picked up the white paper bag with a note in Arthur\u0027s handwriting stapled to it. Inside the bag there was antibacterial ointment for the burns and a small bottle of painkillers. The note contained cursory instructions about how often to take them and a warning not to drink alcohol while he did so. At the end of the instructions, Arthur had added: I\u0027m leaving the island. Take it slowly for a few days, Frikkie, and don\u0027t overdo the medication. By then you\u0027ll have come to your senses. Arthur Or maybe you\u0027ll have changed your mind, Frik thought, and promptly swallowed twice the recommended dose of pills. By the time Saaliim returned with coffee, he was falling back into blackness.\\n\\n For three days, Frik remembered little except pills, coffee, pain, and Saaliim\u0027s quiet presence floating in and out of the room. By the fourth morning, he was up and trying to dress when Saaliim knocked on the door.\\n\\n \"Telephone, Master Frik.\"\\n\\n \"Who is it?\"\\n\\n Arthur, he told himself as the events of the past few days returned to him. He\u0027s changed his mind.\\n\\n \"Missy Selene. Yesterday I told her you can\u0027t talk. Today she don\u0027t sound too good.\"\\n\\n \"I\u0027ll talk to her.\" Frik sat down on the side of the bed. Saaliim plugged in the extension phone, which he\u0027d apparently kept unplugged for the last few days.\\n\\n \"Hello? Selene?\"\\n\\n \"Frik.\" Selene\u0027s voice was like an ice cube.\\n\\n He shivered, despite the heat of the morning. \"I\u0027m sorry about your father, Selene. He was a good man.\"\\n\\n \"Sorry? I\u0027ll bet you are. You lost a major workhorse, not to mention his discovery. You\u0027ve never given a damn for anyone\u0027s safety but your own, you bastard.\"\\n\\n \"Selene - \"\\n\\n \"You and your fucking oil drilling,\" Selene yelled. \"By the time we\u0027re finished with you, Oilstar will be nothing but a memory.\"\\n\\n The phone went dead in Frik\u0027s hand.\\n\\n He pieced together what he knew about Selene. It wasn\u0027t much. She was bright, attractive, and had a Ph.D. in physics for which he had paid.\\n\\n The penny dropped.\\n\\n Green Impacthad to be the \"we\" to which she had referred.\\n\\n That was when the second penny dropped.\\n\\n She knows, Frik thought. Her father must have sent her the pieces of the artifact. But how? There was no way she could have received them yet unless they\u0027d been hand delivered. But by whom? Manny?\\n\\n No. That was laughable. Manny was too smart to bite the hand that fed him.\\n\\n How then? Maybe she hadn\u0027t received them yet. Maybe her father had told her he was sending them but - It doesn\u0027t matter, Frik told himself. All that matters is that she knows. If Paul had told her about the artifact, then even if he hadn\u0027t sent them to her, he might have told her where he\u0027d hidden the missing pieces. In order to find out, he\u0027d have to capture Selene, and for that, he\u0027d need some help.\\n\\n The Daredevils Club remained his only choice. He\u0027d have to convince them, whether Arthur objected or not. Whatever it took, Frik needed the club. He wasn\u0027t going to go into extinction quietly, damn it. He was no dumb tyrannosaur, he was Frikkie Van Alman, head of Oilstar, man of adventure. Nothing would stand in his way.\\n\\n Nothing. \\n\\n","sourceLink":"https://allnovel.net/artifact/page-8.html","bookId":1691,"book":{"id":1691,"title":"Artifact","description":"Storyline: Artifact \\n by F. Paul Wilson, Janet Berliner, Matthew Costello \\n Six adrenalin junkies who call themselves the Daredevils Club hold the fate of the world in their hands. In an ancient undersea cavern, one of them, oil man Frik van Alman, discovers a set of stones that are unlike anything else on Earth. Fitted together, the stones form an object that promises limitless free energy for the world. \\n After a terrified scientist scatters the pieces, the club members race to retrieve them. Each knows that whoever reassembles the unique device will have unlimited power at his or her fingertips. Can anyone be trusted? \\n In a thrilling adventure that stretches from deep beneath the Caribbean to the penthouses of Las Vegas, friend battles friend for control of the Artifact.\\n","cover":"https://allnovel.net/images/artifact.jpg","author":"F. Paul Wilson","type":"Thriller","source":"allnovel","link":"https://allnovel.net/artifact.html","creation":"Oct 5, 2019 8:57:52 AM","modification":"Oct 5, 2019 9:54:06 AM"}}
