{"id":93542,"no":15,"title":"Page 15","content":"CHAPTER 27\\n\\n Schuyler\\n\\n She was used to being alone. She had been alone for much of her life. Her grandmother had not advocated the current hovering, anxious practice of modern helicopter parenting. There had been no one from home to watch the few school plays she was in, no one to cheer her on from the sidelines at the Saturday soccer games. It had been sink or swim with Cordelia: no risk of drowning from too much attention. Schuyler¡㱠childhood looked lonely from the outside: no siblings, no parents, and until Oliver came into her life, no friends.\\n\\n But here was a secret: Schuyler hadn¡㲠been lonely. She¡㢠had her painting, her drawing, her art, and her books. She liked being alone. It was company that flagged her; she had no idea how to make casual chitchat, or how to interpret and emulate the fluid social gestures that drew people together. She was forever the Little Match Girl at the window, shivering out in the cold. But while people scared her, she had never been afraid of the dark.\\n\\n At least, not until now. The darkness that surrounded her was absolute: so complete, even vampire sight was useless. She hid in a tunnel until the screams and sounds of the skirmish subsided, fading into blackness. She should have stayed; what had she been thinking? Why had she left him there alone? She had left Oliver and now Jack. But she had had no weapon; she had nothing. Jack had wanted her to run, and so she had. \"Jack? Jack?\" she called, her voice echoing down the length of the tunnel. \"Are you all right? Jack?\"\\n\\n There was no answer.\\n\\n The silence was even more unsettling. It was so quiet she could hear the sound of rain falling somewhere above the catacombs, could hear the drip-drop-drip of every trickle that fell through the cracks in the walls and hit the floor. She hugged herself tightly, unsure of what to do. Her shoulders ached, and it felt as if her muscles were frozen. So this was what it was to be afraid of the dark. To be afraid and alone in the dark. Schuyler called Jack¡㱠name for what seemed like hours, but there was no answer. There was no sign of the Silver Bloods either, but that didn¡㲠mean anything. Maybe they had withdrawn, only to return later. She didn¡㲠want to think about what might have happened to Jack.... Could they have taken him? Was he destroyed? Lost? Broken?\\n\\n Jack was gone. No. Schuyler shook her head even though she was only arguing with herself. There was no way he could have fallen. Not him. Not that dazzling fearsome light that he was. No. She had seen his true form and it was awesome to behold. A pillar of fire. A thousand magnificent suns burning with flames the color of the deepest night. Terrible and wonderful and more frightening than anything she had ever seen. No!\\n\\n He will return for me.\\n\\n She believed it. She looked around at the maze of tunnels. She had no idea where she was, or where she had come from. You could get lost in here for centuries, Schuyler had told Jack.\\n\\n That\u0027s the idea.\\n\\n What am I doing? I\u0027m such an idiot. The intersection! It was the only natural place. What had Charles said? The intersection. The place where they cannot cross. All the tunnels led there. Where was it? She couldn\u0027t see, so she felt along the wall. There was an opening. She felt another. Two tunnels. A fork in the road. She would have to choose. But which? She felt along the grain, trying to sense something. If she could not see, maybe she could smell....\\n\\n It had smelled clean in here, she remembered thinking. She had expected the underground cavern to smell moldy, like a damp towel that had been left too long on the floor. But when she and Jack had first disappeared into the catacombs, she had been surprised to breathe fresh air. This one, she thought. This one smells just a bit fresher, as if maybe it would lead to more fresh air, maybe to the stairs that led upward and out. She made a decision. She walked into the dark tunnel, with only her fingertips as her guide.\\n\\n It felt as if she had been walking in the dark for miles, but her nose had not failed her, the air had cleared, and from far away she could see it... a light shining in the darkness. Jack. It had to be Jack.\\n\\n Finally she reached the intersection.\\n\\n But the light was from the torch Jack had been carrying before they were attacked.\\n\\n And there was no one there.\\n\\n CHAPTER 28\\n\\n Bliss\\n\\n It was the last week of August, and Cotswold had finally sold after the price was reduced another hundred thousand, give or take. A Russian oligarch bought the Hamptons house and everything in it, down to the last nautical cushion and including the car collection. The new family wanted possession right away, so there was a very short escrow period. And ever since the day Bliss had overheard the conversation in Forsyth\u0027s study, the Visitor had retreated for his longest absence yet. Saturday, their first day back in New York, made it the fifth straight day that he had been gone. Almost an entire week.\\n\\n It was a relief to be back in the city again. She had gotten tired of the Hamptons, as everyone ultimately does. And while she had her freedom, Bliss tried to find out what was going on. She had called the Force household, not sure of what she could say exactly, not that it mattered anyway since their maid told her that no one was around.\\n\\n Charles was gone, Trinity was in D.C., and the twins were away as well. Then she called Schuyler\u0027s cell, but her service had been disconnected. She called the house on Riverside Drive, and Hattie told her Schuyler was... away. The housekeeper sounded too frightened to tell Bliss anything else. The Hazard-Perrys were spending the summer in Maine, but when Bliss called that number, no one picked up. There wasn\u0027t even an answering machine. It was all very strange and not promising.\\n\\n She had raided Forsyth\u0027s study before it had been packed up and had tried to call Ambrose Barlow. She had decided that if Forsyth and the Visitor had mocked him, then maybe Warden Barlow was one of the good guys. But when she called the Barlow residence, the warden wasn\u0027t there. And she didn\u0027t know what kind of message to leave that wouldn\u0027t find its way back to the Visitor. She had to make sure he was kept in the dark about what she was planning as well.\\n\\n Finally she decided she would mail an anonymous note. Not an e-mail that could be traced back to her computer, but a note on some nice stationery so that the Barlows would pay attention to it and not think it was junk mail. Bobi Anne had kept a nice collection of card stock, and Bliss selected one.\\n\\n Dear Warden Barlow,\\n\\n You don¡㲠know me, but I have to warn you about something. Beware of Forsyth Llwellyn. He is not who you think he is.\\n\\n A friend\\n\\n God that sounded lame. But what else could she do without giving herself away? It had as much teeth as a beware of dog sign on an unguarded lawn, but Bliss had no idea what else to do. She couldn\u0027t risk the Visitor being aware of her actions, and if anyone from the Conclave came around asking for her, Forsyth would know what had happened.\\n\\n It was better than doing nothing.\\n\\n Maybe it would even help. She hoped so.\\n\\n After posting the note, she walked aimlessly up Fifth Avenue past the Guggenheim Museum. The weather was sticky and hot, one of those fry an-egg-on-the-sidewalk New York days, but Bliss didn\u0027t care. She was just glad to be home. Back in the city she had grown to love so much. Then she wandered back down to the Metropolitan Museum of Art. She walked up the grand steps, dodging picnicking crowds of tourists sitting out under the bright sun. As she entered the grand marble foyer and passed the security bag check, waiting patiently as a bored security guard poked at the contents of her handbag with a baton, she felt a pain in her heart.\\n\\n This was where Dylan had taken her on their first date.\\n\\n It was too keen to be anything but grief, as she remembered how Dylan had paid the entrance fee for the two of them with a dime. But as she walked up to the ticket counter, she found she did not have his audacity, and surrendered the entire \"suggested\" fee.\\n\\n It had been almost two years ago when he had brought her to the museum. He had been so excited to take her to the Egyptian wing, and unconsciously Bliss began to walk toward it, passing by glass display cases of scarabs and cartouche jewelry. She passed the display of sarcophagi. She remembered how Dylan had asked her to close her eyes and led her through the passageways, and when she had opened them she was standing in front of it. The Temple of Dendur. A real Egyptian temple rebuilt in a room at the Metropolitan. It was like having a piece of history come alive.\\n\\n So ancient and beautiful.\\n\\n And so romantic. She remembered how Dylan had stood in front of it, his eyes shining like bright stars. Bliss walked softly in front of it, remembering.... The light slanted into the room, making shadows on the memorial. She was struck by a sadness so overwhelming she had to steady herself or she would have fallen.\\n\\n \"Are you all right?\" a girl asked.\\n\\n \"I\u0027m okay.\" Bliss nodded. She sat down on the steps across from the ruin and took a deep breath. \"I\u0027m okay.\" The girl gave her another curious look, but left her alone.\\n\\n Bliss was still rooted to the same spot four hours later, when the lights started to blink and an announcement came over the speakers. \"The Metropolitan Museum is closing in thirty minutes. Please make your way to the exit.\" This announcement was repeated every few minutes in many different languages.\\n\\n Bliss didn\u0027t move from her seat. Everyone else in the room, art students, a handful of tourists, a docent-led group, utifully walked toward the exit. What am I doing? Bliss wondered. I should go home.\\n\\n But the minutes passed and the overhead lights continued to blink in warning, and when Bliss heard the footsteps of the museum guard, she hid in the temple\u0027s crevice and made herself invisible to human sight. After what seemed like an incredibly long time, the lights finally went out, it was completely silent, and a ghostly moonlight streamed into the museum.\\n\\n She was alone.\\n\\n She walked right up to the temple, touching the rough stone, putting her fingers in the grooves of the etched hieroglyphics. Dylan had kissed her right here, for the first time.\\n\\n She missed him so much.\\n\\n \" I miss you too.\"\\n\\n What was that?\\n\\n She looked around the empty room. The light made weird crazy shadows on everything, reminding her of how she used to fear the willow tree outside her bedroom when she was a kid.\\n\\n She walked up to the fountain on the perimeter of the room and threw a quarter into the water, watching it fall. For a moment she had thought she\u0027d heard his voice, but now she was really going crazy, wasn\u0027t she?\\n\\n \"You\u0027re not crazy.\"\\n\\n She was annoyed, agitated. Whoever was talking to her had to stop it.\\n\\n \"Is anyone there? Hello?\"\\n\\n Her voice echoed throughout the still chamber. All that answered was an echo of her question:\\n\\n HelloHelloHello...\\n\\n But if the voice wasn\u0027t out there... then maybe... maybe... it was coming from somewhere... inside.... But that wasn\u0027t the Visitor\u0027s voice, she was sure of it. She closed her eyes. What was the harm? It wasn\u0027t as if stranger things hadn\u0027t already happened. She looked inward. There was a void where the Visitor usually was, an emptiness. The Visitor was definitely still away.\\n\\n But for the first time she sensed another presence, and another and another\u0027so very many others, hundreds of others.... Oh god, what was it that the Silver Bloods did? They took the blood, the undying consciousness, so that their victims lived on inside their captors. Many souls trapped in one body. Abomination.\\n\\n There were hundreds of souls just below her conscious-ness, just like her, they had been trapped in the backseat (maybe even the trunk?). It was like looking down into one of those mass graves... but instead of corpses, they were all still alive....\\n\\n She wanted to scream.... This was so much worse than having the Visitor. This was... She almost lost it, but then... that voice again.... Low, husky, and raspy, as if it had smoked too many cigarettes and had spent too many nights shouting in a packed downtown bar. It was the voice of a boy who had seen it all and had lived to tell a funny tale about it, deep and rough but with a sweet edge that went straight to your heart. Could it be?\\n\\n How could it?\\n\\n \"Dylan?\" she whispered. \"Is that you?\"\\n\\n There was silence.\\n\\n Then, out of the darkness, she saw him materialize in front of her, saw his shape, saw his face, his beautiful sad eyes, his crooked grin, his dark disheveled hair. He stepped out of the void and into the light.\\n\\n \"I don\u0027t have much time,\" Dylan said. \"that Visitor of yours is coming back soon.\" \\n\\n","sourceLink":"https://allnovel.net/the-van-alen-legacy-blue-bloods-4/page-15.html","bookId":2122,"book":{"id":2122,"title":"The Van Alen Legacy (Blue Bloods #4)","description":"Storyline: The Van Alen Legacy (Blue Bloods #4) \\n This book was an excellent addition to the series. I am liking this series more and more with every book I read in it. The third book in the series really left us hanging. At the beginning of this book Schuyler and Oliver have been on the run for over a year, Mimi has joined the hunt for Jordan, and Bliss has been taken over by the Visitor and left to hide in a dark corner of her own body. Schuyler risks everything trying to contact the European Blue Bloods for support; her and Oliver can\u0027t stay on the run forever. Mimi concludes her hunt for Jordan and is struggling with whether or not she should bond with Jack. Bliss is trying to fight for the right to possess her own body as the Visitor (Morningstar) pushes her out...\\n","cover":"https://allnovel.net/images/the-van-alen-legacy-blue-bloods-4.jpg","author":"Melissa de la Cruz","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-van-alen-legacy-blue-bloods-4.html","creation":"Oct 5, 2019 8:58:21 AM","modification":"Oct 5, 2019 6:02:07 PM"}}
