{"id":74480,"no":25,"title":"Page 25","content":"“It will work,” Kat said. “It will work if we have you.” “I can’t make another stone like that. Not in three days.” He ran a varnish-stained hand across his scruffy face. “Not ever.” Kat shook her head. “I don’t need a stone, Charlie. I need a con.” “No. No,” he said, and his gaze flew to the door, as if there were something lurking outside, beating against the side of the house like the snow and the wind, fighting to get in. “Yes, Charlie.” She reached for his hand. “I’ve been trying for days to think of someone she doesn’t know—someone we can trust to work inside. But then I realized that someone she knows is the perfect person.” “Eddie. You want Eddie.” She would have given anything to tell him he was wrong, but Eddie was the master, the best. He was also on the other side of the world and the other side of a line that said no one steals the Cleopatra Emerald, so Kat shook her head and stared up at the next best thing. “Uncle Eddie can’t…No, Uncle Eddie won’t help me, Charlie. Not this time. This time I need you.” “I loved her, Katarina.” Heartbreak seeped into his eyes. It seemed to take him a moment to realize what he’d said. “And so did he.” When Charlie pulled away, the best hands in the business were shaking. His lip quivered. And Kat hated herself for bringing that darkness to his door. “I’m sorry, Charlie.” She hesitated for a moment but then leaned down and kissed his head. She started for the door. “I won’t bother you anymore.” “Margaret Gray.” Kat stopped and turned. She watched him run a hand through his hair in a gesture she’d seen his brother make a thousand times. “Her name is Margaret Gray,” he said slowly. “And I never want to see her again.” CHAPTER 30 It was almost dusk by the time the small motorboat made it back to the W. W. Hale. It said a great deal about Kat’s current state of mind that she really didn’t want to crawl aboard the larger, safer vessel. “Maybe I could just sit here for…a week or two,” she told Hale. “Not this time,” he said, grabbing her hand and pulling her on board. Marcus stood ten feet away, posture perfectly straight, a tray of tea and scones in his hands. Simon had covered the ship’s massive windows with figures and formulas, and he pointed between them and Gabrielle. Ordinarily, this would have been a source of very little concern, except that Gabrielle was wearing high heels and a rappelling harness and arguing. “Kat!” Simon threw up his hands in disgust and walked toward her. “Will you tell your cousin the kind of damage falling from over a hundred feet can do?” On the deck above, the Bagshaws were yelling something about old wiring systems and backup generators, neither bothering to remove their protective headphones, so they just yelled louder. “Why don’t you just ask Kat?” Hamish yelled. “Yeah,” his brother countered. “Be that way and I’ll ask Kat!” “Guys,” Gabrielle said, but the word was lost amid the smoke and the headphones. “Guys!” she tried again. “Kat’s here!” Hamish was oblivious as he turned and pointed. “Hey, Kat’s here.” It was Nick alone who looked from Kat to the way Hale leaned against the rail with his arms crossed. It might have been a perfectly adequate poker face anywhere else in the world, but it wasn’t quite good enough for Monte Carlo. So Nick stepped closer to Kat and asked, “Where were you?” “Austria,” Hale answered, but Nick acted like he hadn’t even heard. “You fly off in the middle of the night, leaving nothing but a shopping list and an I’ll be back. So where were you?” Nick wanted to know. “Austria,” Kat said, as if Hale’s answer should have been good enough. “You know how to do it, don’t you, Kitty?” Hamish was practically out of breath from his run down the stairs when he bolted onto the deck before her. “So what is it?” Angus asked, appearing at his brother’s side and rubbing his hands together. In the dim light, his eyes seemed to glow. “Is it Hansel and Gretel?” “Can’t be,” Hamish told him. “We only have the one grenade launcher.” “Right.” Angus nodded as if Hamish had a most excellent point. “That’s not it, guys,” Hale said with a quick shake of his head. But Nick was stepping closer to Kat. The words, she could tell, were meant only for her. “What was in Austria?” Kat no longer felt the rock and sway of the ship, but she was far from steady on her feet as she told him, “Our exit strategy.” She pushed past them. “He said no.” She’d hoped that would be the end of it, but then she saw the way the deck was lined with cord and cable, a feather boa, two ball gowns, three tuxes, a box with a French label citing that the contents were extremely explosive, and at least six dozen long-stemmed roses (which Kat had yet to decide whether or not they should even try to use). “Kat,” Simon spoke softly, “what happened?” Kat looked across the faces that stared back at her, open and tired and confused, and she knew it was too late. For everything. “I thought I had a way, guys. I really did. But Uncle Eddie was right—no one steals the Cleopatra Emerald. I’m sorry I conned you all into thinking that we could do it twice.” Every decent con man knows that the simplest truth is more powerful than even the most elaborate lie. Kat saw it then. It broke against them all like the waves. “So we get another plan,” Gabrielle said. “What about the bank?” Simon asked. “We’ve got the Bagshaws.…” “While we appreciate the vote of confidence, my boy,” Hamish said with a slap on Simon’s back, “it’s a vault thirty feet beneath the priciest real estate in the world.” “So no?” Simon said. Hamish shook his head. “No.” “Does she know the Wind in the Willows?” Gabrielle asked. Angus looked at his brother. “I’m pretty sure she was the original Willow.” “Transit?” Hale asked. “Yeah…um…no.” Simon shook his head as if even the thought scared him. “LaFont was on his cell most of the day arranging for transportation.” “Armored car?” Hale guessed. “For starters,” Simon said. “It seems the Palace Guards are also going to escort the truck. And there was talk of maybe a parade.” Hale spun back to Kat. “How do you feel about parades?” he asked. “Hate them.” “You could ride on the back of a convertible,” he teased. “No, thank you.” “What if I throw in a sash? Gabrielle could teach you to wave, couldn’t you, Gabs?” But Gabrielle was too busy changing the ice pack that was now a permanent feature on some part of her body to notice. “Anne Boleyn?” Hamish suggested. “No!” Hale and Kat cried in unison. “Oscar the Grouch?” Gabrielle suggested. “Does LaFont look to you like the kind of guy who takes out his own garbage?” Angus shot back, then shrugged. “Besides, he’s not in on it. The best we can tell, he’s getting conned just like everyone else.” It took a second for that knowledge to wash over them all, but then Gabrielle bolted upright, saying, “Ooh! I know!” Kat cut her off with a wave. “The Prince’s Palace is a fortress, Gabrielle.” “I know,” Gabrielle said. “But palaces are fun.” “This one isn’t. It’s got a twenty-foot fence and a thirty-man rotating guard detail. And they’re armed.” Even in the dim light, Kat could see Gabrielle beginning to pout. “Which wouldn’t be a problem if you’d let me scale the cliffs.” “Wait.” Hamish eased forward. “Why do we have to do it this week? We let ol’ Maggie sell it, see? Then when it’s all safe and sound in its new home…” “There’s no way of knowing where it’s going,” Hale said. “It could end up underground.” “In the private collection of some warlord or weapons dealer,” was Gabrielle’s guess. Simon shook his head in frustration. “There are too many variables to account for the—” “They might not be crooks.” As soon as Kat blurted the words, she saw five sets of eyes turn to her, look at her like she was crazy. Only Nick seemed to understand. “Not everyone’s a bad guy,” he told them. “We wait and do this job later, and we might be the bad guys.” “This is our window. Now.” Kat stood back and paced. “We’ve got tomorrow morning…” Hale shook his head. “No time. No access.” “The auction at the palace?” “No good,” Simon said. “If we get over the walls”—he gave a considerate look at Gabrielle—“no exit.” “Okay.” Kat took a deep breath. “That leaves us with…” “The casino,” Hale said flatly. “You should tell someone, Kat.” Nick’s voice was cold but his eyes were warm. “My mom—” “If you want to go home to mommy, there’s the door.” Hale pointed over the side of the ship to the blue water and the long swim, but Nick ignored him. He looked at Kat and asked, “How many cameras on the casino floor?” “Sixty-two,” she said, without missing a beat. “How many entrances?” Nick went on. “Five public, three private, and four unofficial.” “Exits?” “Ten.” “Average time to the street?” “Two and a half minutes.” “Guards?” “At least twenty on the floor. Four on the emerald.” “No.” Nick was shaking his head. “Not even you can rob a casino, Kat.” “We’re not robbing a casino, new boy.” Hale pushed Nick aside. “We’re robbing at a casino,” Gabrielle said with a smug smile. “There’s a difference.” “Guys,” Kat snapped, needing everyone to stop and think. “You’re not listening. We can get the stone at the casino. But we can’t get it out. Not without an inside man.” “I thought that was my job,” Nick said. Hale scoffed. “We need someone inside we can trust.” “Yeah”—Nick nodded—“because I came all this way for revenge.” But Kat was already shaking her head. “We need someone she will trust.” “I can make her trust me,” Nick countered. Kat thought about Maggie—a woman who had been on the grift and on her own for nearly half a century. “I don’t think she’s trusted anyone in a very long time.”","sourceLink":"https://allnovel.net/uncommon-criminals-heist-society-2/page-25.html","bookId":2404,"book":{"id":2404,"title":"Uncommon Criminals (Heist Society #2)","description":"Storyline: Uncommon Criminals (Heist Society #2) Katarina Bishop has worn a lot of labels in her short life. Friend. Niece. Daughter. Thief. But for the last two months she’s simply been known as the girl who ran the crew that robbed the greatest museum in the world. That’s why Kat isn’t surprised when she’s asked to steal the infamous Cleopatra Emerald so it can be returned to its rightful owners. There are only three problems. First, the gem hasn’t been seen in public in thirty years. Second, since the fall of the Egyptian empire and the suicide of Cleopatra, no one who holds the emerald keeps it for long, and in Kat’s world, history almost always repeats itself. But it’s the third problem that makes Kat’s crew the most nervous and that is simply… the emerald is cursed. Kat might be in way over her head, but she’s not going down without a fight. After all she has her best friend—the gorgeous Hale—and the rest of her crew with her as they chase the Cleopatra around the globe, dodging curses, realizing that the same tricks and cons her family has used for centuries are useless this time. Which means, this time, Katarina Bishop is making up her own rules.","cover":"https://allnovel.net/images/uncommon-criminals-heist-society-2.jpg","author":"Ally Carter","type":"Mystery","source":"allnovel","link":"https://allnovel.net/uncommon-criminals-heist-society-2.html","creation":"Oct 5, 2019 8:58:41 AM","modification":"Oct 5, 2019 10:31:04 AM"}}
