{"id":74484,"no":29,"title":"Page 29","content":"“What’s wrong with you?” Hale asked. Kat’s arms seemed especially small in his strong grasp as he pulled her to a dark and quiet corner of the room.\\n\\n “I’m fine.”\\n\\n “Yeah.” He stepped closer. “That’s my point. This is serious, Kat.”\\n\\n “I know.”\\n\\n “This goes off the tracks and we might not get it back.”\\n\\n She looked at him. “What’s your point, Hale?”\\n\\n “So you got conned.…So you’re human.…” He ran a hand through his hair and took a step back. “So you’re mortal like the rest of us.” He looked away, then back again. “Is that so bad?”\\n\\n “What are you saying?”\\n\\n “I’m saying what I said in New York. We could go anywhere. We could do anything.” He brushed a stray piece of hair behind her ear. “We don’t have to do this.”\\n\\n It wasn’t often that Kat wished she could go back in time. The world didn’t work that way, after all. There was no such thing as a second chance. But even as Hale said the words, she knew they were true—they could board a jet and disappear, haul up anchor and be in Casablanca before anyone even knew that they were missing. She could never change the mistake she’d made before, but nothing said she had to make the same mistake again. And for a second, she felt herself teetering, fighting the urge to run.\\n\\n Run.\\n\\n To boarding school and Moscow and Rio.\\n\\n Run.\\n\\n To a snowy cabin at the top of the world.\\n\\n And right then, Kat knew it hadn’t begun with a lie in a diner in the rain—that the chase hadn’t lasted weeks—but decades. And the job that had started in Montreal had to end in Monte Carlo.\\n\\n “Hale,” Kat said, but before she could finish, Simon’s voice was in her ear, saying, “Kat, Maggie is moving into position. Kat, did you copy?”\\n\\n “Don’t worry.” She looked at Hale. “I hear you.”\\n\\n And then the lights went out.\\n\\n CHAPTER 35\\n\\n To say that Katarina Bishop was at home in the dark wouldn’t be entirely correct. She did not have sonar like a bat. Her eyes did not process light and shadow differently, like a cat’s. But if Hale was at home in his six-thousand-dollar tuxedo amid the trays of champagne and caviar, then Kat herself was perfectly at ease standing in the shadows of the ballroom, surrounded by jewels and wallets and other people’s money.\\n\\n Still, when the spotlights flickered on, bright beams slicing through the ballroom and onto the cases that stood empty and waiting on the small platform, Kat was like everybody else who stood waiting, needing to know what was about to happen.\\n\\n “Kat?” Simon whispered, the word echoing through her ear. “It’s time.”\\n\\n No one saw her say it. All of Monaco was too busy staring at those two cases and the man who stood between them, a microphone in his hand, looking out over the crowd, mentally counting his money.\\n\\n “Messieurs et mesdames, ladies and gentlemen,” Pierre LaFont addressed the crowd, “thank you so much for coming to celebrate with us tonight the greatest cultural find of the twenty-first century.” Polite applause filled the room. Only a single whoop echoed out, and Kat made a mental note to have a word with Hamish once this was all over.\\n\\n “I am very grateful to Monsieur Oliver Kelly for generously allowing us to share with you…” He paused for dramatic effect, and then swept his arms toward the case on his right and cried, “The Cleopatra Emerald!”\\n\\n There was no applause, only a faint but steady clicking sound so slight it would have disappeared entirely in any other moment, in any other room. The platform had stopped spinning, and yet the case itself seemed to move, hydraulics working, smoothly raising the green stone from the casino’s vaults below. There was a gasp in the crowd when it came to the surface, but the silence returned almost immediately in its wake.\\n\\n And the crowd stood—waiting.\\n\\n People are all the same, as every decent con man knows. They have the same needs. The same wants. Every person in that room wanted to touch history. To feel fame. To hold love—hold it in the palms of two hands.\\n\\n And that was why they stood in silence, watching, waiting for Pierre LaFont to say, “And now, ladies and gentlemen, I give to you for the first time in two thousand years, the Antony Emerald.”\\n\\n Again there was the whirling sound, the sight of something rising inside a protective case. But no one seemed to believe what they were seeing until the lights caught the second stone and the platform began to spin, sending the Cleopatra and the Antony on a turn around the ballroom.\\n\\n Only the small signs that hung on the two cases gave any clue that what the crowd was seeing wasn’t a mirror image, some elaborate mirage. The stones were identical. Perfect. Priceless and pristine.\\n\\n They’re here. They’re real. And they’re together, the whole room seemed to think.\\n\\n But not Kat. Kat stood silently in the center of the crowd, thinking, Charlie is a genius.\\n\\n As the emeralds turned, they seemed to catch the light, covering the casino in a kaleidoscope of green, and yet it was nothing compared to the look in Hale’s eyes as he stood across the crowded room, staring right at Kat.\\n\\n She felt like just another girl at the ball in that moment, just another person needing it to be real—a romance that had spanned two thousand years. A love that had overcome geography and class and time.\\n\\n She wanted to believe in that. She looked at Hale and knew he wanted it too.\\n\\n On the stage, LaFont was still speaking; the crowd was still staring. It was a moment that had been a millennium in the making, but it was also a moment built on a lie, and as badly as Kat wanted to believe it, she knew better than to trust the con.\\n\\n “Simon?” Kat asked.\\n\\n “We’re good,” he said though the small comms unit in her ear.\\n\\n “Hamish, what about you and Angus?”\\n\\n “We’re in position, love,” was Angus’s reply.\\n\\n “Gabrielle,” Kat said, “what about Kelly?”\\n\\n “Covered,” her cousin whispered.\\n\\n And then there were two, Kat thought. She felt Nick moving toward her, heard him say, “Kat, are you sure you want to do this?” But through the crowd, all she could see was Hale.\\n\\n “Now,” she said while, ten feet away, the emerald stood gleaming in its case. It was somehow smaller than Kat remembered. “We end this. Now.”\\n\\n CHAPTER 36\\n\\n The band still played. The food still flowed. But the room had taken on a different feel as Nick walked away from Kat and through the crowd. No one even noticed the young man with the too-big tuxedo who pushed against the current of people who were moving toward the glistening green stones in the spotlight.\\n\\n “Leave her alone.” Hale’s voice was rough and deep and didn’t at all match the cover he was wearing.\\n\\n “I think she knows what she wants,” Nick hissed, trying to avoid a scene.\\n\\n “It’s time you left her alone,” Hale said again, closing the distance between them, forcing Nick out into the hallway, away from the crowd and the jewels and the world on the other side of the door.\\n\\n “If you don’t like me, all you have to do is say so,” Nick said.\\n\\n “No, I don’t think I have to say anything.”\\n\\n There were footsteps in the hall behind them, but neither boy turned to look.\\n\\n “She’s a big girl,” Nick said.\\n\\n “She’s five-two.”\\n\\n “I wasn’t speaking—”\\n\\n “Maybe you don’t understand.” Hale stepped even closer. “Stay away from—”\\n\\n But Hale never finished, because his fist was suddenly flying through the air. It struck Nick on the jaw, and sent the smaller boy spinning, the sound echoing in the empty hallway.\\n\\n No. Wait, the two of them seemed to realize.\\n\\n Almost empty hallway.\\n\\n In the next instant, Pierre LaFont was upon them, two guards at his side. “Stop this!” LaFont yelled. “Stop…Mr. Knightsbury?” LaFont’s eyes went wide as he pulled Hale off of Nick.\\n\\n “Ha!” Nick laughed, but the sound was pure hatred. He struggled to his feet, clawing at LaFont to get closer to Hale.\\n\\n “Stay out of this!” Hale shouted at LaFont.\\n\\n “Quiet, you two,” LaFont said, looking from the two of them to the social event of the year that was under way just through the open doors. “In here!” LaFont motioned at the guards, who grabbed Nick and Hale and pulled them into a small room normally reserved for high-stakes card games and VIP parties.\\n\\n Hale walked to the far side of the room, while Nick paced by the door.\\n\\n “You!” LaFont wiped his brow. “I’m shocked at you, Mr.\\n\\n Knightsbury. Where is Monsieur Kelly?” he asked one of the guards. “Find him. Bring him here.”\\n\\n “Oh,” Hale said slowly. “I think he’s probably busy.”\\n\\n “Well,” LaFont huffed, “make no mistake, I will be reporting this to your superiors.”\\n\\n Hale flexed his hand as if it still hurt. But Nick just laughed. “Yeah. You go ahead and do that.”\\n\\n Hale jerked again, but the guards lunged forward, keeping him away from Nick.\\n\\n “LaFont!” The woman’s voice rang out just as the doors flew open and Hale skidded to a halt. Maggie’s eyes were wild, and her gaze was locked on the man at the front of the room. “Where have you…”\\n\\n And then she stopped. She turned slowly, looking from Nick’s swelling lips to the guards, and finally her gaze came to rest on Hale, who stood struggling against their grasp.\\n\\n A knowing look filled her eyes when she said, “Well, well. What do we have here?”\\n\\n LaFont rushed forward. “Oh, madame, please return to the party. As you can see, our security has this little skirmish well in hand.”\\n\\n “I’ll be the judge of that, Pierre.”\\n\\n “Of course, but as you can see, Monsieur Knightsbury has had an altercation with this young man regarding…” LaFont trailed off. “Why were you fighting?” he asked.\\n\\n “Oh.” Nick wiped his mouth. Blood stained the white sleeve. “Just some girl.”\\n\\n “You.” Maggie pointed at one of the guards. “Take them both outside. Now.”\\n\\n Maggie’s face stayed frozen, her posture perfectly even as the young man dove in front of her, almost knocking her off her feet as he clawed at Hale. Guards lunged for him in return, but when they finally separated the two, the whole room stood still and silent.\\n\\n “Now!” Maggie hissed.\\n\\n “Find Mr. Kelly,” LaFont told one of the guards who had appeared in Maggie’s wake. He gestured to another guard and then to Nick. “And see these young men outside.”\\n\\n When the guard reached for Nick, he jerked away.\\n\\n “You really can have her,” Nick said, wiping his sleeve across his mouth again. He stared down at the blood and closed the door behind him.\\n\\n In the silence that came next, no one seemed to know what to do.\\n\\n LaFont walked to Maggie, placed a hand on her shoulder as if she were someone who needed comfort and protection in times of great distress. But there was an entirely different sort of look in Maggie’s eyes as she glared at Hale. Part fear, part worry, part outrage and disbelief. \\n\\n","sourceLink":"https://allnovel.net/uncommon-criminals-heist-society-2/page-29.html","bookId":2404,"book":{"id":2404,"title":"Uncommon Criminals (Heist Society #2)","description":"Storyline: Uncommon Criminals (Heist Society #2) \\n Katarina Bishop has worn a lot of labels in her short life. Friend. Niece. Daughter. Thief. But for the last two months she’s simply been known as the girl who ran the crew that robbed the greatest museum in the world. That’s why Kat isn’t surprised when she’s asked to steal the infamous Cleopatra Emerald so it can be returned to its rightful owners. \\n There are only three problems. First, the gem hasn’t been seen in public in thirty years. Second, since the fall of the Egyptian empire and the suicide of Cleopatra, no one who holds the emerald keeps it for long, and in Kat’s world, history almost always repeats itself. But it’s the third problem that makes Kat’s crew the most nervous and that is simply… the emerald is cursed. \\n Kat might be in way over her head, but she’s not going down without a fight. After all she has her best friend—the gorgeous Hale—and the rest of her crew with her as they chase the Cleopatra around the globe, dodging curses, realizing that the same tricks and cons her family has used for centuries are useless this time. \\n Which means, this time, Katarina Bishop is making up her own rules.\\n","cover":"https://allnovel.net/images/uncommon-criminals-heist-society-2.jpg","author":"Ally Carter","type":"Mystery","source":"allnovel","link":"https://allnovel.net/uncommon-criminals-heist-society-2.html","creation":"Oct 5, 2019 8:58:41 AM","modification":"Oct 5, 2019 10:31:04 AM"}}
