{"id":30370,"no":11,"title":"CHAPTER X. PRISONERS.","content":"For two or three minutes after the door was shut and bolted not a word was spoken by the three boys. All were sorely bruised, and bleeding from many cuts and wounds, and breathless and exhausted by the way in which they had been carried along and[100] the force with which they had been thrown down. Jack was the first to speak. \"I say, how are you both—are either of you badly hurt?\" \"I don\u0027t know yet,\" Tucker replied. \"It seems to me there is nothing left of me. I am sore and smarting all over. How are you, Arthur?\" \"I don\u0027t know,\" Arthur said. \"I wonder that I am alive at all, but I don\u0027t know that I am really much hurt.\" \"Well, let us try and see,\" Jack said. \"See!\" Jim repeated scornfully. \"Why, I can\u0027t see my own hand.\" \"Well, I mean let us find out if we can stand up and move about. We shall find out, anyhow, whether any of our bones are broken.\" With some difficulty and with many exclamations of pain the lads rose to their feet. \"Are both you fellows up?\" Jim asked. \"Yes.\" \"Well, then, we can\u0027t be very bad, anyhow. My arms are very stiff, and it seems to me that my jacket is soaked with blood, but where it comes from I do not know. I feel as if my head and face were one mass of cuts and bruises.\" \"That is just how I feel, Jim,\" Arthur replied, and Jack agreed. \"Well, this is the rummest affair!\" Jim said more cheerfully, now it seemed that none of them had sustained any very serious injury. \"There were we a few hours ago eating ices and enjoying ourselves stunningly; then this frightful row took place (what it was all about I have not the least idea), and just as[101] it seemed all up with us the fellow this place belongs to (at least I suppose it belongs to him) steps in and saves us, and then we are dragged up here and chucked into this hole.\" \"It seems like a dream,\" Arthur said. \"It is a good deal too real to be a dream, it is a mighty unpleasant reality. Well, I wish there was a little daylight so that we could see what has happened to us and tie ourselves up a bit; as it is, there is nothing to do but to lie down again and try to get off to sleep. I say, won\u0027t there be a row after this, when they get to know at home what has taken place. I wonder what they are going to do with us in the morning? Do you think they mean to kill us, Jack?\" \"No, I should not think there was a chance of that. This fellow would not have taken us out of the hands of the mob just for the pleasure of cutting our throats privately. Still the rough way we were carried along and thrown down here does not look as if he did it from any feeling of kindness,\" Jack remarked. \"No, I do not suppose he did it from kindness, Jack; anyhow, it does not look like it. Well there is no use halloing about that now, let us try and get a sleep. My head feels as if it was swollen up as big as a four-gallon keg.\" Accustomed not unfrequently to get a nap when on watch under the lee of the bulwark, the hardness of the ground did not trouble the boys, and before many minutes they were all asleep.—Jack and Tucker were awakened by a shout from Arthur. \"Watch on deck!\"[102] They started into a sitting position and looked round. A ray of sunlight was streaming in through an opening some six inches square, high up on the wall. \"Well, we are objects!\" Jim said, looking at his two companions. They were indeed; their faces were bruised and stained with blood, their hair matted together. Arthur\u0027s right eye was completely closed, and there was a huge swelling from a jagged bruise over the eyebrow. Jack had received a clear cut almost across the forehead, from which the blood was still oozing. Jim\u0027s face was swollen and bruised all over, and one of his ears was cut nearly off. He was inclined to bear his injuries philosophically until Jack told him that half of his ear was gone. This put him into a furious rage, and he vowed vengeance against the whole of the Egyptian race. \"Fancy going about all one\u0027s life with half an ear. Why, every boy in the street will point at it, and one will be a regular laughing-stock. You fellows\u0027 wounds are nothing to that.\" \"You will have to wear your hair long, Jim; it won\u0027t be noticed much if you do.\" \"Don\u0027t tell me,\" Jim replied. \"I tell you I shall be a regular sight wherever I go. I shall have fellows asking me what has happened to me. Now, had it been an arm, chaps would have been sorry for me; but who is going to pity a man for losing half an ear?\" \"I don\u0027t think I would mind giving half an ear just at present for a good drink and a bucket of water to wash in.\" \"Nor would I,\" Arthur agreed.[103] \"That is all very well,\" Jim grumbled. \"I have lost half an ear and haven\u0027t got any water to drink.\" \"Well,\" Jack said, \"I suppose they do not mean to starve us anyhow, so no doubt they will bring us something before long.\" Little more was said. Their tongues were swollen, their mouths parched, they still felt dizzy and stupid from the blows they had received; so they sat down and waited. The room they were in was apparently an underground cellar, generally used as a store-room. It was about twelve feet square, and the only light was that obtained through the little opening in the wall. Jack thought as he looked at it that if one of them stood on another\u0027s shoulders he could look out and see where they were. But as that mattered nothing at present, and they were not in the mood for any exertion, he held his tongue. In about an hour a footstep was heard descending some stairs, then bolts were undone, and two Egyptians with swords and pistols in their girdles entered. They brought with them some bread and a jar of water. Jack jumped up. \"Look here,\" he said, \"that is all right enough to eat and drink, but we want some water to wash with. Wash, you understand?\" he went on as the men looked at him evidently without comprehending. \"Wash, you see,—like this;\" and he went through a pantomime of washing his hands and slushing his head and face. The Egyptians grinned and nodded; they said a word to each other and then retired. \"I believe it is all right,\" Jack said, \"and that they are going to bring some.\" A long draught of water from the jar did them an[104] immense deal of good, but none had at present any inclination to eat. Presently the steps were heard coming down the stairs again, and the men entered, bringing in a large pan made of red earthenware, and containing three or four gallons of water. \"Good men!\" Jim exclaimed enthusiastically; \"I will spare your lives for this when I slay the rest of your countrymen,\" and he shook the Egyptians warmly by the hand. \"I have nothing to give you,\" he went on, \"for they turned our pockets inside out; but I owe you one, and will pay you if I ever get a chance. Now, lads, this is glorious!\" For half an hour the three boys knelt round the pan, bathing their faces and heads. Then they stripped to the waist, and after a general wash tore strips off their shirts and bandaged the various cuts they had received on the head, shoulders, and arms. In no case were these serious, although they were deep enough to be painful. \"It\u0027s nothing short of a miracle,\" Jack said, \"that we have got off so easily. If the beggars had not been in such a hurry to get at us that they got into each other\u0027s way they would have done for us to a certainty; but they were all slashing away together, and not one could get a fair drive at us. Well, I feel about five hundred per cent. better now. Let us get on our things again and have breakfast. I feel as if I could tuck into that bread now.\" Just as they had got on their clothes the door again opened, and a gigantic negro entered. He carried with him a wooden box of the shape of a bandbox. He opened this and took out a melon and three large bunches of grapes, laid them down on[105] the ground without a word, nodded, and went out again. \"My eye, this is first-rate,\" Jim said in delight. \"Well, you see, it is not going to be so bad after all. That chap who brought us up here is evidently friendly, though why he should have sent us the fruit by itself instead of with the bread and water I do not know. However, never mind that now; let us set to.\" The boys enjoyed their breakfast immensely. They first ate the grapes; when these were finished they looked longingly at the melon, which was a very large one. \"How on earth are we to tackle that?\" Jim asked. \"Our knives have gone with our other things.\" \"Perhaps we can find something to cut it up,\" Jack said, getting up and turning over the litter on the floor with his foot. For two or three minutes he searched about. \"Hurrah!\" he exclaimed at last, \"here is a bit of old hoop-iron that will do first-rate. It is not stiff enough to cut with, but I think we can saw with it, if one takes hold of each end.\" Without much difficulty the melon was cut into three parts, and devoured to the rind. Breakfast over they had time to consider their situation again. \"I expect,\" Jack said, \"this pasha or whatever he is who has got us here is waiting to see how things go. If the Egyptians get the best of it he will hand us over to Arabi, or whoever comes to be their chief. If we get the best of it he will give us up, and say that he has saved our lives. That would account, you see, for this breakfast business. He only sent us bread and water by his Egyptian fellows, and he sent[106] us the fruit privately by that black slave of his, whom he can rely upon to hold his tongue.\" \"I should not be surprised if that was it, Jack. That makes it look hopeful for us, for there is no doubt in the world who will get the best of it in the end. We may not thrash the beggars for a time. Alexandria is a big place, and there are a lot of troops here, and they can bring any number more down from Cairo by rail. The crews of the ships of war here are nothing like strong enough to land and do the whole business at once; besides, they have no end of forts and batteries. I expect it will be some time before they can bring ships and troops from England to capture this place.\" \"But there are the Italians and French,\" Arthur said. \"They are just as much interested in the matter as we are, for I expect there were a good many more Italians and French killed yesterday than there were English.\" \"Ten to one, I should think,\" Jim agreed. \"I don\u0027t think there are many English here, except the big merchants and bankers and that sort of thing, while all the small shops seem to have either French, Italian, or Greek names over the door. Well, if it is going on like this, we can afford to wait for a bit.\" \"Look here, Arthur,\" Jack said, \"I will stand under that opening, and you get on my shoulders and look out. I don\u0027t suppose you will see much, but one likes to know where one is and which way one is looking. We know we are somewhere on the high ground beside the town. We must be looking somewhere north-east by the way that gleam of sunlight comes in. Very likely you can get a glimpse[107] of the sea.\" Jack placed himself against the wall, and Jim helped Arthur on to his shoulders. \"Yes, I can see the sea,\" Arthur said as soon as his head reached the level of the loop-hole. \"I can see the outer harbour, and several ships lying there and boats rowing about.\" \"Well, that is something anyhow,\" Jim said as Arthur leapt down again. \"We shall be able to see any men-of-war that come in, and form some idea as to what is going on. How thick is the wall?\" Jim went on. \"I should say quite a couple of feet thick. I could only see a small patch of the water through it.\" \"Then I am afraid there is no chance of our working our way out,\" Jim said. \"The only way of escape I can see would be to spring on those two fellows who bring our food. We are stronger than they are, I am sure, and we might master them.\" \"I don\u0027t expect we could do it without noise,\" Jack said. \"Besides, they have got pistols, and we certainly could not master them without their being able to shout. We might manage one easy enough, if one sprang on him and held his arms and prevented him getting his pistol, and another clapped his hands over his mouth; but the three of us could not manage two silently. Besides, I should not like to hurt them after their bringing us that water to wash in.\" \"No; we certainly couldn\u0027t do that,\" the other boys agreed. \"Besides,\" Jack went on, \"we do not know where this staircase leads. But no doubt it goes up into the house, and when we got to the top someone[108] would see us at once; and even if we broke through there would be such a chase we should never get away, and anyhow could not pass through the town down to the port and steal a boat. No, Jim, I don\u0027t think it is the least use in the world trying to escape that way. If we could dig through the wall and make our way out at night, and get quietly down among the sand-hills by the shore, we might manage to get hold of a boat and row out to the ships; but I do not see that there is any chance of our being able to do that when we haven\u0027t got as much as a knife among us.\" Jim examined the walls. \"There would not be much difficulty in working through them if we had a couple of good knives, they are made of sun-dried bricks. However, we will hunt about among this rubbish and see if we can find some more bits of iron. Anyhow, we can wait a day or two before we make up our minds about it and see what comes of it. I vote we clear up this litter a bit, and chuck it out through the opening. There is a close, musty smell in the place. The opening will be very handy for chucking everything out and keeping the place as clean as we can.\" \"Yes, Jim; but the rubbish will be very useful to us if we decide to try to cut our way out, as we can put a lot of brick-dust and stuff under it. It would not do to throw that out of the window, for it would be seen at once by anyone passing.\" \"Yes; you are right there, Jack. Well then, we have nothing to do but to take it as easy as we can.\" The closest search through the rubbish did not bring to light any other piece of iron, and the bit[109] they had used as a knife was so thin and rusted as to be altogether useless for the purpose for which they required it. The days passed slowly. The two Egyptians brought bread and water regularly, and the Nubian as regularly additions to their meal—sometimes fruit, sometimes a dish of meat. Three bundles of maize straw were brought down the first evening to serve as beds for them, and on the following morning three or four men came down and swept up all the rubbish from the floor. Once every two days they were taken out under a guard of three men with swords and muskets, and allowed to sit down in the sun, with their backs against the wall, for an hour or two. The shipping still lay in the harbour, over which they commanded a good view; and after a few days they saw that several more vessels of war had entered it. \"I can see that the boats are going backwards and forwards to the shore,\" Jim said, \"so there is no regular war begun yet.\" \"Look, Jim, over there to the right,\" Jack said. \"There is a swarm of men at work. I believe they must be getting up a fresh battery there. That looks as if the Egyptians had made up their minds to fight.\" \"So much the worse, Jack. I don\u0027t mind how much they fight when we are out of their hands (we know what will come of that when it begins), but if they fight while we are here it may turn out bad for us, whichever way it goes.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3175/87064.html","bookId":859,"book":{"id":859,"title":"A Chapter of Adventures","description":"简介： Of the tens of thousands of excursionists who every summer travel down by rail to Southend, there are few indeed who stop at Leigh, or who, once at Southend, take the trouble to walk three miles along the shore to the fishing village. It may be doubt...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3175","creation":"Aug 1, 2019 12:23:37 AM","modification":"Aug 1, 2019 12:23:37 AM"}}
