{"id":78712,"no":102,"title":"Page 102","content":"He wasn’t saying he wanted kids as much as he was saying he wanted kids with me.\n I mean, he wanted kids, but he was saying he wanted kids with me.\n Cabe “Hawk” Delgado wanted kids with me!\n Yay!\n Oh shit. I was going to start crying and ruin my makeup.\n “It’s important to me, baby,” he said softly.\n I swallowed. Then I asked, “How many do you want?”\n “Two or three.”\n “Boys or girls?”\n “Don’t care.”\n I didn’t either. I didn’t care. I didn’t care at all.\n My vision went blurry as my mind filled with Hawk holding our child and feeding it a bottle.\n Then my belly got squishy.\n Then I felt his knuckles glide down my cheek and I refocused when he said quietly, “I’d be happy with one, Gwen.”\n “Only children can get spoiled. You have to have at least two. Siblings are important. And if we start with two boys, we have to have a girl because brothers should have a sister. But if we start with two girls, we have to go for a boy because sisters should have a brother. I always wanted a brother. A son of my father would have been able to beat the shit out of boyfriends that broke my heart. I wouldn’t have had to resort to cookie dough and it would have saved Scott a lot of money in divorce attorneys, seeing as he’d still be in a coma.”\n I stopped talking and felt it. The air in the Camaro had turned electric.\n “You sayin’ that for me or do you want kids?” he asked.\n “Both,” I answered.\n Suddenly my seatbelt was undone and zipped back so fast I cried out in surprise. Then Hawk’s did. Then I was plucked right out of my seat and wedged between him and the steering wheel, my ass in his lap, his hand in my hair, his other arm around me and his mouth hot and heavy on mine delivering a very wet, very heated kiss that included some hand action when his started to roam.\n He released my mouth but kept me wedged and I blinked as he spoke.\n “They offer higher, I’ll accept.”\n “Okay,” I breathed.\n “You got a problem with me movin’ into your place?”\n “No,” I replied instantly, my heart beating, my belly squishy, my mind spinning cartwheels of joy.\n “All right,” he whispered.\n “You sure you don’t need space anymore?”\n “That kind of space means, you’re there, you need to go somewhere, anywhere you go is far away from me so, yeah, I don’t need that space anymore.”\n Oh my God.\n I knew what he was saying. I knew what he meant and I lifted my hand to his jaw.\n “You’re in deep with me, aren’t you, baby?” I whispered my question just to confirm.\n “Drowning,” he whispered back.\n Oh my God. He felt the same as me!\n “I love you, Cabe.”\n The minute I said it, he curled me into him so we were pressed together and his face was in my neck.\n “Love you too, Sweet Pea.”\n He loved me.\n Thank God, he loved me.\n I relaxed against him but slid my hand from his jaw to the back of his neck.\n “Yay,” I whispered in his ear and felt him smile against my neck.\n Then he kissed me there, his head moved slightly, his tongue touched the skin behind my ear then his head moved again and he kissed my lips lightly, once, twice, again before he nipped my lip and then unwedged me and deposited me in my seat.\n He rebuckled, I followed suit and then I took a moment to feel my joy.\n Then I grabbed my clutch from the floor, opened the clip, pulled out my lip gloss and flipped down the visor, muttering, “Twice tonight you’ve ruined my lip gloss and we’re not even at the restaurant.”\n He pulled into traffic muttering back, “Babe.”\n Meredith celebrated her and Dad’s anniversary like it was a national holiday. She didn’t focus on the special ones, she had a party every year.\n When I was a kid, and money wasn’t as plentiful, if the anniversary fell on a weekday, Meredith took the day off to cook and had friends and family over for a huge, buffet extravaganza. After Ginger and I left the house and things got more comfortable, these celebrations moved to a variety of locales in Denver.\n Tonight’s was at McCormick’s Fish House and Bar at the Oxford Hotel. Fantastic seafood and steaks, elegant but still Old West Denver atmosphere, great bar and just a short walk away was Oxford’s Cruise Room, arguably the coolest bar in Denver due to its art deco décor and the talent the bartenders had with a martini shaker.\n Hawk and I walked, arms around each other, into the private room and saw the gang was all there.\n Since Meredith adopted all my friends, Tracy was in attendance although I didn’t see one of her jerky boyfriends with her. I couldn’t spy Cam and Leo but I knew they had to be there somewhere. Elvira was also there. And so were Gus and Maria, Jury, with a lush, gorgeous Mexican-American woman wearing a fabulous red and black dress and Von and his wife Lucia.\n And I saw straight away Troy and his whiny girlfriend, Hanna were there.\n The past four months had not been good between Troy and I. He was not pleased that Hawk and I became us again and he told me so, giving dire warnings that if it happened once, it would happen again. I figured Troy was just trying to be a friend, he and I were solid deep down and he’d get over this.\n He hadn’t.\n We saw each other, mostly him coming over. But, when he came over once and Hawk was there, he left immediately and made no bones about why he was doing it. From that point on, he called before coming to be certain Hawk wasn’t there or intending to be there. I gave him these assurances, even though this annoyed me. Sure, what Hawk said to him was harsh but weeks were sliding into months, Troy had to see Hawk was making me happy and if he gave Hawk a chance, like everyone else was, he’d see Hawk was a good guy. And, bottom line, if he was a true friend, he’d get over it, for me.\n I mean, I put up with Hanna with not a word and she was whiny and annoying and I wasn’t the only one who thought so.\n Unfortunately during one of the times I assured him Hawk wasn’t coming over, Hawk had surprised me by showing. Even after Troy had just opened a beer, he left it unsipped, glared at Hawk, told me he’d see me later and left.\n What surprised me about this was more than Troy’s behavior. It was Hawk’s. Hawk was like Camille. If he had something to say, he’d say it. He was straight and could be gentle, but he didn’t hesitate communicating what was on his mind. But he left me to deal with Troy without a word or comment. I thought this said a lot, mostly that Hawk knew Troy meant something to me and he wasn’t going to try to sway me either way, just let it play out and he’d be there at the end. But it wouldn’t be an end where, if Troy and I sorted things out, Hawk had said something about a friend I cared about that he couldn’t take back. \n","sourceLink":"https://allnovel.net/mystery-man-dream-man-1/page-102.html","bookId":1850,"book":{"id":1850,"title":"Mystery Man (Dream Man #1)","description":"Storyline: \n Night time is the right time... \n Gwendolyn Kidd has met the man of her dreams. He\u0027s hot, he\u0027s sexy, and what started as a no-names-exchanged night of passion has blossomed into a year and a half-long pleasure fest. Sure, it\u0027s a little strange that he only appears in her bed at night, but Gwen is so sure he\u0027s the one, she just can\u0027t turn him away... \n Hawk Delgado knows more about Gwen than she could ever imagine. She\u0027s gorgeous, headstrong, and skittish about relationships. But Hawk is facing his own demons, demons that keep him from connecting with anyone. Yet when Gwen is drawn into Denver\u0027s lethal underground scene, Hawk\u0027s protective nature comes out full force. The problem is, when Gwen gets a dose of Hawk\u0027s Alpha attitude in the daylight, she\u0027s not so sure he\u0027s the one anymore...\n \n","cover":"https://allnovel.net/images/mystery-man-dream-man-1.jpg","author":"Kristen Ashley","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/mystery-man-dream-man-1.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:07:19 PM"}}
