{"id":78652,"no":41,"title":"Page 41","content":"So I sat on the couch and texted Cam and Tracy about the date and received ecstatic texts back from Trace and cautionary texts back from Cam which mostly consisted of her begging me not to imbibe even a drop more alcohol.\\n\\n Hawk said it wouldn’t take very long but he was wrong. So since it took a long time, I had six Tamayopolitans, my belly was full and I’d had two interrupted nights of sleep during which there were intervals of high emotion including break-ins and firebombs, I eventually passed out on his couch.\\n\\n I woke up to Hawk lifting me in his arms.\\n\\n “I can walk,” I mumbled.\\n\\n “Yeah?” he asked then suggested, “How ‘bout you do that on level ground when you’re in those heels.”\\n\\n He wanted to carry me? Okay, I was all right with that.\\n\\n I shoved my forehead in his neck and wrapped one arm around his shoulder, the other around his neck and muttered, “’Kay.”\\n\\n He walked me down the steps by the console workstations but even when we got to level ground, he didn’t put me down until we were outside the elevator. When he did, I leaned heavily into him.\\n\\n “Tired?” he asked.\\n\\n “Six Tamayopolitans,” I explained but I kind of slurred the word “Tamayopolitans” mainly because I was sleepy but also because I was still a little drunk.\\n\\n He chuckled and pulled me closer.\\n\\n When we were inside the elevator and I was again pressed into him, I noted, “Your briefing lasted a long time.”\\n\\n “Reports from the field, things changed, we needed to abort mission, regroup and re-engage.”\\n\\n This was all scary language my mind refused to process so I lifted my face from his pectoral and tipped my head back to look at him. “Let me guess, I don’t want to know?”\\n\\n He grinned down at me. “No, you don’t want to know.”\\n\\n “You’re grinning,” I observed. “Does that mean there were no casualties?”\\n\\n “Not the good guys,” he replied.\\n\\n Again, scary. Again, mind refused to process. Though, good news.\\n\\n I planted my cheek in his pectoral again and mumbled, “Good to know.”\\n\\n He gave me a squeeze. Then he guided me out of the elevator and into the Camaro. Then I fell asleep again.\\n\\n The last part of the evening was when I woke up because the Camaro had quit purring. He had parked. He helped me out of the car, through a door and I knew one thing. I wasn’t home. I knew something else. I didn’t care. I just wanted to sleep.\\n\\n So I muttered, “Bed.”\\n\\n “Gotcha, Sweet Pea.”\\n\\n Hawk helped me stumble up some stairs that made a lot of noise and I was curious to look around, I just didn’t have the energy. I spied a bed, I groped my way to it, divested myself of little black dress and awesome shoes and face planted in it.\\n\\n Now it was morning.\\n\\n Shit.\\n\\n I pushed up on a hand and shoved my hair out of my face.\\n\\n Then I stared.\\n\\n I was in humungous bed in a cavernous building and when I say cavernous I mean cavernous. It had to be a warehouse at one point. I could see daylight pouring in from enormous windows that went from floor to at least three stories up. I could also see there was a dusting of snow sometime in the night. And I could see that the warehouse was in the middle of nowhere, frosted scrub all around, a large creek or small river running close to the building. Further I could see I was on a platform that had an iron railing that was not decorative in the slightest but industrial.\\n\\n I looked down the foot of the bed and saw a wide expanse of plank floors and at the end, a big cube made of glass block, the door to it opened, a bathroom.\\n\\n My first stop.\\n\\n My eyes moved to the floor and I saw my dress and Jimmy Choos tangled with Hawk’s jeans, shirt and boots. Something about that I liked, something about that made my belly squishy.\\n\\n Oh boy, I was in trouble.\\n\\n I held the covers up to my br**sts, shifted to the side of the bed and dropped my torso down, reaching out. I decided against my dress and grabbed his shirt. Then I lifted up and shrugged it on while in bed. Then I threw the covers back and held it closed with my hand as I got out and wandered to the bathroom, half-dazed from still being sleepy and having a good, relaxing night and half-dazed because I was in Hawk’s lair.\\n\\n The bathroom was nice, clean, tidy, if utilitarian. No personal touches there either like there weren’t any in the bed area. Just thick, soft midnight blue and dark gray towels on the railings and folded and stacked on shelves over the toilet. The midnight blue and dark gray was a theme, the sheets and comforter were the same colors.\\n\\n I used the facilities and then washed my hands. Then I looked in the medicine cabinet because you pretty much were thrown out of the girl club if you didn’t snoop at least in the medicine cabinet. I’d given his desk a pass; I had to look in the medicine cabinet.\\n\\n Toothpaste. Deodorant. Floss. Shave cream. Razors. Two extra toothbrushes. That was it.\\n\\n I opened a toothbrush and went to town on my teeth. If he was upset I used a toothbrush I’d buy him a new one. I couldn’t afford Jimmy Choos or workmen who would make my living room habitable but I could afford a toothbrush.\\n\\n I rinsed, flossed and wiped my hands. Then I did a few buttons up on his shirt and folded back the long sleeves. Then I walked out.\\n\\n When I did, I was feeling nervous. This was different. This wasn’t what we had. This wasn’t f**k buddies or us fighting all the time. We’d had a date. He’d given me shoes. He’d carried me from a burning building. My father didn’t mind walking in to see us in a carnal clinch. Meredith thought he was the bomb. I knew where he worked. I’d met some of his men. What I said at dinner with my parents was important to him.\\n\\n Now I was in his lair.\\n\\n My mind rifled through this information and then some as I walked to the stairs and walked down them slowly, spotting him in the kitchen but not looking at him. I was taking in the cavernous space. A seating area in the middle with a big, wide couch, two recliners on either side, a big flatscreen TV all on a thick rug. Weight and exercise equipment down the opposite wall, a lot of it: weight bench, bars of weights, treadmill, stationary bike, rowing machine, elliptical machine. A desk in the far corner at a diagonal, facing the room, this showing personality, papers and files and a laptop on it, he used that desk and it showed, not like the rest of his place. A kitchen that was a big horseshoe bar with stools around it, another countertop against a column of brick wall between gigantic windows, top of the line appliances. In between all of this there were some big rugs on the cement floor but mostly it was just open. Wide open. \\n\\n","sourceLink":"https://allnovel.net/mystery-man-dream-man-1/page-41.html","bookId":1850,"book":{"id":1850,"title":"Mystery Man (Dream Man #1)","description":"Storyline: Night time is the right time... \\n Gwendolyn Kidd has met the man of her dreams. He\u0027s hot, he\u0027s sexy, and what started as a no-names-exchanged night of passion has blossomed into a year and a half-long pleasure fest. Sure, it\u0027s a little strange that he only appears in her bed at night, but Gwen is so sure he\u0027s the one, she just can\u0027t turn him away... \\n Hawk Delgado knows more about Gwen than she could ever imagine. She\u0027s gorgeous, headstrong, and skittish about relationships. But Hawk is facing his own demons, demons that keep him from connecting with anyone. Yet when Gwen is drawn into Denver\u0027s lethal underground scene, Hawk\u0027s protective nature comes out full force. The problem is, when Gwen gets a dose of Hawk\u0027s Alpha attitude in the daylight, she\u0027s not so sure he\u0027s the one anymore...\\n","cover":"https://allnovel.net/images/mystery-man-dream-man-1.jpg","author":"Kristen Ashley","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/mystery-man-dream-man-1.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:07:19 PM"}}
