{"id":78683,"no":72,"title":"Page 72","content":"I bit my lip and looked at Tracy. “Is this gonna be a creatively concealed line item?” Hawk asked as he leaned forward and grabbed some stranded grapes, his head tipping to the decimated food boards. “I’ve set up Gwen as her own cost center,” Elvira replied, unruffled. My eyes got big. “Probably a good idea,” Hawk muttered, leaning back. I gulped but Tracy put her drink aside so she could sit on her hands in order not to clap them in glee. I looked at Hawk. “Would you like a proper meal?” “Will you display symptoms of post-traumatic stress after you’re forced to steam vegetables and spoon out cottage cheese?” he asked back. I felt my eyebrows go up. “Is that what you want for dinner?” “Yeah,” he answered. “Then yeah, probably. Will my cost center include visits to the psychologist?” He grinned just as his arm curved fast and tight, pulling me into him. My cosmo arm shot out to avoid collision as my chest hit his chest, his hand slid up into my hair to cup my head, he tilted it and my mouth hit his. The kiss was short but any kiss from Hawk was sweet. Though some were sweeter. When he let me back an inch, he said, “Babe,” through a smile. “I thought you told me you were going to kiss me if I made you laugh.” “I did.” “I didn’t make you laugh,” I pointed out. “No, but I’m gonna kiss you when you make me wanna laugh too.” “So, I don’t even get any verbal warning?” His hand slid down to my neck. “Those are the breaks, Sweet Pea.” “Sweet Pea,” Tracy breathed and suddenly I remembered I had an audience. I pulled away and sat back, scanning the posse. Tracy was smiling flat out, in twilight, la-la land of happiness, firm in the knowledge she’d always been right. Elvira was grinning into her martini glass but still likely lamenting the fact that the commandos wouldn’t be receptive to the hot gossip she had to share. Cam was swirling the dregs of her cosmo in the bottom of her glass, eyes openly assessing on Hawk, not wanting to let go of a year and a half of thinking Hawk was a motherfucking ass**le but, I could tell, she was getting swayed. “I need to steam vegetables,” I declared. “Does anyone want steamed vegetables?” “Not for me,” Tracy answered. “I gotta be gettin’ home,” Elvira said, sucking back the last of her cosmo. “Me too, early shift,” Cam put in. Hawk reached out and confiscated my glass again when Tracy added, “If Cam’s going, I’m going. She’s my ride.” Hawk took a sip then aimed his eyes at Tracy. “You wanna hang with Gwen, I’ll take you home.” “You will?” Tracy asked, eyes big, an offer of a ride home further endorsement that she was right never to give up hope. “Sure,” Hawk answered. Her eyes darted back and forth between Hawk and me before she said, “I’d like to stay.” “Then stay,” Hawk returned, handed me my drink and leaned forward again to nab the last of the apple slices. The girl posse mobilized. Tracy and I said good-bye to Cam and Elvira at the door, me assuring them I had clean up covered. When they called their adieus, Hawk’s farewell was a jerk of the chin from his position standing in the opened fridge. After they left, Tracy and I went to the kitchen, Hawk went to his desk, flipped up his laptop and I saw the screen illuminate his face before he turned on the desk lamp. Tracy tidied while I steamed veggies and spooned out cottage cheese. Hawk approached when I was dumping veggies on the plate and Tracy was shaking another batch of cosmos. We retired to the seating area, Tracy back to her recliner, Hawk in his corner, me pressed to his side while he ate. With Tracy, Hawk wasn’t like he was with me during our date. He conversed. He was at ease, sometimes funny, not exactly open but not deliberately closed and, if it could believed, often charming. Hmm. By the time Hawk excused himself to put his plate in the dishwasher and go back to his laptop, Tracy was practically shimmering with joy and this only had a little to do with the fact she’d drunk three cosmos. She and I chatted and giggled (mostly giggled) and finally Hawk took her home. When they were gone, I finished up tidying, got ready for bed, climbed in and was about to nod off when I heard the garage door open. It wasn’t long after when the lights went out one by one through Hawk’s lair, I heard him moving around the bed platform, I felt his warm hand on the small of my back then his weight hit the bed. I rolled into him before he could curl into my back. His arm wrapped around me. “So, what’s the verdict?” he asked into the dark, totally knowing why the girls were there that night. “Apparently, I’m Queen Crash and Burn,” I answered. “Come again?” “Leo calls me Queen Crash and Burn. I flirt then I leave them hanging.” “Babe,” was his reply. “It didn’t occur to me but I guess I do this.” “My boys call you Mistress Blueballs.” My body got tight and his hand slid into my nightshirt, pushing it up. “They do?” I asked. “Yep,” he answered, the nightshirt still going up. “Elvira said they don’t gossip.” The nightshirt went way up, my arms were forced to go up with it then it was gone. Totally a take it off because it gets in the way man. His hand slid down my back and right into my panties to cup my ass. Mm. Nice. “They don’t talk around Elvira,” he went on. “They learned. She’s pathologically friendly, in your business and adopts every woman who drifts in and out of their lives. Hard to scrape someone off when you’re workin’ with their new best friend.” Hmm. This said a lot, since she’d done this with me and Hawk apparently didn’t give a shit. I decided maybe for now I should let that one go. “Mistress Blueballs?” I prompted. “You know I’ve watched you. They saw it happen. You give all the right signals, the promise of you so hot they’d sell an organ to get in there then you close down.” Hmm. His hand at my ass pulled me deeper into his body as his knee forced its way between my legs so I had no choice but to hitch my leg around his hip and his head came up before his face disappeared in my neck.","sourceLink":"https://allnovel.net/mystery-man-dream-man-1/page-72.html","bookId":1850,"book":{"id":1850,"title":"Mystery Man (Dream Man #1)","description":"Storyline: Night time is the right time... Gwendolyn Kidd has met the man of her dreams. He\u0027s hot, he\u0027s sexy, and what started as a no-names-exchanged night of passion has blossomed into a year and a half-long pleasure fest. Sure, it\u0027s a little strange that he only appears in her bed at night, but Gwen is so sure he\u0027s the one, she just can\u0027t turn him away... Hawk Delgado knows more about Gwen than she could ever imagine. She\u0027s gorgeous, headstrong, and skittish about relationships. But Hawk is facing his own demons, demons that keep him from connecting with anyone. Yet when Gwen is drawn into Denver\u0027s lethal underground scene, Hawk\u0027s protective nature comes out full force. The problem is, when Gwen gets a dose of Hawk\u0027s Alpha attitude in the daylight, she\u0027s not so sure he\u0027s the one anymore...","cover":"https://allnovel.net/images/mystery-man-dream-man-1.jpg","author":"Kristen Ashley","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/mystery-man-dream-man-1.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:07:19 PM"}}
