{"id":98361,"no":19,"title":"Page 19","content":"The traveling was easy - or should have been, for the road stretching along the western bank of the Masur Delaval south of Palmaris was the finest causeway in all the world. And early on Jo-jonah found a ride with a caravan that traveled for two days,through both day and night. Master Jojonah, though, was not having a good time of it. His old bones ached badly, and some two hundred miles south of Palmaris he had taken ill, beset by terrible cramps and nausea, and by a low fever that kept him sweating continually. Bad food, he supposed, and hoped in all seriousness that this journey and illness would not be the end of him. He still had much he meant to do before he died, and in any case, dying alone on the road halfway between Ursal and Palmaris, two cities of which he had never been overly fond, was not appealing in the least. So with typical stoicism the old master staggered along from town to town, walking slowly, leaning heavily on a sturdy stick, and chastising himself for letting his belly grow so thick. \"Piety, dignity, poverty,\" he said sarcastically, for truly he felt less than dignified, and it seemed he was carrying this vow of poverty way too far. As for piety ... Jojonah wasn\u0027t sure what that word meant anymore. Did it mean following blindly the lead of Father Abbot Markwart? Or following his heart, using those insights that Avelyn, by example, had given to him? The latter, he decided, but in truth, that solved little, for Jojonah wasn\u0027t sure exactly what course he might take to make any real dif-ference in the world. Likely he\u0027d just get himself demoted in Church rank, perhaps even banished, perhaps even burned as a heretic - the Church had a long history of turning like a ravenous animal on a proclaimed heretic, torturing such men to death. A shudder coursed Jojonah\u0027s spine as he considered that thought, like some grim premonition. Yes, Father Abbot Markwart was in a foul mood of late, and the more foul it became by far if ever someone mentioned the name of Avelyn Desbris! Thus the master found a new enemy, despair, on that long road to Ursal. But he plodded on, putting one foot in front of the other. He awoke on the sixth day out to find the sky thick with dark clouds, and by mid-morning a cool rain had begun. Jojonah was at first glad of the cloud cover, for the previous day had been brutally hot. But as the first raindrops began to fall, as the chilly water touched his feverish skin, he grew miserable indeed, and even con-sidered returning to the town in which he had slept the previous night. He didn\u0027t reverse direction, though, but simply slogged along a puddle- filled road, turning his attention inward, to Avelyn and Markwart, to the direction of the Church and any course he might follow to alter that dark path. As the minutes turned to an hour, then two, the master was so deep in thought that he never heard the wagon approaching fast from behind. \"Be clear the road!\" the driver cried, pulling hard on the reins, then yanking them to the side. The wagon swerved, narrowly missing Jojonah, spraying him with a great wash as he tumbled to the muddy ground in surprise and terror. Off to the side went the wagon, sinking deep into the mud - and only that mud, grabbing at the wheels like some living creature, kept the cart from overturning as the frantic driver fought to gain control. Finally the team slowed and the wheels slipped to a messy halt. The driver leaped down at once, taking only a quick glance at his stuck rig, then rushing back across the road to where Jojo-nah sat. \"My pardon,\" the monk stammered as the man, a handsome fellow of about twenty years, splashed over to him. \"I did not hear you in the rain.\" \"No pardon\u0027s needed,\" the man said pleasantly, helping Jojonah to stand and brushing some of the mud from his soaked robes. \"Sure that I been fearing that since I taked the road outta Palmaris.\" \"Palmaris,\" echoed Jojonah. \"I, too, just came from the most ex-cellent town.\" The monk noted that the man\u0027s expression soured at the mention of the word \"excellent,\" and so Jojonah quieted, thinking it prudent to listen and not to speak. \"Well, the quicker I\u0027m coming from the same place,\" the man replied, glancing back helplessly at his wagon. \"Or was,\" he added despondently. \"We will not easily extract it from the mud, I fear,\" Jojonah agreed. The man nodded. \"But I\u0027ll find villagers to help,\" he said. \"There be a town a three-mile back.\" \"The folk are helpful,\" Jojonah said hopefully. \"Perhaps I shall accompany you; they would be quick to help a priest of the Church, after ail, and were quite kind to me last night, for that is where I slept. And then, after we have extracted your wagon, perhaps you\u0027ll take me along. My destination is Ursal, and I\u0027ve a long road ahead, I fear, and a body not taking well to the travel.\" \"Ursal\u0027s me own ending,\" the man said. \"And ye might help in me message, since it concerns yer own Church.\" Jojonah perked his ears up at that remark and cocked an eye-brow. \"Oh,\" he prompted. \"Truly \u0027tis a sad day,\" the man went on. \"So sad a day that sees the death of Abbot Dobrinion.\" Jojonah\u0027s eyes went wide and he staggered, catching hold of the man\u0027s sleeve for support. \"Dobrinion? How?\" \"Powrie,\" the man answered. \"Little rat devil. Sneaked into the church and killed him to death.\" Jojonah could hardly digest the information. His mind started whirling, but he was too sickly and too confused. He sat down again, plop, onto the muddy road, and dropped his face into his hands, sobbing, and didn\u0027t know if he was crying for Abbot Dobrinion or for himself and his beloved Order. The driver put a comforting hand on his shoulder. They left to-gether for the town, the man promising he would spend the night there even if the folk managed to clear his wagon of the mud. \"And ye\u0027ll be riding with me the rest o\u0027 the way to Ursal,\" he said with a hopeful smile. \"We\u0027ll get ye blankets to keep ye warm, Father, and good food, lots of good food, for the road.\" One of the families in the small town put Jojonah and the driver up for the night, giving him a warm bed. The monk retired early, but couldn\u0027t immediately fall asleep, for a crowd was gathering in the house, with all the folk of the area coming to hear the driver\u0027s sad tale of the death of Abbot Dobrinion. Jojonah lay quiet and listened to them for a long while, then finally, shivering and sweating, he drifted off to sleep. Youseff and Dandelion did not make the return trip. Master Jojonah awoke with a start. The house was quiet and, since the clouds hung low outside, dark. Jojonah looked all around, narrowing his eyes. \"Who is there?\" he asked. Youseff and Dandelion did not make the return trip!he heard again, more emphatically. No, not heard, Jojonah realized, for there was not a sound, save the pat of heavy raindrops on the roof. He felt the words, in his mind, and he recognized the man who was putting them there. \"Brother Braumin?\" he asked. I fear that the Father Abbot put them on your trail,the thoughts imparted.Run, my friend, my mentor. Flee back to Palmaris if you are not far away, to the court of Abbot Dobrinion, and do not allow Brothers Youseff and Dandelion entrance into St. Precious. The communication was weak - which Jojonah understood, for Braumin wasn\u0027t very practiced with the hematite, and likely theman was using it now under less than ideal circumstances.Where are you? he telepathically asked.St. -Mere-Abelle? Please, Master Jojonah! You must hear my call. Youseff and Dandelion did not make the return trip! The contact was lessening - Braumin was getting tired, Jojonah realized. Then, abruptly, it was gone altogether, and Jojonah feared that perhaps Markwart or Francis had happened upon Braumin. If it really was Braumin, he had to remind himself. If it was any-thing at all beyond the delirium of his fever. \"They did not know,\" the master whispered, for he realized only then that Braumin\u0027s message had mentioned nothing about Dobrinion. Jojonah scrambled out of bed, groaning for the effort, and made his way quietly through the house. He startled the lady first, nearly tripping over her as she slept on a mattress of piled blankets on the common room floor. She had given up her own bed for him, he realized, and truly he did not wish to disturb her now. But some things simply couldn\u0027t wait. \"The driver?\" he asked. \"Is he in the house, or did he take shelter with another family?\" \"Oh, no,\" the woman said as pleasantly as she could. \"Sure that he\u0027s sleeping in the room with me little boys. Snug as bugs in a rug, so the sayin\u0027 goes.\" \"Get him,\" Master Jojonah instructed. \"At once.\" \"Yes, Father, whatever ye\u0027re needing,\" the woman replied, un-tangling herself from her bedroll and half walking, half crawling across the room. She returned in a few moments, the bleary-eyed driver at her side. \"Ye should be sleeping,\" the man said. \"Not good for yer fever, being up so late.\" \"One question,\" Jojonah prompted, waving his hands to quiet the man, to make sure he was paying close attention. \"When Abbot Dobrinion was murdered, where was the caravan of St.-Mere-Abelle?\" The man cocked his head as if he didn\u0027t understand. \"You know that monks of my abbey were visiting St. Precious,\" Jojonah pressed. \"A bit more than visiting, by the trouble they bringed,\" the man said with a snort. \"Indeed,\" Jojonah conceded. \"But where were they when the powrie killed Abbot Dobrinion?\" \"Gone.\" \"From the city?\" \"Out to the north, some say, though I heared they crossed the river, and not on the ferry,\" the driver replied. \"They were out a day and more afore the abbot fell to the powrie.\" Master Jojonah rocked back on his heels, stroking his large chin. The driver started to elaborate, but the monk had heard enough and stopped him with an upraised palm. \"Go back to bed,\" he bade both the man and the lady of the house. \"As will I.\" Back in the solitude of his dark room, Master Jojonah did not fall off to sleep. Far from it. Convinced now that the contact with Braumin was not a dreamy, imagined thing, Jojonah had too much to think about. He was not fearful, as Braumin had been, that Youseff and Dandelion had been set on his trail. Markwart was too close to his goal, or at least the obsessed man thought he was, to delay the killers. No, they would go north of Palmaris, not south, onto the battlefield in search of the stones. But apparently they had made one brief stop on the way, long enough to fix a bit of Markwart\u0027s trouble in Palmaris. Master Jojonah rushed to the one window in the room, pushed open the shutters and vomited onto the grass outside, sickened by the mere thought that his Father Abbot had ordered the execution of another abbot! It rang as preposterous! Yet, every detail that was filtering to Jo-jonah led him inescapably in that direction. Was he, perhaps, clouding those details with his own judgments? he had to wonder.Youseff and Dandelion did not make the return trip! And Brother Braumin had no idea that Abbot Dobrinion had met such an untimely end. Truly Master Jojonah hoped he was wrong, hoped that his fears and his feverish delirium were running wild, hoped that the leader of his Order could never have done such a thing. In any case, there seemed only one road ahead of him now, back to the north, and not south, back to St.- Mere-Abelle. Finally all two hundred were on the move, swinging west and then south of the two towns still in powrie hands. Elbryan directed the march, keeping scouts well ahead of the caravan and holding his forty best warriors in a tight group. Of all the ragged caravan, only about half could fight even if pressed, the other half being simply too old or too young, or too ill. The general health of the group was good, though, thanks mostly to the tireless efforts of Pony and her precious soul stone. No resistance came out at them from the two town\u0027s, and as the afternoon of the fifth day began to wane, they were almost halfway to Palmaris. \"Farm and a barn,\" Roger Lockless explained, coming back to meet with Elbryan. \"Just a mile ahead. The well\u0027s intact, and I heard chickens.\" Several of the people nearby groaned and cooed and smacked their lips at the thought of fresh eggs. \"But no one was about?\" the ranger asked skeptically. \"None outside,\" Roger replied, and he seemed a bit embarrassed that he couldn\u0027t have discerned more. \"But I was not far ahead of you,\" he hastily explained. \"I feared that if I tarried too long, you would get in sight of the structures, and any monsters inside, if there are any, would see you.\" Elbryan nodded and smiled. \"You did well,\" he said. \"Hold the group in check here while Pony and I go in and see what we might learn.\" Roger nodded and helped Pony climb on Symphony\u0027s back be-hind the ranger. \"Strengthen the perimeter, particularly in the north,\" Elbryan instructed the young man. \"And find Juraviel. Tell him where to find us.\" Roger accepted the orders with a nod. He slapped Symphony on the rump and the horse bounded away. Roger hardly watched the departure, was already moving to instruct the folk of the caravan to settle into a defensive posture. The ranger found the structures easily enough, and then Pony went to work, using the soul stone to spirit-walk into first the barn and then the farmhouse. \"Powries in the house,\" she explained when she came back into her own body. \"Three, though one is sleeping in the back bedroom. Goblins hold the barn, but they are not alert.\" Elbryan closed his eyes, seeking a deep, meditative calm, trans-forming, almost visibly, into his elven-trained alter ego. He indi-cated a small copse of trees to the left of the barn, then slipped down from Symphony, helping Pony do the same. Leaving the horse, the pair moved cautiously to the shadows of the copse, and then the ranger went on alone, continuing his advance, moving to stumps, to a water trough, to anything that would conceal him. Soon enough he was at the farmhouse, his back to the wall beside a window, Hawkwing in hand. He peered around, then looked back in Pony\u0027s direction and nodded, fitting an arrow. He turned abruptly and let fly, scoring a hit on the back of the head of a powrie as the unsuspecting dwarf cooked over a stove. The momentum drove the creature\u0027s head forward, forcing its face right into the sizzling grease in the frying pan. \"What\u0027re ye doing!\" the dwarf\u0027s companion howled, rushing to the stove. That dwarf skidded to a stop, though, noting the quivering arrow shaft, then spun about to find Nightbird and Tempest waiting. Down swept the mighty sword as the powrie reached for its weapon. As its arm fell free of its body, the howling dwarf tried in-stead to charge ahead, barreling into the ranger. A sure thrust of Tempest skewered the creature right through the heart, the lunging ranger putting the blade in all the way to its hilt. After a couple of wild spasms, the powrie slid dead to the floor. \"Yach, ye\u0027re waking me up!\" came a roar from the bedroom. Nightbird smiled, then waited a minute, slipping quietly to the door. He paused a few moments longer, making sure that the dwarf had settled down once more, then slowly pushed open the door. There lay the powrie, on a bed, its back to him. The ranger came out of the house soon after, giving a quick wave to Pony. He retrieved Hawkwing and began a cautious circuit of the barn. Of note was the hayloft, with one door cracked open and a rope hanging to the ground. The ranger glanced all around, to see Pony moving to a new po-sition, one that allowed her to view both the main door and the hayloft. He was truly blessed to have such a competent companion, he knew, for if he got into trouble, Pony would always be there. And now, both of them understood the plan. Pony could have charged straight into the barn, of course, using serpentine and the explosive ruby to blow the place away, but the smoke of such a fire would not be a good thing. Instead she held her position, magnetite and graphite in hand, as Nightbird\u0027s backup. And the ranger did not underestimate the amount of discipline it took for her to accept that position. Every morning, she performed the sword- dance beside him, and her blade work was truly be-coming magnificent. She wanted to fight, to stand beside Elbryan, to dance now for real. But Pony was truly disciplined and patient. The ranger had assured her that she would get her chance to use the new techniques - both knew that she was almost ready. But not yet. Nightbird tested the rope to the hayloft, then began a cautious and quiet climb. He paused just below the door, listening, peek-ing in at the loft level, then waved one finger up in the air for Pony to see. Up he went, level with the door, putting one foot gingerly in the small crack, though he had to continue to hold on to the rope. He had to move fast, he realized, and wouldn\u0027t likely have time to draw any weapon. Again the ranger took a deep, steadying breath, found his center and his necessary calm. Then he hooked his foot about the bottom of the door and yanked it out, hurling himself into the loft, into the surprised goblin standing a nonchalant guard within. The goblin gave a cry, muffled almost immediately as the ranger clamped a strong hand over its mouth, his other arm wrapping tight around the goblin\u0027s weapon hand. Nightbird clamped his hand over the creature\u0027s face, squeezing hard, then turned his wrist and drove the goblin to its knees. A cry from below told him he was out of time. With a sudden jerk, Nightbird brought the goblin back up to its feet, then twisted and threw, launching the creature out the open door to dive the ten feet to the ground. It landed hard and groaned, then tried to get back up, tried to call out. At the last instant it spotted Pony, the woman standing calm, hand extended. A lodestone traveling many times the speed of a sling bullet blasted right through the metal amulet the creature had around its neck, a piece of jewelry it had stolen from a woman who futilely begged for her life. Inside the barn, Nightbird set Hawkwing to deadly work, blasting goblins from the ladder as they tried to gain the loft. A mo-ment later the startled ranger found out he was not alone, as a second archer joined him. \"Roger told me of your plans,\" Belli\u0027mar Juraviel explained. \"A good start!\" he added, plunking an arrow into a goblin that had foolishly scurried into view. Recognizing that there was no way they could possibly get up that ladder, the remaining goblins went for the main door instead, pushing it wide and scrambling out into the daylight. A bolt of streaking lightning laid most of them low. Then the elf was above them, at the doors to the loft, firing down at those who continued to scramble. The ranger did not join his friend, but took a different route, slip-ping down the ladder. He hit the ground in a roll, avoiding a spear throw by one creature, and was firing Hawkwing as he came around, taking the goblin right in the face, then again, taking out a second as it ran for the door. Then all was quiet, inside at least, but Nightbird sensed he was not alone. He put his bow to the ground and drew out his sword, moving slowly, silently. Outside, the cries diminished. Nightbird came to a bale of hay, put his back against it and listened hard. Breathing. Around he went suddenly, holding his swing just long enough to make sure that it was indeed another goblin and not some unfortu-nate prisoner, then lopping the creature\u0027s ugly head from its shoul-ders with a single stroke. He came out into the daylight afterward, finding Pony and Juraviel walking Symphony toward the barn, their business finished. The elf stayed with Elbryan, securing a new perimeter, while Pony galloped the stallion back to gather the group. \"I canno\u0027 be turning back now,\" the driver replied when Jojonah told him of the plans the next morning. \"Though suren I\u0027d love to be helping ye. But me business - \" \"Is important. Indeed,\" Jojonah finished for him, excusing him. \"Yer best way back is with the ships,\" the driver went on. \"Most o\u0027 them are heading up north and to the open sea for the summer season. I\u0027d\u0027ve come down on one meself, but few be coming south just now.\" Master Jojonah stroked his stubbly chin. He had no money, but perhaps he could find a way. \"The nearest port, then,\" he said to the driver. \"South and east,\" the man replied. \"Bristole by name. A town built for fixing and supplying the boats and not much else. She\u0027s not too far outta me way.\" \"I would be obliged,\" the monk answered. So they were off again, after a hearty breakfast, supplied for free by the goodly townsfolk. Only when the wagon began rambling down the road did Master Jojonah comprehend how much better he was feeling physically. Despite the bumpy nature of the ride, his breakfast had settled well. It was as if the news of the previous night, the implication that things were darker by far than he had ever imagined, had pumped strength back into his frail body. He simply could not afford to be weak now. Bristole was as small a town as Jojonah had ever seen, and seemed strangely unbalanced to the monk. The dock areas were extensive, with long wharves that could accommodate ten large ships. Other than that, though, there were but a few buildings, in-cluding only a pair of small warehouses. It wasn\u0027t until the wagon pulled into the center of the cluster of houses that Jojonah began to understand. Ships going up- or downriver would need no supplies at this point, since the trip from Palmaris to Ursal was not a long one. However, the sailors might desire a bit of relief, and so the ships would put in here for restocking of a different nature. Of the seven buildings clustered together, two were taverns and two were brothels. Master Jojonah said a short prayer, but was not overly con-cerned. He was an accepting man, ever willing to forgive the weak-ness of the flesh. It was, after all, the strength of the soul that counted. He bade farewell to the generous driver, wishing he could give the goodly man more than words for his efforts, and then turned to the business at hand. Three ships were in; another was approaching from the south. The monk walked down to the riverbank, his san-dals clapping against the extensive boardwalk. \"Hail, good fellows,\" he called as he neared the closest ship, seeing a pair of men bending low behind the taffrail, working ham-mers on some problem he could not see. Jojonah noted that this ship was in stern first, an oddity, and, he hoped, an omen that it would soon depart. \"Hail, good fellows!\" Jojonah yelled more loudly, waving his arms to get their attention. The hammering stopped and one old sea dog with wrinkled brown skin and no teeth looked up to regard the monk. \"And to yourself, Father,\" he said. \"Are you heading north?\" Master Jojonah asked. \"To Palmaris, perhaps?\" \"Palmaris and the Gulf,\" the man answered. \"But we\u0027re not heading anywhere at all anytime soon. Got an anchor line that won\u0027t hold; chain\u0027s all busted.\" Jojonah understood why the ship was in dock backward. He looked around, back at the town, searching for some solution that would get this ship sailing. Any worthy port would have held the proper equipment - even the meager docks of St.-Mere-Abelle were supplied with such items as chains and anchors. But Bristole was no town for ship repairs, was more a place for \"crew repairs.\" \"Got a new one sailing up from Ursal,\" the old seaman went on. \"Should arrive in two days. Are you looking for passage, then?\" \"Yes, but I cannot delay.\" \"Well, we\u0027ll take you, for five pieces of the King\u0027s gold,\" the old man said. \"A fair price, Father.\" \"Indeed it is, but I\u0027ve not the gold to pay, I fear,\" Jojonah replied. \"Nor the time to delay.\" \"Two days?\" the sea dog balked. \"Two days more than I have to spare,\" Jojonah answered. \"I do beg your pardon, Father,\" came another voice, from the ship next in line, a wide and sturdy caravel. \"We shall be sailing north this very day.\" Master Jojonah waved to the two on the damaged vessel and walked around to get a better view of the newest speaker. The man was tall and lean and dark-skinned - not from the sun, but from his heritage. He was Behrenese, and, given his complexion, likely from a region of southern Behren, far south of the Belt-and-Buckle. \"I am afraid that I have no gold to pay,\" Jojonah replied. The dark man flashed a pearly smile. \"But Father,\" he said, \"why would you be needing the gold?\" \"I\u0027ll work for my passage, then,\" Jojonah offered. \"All on my ship could use a good prayer, Father,\" the Behrenese man replied. \"More, I fear, after our little stop here. Come aboard, I beg you. We were not to leave until late in the day, but I\u0027ve only one man out and he can be retrieved easily. If you are in a hurry, then we are in a hurry!\" \"Very generous, good sir - \" \"Al\u0027u\u0027met,\" the man answered. \"Captain Al\u0027u\u0027met of the good shipSaudi Jacintha.\" Jojonah cocked his head at that curious name. \"It means Jewel of the Desert,\" Al\u0027u\u0027met explained. \"A bit of a joke on my father, who wished me to ride the dunes, not the waves.\" \"As my own father wanted me to serve ale, not prayer,\" Jojonah replied with a laugh. He was more than a bit surprised to find a dark-skinned Behrenese in command of an Ursal sailing ship, and even more surprised to see the man pay so much respect to one of the Abellican Order. Jojonah\u0027s Church was not prominent in the southern kingdom; indeed, missionaries had many times been slaughtered for trying to impose their vision of divinity on the often intolerant priests - yatolsin the Behren tongue - of the deserts. Captain Al\u0027u\u0027met helped Jojonah over the last step of gang-plank, then dispatched two of his crewmen to go and find the one missing sailor. \"Have you bags to bring aboard?\" he asked Jojonah. \"Only what I carry,\" the monk replied. \"And how far north will you be sailing?\" \"Palmaris,\" Jojonah replied. \"Or across the river, actually; I can ride the ferry. I am needed at St.-Mere-Abelle on most urgent matters.\" \"We may be sailing past All Saints Bay,\" Captain Al\u0027u\u0027met said. \"Though you will lose a week at least traveling by sea.\" \"Then Palmaris it is,\" the monk said. \"Exactly where we were going,\" Captain Al\u0027u\u0027met replied, and, smiling still, he pointed to the cabin door leading under the poop deck. \"I have two rooms,\" he explained. \"Surely I can share one with you for a day or two.\" \"You are Abellican?\" Al\u0027u\u0027met\u0027s grin widened. \"For three years,\" he explained. \"I found your God at St. Gwendolyn of the Sea, and as fine a catch as Al\u0027u\u0027met has ever known.\" \"But another disappointment for your father,\" Jojonah reasoned. Al\u0027u\u0027met put a finger to pursed lips. \"He does not need to know such things, Father,\" he said slyly. \"Out on the Mirianic, when the storms blow high and the waves break twice the height of a tall man above the forward rail, I choose my own God. Besides,\" he added with a wink, \"they are not so different, you know, the God of your land and the one of mine. A change in robes would make a priest ayatol.\" \"So your conversion was one of convenience,\" Jojonah teased. Al\u0027u\u0027met shrugged. \"I choose my own God.\" Jojonah nodded and returned the wide smile, then made his slow way toward the captain\u0027s cabins. \"My boy will show you your quarters,\" Al\u0027u\u0027met called after him. The cabin boy was just within the shelter of the room, throwing bones, when Master Jojonah opened the door. The lad, no more than ten years of age, scrambled frantically, collecting his dice and looking very guilty - he had been caught derelict from his chores, the monk knew. \"Set our friend up, Matthew,\" Captain Al\u0027u\u0027met called. \"See to his needs.\" Jojonah and Matthew stood staring at each other, sizing each other up for a long time. Matthew\u0027s clothes were threadbare, as was the lot for anybody working aboard a ship. But they were a fine cut, better than the attire of most crewmen the monk had met. And the boy was cleaner than most cabin boys, his sun-bleached hair neatly trimmed, his skin golden tanned. There was one notable blemish, though, a black patch on the boy\u0027s forearm. Jojonah recognized the scar, and he imagined the pain the boy must have felt. The patch had been caused by the second of the three \"medicinal\" liquids - rum, tar, and urine - kept on the sailing ships. The rum was used to kill the worms that inevitably found their way into foodstuffs, to kill the aftereffects of bad food, and simply to forget the long, long, empty hours. The urine was used for washing, clothes and hair, and as disgusting as that thought was, it paled in comparison to the liquid tar. This was used to patch torn skin. The boy, Matthew, had obviously gashed his arm, and so the sailors had applied tar to the wound to seal it. \"May I?\" Jojonah quietly asked, reaching for the arm. Matthew hesitated, but dared not disobey, cautiously holding the arm up for inspection. A fine job, the monk noted. The tar had been sanded flat with the skin, a perfect patch of black. \"Does it hurt?\" Jojonah asked. Matthew shook his head emphatically. \"He does not speak,\" came Captain Al\u0027u\u0027met\u0027s voice, the man having moved up right behind the distracted monk. \"Your work?\" Jojonah asked, indicating the arm. \"Not mine, but Cody Bellaway\u0027s,\" Al\u0027u\u0027met answered. \"He serves as healer when we are far from port.\" Master Jojonah nodded and let the issue drop - openly, at least, for in his mind the image of Matthew\u0027s blackened arm would not so quickly fade. How many hematites were locked away in St.-Mere-Abelle? Five hundred? A thousand? The number was con-siderable, Jojonah knew, for when he was a younger monk, he had done an inventory of just that stone, easily the most common stone returned from Pimaninicuit over the years. Most of these soul stones were of far less power than the one the caravan to the Barbacan had taken along, but still, Jojonah had to wonder how much good might come of these if they were given to the sailing ships with one or two men on each vessel taught how to bring forth their healing powers. Matthew\u0027s wound had been considerable, no doubt, but Jojonah could have easily sealed it with magic, not tar. With hardly an effort, much suffering could have been avoided. That line of thinking made the master wonder on a grander scale. Why weren\u0027t all the communities, or at least one community in each general region of the kingdom, given a hematite, with their chosen healers trained in its use? He had never discussed such a thing with Avelyn, of course, but somehow Master Jojonah understood that Avelyn Desbris, if the choice had been his, would without hesitation have distributed the small hematites to the general populace, would have opened up St.-Mere-Abelle\u0027s horde of magic for the betterment of all, or at least distributed the most minor hematites, stones too weak to be used for diabolical purposes such as possession, stones too weak to be used in any real malevolent way. Yes, Jojonah knew, Avelyn would have done it if given the chance, but of course Father Abbot Markwart would never have given him the chance! Jojonah patted the mop of Matthew\u0027s blond hair and motioned for the lad to show him to his room. Al\u0027u\u0027met left them then, calling for his hands to ready the ship for departure. Saudi Jacinthaslipped out of Bristole soon after, her sails fast filling with wind, pushing her against the considerable current. They would make good time, Al\u0027u\u0027met came and assured the monk, for the south winds were brisk, with no sign of storm, and as the Masur Delaval widened, the pull of the water was not so strong. The monk spent the bulk of the day in his cabin, sleeping, gath-ering the strength he knew he would need. He did get up for a short while, and with a friendly nod convinced Matthew to play dice with him, assuring him the captain wouldn\u0027t mind if he took a short break from his chores. Jojonah wished that the boy could talk, or even laugh, in the hour they spent throwing dice. He wanted to know where the lad had come from and how he had wound up on a ship at so tender an age. Likely his parents, poverty-stricken, had sold him, the monk knew, and he winced at the thought. That was how most ships ac-quired cabin boys, though Jojonah hoped that Al\u0027u\u0027met had not been the one to purchase him. The captain claimed to be a religious man, and men of God did not do such things. A light rain came up that night, but nothing that impededSaudi Jacintha \u0027sprogress. This crew was well-trained and knew every turn in the great river, and on the ship plowed, her prow spray foaming white in the moonlight. It was at that forward rail, in that same night after the rain had stopped, that Master Jojonah fully ac-cepted the truths that were forming in his heart. Alone in the dark-ness with the splash of the prow, the croaking of the animals on the bank, the flutter of the wind in the sails, Master Jojonah found his course come clearer. He felt as if Avelyn were with him, hovering about him, re-minding him of the three vows - not just the empty spoken words, but the meaning behind them - that supposedly guided the Abel-lican Order. He stayed up all through the night and went to bed again right before the dawn, after coaxing a sleepy-eyed Matthew to go and fetch him a good meal. He was up again at dinnertime, dining beside Captain Al\u0027u\u0027met, who informed him they would reach their goal early the next morning. \"You might not wish to stay up all the night again,\" the captain said with a smile. \"You will be back to land in the morning, and will not travel far, I will guess, if you are asleep.\" Still, later on that evening, Captain Al\u0027u\u0027met found Jojonah again at the forward rail, staring into the darkness, looking into his own heart. \"You are a thinking man,\" the captain said, approaching the monk. \"I like that.\" \"You can tell such things simply because I am standing out here alone?\" Jojonah replied. \"I might be thinking of nothing at all.\" \"Not at the forward rail,\" Captain Al\u0027u\u0027met said, taking a spot right beside the leaning monk. \"I, too, know the inspiration of this place.\" \"Where did you get Matthew?\" Jojonah asked abruptly, blurting out the words before he could even consider them. Al\u0027u\u0027met gave him a sidelong glance, surprised by the question. He looked back to the prow spray and smiled. \"You do not wish to think that I, a man of your Church, purchased him from his par-ents,\" the perceptive man reasoned. \"But I did,\" Al\u0027u\u0027met added, standing straighter and looking directly at the monk. Master Jojonah did not return the stare. \"They were paupers, living near St. Gwendolyn, surviving on the scraps your Abellican brothers bothered to toss out for them,\" the captain went on, his tone deepening, growing somber. Now Jojonah did turn, eyeing the man severely. \"Yet this is the Church you chose to join,\" he stated. \"That does not mean that I agree with all of those who now ad-minister the doctrine of the Church,\" Al\u0027u\u0027met calmly replied. \"As to Matthew, I purchased him, and at a handsome price, because I came to think of him as my own son. He was always at the docks, you see - or at least, he was there at those times when he could es-cape his wrathful father. The man beat him for no reason, though little Matthew had not seen his seventh birthday at the time. So I purchased him, took him aboard to teach him an honest trade.\" \"A difficult life,\" Jojonah remarked, but all animosity and hints of accusation were gone from his voice. \"Indeed,\" the large Behrenese agreed. \"A life some love and others loathe. Matthew will make up his own mind when he is old enough to better understand. If he comes to love the sea, as I do, then he will have no choice but to stay aboard ship - and hopefully he will choose to stay with me.Saudi Jacintha will outlive me, I fear, and it would be good to have Matthew to carry on my work.\" Al\u0027u\u0027met turned to face the monk and went quiet, waiting until Jojonah looked at him directly. \"And if he does not love the smell and the roll of the waves, he will be free to go,\" the man said sin-cerely. \"And I will make sure that he has a good start wherever he chooses to live. I give you my word on this, Master Jojonah of St.-Mere-Abelle.\" Jojonah believed him, and his return smile was genuine. Among the tough sailors of the day, Captain Al\u0027u\u0027met surely stood tall. They both looked back to the water and stood in silence for some time, save for the splashing prow and the wind. \"I knew Abbot Dobrinion,\" Captain Al\u0027u\u0027met said at length. \"A good man.\" Jojonah looked at him curiously. \"Your companion, the wagon driver, spread word of the tragedy in Bristole while you were seeking passage,\" the captain explained. \"Dobrinion was indeed a good man,\" Jojonah replied. \"And a great loss it is for my Church that he was killed.\" \"A great loss for all the world,\" Al\u0027u\u0027met agreed. \"How did you know him?\" \"I know many of the Church leaders, for, given my mobile pro-fession, I spend many hours in many different chapels, St. Precious among them.\" \"Have you ever been to St.-Mere-Abelle?\" Jojonah asked, though he didn\u0027t think Al\u0027u\u0027met had, for he believed that he would remember this man. \"We put in once,\" the Captain replied. \"But the weather was turn-ing, and we had far to go, so I did not get off the docks. St. Gwen-dolyn was not so far away, after all.\" Jojonah smiled. \"I have met your Father Abbot, though,\" the Captain went on. \"Only once. It was 819, or perhaps 820; the years do seem to blend as they pass. Father Abbot Markwart had put out a call for open-seas sailing ships. I am not really a river-runner, you see, but we took some damage last year - powrie barrelboat, for the wretched dwarves seemed to be everywhere! - and were late getting out of port this spring.\" \"You answered the Father Abbot\u0027s call,\" Jojonah prompted. \"Yes, but my ship was not chosen,\" Al\u0027u\u0027met replied casually. \"Truthfully, I think it had something to do with the color of my skin. I do not believe that your Father Abbot trusted a Behrenese sailor, especially one who was not, at that time, an anointed member of your Church.\" Jojonah nodded his agreement; there was no way that Markwart would have accepted a man of the southern religion for the journey to Pimaninicuit. The monk found that notion ironic, laughable even, given the carefully planned murderous end of the voyage. \"Captain Adjonas and hisWindrunner were the better choice,\" Al\u0027u\u0027met admitted. \"He was riding the open Mirianic before I ever learned to work an oar.\" \"You know of Adjonas, then?\" Jojonah asked. \"And of the end of theWindrunner?\" \"Every seaman on the Broken Coast knows of the loss,\" Captain Al\u0027u\u0027met replied. \"Happened just outside of All Saints Bay, so they say. A rough bit of water, to be sure, though I am amazed that a man as sea-seasoned as Adjonas got caught too near the shoal.\" Jojonah only nodded; he could not bring himself to reveal the awful truth, to tell this man that Adjonas and his crew had been slaughtered in the sheltered waters of All Saints Bay by the holy men of the religion Al\u0027u\u0027met had freely joined. Looking back at that now, Master Jojonah could hardly believe that he had gone along with the plan, the terrible tradition. Had it always been that way, as the Church insisted? \"A fine ship and crew,\" Al\u0027u\u0027met finished reverently. Jojonah nodded his agreement, though in truth, he hardly knew any of the sailors, had met only Captain Adjonas and the first hand, Bunkus Smealy, a man he did not like at all. \"Go and get your sleep, Father,\" Captain Al\u0027u\u0027met said. \"You\u0027ve a hard day of walking ahead of you.\" Jojonah, too, thought that to be a good time to break the conver-sation. Al\u0027u\u0027met had inadvertently given him much to think about, had rekindled memories and put them in a new light.That does not mean that I agree with all of those who now administer the doctrine of the Church, Al\u0027u\u0027met had said, words that rang as truly pro-phetic to the disillusioned master. Jojonah slept well that night, better than he had since he had first arrived in Palmaris, since all the world had spun completely over. A cry concerning dock lights woke him with the sun and he gath-ered his few possessions and raced onto the deck, thinking to see the long wharves of Palmaris. All that he saw was fog, a heavy gray blanket. All the crew was abovedecks, most at the rail, holding lanterns and peering intently into the gloom. Looking for rocks, or even other ships, Jojonah realized, and a shudder coursed his spine. The sight of Captain Al\u0027u\u0027met calmed him, though, the tall man standing serenely, as though this situation was nothing out of the ordinary. Jojonah made his way to join him. \"I heard a cry for dock lights,\" the monk explained, \"though I doubt that any might have been spotted in this fog.\" \"We saw,\" Al\u0027u\u0027met assured him, smiling. \"We are close, and getting closer by the second.\" Jojonah followed the captain\u0027s gaze out over the forward rail, to the gloom. Something - he couldn\u0027t quite identify it - seemed out of place to him, as though his internal direction sense was askew. He stood quiet for a long while, trying to sort it out, noting the posi-tion of the sun, a lighter splotch of grayness ahead of the ship. \"We are traveling east,\" he said suddenly, turning to Al\u0027u\u0027met. \"But Palmaris is on the western bank.\" \"I thought that I would save you the hours on the crowded ferry,\" Al\u0027u\u0027met explained. \"Though they might not even run the ferry in this gloom.\" \"Captain, you did not have to - \" \"No trouble, my friend,\" Al\u0027u\u0027met replied. \"We would not be al-lowed into Palmaris port until the fog rolled back anyway, so rather than set anchor, we turned to Amvoy, a smaller port and one with less rules.\" \"Land to forward!\" came a call from above. \"Amvoy\u0027s long dock!\" another sailor agreed. Jojonah looked to Al\u0027u\u0027met, who only winked and smiled. Soon after,Saudi Jacintha glided easily into position beside the one long dock at Amvoy, the skilled sailors expertly tying her in place. \"I wish you well, Master Jojonah of St.-Mere-Abelle,\" Al\u0027u\u0027met said sincerely as he led the monk to the gangplank. \"May the loss of good Abbot Dobrinion strengthen us all.\" He shook Jojonah\u0027s hand firmly, and the monk turned to go. At the edge of the plank he stopped, torn, prudence battling conscience. \"Captain Al\u0027u\u0027met,\" he said suddenly, turning about. He noted several other sailors in the vicinity, all listening to his every word, but didn\u0027t let that deter him. \"In the coming months you will hear stories of a man named Avelyn Desbris. Brother Avelyn, formerly at St.-Mere-Abelle.\" \"The name is not known to me,\" Captain Al\u0027u\u0027met replied. \"But it will be,\" Master Jojonah assured him. \"You will hear ter-rible stories of the man, naming him as a thief, a murderer, a heretic. You will hear his name dragged through the very fires of hell.\" Captain Al\u0027u\u0027met made no reply at all as Jojonah paused and swallowed hard on his words. \"I tell you this in all sincerity,\" the monk went on, realizing that he was crossing a very delicate line here. Again he paused, swal-lowing hard. \"The stories are not true, or at least, the manner in which they will be told will be slanted against the actions of Brother Avelyn, who was, I assure you, a man following his God-inspired conscience at all times.\" Several of the crewmen merely shrugged, thinking that the words meant little for them, but Captain Al\u0027u\u0027met recognized the gravity in the monk\u0027s voice and understood that this was a pivotal moment for the man. From Jojonah\u0027s tone, Al\u0027u\u0027met was wise enough to understand that these tales of this monk he did not know might indeed affect him, and everyone else associated with the Abellican Church. He nodded, not smiling. \"Never has the Abellican Church fostered a better man than Avelyn Desbris,\" Jojonah said firmly, and he turned and left theSaudi Jacintha. He understood the chance he had just taken, real-izing that theSaudi Jacintha would likely find its way to St.-Mere-Abelle again one day, and that Captain Al\u0027u\u0027met, or more likely, one of the eavesdropping crewmen would speak with men at the abbey, would perhaps speak with Father Abbot Markwart himself. But for some reason, Jojonah didn\u0027t try to qualify the story, or re-tract it. There, he had said it, openly. As it should be. Still, the monk\u0027s words followed him as he entered Amvoy, filling him with doubts. He secured a ride to the east on a wagon, and though the driver was a member of the Church, and a man as friendly and generous as Captain Al\u0027u\u0027met, at their parting three days later, only a few miles from the gates of St.-Mere-Abelle, Master Jojonah did not recount his tale of Avelyn. It wasn\u0027t until he came in sight of the abbey that the master\u0027s doubts vanished. From any perspective, St.-Mere-Abelle was an impressive place, its walls ancient and strong, a lasting part of the mountainous coastline. Whenever he looked upon the abbey from out here, Jojonah was reminded of the long, long history of the Church, of traditions that preceded Markwart, and even the last dozen Father Abbots before him. Again Jojonah felt as if Avelyn\u0027s tangible spirit was about him and in him, and he was overcome with a desire to dig deeper into the Order\u0027s past, to look for the way things had once been so many centuries before. For Master Jo-jonah could hardly believe that the Church as it now existed could have become such a dominant religion. These days, people were drawn to the Church out of heritage; they were \"believers\" because their parents had been, their grandparents had been, their grand-parents\u0027 parents had been. Few were like Al\u0027u\u0027met, he understood, recent converts, members out of their heart and not their heritage. It could not have been like that in the beginning, Jojonah rea-soned. St.-Mere-Abelle, so vast and impressive, could not have been built with the few who would have agreed, in heart, with the teachings of the present-day Church. Bolstered by his insight, Master Jojonah approached the strong gates of St.-Mere-Abelle, the place he had called home for more than two-thirds of his life, the place that now seemed to him a fa-cade. He did not yet understand the truth of the abbey, but, with Avelyn\u0027s spirit guiding nun, he meant to find it out.","sourceLink":"https://allnovel.net/the-demon-spirit-the-demonwars-saga-2/page-19.html","bookId":2168,"book":{"id":2168,"title":"The Demon Spirit (The DemonWars Saga #2)","description":"Storyline: The Demon Spirit (The DemonWars Saga #2) Elbryan and Pony--soul mates from childhood who grew even closer over time--fervently hope that the tide of darkness is at last receding from the land of Corona. Yet if evil is on the retreat, why are hordes of goblins and bloody-capped powries slashing their way ever-deeper into civilized lands? A sinister threat now looms over Corona, for the power of the demon dactyl was not entirely vanquished by the sacrifice of the monk Avelyn Desbris. Instead, its darkness has infiltrated the most sacred of places--as a once-admired spiritual leader rededicates his life to the most vicious, most insidious revenge against the forces of good. There may be no stopping the spread of the malignant evil . .","cover":"https://allnovel.net/images/the-demon-spirit-the-demonwars-saga-2.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-demon-spirit-the-demonwars-saga-2.html","creation":"Oct 5, 2019 8:58:25 AM","modification":"Oct 5, 2019 6:32:40 PM"}}
