{"id":98365,"no":23,"title":"Page 23","content":"Of all the duties for the young monks at St.-Mere-Abelle, Brother Dellman found this one the most painful. He and two other monks were braced against spokes on a giant wheel crank, bending their backs to turn the thing, grunting and groaning, digging in their heels, but slipping often against the tremendous weight.\n Down below, far, far below, supported by heavy chains - which themselves weighed more than a thousand pounds - was a great block of stone. Good stone, solid, taken from an underground quarry just inside the southernmost courtyard of St.-Mere-Abelle. The wide expanse of that quarry was reached through the lower tunnels of the original abbey - in fact, Master Jojonah, huddled in the lower libraries, could sometimes hear the chipping of the stones - but the best way to bring stones needed for the upper walls of the abbey was by use of this crank.\n The pain and the struggle were good for the young monks, in the eyes of the masters and the Father Abbot.\n Another day, Brother Dellman might have agreed with that. Physical exhaustion was good for the soul. But not today, not so soon after his return from a long and difficult journey. He wanted nothing more than to go to his eight-foot-square chamber and curl up on his cot.\n \"Push on, Brother Dellman,\" scolded Master De\u0027Unnero in his sharp voice. \"Would you force brothers Callan and Seumo to do all the work?\"\n \"No, Master De\u0027Unnero,\" Brother Dellman grunted, bending his shoulder to press harder against the spoke and driving on, the muscles in his legs and back straining and aching. He closed his eyes and issued a long and low groan.\n But then the weight seemed to grow suddenly, the wheel pushing back. Dellman\u0027s eyes popped open wide.\n \"Hold it fast, brother!\" Dellman heard Callan cry. He saw the man, lying on the ground, then noted Seumo skittering, off-balance, to the side.\n \"Peg it!\" Master De\u0027Unnero shouted, meaning that someone, anyone, should drive the locking peg back into the crank.\n Poor Dellman fought with all his strength, pressed as hard as he could against the wheel. But his feet were inevitably beginning to slide. Why wasn\u0027t Callan back at the wheel? he wondered. And why wouldn\u0027t Seumo get up? Why were they moving so slowly?\n He thought to let go and spring out of harm\u0027s way, but knew that to be impossible. With no one bracing the wheel, the spin would be too fast, too sudden, and he would be smashed and thrown.\n \"Peg it!\" he heard De\u0027Unnero cry again, but everyone seemed to be moving in so slowly!\n And the wheel was winning now, Dellman\u0027s muscles strained past their breaking point.\n Then he was moving backward, bending over, all his joints seeming to go the wrong way. He heard the sudden snap, like a whip, as one of his legs exploded in pain, and then he was rolled over backward. One of his arms was hooked, though, and the spin-ning wheel took him on a wild ride, finally throwing him far and wide, to smash hard against a water trough, shattering its side, and his shoulder.\n He lay there, barely conscious, drenched and covered with mud and blood.\n \"Carry him to my private chambers,\" he heard a voice, De\u0027Un-nero\u0027s, he thought.\n Then the master was right before him, leaning over, seeming truly concerned. \"Fear not, young Brother Dellman,\" De\u0027Unnero said, and though it appeared he was trying to be comforting, his voice still held that wicked edge. \"God is with me, and by His power I will help to mend that broken body.\"\n The pain grew more intense suddenly as Callan and Seumo took the battered young monk by the arms and lifted him. Waves of agony rolled over poor Brother Dellman, fires ignited within every muscle of his body. And then he was sinking, sinking, into a pro-found blackness.\n The days blended into one, for he did not notice their passing. Time held no meaning for Master Jojonah now. He left the lower li-brary only when the physical needs of his body forced him out, and returned as soon as possible. He had found nothing useful among the stacks and stacks of tomes and parchments, but knew he was close. He felt it, in his heart and soul.\n He glanced often at the shelf of forbidden books, wondering if, perhaps, they had been placed off-limits not because of any evil penning, but because they held a truth that would prove damning to the present leaders of the Abellican Order. After many such mus-ings, even one point where he rose and took a few steps for the shelf, Master Jojonah laughed aloud at his own paranoia. He knew those books, for he had helped to inventory them as one of his requirements before he attained the rank of immaculate. There were no hidden truths there; those were the books of evil, of dactyl earth-magic and of perverting the powers of the sacred stones for evil purposes, for summoning demons or animating corpses, for causing plague or withering crops - unacceptable practices even in times of war. From a private Masters\u0027 Gathering, Jojonah knew that one of the books, in fact, described a massive crop destruction the Church leveled on the southern kingdom of Behren in God\u0027s Year 67, when Behren and Honce-the-Bear had been embroiled in a bitter war for control of the passes through the Belt-and-Buckle mountain range. The famine had turned the tide of battle, but the cost in terms of innocent lives and lasting enmities had not, in ret-rospect, been worth the gain.\n No, those books shelved in the dark corner of the lower library held no measure of justice and truth, unless that was in the lessons to be learned from terrible past mistakes.\n But Jojonah had to remind himself of that quite often as the days wound on without any dramatic success. And one other thing began to nag at the sensibilities of the gentle master, growing in him until it proved a tremendous distraction: the plight of Markwart\u0027s prisoners. They were paying dearly, perhaps had already paid the supreme price, for the sake of his delay here. A large part of Jojonah\u0027s conscience screamed at him to go and see to those poor people and to the centaur, who, if he had been with Avelyn when the dactyl demon was defeated, was indeed heroic.\n But Jojonah could not pull himself away, not yet, and so he had to sublimate his worries about the prisoners. Perhaps his work here would save them, he told himself, or perhaps it would prevent any such atrocities from being committed by the Church in the future.\n He was beginning to make some progress, at least. The library was not as haphazardly laid out as he had first believed. It was di-vided into sections, and those, roughly, were set out chronologi-cally, dating from the very earliest days of the Church to the time less than two centuries before, when the newer libraries were con-structed and this place became a vault and not a working area. For-tunately for Jojonah, most of the writings of the time in which Brother Allabarnet lived, at least those collected from outside St.-Mere-Abelle, were stored down here.\n As soon as he discovered the general layout, Master Jojonah began his search among the very earliest tomes, those dating back before God\u0027s Year 1, the Great Epiphany, the Renewal, which separated the Church, Old Canon and New Canon. Jojonah figured that his answers might lie in the time before the Renewal, at the very inception of the organized Church, the time of Saint Abelle.\n He found no answers there; what few pieces remained - and fewer still that remained legible - were decorous works, songs mostly, exalting the glory of God. Many were written on parch-ments so brittle that Jojonah did not dare to even handle them, and others were carved on tablets of stone. The writings of Saint Abelle were not down here, of course, but were on display in the higher li-brary. Jojonah knew them by heart, and remembered nothing about them that would help in his quest. The teachings were general mostly, wise words about common decency, and open to many in-terpretations. Still, the master vowed to go and view them again, when the time presented, to see if he might read them in a new lightwith his new insights, to see if they might afford him some hint of the true precepts of his Church.\n What Jojonah most wanted down here was to find the Abbot\u0027s Doctrine of that momentous year of the Great Epiphany, but he knew that to be impossible. It was one of the great travesties of the Abellican Order that the original Abbot\u0027s Doctrine had been lost, centuries before.\n So the master went on with what was available, moving to the writings immediately following the creation of the New Canon. Jojonah found nothing. Nothing.\n A man of lesser heart would have surrendered to the daunting task, but the thought of quitting never entered Jojonah\u0027s mind. He continued his chronological scan, found some promising hints among the writings of the early Father Abbots, a turn of a phrase, for instance, that he could never imagine Markwart saying.\n And then he found a most interesting tome indeed, a small book, bound in red cloth, and penned by a young monk, Brother Francis Gouliard in God\u0027s Year 130, the year after the first journey to Pimaninicuit following the Great Epiphany.\n Jojonah\u0027s hands trembled as he gingerly turned the pages. Brother Francis - and how ironic that name seemed! - had been one of the Preparers on that journey, and he had returned and penned his story!\n That alone hit Jojonah profoundly; monks returning from Pimaninicuit now were discouraged, indeed even prohibited, from ever speaking of the place. Brother Pellimar had come back wag-ging his tongue, and not coincidentally, he had not survived for long. Yet back in Francis Gouliard\u0027s time, the Preparers were en-couraged, according to the text, to detail their accounts of the journey!\n Though it was cool in the dark room, Jojonah felt sweat bead-ing on his forehead, and he took care so that it did not drop on the delicate pages. Fingers trembling, he gingerly turned the page and read on:\n to finde thee thy smallst stones of greye and redde, that thee may prepare ample to bringe Godly healing to all the knowne worlde.\n Master Jojonah sat back and took a deep and steadying breath. Now he understood why the abbey held such a huge cache of small hematites, the small stones of gray and red! The next passage, in which Brother Francis Gouliard wrote of his fellow voyagers, struck the master even more profoundly:\n Thirty-and-three brothers did crewe the Sea Abelle, men younge and strange, trained well and trusted well to bringe we two Preparers to Pimaninicuit and back And then did all thirty-and-one (for two had died on the voyage) join in the final cataloguing and preparing.\n \"Brothers,\" Jojonah mouthed softly. \"On theSea Abelle. They used monks.\" The master found it hard to speak through breath that would not come. A flood of tears streamed down his face as he re-called the fate of theWindrunner and her unfortunate crew, hired men, and one woman, and not brothers. It took him a long time to compose himself and read on. Brother Francis Gouliard\u0027s style was difficult, many of the words too arcane for Jojonah to decipher, and the man tended to pen in a stream-of- consciousness manner, in-stead of purely chronologically. A few pages on and Francis was describing the departure from St.-Mere-Abelle, the beginning of the voyage.\n And there it was before Jojonah, an edict from Father Abbot Benuto Concarron in his farewell speech to the good ship and crew, demanding that the Abellican Order spread the wealth of God, the gemstones, along with the word of God.\n Piety, dignity, poverty.\n The tears came freely; this was the Church that Jojonah could believe in, the Church that had coaxed in a man as pure of heart as Avelyn Desbris. But what had happened to so alter this apparent course? Why were thestones of greye and redde still within St.-Mere-Abelle? Where went the charity?\n \"And where is it now?\" he asked aloud, thinking again of the poor prisoners. Where had the Church of Brother Francis Gouliard and Father Abbot Benuto Concarron gone?\n \"Damn you, Markwart,\" Master Jojonah whispered, and he meant every word. He tucked the book under his voluminous robes and left the cellars, going straight to the privacy of his room. He thought that he should look in on Brother Braumin, but decided that course could wait, for there was another matter that had been weighing heavily on Jojonah for several days.\n So he was soon descending once more into the lower levels of St.-Mere- Abelle, on the other side of the great abbey, down to the rooms Father Abbot Markwart had converted into dungeons. He was not really surprised when he was met by a monk standing guard, the young man moving to block his path.\n \"I\u0027ll not stand and argue with you, young brother,\" Jojonah blus-tered, trying to sound imposing. \"How many years have passed since you traveled the Gauntlet of Willing Suffering?\"\n Indeed the formidable master was imposing to the poor young brother! \"One year, Master,\" he said softly. \"And four months.\"\n \"One year?\" Jojonah boomed. \"And yet you dare to block my way? I attained the rank of master before you were born, and yet you stand before me now, telling me that I cannot go on.\"\n \"The Father Abbot - \"\n Jojonah had heard enough. He reached across, bringing his arm along the young monk\u0027s side, and bulled his way past, staring hard at the young man, daring him to try and stop the move.\n The young monk stuttered over a few protests, but only stamped his foot in impotent frustration as Jojonah continued on down the stairs. At the bottom two more young monks stood to block Jojonah\u0027s way, but he didn\u0027t even bother to speak with them, just continued on, pushing through, and again they didn\u0027t dare try to physically stop him. One did follow, though, complaining every step, while the second ran back the other way - to inform Father Abbot Markwart, Jojonah knew.\n He was treading on dangerous ground here, Jojonah knew, per-haps pushing the Father Abbot too far. But the book he had found had only bolstered his resolve to stand strong against Markwart\u0027s injustices, and he vowed silently that he would not be turned away, whatever the punishment, that he would check on the poor pris-oners, just to make sure they were alive and not being treated too badly. Jojonah was risking a great deal, and could rationally argue that the long-term greater good called for him to continue to remain quiet and obscure. But that course would not do much to help the poor Chilichunks and the heroic centaur; that argument, Jojonah knew, was one that men such as Markwart often used to justify un-godly or cowardly actions.\n So he didn\u0027t even care that he might be pushing Markwart to the very edge of rage. He pressed on, through one door, by another startled young monk, and down another stair. Then he paused, Brother Francis standing before him.\n \"You should not be down here,\" Francis remarked.\n \"By whose command?\"\n \"Father Abbot Markwart,\" Francis answered without hesitation. \"Only he, myself, and Master De\u0027Unnero are to be allowed past the lower stairs.\"\n \"A worthy crew,\" Master Jojonah said sarcastically. \"And why is that, Brother Francis? That you might torture the poor innocent prisoners in privacy?\" He said it loudly, and took some satisfaction in the uncomfortable shuffling of feet he heard from the young guard standing behind him.\n \"Innocent?\" Francis echoed skeptically.\n \"Are you so ashamed of your actions that they must take place down here, away from all prying eyes?\" Master Jojonah pressed, moving forward another step as he spoke. \"Yes, I have heard the tale of Grady Chilichunk.\"\n \"An accident on the road,\" Francis protested.\n \"Hide thy sins, Brother Francis!\" Jojonah replied. \"Yet they re-main sins all the same!\"\n Francis snorted derisively. \"You cannot comprehend the meaning of this war we wage,\" he protested. \"You show pity for criminals, while innocents pay dearly for their crimes against the Church, against all of Mankind!\"\n Master Jojonah\u0027s answer came in the form of a heavy left hook. Brother Francis was not caught completely unawares, though, and managed to turn so the blow only grazed his face, and as Master Jojonah overbalanced from the miss, the younger monk leaped be-hind him, locking him in a tight choke hold and twisting hard, stealing the man\u0027s balance.\n Master Jojonah squirmed and twisted, but only for a moment, for the blood supply was cut short and his brain, starved, fast drifted into unconsciousness.\n \"Brother Francis!\" the younger monk yelled, panicking, and he rushed forward, trying to separate the two. Francis willingly let go, allowing the heavy Jojonah to slump to the floor.\n He heard the footsteps sharp against the wood. Pacing, pacing, and he fell into the rhythm of that stride, went along with it, let it carry him back to the world of the living. The light seemed harsh to his eyes, which had known so much darkness in the previous days, but as soon as he found his focus, he knew exactly where he was: propped in a chair in the private room of Father Abbot Markwart.\n Markwart and Brother Francis stood before him, neither ap-pearing very pleased.\n \"You attacked another monk,\" Father Abbot Markwart began curtly.\n \"An impertinent subordinate needing a scolding,\" Master Jojo-nah replied, rubbing the weariness from his eyes. \"A brother des-perately in need of a good thrashing.\"\n Markwart looked over at the smug Brother Francis. \"Perhaps,\" he agreed, merely to deflate the puffy young man. \"And yet,\" Markwart continued, turning his attention squarely back to Jojo-nah, \"he was only acting as I instructed.\"\n Master Jojonah fought hard to maintain control, for he wanted, desperately wanted, to burst loose of his pragmatic bonds and tell Markwart, wicked Markwart, exactly what he thought of him and his so off- course Church. He just chewed his lip and let the old man continue.\n \"You abandon your duties to support the cause of Brother Alla-barnet,\" the Father Abbot fumed. \"A worthy cause, so I thought, given the fate of poor Abbot Dobrinion, for the monks of St. Pre-cious are in need of some morale at this dark time. And yet you abuse the free time I allow you and find yourself across the whole of the abbey, meddling in affairs which do not concern you.\"\n \"Am I not to care that we have innocent prisoners hanging from dungeon walls?\" Master Jojonah replied, his voice firm and strong. \"Am I not to care that people who have committed no crimes and no sins, and a centaur who may indeed be a hero, stand in this sup-posedly holy sanctuary\u0027s dungeons in chains, and are subjected to torture?\"\n \"Torture?\" scoffed the Father Abbot. \"You know nothing of it!\"\n \"Thus I tried to find out,\" Jojonah countered. \"Yet you would deny me that, would deny all eyes.\"\n Again Markwart scoffed. \"I would not subject the frightened Chilichunks and the potentially dangerous Bradwarden to the pri-vate inquisitions of others. They are my responsibility.\"\n \"Your prisoners,\" Jojonah corrected.\n Father Abbot Markwart paused and took a deep breath. \"Pris-oners,\" he echoed. \"Yes, they are. No sins, say you, yet they are in league with the thieves who hold the stolen stones. No crimes, say you, yet we have every reason to believe that the centaur was in league with the demon dactyl, and only the accidental destruction of Aida prevented him from joining in the rampage against all the godly people of the world!\"\n \"Accidental destruction,\" Jojonah echoed incredulously, sarcas-tically.\n \"That is the decision of my investigation!\" Markwart yelled suddenly, moving very near the sitting master, and Jojonah thought for a moment that the man meant to strike him. \"You chose at this time to pursue another course.\"\n If only you understood the truth of that,Jojonah silently replied, and was quite glad then that he had hidden the ancient book in his room before he tried to get to the prisoners.\n \"And yet you could not even hold true to that course!\" Markwart went on. \"And while you were at your work, buried in ancient writ-ings that bear no importance to the present dangerous situation, one of our younger brothers nearly met his doom!\"\n That perked up Jojonah\u0027s ears.\n \"In the courtyard,\" Markwart went on. \"Doing work that Master Jojonah would normally oversee, but that Master De\u0027Unnero had to watch over, in addition to the other laborers he was directing. Perhaps that was why he could not react in time when two of the three brothers slipped off the wheel, when the third, poor Dellman, was nearly broken in half by the sudden weight.\"\n \"Dellman!\" Jojonah cried, nearly coming out of his seat, forcing Markwart to take a step back. Panic crept through Jojonah\u0027s mind; he worried suddenly for Brother Braumin, whom he had not seen in days. How many \"accidents\" had there been?\n He realized, though, that his excitement only implicated Dell-man as a fellow conspirator, and so he worked hard to control him-self, to settle back into his chair. \"The same Brother Dellman who accompanied us to Aida?\" he asked.\n \"The only Brother Dellman,\" Markwart sternly replied, seeing right through the ruse.\n \"Such a pity,\" Jojonah remarked. \"He is alive, though?\"\n \"Barely, and perhaps not for long,\" the Father Abbot answered, going into his pacing once more.\n \"I will see to him.\"\n \"You will not!\" the Father Abbot snapped. \"He is under the care of Master De\u0027Unnero. I forbid you from trying to so much as speak to him. He does not need to hear your apologies, Master Jojonah. Let the guilt of your absence weigh on your mind. Perhaps that will lead you back to your true duties and purpose.\"\n The thought that he was somehow responsible was prepos-terous, of course, but Jojonah understood the subtle meaning be-hind it. Markwart was only using that excuse to keep him away from Brother Dellman, to keep his influence from the man while De\u0027Unnero, the master so proficient at bending the minds of the brothers sent on Avelyn\u0027s trail, worked his wicked way.\n \"You are my witness to this, Brother Francis,\" Markwart said. \"And I warn you, Master Jojonah, if I hear that you go anywhere near Brother Dellman, the consequences will be dire - for you and for him.\"\n It surprised Jojonah that Markwart had drawn so clear a line in the sand, had all but openly threatened him. Things were going Markwart\u0027s way, it seemed to Jojonah, so why had he taken such a bold step as that?\n He didn\u0027t press the issue, simply nodded and left, and had no in-tention of crossing Markwart\u0027s line anytime soon. It would be better for Brother Dellman, he reasoned, if he broke all connection with the man for the time being. Besides, Jojonah was only begin-ning his work. He took a quick meal, went to his room and sighed profoundly in relief to find the tome still in place. Then he went right back to the lower stairs, heading again for the ancient libraries, for more pieces to this ever-more- interesting puzzle.\n The doors were sealed, barred by heavy planks. One young monk, a man Jojonah did not know, was standing guard.\n \"What is the meaning of this?\" the master asked.\n \"No entrance to the lower libraries at this time,\" the man me-chanically replied. \"By order of - \"\n Before he had even finished, Master Jojonah stormed away, taking the stairs two at a time. He was not surprised to find Father Abbot Markwart waiting for him in his private quarters, this time alone.\n \"You said nothing about ending my work,\" Master Jojonah began, feeling his way cautiously into this fight, for he believed this one might prove conclusive.\n \"Now is not the time to worry about Brother Allabarnet\u0027s saint-hood,\" the Father Abbot replied calmly. \"I cannot afford to have one of my masters wasting precious time in the dungeons.\"\n \"A curious choice of words,\" Jojonah came back, \"considering that you have many of your most trusted brothers wasting time in dungeons of another sort.\"\n He saw the flicker of anger in the old man\u0027s eyes, but Markwart got it quickly under control. \"The canonization process will wait until the war is ended,\" he said.\n \"By all reports, it may already be over,\" Jojonah was quick to reply.\n \"And until the threat to our Order is ended,\" Markwart added. \"It is reasonable to assume that if a powrie could get to Abbot Dobrin-ion, then none of us are safe. Our enemies are desperate now, for their war is going badly, and it is prudent to believe that they might begin a larger campaign of assassinating important leaders.\"\n Jojonah had to fight very hard to hold his tongue, to stop from accusing Markwart then and there of facilitating Dobrinion\u0027s murder. He didn\u0027t care anymore for his personal well-being, would have laid into Markwart openly, publicly, beginning an internal struggle that would likely cost him his life. But he could not, he re-minded himself many times in the next few seconds. There were others to consider - Dellman, Braumin Herde, Marlboro Viscenti, and the poor prisoners. For their sake, if not his own, he could not begin the open battle against Markwart.\n \"The process will also wait until the stolen gemstones are re-turned,\" Markwart went on.\n \"Thus I will sit idle, wasting my time in the upper levels,\" Jojonah did dare to remark.\n \"No, I have other plans for you,\" Markwart replied. \"More important matters. You are obviously well again - fit enough to at-tack another monk - and so you should prepare yourself for the road.\"\n \"You just said that the sainthood would wait,\" Jojonah responded.\n \"So I did,\" Markwart replied. \"But your destination is no longer St. Honce. You will go to Palmaris, to St. Precious, to witness the appointment of a new abbot.\"\n Master Jojonah could not completely hide his surprise. There was no monk at that abbey prepared for the job, and thus, as far as he knew, nothing of succession had even been discussed, and would be a matter for the College of Abbots later that year.\n \"Master De\u0027Unnero,\" Father Abbot Markwart answered his un-spoken question.\n \"De\u0027Unnero?\" Jojonah echoed incredulously. \"The junior master in all of St.-Mere-Abelle, a man prematurely promoted due to the death of Master Siherton?\"\n \"The murder of Master Siherton, by Avelyn Desbris,\" Markwart was quick to remind.\n \"He will assume the leadership of St. Precious?\" Jojonah con-tinued, too engrossed to even feel the sting of that last verbal barb. \"Surely that position is of utmost importance, given the fact that Palmaris remains closest to the lines of battle.\"\n \"That is exactly why I chose De\u0027Unnero,\" Markwart replied calmly.\n \"You chose?\" Jojonah echoed. There was little precedence for such a move; the appointment of an abbot, even one coming from within the ranks of the affected abbey, was no small matter, one open to the collective reasoning of the College of Abbots.\n \"There is no time to convene the College prematurely,\" Markwart explained. \"Nor can we wait until the scheduled meeting in Calember. Until then, acting on what I deem to be emergency cir-cumstances, I have appointed Master De\u0027Unnero as Dobrinion\u0027s replacement.\"\n \"Temporarily,\" Jojonah said.\n \"Permanently,\" came the stern reply. \"And you, Master Jojonah, will accompany him.\"\n \"I just returned from many weeks on the road,\" Jojonah pro-tested, but he knew he was defeated, and understood that he had erred in trying to get to the prisoners, in pushing hard against Markwart. And now he would pay. Markwart had been well within his rights to halt the canonization process for the time being, and whether or not the Father Abbot\u0027s choice of De\u0027Unnero for abbot would stand would be decided at the fall College of Abbots, and not before. Jojonah was out of excuses and out of dodges.\n \"You will remain at St. Precious to aid Master... Abbot De\u0027Un-nero, as his second,\" Markwart went on. \"If it pleases him, you may return to St.- Mere-Abelle with him for the College.\"\n \"I outrank him.\"\n \"No more,\" Markwart replied.\n \"I... the College will not stand for this!\" Jojonah protested.\n \"That will be determined in mid-Calember,\" Markwart replied. \"If the other abbots and their voting seconds see fit to overrule me, then perhaps Jojonah will be appointed abbot of St. Precious.\"\n But by that time, Jojonah knew, Markwart would likely have his gemstones back, and all of those monks (who had been in league with, or even friendly to, Jojonah\u0027s cause) would have been weeded out of St.-Mere- Abelle, the victims of \"accidents\" like the one that befell Brother Dellman, or converted to Markwart\u0027s way of thinking by a barrage of lies and threats. Or, for those brothers of conviction like himself, Markwart would find missions in faraway, dangerous lands. Until this moment, Master Jojonah had not truly appreciated how formidable a foe the old Father Abbot would prove to be.\n \"Perhaps we will meet again,\" Markwart said, waving his hand dismissively. \"For the sake of peace of mind for both of us, I hope not.\"\n And so it ends, Master Jojonah thought. \n","sourceLink":"https://allnovel.net/the-demon-spirit-the-demonwars-saga-2/page-23.html","bookId":2168,"book":{"id":2168,"title":"The Demon Spirit (The DemonWars Saga #2)","description":"Storyline: \n The Demon Spirit (The DemonWars Saga #2) \n Elbryan and Pony--soul mates from childhood who grew even closer over time--fervently hope that the tide of darkness is at last receding from the land of Corona. Yet if evil is on the retreat, why are hordes of goblins and bloody-capped powries slashing their way ever-deeper into civilized lands? \n A sinister threat now looms over Corona, for the power of the demon dactyl was not entirely vanquished by the sacrifice of the monk Avelyn Desbris. Instead, its darkness has infiltrated the most sacred of places--as a once-admired spiritual leader rededicates his life to the most vicious, most insidious revenge against the forces of good. There may be no stopping the spread of the malignant evil . .\n \n","cover":"https://allnovel.net/images/the-demon-spirit-the-demonwars-saga-2.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-demon-spirit-the-demonwars-saga-2.html","creation":"Oct 5, 2019 8:58:25 AM","modification":"Oct 5, 2019 6:32:40 PM"}}
