{"id":98374,"no":32,"title":"Page 32","content":"The ranger carefully marked the walls at every intersection, and there were many in this maze of ancient and unused corridors. The four wandered for more than an hour, at one point chopping their way through a door and dismantling a bricked barrier before finally happening upon an area that seemed familiar to Jojonah. \"We are near the center of the abbey,\" the monk explained. \"To the south is the quarry, and the ancient crypts and libraries; to the north, the corridors that used to serve as living quarters for the brothers, but now serve Markwart as dungeon cells.\" Without any prompting, the master led the way, moving carefully and quietly. Soon after, Elbryan doused the torch, for the flickering of fire-light could be seen up ahead. \"Some of the cells are there,\" Jojonah explained. \"Guarded?\" asked the ranger. \"Possibly,\" the monk replied. \"And it could be that the Father Abbot himself, or one of his powerful lackeys, is nearby, interro-gating the prisoners.\" Elbryan motioned for Juraviel to take up the point. The elf moved far ahead, returning a few moments later to report that two young men were indeed standing a calm guard in the area of torchlight. \"They are not wary,\" Juraviel explained. \"They would expect no trouble down here,\" Master Jojonah said with confidence. \"You stay here,\" Elbryan said to the monk. \"It would not be wise for you to be seen. Pony and I will clear the way.\" Jojonah dropped an anxious hand on the ranger\u0027s forearm. \"We\u0027ll not kill them,\" Elbryan promised. \"They are trained fighters,\" Jojonah warned, but the ranger hardly seemed to be listening, already moving ahead, Pony and Juraviel by his side. As they neared the area, Elbryan moved in front, then went down low to one knee, peering around an earthen bend. There stood the two young monks, one stretching and yawning, the other leaning heavily against the wall, half asleep. Suddenly the ranger was between them, elbow lashing out at the leaning monk, slamming him hard into the wall. Up snapped Elbryan\u0027s backhand the other way, dropping the yawning monk even as he opened wide his eyes and started to protest. The ranger turned back to the one now slumping even lower against the wall, wrapping the man, spinning him over and putting him facedown to the floor, while Pony and Juraviel came in on the other, who was too dazed from the heavy hit to offer any resistance. Using fine elven twine, they bound the men, and gagged them and blindfolded them using their own monk robes, and the ranger dragged them down a dark side passage. By the time he returned, Jojonah was back with the group, and Pony was standing outside a wooden door, staring hard at it. As soon as Jojonah had identified it as Pettibwa\u0027s cell, Pony started toward it as if she meant to burst right in. But now she could not. The stench told her the truth, the same smell she had known in sacked Dundalis those many years before. Elbryan was beside her in an instant, steadying her as she finally lifted the latch and pushed open the door. The torchlight splayed into the filthy room, and there, amidst her own waste, lay Pettibwa, the skin on her thick arms slack and hanging, her face so very pale and hugely bloated. Pony stumbled to her, fell to her knees beside the woman and moved to cradle Pet-tibwa\u0027s head, but the body would not bend, and so the woman low-ered her head to Pettibwa instead, her shoulders bobbing with sobs. She had known nothing but love for this foster mother, the woman who had seen her into adulthood, who had taught her so much about life and love, and about generosity, for in those years long past, Pettibwa had no practical reason to take in the orphaned Pony. Yet she had accepted Pony into her family fully, shown the girl as much love and support as she gave to her own son, and that was considerable indeed. And now she was dead, and in no small part because of that loving generosity. Pettibwa was dead because she had been kind to an orphaned child, because she had served as mother to the woman who became an outlaw of the Church. Elbryan held Pony close and tried to hold together her emotions - so many whirling emotions: guilt and grief, sheer sadness and a great emptiness. \"I need to talk to her,\" Pony said repeatedly, her words coming out over sobbing gasps. \"I need - \" Elbryan tried to comfort her, tried to hold her steady, and grabbed her arm when she reached for the soul stone. \"She has been gone too long,\" the ranger said. \"I can find her spirit and say good-bye,\" Pony reasoned. \"Not here, not now,\" Elbryan softly replied. Pony started to protest, but finally, with trembling hand, re-placed the gem in her pouch - though she kept her hand close to it. \"I need to talk to her,\" she said more firmly, and turned from her lover to the corpse once more, bending low and whispering fare-wells to her second mother. Jojonah and Juraviel watched from the doorway, the monk hor-rified, though surely not surprised that the woman had not survived the wrath of Markwart. He was embarrassed as well that one of his Order, indeed the very leader of his Order, had done this to the in-nocent woman. \"Where is the other human?\" Juraviel asked. Jojonah nodded to the next cell in line, and they both went quickly - only to find Graevis hanging dead, the chain still wrapped about his neck. \"He escaped the only way he could,\" Jojonah said somberly. Juraviel went right to the corpse, carefully turning it out of the chain choker. Graevis\u0027 stiff form contorted weirdly as it fell to the length of the single shackle, but better for Pony to see him like that, the elf reasoned, than in his death pose. \"She needs to be alone,\" Elbryan said to them, joining Jojonah in the doorway. \"A bitter blow,\" Juraviel agreed. \"Where is Bradwarden?\" the ranger asked Jojonah, his tone stern, forcing the guilt-ridden monk to retreat a step. Elbryan rec-ognized Jojonah\u0027s horror at once, though, and so he put a com-forting hand on the monk\u0027s broad shoulder. \"It is a difficult time for us all,\" he offered. \"The centaur is farther along the corridor,\" Jojonah explained. \"If he lives,\" Juraviel put in. \"We will go to him,\" the ranger said to the elf, motioning for Jojonah to lead on. \"You stay close to Pony. Protect her from ene-mies and from her own turmoil.\" Juraviel nodded and came out of the cell as Elbryan and Jojonah made their quiet way along the corridor. Juraviel went back to Pony then, telling her gently that Graevis, too, was dead, then em-bracing her as sobs of grief washed over her. Jojonah followed the ranger farther down the low corridor, guiding Elbryan past intersections with soft whispers. They moved around a final bend into another shadowy, torchlit area, where they saw two doors, one on the left-hand wall and another at the very end of the corridor. \"You think this is ended, but it has only begun!\" they heard a man cry, followed closely by the crack of a whip and a low, feral growl. \"Brother Francis,\" Jojonah explained. \"A lackey of the Father Abbot.\" The ranger started ahead, but stopped fast, and Jojonah faded into the shadows, as the door began to open. The monk, a man of about the same years as Elbryan, stepped out, whip in hand and a very sour expression on his face. He froze in place, eyes going wide as he took note of Elbryan, this stranger standing impassively, sword still in its scabbard. \"Where are the guards?\" the monk asked. \"And who are you?\" \"A friend of Avelyn Desbris,\" Elbryan replied grimly, and loudly. \"And a friend of Bradwarden.\" \"Oh, by the gods, good show!\" came a cry from within the cell, and it surely did Elbryan\u0027s heart good to hear the booming voice of his centaur friend again. \"Oh, but ye\u0027re to get yer due, Francis the fool!\" \"Silence!\" Francis commanded the centaur. He rubbed his hands together and eased the whip out to its length as Elbryan ad-vanced a step - though the ranger still did not bother to draw his sword. Francis lifted the whip threateningly. \"Your friendships alone show you to be an outlaw,\" he said, a nervous edge to his voice de-spite his best efforts to appear calm. The ranger recognized those efforts, but hardly cared whether this man was confident or not. Bradwarden\u0027s voice and the realiza-tion that this man had just used that whip on his centaur friend as-saulted the ranger\u0027s sensibilities, sent him spiraling into that warrior mentality. He continued his advance. Francis pumped his arm but didn\u0027t snap the whip. He shifted un-comfortably and glanced over his shoulder as often as forward. On came Nightbird, Tempest still sheathed at his hip. Now the panicking Francis did try to snap the whip, but Nightbird quick- stepped forward, inside its rolling length, and pushed it aside. The monk threw the weapon at him, turned and sprinted for the door at the end of the corridor. He grabbed at the handle and yanked hard, and the door opened about a foot before Nightbird\u0027s hand was against it, stopping its momentum. With frightening strength the ranger slammed the door closed. Sensing an opening in the ranger\u0027s defenses, Francis spun about and launched a straight right punch for the man\u0027s exposed ribs. But even as his right hand pushed the door, Nightbird stiffened his left hand, holding it fingers up and perpendicular to his body, a foot in front of him. A simple, slight shift, perfectly timed, brushed Francis\u0027 hand out wide, and then Francis\u0027 successive left was turned harmlessly under the ranger\u0027s upraised right arm. Francis tried yet another fast right, and again the ranger picked it off, brushing it out wide with the same blocking hand, only this time he followed it out, keeping the back of his fingers in contact with Francis\u0027 arm. It all seemed too slow to Francis, and too easy, but suddenly the tempo changed, Nightbird rolling his hand fast over Francis\u0027 forearm, grabbing hard and yanking back across his body. He caught Francis\u0027 fist, covering it with his right hand and pulling hard, again with the frightful, undeniable strength. Francis lurched to the side, his arm drawn right across his body and down, and his breath was blasted away by a short, straight left jab to his side, a punch incredibly jarring, given the mere five inches the ranger\u0027s fist traveled. Francis bounced hard against the door and tried to recover, but Nightbird, holding fast the monk\u0027s fist, drove his arm up and under Francis\u0027, and the sudden move-ment at so strange an angle brought a loud, bone-jarring pop from Francis\u0027 elbow. Waves of pain washed over him. His broken arm was thrown up high as he fell back squarely against the door, and the large ranger waded in, hitting him with a right to the stomach that doubled him over, followed by a left uppercut to the chest that lifted his feet right off the ground. A devastating flurry followed, left and right in rapid succession, hammering away, jolting Francis against the door or up into the air. It ended as abruptly as it had started, with Nightbird moving back a step, leaving Francis bent forward from the door, one hand holding his belly, the other hanging limply. He looked up at the ranger just in time to see the roundhouse left hook. It caught him on the side of the jaw, snapped his head violently to the side, and flipped him right over to land on his back on the hard floor. All the world was spinning into blackness for Francis as the large form moved over him. \"Do not kill him!\" he heard from far, far away. Nightbird hushed Jojonah immediately, not wanting his voice to be recognized. He relaxed when he looked closer at his victim, to see that Francis was unconscious. Moving quickly, the ranger dropped a sack over the monk\u0027s head and bade Jojonah to bind him, then went charging into Bradwarden\u0027s cell. \"Taked ye long enough to find me,\" the centaur said cheerily. Elbryan was overcome by the sight, and thrilled, for Bradwarden was indeed very much alive, and looking healthier than the ranger could ever have hoped. \"The armband,\" the centaur explained. \"What a good bit o\u0027 magic!\" Elbryan ran over and embraced his friend, then, remembering that time was not their ally, went right for the large shackles and chains. \"I\u0027m hopin\u0027 ye found a key,\" the centaur remarked. \"Ye\u0027re not for breaking them!\" Elbryan reached into his pouch and produced the packet of red gel, the same substance he had used on the tree against the raiding goblins. He unfolded the packet, then smeared the reddish gel onto the four chains holding the centaur. \"Ah, but ye got more o\u0027 the same stuff ye used in Aida,\" the cen-taur said delightedly. \"We must be quick,\" Jojonah remarked, coming into the room. The sight of him put Bradwarden into a fit, but Elbryan was quick to explain that this was no enemy. \"He was with them that took me from Aida,\" Bradwarden ex-plained. \"With them that put me in chains.\" \"And with them that mean to get you out of these chains,\" the ranger was quick to add. Bradwarden\u0027s visage softened. \"Ah, true enough,\" he surren-dered. \"And he did give me me pipes on the long road.\" \"I am no enemy of yours, noble Bradwarden,\" Jojonah said with a bow. The centaur nodded, then turned his head and blinked curiously as his right arm came down from the wall. There stood Elbryan, Tempest in hand, readying to strike at the chain that held the cen-taur\u0027s right hind leg. \"Good sword,\" Bradwarden remarked, and then, with a single swing, his leg, too, was free. \"Go see to Elbryan,\" Pony said. She was still kneeling beside the body of Pettibwa, but she resolutely straightened her back. \"I doubt that he needs any assistance,\" the elf replied. Pony took a deep breath. \"Nor do I,\" she said, and Juraviel understood that she wanted to be alone. He noted that her hand was again clutched about a stone in the pouch, and that was surely alarming, but in the end he knew that he had to trust in Pony. He kissed her gently on the top of the head, then moved back from her, out the door of the cell but no farther, keeping quiet guard in the torchlit corridor. Pony tried hard to hold control. She put her hand to Pettibwa\u0027s bloated cheek and stroked it gently, lovingly, and it seemed to her as if the dead woman settled easier, as if the pallid color of death was not so obvious. Pony felt something then, a sensation, a rush, a tickle. Confused, wondering if, in her longing to reach out to Pettibwa, she had unin-tentionally slipped under the power of the soul stone she once more held tight in her hand. Following that course, Pony closed her eyes and tried to concentrate. Then she saw them, or thought she did, a trio of spirits, one an old man, rushing through the room. Three spirits: Pettibwa, Graevis, and Grady? The notion startled Pony as much as it intrigued her, but still not understanding, she became afraid and wisely broke all con-nection to the soul stone. She opened her eyes and looked down at Pettibwa - to see the woman looking back at her! \"What magic might this be?\" Pony muttered aloud. Had she subconsciously reached out so powerfully with the soul stone that she had grabbed Pettibwa\u0027s disembodied spirit? Was such resur-rection even possible? She got her terrifying answer as Pettibwa\u0027s eyes flared red with demonic flames and the woman\u0027s face contorted, a guttural snarl coming from her opened mouth. Pony rocked back, too confused, too overwhelmed, to immedi-ately react, and her horror only grew as the corpse\u0027s teeth elongated into pointed fangs. Up came the corpse to a sitting position, too suddenly, plump arms shooting out and clamping hard, with superhuman strength, about Pony\u0027s throat. The horrified young woman thrashed violently, turning her hands into every possible angle to gain leverage but making no headway in dislodging the demon\u0027s powerful grip. But then Juraviel was there, his slender sword slashing hard against Pettibwa\u0027s bloated forearm, opening it wide that the pus and gore could spill out. Elbryan was just about to sever the last of Bradwarden\u0027s chains when Pony\u0027s cry reached his ears. He slashed hard with Tempest, spinning on his heel and taking several steps before the chain even fell to the floor, Jojonah close behind. He came around the bend in full speed, heard a tumult within the cell that held the body of Graevis, and kicked open the door. And then he stopped, stunned, for the animated corpse had bitten right through its one chained wrist and now came toward him, its eyes flaring with red fires, its stump arm leading the way with a spray of blood. Elbryan wanted to go to Pony - above all else, he wanted to get by her side - but he could not rush off, and took some comfort when Jojonah thundered past behind him on his way to Pettibwa\u0027s cell. Out came Tempest and in charged the ranger, meeting the demon creature head-on, ignoring the spray of the bloody stump and slashing away viciously at the reaching arms. \"My mum,\" Pony said repeatedly, falling back against the wall as Juraviel battled the creature. The woman knew rationally that she should go to Juraviel\u0027s side, or that she should use the gemstones now, perhaps the soul stone to force this evil spirit from Pet-tibwa\u0027s body. But she could not act, could not get past the horror at seeing Pettibwa, her adopted mother, in this state! She forced herself to find a level of calm, told herself repeatedly that if she could get into the soul stone, she might learn the truth of this creature. Before she could begin the move, though, Juraviel thrust ahead powerfully, right between the reaching arms, stabbing his sword deep into the corpse\u0027s heart, a sight that froze Pony in place. The demon laughed wildly and batted the elf\u0027s hand from the sword hilt, then swatted Juraviel with a backhand that launched him head over heels. The elf accepted the blow, and was moving with it before it ever connected, diminishing much of the shock. Aflutter of his wings, a perfect twist in midair, landed him squarely on his feet, facing the demon creature - which still had the sword sticking from its chest. Then another form came charging into the small cell, rushing past the elf. Without slowing, Jojonah slammed hard into the demon, burying it under his tremendous weight, taking it heavily into the back wall. And then Bradwarden entered, and the cell was packed full of bodies! \"What is it about?\" the centaur gasped. With an unearthly roar, the demon launched Jojonah away, but Bradwarden found his answers quickly, and as the creature rushed forward, the centaur spun about and hit it with a double-kick that sent it careening back into the wall. Bradwarden moved right in on the creature, front hooves smashing away, fists pounding hard, a sudden and brutal beating that would not allow the demon to find any time to go on the offensive. \"Get her out of here,\" Juraviel instructed Jojonah. As the monk scooped Pony into his arms, the elf leveled his bow and waited for an opening. All the months of Bradwarden\u0027s frustration came pouring out in the next seconds as the centaur rained blow after blow on the demon creature, battering it, tearing bloated flesh, smashing bone into pulp. Still, if he was truly harming the creature, it didn\u0027t show it, just kept trying to find some way to grab at him. But then an arrow popped into one of those red-glowing eyes, and how the demon howled! \"Oh, but ye didn\u0027t like that one!\" the centaur said, using the op-portunity to spin about and drive his rear legs right into the demon face. With the head already pressed against the stone wall, the skull exploded in a shower of gore, but still the body fought on, arms flailing wildly. Jojonah ushered Pony into the hall and set her down against the wall. \"Damned thing, lie down and die!\" came Elbryan\u0027s voice from the next cell. The monk charged away to the door and then looked back, a dis-gusted expression on his face, waving for Pony to stay back. Inside the cell, Elbryan slashed hard with Tempest, abandoning his normal thrusting style, for he had stabbed the creature several times, driving his sword tip deep into flesh and organs, with little effect. So he had gone to a more conventional style, taking up the mighty sword in both hands and swinging it in devastating, slashing motions. One of the demon\u0027s arms was severed at the el-bow, and a downstroke of Tempest took the other, right at the shoulder. Still the creature came on, but a straight-across cut of Tempest stopped its momentum and gave the ranger time to level and line up his backswing. Jojonah looked away, understanding, as the great sword flashed across, lopping the head off. When the monk looked back, his re-vulsion was even greater, for that head, lying to the side against the wall, was still biting at the air, fires still burning in the eyes! And the body continued to press the attack. Elbryan punched out with his fist and knocked the body back, then took up Tempest in both hands, did a complete pivot, coming around with the sword low, taking off one leg. The corpse tumbled to the side, one stump thrashing, one leg kicking, and with the head, just a few inches away, snapping futilely at the air. The fires in the eyes were diminishing, though, and Elbryan soon realized that the fight was over. He rushed back into the hall, past Jojonah, past Bradwarden and Juraviel as they exited the first cell, to grab up the hysterical Pony in his arms. \"Still kicking,\" Bradwarden explained to Jojonah when the monk saw that Pettibwa\u0027s body, the gory remains of its head flap-ping about its shoulders, was still flailing against the wall, tearing at the stone. \"But not for knowing which way to turn,\" the centaur added, closing the door. Jojonah went to the ranger and the woman. Amazingly, Pony was fast composing herself. \"Demon spirits,\" the monk explained, looking Pony right in the eye. \"Those were not the souls of Graevis and Pettibwa.\" \"I saw them,\" Pony stuttered, gasping for breath, her teeth trem-bling. \"I saw them come in, but there were three.\" \"Three?\" \"Two shadows and an old man,\" she explained. \"I thought it was Graevis, though I could not see clearly.\" \"Markwart,\" Jojonah breathed. \"He brought them here. And if you saw them - \" \"Then he saw you,\" Elbryan reasoned. \"We must be gone from this place, and quickly,\" Jojonah cried. \"Markwart is on his way, do not doubt, and with an army of brothers behind him!\" \"Run on,\" said Elbryan, pushing Jojonah toward the same an-cient corridors that had brought them to this cursed place. He glanced back once at the side passage where they had put the guards, then took up the rear of the line, with Pony beside him. They moved as swiftly as the often tight and twisting corridors would allow, and soon came upon the dock doors of the abbey, closed and with the portcullis down, as they had left them. Master Jojonah started for the crank, but Pony, steadier now and with a grim determination set upon her face, held him back. She took out the malachite once more and fell into its magic, and though she was weary and emotionally battered, she brought up a wall of rage and channeled it into the stone. With hardly an effort, it seemed, the portcullis slid up into the ceiling holes. Elbryan went right to the great doors, lifting the locking bar and pulling one open. He moved to put the bar aside, but again Pony, still in the throes of the levitational magic, intervened. \"Hold the bar above the locking latch,\" she instructed. \"Quickly.\" They could hear the terrific strain in her voice, so Bradwarden ushered Jojonah out the open door, while Juraviel went behind Pony and gently eased her along, as well. As she passed the open door and Elbryan, Pony put her other hand, holding the magnetite, against the outside of the metallic door and fell into that magic as well. The portcullis shifted dangerously over Elbryan\u0027s head, but Jo-jonah, understanding what the clever woman meant to do, was at Pony\u0027s side, easing the magnetite from her hand and strengthening the magnetic pull, through the door and onto the metal locking bar. Pony fell fully into the malachite once more, steadying the portcullis as Elbryan, too, came outside. The ranger pulled the door closed, and Jojonah released his magnetic magic, then gave a satisfied sigh as the locking bar fell into place across the latches of the two doors. Then Pony gradually let go of her magic, easing the portcullis down, making it look as if these doors had not been breached. She turned about and blinked in the glare, as did the others, the morning sun low in the sky before her, cutting shafts of light through the thick fog lifting from All Saints Bay. The tide was not in, but it was on the way, and so they set off immediately and at a swift pace, back down the beach and along the trail to their horses. Snarling with rage, and despite the pretests of the two dozen brothers rushing about him, the Father Abbot was the first to crash through the doors to the dungeon area on the lower level. There was the battered Francis, the hood still tight about his head, struggling to stand, being helped by one of the other guards Elbryan had overpowered. Farther along the corridor, just inside the doors of their cells, lay the destroyed bodies of the Chilichunks, Pettibwa\u0027s still thrashing at the floor as the demon spirit struggled to the end. Markwart was not surprised, of course, since he had seen the in-truder, the woman kneeling over Pettibwa, on his escort of the demons, but the other monks could not have expected this grisly scene. Some cried and fell away, others fell to their knees in prayer. \"Our enemies brought demons against us,\" Markwart cried, waving a hand at the plump woman\u0027s body. \"Well fought, Brother Francis!\" With some help from another young brother, Francis finally es-caped the hood and his bonds. He started to explain that he had done little fighting, but stopped in the face of Markwart\u0027s glare. Francis wasn\u0027t certain what was going on here, hadn\u0027t seen the Chilichunks\u0027 animated corpses, and wasn\u0027t sure exactly who had destroyed the demons. He had a fair idea, though, and that notion sent many things careening through his thoughts. Elbryan grew ill at ease, even frightened, as he watched Pony make her way along the trails. Her grunts were not of weariness, though she surely must have been exhausted after her magical feats, but of anger, a primal rage. The ranger stayed close to her, put his hand on her whenever the trail allowed, but she hardly looked at him, just continually blinked away any hint of tears, her jaw set firmly, her gaze locked ahead. At the horses, Pony methodically retrieved the rest of her gemstones. Jojonah offered to use healing hematite on Bradwarden, if the woman would loan him one, but the centaur brushed away that idea before Pony could begin to answer. \"I\u0027m just needing a bit o\u0027 food,\" he insisted, and truly, he did look healthy enough, though quite a bit skinnier than the last time the others had seen him. He patted his arm, the red elven armband securely in place. \"Good gift ye gave to me,\" he said to Elbryan with a wink. \"Our road will be long and fast,\" the ranger warned, but Brad-warden only patted his less than ample belly and laughed. \"I\u0027m running all the faster for me lack o\u0027 belly,\" he said cheerily. \"Then let us go,\" said the ranger. \"At once. Before the monks come out of their abbey to search for us. And let us deliver Master Jojonah to St. Precious on time.\" \"Ride Greystone,\" Pony bade the monk, handing him the reins. Jojonah accepted them without protest, for it made sense that the lighter woman, and not he, should climb on the back of the centaur. But Pony caught them all by surprise, turning not for Brad-warden, but back toward St.-Mere-Abelle, running full out, gem-stones in hand. Elbryan caught up to her twenty yards away and had to tackle her to stop her progress. Now she was indeed crying, shoulders bobbing with sobs, but she fought against him furiously, trying to get free, trying to get back to the abbey to exact some revenge. \"You cannot defeat them,\" the ranger said to her, holding her tightly. \"They are too many and too strong. Not now.\" Pony continued to fight, even unintentionally clawed Elbry-an\u0027s face. \"You cannot dishonor Avelyn like this,\" Elbryan said to her, and that gave her pause. Gasping, tears streaming down her face, she looked at him skeptically. \"He gave you the stones to keep them safe,\" Elbryan explained. \"Yet if you go back to the abbey now, you will be defeated and the gemstones will fall into the hands of our - of Avelyn\u0027s - enemies. They will be taken by the same one who brought such turmoil and pain to the Chilichunks. Would you give him that?\" All strength seemed to fall away from the woman then, and she slumped into her lover\u0027s arms, burying her face in his chest. He led her gently back to the others and put her in place atop Bradwarden, with Juraviel behind her to keep her steady. \"Give me the sunstone,\" he bade her, and when she did, he took it to Jojonah, explaining that they should put up some blocking magic to defeat any magical attempts to find them. Jojonah assured him that such a feat would be easy enough, so the ranger went to Symphony and took the lead as the group thundered away at full gallop, putting St.-Mere-Abelle far, far behind them before the sun climbed high in the eastern sky. \"Find them!\" the Father Abbot fumed. \"Search every passage and every room. All doors barred and guarded! Now! Now!\" The other monks scrambled, some heading back the way they had come to alert the rest of the library. When the reports filtered back to Markwart that the back dock doors had apparently not been opened, the search within the library intensified, and by mid-morning nearly every corner of the great structure had been scoured. The outraged Markwart set up a central reporting area in the abbey\u0027s huge chapel, surrounded by the mas-ters, each in command of a number of searching monks. \"They had to come in, and depart, through the dock doors,\" one of the masters reasoned, a sentiment backed by many. His scouting leader had just returned to him to report that no other door in the abbey showed any sign of entry. \"But the doors were closed and barred, an impossible feat from outside the abbey,\" another master reasoned. \"Unless they used magic,\" someone offered. \"Or unless someone within the abbey was there to meet them, to open the doors for them, to close the doors behind them,\" Mark-wart reasoned, and that thought drew an uncomfortable shift from every man in the room. Soon after, when it was obvious that the enemies were indeed long gone from the abbey, Markwart ordered half the monks out in searching parties and another two dozen out magically, using quartz and hematite. He knew the futility, though, for the Father Abbot was finally getting a true appreciation of the cunning and power of his real enemies. With that hopelessness came a pit of rage deeper than Markwart had ever known, one that he honestly believed would overwhelm him forever. He found relief later that afternoon, though, when he inter-viewed Francis and the two monks who had been on guard near the cells, when he learned more about these intruders who had come to St.-Mere-Abelle, including one who was no stranger to the place. Perhaps he wouldn\u0027t need the centaur and the Chilichunks after all. Perhaps he could shift the blame, even of the original theft of the gemstones by Avelyn, by theorizing about a larger conspiracy within the Order. Now, he understood. Now, he had a scapegoat. And Je\u0027howith would be bringing a contingent of Allheart soldiers. Markwart stood in his private quarters that night, staring out the window. \"We shall see,\" he said, a hint of a grin spreading on his face. \"We shall see.\" \"You\u0027re not even to ask for the stones?\" Pony said, standing on the streets of Palmaris with Elbryan and Master Jojonah. The group had landed earlier that morning north of the city, traveling across the great river on Captain Al\u0027u\u0027met\u0027sSaudi Jacintha, which, fortunately, had still been docked in Amvoy. Al\u0027u\u0027met had agreed to Jojonah\u0027s request for help without question and without pay-ment, and with a promise that not a word of the impromptu ferry would be spoken to anyone. Juraviel and Bradwarden were still in the north, while Elbryan, Pony, and Jojonah entered Palmaris, the monk to return to St. Pre-cious, the other two to check on old friends. \"The sacred gems were given into fine care,\" Jojonah replied with a sincere smile. \"My Church owes you much, but I fear that you will get no just rewards from the likes of Father Abbot Markwart.\" \"And you?\" Elbryan asked. \"I go to deal with one less cunning, but equally wicked,\" Jojonah explained. \"Pity all the monks of St. Precious, to have lost Abbot Dobrinion to Abbot De\u0027Unnero.\" They parted then as friends, with Jojonah retiring to the abbey and the other two moving along the streets of the city, trying to find some information. Pure luck brought them in the path of Belster O\u0027Comely soon after, the man howling with glee to see them both alive. \"What information about Roger?\" the ranger asked. \"He went south with the Baron,\" Belster explained. \"To the King, so I\u0027ve heard.\" That bit of news pleased them immensely and filled them with hope, for word of the Baron\u0027s demise had not yet reached the common folk of Palmaris. With Belster in tow, and Pony leading, they went next to Fel-lowship Way, the tavern that had been Pony\u0027s home for those diffi-cult years after the first sacking of Dundalis. Profound pain assaulted Pony as she looked upon the place, and she could not stay, pleading with Elbryan to get her out of the city, back to the northland where they both belonged. The ranger agreed, but first turned to Belster. \"Go into the Way,\" he bade the innkeeper. \"You have been looking to remain in Pal-maris, so you told me. They will need help in there to keep the busi-ness open and running smoothly. I can think of none better suited for the job than you.\" Before the innkeeper denied the request, he paused long enough to study the ranger and to follow Elbryan\u0027s gaze to Pony. Then he understood. \"The finest tavern in all of Palmaris, so I\u0027ve been told,\" he said. \"It was,\" Pony added grimly. \"And so it shall be again!\" Belster said enthusiastically. He patted Elbryan on the shoulder, gave Pony a great hug, then started for the tavern, a noticeable spring in his step. Pony watched him, even managed a smile, then looked up to Elbryan. \"I love you,\" she said quietly. The ranger returned her smile and kissed her gently on the fore-head. \"Come,\" he said, \"we have friends waiting for us on the road to Caer Tinella.\"","sourceLink":"https://allnovel.net/the-demon-spirit-the-demonwars-saga-2/page-32.html","bookId":2168,"book":{"id":2168,"title":"The Demon Spirit (The DemonWars Saga #2)","description":"Storyline: The Demon Spirit (The DemonWars Saga #2) Elbryan and Pony--soul mates from childhood who grew even closer over time--fervently hope that the tide of darkness is at last receding from the land of Corona. Yet if evil is on the retreat, why are hordes of goblins and bloody-capped powries slashing their way ever-deeper into civilized lands? A sinister threat now looms over Corona, for the power of the demon dactyl was not entirely vanquished by the sacrifice of the monk Avelyn Desbris. Instead, its darkness has infiltrated the most sacred of places--as a once-admired spiritual leader rededicates his life to the most vicious, most insidious revenge against the forces of good. There may be no stopping the spread of the malignant evil . .","cover":"https://allnovel.net/images/the-demon-spirit-the-demonwars-saga-2.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-demon-spirit-the-demonwars-saga-2.html","creation":"Oct 5, 2019 8:58:25 AM","modification":"Oct 5, 2019 6:32:40 PM"}}
