{"id":74953,"no":26,"title":"Page 26","content":"\"I don\u0027t know,\" Sanders said. \"I need help.\"\\n\\n \"Help is here,\" said a soft voice nearby. Sanders looked over and saw an angel, about a foot high. It was white, and hovered in the air near his head. It held a flickering candle in its hands.\\n\\n \"Goddamn,\" Louise said.\\n\\n \"1 am sorry,\" the angel said. \"Is that a command? I do not recognize `Goddamn.\u0027 \"\\n\\n \"No,\" Sanders said quickly. \"It\u0027s not a command.\" He was thinking that he would have to be careful or they would crash the system.\\n\\n \"Very well. I await your command.\"\\n\\n \"Angel: I need help.\"\\n\\n \"Help is here.\"\\n\\n \"How do I enter the Conley-White database?\"\\n\\n \"I do not recognize `the Conley-White database.\u0027 \"\\n\\n That made sense, Sanders thought. Cherry\u0027s team wouldn\u0027t have programmed anything about Conley-White into the Help system. He would have to phrase the question more generally. Sanders said, \"Angel: I am looking for a database.\"\\n\\n \"Very well. Database gateways are accessed with the keypad.\"\\n\\n \"Where is the keypad?\" Sanders said.\\n\\n \"Make a fist with your hand.\"\\n\\n Sanders made a fist and a gray pad formed in the air so that he appeared to be holding it. He pulled it toward him and looked at it.\\n\\n \"Pretty neat,\" Fernandez said.\\n\\n \"I also know jokes,\" the angel said. \"Would you like to hear one?\" \"No,\" Sanders said.\\n\\n \"Very well. I await your command.\"\\n\\n Sanders stared at the pad. It had a long list of operator commands, with arrows and push buttons. Fernandez said, \"What is that, the world\u0027s most complicated TV remote?\"\\n\\n `Just about.\"\\n\\n He found a push button marked OTHER 1311. That seemed likely. He pressed it.\\n\\n Nothing happened.\\n\\n He pressed it again.\\n\\n \"The gateway is opening,\" the angel announced.\\n\\n \"Where? I don\u0027t see anything.\"\\n\\n \"The gateway is opening.\"\\n\\n Sanders waited. Then he realized that the DigiCom system would have to connect to any remote database. The connection was going through; that was causing a delay.\\n\\n \"Connecting . . . now,\" the angel said.\\n\\n The wall of the Corridor began to dissolve. They saw a large gaping black hole, and nothing beyond it.\\n\\n \"That\u0027s creepy,\" Fernandez said.\\n\\n White wire-frame lines began to appear, outlining a new corridor. The spaces filled, one by one, creating the appearance of solid shapes.\\n\\n \"This one looks different,\" Fernandez said.\\n\\n \"We\u0027re connecting over a T-1 high-speed data line,\" Sanders said. \"But even so, it\u0027s much slower.\"\\n\\n The Corridor rebuilt itself as they watched. This time the walls were gray. They faced a black-and-white world.\\n\\n \"No color?\"\\n\\n \"The system\u0027s trying to generate a simpler environment. Color means more data to push around. So this is black and white.\"\\n\\n The new corridor added lights, a ceiling, a floor. After a moment, Sanders said, \"Shall we go in?\"\\n\\n \"You mean, the Conley-White database is in there?\"\\n\\n \"That\u0027s right,\" Sanders said.\\n\\n \"I don\u0027t know,\" she said. She pointed: \"What about this?\"\\n\\n Directly in front of them was a kind of flowing river of black-and white static. It ran along the floor, and also along the walls. It made a loud hissing sound.\\n\\n \"I think that\u0027s just static off the phone lines.\"\\n\\n \"You think it\u0027s okay to cross?\"\\n\\n \"We have to.\"\\n\\n He started forward. Immediately, there was a growl. A large dog blocked their path. It had three heads that floated above its body, looking in all directions.\\n\\n \"What\u0027s that?\"\\n\\n \"Probably a representation of their system security.\" Cherry and his sense of humor, he thought.\\n\\n \"Can it hurt us?\"\\n\\n \"For God\u0027s sake, Louise. It\u0027s just a cartoon.\" Somewhere, of course, there was an actual monitoring system running on the Conley-White database. Perhaps it was automatic, or perhaps there was a real person who actually watched users come and go on the system. But now it was nearly one o\u0027clock in the morning in New York. The dog was most likely just an automatic device of some kind.\\n\\n Sanders walked forward, stepping through the flowing river of static. The dog growled as he approached. The three heads swiveled, watching him as he passed with cartoon eyes. It was a strange sensation. But nothing happened.\\n\\n He looked back at Fernandez. \"Coming?\"\\n\\n She moved forward tentatively. The angel remained behind, hovering in the air.\\n\\n \"Angel, are you coming?\"\\n\\n It didn\u0027t answer.\\n\\n \"Probably can\u0027t cross a gateway,\" Sanders said. \"Not programmed.\"\\n\\n They walked down the gray corridor. It was lined with unmarked drawers on all sides.\\n\\n \"It looks like a morgue,\" Fernandez said.\\n\\n \"Well, at least we\u0027re here.\"\\n\\n \"This is their company database in New York?\"\\n\\n \"Yes. I just hope we can find it.\"\\n\\n \"Find what?\"\\n\\n He didn\u0027t answer her. He walked over to one file cabinet at random and pulled it open. He scanned the folders.\\n\\n \"Building permits,\" he said. \"For some warehouse in Maryland, looks like.\"\\n\\n \"Why aren\u0027t there labels?\"\\n\\n Even as she said it, Sanders saw that labels were slowly emerging out of the gray surfaces. \"I guess it just takes time.\" Sanders turned and looked in all directions, scanning the other labels. \"Okay. That\u0027s better. HR records are on this wall, over here.\"\\n\\n He walked along the wall. He pulled open a drawer.\\n\\n \"Uh-oh,\" Fernandez said.\\n\\n \"What?\"\\n\\n \"Somebody\u0027s coming,\" she said, in an odd voice.\\n\\n At the far end of the corridor, a gray figure was approaching. It was still too distant to make out details. But it was striding directly toward them.\\n\\n \"What do we do?\"\\n\\n \"I don\u0027t know,\" Sanders said.\\n\\n \"Can he see us?\"\\n\\n \"I don\u0027t know. I don\u0027t think so.\"\\n\\n \"We can see him, but he can\u0027t see us?\"\\n\\n \"I don\u0027t know.\" Sanders was trying to figure it out. Cherry had installed another virtual system in the hotel. If someone was on that system, then he or she could probably see them. But Cherry had said that his system represented other users as well, such as somebody accessing the database from a computer. And somebody using a computer wouldn\u0027t be able to see them. A computer user wouldn\u0027t know who else was in the system.\\n\\n The figure continued to advance. It seemed to come forward in jerks, not smoothly. They saw more detail; they could start to see eyes, a nose, a mouth.\\n\\n \"This is really creepy,\" Fernandez said.\\n\\n The figure was still closer. The details were filling in.\\n\\n \"No kidding,\" Sanders said.\\n\\n It was Ed Nichols.\\n\\n Up close, they saw that Nichols\u0027s face was represented by a black and-white photograph wrapped crudely around an egg-shaped head, atop a gray moving body that had the appearance of a mannequin or a puppet. It was a computer-generated figure. Which meant that Nichols wasn\u0027t on the virtual system. He was probably using his notebook computer in his hotel room. Nichols walked up to them and continued steadily past them.\\n\\n \"He can\u0027t see us.\"\\n\\n Fernandez said, \"Why does his face look that way?\"\\n\\n \"Cherry said that the system pulls a photo from the file and pastes it on users.\"\\n\\n The Nichols-figure continued on walking down the corridor, away from them.\\n\\n \"What\u0027s he doing here?\"\\n\\n \"Let\u0027s find out.\"\\n\\n They followed him back down the corridor until Nichols stopped at one file cabinet. He pulled it open and began to go through the records. Sanders and Fernandez came up and stood by his shoulder, and watched what he was doing.\\n\\n The computer-generated figure of Ed Nichols was thumbing through his notes and e-mail. He went back two months, then three months, then six months. Now he began to pull out sheets of paper, which seemed to hang in the air as he read them. Memos. Notations. Personal and Confidential. Copies to File.\\n\\n Sanders said, \"These are all about the acquisition.\"\\n\\n More notes came out. Nichols was pulling them quickly, one after another.\\n\\n \"He\u0027s looking for something specific.\"\\n\\n Nichols stopped. He had found what he was looking for. His gray computer image held it in his hand and looked at it. Sanders read it over his shoulder, and said certain phrases aloud to Fernandez: \"Memo dated December 4, last year. `Met yesterday and today with Garvin and Johnson in Cupertino re possible acquisition of DigiCom . . .\u0027 bla bla . . . `Very favorable first impression . . . Excellent grounding in critical areas we seek to acquire . . .\u0027 bla bla . . . `Highly capable and aggressive executive staff at all levels. Particularly impressed with competence of Ms. Johnson despite youth.\u0027 I\u0027ll bet you were impressed, Ed.\"\\n\\n The computer-generated Nichols moved down the hall to another drawer and opened it. He didn\u0027t find what he wanted and closed it. He went on to another drawer.\\n\\n Then he began reading again, and Sanders read this one, too: \" `Memo to John Marden. Cost issues re DigiCom acquisition\u0027 . . . bla bla . . . `Concern for high-technology development costs in new company\u0027 . . . bla bla . . . Here we are. `Ms. Johnson has undertaken to demonstrate her fiscal responsibility in new Malaysia operation . . . Suggests savings can be made . . . Expected cost savings . . .\u0027 How the hell could she do that?\"\\n\\n \"Do what?\" Fernandez said.\\n\\n \"Demonstrate fiscal responsibility in the Malaysia operation? That was my operation.\"\\n\\n \"Uh-oh,\" Fernandez said. \"You\u0027re not going to believe this.\"\\n\\n Sanders glanced over at her. Fernandez was staring down the corridor. He turned to look.\\n\\n Someone else was coming toward them.\\n\\n \"Busy night,\" he said.\\n\\n But even from a distance, he could see that this figure was different. The head was more lifelike, and the body was fully detailed. The figure walked smoothly, naturally. \"This could be trouble,\" he said. Sanders recognized him, even from a distance.\\n\\n \"It\u0027s John Conley,\" Fernandez said.\\n\\n \"Right. And he\u0027s on the walker pad.\"\\n\\n \"Which means?\"\\n\\n Conley abruptly stopped in the middle of the corridor, and stared. \"He can see us,\" Sanders said.\\n\\n \"He can? How?\"\\n\\n \"He\u0027s on the system we installed in the hotel. That\u0027s why he\u0027s so detailed. He\u0027s on the other virtual system, so he can see us, and we can see him.\"\\n\\n \"Uh-oh.\"\\n\\n \"You said it.\"\\n\\n Conley moved forward, slowly. He was frowning. He looked from Sanders to Fernandez to Nichols and back to Sanders. He seemed uncertain what to do.\\n\\n Then he held his finger to his lips, a gesture for silence.\\n\\n \"Can he hear us?\" Fernandez whispered.\\n\\n \"No,\" Sanders said, in a normal voice.\\n\\n \"Can we talk to him?\"\\n\\n \"No.\"\\n\\n Conley seemed to make a decision. He walked over to Sanders and Fernandez, until he was standing very close. He looked from one to the other. They could see his expression perfectly.\\n\\n Then he smiled. He extended his hand.\\n\\n Sanders reached out, and shook it. He didn\u0027t feel anything, but through the headset he saw what looked like his hand gripping Conley\u0027s.\\n\\n Then Conley shook Fernandez\u0027s hand.\\n\\n \"This is extremely weird,\" Fernandez said.\\n\\n Conley pointed toward Nichols. Then he pointed to his own eyes. Then to Nichols again.\\n\\n They crossed the gateway, past the barking dog, and came back into the Victorian library. Fernandez sighed. \"It feels good to be home again, doesn\u0027t it?\"\\n\\n Conley was walking along, showing no surprise. But then, he had seen the Corridor before. Sanders walked quickly. The angel floated alongside them.\\n\\n \"But you realize,\" Fernandez said, \"that none of this makes any sense. Because Nichols is the one who\u0027s been opposed to the acquisition, and Conley is the one pushing for it.\"\\n\\n \"That\u0027s right,\" Sanders said. \"It\u0027s perfect. Nichols is having it off with Meredith. He promotes her behind the scenes as the new head of the division. And how does he hide that fact? By continuously bitching and moaning to anybody who will listen.\"\\n\\n \"You mean, it\u0027s a cover.\"\\n\\n \"Sure. That\u0027s why Meredith never answered his complaints in any of the meetings. She knew he wasn\u0027t a real threat.\"\\n\\n \"And Conley?\" she said.\\n\\n Conley was still walking alongside them.\\n\\n \"Conley genuinely wants the acquisition. And he wants it to work well. Conley\u0027s smart, and I think he realizes that Meredith isn\u0027t competent for the job. But Conley sees Meredith as the price of Nichols\u0027s support. So Conley has gone along with the choice of Meredith-at least for the time being.\"\\n\\n \"And what are we doing now?\"\\n\\n \"Finding out about the last missing piece.\"\\n\\n \"Which is?\"\\n\\n Sanders was looking down the hallway marked OPERATIONS. This wasn\u0027t really his area of the database, except in specific places of overlap. The files were marked alphabetically. He went down the row until he found DIGICOM/MALAYSIA SA.\\n\\n He opened it up and searched the file section marked STARTUP.. He found his own memos, feasibility studies, site reports, government negotiations, first set specifications, memos from their Singapore suppliers, more government negotiations, all stretching back two years.\\n\\n \"What are you looking for?\"\\n\\n \"Building plans.\"\\n\\n He expected to see the thick sheets of blueprints and inspection summaries, but instead there was just a thin file. He opened the first sheet, and a three dimensional image of the factory floated in the air in front of him. It was just an outline at first, but it rapidly filled in and became solid-looking. Sanders, Fernandez, and Conley stood on three sides of it, looking at it. It was like a very large, detailed doll\u0027s house. They peered in through the windows.\\n\\n Sanders pushed a button. The model became transparent, then turned into a cutaway; now they could see the assembly line, the physical plant. A green line the conveyor belt-started moving, and the machines and workers assembled the CD-ROM drives as the parts came down the line.\\n\\n \"What are you looking for?\"\\n\\n \"Revisions.\" He shook his head. \"This is the first set of plans.\"\\n\\n The second sheet was marked \"Revisions 1/First Set\" with the date. He opened it up. The model of the plant seemed to shimmer for a moment, but it remained the same.\\n\\n \"Nothing happened.\"\\n\\n The next sheet was marked \"Revisions 2/Detail Only.\" Again, when he opened it, the plant shimmered briefly but was unchanged.\\n\\n \"According to these records, the plant was never revised,\" Sanders said. \"But we know it was.\"\\n\\n \"What\u0027s he doing?\" Fernandez said. She was looking at Conley.\\n\\n Sanders saw that Conley was slowly mouthing words, his facial movements exaggerated.\\n\\n \"He\u0027s trying to tell us something,\" she said to Sanders. \"Can you see what it is?\"\\n\\n \"No.\" Sanders watched a moment, but the cartoonlike quality of Conley\u0027s face made it impossible to read his lips. Finally Sanders shook his head.\\n\\n Conley nodded, and took the keypad out of Sanders\u0027s hand. He pushed a button marked RELATED and Sanders saw a list of related databases flash up in the air. It was an extensive list, including the permits from the Malay government, the architect\u0027s notes, the contractor agreements, health and medical inspections, and more. All together, there were about eighty items on the list. Sanders felt sure he would have overlooked the one in the middle of the list that Conley was now pointing to:\\n\\n OPERATIONS REVIEW UNIT\\n\\n \"What\u0027s that?\" Fernandez said.\\n\\n Sanders pressed the name and a new sheet fluttered up. He pushed a button marked SUMMARY and read the sheet aloud: \" `The Operations Review Unit was formed four years ago in Cupertino by Philip Blackburn to address problems not normally within Operations Management purview. The mission of the Review Unit was to improve management efficiency within DigiCom. Over the years, the Operations Review Unit has successfully resolved a number of management problems at DigiCom.\u0027 \"\\n\\n \"Uh-huh,\" Fernandez said.\\n\\n \" `Nine months ago, the Operations Review Unit, then headed by Meredith Johnson of Cupertino Operations, undertook a review of the proposed manufacturing facility in Kuala Lumpur, Malaysia. The immediate stimulus for the review was a conflict with the Malay government over the number and ethnic composition of workers employed at the proposed facility.\u0027 \"\\n\\n \"Uh-oh,\" Fernandez said.\\n\\n \" `Led by Ms. Johnson, with legal assistance from Mr. Blackburn, the Operations Review Unit had outstanding success in resolving the many problems facing DigiCom\u0027s Malaysian operation.\u0027 \"\\n\\n \"What is this, a press release?\" Fernandez said.\\n\\n \"Looks like it,\" Sanders said. He read on: \" `Specific issues concerned the number and ethnic composition of workers employed at the facility. The original plans called for seventy workers to be employed. Responding to the requests of the Malay government, Operations Review was able to increase the number of workers to eighty-five by reducing the amount of automation at the plant, thus making the facility more suitable to the economy of a developing country.\u0027 \" Sanders looked over at Fernandez. \"And screwing us completely,\" he said.\\n\\n \"Why?\\n\\n He continued: \" `In addition, a cost-savings review generated important fiscal benefits in a number of areas. Costs were reduced with no detriment to product quality at the plant. Air-handling capacity was revised to more appropriate levels, and outsourcing supplier contracts were reallocated, with substantial savings benefit to the company.\u0027 \" Sanders shook his head. \"That\u0027s it,\" he said. \"That\u0027s the whole ball game.\\n\\n \"I don\u0027t understand,\" Fernandez said. \"This makes sense to you?\" \"You\u0027re damned right it does.\"\\n\\n He pushed the DETAIL button for more pages.\\n\\n \"I am sorry,\" the angel said, \"there is no more detail.\"\\n\\n \"Angel, where are the supporting memos and files?\" Sanders knew that there had to be massive paperwork behind these summary changes. The renegotiations with the Malay government alone would fill drawers of files.\\n\\n The angel said, \"I am sorry. There is no more detail available.\"\\n\\n \"Angel, show me the files.\"\\n\\n \"Very well.\"\\n\\n After a moment, a sheet of pink paper flashed up:\\n\\n THE DETAIL FILES ON\\n\\n OPERATIONS REVIEW UNIT/MALAYSIA\\n\\n HAVE BEEN DELETED\\n\\n SUNDAY 6/14 AUTHORIZATION DC/C/5905\\n\\n \"Hell,\" Sanders said.\\n\\n \"What does that mean?\"\\n\\n \"Somebody cleaned up,\" Sanders said. `Just a few days ago. Who knew all this was going to happen? Angel, show me all communications between Malaysia and DC for the past two weeks.\"\\n\\n \"Do you wish telephone or video links?\"\\n\\n \"Video.\"\\n\\n \"Press V.\"\\n\\n He pushed a button, and a sheet uncurled in the air:\\n\\n Date Linking To Duration Auth\\n\\n 6/1 A. Kahn \u003e M. Johnson 0812-0814 ACSS\\n\\n 6/1 A. Kahn \u003e M. Johnson 1343-1346 ADSS\\n\\n 6/2 A. Kahn \u003e M. Johnson 1801-1804 DCSC\\n\\n 6/2 A. Kahn \u003e T. Sanders 1822-1826 DOSE\\n\\n 6/3 A. Kahn \u003e M. Johnson 0922-0924 ADSC\\n\\n 6/4 A. Kahn \u003e M. Johnson 0902-0912 ADSC\\n\\n 6/5 A. Kahn \u003e M. Johnson 0832-0832 ADSC\\n\\n 6/7 A. Kahn \u003e M. Johnson 0904-0905 ACSS\\n\\n 6/11 A. Kahn \u003e M. Johnson 2002-2004 ADSC\\n\\n 6/13 A. Kahn \u003e M. Johnson 0902-0932 ADSC\\n\\n 6/14 A. Kahn \u003e M. Johnson 1124-1125 ACSS\\n\\n 6/15 A. Kahn \u003e T. Sanders 1132-1134 DCSE\\n\\n \"Burning up the satellite links,\" Sanders said, staring at the list. \"Arthur Kahn and Meredith Johnson talked almost every day until June fourteenth. Angel, show me these video links.\"\\n\\n \"The links are not available for viewing except for 6/is.\"\\n\\n That had been his own transmission to Kahn, two days earlier. \"Where are the others?\"\\n\\n A message flashed up:\\n\\n THE VIDEO FILES ON \\n\\n","sourceLink":"https://allnovel.net/disclosure/page-26.html","bookId":2410,"book":{"id":2410,"title":"Disclosure","description":"Storyline: The thriller that opened a new chapter in the sex wars ... \\n Thomas Sanders\u0027 world collapses in just 24 hours – he is passed over for promotion, his new woman boss comes on to him during a drink after work, then, the next morning, he learns that she has accused him of sexually harassing her. She demands his transfer, thereby threatening to cut him off from the millions he would have made when his high-tech company was floated on the stock market. \\n What followed next made Disclosure the most talked about novel of the decade.a\\n","cover":"https://allnovel.net/images/disclosure.jpg","author":"Michael Crichton","type":"Mystery","source":"allnovel","link":"https://allnovel.net/disclosure.html","creation":"Oct 5, 2019 8:58:41 AM","modification":"Oct 5, 2019 10:33:23 AM"}}
