{"id":44352,"no":8,"title":"CHAPTER VIII THE PLEDGE","content":"The violent slam of the front door jarred through the house, then came the sound of rapid footsteps up the staircase and down the hall. Colonel Julian Hull hesitated at his bedroom door, stood in thought for fully three minutes, then continued on his way to a room at the back of the house which he designated as his “den.” His wife looked up at his entrance. Her mild blue eyes widened at his disheveled appearance. “Why, Julian! Is anything wrong?” she asked. “Wrong?” Colonel Hull flung himself into his desk chair. “Wrong? Is anything right?” His wife’s only answer was a patient smile. Thirty years of married life had accustomed her to his explosive tendencies. She wisely changed the subject. “Did Lucille get you on the telephone?” she inquired. Colonel Hull brought his revolving chair back to its upright position with a jerk. “No. Why didn’t you tell me at once that she called up?” He reached for the instrument resting on his desk. “Just like a woman. Central,” switching the hook up and down, “Central, Cleveland 64. What’s that? Special operator—I don’t need her—the number is correct. What? Service discontinued. Well, I’ll be—” He banged up the receiver and turned, red-faced, to his wife. “They have cut off their telephone at Ten Acres.” “I am not surprised,” replied Mrs. Hull. “They were probably pestered with calls.” “But how am I going to reach Lucille?” he demanded. “Why not motor out there after dinner?” Colonel Hull’s good looks were marred by a scowl. “I had to leave the car at the shop—burned out a bearing,” he admitted. “Julian—your new car!” “Yes, yes, I know; but I had to get to”—leaving the sentence unfinished he picked up the evening paper and turned the sheets swiftly until he came to the financial page, read its quotations, and then flung it down on the flat-top desk. “Jove, Claire, John’s death has been a frightful shock. It’s—it’s”—holding out a hand which shook slightly—“it’s unnerved me.” Mrs. Hull laid aside her embroidery and looked directly at her husband, her eyes full of tears. “John Meredith was a good man,” she said, “and the soul of honor.” She hesitated, then added in an awe-struck whisper, “Lucille said on the telephone that the authorities believe he was murdered.” Her startling news did not have the effect she had anticipated; instead of the intense excitement she had expected, Colonel Hull nodded his head solemnly and remained absolutely silent. Mrs. Hull scanned him in surprise. It was from her father that Lucille inherited her finely chiseled features and brilliant coloring, also her tendency to “nerves.” Mrs. Hull’s phlegmatic disposition matched her colorless appearance. There was nothing original about Mrs. Hull; she led a parrot-like existence, taking her ideas of life from her husband and depending upon Lucille for style in dress and deportment. Her kitchen and housewifely duties bounded her horizon. A woman of independent means, she had married Julian Hull at a time when his fortune was at low ebb and in spite of the fact that he was some five years her junior in age, and, prophecies to the contrary, the match had turned out most happily. Mrs. Hull had not shone in society, and it was with inward thanksgiving that she had, upon Lucille’s debut, laid the reins of entertaining in her daughter’s clever hands, and retired to her charities and her garden. “Do you realize what I said, Julian?” she asked finally. “It is thought that your Cousin John was murdered.” “I heard you the first time,” he said testily, brushing a hand across his gray mustache. “I am horrified, yes, but scarcely surprised.” Catching his wife’s startled look, he added: “John wasn’t the caliber to commit suicide.” “But—but why should any one murder him?” she demanded. “He never harmed any one.” Hull stirred uneasily in his seat. “It was a shocking crime,” he answered. “Let us hope the murderer will be caught at once and meet the punishment he deserves. Did Lucille speak of Anne and her mother?” “Only to say that Belle was wonderfully calm and collected,” replied Mrs. Hull. “She did not mention Anne. I gathered that the household was demoralized—” “Small wonder,” broke in her husband. “We must go there to-night; I’ll engage a taxi. What’s the matter?” observing the change in Mrs. Hull’s expression as he reached again for the telephone. “I—must I go?” she asked timidly. “You know how scenes distress me.” Colonel Hull leaned over and patted her gently on the shoulder. “I think it best, dear,” he said. “We will not stay long.” Submissive always to his slightest wish, Mrs. Hull rose. “I will tell Jane to serve dinner as soon as it is ready,” she said. “You look very tired, Julian; you will feel better after you have had a good meal,” and, not waiting for an answer, Mrs. Hull sought her waitress. Colonel Hull remained in his chair for over five minutes, then rousing himself he walked to the mantel and lifted down a large silver mirror. He stared at his reflection with critical eyes. “Tired—bah!” he muttered, half aloud. “It’s age—and ghosts.” Putting down the mirror he unlocked a lower section of his desk and took out a decanter and glass. The cordial brought back his color and relieved his sense of depression. He was whistling cheerily when, after sending his telephone message, he went to his room and dressed for dinner. Eight o’clock came all too soon for Mrs. Hull’s peace of mind. With his dinner jacket Colonel Hull acquired good humor, and not for many a day had his wife found him so entertaining. The dinner itself was particularly appetizing, and it was with a sigh of regret that Mrs. Hull left the table and went to her bedroom for her wrap. Ten years before they had given up their old home on Capitol Hill and moved to a more pretentious house on Wyoming Avenue. The change had proved more agreeable to Lucille than to her mother, who loved the old garden and the quaint house, with its air of bygone grandeur. In her eyes electric lights and English basements did not compensate for homely comfort and the peace of a street not frequented by automobiles. When Mrs. Hull reached the reception hall on the ground floor she heard voices coming from the little room which opened from it. At her approach a young man brushed by Colonel Hull and came to meet her. Under the soft glow of the shaded hall lights she recognized her husband’s junior partner. “Why, Gerald,” she exclaimed in pleased greeting, “I am so glad that you are here. I understood Lucille to say that you were out of town.” “I am on my way to the train now,” answered Gerald Armstrong. “I stopped, thinking that Lucille might be home. The Colonel tells me, however, that she has remained at Ten Acres.” “Yes, Cousin Belle asked her to stay—” “I don’t know why Belle feels called upon to act as chatelaine,” interrupted her husband. “I suppose she will feel her oats now more than ever.” “She is grande dame”. Armstrong’s smile only partly covered a sneer. “John Meredith’s suicide was a frightful thing.” “But it wasn’t suicide,” broke in Mrs. Hull in her turn. “Lucille said it was a case of murder.” Armstrong’s step backward brought him under one of the bracket lights and Mrs. Hull noted with concern his pallor and the haggard lines in his face. He flushed hotly on meeting her gaze, and to cover his confusion stroked his fair mustache, which hid the weakness of his mouth. “Murder!” he repeated. “It can’t be. Why, John Meredith was beloved, not hated.” “That is just what I told Julian,” declared Mrs. Hull. “Lucille said it wasn’t a burglar, but it must have been.” “Of course it was.” Armstrong’s voice of conviction pleased Mrs. Hull, confirming her high opinion of him. It was his custom to side with her in any family discussion. Swiftly he turned to Colonel Hull. “Did Lucille tell you that John Meredith left her a million dollars?” “Good gracious!” “Well, by Jove!” The simultaneous exclamations brought a smile to Armstrong’s lips, but his eyes remained hard and watchful. “Have you seen Lucille?” he asked. “No, we are on our way to Ten Acres now,” Mrs. Hull spoke as a person in a daze, and her husband, immersed in a large silk handkerchief, blew his nose with vigor. “To think of John leaving such a sum of money to Lucille! I knew he was fond of the child, but”—she drew a long breath—“it passes belief!” “Here is your car,” exclaimed Armstrong, as a taxi puffed its way to the door and stopped. “Let me help you in, Mrs. Hull,” and taking her firmly by the elbow he piloted her down the few steps leading to the driveway which cut across the sidewalk and led to their front door and the garage in the rear of the house. Colonel Hull followed them more slowly. He did not speak to Armstrong until the latter had tucked a light lap robe over his wife’s expensive gown. “Will you come out with us, Gerald?” he asked, one foot on the running board. “I am sure Lucille and Anne will be glad to see you.” Armstrong shook his head. “I haven’t time to make it, Colonel,” he answered. “Thanks, just the same.” He partly closed the door. “About Anne,” his voice changed, “there’s a chap out at Ten Acres—David Curtis. Ever met him?” Colonel Hull dropped heavily on the seat by his wife’s side. “David Curtis,” he repeated. “N-on, I can’t say that I have. A banker?” “A surgeon—and blind at that.” Armstrong shrugged his shoulders. “Anne is to marry him. Good night,” and he slammed the door shut. His parting salutation met with no response. Both Colonel Hull and his wife were temporarily bereft of speech. Lucille was stifling a yawn when Herman ushered her mother and father into the drawing-room at Ten Acres. She was unaffectedly glad to see them. “I hoped that you would come,” she said, as her father kissed her. “Why didn’t you get here for the inquest this afternoon, Dad?” “Couldn’t leave the office—Armstrong didn’t show up—stocks a bit critical,” Colonel Hull replied jerkily as Mrs. Meredith came toward them. She had heard the arrival of the taxi when in her boudoir and had paused only long enough to inspect herself in her mirror before going to the drawing-room. Hull successfully concealed a frown as he bowed to the handsome widow; outwardly friends, their mistrust was mutual and of long duration. “We expected you earlier in the day, Julian,” she said. “Didn’t Sam Hollister reach you on the telephone?” “No.” Hull followed her to the sofa and sat down. “I was told by ‘Central’ that your phone was disconnected.” “For outsiders, yes, but we can still send calls from here.” She looked at Lucille and her mother and lowered her voice. “Would you care to see John?” Colonel Hull’s ruddy complexion paled. “No,” he answered, with unnecessary vehemence; then, catching her surprised expression, modified his tone. “I can do John no good, poor lad! And—and—viewing the body would be—ah—harrowing. I would like to remember him as I last saw him.” “And when was that?” asked a quiet voice at his elbow. Twisting around Hull found himself confronted by a stranger whose presence had been partly concealed by the wing chair in which he was seated. Mrs. Meredith viewed Hull’s astonishment with some amusement. She broke the pause. “Julian, this is Doctor David Curtis,” she explained. “Doctor Curtis, my cousin, Colonel Julian Hull.” Curtis’ long, nervous fingers closed over Colonel Hull’s flabby hand with a force which made the latter wince. Hull mumbled a greeting and continued to stare at the sightless man before him. Curtis felt the scrutiny as he wheeled his chair around so as to make one of the group. “I am sorry,” he began apologetically. “I thought that you were aware of my presence. I have been sitting here talking to Miss Hull, and she left me for a few minutes to find Mr. Hollister. You say”—and Hull was struck by the way Curtis located without apparent hesitancy each speaker. It seemed as if his blindness had sharpened his other faculties abnormally. “You say, Colonel Hull, that you would like to remember John Meredith as you last saw him. Exactly when were you with him last?” “What is that to you?” demanded Hull aggressively. Curtis took time, before answering, to light the cigarette which Mrs. Meredith, an interested listener, handed to him. “Mr. Hollister, at the request of Miss Anne Meredith, is acting as her attorney.” Curtis’ speech was deliberation itself. “And he has asked me to aid him in clearing up the mystery surrounding John Meredith’s death—” “Therefore you try to implicate me,” broke in Hull. “On the contrary, I asked a very simple question with a view to finding out how Meredith looked when you last saw him. If I bungled my meaning you must not take offense,” replied Curtis. Colonel Hull covered his anger with bluff heartiness, while inwardly registering a score to settle with the surgeon at some future date. “Certainly, I’ll answer any questions,” he exclaimed, with a broad smile. “But you must admit your meaning was a bit obscure—and from a total stranger; well, we’ll let it go, eh, Belle?” with a sidelong look at Mrs. Meredith. “What is it you wish to know?” “When you last saw Meredith, was he agitated or his normal self?” questioned Curtis. “Oh, he was a bit excited,” Hull admitted, with an air of candor. “He called at my office one day last week and got uneasy over stock quotations. He had been dabbling in oil, against my advice.” “And that was the last time you saw him?” At Curtis’ polite persistency Hull’s color deepened, but he was saved reply. “Dad!” Lucille tapped him on his shoulder. “Mother is waiting in the hall. She isn’t feeling well,” turning to Mrs. Meredith, who had risen also, “so don’t keep her waiting, Dad.” “I’ll come at once.” Colonel Hull waited courteously for Curtis to precede him. “I am told, little girl, that John left you a very handsome fortune.” “In a codicil to his will,” Mrs. Meredith replied for Lucille who, a step or two ahead, had not caught her father’s remark. “Unfortunately the codicil cannot be found.” Colonel Hull stopped dead in his tracks and glared at Mrs. Meredith. “What’s that?” he demanded. “Do you mean the codicil has been suppressed—stolen, if you like it better?” meeting Mrs. Meredith’s stony look with angry eyes. “Dad!” Lucille laid a restraining hand on his arm and pressed it warningly. “Don’t excite yourself. You will alarm mother.” Mrs. Hull, who had been too nervous to keep still, stopped her aimless wandering about the square hall and waited for their arrival. Lucille, in advance of the others, turned to Curtis. “Mother,” she said, “let me introduce Doctor David Curtis,” she hesitated before adding, “Anne’s fiance.” “I am very pleased to meet you.” Savoir faire was not Mrs. Hull’s strong point, and that she was ill at ease was as apparent to Curtis, sensitive of his surroundings, as it was to his companions. She shook his hand listlessly, then dropped it and pulled her evening cloak up about her shoulders. “The taxi is at the door,” announced Colonel Hull. “Come, Claire.” But she lingered a moment to address Mrs. Meredith. “When will John be buried?” she asked in an undertone. “We will hold funeral services to-morrow morning in the chapel at Oak Hill,” responded Mrs. Meredith. “Only the family will be present. I thought Sam Hollister had told you of the arrangements; he has them in charge.” “I haven’t seen Sam.” Mrs. Hull kissed Lucille warmly, and then shook hands with Curtis before she moved toward the front door. “Good night, doctor. Oh, Belle,” with a change of tone, “it does make me feel so badly to come here and not find John. He was so genial, so kind. Only the last time I talked with him about Julian’s career, he said I was my husband’s lodestar.” Mrs. Meredith did not answer in words. After administering a cold kiss on Mrs. Hull’s flushed cheek, and with a wave of her hand to the Colonel, she turned back to Curtis, who stood waiting near the entrance to the library. “Lodestar is good, only spell it ‘load’” she commented, caustically, but keeping her voice lowered so that it would not reach the Hulls. “John had quite a sense of humor.” Curtis smiled. “Are you going upstairs, Mrs. Meredith?” he asked. “Yes—and you?” pausing on the lower step. “I’ll smoke awhile in the library; it is only nine o’clock,” as the clock chimed the hour. “Good night.” “Good night,” she echoed, and continued up the staircase. Curtis listened until her soft footfall faded away in the distance, then turned thoughtfully and entered the library. The servants had spent but scant time after the inquest in replacing the furniture in its accustomed places, and Curtis found some difficulty in moving about. “Oh, do be careful,” exclaimed a soft voice to his right, and a hand touched his. “This way. I,” her dignity sat quaintly upon her, “I am Anne.” “As if it could be any one else!” Curtis spoke with involuntary fervor, and Anne laughed shyly, then recollection returned to her, and her expression grew serious. “I came downstairs hoping to find you,” she explained, her color mounting. “When I heard Cousin Claire and Cousin Julian talking in the drawing-room I came in here to wait until they left. I want,” she hesitated, selecting her words carefully, “to speak of Uncle John’s plan for—for our marriage.” The last words came with a rush, then she paused, tongue-tied. Curtis Came to her rescue. “I understand,” he began gravely. “We will call the whole affair off. In other words,” striving to spare her embarrassment, “I release you from your promise.” She plucked nervously at her gown. “It is you who do not understand,” she said. “I don’t wish to be released.” Curtis raised his head. Had his ears played him false? “You mean,” he asked slowly, “that you wish to go on with the marriage ceremony?” “Yes.” The affirmative was little more than a whisper. “But,” it was his turn to hesitate, “it seems now that you are very wealthy; it is not necessary to carry out the bargain your uncle wished to force upon you.” She did not answer at once. “I gave my word to him,” she murmured. “I cannot break faith with the dead.” The ticking of the mantel clock was distinctly audible in the silence. Suddenly she spoke again, a catch in her voice. “You hesitate—you do not wish to—to marry me?” she asked. The hot color mounted to his brow and then receded. “I only hesitate on your account,” he said. “In marrying me you will be tied to a blind man—a failure.” She did not reply at once. Instead, Curtis heard her move backward a few steps and then a slight click sounded as an electric lamp was switched on. Anne turned and regarded Curtis gravely under its direct rays. There was none too much flesh even yet on the tall, straight figure, but the air of alertness and poise which had formerly been characteristic had returned to him. His face still bore traces of mental suffering, although its unyouthful sadness had been effaced. “Because it is a bargain,” Curtis’ voice startled her from her contemplation of him, “I wish it to be a fair one. You are offering me the wherewithal to live. I can offer you nothing—” “Perhaps,” she broke in swiftly, “I crave your friendship, your aid.” Curtis felt his heart skip a beat and then race on. “I will do anything, anything for you,” he replied, a trifle unsteadily. “And will gladly carry out your uncle’s plan.” “Thank God!” she whispered. The portières were thrust back suddenly and Mrs. Meredith stood on the threshold, with Hollister behind her. “You may go to your room, Anne,” she said in icy tones. A second later the portières dropped back into place and Curtis was alone. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2776/76842.html","bookId":1326,"book":{"id":1326,"title":"The Meredith Mystery","description":"简介： Anne Meredith looked at her mother, appalled. Marry David Curtis! she exclaimed. Marry a man I have seen not more than a dozen times. Are you mad?No, but your uncle is, bitterly. God knows what has prompted this sudden philanthropy, hesitating for a...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2776","creation":"Aug 1, 2019 12:24:51 AM","modification":"Aug 1, 2019 12:24:51 AM"}}
