{"id":22061,"no":11,"title":"CHAPTER XI","content":"The transmutation of the emotions or the passions into one another is among the mysteries of the sphere of morals. In some natures, even the most sacred grief, the outcome of a child’s death, I have seen capable of change into anger at a world in which such things are possible. \\n\\n \\n\\n Susan had loved her sturdy little boy with unreasoning ardor, and indulged him to the utmost limit their scant means allowed. He had been like her in face, and this pleased her. He had, too, her masculine vigor, and seemed more bone of her bone than the two idiots who had gone early to the grave. \\n\\n \\n\\n She sat just within the doorway, rocking. The chair creaked at each strong impulse of her foot. An oblong of sunshine lay at her feet, and in it a faded crape bonnet, last relic of a day when prosperity could afford to grief a uniform. It had turned up in her vain search after a decent garment for the dead. As she continued to rock with violence, the loose planks of the floor moving, a toy ark, the gift of Dorothy to the boy, fell from a shelf. Noah and his maimed beasts tumbled out, and lay on their sides in the sun. She took no note of the scattered menagerie. \\n\\n \\n\\n 161The room was in no worse than its usual disarray, with no sign of that terrible precision which we associate with the death-chamber. At last she rose quickly, and, pushing the toys and bonnet aside with an impatient foot, left the rocking-chair in motion, and trod heavily up and down the room, opening and shutting her hands as she walked. She fed her rage with each look she cast on her dead boy. \\n\\n \\n\\n A far gentler woman once said to me that there was for her in her child’s death the brutality of insult. Some such feeling was now at work with Susan Colkett. \\n\\n \\n\\n In her younger life she had lived on a farm in upper Canada, a tall, pretty, slim girl, quick of tongue, unruly, and with an undeveloped and sensual liking for luxury and ease. Then she married a man well enough off to have given her a comfortable life. A certain incapacity to see consequences, with that form of fearlessness which is without fear until the results of action or inaction are too evident, led her to be careless of debts. Then her husband drank, and grew weary of her tornadoes of unreasoning anger; the idiot children came, and she began to think of what even yet she might realize for herself if he were dead. Making no effort to stop him, she let him go his way, seeing without one restraining word the growth of a deadly habit. Dorothy had said that she helped his downward course even more actively. His death left her penniless, but free. Men were unwilling, however, to face her wild temper, and when, at last, her looks were fast fading, to help the only things in the world she cared for, she took the 162stout little man who had for her from his youth an unchanging affection. Misfortune taught her no good lessons. Even now she hated work, loved ease, and lacked imagination to picture consequences. Amidst the animal distress her child’s death occasioned, she was still capable of entertaining the thought of crime; in fact, her loss contributed a new impulse in the storm of fury it evoked. They were close to the end of their resources. There is in Paris a Place St. Opportune. Who this saint was, I know not. His biography might be of interest. There is probably a fallen angel of the same name who makes the paths of virtue slippery. Crime had been near to this woman for years, and ever nearer since disaster had been a steady companion. She had lacked opportunity, and that alone. Nor was this the only time she had cast temptation in the way of her simple-minded husband. \\n\\n \\n\\n At last, as, striding to and fro, she went by the doorway, she saw Dorothy, and with her a thin man in shining, much-worn, black alpaca clothing. \\n\\n \\n\\n She knew at once that he was the preacher who had been brought up from Mackenzie to bury her child. \\n\\n \\n\\n Upon this she turned back into the room, and stood a moment by the two chairs on which lay the pine box which Joe had made. The little fellow within it had been hardly changed by his brief illness. He was fair to see; white, and strongly modeled; and now he was beautiful with the double refinements of youth and death. She touched his cheek as if to test the reality of death, and then 163kissed him, and, laying over him the rude cover, turned away. \\n\\n \\n\\n At the door she met Dorothy and the minister. Dorothy said, “Good morning, Susan.” \\n\\n \\n\\n “You’ve been a heap of time comin’.” \\n\\n \\n\\n Dorothy, glancing at Mrs. Colkett, did not enter, but stepped to one side and, leaning against the log wall, waited. The little man in the worn alpaca suit was stopped as he turned to go in by the gaunt form of his hostess. \\n\\n \\n\\n “There ain’t no need to go in or to preach,” she said. \\n\\n \\n\\n Upon this Dorothy plucked at his coat-skirt, and, much embarrassed, he fell back, saying, “That’s as friends please.” \\n\\n \\n\\n Then Joe came from the cow-shed and went in past his wife. As he went by, he nodded cheerfully to Dorothy and to the preacher. “’Most ready; won’t be long.” \\n\\n \\n\\n Mrs. Colkett stood looking across the clearing. The preacher, uneasily moving to and fro, at last approached her again. “My sister,” he said, “the hand of the Lord has been heavy on this household of his people.” From her great height Susan Colkett cast her eyes down on the wan little person below her. “It is fit,” he went on, “that while—” \\n\\n \\n\\n “Look here,” said Susan; “you’ve come to bury that child, and that’s all you’re here for. Just set down and wait”; and so saying, she brought out two crippled chairs. \\n\\n \\n\\n Dorothy said, “No, I will stand.” \\n\\n \\n\\n The preacher sat down without a word, and found 164occupation in keeping his place, as the chair-legs bored unequally into the soft soil. At last, greatly troubled, he looked toward Dorothy for consolation, and, receiving none, at last fell on his knees in deep despair. “Oh, Lord!” he cried, “move the heart of this woman that she may receive the message of thy grace!” and on this Dory too knelt in the sunshine, while Susan turned and went into the house. \\n\\n \\n\\n Then there arose within the rude noise of loud hammering, and, utterly confused, the unhappy preacher looked up, and saw that he was alone with Dorothy. \\n\\n \\n\\n “What manner of people are these?” he said, as they both arose. “I must speak to her,” and he moved toward the door. \\n\\n \\n\\n “I wouldn’t,” said Dorothy, touching his coat. “Not now. Another time.” \\n\\n \\n\\n He said no more, and the pair stayed without, waiting with no further words, while the hammering went on. At last it ceased. Joe came out, wringing a finger. “I kind of mashed it,” he said, in an explanatory voice. “Susie’s ready.” He went back, and soon came out again with the white box held in front of him on his two outstretched arms. \\n\\n \\n\\n The mother followed, looking straight before her—a strange, high-colored, set face, the tightly shut jaw making hard lines in the lower cheek-curves. The meager preacher came after with a book in his hand, and Dorothy followed. \\n\\n \\n\\n In the woods Joe stumbled once, and a moment after set down his strange burden and wrung his hurt finger. Then he went on again into the deeper 165woodland, and about two hundred yards from the house stopped and set the box on a level stump. Before them were two crumbled mounds of earth, and beyond a small open grave, not over-deep. \\n\\n \\n\\n The clergyman came forward. \\n\\n \\n\\n “I might put it in?” said Joe, interrogatively. \\n\\n \\n\\n “Yes,” said Dorothy. “Let me help.” And, taking the coffin at each end, they let it down, for the grave was shallow. \\n\\n \\n\\n “Them roots is in the way; they bothered me when I was a-diggin’,” said Joe. \\n\\n \\n\\n “Hush!” exclaimed Dorothy. “Hush!” \\n\\n \\n\\n As they stood up, the minister went on to read his simple burial service. Susan Colkett paid, or seemed to pay, intense attention. At last he ceased, and all stood still a moment in the deep wood-shadows, for the twilight was near at hand. There was a little stir as Dorothy took from her handkerchief a handful of roses and let them fall into the open grave. Susan looked at her a moment, and then, turning to the preacher, said, coldly: \\n\\n \\n\\n “Is that all of it? I don’t want none left out.” \\n\\n \\n\\n “Yes.” \\n\\n \\n\\n “Don’t rich people have no more said than that?” \\n\\n \\n\\n “No; that is all,” he replied, much astonished. “Wouldn’t you like me to talk to you at the house!” \\n\\n \\n\\n “No, I wouldn’t. My man he’ll pay you.” And she walked away. The minister wiped his brow, and sat down on a stump, while Dorothy waited, and Joe calmly began to fill up the little grave. \\n\\n \\n\\n He paused once to give the minister the cost of his journey, and then went on. \\n\\n \\n\\n 166“Come,” said Mrs. Maybrook. “No; don’t go in,” she added, as they passed the cabin. “Let her alone.” \\n\\n \\n\\n “The Lord has made my errand hard,” he said. \\n\\n \\n\\n “No; he hasn’t took a hand in the matter at all,” she said. “It’s the devil! Come!” And they disappeared in the darkening wood-spaces. \\n\\n \\n\\n Before Joe had quite done, he was aware of his wife again standing beside him. \\n\\n \\n\\n “What’s wrong?” he said. “Best wait in the house. I’ll come. And don’t bother none for the supper. I’ll cook it.” \\n\\n \\n\\n “Couldn’t you set a board over the boy?” she said. \\n\\n \\n\\n “Yes.” \\n\\n \\n\\n “They’re just buried like dead dogs!” \\n\\n \\n\\n “I’ll git somethin’.” \\n\\n \\n\\n “What’s the use, anyhow? If you were any good of a man, there’d be a decent white stone like them Lyndsays has set.” \\n\\n \\n\\n “Oh, I’ll find somethin’, Susie! I’ll think about it.” He was anxious to get through with it all, and somewhere deep in his mind was moved by her want. \\n\\n \\n\\n “It ain’t no use thinking,” she said, “when you’ve got no money.” And so, at last, she went away once more to the wretchedness they called home, leaving him to complete his task. \\n\\n \\n\\n It was now dusk. He sat down on a log, and wiped his brow with his sleeve. There was a little tobacco left in his pouch. He lit a pipe, and sat awhile in dull rumination, like some slow ox, recalling her words. At last he took the pipe out of his mouth, and stood up, as one set on the clear track of an idea. A difficulty occurred to him. \\n\\n \\n\\n 167“I’ll do it. No one won’t know. There don’t nobody come here.” A moment later a new obstacle arose is his mind, and he resumed his pipe and his seat. \\n\\n \\n\\n “That’ll do,” he said. “I’ll get Dory to help. She won’t think for to suspect none.” And so, much cheered by the prospect of pleasing his wife, he went away to the cow-shed. \\n\\n \\n\\n His had been a poor, loveless life. An orphan boy, he had never possessed ability or power to win affection or respect for anything except his muscles. Yet a canine capacity to love without question was in him, and the tall, gaunt woman who alone had put out a hand of apparent trust to him had all of his simple attachment. \\n\\n \\n\\n Now he extinguished his pipe, knocked it on a tree to shake out the live ashes, put it in his pocket decisively, and went back to the house. \\n\\n \\n\\n He had a sense of satisfaction in the notion that he would surprise his wife with fulfilment of her desires: also he felt surprise, and as much elation as he was capable of, at his own skill in seeing his way through this enterprise. What she, the poor hurt mother, wanted was now in single possession of a mind little able to transact mental business with more than one importunate creditor at a time. \\n\\n \\n\\n To take what is not your own is common enough. The higher criminal mind disposes of the matter with some sophistry as to the right to have a share in the unjust excess of another’s property. The utterly immoral nature gives it no thought, save how to act with safety. The lowest type of man is untroubled 168as to the ethics of thieving, and as little as to personal results. The idea that another might suffer in proportion to what his own wife would gain never passed the threshold of this poor fellow’s consciousness. What he was about to do seemed to him easy and safe. He was certain that Susie would like it, and would think him more of a man. And that was all. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1645/48628.html","bookId":1206,"book":{"id":1206,"title":"When All the Woods are Green;A Novel","description":"简介： The night of summer comes late in this north land. Although it was nearly nine oclock, the shadows, long gathering in the valleys and the woods, had but just now overflowed onto the broad levels of the river. Above was hurry of low-lying clouds, thro...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1645","creation":"Aug 1, 2019 12:24:36 AM","modification":"Aug 1, 2019 12:24:36 AM"}}
