{"id":93062,"no":21,"title":"Page 21","content":"\\n\\n — 4 —\\n\\n It’s not something Mooney ever considered might happen to her until now, although she’s heard all the news — it seems like they talk about nothing else anymore. There are statistics, predictions, reports of attacks that occasionally come with lurid photographs of the horrific results. She’s been paying attention only in that offhand way folks do when something big, a hurricane or enormous forest fire, takes over most of what’s being broadcast on the television or talked about on the radio. You listen because that’s just what you do, period. Thinking back, it isn’t even difficult to figure out how she was exposed —\\n\\n Michael Frayne, “Patient Zero,” is one of the employees making coffee at some Starbucks she stops at during her endless wanderings around New York. Mooney remembers him now because although back then he’d still been handsome in a kind of GQ chiseled way, he’d also looked kind of…odd, distracted in that distant manner that people act when they’re functional but not particularly feeling well; there hadn’t been anything she could specifically point to, although while she stood in line and watched him—after all, he was eye-candy—she’d seen him surreptitiously wipe the back of his hand across his jaw line at least twice. That movement, so small, had apparently been enough for him to spread the virus in the way that disease often did, airborne and invisible. She has seen his picture a thousand times on television since he became that famous first vampire. The trip is something that the old woman insists is going to somehow “make it all better,” but that simply isn’t happening. Mooney stands in a line that has more people in it than the number of employees in her town’s grocery store and wonders how and when this “making it all better” is going to happen. Is this enormous city supposed to make her forget the rape, or the sad reality that now she fits in even less than she did before it happened?\\n\\n Surely it can’t be because New York is known for shopping and shows and culture. She doesn’t belong here, that’s for sure. Mooney can enjoy none of the clothes or museums or tchotchkes—New Yorkers use that word a lot—because all but the cheapest, tackiest things are priced out of her reach. Even the frozen vanilla latte she buys is an extravagance—back home she can buy an entire can of coffee for just under the cost of this pretentious grande concoction of trademarked coffee and flavoring,\\n\\n Everyone has always claimed that Mooney’s old guardian is clever, like the fox—gaso—that is her namesake. Mother Gaso approves of nothing Mooney does, from the way she dresses, to her “Get over it” attitude about the white man, to the way she refuses to use her given name, Wegi Mashath. Its translation of Red Moon is cute but too archaic for Mooney’s taste. Maybe Mother Gaso thinks she will do something stereotypical of the rebellious young—meet a boy, move in with him, try drugs and booze, then refuse to return home. Be that as it may, Mooney is pretty damned confident she never planned on her foster kid returning to the Tohono O’odham reservation with some weird strain of DNA in her body reactivated thanks to a virus that seems to have the whole world in a panic.\\n\\n Fooled her.\\n\\n Mooney is too buried in her own thoughts to remember the walk home from the Circle K. Although she knows she moved quickly, she is not tired or winded when she pulls open the front door and steps inside the overcooled trailer. As reluctant as she is to leave the spectacular warmth of the sun, common sense tells her she needs to get cleaned up. The nameless boy’s blood rims her mouth and is smeared down her chin from where he pulled away; a few drops have dribbled onto her T-shirt, looking like black dots against the dark blue fabric. Mother Gaso is sitting at the tiny kitchen table sorting through beans; she glances in her direction but Mooney turns her face away as she passes and the old woman goes back to her chore without noticing anything. Mooney takes a clean T-shirt from her shelf in the closet and slips into the cramped bathroom to change, wash her face, and brush her teeth. The toothbrush and the water she spits out are stained with red but she doesn’t mind the taste in her mouth. Instead, she kind of likes it and wishes she had more of the same.\\n\\n She rinses until the water runs clear, then looks at her teeth in the mirror and smiles. The incisors are long and thin, much thinner than anything she’s seen in the ludicrous horror movies or the panic-stricken pictures that are being splashed across the television nowadays. They are like the teeth of a … rattlesnake, a wamad, and on impulse she undulates just like one in front of the narrow, full-length mirror on the back of the bathroom door. She has never been a good dancer — no sense of rhythm or coordination — but now she finds herself admiring the way her muscles move effortlessly to and fro. Her arms and legs feel longer and stronger, as though they are ringed with muscles in the same way as the body of a rattlesnake.\\n\\n Mooney’s heard enough on the endless TV specials so she understands the concept of how the virus sometimes triggers a person’s junk DNA — stuff left over from who knows how many eons ago — and makes them into something else. The key word, of course, is sometimes, which in scientific terms generally means rarely. People being what they are, the world’s populace was jumping to conclusions first and not asking questions until later, if at all. Of course, something is also an interesting unknown, because according to the news, those whose DNA is reactivating are manifesting in all kinds of fascinating ways. Most, unfortunately, don’t seem to be friendly, but all the ones she’s heard about are definitely higher on the evolutionary scale of physical strength and abilities. She wonders for a moment what hers will be, then undulates again in front of the mirror. It takes only a few minutes of practice to make her movements markedly smoother and more graceful, more menacing. Watching herself, she’s already pretty sure of the characteristics carried by her ancient ancestors.\\n\\n The sound of a vehicle makes it through the wall and Mooney tilts her head. Not a car, heavier — a truck, coming up the property’s long, dirt driveway.\\n\\n Yeah, she is expecting him.\\n\\n — 5 —\\n\\n “Need to talk to Red Moon, Mother Gaso.”\\n\\n The trailer is small, a living room, tiny kitchen, and a bathroom just off the bedroom where her guardian sleeps. Mooney is not afraid, just curious about what he intends to do, so she watches from just beyond the door as Chief of Police Delgado takes off his hat in a false display of respect. The big man steps into the trailer even though the old woman doesn’t invite him. He has to squeeze his oversized shoulders through the doorway and Mother Gaso has no choice but to back up until she is in the kitchen area. He sits on the couch — Mooney’s bed — again without being asked, then looks at the elderly woman expectantly. Mother Gaso’s gaze is emotionless and as unfazed as the surface of the sandstone cliffs that start the mountains miles to the north; she has no use for the Reservation Police, the Border Patrol, Highway Patrol, or any of the other entities of modern law enforcement. To her, they are just various ways the white man has dreamed up to subjugate her people. She believes in the old ways, where the elder tribesmen would discuss a problem and devise ways of handling it themselves.\\n\\n “She’s in the bathroom,” is all Mother Gaso finally says.\\n\\n “I’ll wait.”\\n\\n Chief Delgado looks around the living room and Mooney sees his gaze linger on the things that speak to the fact that he is sitting, literally, on the limited space in which she is allowed to live. After a couple of minutes, he becomes uncomfortable under Mother Gaso’s unwavering scrutiny.\\n\\n “She coming out?”\\n\\n “She might be awhile.”\\n\\n He shifts on the couch and looks as though he wants to force the issue but doesn’t know how. When the old woman still refuses to make conversation, he can’t stop himself from filling the void. “I’m not leaving until I talk to her. There was an incident in town this afternoon.”\\n\\n The sun-worn creases in Mother Gaso’s face deepen as she frowns. “What?”\\n\\n “She bit someone.”\\n\\n At last there is a change in the old woman’s expression. Even so, it is fleeting, there and gone. It is hidden so quickly that the Chief doesn’t notice. Mooney sees it because she knows Mother Gaso, sees her face every day. “Then that person must have done something to her first.”\\n\\n Delgado sighs. “That not the point. People don’t just go around biting other people — you know that.” He pauses, then adds. “Especially not with what’s going on nowadays. It doesn’t matter what the boy did, she —”\\n\\n “Seriously?” Mooney asks. She has moved so silently from the back to the front of the trailer that her sudden appearance makes both Mother Gaso and Chief Delgado jerk in surprise. “Because I don’t like to be touched. And after what I’ve been through, I really don’t like it when someone grabs me on the sidewalk and pulls my hair as a start to something a whole lot more unpleasant. Did that really not matter, Chief? Was that really an all right thing to do?”\\n\\n For a long moment all Delgado can manage is to stand there and shift uncomfortably. “No,” he admits at last. “It wasn’t. And if you want to file charges, I’ll take care of that. But you need to be aware that the boy’s got quite a few people up in arms.” He hesitates, then just blurts it out. “He says you’re a vampire.”\\n\\n Mooney laughs. “I guess I probably am.”\\n\\n “What did you say?” Mother Gaso demands. Delgado just looks at her unhappily.\\n\\n “I said I am,” Mooney repeats. “At least, I think so.”\\n\\n “When did this happen?” the old woman asks. “How?”\\n\\n Mooney shrugs. “The trip to New York, I guess. I was at the coffee shop where that guy worked, the one they say started the whole thing. I must’ve been exposed to what he had.”\\n\\n “Michael Frayne,” Delgado says.\\n\\n “Yeah.”\\n\\n “So the boy you bit, he’s going to become a vampire, too.”\\n\\n Mooney rolls her eyes at the older man. “No, he’s not. Please don’t tell me you’re going to go out there and start a town-wide panic by spreading a bunch of wrong information. This isn’t Lost Boys, Chief Delgado, or Dracula. Haven’t you paid attention to anything they’ve said on the news?” \\n\\n","sourceLink":"https://allnovel.net/v-wars/page-21.html","bookId":2571,"book":{"id":2571,"title":"V-Wars","description":"Storyline: V-Wars \\n by Jonathan Maberry , Alan Robinson R. (Artist), John Everson , Keith R.A. DeCandido , Scott Nicholson , Nancy Holder , Yvonne Navarro , James A. Moore , Gregory Frost … \\n A sweeping, threaded narrative of the global phenomenon known as the Vampire Wars! Mankind is silently infected by a millennia-old bacteria unknowingly exhumed by a scientific expedition in Antarctica. Now, in some rare cases, a person\u0027s so-called \"junk DNA\" becomes activated, and depending on their racial and ethnic heritage they begin to manifest one of the many diverse forms of the \"others\" that are the true basis for the legends of supernatural creatures. These aren\u0027t your usual vampires and werewolves - it goes much deeper than that. Conceived by Jonathan Maberry, V Wars features stories from various \"frontlines\" as reported by such contributors as Nancy Holder, Yvonne Navarro, James A. Moore, Gregory Frost, John Everson, Keith R.A. DeCandido, and Scott Nicholson (as well as Maberry himself, of course). The result is a compelling series of tales that create a unique chronicle of mankind\u0027s response to this sudden, hidden threat to humanity.\\n","cover":"https://allnovel.net/images/v-wars.jpg","author":"Jonathan Maberry","type":"Horror","source":"allnovel","link":"https://allnovel.net/v-wars.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 5, 2019 5:58:15 PM"}}
