{"id":93064,"no":23,"title":"Page 23","content":"\\n\\n “What are you doing?” Mooney jumps at the sound of Mother Gaso’s raspy voice. “Why are you undressed like that?”\\n\\n The old woman smells like sweat and the desert and Mooney turns to face her, unashamed at her nakedness and not trying to hide anything. “I’m looking at myself.”\\n\\n “You already know what you are,” the old woman retorts. Before Mooney can comment on the double entendre, her guardian tries to step pass her in the narrow hall, then freezes. “My God, girl. You’re carrying a child!”\\n\\n This is not a surprise to Mooney, so all she says is, “Obviously.”\\n\\n “Who’s the —”\\n\\n “Don’t insult me,” Mooney interrupts in an icy voice. “Have you ever seen me with a boy? No one in this town will even talk to me, much less hook up.”\\n\\n Mother Gaso ducks her head, then slides past Mooney and goes into her bedroom. Mooney can hear the woman putting away her purse and changing into a fresh blouse. She puts down the mirror and slips on her own jeans and T-shirt, then combs back her hair and twists it into a bun at the nape of her neck. Mooney is not afraid, but one step at a time. Right now might not be the best time to reveal that there is a wide swath of her hair from hairline to end that resembles the skin of a rattlesnake.\\n\\n “You need to see a doctor.” Mother Gaso’s voice has dropped a notch; now she just sounds tired and old.\\n\\n Mooney blinks. “No, I don’t,” she says. “I feel fine.”\\n\\n “You’re pregnant. One way or the other, you need to take care of … it.”\\n\\n Heat explodes into Mooney’s cheeks, so fast and full that it makes her stagger back into the bathroom. It takes her a few seconds to realize that what’s she’s feeling is anger, no, rage. She is back into the hall in an instant, filling the doorway of Mother’s Gaso’s bedroom and leaving the old woman no hope of escape. “What do you mean, one way or the other?” she grinds out. “And it?” Her heart is pounding so hard that she can feel it push blood through the artery in her neck; her vision pulses with each beat. She has never been so furious in her life, not even after the rape when the psychologist tried to encourage her to express her anger at what those men had done to her, what they had stolen from her. As it turns out, one of them gave her something in return; she doesn’t know why, but she wants to keep it, as the old bitch standing in front of her called it. Yes, it is a child of violence, but the it is her child. And she will die to defend it.\\n\\n Mother Gaso looks up, but the defiance on her wrinkled face disintegrates when she sees Mooney’s expression. But she has spent too many decades speaking her mind to use caution now. Even so, she cannot disguise the shakiness of her voice. “An abortion,” she ventures. When Mooney just glares at her, she adds, “Surely you understand that would be best, don’t you? It’s horrible enough that this pregnancy is the result of a rape, but now you’re a … a …” Apparently Mother Gaso can’t bring herself to finish, so she simply lets the sentence trail away to nothing.\\n\\n “The word is vampire,” Mooney says. “Try it out. It’s pronounced vam-pie-er.”\\n\\n “Being sarcastic isn’t helping anything. And you didn’t answer my question.”\\n\\n “I’m keeping the baby,” Mooney says with as much acidity as she can.\\n\\n Mother Gaso looks at her for a moment, then shrugs. “It’s your life. If you insist on screwing it up while you’re so young, at least make sure the baby’s healthy.” She pauses just long enough to let that sink in, then added, “With all the changes that virus has caused in you, who knows what it will do to an unborn child.”\\n\\n Mother Gaso steps forward expectantly and Mooney lets her pass. As her guardian trudges into the living room, turns on the television, then pulls a pot of leftover tepary beans and beef from the refrigerator to heat up for dinner, Mooney watches her but doesn’t really see anything. The rage is gone and now her brain feels swollen with all the thoughts suddenly banging around in her head, ricocheting from one side to the other and leaving little bloody dents in their wake. Saying she felt fine was a half-truth — she does, until she eats. Then her existence becomes a parody of the famous old lather-rinse-repeat shampoo commercial: she eats, she vomits, she feels great; she eats, she vomits, she feels great. Somewhere in there she is taking in enough nutrients to keep her going, but just barely. Her belly is big enough to be noticed in non-baggy clothes so she has switched to extra-large T-shirts, but she has lost weight everywhere else. Her cheeks are hollow and her jeans are loose everywhere but the waist, yet she is absurdly muscular, cut in the way that runners or kickboxers are and — when she’s not puking up everything in her gut — she is faster, stronger, and has more stamina than she has ever had. She’s almost in the best shape of her life.\\n\\n Except for the vomiting.\\n\\n And the minor fact that she’s knocked up.\\n\\n She opens her mouth and stares at her teeth … no, not teeth. Fangs. They’re bright white, like a puppy’s, and just about an inch long. Wide at the top, narrowing to a sliver at each tip, and curving under when she closes her mouth; barely noticeable when she talks, if she opens her mouth and pulls her upper lip back, like now, they drop forward … just like a rattlesnake’s. She has lived in Arizona all her life and knows a lot about rattlesnakes — their habitat, their behavior, their feeding methods. Venomous reptiles have teeth like hypodermic needles to inject their prey. Were hers channeled as well, but for a very opposite purpose?\\n\\n God, she thinks. What am I turning into?\\n\\n An hour ago she had been proud. Ostracized from everyone, yes, but that hadn’t mattered. Her mother and father had been like that — loners, different not in any kind of physical sense but shut out from society on the reservation because they had married in defiance of their families’ wishes, then refused to bow to outdated traditions and oppressive rules. The had shaped Mooney to be just like them, irrevocably instilled in her the belief that time had marched not on, but over the Native Americans, and there was no turning back. Why scratch in the dirt and live in poverty when there was an entire world out there, beckoning at every turn? But her parents had died five years ago, killed after dropping her off at school when her father’s old truck had blown a front tire on the way home and rolled. The attitudes of her parents had carried over to her, and although she was related by blood to probably more than a hundred people on the Tohono O’odham reservation, ultimately not a single relative had stepped forward to take her in. So at twelve years old, Mooney had been introduced to the spectacular environment of state foster care.\\n\\n Native American.\\n\\n The white man’s world.\\n\\n Now she fits in neither.\\n\\n Without warning, pain ripples through her lower abdomen. Mooney gasps and clutches at the edge of the sink, fighting to keep upright only because the room is too small for her to double over. After a moment she manages to pull the door closed, then she sits on the closed lid of the toilet and rocks quietly, imagining she can feel something shifting below the surface of her belly. Is she losing the baby, miscarrying? She doesn’t know why but the idea fills her with an excruciating sense of loss and she realizes she is crying. She manages to keep silent only by jamming the back of her fist into her mouth — she doesn’t want the old bat out there to hear her weeping, although it would be a miracle if she could be heard above the clamor of the idiot box. It takes about five minutes but the pain fades away and that strange sense of movement disappears. By the time she’s ready to go out and face the rest of her day, it is like nothing has ever happened.\\n\\n Physically.\\n\\n — 8 —\\n\\n A week later Mooney is in Dr. Guarin’s office. He is an older man with the typical swarthy skin of the Tohono O’odham but with fewer wrinkles because he works inside rather than in the sun. He folds his hands on his desk and looks at her steadily. She has no friends in this place, or anywhere else, but of all the people in town, he is, perhaps, the only person she does not dislike. She doesn’t know if the feeling is mutual but he is one of the few old-timers who calls her by the name she prefers rather than Red Moon.\\n\\n “According to my calculations and the lab work, you are just under sixteen weeks along,” he tells her. He knows when she was raped, but there is no judgment in his eyes. His expression is professionally placid and infers that she can tell him anything, he will keep it confidential, right to privacy, and all the rest of the modern, politically correct bullshit.\\n\\n “I was attacked less than three months ago,” Mooney reminds him.\\n\\n He says nothing.\\n\\n “I was a virgin,” she says, even though she told him all this on the day the Border Patrol brought her in. “I never had sex with anyone before then.”\\n\\n He stays silent, she stays silent. It is an odd battle of wills, a standoff between the two of them. Mooney will not give in; she knows the truth of what she is saying. Whether or not he believes her, the facts will not change.\\n\\n “There were some abnormalities in the blood work we did this morning,” he finally says.\\n\\n Ah, she thinks. Now we’ll get to what he really wants to talk about. She has a feeling that he has known all along that she is telling the truth about her sex life — or lack of it — and that whatever is about to come out of his mouth is what he has been driving at since he finished his examination. “I expected that,” is all she says.\\n\\n “I don’t have the equipment here to fully analyze the results,” he continues. “I need to send it up to Tucson Medical, see what they come up with.”\\n\\n “You know full well what they’re going to say. The whole town knows it already.”\\n\\n They stare at each other and after a bit she sees his shoulders slump. He sits back and sighs. “Mooney,” he says, “this is an enormous thing. Sells just isn’t ready for something — someone like you. The people here won’t know how to handle it, how to act, what to expect. The reaction may not be positive — ” \\n\\n","sourceLink":"https://allnovel.net/v-wars/page-23.html","bookId":2571,"book":{"id":2571,"title":"V-Wars","description":"Storyline: V-Wars \\n by Jonathan Maberry , Alan Robinson R. (Artist), John Everson , Keith R.A. DeCandido , Scott Nicholson , Nancy Holder , Yvonne Navarro , James A. Moore , Gregory Frost … \\n A sweeping, threaded narrative of the global phenomenon known as the Vampire Wars! Mankind is silently infected by a millennia-old bacteria unknowingly exhumed by a scientific expedition in Antarctica. Now, in some rare cases, a person\u0027s so-called \"junk DNA\" becomes activated, and depending on their racial and ethnic heritage they begin to manifest one of the many diverse forms of the \"others\" that are the true basis for the legends of supernatural creatures. These aren\u0027t your usual vampires and werewolves - it goes much deeper than that. Conceived by Jonathan Maberry, V Wars features stories from various \"frontlines\" as reported by such contributors as Nancy Holder, Yvonne Navarro, James A. Moore, Gregory Frost, John Everson, Keith R.A. DeCandido, and Scott Nicholson (as well as Maberry himself, of course). The result is a compelling series of tales that create a unique chronicle of mankind\u0027s response to this sudden, hidden threat to humanity.\\n","cover":"https://allnovel.net/images/v-wars.jpg","author":"Jonathan Maberry","type":"Horror","source":"allnovel","link":"https://allnovel.net/v-wars.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 5, 2019 5:58:15 PM"}}
