{"id":93087,"no":46,"title":"Page 46","content":"Behind the bar, Bodie stood stock-still and the other patrons fell silent. Fugly stood behind Bobby with his own hand inside his own vest. Thompson had a crazy hope that Fug meant to shoot Bobby in the back if things got out of hand. But Thompson doubted that was Fug’s intention. “Guys, are things straight up?” Bodie asked with a quaver in his voice. He obviously hadn’t heard a word, had no idea the confrontation was over him. Three motorcycles blared outside. Bobby’s eyes glazed over as he lowered the .38 to his side and looked expectantly at the door to the Shaft. Soon there was laughter, the heavy clopping of biker boots. Johnny Rocket burst in first, and he was grinning. Good hunting in the desert tonight. “We got one!” Johnny shouted. A cheer rose up. “We shot him. And we brought him home!” “What the hell?” Walker said. “We’ve got him outside. Says he’s Bodie’s brother,” Johnny Rocket declared. Everyone looked at Bodie. The man went white and put down the shot glass he had been drying with a towel. “I have a brother,” he said. “His name is Stan.” He moved around the bar and headed for the door. Bobby followed him out, the other O.M.s falling into line, and then everybody in the bar filed behind them. Beneath the moonlight, a bound man with light brown hair was kneeling with his head bowed in the trash-strewn parking lot of the Shaft. What was left of the blacktop looked like large-sized pieces of gravel. Monster and Poison stood on either side of the kneeling figure. “Stan?” Bodie shouted. Monster reached down and slid his fingers through his prisoner’s hair. He yanked back the man’s head, revealing a face that clearly resembled Bodie’s. A groan of pain escaped the man’s throat. He was wearing a denim jacket that was drenched in blood. There was so much blood that he should have died by then, if the blood was his. “Oh, my God. What did you do to him?” Bodie cried. The bar patrons gathered around in a circle as Bodie tried to run to the man — to Stan — but Johnny Rocket restrained him, grabbing his arms and holding him back. Bodie struggled in Johnny’s grasp. “Let me go! He’s hurt,” Bodie yelled. Monster tugged harder and Stan grimaced, revealing the sharp canines of a vampire. The crowd gasped and drew back. Red light glowed beneath Stan’s swollen, bruised eyelids. He was a vampire, all right. Thompson ticked his glance from Stan to Bodie, to Walker. “Bodie,” Stan said in a weary, agonized voice. “Bodie.” “How did this happen to you?” Bodie asked. “Who did this to you?” “I didn’t know where else to go,” Stan said. “As soon as I knew, I left Jane and I started driving —” “What did I tell you?” Bobby crowed. He pointed a hand at Bodie. “He’s a sucker, too!” “No, no I’m not,” Bodie said, looking shocked … and uncertain. “It’s in the blood,” said the grizzled old man who had bought Bobby a shot of tequila. “It runs in families.” “No. You have to be attacked,” a woman said. “It’s genetic,” another man said. Thompson looked at Walker. Thompson gave his mental wheel of fortune a spin, and it stopped at Little Sister’s number. It certainly had not been lost on anyone that if the Mendoza parents had been vampires, their children might turn out to be suckers, too. No one had brought it up. Little Sister and Manny were under their protection. Stan hissed. It was the worst thing he could have done. It sounded so creepy, so evil, that a woman wearing a tube top and the shortest skirt in Arizona let out an ear-piercing shriek. “Now do you get it?” Bobby shouted at the crowd. “You get what we’ve been doing for you? To save you?” He raised his .38 still in his hand. Aimed at Stan. Pulled the trigger. Bodie roared in protest along with the bullet as it slammed into Stan’s chest. The man — the vampire — was thrown backwards, slamming onto his back. But he wasn’t dead. He writhed, hissing like a Gila monster, like someone sneezing. Blood was spurting out of the wound like a geyser. “Don’t let it get on you!” Monster cried, ducking the spray. Then the grizzled man ran up with the baseball bat Bodie kept under the bar and slammed it into Stan’s face. Someone else had a pipe. It came down. There was another gunshot. Walker turned to the side and quietly threw up. Then he ran to the line of motorcycles and climbed on his, started it up, drove away. No one noticed. Thompson did the same. He doubted anyone noticed, either. Thompson followed Walker, who drove straight back to the house, looking over his shoulder as Thompson pulled up. He didn’t shut the turquoise door with all the crosses and Thompson entered the house a few steps behind him. Walker strode down the hallway toward the bedrooms, knocked softly on a door marked with a paper sign that read Angela in childish crayon letters — Manuel’s creation — and said, “Angela? It’s me.” There was a muffled reply, and Walker went into the room, pointedly glancing Thompson’s way as, this time, he shut the door behind himself. Thompson remained in the hall, listening for the rest of the O.M.s. He figured that the club had batted the wisdom of adopting the Mendoza kids back and forth before he’d arrived. If their parents were vampires, then they could be vampires. But what if no one had ever believed the Mendozas were vampires? Maybe their deaths had been the result of something else — turf war, drug deal gone bad. Maybe they’d been killed because of the post office box deliveries. The deliveries he’d been sent to investigate in the first place. Thompson knew which room belonged to Bobby. Of course Bobby’s door would be locked. But it wasn’t. Thompson kept listening hard. He heard crickets. It amazed him that in the midst of all the death, the desert still teemed with life. Owls, bats, jackrabbits. As he turned the knob of Bobby’s door all the way, he told himself it didn’t matter what Bobby was receiving through the mail, except that it did. Just not enough to take a chance like this. He cracked open the door. Except for a pie shape of light from the hallway light, it was dark inside. He couldn’t turn on a light. He re-shut the door just as another door opened. It was Manuel, who frowned at him. Thompson’s ginger-colored hair stood on end as the boy smiled at him shrewdly. “What were you doing in there?” Manuel asked. “I didn’t go in there,” Thompson said. Manuel smirked. “Uh-huh.” Thompson stayed loose. Remained calm. Suddenly, crazily, he realized how hungry he was. They had gone to the Shaft for burgers. Bodie hadn’t cooked them yet. He wondered what they were doing to Bodie. Stan was a lost cause. Hard to kill, like Moncho had been. Maybe that was the upside of vampirism, except for tonight. “What do you want?” he asked the boy. “I want to go hunting next time,” Manuel replied. No, you don’t. You really don’t, Thompson thought, but he knew he was wrong. Manuel knew it wasn’t a game, and he wanted to play anyway. Thompson felt sick down to his soul. The motorcycles blared above the scraping of crickets. They would be there in seconds. “I’ll put in a good word for you,” Thompson said. Manuel jutted out his lower lip. After all, he was only nine. “Make him take me.” “I can’t make Bobby do anything,” he said. “He’s Bobby.” Then, on a hunch, he asked, “What does he get when he goes to the mailbox?” The bikes were pulling up to the house. Manuel was making a decision. “I’ll tell you if I get to hunt,” he said. “I’ll take you myself,” Thompson promised. He went to Little Sister’s door and knocked. “Walker,” he called. The front door burst open just as Walker came back out of Little Sister’s room. Walker’s hair was tousled and he smelled of very cheap perfume. Bobby strode in, followed by the others. His eyes were bulging and when he looked at Thompson and Walker in the hallway, Thompson wasn’t sure that Bobby recognized them. Fug and Johnny Rocket were blank-faced, practically catatonic. Monster hung back. Poison was missing. “I’m starving,” Bobby proclaimed. They went into the kitchen and Fug started pulling out bread and salami from the fridge while Johnny Rocket produced two bottles of tequila from the pantry. Bobby flopped down in a metal dinette chair and grabbed up one of the place mats Little Sister had purchased on a run into town. There were little bears on them with hearts on their chests. Bobby wiped his forehead with the placemat and held it between his hands. Thompson came close enough to show respect yet remain on the perimeter of whatever was happening. Walker hesitated, then edged around Thompson and stood beside Bobby’s chair. Neither brother said anything. Johnny Rocket opened one of the bottles and passed it to Bobby, who took a swig. He handed it to Walker, who simply held it against his chest. “Is he dead?” Walker asked flatly. “He was so fucking hard to kill,” Bobby said. Then he got up, wove down the hall, and disappeared into his bedroom. That reminded Thompson that Manuel had been standing in the hall. He turned to see the little boy taking in all the drama, flexing his hands like he wanted to make something happen. He looked imploringly at Thompson, all his blackmail bravado forgotten. Manuel was scared. Thompson remained silent. “Where’s Poison?” Manuel asked in his little child’s voice. “Ssh,” Walker cautioned him. Johnny Rocket grabbed the tequila from Walker. “Poison was an asshole.” He took a long swig. His hand was shaking. “But where is he?” Manuel insisted. “Let’s get you to bed,” Walker said. He turned the boy away. “Isn’t that Little Sister’s job?” Monster said to their retreating backs.","sourceLink":"https://allnovel.net/v-wars/page-46.html","bookId":2571,"book":{"id":2571,"title":"V-Wars","description":"Storyline: V-Wars by Jonathan Maberry , Alan Robinson R. (Artist), John Everson , Keith R.A. DeCandido , Scott Nicholson , Nancy Holder , Yvonne Navarro , James A. Moore , Gregory Frost … A sweeping, threaded narrative of the global phenomenon known as the Vampire Wars! Mankind is silently infected by a millennia-old bacteria unknowingly exhumed by a scientific expedition in Antarctica. Now, in some rare cases, a person\u0027s so-called \"junk DNA\" becomes activated, and depending on their racial and ethnic heritage they begin to manifest one of the many diverse forms of the \"others\" that are the true basis for the legends of supernatural creatures. These aren\u0027t your usual vampires and werewolves - it goes much deeper than that. Conceived by Jonathan Maberry, V Wars features stories from various \"frontlines\" as reported by such contributors as Nancy Holder, Yvonne Navarro, James A. Moore, Gregory Frost, John Everson, Keith R.A. DeCandido, and Scott Nicholson (as well as Maberry himself, of course). The result is a compelling series of tales that create a unique chronicle of mankind\u0027s response to this sudden, hidden threat to humanity.","cover":"https://allnovel.net/images/v-wars.jpg","author":"Jonathan Maberry","type":"Horror","source":"allnovel","link":"https://allnovel.net/v-wars.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 5, 2019 5:58:15 PM"}}
