{"id":93099,"no":58,"title":"Page 58","content":"\n Anna came back with a dog. I’d seen the animal around the block a few times; it was a stray, I think. A pudgy, well fed stray that all the locals liked well enough. Anna brought the animal into my bedroom and closed the door. She looked at me on the bed and the dog sniffed around for a few seconds before starting a low rumble in its throat. It didn’t like me. This animal that had always been friendly in the past — and had often gotten a few of my French fries when Big Mac came to visit — suddenly didn’t like me very much.\n Anna didn’t say anything. But she looked at me in silence and then closed the door and left me alone with the dog. It tried to get out. It scratched at the door and it whined and it turned and looked at me and it growled, and it whined some more.\n And I lunged for it, the hunger burning so brightly I thought I’d scream.\n The dog screamed instead. Have you ever heard a dog scream? I wish I could say I’d never heard that sound.\n When the screaming stopped, I could hear the sound of Anna crying in the other room and the hunger was gone, and the lifeless body of that silly mutt was in my hands. There were no wounds on the poor thing’s body, but it was dead.\n Vampire. There was no blood involved, but I still had a special hunger and it needed to be fed if I wanted to live.\n I asked Anna how she knew what to do. My little sister, the scholar, the good one who made mom and dad proud. And she looked at me and shook her head. “I read the newspapers, Johnny. I’m not stupid. You had your monster-face going and I knew, so I did it.”\n My monster-face. That was her term for it. I guess maybe I just like that one better than Vampirus. It stuck. So it turns out when I decide to use my abilities my body goes through a physical change. I get my monster-face. My fingers get a little longer, I can see that one easily enough. If I go at it too long I start to grow fur on my body. Yes, fur. Long white fur to match up with my long white hair. I dye the hair, by the way. It’s black these days. Stops the old ladies on the block from freaking out too much. My teeth grow longer, and they get round. My face changes. I had to practice for a while, but I finally figured out how to make the monster-face happen. If I had to say I look like anything in particular when I change, I’d have to go with cat. I get a feline muzzle, my eyes get bigger and rounder, and the color goes green and the pupils get all cat-like and slitted, my ears also get pointy. It’s a little unsettling. Okay, it freaks my ass out. But it’s a part of what I am now. And the longer I wear the monster-face, the more progressive the change becomes. The more I look like a cat and the less I look like John Lei. It’s actually sort of helpful in some cases, like when I’m facing off against a room full of pissed off police officers.\n — 5 —\n Did I mention the angry cops? Yeah. Thought so.\n There’s no two ways to this. I had to get in, get out and stop long enough to look for clues along the way. And all I had to do was dodge all of the police officers in the place. Cops who had already been alerted to an intruder and were investigating the sort of murder that was going to make their lives miserable already. Was it my best move ever? I’m gonna have to go with no. Still, sometimes you have to do things you don’t want to do. I can only imagine what went through their heads, really. I mean, I know what I looked like: big, white, wet, pissed off cat in people clothes. I ran into the room and looked around as fast as I could. Living room, nothing of importance, aside from several cops. Iwasn’t looking to get into a fight, just to get evidence. I started for the hallway and one of the cops did the police thing and stepped in the way, reaching for the gun. I hit her in the face. Yes, her. Yes, the face. No, I am not proud of that moment, but it was all I could do. Given a choice between hitting a woman — even a cop — and saving my sister, there is no choice. I did the right thing.\n She smacked into the wall hard enough to crack the plaster. I kept going and ducked down, praying really, really hard to avoid getting a bullet in the back. Something stung across my left buttock and a second after that I felt the heat. I guess sometimes God or whatever has a sense of humor, because I sort of got my wish. I got grazed instead of dead.\n Three doors, and two of them were closed. The only one that was open had three uniforms coming out of it, and unlike the one I pushed past, these already had the guns out. I let out a scream and they sort of half jumped from their skin. Did I mention I don’t sound quite right when I’m doing the monster-face thing? According to Anna, I have a deeper voice. I also have a scream that sounds like a teakettle on steroids. I still don’t quite know what to make of that, but it freaks people out a bit. Poor Anna almost wet herself the first time I did it. In my defense, she’d just slammed the car door on my fingers. That shit hurt.\n You know what the difference is between a highly trained officer of the law and the average loser with a gun? Training. What? It’s not a trick question. A lot of people maybe freak out when they hear my scream. The cops? They got a little jumpy, and then they opened fire on the monster that had just taken down one of theirs. How could they know if she was alive or dead? I didn’t know myself, and I was the one that hit her. So they opened fire. And I ran at them even faster. I can’t dodge bullets. I can’t run so fast I break the sound barrier — seriously though, how cool would that be? — and I am not bullet proof. The only real chance I had was that they could only shoot me if I was far enough away to let them shoot without killing themselves in the process. I cleared the distance between me and them fast enough that they only managed one shot each. The first bullet ripped past my ear and left it ringing. The second bullet caught my coat and took a chunk of the fabric. The third bullet fired caught me in the stomach. That one hurt a lot. I didn’t have time to stop and complain about it, or to really check what sort of damage got done. I kept running. And I hit the three of them like a bowling ball hits pins. I moved on through and they went sailing.\n And as soon as I cleared the three cops at the threshold I was in the room and falling on my face. Like I said, I’m not bullet proof. And momentum only takes you so far. The pain hit me even harder as I fell into the master bedroom and took out a chair that was situated in front of the adjoining bathroom. The place was luxurious, but I didn’t have a lot of time to check that out. I was bleeding, I was hurting, I was desperately in need of getting away from the cops in the room and the ones I’d just knocked halfway across the room, too.\n There were too many scents: I could smell the cops, I could smell their individual odors, from sweat to cologne to hairspray, the cigarettes a couple of them indulged in when they weren’t at an active crime scene, and I could smell the corpse that was still sprawled across the bed.\n Edward Blevins was a partier. He liked to have a good time, and I bet under different circumstances I might have even gotten to like him. According to the people I talked to on the way to his place, the son of the Sixth District’s state representative was generous when it came to sharing his cash and his drugs alike. He was quick witted, liked to share the wealth and had a thing for Asian girls. So, you know, we had a lot in common once upon a time. Of course, the fact that the girl he was with that night was my sister might have put a damper on things.\n I was too late, as evidenced by the cops everywhere. I knew that when I showed up, but he was the only lead I had, so I had to press forward. Blevins was dead, of course. He’d been torn apart, same as the last victim, and there were parts of him missing, same as the last time. It’s possible he was handsome when he was alive, but the flesh had been taken from his face, and his eyes were chewed out. His tongue was gone. His heart was gone. If I had the time to check I’d have probably found out that his liver was gone, too, and his penis. Maybe a few other things, too, but all of the bodies had that much in common so far.\n He was very dead. If it was like the last reported murders, he was alive when it started. The one before him had lasted almost ten minutes after the feeding began. The thing that was doing the killings liked to play with its food.\n I got to my feet and threw a nightstand at the cop trying to tackle me. The furniture hit him square in his bulletproof vest. Turns out the things don’t necessarily stop furniture. He fell flat on his back and didn’t get back up. One sniff and I had it. The same smell, like salt and cinnamon and something that had gone just a little rancid. The exact same scent. And under that potent odor? I could smell Blevins, of course, and his insides, and his waste. And Anna. I could smell her, too. And I could smell her fear.\n — 6 —\n Listen, I didn’t want this. I tried hard to adjust to my life with the changes that were taking place, and I tried to go about my life like nothing was different. I dyed my hair black. I cut it shorter, too, because it grows like there’s no freaking tomorrow. I almost never had to shave before the coma, but afterwards, I started shaving like a hairy Greek man. Seriously, by four in the afternoon I start sporting a serious case of the fuzzies. And yes, the damn stuff grows in white. Anna started calling me her little Chia Pet. It was funny the first billion or so times, and after that, not so much.\n I tried to get on with my life. I made adjustments. Faster, stronger, tougher, remember all of that? Didn’t take long before the local heavy hitters decided it wouldn’t hurt their feelings to have their very own pet vampire as an enforcer. I got a nice raise, and I got to start picking and choosing my hours. Hell, I even started going to school, because I had enough extra money to afford it. Anna was smart and got scholarships. I was a screw up and had to do it the old fashioned way. I was adjusting just fine.\n And then the other one showed up. I would have been in deep shit, seriously deep shit, because while I wasn’t exactly advertising my change in lifestyle, it wasn’t like I was able to hide it completely, either. But I got lucky. I was getting checked out by Doctors Ethan Lebbon and by Maggie Ruiz at the same time that the first murder took place. And there were witnesses, so, you know, I got lucky twice over. While the good doctor was looking me over on behalf of Maggie Ruiz, something that was described as a “green, long-haired ape with tusks” attacked a bouncer at one of the local bars. That description? My granny used to tell us stories about the green ogres. They were beautiful people sometimes and they were monsters other times. And when they were monsters, they sort of had that same description. Ogres. Maybe it was another case like mine, you know recessive genes, viruses … And the next thing you know a guy is dead. The guy was just doing his job, and this thing came out of the alley where the bar let out and attacked him. People saw him try to fight the thing off. He hit it in the face four or five times and it took the blows like they were nothing. And then it grabbed him by one arm and dragged him back into the alley. As soon as he started screaming, I mean really screaming, the police were called in. Seems no one was quite brave enough to run down the dark alley and help him. I know I wouldn’t have, not from what I heard about that thing. Whatever it was, it took all the same parts from the bouncer that it did from Edward Blevins. By the time the cops arrived, the thing had finished its work and made a run for it. \n","sourceLink":"https://allnovel.net/v-wars/page-58.html","bookId":2571,"book":{"id":2571,"title":"V-Wars","description":"Storyline: \n V-Wars \n by Jonathan Maberry , Alan Robinson R. (Artist), John Everson , Keith R.A. DeCandido , Scott Nicholson , Nancy Holder , Yvonne Navarro , James A. Moore , Gregory Frost … \n A sweeping, threaded narrative of the global phenomenon known as the Vampire Wars! Mankind is silently infected by a millennia-old bacteria unknowingly exhumed by a scientific expedition in Antarctica. Now, in some rare cases, a person\u0027s so-called \"junk DNA\" becomes activated, and depending on their racial and ethnic heritage they begin to manifest one of the many diverse forms of the \"others\" that are the true basis for the legends of supernatural creatures. These aren\u0027t your usual vampires and werewolves - it goes much deeper than that. Conceived by Jonathan Maberry, V Wars features stories from various \"frontlines\" as reported by such contributors as Nancy Holder, Yvonne Navarro, James A. Moore, Gregory Frost, John Everson, Keith R.A. DeCandido, and Scott Nicholson (as well as Maberry himself, of course). The result is a compelling series of tales that create a unique chronicle of mankind\u0027s response to this sudden, hidden threat to humanity.\n \n","cover":"https://allnovel.net/images/v-wars.jpg","author":"Jonathan Maberry","type":"Horror","source":"allnovel","link":"https://allnovel.net/v-wars.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 5, 2019 5:58:15 PM"}}
