{"id":13198,"no":12,"title":"CHAPTER XII. WHICH ENDS THE TALE.","content":"Frank Reade, Jr., left bound hand and foot upon the floor of the main cabin of the Donna Veneta, was in by no means a happy frame of mind. \\n\\n \\n\\n He was always clear grit and never given to despair. \\n\\n \\n\\n Yet at that moment his case looked black and hopeless enough. \\n\\n \\n\\n He lay for some while after the departure of his captors without making a move of any kind. \\n\\n \\n\\n The other occupants of the cabin were respectful enough. Occasionally one of the dead buccaneers would lazily change his position, or, catching a current, float across the cabin. \\n\\n \\n\\n At such times the young inventor could not avoid a chill of horror, so ghostly and supernatural did the buccaneers look. \\n\\n \\n\\n Some time elapsed. \\n\\n \\n\\n It seemed an age to Frank. \\n\\n \\n\\n He speculated upon his chances in a methodical sort of way and gave himself up to somewhat morbid reflection. \\n\\n \\n\\n After all, his worst fate could only be death. It must come to him some time. Drowning was, after all, not the worst form. \\n\\n \\n\\n Again the suicidal mania threatened him. Especially was this the case when he reckoned the hopelessness of his position. \\n\\n \\n\\n After a time, however, reaction was bound to set in. \\n\\n \\n\\n Life never seemed to have a more rosy hue. It would seem a transition into paradise to reach the upper world. \\n\\n \\n\\n With this came a desperate sort of hope. \\n\\n \\n\\n Why not make a supreme effort? \\n\\n \\n\\n He could do no worse than fail. Once his mind was made up there was no faltering. \\n\\n \\n\\n He began work on his bonds. He writhed and twisted for some while. The water had swollen the ropes, but it had also weakened the strands. \\n\\n \\n\\n He rolled over and over until he reached the door of the captain’s cabin. Here his gaze fell upon an object which gave him a thrill. \\n\\n \\n\\n It was an ax. \\n\\n \\n\\n 52It had been dropped there by one of the divers. At once Frank saw his opportunity. \\n\\n \\n\\n He rolled over to it in such a manner as to press his bonds against its keen edge. \\n\\n \\n\\n Again and again he pressed the cords against the keen blade; one by one the strands snapped. \\n\\n \\n\\n Finally the last one was cut; Frank experienced a thrill. \\n\\n \\n\\n The rest was easy. \\n\\n \\n\\n He had the use of his hands now, and with the blade of the ax he cut the other bonds. \\n\\n \\n\\n He scrambled to his feet a free man; for a moment he was undecided how to act. \\n\\n \\n\\n His impulse was to get out of the cabin of the galleon; but how could this be done? \\n\\n \\n\\n The hatch had been battened down by the Aurelian’s divers when they went away. Could he hope to break it open? He could at least try. \\n\\n \\n\\n He ascended the stairs and dealt the hatch a blow. Joy! it yielded, and with a great effort he forced it open. \\n\\n \\n\\n He pushed away the sand and emerged at last from the prison he had occupied so long. \\n\\n \\n\\n He examined his generator. \\n\\n \\n\\n There were chemicals enough in it to last full forty-eight hours longer. \\n\\n \\n\\n “Perhaps by that time they will return for me,” he reflected. “At least I will cling to hope.” \\n\\n \\n\\n He looked about him. \\n\\n \\n\\n There was no sign of the submarine boat or of the Aurelian’s men in the vicinity. He was in a quandary as to what to do. \\n\\n \\n\\n While in this state of doubt he wandered away from the spot for some ways. \\n\\n \\n\\n Again a strange drowsiness came upon him. He could not help but yield to it. \\n\\n \\n\\n He waited for a time, fighting off the sensation. Then selecting a secluded spot under the reef, he sank down. \\n\\n \\n\\n In a few moments he was sound asleep. The water surged about his prostrate form, little fishes came and peered in at the windows of his helmet. \\n\\n \\n\\n But nothing of this kind woke him. How long he slept he knew not. \\n\\n \\n\\n But when he woke up all was a glare of light about him. He was some while collecting his scattered senses. \\n\\n \\n\\n 53Then he arose and looked about him. His whole being thrilled. \\n\\n \\n\\n “Saved!” he gasped. \\n\\n \\n\\n It was no dream. Not fifty yards distant was the submarine boat, Dolphin. \\n\\n \\n\\n Frank at once started for it. He reached its side and clambered over the rail. \\n\\n \\n\\n He entered the vestibule and exhausted it of water. Then he removed his helmet and stepped into the cabin. \\n\\n \\n\\n The effect was startling. \\n\\n \\n\\n Clifford sat by a table looking over some maps. Barney was engaged in the pilot-house. \\n\\n \\n\\n Clifford started up with a gasping cry: \\n\\n \\n\\n “Heaven preserve us!” he shouted, “it is Frank Reade, Jr.” \\n\\n \\n\\n Frank was wildly embraced by both. \\n\\n \\n\\n “Be the sowl av Pat Murphy s cow, I’m happy onct more,” cried Barney, turning somersaults across the cabin. \\n\\n \\n\\n “But—how on earth did you get here, Frank!” cried Clifford, “we had given you up.” \\n\\n \\n\\n “I have had quite an experience,” said Frank, with a smile, “but where are the others?” \\n\\n \\n\\n “They are in the cabin of the galleon.” \\n\\n \\n\\n “But—what has become of the Aurelian?” \\n\\n \\n\\n “Driven away by a gale. The coast is clear. Before she can return we can recover the Donna Veneta’s treasure and be off.” \\n\\n \\n\\n “You are right.” \\n\\n \\n\\n Then Frank told his story. \\n\\n \\n\\n Clifford was more than delighted when he learned of the amount of the galleon’s treasure. \\n\\n \\n\\n “We will cheat old Parker out of it after all!” he cried wildly. “That is to pay the old scamp for his rascality.” \\n\\n \\n\\n “You are right,” said Frank, and began to put on his helmet. \\n\\n \\n\\n “Where are you going?” \\n\\n \\n\\n “I am going down to join Hartley and Pomp, and help them get the chests of gold out.” \\n\\n \\n\\n “Good! What assistance can we be?” \\n\\n \\n\\n “Keep watch for us and manipulate the searchlight to our advantage.” \\n\\n \\n\\n “I will do that!” \\n\\n \\n\\n 54Frank now left the Dolphin. He slid over the rail and started for the galleon’s hatch. \\n\\n \\n\\n Reaching it, he began to descend, but before he reached the bottom of the staircase a form slid forward and embraced him. \\n\\n \\n\\n “Massy Lordy, if it ain’ Marse Frank. Whereber you cum from, sah?” \\n\\n \\n\\n It was Pomp. \\n\\n \\n\\n It is useless to dwell upon that reunion. It was a happy meeting. \\n\\n \\n\\n It did not take long for them to exchange experiences. Then Hartley said: \\n\\n \\n\\n “So the Aurelian was driven away by the hurricane, eh? Well, she will return, you may be sure. Old Gilbert Parker is a genuine bulldog.” \\n\\n \\n\\n “Let him return,” said Frank. “We will deal with him next time as he deserves. It is true that he would have murdered the whole of us.” \\n\\n \\n\\n “Golly, dat am right!” cried Pomp. “I done fink we bettah get dat gold abo’d de Dolphin an’ start fo’ home.” \\n\\n \\n\\n “That is just what we will do,” agreed Frank. \\n\\n \\n\\n So they went to work at once hoisting the chests of gold out of the Donna Veneta’s hold. \\n\\n \\n\\n In a short while they were all piled up on the sands outside. \\n\\n \\n\\n Then they were easily transported aboard the Dolphin. The galleon’s hatch was then closed, and it was left with its ghastly occupants to remain forever buried at the bottom of the Honduras Gulf. \\n\\n \\n\\n There seemed no reason now for lingering in the vicinity. \\n\\n \\n\\n But Frank had some curiosity to know what was the fate of the Aurelian, so he sent the Dolphin away toward the Miller’s Cay in quest of her. \\n\\n \\n\\n The hurricane had passed, yet Frank did not deem it advisable to go to the surface. So the Dolphin pursued her way under water. \\n\\n \\n\\n When at a point which Hartley declared was not two miles from the Cay, it was decided to go to the surface. \\n\\n \\n\\n Up went the Dolphin; then as she rose above the waves every eye scanned the watery waste for a sail. \\n\\n \\n\\n No sail was in sight, but not half a mile to windward a wreck drifted. \\n\\n \\n\\n “Mercy on us!” cried Frank. “Can it be the Aurelian?” \\n\\n \\n\\n 55The submarine boat ran nearer to the wreck. Then upon the stern was read the name “Aurelian.” \\n\\n \\n\\n She was a shattered, water-logged hulk. \\n\\n \\n\\n Not a sign of her crew was visible; she was hailed repeatedly, but no answer came back. Even as the voyagers were gazing at her she took a sudden plunge and went down. \\n\\n \\n\\n After the last ripples had died away upon the spot where she disappeared, Frank turned the Dolphin’s head homeward. \\n\\n \\n\\n Nothing was ever seen again of Gilbert Parker, of Captain Warren, or any of the Aurelian’s crew. It was safe to say that all had met a deserving fate in the waters of the Gulf of Honduras. \\n\\n \\n\\n Homeward bound was the Dolphin with her Spanish gold. \\n\\n \\n\\n Readestown was safely reached at last. Then followed a division of the treasure. It made all rich enough. \\n\\n \\n\\n 56Clifford and Hartley returned to their homes happy men. Frank Reade, Jr., went back to his shops and his plans. \\n\\n \\n\\n Barney and Pomp resumed their duties as of yore, waiting for the moment when Frank should be impelled to go off on another cruise to some wonderful part of the world. Until such time we will bid the reader a kind adieu. \\n\\n THE END. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1797/52231.html","bookId":1056,"book":{"id":1056,"title":"The Galleon\u0027s Gold","description":"简介： The clipper ship Aurelian, one of the few survivors of the old West India trade, had sighted Sandy Hook, and was making New York harbor after a remarkable voyage from Belize....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1797","creation":"Aug 1, 2019 12:24:16 AM","modification":"Aug 1, 2019 12:24:16 AM"}}
