{"id":13189,"no":3,"title":"CHAPTER III. THE BOTTOM OF THE SEA.","content":"Barney and Pomp had faithfully made every preparation for the submarine cruise. Stores sufficient to last two years were aboard the boat. She was in apple-pie order, her dynamos being ready to start at an instant’s notice. She rocked lightly in the tank, and as Hartley and Clifford went aboard of her they were enthused. “By the great whale!” cried the captain, “she’s the neatest sea craft I have ever seen.” “A floating palace!” declared Clifford. “Mr. Reade, this is no ordinary invention.” “Well,” admitted Frank, “she quite excels anything I have yet manufactured, I admit. Yet I think I can excel her merits.” 11Hartley looked incredulous. “It does not seem possible,” he said. “And yet I cannot dispute you, Mr. Reade. I think anything is quite possible for you.” Frank bowed modestly at this profuse compliment. Then they all repaired to the office again. A day was agreed upon for the start, and all hands were to be ready at that time. It was believed that the Donna Veneta could be found even without the important diagram left by Don Cristobal. As she was a submarine boat, this seemed plausible enough. “At any rate,” declared Clifford, “if we can do no better, we can go into the interior of Honduras and look up the record in the ruin again.” “But if Parker abstracted the diagram, what was his purpose?” asked Frank. The trio exchanged glances. “Perhaps he thinks of getting in ahead of us with the Aurelian,” ventured Hartley: “it is just like the old hypocrite.” “Indeed, that is so,” agreed Clifford. But Frank Reade, Jr., frowned. “It will bother him some to locate the Donna Veneta before we do,” he said. “It is possible that he can do it, but I don’t believe it.” So the matter was dropped. The spirits of the fortune hunters were high. They could not restrain their exuberance. That night Hartley and Clifford went back to New York to complete their preparations. In three days the Dolphin was to begin its submarine voyage for the Gulf. On the afternoon of the second day Hartley picked up a daily paper, and as is always a sea captain’s wont, glanced over the shipping news. He gave a sudden wild start. “Great whales!” he gasped; “just look at this.” He placed his finger on an item. Clifford read it: “S’ld: Thursday, June 5th, the ship Aurelian, Captain Jed Moore, for the West Indies and Central American ports.” The two men looked stupefied. Then Hartley raised his finger significantly. “Just as true as you live, Cecil Clifford, that old scoundrel is going to try and recover the Donna Veneta’s treasure.” “But he has no right to it!” 12“What does he care?” “It would be the act of a thief.” “That is just what he is.” Hartley was thoughtful for some while. He knew that the Aurelian would have a day’s start of the Dolphin. But could she beat her to Honduras? If Parker really had the diagram he certainly had an advantage, for he could at once locate the treasure. “Well, there is one thing about it,” said Cecil resolutely, “if we run against him in those waters there will be likely to be trouble.” “You are right.” “I don’t believe Frank Reade, Jr., will take any of their impudence.” “Nor I.” “Perhaps we had better let him know about this at once. Shall we wire him?” “Better see him in person. Can we not be all ready to start for Readestown to-day?” “I see no reason against it.” “By all means let us go.” It did not require much time for the two excited men to get all in readiness for an early start. Frank Reade, Jr., was not a little surprised when he heard the report of Parker’s conduct. “There is no doubt but that he has gone to Honduras to recover the treasure,” he said, “but we will beat him at that game.” “Good!” cried Hartley and Clifford in chorus. “We knew what your sentiments would be, Mr. Reade.” “Well, that is just what they are,” said the young inventor resolutely. “We will make trouble for Mr. Parker. He is entitled to no part of the Veneta’s treasure nor shall he have it.” The Dolphin was in apple-pie order and ready for the start. A few hours later all were aboard. We will not dwell upon the leave-taking of Readestown. A large crowd wished the submarine navigators God-speed. The Dolphin a few days later sailed the waters of the Gulf, and was rapidly on her way to Honduras. Thus far she had sailed most of the distance on the surface. Now, however, Frank decided to proceed the rest of the way under the water. So he pressed the valve which filled the reservoir, and the boat at once began to sink. Down she settled gracefully beneath the waves. In spite of themselves the voyagers could not help but feel a curious thrill as they went below the surface, and knew that they were going to the bottom of the sea. 13There was a brief instant of darkness. Then Frank touched the electric lever and—presto! the interior of the boat was ablaze with light. And outside the radiance shed far and wide into the sea depths. Myriads of fish came trooping down through the translucent mass. They were of thousands of shapes, colors and varieties. Some of them were so large as to threaten the safety of the boat. But fortunately these large ones were great cowards, and kept at a safe distance from the boat. Frank turned on the searchlight and sent its rays shooting down into the depths. As yet the bottom could not be seen. “Are we getting down to the center of the earth?” cried Hartley; “it must be an immense depth here!” “I see nothing of the bottom yet!” cried Clifford. “Can the little boat stand the strain, Frank?” The young inventor knit his brows. “Why, I think so,” he said, but yet looked anxious, for the Dolphin was creaking and groaning somewhat; “the bottom must be near. Ah, there, I can see it!” And a wonderful sight it was which burst upon the view of all at that moment. The bottom of the sea. They were sure at that moment that they were the only human beings who had ever beheld it at that depth. It was like a view into another and strange world. To adequately describe it would be quite impossible. There were forests of marine plants, some of them gigantic in size, cavernous recesses, the lurking place of strange sea monsters, and coral reefs deeply submerged in sand. The Dolphin sailed over this wonderful scene, while the voyagers took it all in spellbound. “If the Veneta is sunk in such a sea as this,” declared Clifford, “it will be difficult enough to get at her on account of the marine growth.” “You are right,” agreed Hartley. “What do you think of it, Frank?” “Well,” said the young inventor, after some thought, “I hardly believe that the sea which the Veneta is buried in is of the same sort as this. While the Gulf of Honduras is undoubtedly rich in marine growth, yet I believe that there are greater tracts of sandy plain and coral reef. Let us hope to find the Veneta in such.” “Amen!” cried Clifford. “We will accept no other belief anyway!” The Dolphin kept on for miles sailing over the forest of marine growth. 14Had the voyagers felt the inclination there would have been no open space for a safe descent. For to risk a descent among the tangled fibers and branches of the marine plants would be worse than folly. Powerful as the Dolphin was, she might not be able to extricate herself. For hours the submarine boat kept on in this way. Barney was at the helm, while Frank and Hartley and Clifford sat in the cabin and discussed the subject of locating the Veneta. Barney kept his hand on the Dolphin’s wheel and a sharp lookout out of the window at the same time. Pomp had been at work in the galley. He had finished his cooking and for a moment stood looking out of his window at the curious sights which seemed to pass in review before him. Suddenly he heard Barney in the pilot-house above calling him. “Shure, naygur, an’ phwere is the heart av yez? Can yez bear to see me stharve, yez ill-mannered coon yez?” “Huh!” grunted Pomp. “Why didn’t yo’ say yo’ was hungry?” “Bejabers, yez have only to luk at me to see that.” “Yo’ am right dar, I’sh; wha’ yo’ loike fo’ to eat?” “Shure I’ll take it in liquid form if yez don’t moind.” “Yo’ want some consomme, den?” “Divil a bit! Yez know phat’s best to warrum the cockles av me heart.” Pomp chuckled. “I done fink I undahstan’ yo’,” he said. “I brung yo’ up some dreckly.” Pomp reached down behind the flour bin and brought forth from the darkness a black bottle. The label on it read: Good Bourbon Whisky. Now everybody knows the Irishman’s weakness; the Englishman imbibes ale, the German drinks beer, the Frenchman sips wine, the American brandy, but the true bred Celt despises all of these, and turns to whisky. Pomp poured a good dose of the pure article into a small flask; then he did something else.","sourceLink":"http://novel.tingroom.com/jingdian/1797/52222.html","bookId":1056,"book":{"id":1056,"title":"The Galleon\u0027s Gold","description":"简介： The clipper ship Aurelian, one of the few survivors of the old West India trade, had sighted Sandy Hook, and was making New York harbor after a remarkable voyage from Belize....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1797","creation":"Aug 1, 2019 12:24:16 AM","modification":"Aug 1, 2019 12:24:16 AM"}}
