{"id":26925,"no":35,"title":"CHAPTER XXXIV.","content":"DETERMINE TO PREACH TO THE PEOPLE—REFUSED A HOUSE—HOLD AN OPEN-AIR MEETING—STRANGE CONGREGATION—SIX OTHER MEETINGS—VISIT A NATIVE KING—HE COMMANDS ME TO LEAVE—I DO SO IN ORDER TO AVOID BEING PUT TO DEATH—WATERMELONS AND OTHER VEGETABLES—NATIVE TRADITION OF THE PEOPLING OF THE ISLANDS—VISIT OF A PROTESTANT MINISTER—SAIL FOR TAHITI—IN A HEAVY STORM—PRAYERS BY FRIGHTENED NATIVES—I AM ASKED TO PRAY WITH THEM, BUT DECLINE TO FOLLOW THEIR METHODS—REACH THE HARBOR OF PAPEETE—AMERICAN CONSUL OBTAINS PERMISSION FOR ME TO LAND—GO TO WORK WITH A CARPENTER—WARNED NOT TO BE ALONE LEST I SHOULD BE KILLED—WATCHED BY GEN D\u0027 ARMES—TROUBLE AT ANAA, AND ARREST OF NATIVE MORMONS—THESE ARE BROUGHT TO PAPEETE—HOW THEY GOT LETTERS TO ME, AND THEIR REPLIES—MY FORMER PERSECUTORS OF RAIVAVAI COME TO ME FOR ADVICE, AND I RETURN GOOD FOR EVIL. AS I felt the great need of reform among the people of Rapia, I tried again to get the privilege of preaching to them in their house, but found them unyielding on that point. There were three native brethren and their wives who had come with me. I was impressed that we ought to make yet another trial to leave our testimony with the islanders, so we went out by the side of their meeting house, which was a frame building set up on blocks some eighteen inches or two feet from the ground, the dirt floor being thatched with dry grass. We stood within ten feet of the house and commenced to sing. Before we were ready to read our text, it seemed that everybody in the village had come around, but not in the ordinary way. They crowded into the meeting house and some filled the windows, while others lay down and poked their heads out under the sills of the house; still others got down on their hands and knees some five or six rods off and crawled along through the shrubbery, taking hold of the brush as they drew near, lying flat down and drawing themselves along, taking sticks and poking the weeds aside so they could get a better view. With this most singular congregation before us, and the most perfect order (for it seemed as if there was not a whisper,) we read a chapter in the Bible—the third of Matthew, I believe—then preached on faith, repentance, and baptism for the remission of sins. At the dismissal of our services the whole assembly withdrew, and after that I had lots of food, such as it was. We held seven meetings on that little fragment of terra firma, and visited the king in the west village. We found the royal personage at home, sitting Indian fashion on his couch, half naked. He appeared to be a man of unusually strong character, very surly, and did not want to talk. When I attempted to tell him the object of my mission to his country, his neck swelled out, and he began blowing through his nostrils like a mad bull. He said, \"You leave my country.\" By this time my native friends discovered that danger was gathering around us, and told me that we must not delay one moment, but must get away as quickly as possible, for that village had suffered defeat at the hands of the people of the other village, and we could not be friendly with the king and his followers if we were to the others. We got away, and afterwards it developed that my friends had foreseen a peril that I had not fully understood, for when the king said we had better get away from his country, that was his ultimatum, and if we had remained longer every one of us would have been slain, as the people were preparing for the slaughter. On our retreat I observed a castor oil bean tree loaded with beans. Its trunk was as large as a man\u0027s body. I began to inspect it when my friends called out, \"Hurry up, or we will every one be killed,\" so we hastened to more friendly and hospitable parts, where we came across a large gourd, or calabash vine, and a watermelon patch. Never having seen anything of the kind on any other island where I had been, my inquisitive propensities were set to work ascertaining how those things came there. Were they a spontaneous growth? If not, where did they come from, since this little island is so remote from all others, and the natives tell me that white men seldom visit them? I inquired of the people where they got the seed of the vegetables named. \"Why,\" said they, \"our forefathers brought them here.\" \"Where did they come from?\" The reply was, \"From the rising of the sun.\" On hearing this, I asked from what country, and was answered, \"We do not know. It was a big land, so big they did not know its boundary. It was a land of food, and of great forests of big trees, and great fresh waters that were filled with fish.\" I next inquired, \"How came they to leave such a good land?\" The response was in these words: \"We do not know, only they said they got lost in the fog, and were several days without seeing the sun. Then the strong winds came and blew them over here, and their vessel was wrecked on this island. They never could get back to the lands of their forefathers, so they stayed here. They increased so fast that all could not live on this land, so they made canoes and tried to get back, but the winds were against them, that they were carried away to the west, and for a long time those left here supposed the others were lost in the sea; but after a time it was learned that there were other lands where the sun goes down. Then our people made canoes and went to them, and we think that is the way these islands became peopled, for they are the same kind of people as ourselves.\" \"Have you any other knowledge of your forefathers?\" \"No, we do not know anything but that which the fathers have said. They used to say that if they could get back to their fatherland they could find metal to make fish spears and hooks with. When the first white men\u0027s ship came in sight we tried to go to it, thinking we could get some fishing tackle therefrom. We thought that vessel must have come from our fathers\u0027 land. But the wind was so strong we could not get to the ship, and it was a long time before another one came. Finally we reached one, and got such things as our fathers had told us about.\" Read the Book of Mormon, page 427, 63d chapter, 5th to 9th verses. Was the ship that Hagoth built the same that was wrecked on the island of Rapia, South Pacific Ocean, about 25 deg. south latitude, and, as near as I can find out from French charts, time reckoned from Paris, France, in longitude 140 west? The reader may form his own conclusions, as I return to my narrative of our stay on the island. When we had returned from our visit to the surly king, one man by the name of Mesearee opened his house for us to hold meeting in, but very few attended with us. October 17th, the bark John Williams called with one Mr. Platt, a Protestant minister, on board. This clergyman was a man of fine address. He came ashore and preached, then sprinkled all the infant children of the village. Though very pleasant, he refused to talk with me in the Tahitian language, saying that if we did so on the Scriptures it would cause a split among the people. I insisted that he show the natives the scripture for his mode of baptism, but he declined to do that, and boarded his vessel and sailed away. October 27, 1852, we sailed for Tahiti. On the 29th we encountered a very heavy storm, so severe that we lost all of our sails, and had to lash two of our strong men on deck with slack rope so that they might fasten down the hatch and companion ways. The rest of us had to go below, for the sea was lashed into a foamy mass as white as snow. It did not seem possible for us to survive the terrible ordeal. As in almost all similar cases, the wicked will pray—that is in times of great danger, if at no other time—so the natives who went below, some fifty-nine in number, divided themselves into three praying parties. One of these occupied the bow, one stationed itself amidships, and one was in the stern of the vessel. Then a man in one party would pray at the top of his voice, and so on with each party in turn. Thus they prayed, passing the word back and forth, as long as the sea raged in its fury. In all of our travels together, those in charge of the vessel had never honored me with a request to attend prayers, or once called me to ask a blessing, but now, in our great peril, one of the old priests found his way in the dense darkness to my berth, and said: \"Iatobo, you pray to your God of power, to spare us, that we may not die in this great sea.\" I told him no, for I had done my praying on land, before I had boarded the schooner, and now I had all that I could do to hold myself in the berth, that I might not be thrown out and killed. He returned with a grunt, and commanded the rest to pray. These conditions continued for six or seven hours, when the wind abated, and the little schooner pitched and rolled as if she would go to the bottom. November 1, 1852, we sighted a reef called Hereheretue. On the 9th we came in view of Metia, and on the 10th we went into the harbor of Papeete, Tahiti. It was on the 11th when, through the intervention of Mr. Kelly, American consul, I got permission to land. The same gentleman gave me an introduction to one Charles Hill, a carpenter, who was rather a backslider from the Mormon Church. Still, he was very friendly, and said that if I would assist him in carpenter work he would board and lodge me until I could get a passage home. Mr. Kelly counseled me not to be alone anywhere, as a watch would be kept over me every minute I was on the island. He said he would not be responsible if I preached or traveled out of the town, as I was liable to be shot the moment that I was found alone. Said he, \"The French are more bitter towards you than ever. They seem to think you would turn everything upside down if you were allowed to run at large. I have never seen them so excited over anything as they are about you. They are actually afraid of you, for fear that if you were permitted to go among the people again they would revolt at once, and there would be another war.\" He also said that he would arrange matters so that I could go with Mr. Hill to and from his work, and if we kept close together, he thought it all safe, as Mr. Hill was well known; but that I had better stop in his office till he could see the governor, and I could go out to Mr. Hill\u0027s in the evening with him, as he lived in the suburbs of the town. Mr. Kelly also told me there had been more trouble at Anaa, and a number of our people from there were in prison on Tahiti; and further, that I was held responsible for all the trouble on that island. It having been arranged for me to stop with Mr. Hill, he called for me in the evening, and next morning I went to work with him at his business. In the meantime the news of my arrival on Tahiti spread very fast, and the sons of the prisoners from Anaa, who had followed their parents in disguise, and could visit the prisoners one at a time, put pencil and paper into their hands on the sly, so that they could write to me. Five or six of the young men dressed themselves as the regular \"toughs\" of the town, and met Mr. Hill and me, one of them bearing a note in his hand. When they got near us they began to dance and sing in a very rude manner, acting as if they would not give any of the road to us. Then they pushed the one with the note against me, and as he passed it into my hand the rest circled clear around so as to obscure me from two gen d\u0027 armes who followed us day and night. Then the young men would shout and laugh as if they had done it to annoy me in particular. Thus I received letters from the natives. The young men would meet us again, and I would pass to them the answers, while they would appear to the looker-on to be running against me purposely, to insult and annoy me. Sometimes I would try to show my displeasure by scolding at them. In this way a regular correspondence was carried on between the unfortunate prisoners and myself, during my stay. In that manner I learned that there were twenty-three of them in prison, there being ten Elders, five Priests, four Teachers and four Deacons. On the 12th there were eight more prisoners brought from the island of Anaa, six brethren and two sisters. All of the thirty-one were put to work on the steep side of a mountain, to make a road up to a fort. The hillside was so steep that some of them fell and were hurt quite seriously. Sometimes the prisoners were beaten by the guards that attended them. Their provisions were very poor, and they had not even enough of that. I will again mention my former persecutors of the island of Raivavai, with whom I traveled to Tahiti, for they came to me in great trouble, and said their schooner had been so badly damaged in the storm we had been in that the French had condemned it, and would not allow them to go to sea again. They were four hundred miles from home, without money, provisions or friends. They very humbly asked my advice, which I gave freely, telling them to state their case to the French authorities, and these would be bound to find a way to have them returned home and give them support until they did so. This pleased them very much; they seemed to appreciate the counsel of one whom they had sat in judgment and helped to pass sentence upon, ordering him to be burned. Doubtless some of them had aided in gathering the fuel to make the fire for the burning. I condoled with them as much as the conditions would admit of; and when I came to part with them they seemed to feel, and in fact said, that I had been a true friend to them. They wept as though they were my near relatives. Thus returning good for evil brought blessings.","sourceLink":"http://novel.tingroom.com/jingdian/1757/51354.html","bookId":1127,"book":{"id":1127,"title":"Life of a Pioneer","description":"简介： THE life of a pioneer in Western America always is full of peril and hardship; often it has a large share of startling episodes and thrilling adventures; not infrequently it is associated with notable historic events; and the experiences met with dev...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1757","creation":"Aug 1, 2019 12:24:25 AM","modification":"Aug 1, 2019 12:24:25 AM"}}
