{"id":26927,"no":37,"title":"CHAPTER XXXVI.","content":"ARRIVE AT SAN FRANCISCO—A WRECKED SHIP—THE ABYSSINIA CONDEMNED—GATHERING WRECKAGE—DRUNKEN SAILORS—MY TRUNK HELD FOR HOSPITAL FEES—GO ASHORE, WHERE ALL IS CHANGED AND STRANGE—MY DILAPIDATED APPEARANCE—SEEK GUIDANCE OF THE LORD—WANDER ALMOST IN DESPAIR—MEET AN OLD FRIEND—FIND A HOME—MY TRUNK RELEASED—MEET ELDERS GOING ON MISSIONS—WELL TREATED BY SAINTS AND STRANGERS—PROVIDENCES OF THE LORD—OUTWARD-BOUND ELDERS ENTRUST MONEY TO ME FOR THEIR FAMILIES—ENGAGE TO CARRY MAIL TO LOS ANGELES—ON A STEAMER FOR SAN PEDRO—TAKEN SEVERELY ILL. \n \n ON January 8th, 1853, we passed into the bay of San Francisco, where we came close to a big New York clipper ship, fast on a rock in the passage. While we were looking at the vessel, the tide came in and lifted it up; then it dropped back and was smashed as if it were only a matchbox. Luckily, the ship had been there long enough to be surrounded by boats sufficient to save the passengers, and perhaps their baggage. \n \n We soon dropped anchor from our dismantled bark, which, as I afterwards learned, was condemned as being unseaworthy, and never was allowed to go to sea again. The seamen on our vessel went to picking up the wreckage from the clipper ship. They chanced to catch a barrel of whisky, when the captain ordered it to be carried below. That made the sailors desperate. They seized an ax, crushed the barrel head in, and each seaman dipped with his cup. Within fifteen minutes they were wild with drunkenness. They armed themselves with axes, hand-spikes, belaying pins, marlinspikes, and any and everything they could lay hold of. Then the officers, and some of the passengers who had incurred their displeasure, were made to hunt hiding places below in doublequick time. That condition did not last long, however, before a compromise was effected, the captain took his position again, and the men went to landing passengers and baggage. I got my trunk ready to depart, when the captain demanded five dollars of me, for hospital fees, he said. As I had not so much as one dollar, I had to leave my trunk and go ashore, very sick and cold. \n \n When I reached the streets I found things so changed from when I was there before that I felt lost in the throng of people. It seemed to me that everyone was seeking his own gain, regardless of his fellow-men. It was push, ram, jam, on all sides. I had worn my clothes pretty well out, my hat had been so crushed that my hair was showing in the crown, and my shoe soles were worn very nearly off. \n \n In this condition I asked the Lord, in silent prayer, to show me what I should do. The Spirit said, \"Go up the street.\" I was then on California Street. I obeyed the whisperings, until I got near the top of the street. Without any consolation the thought came, What shall I do? The still, small Voice said, \"Go up the street,\" and I obeyed again. \n \n At last, almost despairing of everything, wholly sick and tired, suffering from lack of some refreshment, and feeling that there was no relief for me, I saw a man start across the street above me, and from the same side. When he neared the center of the street, he stopped and seemed to be looking at me. As I advanced, he turned around, and walked back two or three steps. By this time I started across toward him, and he came to meet me. It was Redick N. Allred, of the Mormon Battalion. \n \n We did not recognize each other until we went to shake hands. He said, \"How are you?\" I answered, \"Tired, sick, and hungry.\" \"Well,\" said he, \"come back across the street with me, to a lunch stand, and we will have something to eat.\" Soon the inner man was comforted, when Brother Allred told me there were thirty-six Elders in San Francisco, bound to foreign lands on missions. He led me to some of my old friends, and I found John Layton, whom I had been acquainted with on the Society Islands. He told me that if I would I could come and stop with him, and chop the wood and do the marketing; for his wife, being an islander, could not talk English well. I accepted the kind offer, and thus was provided with a home. \n \n I also met with Major Jefferson Hunt. We saw a Captain King, took supper with him, and told him that the captain of the vessel I had come on had retained my trunk because I had not five dollars to pay the hospital fees. Brother Badlam gave me the money to get my trunk, and Captain King gave me a note to a custom officer. I obtained my trunk after I had paid the captain of the Abyssinia the money, and I followed him up to the custom house, to the officer there, to whom I showed Captain King\u0027s note. The officer gave the sea captain a look, then said something to him, and without a word more he returned me the money. \n \n I next visited the Elders, and attended meetings with them. They had arrived several days before me, and had sold their teams in the southern part of California. They had also taken up some collections among the Saints. Brother John M. Horner having been very liberal to them, a number of them rendered me assistance. \n \n One day, as I was passing Widow Ivins\u0027, she called to me, and ran out to meet me, saying, \"Here is ten dollars that a lady gave me to hand to you, and here is thirty dollars more that she wishes you to convey to that body of Elders that is in town, to help them on their missions.\" I asked the name of the lady, and the reply was, \"I am not at liberty to disclose her name.\" She said the lady was not a Mormon, but had attended our meetings, and had stated that she was unworthy to be personally known to us; so I never learned who she was. \n \n At one time, when I was walking along the street alone, I was met by a stranger, who offered to shake hands with me. As we grasped hands, he pushed a five-dollar gold piece into mine. I said, \"What does this mean?\" He replied, \"None of your d—d business. Take it, and bless yourself with it. I have money due me, and if I am successful in collecting it, I will see you again.\" At that he dashed away in the busy throng, and I never saw him more, that I am aware of. \n \n On a still further occasion, I was met by an entire stranger, who put a dollar in my hand and said, \"Come, let us have some good cider and cake.\" I begged to be excused, but he would not listen to it; I had to go with him anyhow. We stepped to a lunch stand, where he said, \"Let this man have what he calls for; I want to catch that man,\" and away he went. The proprietor asked what I would have, and I told him I would await the return of my friend. He said, \"Never mind him, he is all right; he may not be back again till tomorrow morning.\" Then he insisted on my order, so I took some crackers and cider; but I never saw my friend again. Thus it seemed to me that great and wondrous were the mysterious providences of the Lord, for I had landed in San Francisco on the 8th of January, 1853, and by the 26th I had seventy-five dollars handed to me, much of it by entire strangers whom I had never seen before, nor have I seen them since. It seems mysterious to me how my way opened up and my necessities were met. \n \n The Elders outward bound treated me very kindly. They fitted themselves out for their several destinations, paid their passage, and then had some fifteen hundred dollars to send to their families, with their photographs and some small parcels, all of which they entrusted to me, with three small trunks, to take to San Bernardino. Of the money seven hundred and fifty dollars in gold was put into a belt and girded around my body; the balance was in drafts or checks. \n \n In the meantime, some of the Elders had met with Mr. Holliday, overland mail contractor. As he had not perfected his arrangements for regular mail service, he made some inquiries of the Elders about sending mail sacks by chance carrier to Los Angeles. They referred him to me, as they thought there would be something in it for me. He called, and I agreed to take charge of three sacks if he would deliver them on the steamer Sea Bird, on the morning of the 29th. On that date he sent the sacks just as we were putting off. He told me the pay would be all right when the sacks were delivered. \n \n I had paid thirty-five dollars for my passage to San Pedro, and we steamed out. On the morning of the 30th we landed at Monterey, and lay there till 4 p.m. During that time I had a severe chill, followed by a very high fever, which held on till next morning, when a heavier chill came on, like the ague, followed by fever. I had made my bed down on some nail kegs that were on deck; for the boat was so crowded with passengers of all classes that there was no possible chance for comfort. It semed that everyone was seeking his own convenience, regardless of his neighbor. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1757/51356.html","bookId":1127,"book":{"id":1127,"title":"Life of a Pioneer","description":"简介： THE life of a pioneer in Western America always is full of peril and hardship; often it has a large share of startling episodes and thrilling adventures; not infrequently it is associated with notable historic events; and the experiences met with dev...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1757","creation":"Aug 1, 2019 12:24:25 AM","modification":"Aug 1, 2019 12:24:25 AM"}}
