{"id":26947,"no":57,"title":"CHAPTER LVI.","content":"VISIT VARIOUS PLACES OF INTEREST IN NEW YORK AND VICINITY—ARRIVAL OF THE GREAT EASTERN—PREACH AT WILLIAMSBURG—NEW YORK\u0027S CELEBRATION OF THE FOURTH—MY THIRTY-SECOND BIRTHDAY—SECURE PASSPORTS AND OCEAN PASSAGE—CROWDED IN THE STEERAGE—FOGGY AND WET WEATHER—VIEW OF THE IRISH COAST—FLEET OF BRITISH WARSHIPS—LAND IN LIVERPOOL—ASSIGNED TO BIRMINGHAM CONFERENCE—IN BIRMINGHAM—LISTEN TO ANTI-MORMON LECTURE—VISITING FROM HOUSE TO HOUSE AS A MORMON MISSIONARY—PLACES OF INTEREST—TRANSFERRED TO NOTTINGHAM CONFERENCE—PREACHING AND VISITING—MISSION TRAVELS—GO TO LONDON—SEE NOTABLE PLACES—NEWS OF MY DAUGHTER\u0027S DEATH—BIRTH OF ANOTHER DAUGHTER—RETURN TO NOTTINGHAM. THE 27th of June was spent with Apostle A. M. Lyman and J. Croxall, walking about the city of New York. That day F. M. Lyman and Reuben McBride arrived, and next day Apostle Lyman and his son Francis M. left for Boston. With Reuben McBride, I visited the various departments of the place where J. Croxall and his son worked. We then crossed East River with Thomas Miller, and strolled through Williamsburg. We were introduced to a Brother Stone and family, with whom we stayed all night. On the 29th we were made acquainted with many Latter-day Saints in Williamsburg, then crossed over to Brooklyn, where we went through the navy yard and other places; at the first named place we went on board the old ship of war North Carolina. That day we heard the salutes fired for the Great Eastern, as she steamed up the wharf in New York. The ocean monster was hailed with joy and enthusiasm. She had been sighted at sea the evening before. In New York City, on the 30th, we visited Barnum\u0027s museum, Castle Garden, the postoffice, and had a view of the Great Eastern. I received a letter from my family reporting all well. The 1st of July was Sunday, and we met with the Latter-day Saints in Williamsburg. The speakers at the meetings that day were Apostle C. C. Rich, Elder Walter Gibson and myself. I crossed over to New York that night, and the remainder of our stay in the city was the guest of Bernard A. Schettler, who treated me very kindly. During the next few days we visited many factories, ships and places of interest, and wrote letters home. On the 4th, which was my thirty-second birthday anniversary, there was a grand celebration. The militia of New York City paraded, passing the George Washington monument in review. There was a grand fireworks display in the evening; and in the afternoon we witnessed the aeronaut, Mr. Wise, ascend out of sight with a balloon. On the 9th we sent to Washington for our passports. W. H. Dame and I were appointed on the 12th to take the money of our party, secure berths on the steamship Edinburgh, of the Blackball line between New York and Liverpool, and to purchase articles necessary for the journey across the Atlantic Ocean. We attended to this duty on the 13th. July 14th, our party, thirteen in number, went on board, and at 12 o\u0027clock noon, the vessel left the landing. We paid twenty-five dollars each for steerage passage. There were nearly three hundred passengers, and the berths were all taken up, so our lot was rather hard. Being very much crowded for room as well, it was plain that our part of the voyage was not to be very pleasant; but we were on board and had to make the best of it. By the 18th we were off the banks of Newfoundland, in a dense, damp fog, that obscured the sun and made it impossible to see more than a few rods from the ship. The steam siren kept up a constant whistling, to warn other vessels of our location and approach. The fog lasted till the 23rd, when it lighted up, but the weather was cloudy, with some rain. On the 24th a vessel bore in sight. Next day we had headwinds, and the sun shone for a short time. We came in sight of the southwest coast of Ireland, and at the cry of \"Land!\" every countenance brightened. All were on deck to catch a glimpse of the welcome scene. As this proceeding was going on, we heard the cry, \"Sail ho!\" and in a short time there came into full view a fleet of her majesty Queen Victoria\u0027s warships, eleven in number. They were steaming along the coast to the south and in advance of us. Suddenly they changed their course and came to meet us. When they drew near, their signal flags were hoisted on the masts, making a beautiful and imposing appearance. That night at 11 o\u0027clock we ran into Queenstown, the harbor of Cork, Ireland. There some passengers for Ireland, and mail were taken off, and we headed for the coast of England, coming in sight of Wales the next day. Early on the morning of the 27th we were on the muddy, dark waters of the Mersey, and soon landed in Liverpool, where the dank, smoky, mildewed walls looked to us as if they had stood for a thousand years. To our eyes the city had a very dismal and forbidding appearance. After the usual custom house inspection, we sent our baggage to the Latter-day Saints\u0027 office at 42 Islington, and walked there ourselves, a distance of a mile and a half. At the office we met Elder N. V. Jones and others, who received us very kindly. The following day we were appointed to our various missionary fields, J. C. Rich and I being assigned to Birmingham pastorate. That afternoon Elder Rich and I paid a visit to Birkenhead, across the river Mersey, and met with some of the Saints. Sunday, July 29th, we all attended meeting with the Liverpool Saints, in their assembly room on Great George\u0027s Street. Next day, Elder Rich and I took train for Birmingham, passing through a tunnel a mile and a half long on the route. Arriving at New Street station, Birmingham, we hailed a cab and were taken to No. 163 Burton Place, Spring Hill. There we had expected to find Elder Charles W. Penrose, but he was not at home. His sister-in-law met us, and seemed surprised at our call. I told her who we were, and we received a rather mistrustful invitation to come in; but after questioning us some she became satisfied of our identity, and provided us with something to eat. Later, F. G. Blake, who was traveling Elder in that place, came in, and we took a walk with him, meeting Elder Penrose. We all went to West Bromwich that evening, and heard one Mr. Bird, an old apostate from Utah, lecture against the Mormons. He was doing this for money, and the large hall was full of people. He made many false accusations against the Latter-day Saints, which were loudly applauded by his ignorant hearers. After the lecture we returned to Birmingham, and stayed all night at Elder Penrose\u0027s. To us, Birmingham seemed as dark, smokey and mildewed as did Liverpool; but it was well located. The place was one of the busiest manufacturing centers of the world. The railway lines passing through do not obstruct or occupy the streets; on one of the roads, which is built on a series of arches, the cars run level with the chimneys on three-story houses; and other roads pass beneath the city, running under large houses. The New Street station was one of the best and most commodious I have ever seen; indeed it is now one of the largest in the world, occupying eleven acres, with a fine iron and glass roof eleven hundred feet long. After visiting from house to house with the Saints on August 1st, we preached that evening in the Oxford Street Hall. Next day our visiting continued, and we found a dull spirit among the people. Trade was very bad, and the working people were extremely poor. Many of them were unable to give us a good meal of victuals unless they suffered themselves in consequence; yet they seemed very kind to us, but sluggish in spirit. That night we preached in Hockley Chapel, Farm Street. On the 3rd we visited the different markets in the city; on the 4th met Elders A. M. Lyman, C. C. Rich and N. V. Jones; and on the 5th were with the Saints in conference in the Odd Fellows\u0027 Hall, where large congregations assembled. The presidents of the branches in the Birmingham conference made favorable reports, and the Gospel was preached by Apostles Lyman and Rich and others of the Elders. That night J. C. Rich and I stayed at Brother Acock\u0027s. It did not seem possible to get the people into the notion of going to bed before midnight; that seeming to be the custom in the English cities. The Gillott steel and gold pen factory was the object of an interesting visit by J. C. Rich, F. G. Blake and myself on August 6th. We passed through the factory, and saw the work from rolling the large bars of steel down to finishing the pen ready for use; there were four hundred persons employed in the factory. That evening the Elders met in council, and J. C. Rich and I were appointed to labor in the Nottingham pastorate. Next day, in company with several others, I visited the grave of Elder James H. Flanagan, who died while on a mission; his body was interred in the old Birmingham cemetery. In the evening we had a pleasant sociable at the home of Brother Smith, and next day J. C. Rich and I took the train for Nottingham, where we were met at the station by Elder Edward Reid, president of the conference, and were conducted to No. 24 Promenade, Robinhood Street, where the wife of Elder David John had dinner waiting for us. We next went to Radcliffe Chapel, where we met with a goodly number of Saints, and preached to them. Elder David John presided over the Nottingham pastorate. The day after reaching the town I took a severe cold, and had to lay by the next day. We found Nottingham a very different place to Liverpool and Birmingham. The town and adjacent country were not so smoky and unhealthful. The town had about one hundred and eighty thousand inhabitants, and was the center of the silk and cotton lace and hosiery industries. On Sunday, August 12th, Elders A. M. Lyman and N. V. Jones (who had come from Liverpool) and I preached to the Saints; on the 13th J. C. Rich and I went to visit G. Wright, at the request of his niece who lived in Utah; his home was at Fisherton, on the river Trent, and after an unwelcome greeting there we returned to Nottingham. Next day we went to Mansfield with Elder James Payne, passing through the place where Robin Hood roamed. That evening we preached to the Saints, then spent the next two days preaching in different villages. At Pixton, on the 16th, we visited a coal pit. Leicester, the county seat of Leicestershire, and center of the boot and shoe trade, was our destination on August 19th. We preached there that night, and on Monday visited the museum. The rest of the week we spent in visiting and preaching in several villages, then returned to Nottingham. At Loughborough, on the 22nd, our meeting was disturbed by several rude young men, who laughed and asked questions in an offensive manner. A stone was hurled through the window at me, while I was preaching. It passed just in front of me, but no one was hit. The meeting was dismissed in confusion. On the 26th, we went to Derby for a couple of days. My health continued to be very poor during this period of my travels. Burton-on-Trent, a place noted for the brewing of malt liquors, was visited on the 28th, and that night I preached at Branston, then stayed at the house of a chimney-sweep named Doman. He had been in the Church nineteen years. Next day we preached in the pottery district, then returned to Derby, where, on the 31st, we went through Fox \u0026 Company\u0027s shot factory, going to the top of the tower, two hundred and twenty steps. That evening we went to a theatre. During the first part of September, I traveled and preached, visiting Nottingham, Derby, Belper and several adjacent villages. I attended the Derby races on the 6th; there were about twenty thousand people in attendance. On the 12th, I left Nottingham for London in company with Brothers J. C. Rich and Blackburn, and Sister Cook and daughter, going via the Midland railway. From St. Pancras station we went to Brother John Cook\u0027s, at No. 30 Florence Street, Cross Street, Islington, London, where I made my home during my stay in the metropolis. There we met with Elders John Brown, F. M. Lyman, and John Gleason. I remained in London and vicinity until October 3rd. During our stay at the national capital we visited many interesting places, among them being the tunnel under the Thames, which is reached by a flight of one hundred steps, is four hundred yards from end to end, and while we were passing through there were some fifteen to twenty ships lying above it, and steamboats passing over it up and down the river. We visited the British hospitals for invalided soldiers and sailors, and went from there to Greenwich, whence is measured longitude east and west, and where we also saw the standard weights and measures of Great Britain. The British Museum; the King\u0027s Library; Westminster Abbey, where Great Britain\u0027s rulers are anointed and crowned by the archbishops of the Church of England; the Parliament buildings, wherein are the House of Lords and House of Commons, with the throne and the woolsack; Buckingham Palace, the city residence of Queen Victoria; St. Paul\u0027s Cathedral, which was undergoing repairs; National Gallery; Cattle Market; Zoological Gardens, with the giraffe, the hippopotamus, the rhinoceros and all manner of beasts and birds; South Kensington Museum; Hyde Park; White Tower of London, where are the block and ax used in beheading Queen Anne Boleyn and Mary, Queen of Scots, also the royal regalia, and much other material of historic value; London Bridge, with its vast traffic; Crystal Palace with its tower four hundred and twelve steps to the top, from which can be seen six counties of England; Anatomical Museum; Madame Tussaud\u0027s Bazar; the Dockyards, and the rich residence portion of London, all were visited by us, and were very interesting and entertaining. On September 13th we attended a tea party of the Saints near King\u0027s Cross station. Several times I preached to congregations, both on the Surrey side of the Thames, and on the north side. On the 14th, Elders A. M. Lyman and N. V. Jones came from Scotland to London. I received a letter from home on the 25th, Tuesday, bringing the sad intelligence of the death of Deseret Ann, my second daughter, also of the birth to her mother, my wife Rebecca, of a daughter. I wrote an answer to that letter the same day. During the time I was in London I had a severe cold and my health was far from good. I returned to Nottingham on October 3rd, via the Great Northern railway, and resumed my missionary labors in that conference.","sourceLink":"http://novel.tingroom.com/jingdian/1757/51376.html","bookId":1127,"book":{"id":1127,"title":"Life of a Pioneer","description":"简介： THE life of a pioneer in Western America always is full of peril and hardship; often it has a large share of startling episodes and thrilling adventures; not infrequently it is associated with notable historic events; and the experiences met with dev...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1757","creation":"Aug 1, 2019 12:24:25 AM","modification":"Aug 1, 2019 12:24:25 AM"}}
