{"id":30258,"no":12,"title":"CHAPTER XI","content":"With my horse reduced to some show of order, but yet champing fretfully at his bit and throwing back his head in such manner as but for my quick avoidance had endangered the soundness of my own, I cantered gaily to that part where the exercising was, with head erect and a firm hold upon the great war-saddle that seemed no longer too vast to grip between the knees. There I perceived that Simon Emmet was at great pains to get the words of command and their significance not only into the heads of his troopers but also into that of Christopher Kidd, who there was sweating visibly in attempt at once to control a fresh horse he had gotten, and to repeat after Simon words of whose meaning he had less knowledge than the men that, for lack of a better, he was to command. At once and without a word I fell into line, and, after a few mistakes, very successfully put myself and Roan Charley through the simple evolution in progress. At first Simon did not mark me, being the more busied that the dulness of Kidd was much increased by his amazement at the sight of me. But when at length Simon saw the direction of his awkward pupil\u0027s regard, he as quickly perceived his new recruit. Giving the command to halt in his great voice of an old sergeant of horse, he walked up to me, saying, with a rough petulance: \"How now, young gentleman? What have you to do among these?\" Then, at the laugh with which I answered him, he drew near and understood. And mightily put about he was, and would have me at once return to the house. But, \"Tush, Simon!\" I said, smiling on him in the fashion I had used from a child when I would have my way rather than his, \"do I not do it all fit and properly? You are not to know who I am, but a young gentleman that would exercise with you.\" \"You must leave the ranks,\" said Simon, gruff but wavering. \"So I will indeed,\" I answered, \"if Mr. Kidd will but take my place.\" And this Christopher, ever ready for Prue\u0027s sake to pleasure me, very readily did, without more said; whereupon I took his place, and, before Simon had well lowered his brows of amazement, I was giving out in the greatest voice I could compass all the words of command I had spent my morning in learning from my window. The troop, falling in with the jest, acquitted themselves so well that Simon did not interfere; and I had halted them at length with intent to coax old Emmet to fetch my father, that he might see how good a man I was, when from round the corner where lay the front of the house there came a great and growing confusion of sound: the wheels of a coach, the hoofs of many horses, and a mixed murmur of voices. And then the great voice of my father rang out, at the sound of which all was hushed; wheels stopped, horses stood, and men held their breath. Bidding Simon keep his men as they were, I cantered round the southeast corner of the house, and, checking my horse, stood for some minutes unmarked in the confusion, to observe a scene not a little curious. The coach was my Lady Mary\u0027s, easily recognized in our parts for the newness of its fashion. By its side stood our friend and neighbor, Sir Giles Blundell, that instant dismounted, and opening the door that my lady might descend. Behind him were two young gentlemen, one of whom held Sir Giles\u0027s horse by the bridle. My lady, of a pallor very death-like, and stumbling as she stepped down from the coach so that she was like to have fallen but for the ready support of his hands, said a few words to Sir Giles, but all in a voice so low from weakness of fatigue and the faintness of terror as no word of it to reach my ears. His answer, however, was given clearly enough. And as he spoke my father, till now delayed in his descent of the steps by the lameness of his leg, drew near and stood beside my lady, leaning upon his stick. \"Indeed, dear madam,\" said Sir Giles, \"I will do no such thing. I and my friends here are vastly pleased we were in the way to rescue you from such evil hands; \u0027t was a small service we are proud to have rendered to so good a friend and neighbor. But to ride further to Royston Chase on the mere chance of some danger to His Highness of Orange, that has an army to protect him, is but to mix ourselves with a game we are well resolved to watch at a safe distance.\" \"Ah, Giles,\" says Sir Michael, who had known him from a boy, \"your father had been of one part or the other. What, in God\u0027s name, is coming to England, when Englishmen are found that cannot even take a side?\" Whereupon more words to little purpose ensued, Sir Giles and the two other gentlemen at length departing as they had come, after replying with much forbearance to some heated and scornful animadversions of my father upon the lukewarmness of their conduct. Gratitude for what these gentlemen had done in her behalf and the need of recovering her spirits from the great perturbation into which they had been thrown by the events of the morning kept my lady silent until their departure was accomplished, when she turned to Sir Michael with a great beseeching in her countenance, saying: \"Surely you will help me, my old friend.\" On which he gave her assurance he would do all he might, but told her he was yet ignorant what was her trouble and need. And it is great wonder to me that all the time she was telling and he hearing her story neither did observe me sitting there on my horse, and but partly hidden from their eyes by the branches of a tree. But her eagerness was well equalled by his interest; and there was a great bustling of our hostlers and her two servants about the coach. For one of the horses had fallen when brought to a stand, and lay, it seemed, at the point of death, two more being in a very bad case. In brief, the tale she told him, of which I heard near every word, was this: that one had come at six o\u0027clock of that morning with a letter from her son, announcing a visit, as she interpreted its terms, from His Highness of Orange; that by nine she was well advanced with her preparation for his fit reception, when all was thrown into confusion by the sudden arrival and enforced entry of a strange and ill-assorted body of men, acting, with a silent obedience truly wonderful to see in so unlikely a comradeship, under the orders of a little fat man with a dark face and red hair. This fellow, after he had compelled her with the threat of death and a pistol at her head to write that letter to her son which I have already mentioned, did force her, with her maid and one man-servant, into the coach which the other was to drive, a ruffian of decent mien being seated beside him with a loaded pistol to quicken his obedience and despatch. One other, in like manner persuasive, was in the coach, while Red-head and a fourth with a led horse rode beside. This party, in the endeavor to reach Salisbury, but much delayed by the devices of my lady\u0027s coachman, after escaping the pursuit of Farmer Kidd, had fallen the more easily before the gallant assault of Sir Giles Blundell and his friends that they were weakened by the absence of their leader; he having, as I believe (though this came not in Lady Mary\u0027s narrative), lost his way in drawing off Christopher\u0027s attack, and, being minded from the first to return before the end to Royston Chase, and falling in with my brother Philip, was glad enough to enforce his attendance as a guide, if not also to vent an old spleen by making of him an unwilling accomplice in his wicked purpose. Of the three villains left with the coach, one was slain in the rescue and the other two escaped on their horses. My lady ended her tale by telling her fear that the life of His Highness was aimed at, and imploring Sir Michael with tears that he should at once send his men (for Simon had by this brought his troops in very fair order round into the drive) for the warning and defence of His Highness; adding most piteously that her fear was no less for the honor of her son and his father\u0027s house than for the life of the Prince. \"Ay, madam,\" says my father; \"but since there is none to lead them, and they are like a flock of sheep lacking a shepherd, they must wait the time of writing a letter.\" \"Write! write!\" cried her ladyship, wringing her hands, \"write! while even now it is perhaps too late!\" \"I would I had one left of them all,\" said Sir Michael, with a groan; \"or anybody with a head-piece on a sound body. You see what I am, and Simon is well-nigh a cripple these three years.\" And with that I cantered up to them; and, bringing suddenly my horse to a stand, and saluting very finely, more militari—\"I will go, sir,\" I cried. \"Who \u0027s here?\" cries my father, and \"Mercy on us!\" says my lady, like any milkmaid, in one breath with him. \"Who but your son Philip?\" I answered, laughing gaily, and, I think, blushing a little, as well indeed I might. \"And your son Philip is the best horseman in the country; your son Philip bestrides the best nag in three; and your son Philip knows the crow\u0027s-road to Royston, while it is of common knowledge that he has a very pretty head-piece on his shoulders.\" My father being past speaking for amazement, my lady breaks in with: \"Thou \u0027rt a brave girl, but why this masquerade, dear child?\" \"To convince Sir Michael Drayton,\" I pertly replied, \"that there is some use even in daughters, when they can hold a sword and sit in a war-saddle of Prince Rupert\u0027s time.\" Sir Michael here made to seize my bridle, but Roan Charley had caught excitement from my voice, and a little slacking of his rein with a pressure of the knee at once put him at the distance of three great bounds from any detaining hand. \"Come back, Philippa!\" cries my father. \"Not so, dear sir,\" said I, turning in the saddle, \"for I shall go, an you will allow it.\" \"The roads and fields are not safe for thee, child,\" said he, \"with so many bad men about, and an army close to hand, else were I willing enough.\" \"Then let these men follow me,\" I cried. \"Simon will tell you, dear sir, that I can give and take the word of command. Christopher has no wit to handle them. Send the six best mounted, and let them come up with me if they can, and I will give Roan Charley to him that reaches Royston neck and neck with me.\" And if they answered me again I heard it not, for Charley was away, taking in his stride the fence of the paddock that lies behind the stable; and although that way did mean a leap-out at a point where the fence was high, with the ground falling sharply on the other side, we did the second jump as well as we had done the first, and so gained three hundred yards on the pursuing troop, whom I already heard pounding after me with many a hearty cry and much rattling of harness. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3281/89805.html","bookId":496,"book":{"id":496,"title":"The Sword of the King","description":"简介： It is matter of no small difficulty and hesitation for a woman to tell a storyin especial, her own storyfrom the beginning of it even to the end, and to hold, as it were, a straight course throughout. The perplexities, I say, are many, and among them...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3281","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
