{"id":102392,"no":33,"title":"Page 33","content":"Maybe some other fiend could have loved it; some twisted and conscienceless immortal could have sneered at her visions, yet slipped into the robes of a god as easily as I had slipped into that perfumed bath.\n But nothing could give me that freedom, nothing. Her permissions meant nothing; her power finally was but another degree of what we all possessed. And what we all possessed had never made the struggle simple; it had made it agony, no matter how often we won or lost.\n It couldn\u0027t happen, the subjugation of a century to one will; the design had to be foiled somehow, and if I just maintained my calm, I\u0027d find the key.\n Yet mortals had inflicted such horrors upon others; barbarian hordes had scarred whole continents, destroying everything in their path. Was she merely human in her delusions of conquest and domination? Didn\u0027t matter. She had inhuman means to see her dreams made real!\n I would start weeping again if I didn\u0027t stop reaching now for the solution; and these poor tender creatures around me would be even more damaged and confused than before.\n When I lifted my hands to my face, they didn\u0027t move away from me. They were brushing my hair. Chills ran down my back. And the soft thud of the blood in their veins was deafening suddenly.\n I told them I wanted to be alone. I couldn\u0027t endure the temptation any longer. And I could have sworn they knew what I wanted. Knew it, and were yielding to it. Dark salty flesh so close to me. Too much temptation. Whatever the case, they obeyed instantly, and a little fearfully. They left the room in silence, backing away as if it weren\u0027t proper to simply walk out.\n I looked at the face of the watch. I thought it was pretty funny, me wearing this watch that told the time. And it made me angry suddenly. And then the watch broke! The glass shattered; everything flew out of the ruptured silver case. The strap broke and the thing fell off my wrist onto the floor. Tiny glittering wheels disappeared into the carpet.\n \"Good God!\" I whispered. Yet why not?-if I could rupture an artery or a heart. But the point was to control this thing, to direct it, not let it escape like that.\n I looked up and chose at random a small mirror, one standing on the dresser in a silver frame. 1 thought Break and it exploded into gleaming fragments. In the hollow stillness I could hear the pieces as they struck the walls and the dresser top.\n Well, that was useful, a hell of a lot more useful than being able to kill people. I stared at the telephone on the edge of the dresser. I concentrated, let the power collect, then consciously subdued it and directed it to push the phone slowly across the glass that covered the marble. Yes. AH right. The little bottles tumbled and fell as it was pushed into them. Then I stopped them; 1 couldn\u0027t right them however. I couldn\u0027t pick them up. Oh, but wait, yes I could. I imagined a hand righting them. And certainly the power wasn\u0027t literally obeying this image; but I was using it to organize the power. I righted all the little bottles. I retrieved the one which had fallen and put it back in place.\n I was trembling just a little. 1 sat on the bed to think this over, but I was too curious to think. The important thing to realize was this: it was physical; it was energy. And it was no more than an extension of powers I\u0027d possessed before. For example, even in the beginning, in the first few weeks after Magnus had made me, I\u0027d managed once to move another-my beloved Nicolas with whom I\u0027d been arguing-across a room as if I\u0027d struck him with an invisible fist. I\u0027d been in a rage then; I hadn\u0027t been able to duplicate the little trick later. But it was the same power; the same verifiable and measurable trait.\n \"You are no god,\" I said. But this increase of power, this new dimension, as they say so aptly in this century.... Hmmmm.... Looking up at the ceiling, I decided I wanted to rise slowly and touch it, run my hands over the plaster frieze that ran around the cord of the chandelier. I felt a queasiness; and then I realized 1 was floating just beneath the ceiling. And my hand, why, it looked like my hand was going through the plaster. I lowered myself a little and looked down at the room.\n Dear God, I\u0027d done this without taking my body with me! I was still sitting there, on the side of the bed. I was staring at myself, at the top of my own head. I-my body at any rate-sat there motionless, dreamlike, staring. Back, And I was there again, thank God, and my body was all right, and then looking up at the ceiling, I tried to figure what this was all about. Well, I knew what it was all about, too. Akasha herself had told me how her spirit could travel out of her body. And mortals had always done such things, or so they claimed. Mortals had written of such invisible travel from the most ancient times.\n I had almost done it when I tried to see into Azim\u0027s temple, gone there to see, and she had stopped me because when I left my body, my body had started to fall. And long before that, there had been a couple of other times.... But in general, I\u0027d never believed all the mortal stories.\n Now I knew I could do this as well. But I certainly didn\u0027t want to do it by accident. I made the decision to move to the ceiling again but this time with my body, and it was accomplished at once! We were there together, pushing against the plaster and this time my hand didn\u0027t go through. All right.\n I went back down and decided to try the other again. Now only in spirit. The queasy feeling came, I took a glance down at my body, and then I was rising right through the roof of the palazzo. I was traveling out over the sea- Yet things looked unaccountably different; I wasn\u0027t sure this was the literal sky or the literal sea. It was more like a hazy conception of both, and I didn\u0027t like this, not one bit. No, thank you. Going home now! Or should I bring my body to me? I tried, but absolutely nothing happened, and that didn\u0027t surprise me actually. This was some kind of hallucination. I hadn\u0027t reaily left my body, and ought to just accept that fact.\n And Baby Jenks, what about the beautiful things Baby Jenks had seen when she went up? Had they been hallucinations? I would never know, would I?\n Back!\n Sitting. Side of the bed. Comfortable. The room. I got up and walked around for a few minutes, merely looking at the flowers, and the odd way the white petals caught the lamplight and how dark the reds looked; and how the golden light was caught on the surfaces of the mirrors, all the other lovely things.\n It was overwhelming suddenly, the pure detail surrounding me; the extraordinary complexity of a single room.\n Then I practically fell into the chair by the bed. I lay back against the velvet, and listened to my heart pounding. Being invisible, leaving my body, I hated it! I wasn\u0027t going to do it again!\n Then I heard laughter, faint, gentle laughter. I realized Akasha was there, somewhere behind me, near the dresser perhaps.\n There was a sudden surge in me of gladness to hear her voice, to feel her presence. In fact I was surprised at how strong these sensations were. I wanted to see her but I didn\u0027t move just yet.\n \"This traveling without your body-it\u0027s a power you share with mortals,\" she said. \"They do this little trick of traveling out of their bodies all the time.\"\n \"I know,\" I said dismally. \"They can have it. If I can fly with my body, that\u0027s what 1 intend to do.\"\n She laughed again; soft, caressing laughter that I\u0027d heard in my dreams.\n \"In olden times,\" she said, \"men went to the temple to do this; they drank the potions given them by the priests; it was in traveling the heavens that men faced the great mysteries of life and death.\"\n \"I know,\" I said again. \"I always thought they were drunk or stoned out of their minds as one says today.\"\n \"You\u0027re a lesson in brutality,\" she whispered. \"Your responses to things are so swift.\"\n \"That\u0027s brutal?\" I asked. I caught a whiff again of the fires burning on the island. Sickening. Dear God. And we talk here as if this isn\u0027t happening, as if we hadn\u0027t penetrated their world with these horrors. . . .\n \"And flying with your body does not frighten you?\" she asked.\n \"It all frightens me, you know that,\" I said. \"When do I discover the limits? Can I sit here and bring death to mortals who are miles away?\"\n \"No,\" she said. \"You\u0027ll discover the limits rather sooner than you think. It\u0027s like every other mystery. There really is no mystery.\"\n I laughed. For a split second I heard the voices again, the tide rising, and then it faded into a truly audible sound-cries on the wind, cries coming from villages on the island. They had burned the little museum with the ancient Greek statues in it; and with the icons and the Byzantine paintings.\n All that art going up in smoke. Life going up in smoke.\n I had to see her suddenly. I couldn\u0027t find her in the mirrors, the way they were. I got up.\n She was standing at the dresser; and she too had changed her garments, and the style of her hair. Even more purely lovely, yet timeless as before. She held a small hand mirror, and she was looking at herself in it; but it seemed she was not really looking at anything; she was listening to the voices; and I could hear them again too. A shiver went through me; she resembled her old self, the frozen self sitting in the shrine.\n Then she appeared to wake; to look into the mirror again, and then at me as she put the mirror aside.\n Her hair had been loosened; all those plaits gone. And now the rippling black waves came down free over her shoulders, heavy, glossy, and inviting to kiss. The dress was similar to the old one, as if the women had made it for her out of dark magenta silk that she had found here. It gave a faint rosy blush to her cheeks, and to her breasts which were only half covered by the loose folds that went up over her shoulders, gathered there by tiny gold clasps.\n The necklaces she wore were all modern jewelry, but the profusion made them look archaic, pearls and gold chains and opals and even rubies.\n Against the luster of her skin, all this ornament appeared somehow unreal! It was caught up in the overall gloss of her person; it was like the light in her eyes, or the luster of her lips.\n She was something fit for the most lavish palace of the imagination; something both sensuous and divine. I wanted her blood again, the blood without fragrance and without killing. I wanted to go to her and lift my hand and touch the skin which seemed absolutely impenetrable but which would break suddenly like the most fragile crust.\n \"All the men on the island are dead, aren\u0027t they?\" I asked. I shocked myself.\n \"All but ten. There were seven hundred people on this island. Seven have been chosen to live.\"\n \"And the other three?\"\n \"They are for you.\"\n I stared at her. For me? The desire for blood shifted a little, revised itself, included her and human blood-the hot, bubbling, fragrant kind, the kind that- But there was no physical need. I could still call it thirst, technically, but it was actually worse.\n \"You don\u0027t want them?\" she said, mockingly, smiling at me. \"My reluctant god, who shrinks from his duty? You know all those years, when I listened to you, long before you made songs to me, I loved it that you took only the hard ones, the young men. I loved it that you hunted thieves and killers; that you liked to swallow their evil whole. Where\u0027s your courage now? Your impulsiveness? Your willingness to plunge, as it were?\"\n \"Are they evil?\" I said. \"These victims who are waiting for me?\"\n She narrowed her eyes for a momennt. \"Is it cowardice finally?\" she asked. \"Does the grandeur of the plan frighten? For surely the killing means little.\"\n \"Oh, but you\u0027re wrong,\" I said. \"The killing always means something. But yes, the grandeur of the plan terrifies me. The chaos, the total loss of all moral equilibrium, it means everything. But that\u0027s not cowardice, is it?\" How calm I sounded. How sure of myself. It wasn\u0027t the truth, but she knew it,\n \"Let me release you from all obligation to resist,\" she said. \"You cannot stop me. I love you, as I told you. I love to look at you. It fills me with happiness. But you can\u0027t influence me. Such an idea is absurd.\"\n We stared at each other in silence. I was trying to find words to tell myself how lovely she was, how like the old Egyptian paintings of princesses with shining tresses whose names are now forever lost. I was trying to understand why my heart hurt even looking at her; and yet I didn\u0027t care that she was beautiful; I cared about what we said to each other.\n \"Why have you chosen this way?\" I asked. \"You know why,\" she said with a patient smile. \"It is the best way. It is the only way; it is the clear vision after centuries of searching for a solution.\"\n \"But that can\u0027t be the truth, I can\u0027t believe it.\" \"Of course it can. Do you think this is impulse with me? I don\u0027t make my decisions as you do, my prince. Your youthful exuberance is something I treasure, but such small possibilities are long gone for me, You think in terms of lifetimes; in terms of small accomplishments and human pleasures. I have thought out for thousands of years my designs for the world that is now mine. And the evidence is overwhelming that I must proceed as I have done. I cannot turn this earth into a garden, I cannot create the Eden of human imagination-unless I eliminate the males almost completely.\"\n \"And by this you mean kill forty percent of the population of the earth? Ninety percent of all males?\"\n \"Do you deny that this will put an end to war, to rape, to violence?\"\n \"But the point . . .\"\n \"No, answer my question. Do you deny that it will put an end to war, to rape, and to violence?\" \"Killing everyone would put an end to those things!\" \"Don\u0027t play games with me. Answer my question.\"\n \"Isn\u0027t that a game? The price is unacceptable. It\u0027s madness; it\u0027s mass murder; it\u0027s against nature.\"\n \"Quiet yourself- None of what you say is true. What is natural is simply what has been done. And don\u0027t you think the peoples of this earth have limited in the past their female children? Don\u0027t you think they have killed them by the millions, because they wanted only male children so that those children could go to war? Oh, you cannot imagine the extent to which such things have been done.\n \"And so now they will choose female over male and there will be no war. And what of the other crimes committed by men against women? If there were any nation on earth which had committed such crimes against another nation, would it not be marked for extermination? And yet nightly, daily, throughout this earth these crimes are perpetrated without end.\"\n \"All right, that\u0027s true. Undoubtedly that\u0027s true. But is your solution any better? It\u0027s unspeakable, the slaughter of all things male. Surely if you want to rule-\" But even this to me was unthinkable. I thought of Marius\u0027s old words, spoken long ago to me when we existed still in the age of powdered wigs and satin slippers-that the old religion, Christianity, was dying, and maybe no new religion would rise:\n \"Maybe something more wonderful will take place,\" Marius had said, \"the world will truly move forward, past all gods and goddesses, past all devils and angels . . .\"\n Wasn\u0027t that the destiny of this world, really? The destiny to which it was moving without our intervention?\n \"Ah, you are a dreamer, my beautiful one,\" she said harshly. \"How you pick and choose your illusions! Look to the eastern countries, where the desert tribes, now rich on the oil they have pulled up from beneath the sands, kill each other by the thousands in the name of Allah, their god! Religion is not dead on this earth; it never will be. You and Marius, what chess players you are; your ideas are nothing but chess pieces. And you cannot see beyond the board on which you place them in this or that pattern as suits your small ethical souls.\"\n \"You\u0027re wrong,\" I said angrily. \"Not about us perhaps. We don\u0027t matter. You\u0027re wrong in all this that you\u0027ve begun. You\u0027re wrong.\"\n \"No, I am not wrong,\" she said. \"And there is no one who can stop me, male or female. And we shall see for the first time since man lifted the club to strike down his brother, the world that women would make and what women have to teach men. And only when men can be taught, will they be allowed to run free among women again!\"\n \"There must be some other way! Ye gods, I\u0027m a flawed thing, a weak thing, a thing no better than most of the men who\u0027ve ever lived. I can\u0027t argue for their lives now. I couldn\u0027t defend my own. But, Akasha, for the love of all things living, I\u0027m begging you to turn away from this, this wholesale murder-\"\n \"You speak to me of murder? Tell me the value of one human life, Lestat. Is it not infinite? And how many have you sent to the grave? We have blood on our hands, all of us, just as we have it in our veins.\"\n \"Yes, exactly. And we are not all wise and all knowing. I\u0027m begging you to stop, to consider . . . Akasha, surely Marius-\" \"Marius!\" Softly she laughed. \"What did Marius teach you? What did he give you? Really give you!\"\n I didn\u0027t answer. I couldn\u0027t. And her beauty was confusing me! So confusing to see the roundness of her arms; the tiny dimple in her cheek.\n \"My darling,\" she said, her face suddenly tender and soft as her voice was. \"Bring to mind your vision of the Savage Garden, in which aesthetic principles are the only enduring principles-the laws that govern the evolution of all things large and small, of colors and patterns in glorious profusion, and beauty! Beauty everywhere one looks. That is nature. And death is everywhere in it.\n \"And what I shall make is Eden, the Eden all long for, and it shall be better than nature! It shall take things a step further; and the utter abusive and amoral violence of nature shall be redeemed. Don\u0027t you understand that men will never do more than dream of peace? But women can realize that dream? My vision is amplified in the heart of every woman. But it cannot survive the heat of male violence! And that heat is so terrible that the earth itself may not survive.\"\n \"What if there\u0027s something you don\u0027t understand,\" I said. I was struggling, grasping for the words. \"Suppose the duality of masculine and feminine is indispensable to the human animal. Suppose the women want the men; suppose they rise against you and seek to protect the men. The world is not this little brutal island! All women are not peasants blinded by visions!\"\n \"Do you think men are what women want?\" she asked. She drew closer, her face changing imperceptibly in the play of the light. \"Is that what you\u0027re saying? If it is so, then we shall spare a few more of the men, and keep them where they may be looked at as the women looked at you, and touched as the women touched you. We\u0027ll keep them where the women may have them when they want them, and I assure you they shall not be used as women have been used by men.\"\n I sighed. It was useless to argue. She was absolutely right and absolutely wrong.\n \"You do yourself an injustice,\" she said. \"I know\u0027your arguments. For centuries I have pondered them, as I\u0027ve pondered so many questions. You think I do what I do with human limitations. I do not. To understand me, you must think in terms of abilities yet unimagined. Sooner will you understand the mystery of splitting atoms or of black holes in space.\"\n \"There has to be a way without death. There has to be a way that triumphs over death.\"\n \"Now that, my beauty, is truly against nature,\" she said. \"Even I cannot put an end to death.\" She paused; she seemed suddenly distracted; or rather deeply distressed by the words she\u0027d just spoken. \"An end to death,\" she whispered. It seemed some personal sorrow had intruded on her thoughts. \"An end to death,\" she said again. But she was drifting away from me. I watched her close her eyes, and lift her fingers to her temples.\n She was hearing the voices again; letting them come. Or maybe even unable to stop them for a moment. She said some words in an ancient tongue, and I didn\u0027t understand them. I was struck by her sudden seeming vulnerability, the way the voices seemed to be cutting her off; the way her eyes appeared to search the room and then to fix on me and brighten.\n I was speechless and overwhelmed with sadness. How small had my visions of power always been! To vanquish a mere handful of enemies, to be seen and ioved by mortals as an image; to find some place in the great drama of things which was infinitely larger than I was, a drama whose study could occupy the mind of one being for a thousand years. And we stood outside time suddenly; outside of justice; capable of collapsing whole systems of thought. Or was it just an illusion? How many others had reached for such power, in one form or another?\n \"They were not immortals, my beloved.\" It was almost an entreaty.\n \"But it\u0027s an accident that we are,\" I said. \"We\u0027re things that never should have come into existence.\" .\n \"Don\u0027t speak those words!\"\n \"I can\u0027t help it.\"\n \"It doesn\u0027t matter now. You fail to grasp how little anything matters. I give you no sublime reason for what I do because the reasons are simple and practical; how we came into being is irrelevant. What matters is that we have survived. Don\u0027t you see? That is the utter beauty of it, the beauty out of which all other beauties will be born, that we have survived.\"\n I shook my head. I was in a panic. I saw again the museum that the villagers on this island had only just burnt. I saw the statues blackened and lying on the floor. An appalling sense of loss engulfed me.\n \"History does not matter,\" she said. \"Art does not matter; these things imply continuities which in fact do not exist. They cater to our need for pattern, our hunger for meaning. But they cheat us in the end. We must make the meaning.\"\n I turned my back. I didn\u0027t want to be drugged by her resolution or her beauty; by the glimmer of light in her jet black eyes. I felt her hands on my shoulders; her lips against my neck.\n \"When the years have passed,\" she said, \"when my garden has bloomed through many summers and gone to sleep through many winters; when the old ways of rape and war are nothing but memory, and women watch the old films in mystification that such things could ever have been done; when the ways of women are inculcated into every member of the population, naturally, as aggression is now inculcated, then perhaps the males can return. Slowly, their numbers can be increased. Children will be reared in an atmosphere where rape is unthinkable, where war is unimaginable. And then . . - then . . . there can be men. When the world is ready for them.\" \"It won\u0027t work. It can\u0027t work.\"\n \"Why do you say so? Let us look to nature, as you wanted to do only moments ago. Go out in the lush garden that surrounds this villa; study the bees in their hives and the ants who labor as they have always done. They are female, my prince, by the millions. A male is only an aberration and a matter of function. They learned the wise trick a long time before me of limiting the males. \"And we may now live in an age where males are utterly unnecessary. Tell me, my prince, what is the primary use of men now, if it is not to protect women from other men?\"\n \"What is it that makes you want me here!\" I said desperately. I turned around to face her again. \"Why have you chosen me as your consort! For the love of heaven, why don\u0027t you kill me with the other men! Choose some other immortal, some ancient being who hungers for such power! There must be one. I don\u0027t want to rule the world! I don\u0027t want to rule anything! 1 never did.\"\n Her face changed just a little. It seemed there was a faint, evanescent sadness in her that made her eyes even deeper in their darkness for an instant. Her lip quivered as if she wanted to say something but couldn\u0027t. Then she did answer.\n \"Lestat, if all the world were destroyed, I would not destroy you,\" she said. \"Your limitations are as radiant as your virtues for reasons I don\u0027t understand myself. But more truly perhaps, I love you because you are so perfectly what is wrong with all things male. Aggressive, full of hate and recklessness, and endlessly eloquent excuses for violence-you are the essence of masculinity; and there is a gorgeous quality to such purity. But only because it can now be controlled.\"\n \"By you.\"\n \"Yes, my darling. This is what I was born for. This is why I am here. And it does not matter if no one ratifies my purpose. I shall make it so. Right now the world burns with masculine fire; it is a conflagration. But when that is corrected, your fire shall burn ever more brightly-as a torch burns.\"\n \"Akasha, you prove my point! Don\u0027t you think the souls of women crave that very fire? My God, would you tamper with the stars themselves?\"\n \"Yes, the soul craves it. But to see it in the blaze of a torch as I have indicated, or in the flame of a candle. But not as it rages now through every forest and over every mountain and in every glen. There is no woman alive who has ever wanted to be burnt by it! They want the light, my beauty, the light! And the warmth! But not the destruction. How could they? They are only women. They are not mad.\"\n \"All right. Say you accomplish your purpose. That you begin this revolution and it sweeps the world-and mind you I don\u0027t think such a thing will happen! But if you do, is there nothing under heaven that will demand atonement for the death of so many millions? If there are no gods or goddesses, is there not some way in which humans themselves-and you and I-shall be made to pay?\"\n \"It is the gateway to innocence and so it shall be remembered. And never again will the male population be allowed to increase to such proportions, for who would want such horrors again?\"\n \"Force the men to obey you. Dazzle them as you\u0027ve dazzled the women, as you\u0027ve dazzled me.\" \n","sourceLink":"https://allnovel.net/the-queen-of-the-damned-the-vampire-chronicles-3/page-33.html","bookId":2211,"book":{"id":2211,"title":"The Queen Of The Damned (The Vampire Chronicles #3)","description":"Storyline: \n The Queen of the Damned (The Vampire Chronicles #3) \n The Queen of the Damned is the third novel of Anne Rice\u0027s The Vampire Chronicles series. It follows Interview with the Vampire and The Vampire Lestat. This novel is a continuation of the story that ends in a cliffhanger in The Vampire Lestat and explores the rich history and mythology of the origin of the vampires, which dates back to Ancient Egypt.\n \n","cover":"https://allnovel.net/images/the-queen-of-the-damned-the-vampire-chronicles-3.jpg","author":"Anne Rice","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-queen-of-the-damned-the-vampire-chronicles-3.html","creation":"Oct 5, 2019 8:58:27 AM","modification":"Oct 5, 2019 10:15:00 PM"}}
