{"id":18665,"no":1,"title":"PREFACE TO THE ORIGINAL EDITION","content":"In the following story I have made no attempt to give anything like a general history of the long struggle between the brave tribes of New Zealand and the forces of England and the colony. That struggle lasted over a period of some years, and to do justice to its numerous incidents in the course of a single volume would have left no space whatever available for the telling of a story. It was divided into two distinct epochs. In the first the natives of the north of the islands fought for their independence and their right to have a king, and be governed by their own laws. Nothing could exceed the courage with which they struggled for these ends, and it needed a very strong force of British troops to storm their pahs or fortified camps, and overcome their resistance. The second epoch embraces the struggle brought about by the conversion of a portion of the tribes to the fanatical belief called the Pai Marire (literally \"good and peaceful\"), whose votaries were generally known as the Hau-Haus. During the earlier war the natives behaved with great moderation, and there were but few cases of the murder of outlying settlers. The slaying of all whites was, however, the leading feature of the Hau-Hau religion, and many cold-blooded massacres occurred during the struggle. The British troops had been for the most part withdrawn before the commencement of the Hau-Hau troubles, and the war was carried on by bodies of constabulary raised by the colonists, and with the aid of tribes that remained friendly to us. The massacre of Poverty Bay, which forms the leading feature of my story, and the events that followed it, are all strictly in accordance with facts. G.A. HENTY \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3165/86838.html","bookId":869,"book":{"id":869,"title":"Maori and Settler","description":"简介： WELL, mother, one thing is certainsomething has got to be done. It is no use crying over spilt milk, that I can see. It is a horribly bad business, but grieving over it won\u0027t make it any better. What one has got to do is to decide on some plan or oth...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3165","creation":"Aug 1, 2019 12:23:39 AM","modification":"Aug 1, 2019 12:23:39 AM"}}
