{"id":18679,"no":15,"title":"CHAPTER XIV. FRESH TROUBLES.","content":"Three days later a small steamer arrived from Napier, bringing a reply to the urgent request that had been sent for the despatch of a body of constabulary for the protection of the settlers. Sir Donald M\u0027Lean, the superintendent of the province, sent word that this was impossible at present, as the alarming news had just been received that the notorious chief Te Kooti, who had been captured and imprisoned at Chatham Island, had effected his escape with the whole of the natives confined in the island, had captured a schooner, and had, it was reported, landed near Poverty Bay. \"It is probable,\" Sir Donald wrote, \"that it is the news of his landing which has excited one of the tribes of the neighbourhood to make an attack upon you. A strong expedition will be fitted out, and we shall doubtless have to supply a contingent. I can only advise you to organize yourselves into a militia, and to stand for the present on the defensive. As soon as operations begin from Poverty Bay you will be relieved[Pg 264] from all further danger, as the attention of the hostile tribes will be fully occupied in that direction.\" Hitherto the province of Hawke Bay had been comparatively free from the troubles that had so long disturbed Auckland, Taranaki, and the northern portion of Wellington. Only one rising had taken place, and this had been so promptly crushed that the tribes had since remained perfectly quiet. In October 1866 a party of a hundred fighting men had suddenly appeared near the Meanee village. Their principal chief had hitherto borne a very high character, and had been employed by the government to improve the mail road between Napier and Taupo. Colonel Whitmore, who was in command of the colonial forces—for the regular troops had now been almost entirely withdrawn from the island—had just returned from punishing some natives who had committed massacres higher up on the coast, and was, fortunately, at Napier; he at once despatched a company of colonists under Major Fraser, with thirty or forty friendly natives, to hold the natives in check. Just as they had been sent off the news came that another and more numerous body of Hau-Haus were advancing by way of Petane to attack Napier. Major Fraser and his company were sent off to check these, while Colonel Whitmore, with one hundred and eighty of the colonial militia, marched against the smaller force, and M\u0027Lean, with two hundred friendly natives, established himself in the rear of the village they occupied. An officer was sent in to summon them to surrender, and as no answer could be obtained from them the colonists advanced. The enemy fought with[Pg 265] resolution, but the colonists opened a cross-fire upon them, and after fighting for some time the natives were driven out of their cover. Finding no mode of retreat open to them they laid down their arms, some who endeavoured to escape being cut off and also captured. The native loss was twenty-three killed and twenty-eight wounded—many of them mortally; forty-four taken prisoners. Only two or three of the whole party escaped. Upon the same day Major Fraser\u0027s little force attacked the other party of Hau-Haus, killed their chief with twelve of his followers, and put the rest to flight. From that time peace had been unbroken in Hawke Bay; but there had been several outbreaks at Poverty Bay, which lay just north of the province, and massacres at Opotaki and other places further to the north, and almost continuous fighting in the northern districts of Wellington. The news of Te Kooti\u0027s escape and of his landing at Poverty Bay naturally caused considerable alarm among the settlers, but hopes were entertained that the whites at Poverty Bay, aided by the friendly natives, would be able to recapture Te Kooti and his followers before they could do any harm. The next day a small vessel came down from Poverty Bay with a message from Major Biggs, who commanded at that settlement, to ask for assistance if it could be spared him. A consultation was held and it was agreed that the best plan of defending their own settlement was to aid in the recapture of Te Kooti, and that the little force of twenty men should at once go up to aid the settlers under Major Biggs. Accordingly they embarked without delay, Mr. Ather[Pg 266]ton making a separate bargain with the captain of the craft for his passage, and the next morning they arrived in Poverty Bay. Major Biggs had, as soon as the news reached him, raised a force of a hundred Europeans and natives. He found Te Kooti\u0027s party, a hundred and ninety strong, holding a very strong position near the sea, and sent a chief to them to say that if they would lay down their arms he would try and smooth matters over with government. A defiant answer was returned, and Major Biggs gave orders to commence the attack. But the natives, who formed the bulk of his force, refused to move, saying that the Hau-Haus were too numerous and too strongly posted. Under these circumstances an attack was impossible, for had the little body of whites been defeated the whole settlement would have been open to ravage and destruction. During the night Te Kooti and his men started for the interior, carrying with them all the stores and provisions they had taken from the schooner. When it was found they had escaped Major Biggs ordered Mr. Skipwith to follow with some friendly natives, pressing on their rear until he ascertained their line of retreat, when he was to cut across country and join the main body who were to march to Paparatu, a point which Te Kooti would in all probability pass in his retreat. The arrival of the coaster with the little band from the Mohaka River was hailed with joy by the Poverty Bay settlers. They arrived just in time to join Major Biggs, and raised his force to fifty white men, who, with thirty Maoris, started for Paparatu and arrived there on the following morning.[Pg 267] The Europeans were commanded by Captains Westrupp and Wilson. In the afternoon Mr. Atherton arrived with a party of four natives whom he had hired to carry his store of provisions, ammunition, and baggage. \"So I am in plenty of time,\" he said when he came up. \"I could not bring myself to undertake a night march, but as those fellows have got to lug all the stores they have captured over the mountains I felt pretty sure that I should be in time.\" \"I am glad you are in time, Mr. Atherton,\" Wilfrid said. \"The assistance of your rifle is not to be despised. The sooner the natives come now the better, for we have only brought four days\u0027 provisions in our haversacks. I hear that a reserve force is to come up in two days with rations and ammunition; but one can never calculate upon these natives.\" The camp was pitched in a hollow to avoid the observation of the enemy, but it was proposed to fight at a point a mile distant, in a position commanding the spur of the hill, up which the natives must advance after crossing a ford on the Arai River. Four days passed and there was no news of the convoy with the provisions, and the supply in camp was almost exhausted. That evening Major Biggs started to bring up the supplies with all speed, as otherwise starvation would compel the force to retreat. The same day Mr. Skipwith had arrived with news that Te Kooti was undoubtedly marching on Paparatu, but was making slow progress owing to the heavy loads his men were carrying. The fifth day passed slowly. The men being altogether without food Mr. Atherton divided his small[Pg 268] stock of provisions and wine among them, and then taking his rifle went out among the hills, accompanied by two of his natives. Late in the evening he returned, the natives bearing an old boar which he had shot. This was a great piece of luck, for the island contained no wild animals fit for eating, and the boar had probably escaped from some settler\u0027s farm or native clearing when young and taken to the woods. It was at once cut up and divided among the hungry men. The next day Mr. Skipwith, with two natives, went out to reconnoitre, and soon returned at full speed, saying that the natives were crossing the river. Captain Wilson, with twenty men, took possession of a hill on the right flank—an almost impregnable position, while Captain Westrupp, with the main body, marched to support the picket which had been placed on the position which it had been arranged they should occupy; but before they could arrive there Te Kooti, with overwhelming numbers, had driven the picket from the ground and occupied the hill. \"This is going to be an awkward business, Wilfrid,\" Mr. Atherton said. \"We have only thirty rounds of ammunition a man, and we have had nothing to eat for the last forty-eight hours but a mouthful of meat. We have suffered the natives to take the position we fixed on. We are outnumbered three to one, and there are not ten men in the force who have had any experience in fighting. If the worst comes to the worst, Wilfrid, do you and the Allens take to the bush. Mind, it is no use trying to run from the natives. If the men were all like our party the other day we could keep these fellows at bay for any time; but they[Pg 269] are most of them young hands. They will blaze away their ammunition, and may be seized with a panic. I shall keep close to you, and if things do go badly we will keep together and sell our lives dearly.\" \"We must retake that place if possible, lads,\" Captain Westrupp said at that moment. \"Spread out in skirmishing order and take advantage of any cover you can find, but let there be no stopping or lagging behind. We must all get up there together and carry it with a rush.\" There was no time lost. The men spread out, and with a cheer started up the hill. They were received with a storm of bullets; but the natives from their eminence fired high, and without suffering loss they reached a small ridge near the summit, about twelve yards from the enemy, and separated from them by a narrow gully. Here they threw themselves down, and their fire at once caused the Hau-Haus to throw themselves down among the bushes on their side of the gully. The position of the colonists was a fairly strong one. On their right flank the ground was open, with a few scattered bushes here and there, but the left was covered by a steep ravine, which fell away sharply. The Hau-Haus kept up a heavy fire, to which the colonists replied but seldom, their officer continually impressing upon them the necessity for husbanding their ammunition. Mr. Atherton had arrived breathless in the rear of the party, and had thrown himself down by Wilfrid\u0027s side, the two Allens lying next in order. For some minutes Mr. Atherton did not speak, but lay panting heavily. \"This is a nice preparation for shooting,\" he said[Pg 270] presently. \"However, I suppose my hand will steady itself after a bit. I have seen a fellow\u0027s head show under that bush there twice, and each time his bullet came just over our heads. I will have a talk with him as soon as I get my wind back again. This is not a bad position after all, providing they don\u0027t work round to our right.\" Ten minutes later Wilfrid, who had his eyes fixed on a bush from which four or five shots had been fired, waiting for another puff of smoke to indicate the exact position in which the man was lying, heard the sharp report of Mr. Atherton\u0027s rifle. \"You have got him, I suppose?\" \"Of course, lad; there is one less of the yelling rascals to deal with. I wish we could see Biggs and his people coming along the road behind. If we could get a square meal all round and a good supply of ammunition I think we should be able to turn the tables on these fellows. The men are all fighting very steadily, and are husbanding their ammunition better than I expected to see them do.\" The fight went on for four hours. Then a number of the Hau-Haus leapt to their feet and made a rush towards the settlers, but the volley they received proved too much for them. Several fell, and the rest bolted back into shelter. Again and again this was tried, but each time without success. At three in the afternoon some men were seen coming along the road behind towards the deserted camp. Captain Westrupp at once wrote a note and sent it down by one of the men, but to the disappointment of the settlers he soon returned with the news that the new arrivals consisted[Pg 271] of only nine Maoris carrying rations. They had opened the rum bottles on their way, and most of them were excessively drunk. Two of them who were sufficiently sober came up to help in the defence, but one was shot dead almost immediately, one of the settlers being killed and many wounded more or less severely. Just as evening was coming on the force was startled by hearing a Hau-Hau bugle in their rear, and presently made out a party of the enemy moving towards the camp through the broken ground on the left rear. It was now evident that either the enemy must be driven off the hill in front or the party must retire to a position on the hill behind the camp. Captain Westrupp determined to try the former alternative first. Calling upon the men to follow him, he dashed across the gully and up on to the crest held by the Maoris. The men followed him gallantly; but the fire from the Maoris hidden among the bushes was so heavy that they were forced to fall back again, seven more of their number being wounded. They now retired in good order down to the camp and up the hill behind it, and were here joined by Captain Wilson with his twenty men. It was now determined to throw up a sort of intrenchment and hold this position until help came; but the settlers, who had hitherto fought well, were dispirited by their want of success, and by the non-arrival of the reinforcement, and were weak with their long fast. As soon as it became dark they began to steal off and to make their way back towards their homes, and in an hour half the force had retreated.[Pg 272] The officers held a council. It was evident the position could not long be held, and that want of food and ammunition would compel a retreat in the morning. It was therefore decided to fall back under cover of the darkness. The chief of the friendly natives, who had behaved admirably through the fight, offered to guide the party across the country. The officers were obliged to leave their horses, and the party of forty half-starved men, of whom a fourth were wounded—two so severely that it was necessary to carry them—set out. It was a terrible march for the exhausted men, up the bed of a mountain creek, often waist-deep in water, and over steep fern-covered hills, until, just as day was breaking, they reached an out-station. Here they managed to get two sheep, and just as they had cooked and eaten these Colonel Whitmore, the commander of the colonial forces, arrived with thirty volunteers from Napier, who had reached the bay on the previous day. He at once paraded the men, thanked them for their behaviour on the previous day, and warned them to be ready to start in pursuit of the enemy at once. One of the settlers, acting as spokesman for the rest, stepped forward, pointed out that they had been fighting without intermission for twenty-four hours, that they had been for the last forty-eight hours almost without food, and that it was impossible for them to set out on a fresh march until they had taken some rest. Colonel Whitmore was a hot-tempered man, and expressed himself so strongly that he caused deep offence among the settlers. They remained firm in their determination not to[Pg 273] move until the following day, and the forward movement was therefore necessarily abandoned. On the day previous to the fight Lieutenant Gascoigne had been despatched by Major Biggs to Te Wairoa with despatches for Mr. Deighton, who commanded at that station, warning him to muster all the force at his disposal, and prepare to intercept Te Kooti at the Waihau Lakes in case he should fight his way through Captain Westrupp\u0027s force. Orders were sent to the friendly Mahia tribe to muster, and a hundred men at once assembled; but as they had only four rounds of ammunition apiece, nothing could be done until three casks of ammunition were obtained from some of the Wairoa chiefs. Two days were lost in consequence, and this gave time to Te Kooti; they then started—eighteen European volunteers and eighty natives; a larger body of natives preparing to follow as soon as possible. After being met by messengers with several contradictory orders, they arrived at Waihau, and just before dark Te Kooti was seen crossing the hills towards them with his whole force. Captain Richardson determined to fight them in the position he occupied, but the native chief, with sixty of his followers, at once bolted. Captain Richardson was therefore obliged with the remainder to fall back, and, unfortunately, in the retreat one of the natives fell; his gun went off and, bursting, injured his hand. This was considered by the natives a most unfortunate omen, and dissipated what little courage remained in the Wairoa tribe. At eleven o\u0027clock next morning the enemy advanced and the action began; but the Wairoa chief, with fifty[Pg 274] of his men, again bolted at the first shot. Captain Richardson with the remainder held the position until four in the afternoon, when the ammunition being almost exhausted, he retired quietly. The force fell back to Wairoa, where it was reorganized and increased to two hundred men. In the meantime Colonel Whitmore had been toiling on over a terrible country in Te Kooti\u0027s rear, having with him in all about two hundred men, as he had been joined by Major Fraser with fifty of the No. 1 Division Armed Constabulary. But when they arrived at the boundary of the Poverty Bay district the settlers belonging to it, who had not recovered from their indignation at Colonel Whitmore\u0027s unfortunate remarks, refused to go further, saying that the militia regulations only obliged them to defend their own district. Colonel Whitmore, therefore, with a hundred and thirty men, of whom but a handful were whites, marched on to attack two hundred and twenty Hau-Haus posted in a very strong position in the gorge of a river. Twelve of the little party from the Mohaka River still remained with the column, one had been killed, four wounded, while five had remained behind completely knocked up by the fatigues they had encountered. Mr. Atherton had not gone on with them after the arrival of Colonel Whitmore. \"It is of no use, my dear lad,\" he said to Wilfrid. \"I know Colonel Whitmore well by reputation, and the way in which he blew us up this morning because, exhausted as we were, we were physically unable to set out for a fresh march, confirms what I have heard of him. He is a most gallant officer, and is capable of undergoing the[Pg 275] greatest fatigue and hardships, and is of opinion that everyone else is as tireless and energetic as he is. He will drive you along over mountain, through rivers, with food or without food, until you come up to Te Kooti, and then he will fight, regardless of odds or position, or anything else. It isn\u0027t the fighting I object to; but I never could keep up with the column on such a march. It would be a physical impossibility, and I am not going to attempt it. I shall take a week to recover from my fatigues of last night, and shall go down and stay quietly at the settlement. If Te Kooti takes it into his head to come down there, I shall have great pleasure in doing my best towards putting a stop to his rampaging over the country. If he does not come down I shall, as they say, await developments, and shall find plenty to do in the way of botanizing.\" Mr. Atherton had not exaggerated the fatigues and hardships that the force would be called upon to undergo, and they were worn out and exhausted when at last they came upon the track of the Hau-Haus. When they were resting for a short halt Captain Carr, late R.A., who was with the force as a volunteer, reconnoitred a short distance ahead and found the enemy\u0027s fire still burning. The news infused fresh life into the tired and hungry men, and they again went forward. The track led up the bed of a river which ran between low, steep cliffs impossible to climb, and the men had to advance in single file. After marching for some distance they reached a bend in the river, where a narrow track ran through a break in the cliff and up the spur of a hill. The advanced guard, consisting of six men, led by Captain[Pg 276] Carr, were within fifty yards of this point, when a heavy fire was opened upon them. Just where they were the river bank was sufficiently low to enable them to climb it and take cover in the thick scrub above, whence they replied vigorously to the Hau-Haus, who were within a few yards of them. In the meantime the enemy had opened fire from the base of the hill at the river bend upon the main body, who, standing in single file in the river, were unable to reply or to scale the steep bank and take covering in the scrub. Colonel Whitmore and Captain Tuke tried to lead the men up to charge, but this could only be done in single file, and the fire of the enemy was so hot that those who attempted this were killed or wounded, Captain Tuke being severely hurt. The rest found what shelter they could among the boulders in the river bed, and remained here until the advanced guard fell back, hard pressed by the enemy, and reported the death of Captain Carr and Mr. Canning, another volunteer. The natives now pressed through the scrub above the cliffs to cut off the retreat. The friendly natives, who were well behind, were ordered to scale the cliff then, and hold the enemy in check. One of them was wounded, and the rest hastily retreated down the river; the constabulary and settlers, altogether about fifty strong, fell back to an island about half a mile to the rear, and here calmly awaited the attack of the enemy. These, however, drew off without disturbing them, disheartened by the fact that Te Kooti had received a wound in the foot, and the troops then retired. Only a few of the strongest men reached the camp that night; the rest, knocked up by want of food and[Pg 277] fatigue, lay down in the pouring rain and did not get in until the following morning. The result of this fight was most unfortunate. Even Colonel Whitmore saw that, with the force at his disposal, nothing could be done against Te Kooti, who was daily becoming more powerful, and was being joined by the tribes in the vicinity. He believed that Te Kooti would carry out his expressed intention of marching north to Waikato, and after collecting there all the tribes of the island, march against Auckland. Thinking, therefore, that Poverty Bay was not likely to be disturbed, he left the settlement and went round by sea to Auckland to confer with government as to the steps to be taken to raise a force capable of coping with what appeared to be the greatest danger that had as yet threatened the island. Te Kooti did not, however, move north, but remained in his camp near the scene of the fight from the 8th of August to the 28th of October, sending messages all over the island with the news of the defeat he had inflicted upon the whites, and proclaiming himself the saviour of the Maori people. From the position he occupied, about equidistant from the settlements at Wairoa and Poverty Bay, he was able to attack either by a sudden march of two or three days, and yet there was no great uneasiness among the settlers. The force that had operated against Te Kooti had been disbanded, the Napier volunteers had returned, the constabulary withdrawn, and the party of settlers from the Mohaka river had returned home. Wilfrid Renshaw had not gone with them. He had been shot through the leg in the fight[Pg 278] in the river, and had been carried down to the settlement. Here Mr. Atherton, who was lodging in one of the settler\u0027s houses, had taken charge of him and nursed him assiduously. Unfortunately the effect of the wound was aggravated by the exhaustion caused by fatigue and insufficient food, and for weeks the lad lay in a state of prostration, wasted by a low fever which at one time seemed as if it would carry him off. It was not until the middle of October that matters took a turn, and he began slowly to mend. For the last three weeks his mother had been by his bedside. For some time Mr. Atherton in his letters had made light of the wound, but when the lad\u0027s condition became very serious he had written to Mrs. Renshaw saying that he thought she had better come herself to help in the nursing, as Wilfrid was now suffering from a sharp attack of fever brought on by his hardships. Mrs. Renshaw, on her arrival, was dismayed at the state in which she found her son. She agreed, however, that it was best not to alarm them in her letters home. The events on the attack of the settlement had much shaken Mr. Renshaw, and he was, when she left him, in a nervous and excited state. She saw that Wilfrid would need every moment of her time, and that were her husband to come it would probably do him harm and seriously interfere with her own usefulness. He was, when she left, on the point of returning to the farm with Marion, as there had been no further renewal of troubles in the settlement. It had been arranged that the two Allens should take up their residence at The Glade, and that four[Pg 279] men belonging to a small force that had been raised among the friendly natives should also be stationed there. This would, it was thought, render it quite safe against sudden attack. Mr. Renshaw was looking eagerly forward to being at home again, and his wife thought that the necessity of superintending the operations at the farm would soothe his nerves and restore him to health. She, therefore, in her letters made the best of things, although admitting that Wilfrid was prostrated by a sort of low fever, and needed care and nursing. At the end of another fortnight Wilfrid was enabled to sit up and take an interest in what was going on around him. The house was the property of a settler named Sampson, and had been erected by a predecessor of the farmer; it was a good deal larger than he required, though its capacity was now taxed to the utmost by the addition of three lodgers to his family. \"How are things going on, Mr. Atherton?\" Wilfrid asked one day when his mother was not present. \"People here seem to think that they are going on very well, Wilfrid.\" \"But you do not think so, Mr. Atherton?\" the lad asked, struck by the dry tone in which the answer was given. \"No, Wilfrid, I cannot say I do. It seems to me that the people here are living in a fool\u0027s paradise; and as for Major Biggs I regard him as an obstinate fool.\" \"How is that?\" Wilfrid asked, amused at his friend\u0027s vehemence. \"Well, Wilfrid, as far as I can see there is nothing[Pg 280] in the world to prevent Te Kooti coming down and cutting all our throats whenever he pleases.\" \"You don\u0027t say so, Mr. Atherton!\" \"I do, indeed; it is known that he has sent messages down to the natives here to remain apparently loyal, get what arms they can from the whites, and prepare to join him. I will say for Biggs that he has repeatedly represented the unprotected position of the bay to government, and has obtained permission to place an officer and nine men on pay as scouts to watch the roads leading to the settlements. Gascoigne is in charge of them. There are two roads by which the natives can come; the one a short one, and this is being watched, the other a much longer and more difficult one, and this is entirely open to them if they choose to use it. \"The fact is, Biggs relies on the fact that Colonel Lambert is at Wairoa, and is collecting a force of 600 men there to attack Te Kooti, and he believes that he shall get information from him and from some spies he has in the neighbourhood of Te Kooti\u0027s camp long before any movement is actually made. Of course he may do so, but I consider it is a very risky thing to trust the safety of the whole settlement to chance. He ought to station four mounted men on both tracks as near as he dare to Te Kooti\u0027s camp. In that case we should be sure to get news in plenty of time to put all the able-bodied men under arms before the enemy could reach the settlement.\" \"Have they got a stockade built?\" \"No, it was proposed at a meeting of some of the settlers that this should be done, but Biggs assured[Pg 281] them it was altogether unnecessary. I do not know how it is, Wilfrid, but take us all together we Englishmen have fully a fair share of common sense. I have observed over and over again that in the majority of cases when an Englishman reaches a certain rank in official life, he seems to become an obstinate blockhead. I have often wondered over it, but cannot account for it. Anyhow the state of affairs here is an excellent example of this. I suppose in the whole settlement there is not, with the exception of the man in authority, a single person who does not perceive that the situation is a dangerous one, and that no possible precaution should be omitted; and yet the man who is responsible for the safety of all throws cold water on every proposal, and snubs those who are willing to give up time and labour in order to ensure the safety of the place. \"I suppose he considers that the tone he adopts shows him to be a man superior to those around him, possessing alike far greater knowledge of the situation, and a total freedom from the cowardly fears of his neighbours. Well, well, I hope that events will justify his course, but I own that I sleep with my rifle and revolvers loaded and ready to hand. Mind, I do not say that the chances may not be ten to one against Te Kooti\u0027s making a raid down here; but I say if they were a hundred to one it would be the height of folly not to take every possible precaution to ensure the safety of all here.\" \"Don\u0027t you think, Mr. Atherton, that it would be better for mother to go home? I am getting all right now, and can get on very well without her.\"[Pg 282] \"I am sure your mother would not leave you at present, Wilfrid, and I don\u0027t think you will be fit to be moved for another fortnight yet. Te Kooti has done nothing for two months, and may not move for as much more. Your mother knows nothing of what I have told you, and I should not make her anxious or uncomfortable by giving her even a hint that I considered there is danger in the air.\" \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3165/86852.html","bookId":869,"book":{"id":869,"title":"Maori and Settler","description":"简介： WELL, mother, one thing is certainsomething has got to be done. It is no use crying over spilt milk, that I can see. It is a horribly bad business, but grieving over it won\u0027t make it any better. What one has got to do is to decide on some plan or oth...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3165","creation":"Aug 1, 2019 12:23:39 AM","modification":"Aug 1, 2019 12:23:39 AM"}}
