{"id":72951,"no":11,"title":"Page 11","content":"\\n\\n “You’re about to collapse. I’m ordering you to go home.”\\n\\n “Fuck your orders.” I couldn’t summon the strength to yell, so my words emerged as a small, hollow whisper. Surprisingly, though, my ire grew a bit more. I pivoted back to bed. “Dallas needs me.”\\n\\n I didn’t hear Jack approach, but suddenly he stood beside me, his hand on my shoulder. “Staying isn’t going to make him live.”\\n\\n “At least—” I gulped. “At least he won’t die alone.” God, that hurt so much to say. I almost screamed then, screamed at God, at Jack, at the doctors who couldn’t help this once vivacious man. I had to bite my cheek to keep the sound inside me; I bit until the metallic tang of blood filled my mouth.\\n\\n Jack gave my shoulder a squeeze. “He was a good man. One of the best. I already miss him.”\\n\\n Shut up, shut up, shut up!my mind shouted. I covered my ears to block Jack’s voice. He was talking about Dallas as if he were already dead.\\n\\n Perhaps he was.\\n\\n I focused on Dallas’s face, so pale, so withdrawn. There truly was no hope for survival.\\n\\n I couldn’t say those words, however, so I said, “He isn’t dead yet.”\\n\\n “No, but he’ll need a miracle to survive.” He gave my shoulder another squeeze. “It’s amazing how quickly a man’s life can change, isn’t it? A blink of an eye. A snap of fingers.” He paused. “A heartbeat.”\\n\\n One of his tears splashed onto my palm. I watched as the clear liquid slipped through my fingers. I’d never seen this strong man cry before. And knowing his own emotions mirrored my own…A tremor racked my spine. He had found some sort of release, yet I had none. My emotions were trapped inside me.\\n\\n I scrubbed a hand down my face, resisting the urge to bang my head against the bed rail. Maybe physical pain would eclipse my emotional pain.\\n\\n “Is he suffering?” Jack asked softly, ripping into my thoughts.\\n\\n I shook my head. “No pain. They’ve got him so high, he’s probably flying with the angels.”\\n\\n “I’m glad. I don’t want our boy in pain.” Jack released my shoulder and strode to the room’s only window. “Jaxon is taking care of the funeral arrangements. I thought it would be too much for you.”\\n\\n “I’ll do it,” I said, my irritation rising another notch. “As his partner, it’s my right. I want my cases, too. Don’t give them to anyone else.”\\n\\n “Very well.” Then, donning his usual gruff demeanor, Jack said, “Be at headquarters tomorrow, one o’clock sharp.” He turned on his heel and strode to the door, only to stop before stepping over the threshold. Gazing over his shoulder, he pinned me with his stare. “I know you’re grieving. We all are.”\\n\\n “I—”\\n\\n He cut me off. “You asked to keep the Steele case. You asked. I didn’t command you. Therefore you have a job to do, and I expect you to do it.”\\n\\n “I know,” I said, massaging my temples. I was grateful for his abruptness. I would have crumpled under pity or gentleness, and he knew it.\\n\\n “I need you to question Lilla and report the results at our debriefing. Can you do that?”\\n\\n “Yes,” I said, determination creeping into my tone.\\n\\n “Good girl.” With that, he shuffled from the room.\\n\\n I was once again alone with Dallas. Clasping his cold, lifeless hand, I laid my cheek on the edge of the bed. Those two little actions caused every emotion I’d experienced in the last hours to drain out of me, leaving only emptiness. Lethargy washed through my every hollow and crevice, claiming my limbs and, lastly, my eyes.\\n\\n The last thought to drift beneath my consciousness before a swirling fog engulfed me was, Please God, send me another miracle.\\n\\n I came awake slowly and realized three things all at once, only one of them significant.\\n\\n First, I realized that I hadn’t suffered through any dreams. Very unusual for me; I always dreamed. Second, I wasn’t sure how much time had passed since I’d fallen asleep. Third, the hairs on the back of my neck were standing on end.\\n\\n As my senses became more attuned, I felt an invisible pair of eyes upon me, intense, observant eyes hovering over my shoulder, watching…waiting. I knew I was inside Dallas’s hospital room, and I knew it wasn’t Dallas watching me.\\n\\n Keeping my motions slow and deliberate, I reached for the gun at my waist. Then I froze. My gun was gone. Fucking gone. I didn’t panic, though. I had a backup strapped to my ankle, though this one wasn’t as competent, since it only offered “hot” and “extra hot” settings. No stun. I curled my fingers around the trigger.\\n\\n Fighting the urge to jolt to my feet, I allowed my eyelids to crack open a little at a time, gradually taking in my surroundings. Darkness had fallen, and muted beams of luminescence seeped through the beige hospital blinds. I kept my head and body completely immobile as I shifted my gaze around the room.\\n\\n There, in the corner, a man lounged causally in a chair. I stifled a gasp when his features came into view. No, not a man. An Arcadian.\\n\\n The Arcadian.\\n\\n The warrior I’d chased through the alley.\\n\\n His energy wrapped all around me, strong, pure. Deadly. A shiver tingled along my nerve endings. His hair was thick and white and fell to his shoulders. I pictured his eyes, knew they were the palest violet, almost crystalline, with a thin veneer of calm, like nitroglycerin just before detonation. I knew his lips were full and lush, a perfect contrast against his ultra-masculine features, making him seem all the more dangerous.\\n\\n He must have sensed my perusal because he blinked, a sensual sweep of his lashes, and said huskily, “Your friend rests at death’s door, Tai la Mar.”\\n\\n Angel of Death, he’d called me. I jerked upright. My chair skidded behind me and collided with the wall. I had my firearm drawn and pointed at his heart before he could take another breath. I knew Dallas still lived because the gentle hum of his monitors filled my ears, and I could see the rise and fall of his chest from the corner of my eye, courtesy of the machine breathing for him.\\n\\n “Where’s my pyre-gun?” I asked, keeping my voice calm, even though my heart was tripping inside my chest.\\n\\n “Your weapon is safe.”\\n\\n Safe, my ass. “Where’s Rianne Harte?”\\n\\n “I tried to warn you about her, did I not?” He shifted slightly, creasing his black slacks. The sleeves of his white tailored shirt were rolled to his elbows. “But did you heed my warning?”\\n\\n I didn’t answer him. Instead, I asked a question of my own. “Did you take her?”\\n\\n “No,” he answered without hesitation. “I did not.”\\n\\n “Then prove it. If you can.”\\n\\n “I warned you about her, didn’t I?”\\n\\n I switched the safety off, making sure he saw, then narrowed my gaze, focusing on which part of his body I wanted to hit first. Between the eyes, I decided, leveling my aim. One move from him, and I would fire first, ask questions later. “I’m left wondering if your warning was meant to help me or taunt me.”\\n\\n He only laughed, a rich, throaty rumble full of genuine amusement. The sound moved over me as softly as a caress. “You humans are so silly. Put your gun away,” he said. “Had I wanted to hurt you or your friend, I would have done so already.”\\n\\n Unwavering, I held my weapon steady. “I’m still interested in hearing why you gave me Rianne’s name.”\\n\\n He shrugged, his stare becoming hard and gauging. “Perhaps I was testing you.” He paused. “Perhaps you failed.”\\n\\n “And you’re here to give me another chance? Or to gloat over my failure?”\\n\\n “Actually, I am here to offer you a trade. If you are as honorable as I have heard, we can help each other.”\\n\\n I snorted. “The only thing I’m going to help you do is find your way into a cell.”\\n\\n His eyes slitted. “I am Kyrin en Arr, and I have come for my sister.”\\n\\n Lilla’s brother. I should have guessed. Automatically I applied pressure to the trigger, but stopped myself before actually firing. This man knew about the victims, and now he was connected to the case through other means. He would better serve me alive. “So you’re the Arcadian who’s murdered more humans than any of your kinsmen, are you?”\\n\\n “Some would say so, yes,” he said without shame or regret.\\n\\n “Well, guess what, Kyrin? Lilla belongs to A.I.R. now, and with her history of violence and being a prime suspect in a murder investigation, we’re keeping her. I’m sure you’re aware that her crimes are punishable by death.”\\n\\n His face paled. He was definitely aware.\\n\\n “I plan to see her executed,” I finished.\\n\\n “She is not a criminal.” Something cold and hard washed over his features, returning his color. His eyes gleamed with dangerous intent, like the sharpest of daggers, exquisite to view, lethal to touch. “Let her go.”\\n\\n “Yeah.Right.”\\n\\n “I would not be so quick to deny my request, were I you.”\\n\\n “And why is that?”\\n\\n “Because I,” he said, studying me with an unnerving intensity, “can save your friend.”\\n\\n I can save your friend.\\n\\n Those words beat inside my mind, causing white-hot fury to pound through every fiber of my being. Bastard! How dare he utter such a lie? How dare he attempt to offer false hope, simply to save his sister? Eyes compressed to tiny slits, nostrils flared, I began adjusting the level of power on my gun to its highest setting. I was going to have myself an Arcadian barbecue.\\n\\n A nurse entered the room. I saw her in my peripheral vision, but didn’t switch my position or my focal point from Kyrin. She dropped her chart when she caught sight of my gun. She froze in place, her eyes a tableau of horror, her mouth open.\\n\\n “I—I heard a noise,” she stammered, her features ashen with shock.\\n\\n “Exit the room, ma’am,” I told her. I meant for the words to elicit calm and reassurance, but they exploded from my mouth with all the rage I felt. “I’ve got the situation under control.”\\n\\n “I—I—should I call the police?” she stuttered to Kyrin, as if he was the one in charge here.\\n\\n “I am the police,” I shouted. “Now get the fuck out!”\\n\\n Nurse Idiot didn’t move.\\n\\n Then Kyrin gave a slight tilt of his head, and she raced from the room as quickly as her feet could carry her. My lips curled in contempt.\\n\\n “Do you prefer original or extra crispy?” I asked. “Because I’m willing to fry you up either way.”\\n\\n He ignored me, and instead replied with, “I gave Dallas—that is his name, yes?—some of my blood. Only a drop, mind you, but he will live a few days more because of it. Were I to give him more, he would live out the rest of his life, healthy and whole.”\\n\\n “If you won’t choose, I’ll choose for you. I say”—I pretended to mull it over—“extra crispy.”\\n\\n “Is his heartbeat not steadier? His color not brighter?”\\n\\n I flicked my partner a quick glance, and my eyes widened. Yes, on both counts, I realized, shock pounding through me. My hands stilled. “That doesn’t mean you helped him.”\\n\\n “You disappoint me. I thought a woman of your talents would be more insightful.”\\n\\n I bared my teeth in a scowl. “Perhaps you require a demonstration of exactly what my talents are.”\\n\\n “Perhaps you require a demonstration of mine.” Kyrin slowly rose. He was so tall, I was forced to look up, almost at the ceiling. I scanned his body, but I saw no evidence of weapons. Still, my heart slammed inside my chest, and my palms sweated. I didn’t understand my reaction. I’d squared off with aliens just as intimidating and won. I was the one in control here. I had the authority. I held the weapon.\\n\\n “You’d say anything to save your sister,” I said.\\n\\n “I would say anything to free her, yes, but in this, I do not lie.” He stretched out one hand and reached inside his slacks pocket with the other. Gaze locked on mine, he withdrew a small but deadly blade.\\n\\n Okay, now he had a weapon.\\n\\n “Stop right there,” I commanded. “I’ll kill you without a qualm.”\\n\\n “Then you would never know the truth, would you?” Calmly he clasped the blade and placed the tip at his palm. I was too fascinated by his words and actions to follow through with my threat. His features remained expressionless as he sliced a deep incision from one end to the other. Blood sprang from the torn tissues, and the scar on my arm throbbed in reaction.\\n\\n As I watched, his wound slowly closed itself, the tissues weaving themselves together and leaving the blood pooled in his hand. He wiped away every crimson drop on his shirtsleeve, a red smear against pristine white, then revealed the perfect smoothness of his hand.\\n\\n “Do you see?” he said. “I cannot die, and those who consume my blood will live, as well.”\\n\\n My God, this alien was some sort of immortal being.\\n\\n I didn’t know what to think of that fact. A lot of aliens had special powers, but I’d never heard of one with accelerated healing. I told him so.\\n\\n “That doesn’t mean it isn’t so. There is only one other like me,” Kyrin said with a shrug, “but you will never find her. So right now, I am your friend’s only hope. My blood can save him.”\\n\\n That’s when it hit me, truly hit me. Dallas could be saved. The knowledge rocked me to the core. I was almost afraid to speak my next words. “In exchange for his life, you want me to set your sister free?”\\n\\n “Yes,” he said. “That is all I require.”\\n\\n Yes, I’ll set her free, I thought in the next instant. I’ll slip inside A.I.R. headquarters, unlock her cell, and escort her from the building. Yes, that’s exactly what I’ll do. Excitement bubbled inside me. Then…the enormity of the situation slammed into me with the force of an antique 9mm Glock. I closed my eyes, lowered my gun. I couldn’t let Lilla go. Six other lives were at stake here—the lives of the five abducted citizens…and my own. \\n\\n","sourceLink":"https://allnovel.net/awaken-me-darkly-alien-huntress-1/page-11.html","bookId":1766,"book":{"id":1766,"title":"Awaken Me Darkly (Alien Huntress #1)","description":"Storyline: Awaken Me Darkly (Alien Huntress #1) \\n RIDDING THE WORLD OF EVIL, ONE ALIEN AT A TIME: THAT\u0027S MIA SNOW\u0027S MISSION. \\n Snow is in the forecast. \\n In a time and place not too far away, Mia Snow is an alien huntress for the New Chicago Police Department. Heading up her expert team of Alien Investigation and Removal agents, Mia\u0027s unmatched at battling the elusive enemy among us, and she\u0027s the perfect girl for the job. She\u0027s seen her brother die at the hands of aliens. She\u0027s earned each of her scars. And she\u0027ll die before she cries. Now, a series of killings have Mia and her partner Dallas tracking alien suspects -- but a sudden blast of violence leaves Dallas fighting for his life. \\n They are ice and fire. \\n The chance to save Dallas appears in the form of a tall, erotic stranger. An alien. A murder suspect. Kyrin en Arr, of the deadly Arcadian species, holds the power to heal the injured agent but not without a price. For Mia Snow, that price is surrendering to Kyrin\u0027s forbidden seduction...and embracing their electric attraction. She\u0027s walking a knife\u0027s edge, risking her badge and even her life. The closer she gets to Kyrin, the more Mia learns about her own heart, her human needs -- and the shocking secret that will shatter everything she\u0027s ever believed.\\n","cover":"https://allnovel.net/images/awaken-me-darkly-alien-huntress-1.jpg","author":"Gena Showalter","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/awaken-me-darkly-alien-huntress-1.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:25:55 AM"}}
