{"id":86405,"no":9,"title":"Page 9","content":"\\n\\n Casey gasped and gripped Rory by the shoulders, pushing him to his knees in front of him. Rory didn’t have any experience, but he knew instinctively what to do. He spent several minutes just kissing Casey’s dick and fondling his heavy balls, spending some time kneading them with his hands and rubbing lightly with his fingernails. With long, slow sweeps of his tongue, he covered the length of Casey’s shaft before coming to a stop at the tip, lavishing attention on it with kisses and little licks. Casey’s hands fisted in his hair and his legs trembled, though he hadn’t made a sound. Rory wanted badly to make him cry out as he had for him. He put his mouth down over the entire shaft, swallowing and sucking at it until it hit the back of his throat. He didn’t gag though, and moved his mouth up and down the length slowly and sensuously, not quite deep-throating it, ending each journey back to the top with a swirling kiss, until Casey cried out, his hips pumped to fuck Rory’s mouth.\\n\\n “Oh God, Rory!”\\n\\n Rory smiled. He’d made him call out his name after all. Rory turned back to his ministrations, but was suddenly hauled up off the floor and tossed on his back on the bed. Casey’s voice was hoarse with emotion when he spoke to him.\\n\\n “Turn over, baby. Get up on your hands and knees.”\\n\\n Rory took a deep breath and then did as he was told, looking nervously back over his shoulder at the big wolf. Casey took a tube of lube out of a bedside drawer, but he caught the look from Rory and smiled.\\n\\n “Don’t be scared, baby. I don’t want to hurt you. I’ll take it as slow as I can.”\\n\\n Casey knelt behind him and caressed his ass, rubbing his cheeks in little concentric circles, massaging ever closer to his goal. Rory tried his best to relax, bracing himself for the cold lube on Casey’s fingers. Instead, Casey spread his cheeks with the palms of his hands, and his soft lips kissed him there on his tight, puckered little hole. He gasped in surprise and flinched away, but Casey hooked a strong arm around his hips, holding him in place.\\n\\n “Relax, sweetheart. Let me love you.” He sucked, licked, even nipped him a little.\\n\\n Rory responded with deep groans of pleasure, his arms refusing to hold him up any longer. Falling, his head rested on the pillows, his ass still high in the air. Casey pushed several pillows under his stomach so he could lie down, relaxing further and still have his ass elevated.\\n\\n A finger slick with lube, probed his tight virgin hole, sliding in and out in rhythm, deeper with each drive inside Rory. Stretching, rubbing, a second and then a third finger penetrated, keeping a slow rhythm until Rory thought he’d go mad from the sensations. At the same time, Casey’s other hand, slipped under him to caress his cock and rub his balls, his hands seeming to be everywhere at once. Rory shoved back his hips for more, unable to be still any longer.\\n\\n “Don’t move until I tell you, honey. You could hurt yourself.” Casey slapped his ass, not hard, but enough to let him know he wasn’t in charge of any of this, and Rory struggled to hold still. Casey’s hands in his hair pulled his head around, forcing him to look at him over his shoulder. “I want you to see me fuck you, baby. I want you to know you belong to me.”\\n\\n Rory whimpered in need, pushing back when Casey rubbed the wet head of his cock at his stretched hole. Casey pushed his cock in past the ridge Rory had lavished attention on such a short time ago through the tight ring of muscles at Rory’s entrance. It burned, and Rory held his breath against the pain.\\n\\n “Shhh, baby. I know it hurts at first. Just try to relax. Push out a little, like you’re bearing down, open up for me. That’s it, sweetheart.” Casey eased deeper inside an inch at time, holding still, letting Rory adjust by degrees to being stretched and filled. Buried all but a few inches to his balls, Casey waited again for Rory to relax, then pulled nearly out and drove into him, hard, fast, and deep.\\n\\n Rory cried out, his body flailing to escape the impalement. Casey held him down, one hand planted in the middle of his back, and drove in again, touching something inside Rory with each new thrust to turn pain into an aching pleasure. An underlying groan escaped his lips as Casey thrust at him. With drive after drive following, Rory heard himself making hard, breathy sounds he’d never heard himself make before. Casey’s cock repeatedly touched the spot deep within him he didn’t even know he had, feeling so damn good he thought he might die from the pleasure. Casey still had one hand in his hair, and Rory looked at him, holding his gaze. He whimpered, and Casey stilled for a moment, still throbbing deep inside him, out of breath, his eyes dark with need.\\n\\n “Are-are you okay, baby? Am I hurting you?” Rory shook his head, but Casey gentled his movements and leaned over to kiss the back of Rory’s neck. “I love you, sweetheart,” he whispered.\\n\\n Rory whispered back, “I love you too.”\\n\\n Casey moved again a little faster, until he seemed to get swept away and thrust harder and harder. As he hit that sweet spot inside Rory with each ram of his cock, Rory’s climax built closer until he cried out against the intensity of the dam breaking, cum spurting from his cock onto the bed. Casey came at the same time, his hips ramming and holding for each pump from his sack.\\n\\n As the waves of pleasure washing through him stilled, he went limp all over. Casey, incredibly, was still hard inside him. He slipped a finger in alongside his cock, pushing against Rory harder, pulling with his finger to stretch Rory open even more, forcing in the knot, the ring of flesh around the base of his cock that all wolves have.\\n\\n “You’re hurting me,” Rory murmured, thinking all he had to do was tell Casey and Casey would stop, but he didn’t. He held Rory to the bed with his chest and forced a second finger in on the opposite side of his cock. Rory struggled, trying to get away, but Casey’s weight held him down, pulling his asshole up and out, pushing with his hips to work the knot in.\\n\\n “You’re tearing me.”\\n\\n “Hush, baby. It’s not tearing you. You can stretch to hold it. I know it hurts, but it’ll feel good in a little while. Try to push out and back against me—that’s it.”\\n\\n “You’re ripping me open,” Rory cried with a sob, arms and legs flailing in a hopeless attempt to break free. “Stop.”\\n\\n “It’s not ripping, baby, and I can’t. I can’t stop.” Casey panted, driven by instincts of centuries and hormones gone wild.\\n\\n He braced his feet on the bed, got two more fingers inside.\\n\\n Rory wept and pleaded. “Stop, Casey, please, please.”\\n\\n “I’m sorry. I can’t stop. I have to do this. I have to.” He pulled out on the ring of tender flesh and rammed with the power of his legs at the same time, forcing the large knot of flesh inside, past the tight ring of muscles at his entrance which clamped tight behind it as soon as Casey pulled his fingers free.\\n\\n Rory screamed. Impaled and totally helpless, painfully stretched and feeling as if his insides were crushed, Rory gasped out each breath. Even that little movement made the large gland wedged deep inside his body slide firmly against his prostate, setting off a second orgasm.\\n\\n While Rory’s body convulsed and he wept, Casey’s canine teeth, extended the instant the knot was successfully buried, bit deep into the back of Rory’s neck, sinking into his flesh with the mating bite.\\n\\n The orgasm magnified. The intense pleasure coming from the bite coursing through Rory’s blood intensified his orgasm until he thought his entire body was ripping apart. His back arched as he pushed up with his arms, driving his neck into the bite, wanting to never let go. One orgasm faded away. Another began, rolling waves of bliss that seemed to go on forever his body caught in spasms of ecstasy, and he clawed at the bed under him.\\n\\n Casey, still covering him with his body to hold him down, still buried inside him, caught his wrists with his hands, soothing him, crooning loving words.\\n\\n “I’m sorry, baby. I couldn’t stop. We had to finish.”\\n\\n After what seemed like forever, the orgasm tapered off, and Rory slumped on the pillows, not knowing if he’d be able to survive another one. “It hurts, Casey.”\\n\\n Casey’s dick and knot was still firmly lodged in his ass, and no amount of pulling or struggling would remove him. Struggling only made it worse, rubbing his prostate until incredibly, another orgasm came on.\\n\\n Panicking, he screamed, and his scream turned into a howl as his body tried to shift. Helpless to prevent it, he sagged onto the bed, afraid suddenly of what his wolf would do to Casey when it emerged. He could tell it tried, and fought hard, but his wolf was trapped inside. Casey’s gland pulsated inside him, secreting fluid that seeped out of his ass, dripped to his balls and soaked the bed, mixing with the cum of his multiple orgasms. He yelled out in rage and pain as his wolf retreated deep inside him, crying and whimpering in agony.\\n\\n The mating was killing his wolf. Rory could feel it dying. He struggled desperately to get away, to pull the knot and cock out of his body. He only succeeded in bringing on another orgasm, ripping into him and twisting every muscle in his body. Milked dry and spent, he no longer spurted cum. His wolf surged one last time, trying to come out to protect him, but it fell back, defeated, vanquished, and crying helplessly. Rory wept in grief and helpless rage, as his wolf retreated deep down inside him, and he tried to howl his pain. It came out as an impotent cry.\\n\\n “Please, Casey, please release me. My wolf.”\\n\\n “No, baby.” He heard Casey’s satisfaction in his ear. “I couldn’t even if I wanted to, and I don’t. No more murdering little wolf for you. That’s over. You belong to me now, pet.”\\n\\n Murdering wolf? What could he mean? Rory slumped in despair and felt the edges of darkness grow closer together, overwhelming him and pulling him under when yet another orgasm shook his body.\\n\\n Reeling in and out of consciousness, Rory suffered from lethargy and weakness he’d never known before and was barely aware of the fact Casey was no longer tied to him. He tried to raise his head from the pillow, but it fell back weakly. Something pressed against his lips, and he opened his eyes to see Casey, pushing his bleeding wrist against his mouth. Why was Casey feeding him his blood? He tried to turn his head away, but Casey wouldn’t let him, gripping his hair and forcing his head still. “Final step of the mating, baby. Drink. You need my blood.” \\n\\n","sourceLink":"https://allnovel.net/cry-wolf-dark-hollow-wolf-pack-2/page-9.html","bookId":2254,"book":{"id":2254,"title":"Cry Wolf (Dark Hollow Wolf Pack #2)","description":"Storyline: Cry Wolf (Dark Hollow Wolf Pack #2) \\n Casey, a good looking young wolf shifter has sworn to kill the man who killed his brother. He has joined the Mountain Wolf Pack to carry out his revenge. On his first work detail, he discovers that the handsome young man in charge is his blood mate. The trouble is, the man, whose name is Rory, is straight, and a wolf. Two wolves are allowed to mate, but only if one assumes the submissive role. Neither of these two stubborn wolves is willing to compromise. If that’s not bad enough, they soon discover that Rory is the wolf who killed Casey’s only brother. Now Casey must find some way around his sworn oath. Can the two sexy wolves overcome their distrust and hatred of each other, or will they be forced to give up their happiness, along with their only true blood mate?\\n","cover":"https://allnovel.net/images/cry-wolf-dark-hollow-wolf-pack-2.jpg","author":"Shannon West","type":"Mystery","source":"allnovel","link":"https://allnovel.net/cry-wolf-dark-hollow-wolf-pack-2.html","creation":"Oct 5, 2019 8:58:31 AM","modification":"Oct 5, 2019 5:13:52 PM"}}
