{"id":94002,"no":39,"title":"Page 39","content":"\"Will I see you tomorrow night?\" Cara wound her arms around Vince\u0027s neck. It was after three AM and they were standing on the front porch saying good night.\n \"What do you think?\"\n \"I don\u0027t think I can wait that long to see you again.\"\n \"Then come by the garage in the morning.\"\n \"You\u0027re working there again?\"\n \"Yeah,\" Vince said, grinning. \"Looks like it\u0027s for good this time.\"\n \"I\u0027ll be there bright and early,\" she said, and then frowned. \"How early is too early?\"\n Reaching into his pocket, he withdrew a key and handed it to her. \"Come on by anytime,\" he said. \"If I\u0027m still in bed, well... you can just crawl in beside me.\"\n \"But I thought... I mean, won\u0027t you be... umm, sleeping the sleep of the dead?\"\n Vince laughed. \"Believe me, darlin\u0027, if you\u0027re nearby, I\u0027ll know it.\"\n Yawning, Cara slipped the key into her pocket. It had been a long night. \"I don\u0027t know how early it will be,\" she said, smothering another yawn, \"but I\u0027ll be there.\"\n He nuzzled her neck, just behind her ear. \"I love you.\"\n \"I love you, too,\" she murmured, and then frowned. \"You\u0027re not going to want to drink my blood, are you?\"\n \"I hate to tell you this, darlin\u0027, but I\u0027ve wanted to do that since the night we met.\"\n \"Oh.\" The thought should have been repulsive; instead, she found it oddly intriguing.\n \"I tasted you once.\"\n Her eyes grew wide. \"What? You did?\" She lifted a hand to her neck. \"When?\"\n \"The first time we made love.\"\n \"I don\u0027t remember that part.\"\n \"I only took a little taste, darlin\u0027, just enough to satisfy my curiosity.\"\n \"Your curiosity about what?\"\n He ran his fingertips up and down her neck, traced the outline of her ear and her cheek. \"How you\u0027d taste.\"\n \"Doesn\u0027t everyone taste the same?\" She couldn\u0027t believe they were standing on her front porch having this conversation.\n \"No.\"\n \"I didn\u0027t know blood came in flavors,\" she muttered.\n \"I\u0027ve never tasted anything as sweet as you, darlin\u0027.\" Resting his forehead against hers, he inhaled deeply, drawing in the scent of her hair, her skin, her life\u0027s essence. \"You\u0027ve spoiled me for everyone else.\"\n She was flattered, and then wondered why. It wasn\u0027t as if he was complimenting her on a new hairstyle or a new dress or the color of her eyes. He was saying he liked the taste of her blood!\n \"Guess I shouldn\u0027t have said that,\" Vince drawled.\n Cara lifted one shoulder and let it fall. \"No one\u0027s ever complimented me on my blood before,\" she said,\n laugher evident in her tone. \"I\u0027m not sure what to say.\"\n \"You don\u0027t have to say anything, except that you still love me.\" He canted his head to one side. \"You do, don\u0027t you?\"\n Standing on her tiptoes, she laced her hands behind his neck and kissed him, long and slow. \"What do you think?\"\n \"I think I loved you the first time I saw you at The Nocturne,\" he replied. \"And I\u0027ll love you for as long as you live.\"\n \"I love you, too. Please don\u0027t be angry if sometimes I seem...\"\n \"Disgusted by what I am?\"\n \"No, not that!\" She pressed her fingertips to his lips. \"It\u0027s just all so new. You, my parents... sometimes I feel like I\u0027m the one who\u0027s different.\"\n She thought about those words as she drifted off to sleep and wondered what they would mean to any child they might bring into their home. She thought about her own childhood and how strange it had been.\n Of course, her son or daughter wouldn\u0027t have two parents who were vampires, or a father who was only there at night. Vince could be active during the daytime, and Cara would be there to take their child to school and go to conferences and school plays and award ceremonies. She could attend graduations and birthday parties and piano recitals. Her child\u0027s life would be normal, or as close to normal as Cara could make it. If Vince was willing, they might even adopt more than one...\n It was her last thought before sleep claimed her.\n Cara and Vince decided to be married as soon as possible. Cara and Brenna spent every evening for the next week shopping for wedding dresses. Cara didn\u0027t know how she would ever decide on a gown, since she loved every one she tried on, whether it was short and sexy or long and elegant. It was the same with veils. She liked the shoulder-length ones; she liked the long ones.\n Now, standing in front of a three-way mirror clad in a froth of white lace, she glanced at her mother. \"I love this one, too! I\u0027ll just have to ask Vince which dress he likes the best.\"\n \"Don\u0027t you know that\u0027s bad luck, for the groom to see the bride in her wedding dress before the wedding?\"\n \"You don\u0027t believe that, do you?\" Cara asked, surprised that a woman who was a witch and a vampire would believe some silly superstition; then again, maybe her mother believed it because she was a witch and a vampire!\n Brenna grinned. \"Why take chances?\"\n With a sigh, Cara went into the dressing room to change into her own clothes. She absolutely loved trying on wedding gowns, but sooner or later, she was going to have to pick one. Or maybe not, she thought with a grin. She loved shopping with her mother. When they weren\u0027t looking at wedding gowns, they were buying things for Cara\u0027s house-new sheets for the bed, a picture for above the fireplace, a scratching post for Cat, and a new screen for the fireplace. Brenna bought Cara a sheer black nightgown for her wedding night, a pair of matching slippers, and several sets of sexy underwear in a variety of colors.\n In addition to buying things for the wedding and the wedding night, Cara and Brenna shopped for Christmas presents for their husbands. Cara loved walking through the mall, looking at all the decorations and listening to the Christmas carols. She and Vince had spent the night before putting up Christmas lights and looking for a tree. Cara had always loved the Christmas season, but never more than this year, when Vince was there to share it with her.\n Cara and her mother were leaving the mall Tuesday night after yet another shopping spree when Cara had the feeling that they were being followed. Frowning, she glanced over her shoulder to see two gray-clad women walking along the street behind her and her mother. A chill ran down Cara\u0027s spine as she recalled the two women she had seen in Serafina\u0027s book shop. She told herself she was being silly.\n These weren\u0027t even the same women she had seen.\n \"Something wrong, dear?\" Brenna asked. \"You look as white as a ghost.\"\n Cara looked at her mother. \"What?\"\n \"I asked you if something was wrong.\"\n Cara shook her head, then glanced over her shoulder again. There was no sign of the two gray-clad women. Nevertheless, she was glad when they reached her car.\n Vince was waiting for her when she and her mother got home. One look at him and she forgot everything else.\n \"So, how did the shopping go?\" he asked. \"Did you find a dress yet?\"\n \"Dozens of them!\" she replied.\n He shook his head. \"What\u0027s the problem?\"\n \"She can\u0027t make up her mind,\" Brenna said.\n \"She never could,\" Roshan said, smiling fondly at his daughter. \"Remember how long it took her to decide on a car?\"\n \"Weeks,\" Brenna said.\n Vince groaned as he drew Cara into his arms. \"At this rate, we\u0027ll never get married,\" he muttered, then frowned at her. \"You\u0027re not getting cold feet, are you?\"\n \"Of course not. But the dresses are all beautiful.\"\n \"And she looks beautiful in them,\" Brenna said.\n \"I\u0027m sure she does,\" Vince agreed. \"How about if I pick one out?\"\n \"Don\u0027t you know it\u0027s bad luck for the groom to see the bride in her gown before the wedding?\" Cara asked, winking at her mother.\n Vince shrugged. \"I won\u0027t see you in it, I\u0027ll just pick it out.\" He nuzzled her neck. \"I\u0027m getting tired of living alone.\"\n \"All right, I\u0027ll pick one out tomorrow, I promise.\"\n \"Good.\"\n \"So, where are we going to be married?\" Cara asked. \"I guess a church is out of the question.\"\n \"A church is fine with me,\" Vince said.\n \"Really? I didn\u0027t think vampires and churches went together.\"\n \"I know the perfect place!\" Brenna exclaimed. She looked at Roshan. \"Do you think you could get Father Lanzoni to perform the ceremony?\"\n \"I\u0027m sure I could,\" Roshan said, \"but it\u0027s not for us to decide.\"\n \"What church?\" Cara asked. \"And who\u0027s Father Lanzoni?\"\n \"Father Lanzoni is a vampire,\" Roshan answered. \"He was a priest before he was turned.\"\n \"Is he still a priest?\" Vince asked.\n \"I\u0027ve never asked him,\" Roshan said. \"The church is located in a secluded place. It\u0027s where Brenna and I were married.\" He smiled fondly at his wife. \"Of course, we\u0027re not sure it was legal.\"\n Cara looked at Vince. \"What do you think?\"\n \"It\u0027s all right with me. As far as I\u0027m concerned, you became my wife the first time we made love.\"\n Cara\u0027s cheeks bloomed with color. \"Vince!\"\n \"He\u0027s not telling us anything we didn\u0027t already know,\" Brenna said with a laugh. \"You can\u0027t hide something like that.\"\n \"So, we\u0027re agreed then?\" Vince asked.\n \"I think it sounds wonderful.\" Cara glanced at her parents and then at Vince. \"It seems so romantic, to get married in the same place as my parents. Oh! What about your parents? Your family? Are you going to invite them?\"\n \"I thought I would. We need to set a date.\"\n \"How about two weeks from Saturday?\" Cara suggested. \"That\u0027ll give you time to rent a tux and give your parents time to make arrangements for a place to stay while they\u0027re in town.\" She kissed him on the cheek. \"And we\u0027ll be married for Christmas.\"\n \"Works for me,\" Vince said.\n Roshan and Brenna nodded.\n Cara looked up at Vince, a dreamy smile on her face. \"Two weeks,\" she murmured. \"I can\u0027t wait.\"\n Vince called his parents the following night to tell them the good news. As he\u0027d expected, his mother was eager to meet Cara and thrilled that he was finally settling down. His father, ever the practical one, asked if he\u0027d gotten Cara in trouble and that\u0027s why they were getting married in such a rush. With complete confidence, Vince assured his dad that wasn\u0027t the case. When he called his brothers and his sister, they all congratulated him and promised they would be there. One and all, they were a little surprised to learn that the wedding was at night. Vince used the same excuse that Roshan had used with Cara and explained that her parents were allergic to the sun.\n After telling his sister good-bye, Vince rubbed the bridge of his nose, wondering if inviting his family had been such a good idea. They would expect a get-together after the wedding, dinner and cake and champagne.\n Vince glanced at his watch. He\u0027d worry about his folks later. Right now, it was time to meet Cara at the library.\n Cara glanced at her watch, willing the hands to move more quickly. It was eight-thirty and there were only a handful of people in the library. She glanced at the table across the room, her stomach clenching at the sight of the two gray-robed women who sat there, each quietly reading a book. They never looked at her and seemed totally oblivious of her presence, and yet she couldn\u0027t shake the feeling that they were watching her every move. Even when she couldn\u0027t see anyone, she often had the feeling she was being watched, followed. No wonder she often felt nauseated in the morning. Paranoia and her upcoming wedding had her stomach tied in knots.\n It was playing havoc with her menstrual cycle, too. She hadn\u0027t had a period in over a month.\n She told herself to stop worrying. Serafina was gone. The creature she had raised no longer existed.\n Anton had disappeared. Her parents and Vince had searched the city, but Anton was nowhere to be found. There was nothing to fear. Vince would protect her.\n The ladies in gray left the library at eight fifty-five. Vince arrived at the stroke of nine. \"Hey, beautiful, you ready to go?\"\n They drove to what had become \"their spot,\" that quiet, fairy-like place beside the lake. Vince spread a blanket on the ground and they lay side by side, looking up at the stars.\n \"Three more days,\" Cara said. \"Three more days and we\u0027ll be together forever.\"\n \"Forever,\" Vince murmured. Rising on his elbow, he gazed down at her. She was the best thing that had ever happened to him, beautiful, forgiving, understanding, and kindhearted. He couldn\u0027t bear the thought of losing her after fifty or sixty years when he might exist for hundreds or a thousand. What would he do without her?\n She smiled up at him, one hand caressing his cheek. \"What are you thinking about?\"\n \"How much I love you.\"\n \"No more than I love you.\"\n \"Wanna bet?\"\n She laughed softly, the sound the sweetest music he had ever heard.\n \"Cara...\"\n \"What?\" She frowned at his serious expression. \"Is something wrong?\"\n \"I don\u0027t want to lose you, ever.\"\n \"I know.\" She drew his head down and kissed him. \"I don\u0027t want to lose you, either.\"\n \"There\u0027s a way to keep that from happening.\"\n \"You mean by me becoming a vampire, don\u0027t you?\"\n He nodded. \"Have you ever thought about it? Wondered what it would be like?\"\n \"Thought about becoming one?\" She shuddered. \"No. Of course I\u0027ve wondered what it\u0027s like, I mean, how could I not, since I seem to be surrounded by them.\"\n \"It\u0027s not so bad.\" He stroked her cheek. \"Think what it would mean. Centuries together instead of a few short years. You\u0027d never age. We could see the world together.\"\n \"I know what it would mean, and I don\u0027t want it.\" Her gaze searched his. \"You won\u0027t ever force it on me, will you, the way my father did my mother?\"\n \"No.\"\n \"You promise?\"\n He hesitated a moment, then sighed. \"I promise.\"\n \"It doesn\u0027t change anything between us, does it?\"\n \"No, darlin\u0027. Nothing could change that.\"\n Drawing her into his arms, he kissed her, all the while thinking, hoping, that the day would come when she would change her mind, when they could truly be as one.\n Vince\u0027s family, all seventeen of them, arrived the afternoon before the wedding. Since he couldn\u0027t travel from his place to hers while the sun was up, Vince had spent the previous night at Cara\u0027s house. He had been a little uneasy at doing so. Since becoming a vampire, he had always slept alone, aware of the fact that, when the Dark Sleep overtook him, he was vulnerable. He had also been a little apprehensive about how Cara would react, but reasoned it was better to find out now than after they were married.\n When he asked her that morning what it had been like, sleeping with a vampire, she had shrugged.\n \"Come on,\" he said. \"Tell me. Did I look dead?\" He\u0027d always wondered about that, since he\u0027d never seen a vampire at rest and couldn\u0027t watch himself sleeping.\n \"You didn\u0027t look dead, but it was kind of spooky,\" she admitted. \"Once I tried to wake you up, but I couldn\u0027t.\" She canted her head to one side. \"What if someone finds you when you\u0027re asleep? I mean, you\u0027re helpless.\"\n \"Not exactly. I can sense when there\u0027s someone nearby who means to do me harm.\"\n \"Then why didn\u0027t you wake up?\"\n \"Probably because I\u0027m not afraid of you.\"\n Now, as they got ready to meet his parents, he didn\u0027t know which of them was more nervous. He told Cara not to worry, certain that his family would love everything about her. As for himself, he couldn\u0027t stop pacing the floor. How would he explain the fact that he didn\u0027t eat or that he only drank wine?\n A knock at the door told him that the time for worrying was past. They were here.\n Cara smiled as Vince introduced his parents, his brothers and sister, and their spouses and children,\n certain she would never remember all their names. His parents seemed truly glad to meet her, his brothers and sister made her feel as if she was already part of the family.\n Vince watched Cara as she cuddled First Joe\u0027s baby daughter and then Frank\u0027s son. Feeling his gaze, Cara looked up at him and smiled. Looking at her, Vince knew he\u0027d cut off his right arm to be able to father a child, to see her hold a baby of their own in her arms. Regret rose up within him, making him wonder again if she would be better off without him. She was such a warmhearted, generous soul, filled with enough love for a husband and a dozen children-children he could never give her.\n \"Isn\u0027t he darling?\" Cara asked, coming to stand beside him. She took a deep breath. \"Babies always smell so good!\"\n Vince nodded.\n \"Do you want to hold him?\"\n \"Sure.\" Taking the baby from Cara, Vince smiled down at his nephew. \"Hi, Donny,\" he murmured. \"I\u0027m your Uncle Vince.\"\n Cara glanced around her house, which was overflowing with people. \"You have a wonderful family.\"\n \"Yeah.\" Vince frowned as the scent of urine reached his nostrils. \"I think we\u0027d better find Rose. I think Donny needs a diaper change.\"\n A short time later, Roshan and Brenna arrived. After piling into a number of cars, they drove to the restaurant for dinner.\n Seated at a large table in one of the banquet rooms, Vince and Roshan exchanged glances after everyone had ordered.\n \"I\u0027ll take care of it,\" Roshan said, and Vince felt a sudden surge of preternatural power flow through the air.\n Vince glanced around the table, noting that everyone seemed to be having a good time. Brenna and his mother were laughing together like they were old friends and, thanks to Roshan, no one seemed to notice that the vampires at the table never ate a bite.\n It was late when the party broke up. Finally, after a half an hour of hugs and good nights, Vince and Cara were alone.\n \"Do you think they liked me?\" she asked as they drove back to her house.\n Vince reached over and gave her hand a squeeze. \"They loved you. And even if they didn\u0027t, I love you, and that\u0027s what counts.\"\n Cara laughed softly. \"I guess that\u0027s true.\"\n Pulling up in front of her house, he draped his arm across the back of her seat. \"Cara.\"\n \"What?\"\n \"Are you sure this is what you want?\"\n \"What do you mean? You haven\u0027t changed your mind, have you?\"\n \"No, I just want to make sure you know what you\u0027re getting into, and that you won\u0027t be sorry later.\"\n \"What brought this on?\" she asked. \"Haven\u0027t we been through all this before?\"\n \"I know, but I watched you tonight with the kids, and... I just don\u0027t want you to be sorry a few years down the road.\"\n Taking hold of his hand, she drew his arm down around her shoulders. \"I won\u0027t be sorry. I love you as you are, now and for always. I told you before, we can always adopt a baby, and if you\u0027re not comfortable with that, then...\"\n \"Dammit, Cara, I don\u0027t want you making sacrifices on my account.\"\n \"Well, get used to it, because I\u0027m not going anywhere.\"\n \"I\u0027m marrying a tough chick, huh?\"\n \"Darn right, mister,\" she said, punching him in the ribs, \"and don\u0027t you forget it!\"\n As her father had said, the church was located in a secluded glade well off the main highway. Surrounded by tall trees and shrubs, the building looked like it had been transplanted from some medieval setting.\n Moonlight danced across the stained-glass windows. The air was filled with the fragrant scent of evergreens; night birds called to each other; crickets played a serenade. An owl hooted softly in the distance.\n As Cara crossed the threshold with her father, she could easily imagine knights and their ladies passing through the carved oak doors.\n The priest was waiting for them in the vestibule, along with Sarah Beth, who had agreed to be Cara\u0027s matron of honor. Vince had asked his oldest brother to stand up with him.\n \"Father Lanzoni,\" Roshan said, \"it\u0027s good to see you again.\"\n \"And you, my friend,\" the priest replied. \"And this must be your daughter. She is lovely.\"\n Cara felt herself blushing as she murmured, \"Thank you, Father.\"\n While Roshan and the priest spoke, Cara hugged Sarah Beth, who looked very pretty in a tea-length peach silk dress and matching heels.\n \"You look radiant, Cara,\" Sarah Beth said. \"Are you nervous?\"\n \"A little.\"\n Sarah Beth laughed. \"I know, I was, too, but you\u0027ll forget all that when you see Vince. Mary and a couple of the part-time ladies from the library are here.\" Sarah Beth glanced around. \"This is a beautiful place. However did you find it?\"\n \"My parents were married here,\" Cara said.\n \"Oh,\" Sarah Beth exclaimed, \"that\u0027s so romantic!\"\n \"Are we ready?\" the priest asked. \"The groom is waiting.\"\n Cara smiled. \"Very ready.\"\n With a nod, the priest went to take his place at the altar.\n Cara peered through the doors that led into the chapel, noting that the pews and the altar were carved from oak; the carpet was a deep blue. Vince\u0027s family had already arrived. His sister-in-law, Patti Jean, sat at the organ, playing softly. Candlelight filled the chapel with a warm golden glow, lighting the faces of the wooden statues, but Cara had eyes only for Vince. She had always thought him the most handsome of men, but tonight, clad in a tux, his hair neatly combed, he was the most gorgeous thing she had ever seen, as he stood at the altar, waiting for her. The priest stood beside Vince. He was of medium height with wavy black hair going gray at the temples.\n Patti Jean began the wedding march and Sarah Beth started down the aisle. Everyone rose as Cara and her father appeared in the doorway.\n Cara winked at her mother, smiled at Mary and at Sarah Beth\u0027s husband, and then, with butterflies in her stomach, she met Vince\u0027s gaze and felt her heart swell at the love she saw in his beautiful dark eyes.\n \"Who giveth this woman to be married to this man?\"\n \"Her mother and I do,\" Roshan said. Lifting Cara\u0027s hand to his lips, he kissed it; then, after placing her hand in Vince\u0027s, he stepped back to sit beside Brenna.\n \"We are gathered here this evening to join Cara Aideen DeLongpre and Vincent Cordova in the bonds of holy wedlock, an honorable institution ordained of God for the blessing of His children. There is no secret to a happy marriage,\" the priest said, glancing from Cara to Vince. \"You have only to remember to put your loved one first and yourself second, to treat your spouse as you wish to be treated, and to remember how much you love one another on this day. Remember these things, and you will have a life of peace and happiness for as long as God grants you breath.\n \"I will say the words that bind you together, but the true marriage between the two of you must take place within your hearts.\n \"Cara, do you promise to love and cherish Vincent, here present, for as long as you shall live?\"\n Cara squeezed Vince\u0027s hand. \"I do.\"\n \"Vincent, do you promise to love and cherish Cara, here present, for as long as you both shall live?\"\n Vince took a deep breath. \"I do.\"\n \"Then, by the power vested in me, I pronounce you husband and wife. You may kiss your bride.\"\n Vince lifted Cara\u0027s veil. For a moment, he simply looked at her, wanting to remember how she looked on this night, the glow in her eyes, the rapid beating of her heart as she waited for his first kiss as her husband. Murmuring, \"I love you,\" he drew her into his arms and kissed her.\n He might have kissed her for an hour or two if he hadn\u0027t become aware of the quiet cheers and chuckles of his family.\n Cara\u0027s cheeks were flushed when he released her.\n \"And now, at last,\" the priest said, a smile in his voice, \"I give you Mr. and Mrs. Vincent Cordova.\"\n Cara turned to face Vince\u0027s family, relieved to see that everyone was smiling. A faint movement at the\n back of the chapel drew her eye; she felt her insides turn cold as two gray-clad women slipped out the door.\n Cara tugged on Vince\u0027s arm as he walked her down the aisle. \"Did you see them?\"\n \"See who, darlin\u0027?\"\n \"Two women in gray robes. They just went out the door.\"\n \"I didn\u0027t notice. Are they friends of yours?\"\n \"No. I don\u0027t know who they are.\"\n Vince escorted Cara to the limo waiting outside the church, helped her inside, and drew her into his arms.\n \"Why did seeing those women upset you so? Maybe they were nuns.\"\n Cara shook her head. \"No. I\u0027ve seen others dressed like that. The first time was in Serafina\u0027s bookstore, and then again the other night, when I was at the mall, and now here.\" She clutched Vince\u0027s hand. \"I don\u0027t like this.\"\n Vince wrapped his arms around her. \"Take it easy, darlin\u0027, no one\u0027s ever going to hurt you again.\"\n \"I\u0027m frightened.\" She glanced out the rear window. \"Anton is still out there somewhere.\"\n \"Don\u0027t think about that now.\" He kissed her cheek, wondering if he should find her another bodyguard.\n Cara shook off her fears as they turned off the highway. This was her wedding night and she wasn\u0027t going to let Anton or anyone else ruin it for her.\n A short time later, they arrived at her parents\u0027 house, where cake and champagne were waiting.\n Cara was overwhelmed by the love she felt from Vince\u0027s family, from Sarah Beth and Mary, and from her own parents, of course. Because Vince\u0027s family lived so far away, Cara decided to open their wedding presents that night. She sat on the floor, her gown spread around her, while Vince handed her their gifts. They were the usual gifts friends and family give to newlyweds: a toaster, pots and pans, a set of silverware, linens for the bed and for the table, a cookie jar, bath towels and kitchen towels, glassware, and a set of dishes. Later, her father took her and Vince aside and gave them a check for a hundred thousand dollars \"to buy whatever else the two of you might need,\" he said, \"or to put a down payment on a little house of your own.\"\n \"Dad, this is way too much,\" Cara said.\n \"I told you I was a rich man,\" her father reminded her.\n \"I know, but...\" She looked at Vince.\n \"She\u0027s right,\" Vince said. \"It\u0027s way too much.\"\n Roshan grunted softly. \"What else am I going to do with my money? If I were a mortal man, I\u0027d leave it in my will, but since I\u0027m hoping to hang around for a good long while, I want Cara to have it now.\"\n Cara threw her arms around her father. \"Thank you, Dad!\"\n Vince added his thanks to Cara\u0027s, then the two of them went to mingle with their guests. Later, they cut the cake: Vince offered Cara a bite, choked back a gag when she fed him a small piece, which he didn\u0027t\n swallow. When no one was looking, he spit it into his handkerchief.\n While the caterer served the cake, Vince and Cara enjoyed their first dance as man and wife.\n \"Are you having a good time?\" he asked.\n \"Yes! This is the happiest night of my life.\"\n \"Mine, too.\" Pulling her close, he rained kisses on her cheeks, her eyelids, and the tip of her nose. \"I love you, wife.\"\n \"And I love you, husband.\"\n His hands slid slowly up and down her back, drawing her body closer to his, letting her feel how much he loved her, wanted her, needed her.\n Cara blew out a long shuddering sigh as her body responded to his. \"Later,\" she whispered.\n \"Not too much later,\" he said with a growl.\n As much as he wanted to spend what time he could with his family, he wanted to be alone with Cara more, so after they listened to toasts from their parents and Vince\u0027s brothers, Vince took Cara by the hand and they slipped out the back door when no one was looking, then ran around to the front of the house where the limo waited.\n Vince opened the back door for Cara, then climbed in beside her. As soon as he closed the door, he drew her into his arms. \"Hey, Mrs. Cordova.\"\n \"Hey, yourself, Mr. Cordova.\" She glanced out the window as the limo pulled away from the house.\n \"Does the driver know where to go?\"\n \"Yeah, I told him before we left the church.\"\n With a little sigh of contentment, Cara snuggled against her husband. Husband. The word made her smile.\n \"Did I tell you how beautiful you look tonight?\" Vince asked.\n \"No. Do you like my dress?\"\n \"It\u0027s beautiful, too, and you make it more so.\" Indeed, he had never seen her looking lovelier than she had when walking down the aisle. Her gown was long and simple, with a round neck, long, fitted sleeves, and a slim skirt that showed off her figure perfectly, but it was the look of love in her eyes, the shy smile that was just for him, that had gone straight to his heart.\n \"We never talked about going anywhere for a honeymoon,\" he said. \"Is there anywhere you want to go?\"\n \"Just to bed,\" she murmured, lifting her face for his kiss. \"With you.\" \n","sourceLink":"https://allnovel.net/night-s-touch-children-of-the-night-2/page-39.html","bookId":2300,"book":{"id":2300,"title":"Night\u0027s Touch (Children of The Night #2)","description":"Storyline: \n Night\u0027s Touch (Children of The Night #2) \n One kiss can seal your fate... \n Cara DeLongpre wandered into the mysterious Nocturne club looking for a fleeting diversion from her sheltered life. Instead she found a dark, seductive stranger whose touch entices her beyond the safety she\u0027s always known and into a heady carnal bliss. \n A year ago, Vincent Cordova believed that vampires existed only in bad movies and bogeyman stories. That was before a chance encounter left him with unimaginable powers, a hellish thirst, and an aching loneliness he\u0027s sure will never end—until the night he meets Cara DeLongpre. Cara\u0027s beauty and bewitching innocence call to his mind, his heart—his blood. For Vincent senses the Dark Gift shared by Cara\u0027s parents, and the lurking threat from an ancient and powerful foe. And he knows that the only thing more dangerous than the enemy waiting to seek its vengeance is the secret carried by those Cara trusts the most.\n \n","cover":"https://allnovel.net/images/night-s-touch-children-of-the-night-2.jpg","author":"Amanda Ashley","type":"Mystery","source":"allnovel","link":"https://allnovel.net/night-s-touch-children-of-the-night-2.html","creation":"Oct 5, 2019 8:58:34 AM","modification":"Oct 5, 2019 6:04:51 PM"}}
