{"id":35944,"no":13,"title":"CHAPTER XII SHOOTING THE RAPIDS","content":"For a long time the boys remained on the bridge, fascinated by the scene presented by the illumination of the American and Canadian cities and the vari-coloured lights on the boats, heightened by the occasional shout of a skipper or mate as one of his crew failed to handle a line properly. Of the chief officers on the Admiral, the second mate alone was on the bridge. “Do you think we shall get through tonight?” inquired Ted, eager for anybody’s opinion. “We may and we may not,” returned Hansel, non-committally. “Captain Perkins said we wouldn’t.” “Skippers don’t know all there is to know.” “Then let’s stay up all night, Phil. I wouldn’t miss seeing the Admiral locked through the canal for anything.” As his brother shared Ted’s interest, the boys brought rocking-chairs and blankets from their cabin and made themselves comfortable on the bridge. The novelty and excitement of the night scene, however, failed to withstand the gentle, sleep-bearing air, and when Captain Perkins emerged from his cabin about three o’clock, to see whether or not it was worth while to move the Admiral closer to the canal, he found them slumbering. “Better go to your beds,” he said, as the young homesteaders awoke in response to his shaking. “But we want to see you lock through,” explained Phil, drowsily. “I told you we’d be lucky if we got into Superior before noon, didn’t I?” “Yes,” assented the boys. “Then why are you sitting up?” “Mr. Hansen,” began Ted. “Bother Hansen! He’s second mate and I’m captain, what?” Again the young homesteaders assented. “Well, if he’d had as much experience as I have, he’d be sailing a boat of his own instead of being my second mate. But if you want to sit up, all right.” “You’ll have us called if you do move?” appealed Ted. “Sure thing.” “Bed’s certainly more comfortable than this chair, Phil;” and picking up their things, the boys made their way below to their cabin. Scarcely had they gone to sleep again, it seemed to them, than they heard the voice of the first mate calling: “We’re moving up to the canal. If you don’t look sharp, you’ll miss your chance to shoot the rapids.” Expressing their thanks, Phil and Ted almost jumped into their clothes and were soon on the bridge, staring in open-mouthed wonder all about them. To the right they beheld the quaint buildings of the Canadian Soo and the monster pulp works, but the foam of the rapids, as the water raced down the twenty-foot fall from Lake Superior, almost a mile to the level of Lake Huron, quickly claimed and long kept their attention. In front of them were the two American canals, one now useless because of the increased size of the lake carriers, with their locks and the massive granite power-house, while work trains and dredges puffed and snorted and a thousand men worked to remove the dirt from the course of still another canal which was to have even longer locks. And back of the canals, on the left, extended the steadily growing city of the American Sault Ste. Marie. Far in the distance, to the right, they could see the Canadian canal, yet not a boat was waiting to use it. But it was the rapids at which they were looking when the watchman, in passing, whispered: “Just keep your eye on the skipper if you want to see some boat jockeying.” Even as the words were uttered, there sounded a series of ear-splitting toots, seemingly abreast of them. In response, the Admiral emitted a single, strident blast, Captain Perkins snapped some orders to his wheelsman, and the huge ore carrier swung on a diagonal course, making, under full speed, for a vacant place at the dock adjoining the canal abutments. The man?uvre successfully blocked other carriers, on both sides of the Admiral, which had sought to reach the coveted berth before her, and they slackened speed when their skippers realized they had not been able to steal a march on Captain Perkins. “Pretty work,” grinned the mate, as he turned to his superior, “but hadn’t you better check? Some inspector may see us and fine you.” In reply, the skipper pressed a button and the speed of the boat fell away, her momentum carrying her to the dock, where she was made fast, pending her turn to lock through. “Come ashore with me and we’ll see what your chances are for a trip down the rapids,” called the captain, stepping from the bridge to the canal wall. Quickly the boys followed, and soon they were in the canal-master’s room at the power-house. “Some day I’ll have to fine you, Perkins, for jockeying for dock position,” chuckled the master, as he shook the hand of the Admiral’s skipper. “I was watching and I thought those other fellows had caught you napping for once.” Captain Perkins’ only reply was a grin, as he asked: “How long before we can go up?” “Just look over on Superior,” returned the canal-master. And as they all turned, the boys beheld more than a score of boats waiting to lock through. “You’re not going to hold me until all those fellows are down?” asked the Admiral’s skipper. “I ought to, but seeing it’s you, I’ll let you up after I’ve passed half of them.” “That means two hours, anyhow.” “More likely three; they are all big ones, so we can only take one at a time.” “H’m! I suppose I must be thankful you don’t hold me for the twenty. Seen Afraid-of-his-wife this morning? I want him to take these friends of mine down the rapids.” “No—hold on, here he comes,” added the canal-master, peering from his window toward the American side. “We’re in luck all around,” smiled the skipper, as, having thanked the master, he led the boys along the park-like reservation surrounding the canals. His companions gave him no heed, however, their attention being engrossed by the tall, bronze-faced man, clad in trousers and coat fully a dozen sizes too big for him, who was approaching. “Howde, chief,” greeted the skipper. “I want you to take these boys down the rapids.” “Five dollar,” grunted the redskin, after eying his prospective passengers for several moments. “If I were chief of police, I’d arrest you for a robber,” returned Captain Perkins. “You’ll get two dollars.” “All right.” “If you capsize, you won’t get a cent and I’ll take it out of your hide.” A grin of understanding was the Indian’s reply, and, nodding to the boys, he started toward the Superior end of the canal. “Meet you here at the power-house,” said the skipper, as Phil and Ted hurried after the redman. Arrived at an inlet on the lake, the Indian shoved a twenty-foot birch-bark canoe off the beach and held it while the boys got in. “You here,” he grunted, motioning Ted to a seat in the bow. “You here;” and he put Phil amidships. “No move. Sit still. Heap easy tip over. No move, un’erstan’?” “We do,” chorused his passengers. Taking his paddle, Afraid-of-his-wife kneeled down in the stern, and with a few powerful strokes sent the canoe out onto the lake and then turned it toward the foaming, roaring rapids. As the frail craft was caught in the current and raced toward the raging torrent, the boys instinctively grabbed the gunwales. “No move!” cried the Indian. Ere his passengers could answer, the canoe leaped over the fall, into the seething waters of the rapids. With tense lips and wide eyes the boys gazed at the merciless, sharp-pointed rocks whose presence lashed the river into foam. So many were there that it seemed impossible the canoe could be guided in and out among them, and when a shower of spray drenched them, after a long leap, they screamed. “No move!” shrieked the Indian, his shrill command audible even above the roar of the rapids. As they leaped, seemingly from white crest to white crest without mishap, the courage of the young passengers returned, and looking back, they beheld the redman, kneeling on a crossbar, his face stolid, his eyes keenly alert, only the play of his splendid arm muscles, as he deftly turned his paddle, indicating that he was alive. Confidence established in his ability, Phil and Ted yelled in pure delight as they raced along at express-train speed, and when, with a final leap, they shot into calm water, their one regret was that the rapids were not longer.","sourceLink":"http://novel.tingroom.com/duanpian/2777/76866.html","bookId":1325,"book":{"id":1325,"title":"Hiking Westward","description":"简介： HIKING WESTWARD is really a chapter taken out of the lives of two wide-awake American boys who go West to make a home for their mother. Although ignorant of the conditions of frontier life, Phil and Ted Porter meet them manfully. They face their diff...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2777","creation":"Aug 1, 2019 12:24:51 AM","modification":"Aug 1, 2019 12:24:51 AM"}}
