{"id":35934,"no":3,"title":"CHAPTER II TEMPTATION","content":"Sallie’s remark about her brother’s absorption in his nine might have been applied with equal truth to every boy in the Parker School. When any of them met, the playing of the team was the one topic of conversation, especially since, under Phil’s leadership, there was the possibility of the interscholastic championship coming to Parker School, an honour which had not been attained for almost ten years. It was but natural, therefore, that, with the captain of the team as their companion, the boys should deluge him with questions, and they did. “Honestly now, Phil, do you think Parker can beat Mercer Academy?” asked one of them. “If our pitchers work well, we ought to.” “If our pitchers work well,” repeated another, in amazement. “What’s the matter with you, Phil? Aren’t you the best pitcher in the school league, according to the coaches? Why, you did the most of the work last season and you’ve done all of it, practically, this year. And then you say if our pitchers go well we may win.” “What’s up, anyhow?” demanded several of the others, astounded at the words of their captain. “There’s going to be a change in the team,” replied Phil, quietly. This statement elicited a veritable avalanche of comment and questions, but to them all the captain of the team would make no reply except to tell them to wait and see. This answer was so unsatisfactory, serving as it did only to whet their curiosity the more, that finally Phil broke away from his companions and hurried ahead to join the girls. Yet no sooner had he caught up with them than he wished he had remained behind. “Hello, Farmer Phil!” cried several of them, as they caught sight of the popular pitcher. “How’s crops? What’s the latest quotation on wheat?” For the moment he thought to rebuke his sisters for disclosing the plan which he had intended to keep secret, at least until he should announce it on the morrow to his team-mates. But Sallie and Margie wisely kept on the side of their companions farthest from him, and so riotous did the badinage become that Phil soon realized that anything he might say would only make the matter worse. Yet the glance he threw at his sisters was eloquent. “Oh, you needn’t blame Marg or Sallie,” exclaimed one of the others. “I heard part of what you said before I entered the dining-room. So I bullied Marg into supplying the missing links.” By this time the rest of the fellows had caught up, and the group quickly divided into couples, all of them talking excitedly over the surprising bits of news. As they proceeded toward the boathouse, Phil was seemingly unconscious that he was walking beside the girl who had sought to appease his wrath against his sisters, and so absorbed was he in his own thoughts that it was not until she spoke that he was aware of her presence. “I think it is perfectly splendid,” she exclaimed, tenderly. “What?” demanded Phil, almost savagely. “Why, your giving up the captaincy of the school team when you are certain to win the championship, just to help your mother.” “Splendid nonsense! I should be worse than a cad if I didn’t.” “But you could wait about going out West until after school closes, you know, and then you wouldn’t sacrifice the honour of bringing the championship to Parker.” “You mustn’t say such a thing,” returned the boy, in a tense voice, as he heard with revulsion the very idea expressed in cold words which had been persistently surging through his mind. “Why not, pray? I am as keen to have Parker land the championship under your captaincy as you are yourself, and what difference would a few weeks—it’s only seven—make to your mother? Besides—” “Don’t, Helen, don’t,” pleaded Phil. “You know perfectly well how I feel about the team. But what would you, or any one else, think of me if I should let my selfish desire for school honours interfere with my mother’s health?” “Yet it would only be for seven weeks. Besides, Blair simply said she needed a rest, but he didn’t say an immediate rest or—” “It makes no difference if it were only for seven minutes, Helen, I should be ashamed of myself all the rest of my life if I let my own feelings weigh against Momsy’s health. Just think of all that she has done for us. Do you suppose she has ever thought of herself when anything for our benefit was at stake? It would have been better for her if she only had—I’ve been a selfish prig not to see before that she was killing herself. Besides, you can be certain she would not have told us that Dr. Blair said she must have a rest if he had not told her a great deal more. So if it is in my power, I am going to do everything I can to make her well and show her that I appreciate all she has put up with for me and the others.” “Spoken like a man, Phil,” exclaimed a voice so close to the young people that they jumped in surprise; for so absorbed had they been in their conversation that they had not noticed the tall figure striding along behind them. “Why, Dr. Blair, how you frightened me!” gasped the girl, confused and angry to think her words urging Phil to put the success of his team above all else had been overheard. The physician, however, gave no heed to the remark, keeping his eyes fixed upon her companion, as he said: “I really owe you an apology for playing the eavesdropper, Phil. But just as I caught up with you, I could not but hear Miss Howell’s pleading, and, as the matter had also occurred to me, I was unable to refrain from listening to your reply. I am on my way to talk with your mother now, and I felt I was justified because your attitude could not but have an important bearing upon my advice to her. What it is that you propose to do I don’t know, and it really doesn’t matter so long as you intend to do it at once. Your mother has worked till she is on the verge of a breakdown to give you young people a comfortable and happy home. As a matter of fact, I told her this afternoon that if she gave another week to her work I should be able to do nothing for her. So you see your decision not to await the closing of school is most timely.” The words as to the seriousness of his mother’s condition were like blows to Phil, and it was several minutes before he felt sufficiently sure of himself to ask: “W-what is the trouble with Momsy, Dr. Blair?” “Tuberculosis, and in such a much farther advanced stage than I suspected. With plenty of fresh air and outdoor life, however, I shall be able to check it, I believe. Only she must be spared all worry. Again I wish to tell you that I am proud to know you appreciate all your mother has done for you.” With a friendly pat on the boy’s shoulder. Dr. Blair vanished in the dusk as suddenly as he had appeared, leaving the boy and girl standing, abashed by the words he had spoken. Impulsively Helen slipped her hand through her companion’s arm and drew him after the rest of the canoeing party, as she whispered earnestly: “Forgive me, Phil.”","sourceLink":"http://novel.tingroom.com/duanpian/2777/76856.html","bookId":1325,"book":{"id":1325,"title":"Hiking Westward","description":"简介： HIKING WESTWARD is really a chapter taken out of the lives of two wide-awake American boys who go West to make a home for their mother. Although ignorant of the conditions of frontier life, Phil and Ted Porter meet them manfully. They face their diff...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2777","creation":"Aug 1, 2019 12:24:51 AM","modification":"Aug 1, 2019 12:24:51 AM"}}
