{"id":76890,"no":36,"title":"Page 36","content":"\"We\u0027re attacking England?\" Gideon asked, astonished. \"No,\" Brodick answered. \"Though the thought of it warms my heart.\" He leaned back and then told Gideon what had happened and how Gillian had saved Alec Maitland. Gideon had trouble taking it all in. When Brodick finished, the soldier, shaking his head, whispered, \"Dear God, it\u0027s a miracle Alec survived.\" \"His miracle was Gillian,\" Brodick said. \"If it were not for her, Alec would be dead.\" \"And no one would have known there was a traitor in our midst,\" Ramsey pointed out. \"Who would do such a thing?\" Gideon asked the question, then pounded his fist on the tabletop as he offered an answer. \"It must be a MacPherson because they are the only ones who would gain in this. There are many who would cheer your death, Laird, and all of them are under Proster\u0027s thumb. Though he\u0027s little more than a boy, he has gained their loyalty. They are rebels, pure and simple.\" \"My mind is not so set as yours, and I will be certain before I act,\" Ramsey said. He raised his hand for silence as the squire came hurrying into the hall with a platter of bread and cheese. After the boy placed the food on the table, Ramsey ordered him to wait in the kitchens and then resumed the discussion. \"We must help Gillian find her sister. I have given her my word.\" \"It\u0027s a certainty that the woman is a MacPherson?\" Gideon asked, rubbing his jaw as he considered the matter. \"Yes,\" Ramsey answered. \"Her name\u0027s Christen, and she\u0027s a few years older than Gillian.\" \"The family surely changed her name in order to protect her,\" Brodick interjected. \"Still, I\u0027m hopeful that Brisbane and Otis will know who she is. Nothing escapes their notice.\" \"I might be able to help,\" Gideon said. \"My father also has a strong memory and knows most of the MacPhersons. He hates them, but he\u0027s civil to them,\" he added. \"His sister married a MacPherson. She\u0027s dead now, but she was ill-treated by her husband, and my father will never forget that. Still, he would help you, Laird, if he can. If a family took a child in, then my father would most likely know about it. Now that he\u0027s feeling better, he detests being confined and this puzzle will help distract him. With your permission, Laird, I\u0027ll go to him as soon as possible.\" \"Gideon\u0027s father broke his leg in a bad fall,\" Ramsey explained to Brodick and Dylan. \"It\u0027s good news to hear that he\u0027s going to mend. For a time, we thought he wasn\u0027t going to make it, and Gideon rushed home to be by his side.\" \"If he cannot walk again, he would rather die,\" Gideon commented. \"But now there is a glimmer of hope. If you don\u0027t need me for a couple of days, I could leave now. I could be halfway there before darkness falls.\" \"Yes,\" Ramsey agreed. \"The sooner you speak to your father, the better. Brisbane and Otis will take days worrying about their duty to the MacPhersons, and you could be back with the information we need before those old men make up their minds to tell us the truth.\" \"Christen might come forward on her own,\" Dylan suggested. Gideon started to stand up, then changed his mind. \"Laird, you said that we\u0027ll be riding into England, but where exactly will we be going?\" \"We don\u0027t know… yet,\" Ramsey admitted. \"Gillian hasn\u0027t given us the names of the Englishmen who held Alec captive and made the bargain with the traitor.\" Perplexed, Gideon asked, \"Why hasn\u0027t she told you, Laird?\" Brodick answered. \"She has it in her mind that if she tells us who the men are, then we\u0027ll attack, leaving her uncle vulnerable. She also worries that I\u0027ll force her to stay here.\" \"But that is what you\u0027re going to do, isn\u0027t it?\" Ramsey asked. \"You surely won\u0027t allow her to return to England.\" \"It\u0027s complicated,\" Brodick said. \"Gillian\u0027s headstrong.\" \"Which is why you were drawn to her,\" Ramsey pointed out. Brodick shook his head. \"How can I demand her trust knowing all the while in my heart that I\u0027m going to betray that trust? Hell, I don\u0027t know what to do. I don\u0027t like the idea of breaking my word to her, but the thought of her in such danger is unacceptable.\" \"You\u0027re going to have to work this out with her and quickly. We need the names,\" Ramsey said. Gideon stood and bowed to his laird. \"With your permission, I\u0027ll take my leave now.\" \"Give your father my good wishes for a full recovery.\" \"I will,\" he promised. He started toward the entrance, then turned. \"Laird, with all this news I forgot to ask…\" \"Yes?\" \"Do you still want the men to gather in the courtyard tonight? I\u0027ll have Anthony give the order,\" he hastily added. \"But if you aren\u0027t going to announce your decision to marry Meggan, then may I ask why you wish to address your men? Perhaps I should stay.\" Ramsey realized then that an important detail had been left out of the telling. \"We have an advantage in finding the traitor,\" he said. \"Gillian saw the man as he was riding toward her estates.\" \"She saw him?\" Gideon asked, astonished. \"Aye, she saw the bastard,\" Dylan confirmed. \"From the description of where she was hiding, I\u0027d say she was close enough to spit in his face, but the fool never knew she was there.\" \"And that\u0027s why I want every man to come to the courtyard. Gillian will look at each one of them, and if the man is there, she\u0027ll spot him,\" Ramsey said. Gideon shook his head. \"And she\u0027ll recognize the traitor for a certainty?\" \"Yes,\" Ramsey said. \"Then she must be protected at all costs. If this man knows she can point him out, he\u0027ll surely try to silence her before—\" \"She\u0027s well protected,\" Dylan announced. \"We Buchanans aren\u0027t going to let anything happen to her. She belongs to us now.\" Gideon blinked. \"Lady Gillian belongs to the Buchanans?\" he asked Ramsey, confused by Dylan\u0027s boast. His laird nodded. \"Aye, she does. She just doesn\u0027t know it yet.\" Chapter Twenty Ramsey\u0027s audience with Bridgid KirkConnell\u0027s mother, Leah, left a bitter taste in his mouth. When the woman had walked into the great hall, Ramsey\u0027s first impression of her was positive. Though in her middle years, Leah was still a striking woman. Aye, time had been kind to her. After listening to what she had to say, Ramsey\u0027s opinion of her radically changed, and by the time she left the hall, the sight of her sickened him. He and Brodick had gone to the lake to wash and change into clean clothes, but as soon as he\u0027d heard Leah\u0027s petition regarding her daughter, Ramsey felt the sudden need to wash again. Leah\u0027s perfidy blasphemed motherhood. Brodick returned to the hall a few minutes after the encounter frowning, as was his usual inclination, because Gillian was still talking to Brisbane and Otis. He was anxious to hear what news they\u0027d given her. There was also the fact that he wanted her by his side, an admission that made his frown intensify, for even he realized he was acting like an infatuated boy. He found Ramsey slumped in a chair, his head bowed as though in prayer. When his friend looked up and Brodick saw his sour expression, he asked, \"What ails you? You look like you\u0027ve swallowed lye.\" \"I feel as though I have,\" Ramsey admitted. \"I just finished an audience with Bridgid KirkConnell\u0027s mother, Leah.\" \"I take it the meeting didn\u0027t go well.\" \"The woman is foul,\" Ramsey muttered. \"How in God\u0027s name am I going to tell Bridgid that her own mother…\" \"What?\" He sighed. \"Leah\u0027s jealous of her daughter,\" he explained, shaking his head over such a sin. \"Did she say as much?\" \"No, but it was very apparent that\u0027s the root of her trouble. Leah is newly married, and she doesn\u0027t like the way her husband looks at Bridgid. She thinks he lusts after her daughter, and she wants Bridgid out of her house.\" \"Maybe she\u0027s thinking to protect Bridgid,\" Brodick suggested. Ramsey shook his head again. \"No, her daughter\u0027s welfare is the last of her concerns. She went on and on about how old she looks when she\u0027s standing near Bridgid.\" \"For God\u0027s sake,\" Brodick muttered. \"Why must you deal with such petty matters?\" \"Like you, I, too, must look out for all my clan, and Bridgid is part of my family. Stay and meet her,\" he urged. \"Then you\u0027ll understand why I\u0027m so sickened by her mother\u0027s behavior.\" \"Does Bridgid know her mother wants her to leave her home?\" \"I don\u0027t know,\" he answered. \"Leah sent her to her sister to stay for a spell, using the excuse that Bridgid\u0027s aunt needed help with the new baby.\" \"Then maybe she can return to the aunt\u0027s house.\" \"It was only a temporary solution,\" Ramsey explained. \"The aunt has five children and lives in a small cottage. There simply isn\u0027t room for Bridgid.\" \"Then marriage is the only answer.\" \"That\u0027s the problem,\" Ramsey said, and then quickly explained about the promise given to Bridgid\u0027s father. \"Do you mean to tell me that Bridgid decides who she marries?\" \"Unless I break that promise.\" \"I know you well,\" Brodick said. \"You won\u0027t do any such thing.\" \"So what\u0027s the answer to this problem?\" he asked. \"Got any ideas?\" Brodick thought about it for a moment, then said, \"Iain could find a place for her.\" \"She belongs here. This is her home,\" he argued. \"She would think she was being banished.\" \"She would adjust.\" \"I will not hurt her tender feelings. She\u0027s done nothing wrong.\" Brodick studied Ramsey for several seconds and then said, \"You care for this woman, don\u0027t you?\" \"Of course I care. She\u0027s part of my clan.\" Brodick smiled. \"Then why don\u0027t you marry her?\" Ramsey stood up and began to pace in front of the hearth. \"Because she\u0027s in the Sinclair clan,\" he explained. \"I know my duty. If I am to make this union work between the MacPhersons and the Sinclairs, then I should marry Meggan MacPherson. It makes perfect sense, doesn\u0027t it? I get what I want out of the bargain. The MacPherson land is a dowry I cannot turn down.\" \"You\u0027ve always been a practical man,\" Brodick remarked. \"And so were you,\" he countered, \"until Gillian entered your life.\" Brodick agreed with a nod. \"I never saw it coming.\" Because Brodick sounded disgusted with himself, Ramsey laughed. \"When exactly did you know…\" Brodick shrugged to cover his discomfort. \"When Annie Drummond poured liquid fire on Gillian\u0027s open cuts. I held her hand down so that she couldn\u0027t move during the atrocious treatment. She never made a sound.\" \"Ah, so it was her bravery that captivated you.\" \"No, it was the way she glared at me,\" he admitted with a laugh. \"Honest to God, she looked like she wanted to kill me for making her suffer such an indignity. How could I not become infatuated with such a strong, stubborn woman?\" Anthony put an end to the discussion when he announced that Bridgid KirkConnell was waiting to speak to her laird. A moment later, Bridgid came inside. The sight of her smile lifted Ramsey\u0027s spirits, though he was amazed that she would have anything to smile about. \"Good day, Laird,\" she called out as she walked forward and curtsied. \"And good day to you, Laird Buchanan.\" She couldn\u0027t quite look Brodick in the eye when she greeted him, as she, too, had heard all the rumors about him and was therefore wary. Brodick could see that he scared her, but he was impressed that, even so, she moved close to him and curtsied once again. \"Isn\u0027t it a fine day?\" she asked in an effort to ward off the topic she knew Ramsey wanted to discuss. \"And what\u0027s so fine about it?\" Ramsey asked. \"Oh, everything, Laird. The sun is bright and the breeze is warm. It\u0027s a very fine day.\" \"Bridgid, I just spoke to your mother…\" She lowered her eyes and clasped her hands behind her back. \"Is that so?\" \"Yes,\" he agreed. \"And has she convinced you to break the sacred promise made to my father?\" She deliberately used the word \"sacred,\" Ramsey knew, to make him feel guilty if he had indeed done such a thing. \"No, she has not convinced me to break the promise given to your father.\" Bridgid was once again smiling. \"Thank you, Laird, but I have taken up too much of your time. With your permission, I\u0027ll leave you now,\" she added. She was halfway out of the hall before Ramsey stopped her. \"You don\u0027t have my permission, Bridgid. Come back here. There is an important matter to talk about.\" Brodick heard her sigh before she turned around. She obviously knew what the topic was and had hoped to avoid it. She took her time returning to her laird. And then she simply stood in front of him, looked him in the eye, and waited for him to speak. \"There has been a request for your hand in marriage.\" \"I graciously decline.\" \"You don\u0027t even know the name of the man who wants to marry you. You cannot decline yet.\" \"I\u0027m sorry,\" she said, though she didn\u0027t sound the least contrite. \"Who is this man?\" \"His name is Matthias,\" Ramsey said. \"He\u0027s a MacPherson, and I\u0027ll admit I don\u0027t know much about him. However, I\u0027m certain that if you agree, he will treat you kindly.\" He waited a full minute for her to respond, but Bridgid remained stubbornly silent. \"Well?\" he demanded. \"What say you?\" \"May I decline now?\" \"For the love of… Do you know this man?\" \"Yes, I\u0027ve met him, Laird.\" \"Can you not find anything acceptable about him?\" \"Oh, I\u0027m sure he has many wonderful qualities.\" \"Well then?\" \"I won\u0027t have him.\" \"Why not?\" \"Laird, are you aware you\u0027re shouting at me?\" Brodick coughed to cover his laughter. Ramsey shot him a dark look before turning to Bridgid again. He watched her brush an errant lock of hair over her shoulder in a dainty feminine gesture, and for a second he lost his train of thought.","sourceLink":"https://allnovel.net/ransom-highlands-lairds-2/page-36.html","bookId":1843,"book":{"id":1843,"title":"Ransom (Highlands\u0027 Lairds #2)","description":"Storyline: As a child, Gillian lost her sister and saw her father killed by Baron Alford, a man driven by greed, determined to obtain a jewelled box belonging to King John. Years later, while searching for her sister, Gillian enlists the aid of Scottish Lairds Ramsey Sinclair and Brodick Buchanan, as well as a new friend, Brigid Kirk Connel. The four unite to face the terrifying and powerful baron who has stolen Gillian\u0027s home. But in the process of regaining her heritage, will Gillian lose her heart?","cover":"https://allnovel.net/images/ransom-highlands-lairds-2.jpg","author":"Julie Garwood","type":"Historical","source":"allnovel","link":"https://allnovel.net/ransom-highlands-lairds-2.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 3:31:38 PM"}}
