{"id":76894,"no":40,"title":"Page 40","content":"Trained to be the aggressor, he couldn\u0027t let her have the upper hand. Growling low in his throat, his strong arms lifted her up as his mouth slanted over hers again and again, his tongue sweeping inside to duel with hers, his control damn near shattered when she made that seductive sound of pleasure. He couldn\u0027t get enough of her. His hands stroked her back, then moved lower to lift her up against his groin.\n They were both panting for breath when she ended the kiss. She clung to him, her faced pressed into his neck as she placed fervent kisses along the column of his throat.\n \"Don\u0027t let go of me,\" she whispered, knowing that if he did, she\u0027d collapse. The kiss had temporarily robbed her of her strength, and yet all she could think about was kissing him again. She was thoroughly wanton and didn\u0027t care a twit.\n \"Never,\" he answered. \"I\u0027ll never let go of you.\"\n He slowly eased her down until her feet were touching the floor again, but he continued to hold her in his arms as he nuzzled the side of her neck. Her sigh was filled with longing.\n Reluctant to let go of him, she lay her head down on his shoulder and closed her eyes. Her hand rested over his heart, and she could feel the rapid beat.\n \"I did make your heart race, didn\u0027t I?\"\n \"Yes,\" he admitted. \"You\u0027re a temptress, Gillian. You cannot kiss me like that and expect to go on your merry way.\"\n \"What would you have me do?\"\n God, she was innocent. \"I\u0027ll explain tonight,\" he promised.\n He slowly pulled her arms away from him and reminded her that she was going to the lake with Bridgid.\n She had turned toward the doors when he stopped her. \"Dylan told me he thought some of the Sinclair soldiers were bothering you.\"\n \"There weren\u0027t any men with Bridgid and me,\" she told him once again. \"But if there had been and they had been bothering me, I would have handled them.\"\n \"No, you would not,\" he insisted. \"You would tell me who they were and I would handle them.\"\n \"And what would you do?\"\n He didn\u0027t have to think about his answer long at all. \"If any man ever touched you, I would kill him.\"\n The glint in his eyes and the set of his jaw told her he was serious. He suddenly looked quite dangerous. She wasn\u0027t the least afraid and she wasn\u0027t about to back down.\n \"You cannot kill—\"\n He wouldn\u0027t let her finish. \"It\u0027s the Buchanan way,\" he said emphatically. \"You belong to me, and I would not allow any other man to touch you. Now enough of this. There\u0027s something I\u0027ve been meaning to tell you, and now is just as good a time as any.\"\n She waited a long minute for him to continue before she prodded him. \"Yes?\"\n \"We do things different here.\"\n \"We?\"\n \"The Buchanans,\" he qualified. \"When we want something, we take it.\"\n \"That doesn\u0027t seem right.\"\n \"It doesn\u0027t matter if it seems right or not. It\u0027s what we do.\"\n \"But it does matter. You could get into trouble with the Church if you take something that doesn\u0027t belong to you.\"\n \"I\u0027m not worried about the Church.\"\n \"You should be,\" she countered.\n Gritting his teeth, he said, \"Don\u0027t argue with me.\"\n \"I\u0027m not arguing. I\u0027m simply stating fact. You needn\u0027t get surly.\"\n He gripped her shoulders and hauled her close. \"I\u0027m starting over. I\u0027m going to explain, and I want you to follow along.\"\n \"Are you insulting me?\"\n \"No, sweetheart. Just listen.\"\n She was so surprised by the endearment, her eyes got misty. \"All right,\" she whispered, \"I\u0027ll listen. What is it you want to explain?\"\n \"You told me you loved me. You did admit it, didn\u0027t you? You can\u0027t take the words back.\"\n His vulnerability was showing, and she immediately sought to assure him. \"I don\u0027t want to take the words back. I do love you.\"\n He relaxed his grip on her arms. \"Tonight…\"\n \"Yes?\"\n \"I… that is, we… ah, hell.\"\n \"Brodick, what in heaven\u0027s name is wrong with you?\"\n \"You,\" he muttered. \"You\u0027re what\u0027s wrong with me.\"\n She pushed his hands away. \"Your moods change with the wind. Now, if you\u0027ll excuse me, I have more important things to do than to stand here and listen to you grumble at me.\" She swung around, pulled the door open with both hands, and marched outside.\n He gave up. He knew he\u0027d made a muck of things, but he figured everything would work tonight. Gillian was an astute woman. Surely by the time he\u0027d taken her clothes off her and carried her to bed, she\u0027d have worked it all out in her mind. If not, then he\u0027d tell her.\n Ramsey walked inside, saw Brodick, and immediately guessed what had happened. \"You still didn\u0027t tell her, did you?\"\n \"No, but God knows I tried.\"\n \"It\u0027s simple enough, Brodick.\"\n \"No, it isn\u0027t.\"\n \"How about, \u0027Gillian, you\u0027re married\u0027? How complicated is that?\"\n \"I\u0027m telling you, I tried, damn it. If you think it\u0027s so easy, you tell her.\"\n Ramsey laughed. \"By God, you\u0027re afraid to tell her, aren\u0027t you?\"\n \"Of course not.\"\n \"Yes, you are. What do you think she\u0027ll do?\"\n Brodick quit trying to bluster his way through the conversation. \"Yes, I am afraid. She\u0027ll run. She\u0027ll panic, and then she\u0027ll try to run. Damn it, I tricked her, and I shouldn\u0027t have done that.\"\n \"You also deceived a priest.\"\n \"Yes, well… I\u0027m more worried about Gillian. I\u0027m telling you, I shouldn\u0027t have tricked her. It was wrong.\"\n \"But you\u0027d do it again, wouldn\u0027t you?\"\n With a shrug he admitted he would. \"Yes. I can\u0027t imagine living without her, and if you laugh at me for admitting such a weakness, I swear I\u0027ll put my fist through your face.\"\n Ramsey slapped Brodick\u0027s shoulder. \"Take heart,\" he suggested.\n \"What the hell does that mean?\"\n \"Gillian might panic when she first hears she\u0027s married to you. Hell, any woman would.\"\n \"Ramsey, you\u0027re not helping.\"\n \"But she won\u0027t run, Brodick.\"\n \"I\u0027ll tell her at supper. Yes,\" he added with a firm nod, \"I\u0027ll tell her then.\"\n Brodick all but ripped the door off its hinges as he pulled it open to leave.\n Chapter Twenty-Two\n The anticipation of finally being reunited with her older sister was almost more than Gillian could handle. As she dressed to meet Ramsey\u0027s followers, her hands actually shook and her stomach felt as though it were filled with butterflies.\n She wore a golden colored gown with embroidered threads along the hem of the skirt and the wristband of the fitted sleeves. A servant helped her pleat the Buchanan plaid around her waist and drape one end over her shoulder. The fabric was secured with a braided leather belt.\n Gillian still wasn\u0027t ready to go downstairs just yet, and so she stayed in the chamber Ramsey had assigned to her at the end of the hallway, pacing back and forth in front of the hearth and rehearsing what she would say when she greeted Christen.\n Bridgid was sent up to get her. She opened the door, took a step inside, spotted Gillian in the firelight of the hearth, and came to a sudden stop. \"Oh, Gillian, you look beautiful. The color suits you.\"\n \"Thank you, but I\u0027m pale in comparison to you.\"\n Bridgid laughed. \"Aren\u0027t we a pair? Praising one another like silly girls.\"\n \"I\u0027m sincere. You look radiant, and the man you love will surely notice you tonight.\"\n Bridgid snorted. \"I predict he will continue to look right through me. He always does. I\u0027m getting used to it,\" she added with a nod. \"Are you ready to go downstairs?\"\n \"Yes,\" she answered as she turned to put her brush back on the chest. She steadied her hands and forced herself to take a deep breath. \"I\u0027m so excited about seeing my sister again I\u0027m actually trembling.\"\n \"Do you think you\u0027ll meet her tonight?\"\n \"I do,\" she answered. \"And I\u0027ve been practicing what I will say to her. I want our reunion to be perfect, and I want her to like me. Isn\u0027t that a foolish worry? Of course she\u0027ll like me. I\u0027m her sister, for heaven\u0027s sake.\"\n \"Come along,\" Bridgid said then. \"We mustn\u0027t keep Laird Ramsey waiting. Brodick\u0027s with him, by the way, and so are Brisbane and Otis. I\u0027ll warn you none of them look very happy. Something\u0027s wrong, but no one will tell me what it is. I\u0027ll wager it has to do with the MacPhersons, though. That man Proster is always making trouble. Anthony and Faudron are constantly complaining about him and his cohorts.\"\n \"Who are Anthony and Faudron?\" Gillian asked as she pinched her cheeks for color and followed Bridgid out the doorway.\n \"They\u0027re Gideon\u0027s close friends, and Gideon is—\"\n \"Ramsey\u0027s commander.\"\n \"Yes,\" Bridgid said. \"You rarely see one without the other two, and whenever Gideon is away from the holding, then Anthony takes over his position.\"\n When they reached the bottom step, the door opened and a soldier came hurrying inside. He was tall, thin, and had deep creases in his brow.\n \"That\u0027s Anthony,\" Bridgid whispered. \"I\u0027ll introduce you after you\u0027ve spoken to Ramsey. You shouldn\u0027t keep him waiting.\"\n The men were at the far end of the hall. Ramsey and Brodick stood together talking in low whispers while Brisbane and Otis sat at the table watching the lairds. The old men looked as though they\u0027d just lost their best friend. Otis noticed her coming toward them, nudged his friend, and then stood up.\n Gillian\u0027s smile of greeting faltered when she saw Brodick\u0027s expression. He looked furious, and after she had bowed to Ramsey, she folded her hands together and waited to find out what was wrong.\n The duty of breaking her heart fell on Brodick\u0027s shoulders, and he decided to get it over and done with as quickly as possible. \"Your sister has refused to meet with you.\"\n She wouldn\u0027t believe what she had just heard. She made him repeat the news.\n \"Why would she refuse to see me?\"\n Brodick looked to Brisbane for an answer. The old man scraped his chair on the floor as he pushed it aside and rounded the table. With a long face, he explained, \"She\u0027s been a MacPherson for almost as long as she can remember, and she feels no loyalty to England.\"\n \"What about her family?\" Gillian cried out. \"Does she feel no loyalty to me and our Uncle Morgan?\"\n \"Her family is here,\" Brisbane said. \"She has a mother and father and—\"\n She cut him off. \"Her mother and father are buried in England.\"\n Brisbane\u0027s shoulders sagged even more than was their usual inclination. \"And she has a husband,\" he hurriedly added. \"She is… content.\"\n \"Content? She\u0027s content?\" she repeated in a near shout. The picture of her Uncle Morgan came into her mind and she began to shake with fury. A kind, gentle man\u0027s life was at stake, and Gillian didn\u0027t care how content Christen was.\n She took a step toward Brisbane, but Brodick stopped her by putting his arm around her waist and pulling her into his side.\n \"Try to understand, Lady Gillian,\" Brisbane pleaded.\n \"I don\u0027t have time to understand,\" she countered. \"I must speak to my sister as soon as possible.\"\n \"Did she tell you she wouldn\u0027t see Gillian or did her husband speak for her?\" Brodick asked.\n The question surprised Brisbane, and he mulled it over for several seconds before admitting, \"Her husband explained. She didn\u0027t speak at all, but she was there, and she heard every word he said. If she didn\u0027t agree, she could have protested.\"\n \"Does she know that I only want to talk to her? That I won\u0027t make any demands?\"\n \"Yes, I told her that you only wanted to see her again, but I don\u0027t think she or her husband believed me. Remember, lass, in the past there have been inquiries about her whereabouts. She fears you\u0027ll force her to return to England or tell others where she is.\"\n Gillian put her hand to her forehead. \"I would do no such thing.\"\n She leaned into Brodick and tried to think. How could she rid her sister of her fears? And how could Christen believe that her own sister would betray her?\n \"Ramsey?\" Brodick called out. \"What the hell are you going to do about this?\"\n \"I\u0027ll give her one day to change her mind.\"\n \"And if she doesn\u0027t?\" Brisbane asked.\n \"Then I\u0027ll speak to her on Gillian\u0027s behalf. If she still refuses, I\u0027ll order her to come forward. If I have to drag her here, I will. I would prefer, however, that she come to this decision on her own.\"\n \"Her husband won\u0027t like it,\" Brisbane blurted.\n \"I don\u0027t give a damn if he likes it or not,\" Ramsey said.\n \"He\u0027s a proud MacPherson.\" Otis stepped forward to join in the heated discussion.\n \"He\u0027s a Sinclair now,\" Ramsey snapped. \"He pledged his loyalty to me, did he not?\"\n \"All the MacPhersons did,\" Brisbane said.\n \"The MacPherson soldiers are all loyal to you, Laird,\" Otis said. \"But since you have brought up this issue, I will tell you that every one of them has been made to feel as though they are outcasts, especially the soldiers. Your commander, Gideon, and his soldiers, Anthony and Faudron, constantly ridicule and mock their efforts. The MacPhersons have still not been trained properly, and I tell you this, there will be an insurrection if something isn\u0027t done and soon.\"\n Ramsey didn\u0027t immediately respond to the fervent speech, but Brodick knew he was furious.\n \"Are you suggesting that Ramsey pamper or give special consideration to the MacPherson soldiers?\" Brodick asked.\n Otis shook his head. \"I\u0027m suggesting they only be given a fair chance to show their strength.\"\n \"Tomorrow I will take charge of the training, and when Gideon returns, I\u0027ll discuss the problem with him,\" Ramsey stated. \"Does that satisfy you?\"\n Otis appeared vastly relieved. \"Yes, thank you.\"\n Brisbane sought to be as accommodating as Ramsey. \"With your permission, Laird, I would like to return to Lady Gillian\u0027s sister first thing in the morning. I\u0027ll stress the fact that Lady Gillian has promised me she only wants to talk to her sister.\" He looked pointedly at Gillian when he made the last remark. \n","sourceLink":"https://allnovel.net/ransom-highlands-lairds-2/page-40.html","bookId":1843,"book":{"id":1843,"title":"Ransom (Highlands\u0027 Lairds #2)","description":"Storyline: \n As a child, Gillian lost her sister and saw her father killed by Baron Alford, a man driven by greed, determined to obtain a jewelled box belonging to King John. Years later, while searching for her sister, Gillian enlists the aid of Scottish Lairds Ramsey Sinclair and Brodick Buchanan, as well as a new friend, Brigid Kirk Connel. The four unite to face the terrifying and powerful baron who has stolen Gillian\u0027s home. But in the process of regaining her heritage, will Gillian lose her heart?\n \n","cover":"https://allnovel.net/images/ransom-highlands-lairds-2.jpg","author":"Julie Garwood","type":"Historical","source":"allnovel","link":"https://allnovel.net/ransom-highlands-lairds-2.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 3:31:38 PM"}}
