{"id":76904,"no":50,"title":"Page 50","content":"\"Are you still angry with me, Brodick?\" \"Yes.\" \"Good,\" she whispered, \"because I\u0027m furious with you.\" Head held high, her attitude haughty, she took a step toward the creek, but her leg wouldn\u0027t support her. She would have fallen on her face if Brodick hadn\u0027t grabbed her. \"You can\u0027t walk, can you?\" \"Of course I can,\" she replied, her voice as surly as his had been when he\u0027d posed the question. \"Now, if you\u0027ll excuse me, I\u0027ll go wash.\" Brodick watched her limp away to make certain he wasn\u0027t going to have to catch her again. Ramsey had given Bridgid a gentle shove to get her moving in the direction of the creek, and Brodick relaxed his guard when she assisted Gillian. The women took their time. Gillian redressed her bandage, grimacing when she saw how bruised her thigh was. The wound wasn\u0027t bad at all, though, and was already closing. Walking got rid of the stiffness, and by the time she and Bridgid returned to camp, they were both in much better spirits. Gillian wasn\u0027t limping much. They set out for Ramsey\u0027s home right away. Gillian insisted she ride her own horse, and Brodick reluctantly agreed. Before long they reached the meadow and rode down the northern slope. To the west a fair distance away were the cliffs she and Brodick had ridden down the day they were married, and she remembered the foolish, carefree banter and the joy she had felt. Lord, it seemed an eternity had passed since then. Her mind continued to wander as they crossed the meadow and neared the gate to Ramsey\u0027s holding. They were riding next to the wall when Gillian glanced up. A soldier suddenly appeared on the catwalk above. Her breath caught in her throat and her heart began to pound. Pulling on the reins, she forced the horse to stop and shouted, \"Brodick.\" The man saw her and stepped back out of sight. Brodick and Ramsey immediately turned back. \"What\u0027s wrong?\" Brodick demanded. \"Why did you stop?\" Ramsey asked. \"Did you see the man up there on the catwalk? Did you see him, Ramsey?\" Brodick answered. \"I saw him. It was Gideon. He\u0027s probably on his way to the gates now to meet Ramsey. You met him on the day we arrived. Don\u0027t you remember?\" She was frantically shaking her head. \"No, Brodick, I didn\u0027t meet him.\" \"Yes, you did,\" Ramsey insisted. \"No, I didn\u0027t,\" she cried out. \"But I\u0027ve seen him before. He\u0027s the man who betrayed you.\" Chapter Thirty-Two Ramsey\u0027s battle cry rent the air, alerting the gatekeepers to call the men to arms. Within bare minutes every possible exit was sealed as tight as a tomb. Soldiers raced to the catwalks, their arrows already notched to their bows in preparation, as more of Ramsey\u0027s followers leapt upon their horses and galloped out into the valley to surround the perimeter of the holding. No one would get into the estate, and no one was going to get out. Every able-bodied man came running to support their laird, and for the first time since the MacPhersons had joined the Sinclairs, there was no prejudice or rivalry. United, they stood together, five deep, in a wide circle around the courtyard, waiting and watching, with but one single intent—to protect Ramsey. Gideon waited in the center of the courtyard with eleven other traitorous men, all Sinclairs, and all loyal to the man they believed should have been laird. Gideon was eager and confident. His moment had finally arrived, and soon now he would become laird of the Sinclairs, and he was anxiously looking forward to killing Ramsey. He believed that once Ramsey was dead, the clan would give him their loyalty. Brodick ordered Liam and Aaron to take the women to the cottage, but Gillian countered his command with one of her own. \"You will stay and protect your laird.\" Brodick heard her and nodded his agreement. Gillian motioned to Bridgid then and took the lead to the cottage. She wanted to call out to Brodick, to tell him to be careful and not take any foolish chances, but his thoughts were on the battle ahead of him, and she didn\u0027t want to distract him. She prayed to God instead and asked Him to keep Brodick and Ramsey safe. When she turned to Bridgid, she saw her make the sign of the cross and knew she was doing the same thing. Ramsey and Brodick leapt to the ground before their horses had stopped, and drawing their swords, they closed the distance. Proster tried to follow his laird, but Dylan shoved him aside. \"You haven\u0027t earned the right to protect your laird\u0027s back.\" \"Then who will?\" the soldier demanded. \"The Buchanans, of course. Watch and learn, boy.\" Liam put his hand on Proster\u0027s shoulder. \"You did well protecting our mistress,\" he said. \"And we are thankful, but until you are properly trained, you are a hindrance to your laird, forcing him to protect you. Patience, boy. Do as my commander orders. Watch and learn.\" Gideon boldly stepped forward to confront Ramsey. \"I challenge you now, Ramsey, for the right to rule the Sinclairs,\" he shouted. Ramsey laughed, the sound harsh in the sudden stillness. \"You challenged me once before, you son of a bitch. I should have killed you then.\" \"You dared to come back here and steal what belonged to me. Me!\" Gideon shrieked. \"I should have been laird, not you. I am worthy.\" \"Worthy?\" Ramsey roared. \"You think you\u0027re worthy? You prey on children and women to get what you want, and you believe that makes you worthy? Only a coward would strike a bargain with the English devils to steal my brother and kill him. When Alec Maitland was taken by mistake, you thought you could rectify that blunder by going back to England and ordering the death of a five-year-old boy. No, you aren\u0027t worthy. You\u0027re a coward and a traitor, you bastard.\" \"I did what needed to be done to gain the loyalty of all the Sinclairs. You and Michael will both die. I\u0027m strong, Ramsey, not weak like you. You allowed Bridgid KirkConnell to deny me,\" he shouted. \"And you listened to the whining of old men and let them foul our land with the MacPherson scum. How dare you believe they are equal to us. When I\u0027m laird, I\u0027m going to rid my land of their plague.\" With the crook of his finger, Ramsey motioned for Gideon to attack. \"Come and kill me,\" he taunted. \"Show me your strength.\" Screaming, Gideon raised his sword and charged. His friends advanced at the same time, their plan to overwhelm the laird with their sheer number, but Brodick and Dylan moved forward, their swords swift as they cut down two of the enemy before they could swing their weapons. A weathered Sinclair soldier, flanked by two MacPhersons, joined the fight then, thinking to even the odds. Brodick never took his gaze off Anthony and moved with deadly intent toward his prey. Seeing the look in his eyes, Anthony tried to run, but Dylan blocked his retreat. Brodick wasted little time fencing with the soldier and killed him with one quick thrust across his throat. He died standing, then crashed to the ground. Brodick spit on him as a final insult before turning to watch Ramsey. A loud piercing squeal issued from Gideon\u0027s throat as Ramsey\u0027s sword sliced down through his shoulder to his waist, nearly cutting him in half. The commander fell to his knees, a look of stunned disbelief on his face. As he was drawing his last breath, Ramsey kicked him onto his back and lifted his sword with both hands as he muttered, \"You lose.\" And with all his might he thrust his sword into Gideon\u0027s black heart. Ramsey stood over his enemy while he sought to control his anger. The silence was heavy; the only sound, that of his heavy breathing. The scent of blood hung in the air and filled his nostrils. He shuddered once, like a dog shaking his coat to rid it of water, then straightened and jerked his sword from Gideon\u0027s body. \"Does anyone else want to challenge me?\" he roared. \"Nay,\" a man shouted from deep within the crowd. \"Our loyalty is to you, Laird.\" A resounding cheer went up then, but Ramsey paid it little attention. The ground around him was littered with the dead, the dirt and grass blackened with their spilled blood. Turning to the three soldiers who had stepped forward to fight the battle with him, he said, \"Drag their bodies outside my walls and leave them to rot.\" He noticed then that he, like Brodick, had splatters of blood on his arms and legs, \"I want to wash their stench from my body.\" Without a backward glance, Brodick followed his friend to the lake. When they were well away from the others, Ramsey turned to him, \"We leave for England tomorrow.\" Brodick nodded. \"At first light.\" Chapter Thirty-Three Proster told Gillian and Bridgid what had happened. In his enthusiasm, he went into excruciating and sickening detail as he described the fight, blow by bloody blow, and told them far more than either one of them wanted or needed to hear. By the time he was finished, Bridgid\u0027s face was gray and Gillian was sick to her stomach. \"You\u0027re certain Brodick and Ramsey were unharmed?\" Gillian asked. \"Neither suffered so much as a nick,\" Proster replied. \"They were both covered with blood, but it wasn\u0027t theirs, and they went to the lake to wash it off. Ramsey\u0027s going to let the bodies of the dead rot.\" \"I don\u0027t wish to hear another word,\" Bridgid said. She dismissed the soldier then and opened the door for him. \"Gillian, I\u0027ll fetch some salve to put on your leg to help with the healing.\" \"You might want to wait,\" Proster advised. \"Or take the back way. The grass in the courtyard is black from blood spilled, and I\u0027m not certain all the dead have been dragged away yet.\" \"I\u0027ll go to my mother\u0027s, then, and get some salve from her. Proster, men died today and you should not be smiling.\" \"But they weren\u0027t good men,\" he countered. \"They deserved to die.\" They continued their argument as Proster closed the door. Gillian sat down to wait for Brodick. She expected him to walk through the door at any moment. An hour later she was still waiting. By midafternoon she went searching for him and was told by one of the MacPhersons that her husband had left with Ramsey. It was speculated that the two lairds had gone to Iain Maitland to tell him the news. She tried to wait up for her husband, but because she\u0027d had so little rest the night before, she couldn\u0027t keep her eyes open. She finally fell into a fitful sleep. Brodick woke her up in the middle of the night when he pulled her into his arms and made love to her. His hands were rough and demanding, and she felt a desperation in him, a violence barely controlled, but she didn\u0027t fight or reject him. Nay, she stroked and caressed him and tried to soothe the beast within. Their lovemaking was wild and frantic, and when he cl**axed deep inside her, she came apart in his arms. She told him she loved him, and he cherished her words because he knew that her love was going to be sorely tested in the days ahead. By tomorrow night, she could very well hate him. Brisbane and Otis knocked on her door early the following morning. Gillian was dressed for the day and had just finished her morning meal. \"We have been instructed to take you to your sister,\" Brisbane announced. \"Did she finally agree to see me, then?\" she asked as she stepped outside. Otis shook his head. \"She has been ordered to see you.\" Gillian tried not to let them see how disappointed she was that her sister had once again refused her. They walked together to the stables, where their horses were saddled and waiting. Brisbane took the lead, and neither he nor Otis said another word until they reached a cluster of cottages near the border that once separated the MacPhersons from the Sinclairs. Gillian was suddenly nervous and scared. Christen had already rejected her, and as painful and humiliating as that was, she had accepted it, but if her sister didn\u0027t know where the king\u0027s treasure was or had forgotten all that had happened, then everything was lost and Uncle Morgan was doomed. \"Please, God, let her remember,\" she whispered as she dismounted and walked toward the cottage Brisbane had pointed out. \"We\u0027ll wait here for you,\" Brisbane said. \"You needn\u0027t wait. I know the way back.\" The door opened then, and a woman Gillian never would have recognized as her sister stepped into the sunlight. Her husband, tall and gaunt, followed her. His hostility was evident as he hovered protectively over his wife. Christen was a good head taller than Gillian. Her hair was much darker too, and Liese had told Gillian that Christen had golden curls, but she didn\u0027t remember them. There wasn\u0027t a glimmer of recognition, and though Gillian knew this woman was her sister, she was a stranger to her. She was heavy with child. No one had bothered to mention that fact to Gillian. Had Christen not looked so sullen, Gillian would have embraced her and told her how happy she was to see her again. They stared at one another for a long minute before Gillian finally broke the uncomfortable silence. \"Are you Christen?\" \"I am,\" she answered. \"I used to be anyway. My parents changed my name. I\u0027m called Kate now.\" A burst of anger took Gillian by surprise, and she spoke before she could stop herself. \"Your parents are dead and buried in England.\" \"I don\u0027t remember them.\" Gillian cocked her head to the side and stared at her sister. \"I think you do remember our father.\" \"What is it you want from me?\" she asked, a note of defiance creeping into her voice. Gillian suddenly felt like weeping. \"You\u0027re my sister. I wanted to see you again.\" \"But you want more than that, don\u0027t you?\" Her husband asked the question. Christen remembered her manners and quickly introduced him. His name was Manus. Gillian lied when she told him she was pleased to meet him. Then she answered his question. \"Yes, I do want something more.\" Christen stiffened. \"I cannot and will not go back to England. My life is here, Gillian.\" \"Is that what you\u0027re so afraid of? That I\u0027ll force you to go home with me? Oh, Christen, I would never ask that of you.\" The sincerity in her voice must have gotten through to Christen. She nodded to her husband and whispered something in his ear. Manus reluctantly agreed, and after bowing, he went inside and then carried out two chairs. Christen sat down and motioned for Gillian to do the same. Manus went back inside, and they were suddenly alone, two sisters who were strangers. \"Are you happy?\" she asked, hoping to put Christen at ease by urging her to talk about her life with the MacPhersons. \"Yes, I\u0027m very happy,\" she answered. \"Manus and I have been married five years now, and soon we will welcome our first child.\" Gillian decided to get to the heart of the matter before her sister decided to end the reunion. Twice she\u0027d glanced at the door.","sourceLink":"https://allnovel.net/ransom-highlands-lairds-2/page-50.html","bookId":1843,"book":{"id":1843,"title":"Ransom (Highlands\u0027 Lairds #2)","description":"Storyline: As a child, Gillian lost her sister and saw her father killed by Baron Alford, a man driven by greed, determined to obtain a jewelled box belonging to King John. Years later, while searching for her sister, Gillian enlists the aid of Scottish Lairds Ramsey Sinclair and Brodick Buchanan, as well as a new friend, Brigid Kirk Connel. The four unite to face the terrifying and powerful baron who has stolen Gillian\u0027s home. But in the process of regaining her heritage, will Gillian lose her heart?","cover":"https://allnovel.net/images/ransom-highlands-lairds-2.jpg","author":"Julie Garwood","type":"Historical","source":"allnovel","link":"https://allnovel.net/ransom-highlands-lairds-2.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 3:31:38 PM"}}
