{"id":28362,"no":16,"title":"CHAPTER XV THE CRISIS APPROACHES","content":"Herbert went to work in earnest. It took only part of one day to plow the field which he was to cultivate. He decided, after consultation with Mrs. Crane, to appropriate two-thirds of the land to potatoes, and the remainder to different kinds of vegetables. He was guided partly by the consideration of which would be most marketable. On the third day, while at work, he heard his name called. It must be explained that Mr. Crane\u0027s house and land were on the corner of two streets, so that he was in full sight, while in the field, from the side street. Looking up, he recognized James Leech, who was surveying him with evident curiosity. “Good morning, James,” said Herbert, going on with his work. “I see you\u0027ve got a job,” said James. “Yes.” “Has Mr. Crane hired you?” “Not exactly.” “Then, why are you at work in his field?” “Because I\u0027ve agreed to work it on shares.” “How is that?” “I am to have a third of the crops to pay me for my services.” “What can you do with it?” “Part of the vegetables we can use at home, and the balance I shall sell.” “I shouldn\u0027t think you\u0027d like that arrangement.” “Why not?” “Because you have so long to wait for your pay.” “That is true, but it\u0027s better than not working at all, and I\u0027ve tried all over the village in vain to get employment.” “Do you think you\u0027ll make much out of it?” “I don\u0027t think I shall make my fortune, but I shall make something.” “Don\u0027t it tire you to work?” asked James, with some curiosity. “Of course, if I work all day; but I don\u0027t mind that.” “I should.” “You are not used to work.” “I should say not,” returned James, with pride. “I never worked in my life.” It was a strange thing to be proud of, but there are some who have nothing better to be proud of. “I like to work,” said Herbert. “You do?” “Yes, only I like to get something for my labor. You expect to work some time, don\u0027t you?” “Not with my hands,” said James. “I shall never be reduced to that.” “Do you think it so very bad to work with your hands? Isn\u0027t it respectable?” “Oh, I suppose it\u0027s respectable,” said James; “but only the lower classes do it.” “Am I one of the lower classes?” asked Herbert, amused. “Of course you are.” “But suppose I should get rich some day,” said Herbert. “That isn\u0027t very likely. You can\u0027t get rich raising vegetables.” “No, I don\u0027t expect to. Still, I may in some other way. Didn\u0027t you ever know any poor boys that got rich?” “I suppose there have been some,” admitted James. “Haven\u0027t you ever heard of Vanderbilt?” “Of course I have. Father says he\u0027s worth forty millions.” “Don\u0027t you consider him a gentleman?” “Of course I do.” “Well, he was a poor boy once, and used to ferry passengers across from Staten Island to New York.” “Did he? I didn\u0027t know that.” “Suppose my uncle had left me all his fortune—a hundred thousand dollars—would I have been a gentleman, then?” “Yes, but it isn\u0027t the same as, if you had always been rich.” “I don\u0027t agree with your ideas, James. It seems to me something besides money is needed to make a gentleman; still, I hope to get on in the world, and I shouldn\u0027t object to being rich, though I don\u0027t see any prospect of it just at present.” “No,” said James. “You will probably always be poor.” “That\u0027s very encouraging,” said Herbert, laughing. “How about yourself?” “Oh, I shall be a rich man like father.” “That\u0027s very encouraging for you. I hope when you are a man you\u0027ll give me work if I need it.” “I will bear it in mind,” said James, with an important air. “Now I must be going.” That day, at dinner, James said to his father: “That Carter boy has got a job.” “Has he?” asked the squire, not very well pleased. “Yes, he\u0027s working at Mr. Crane\u0027s.” “What is he doing?” “Working in the garden.” “What wages does Crane pay him?” “None at all. He says he has agreed to work for the third of the crops.” “Did he say that?” asked the squire, with satisfaction. “Yes, he told me so this morning.” “You are sure he gets no money?” “Yes; he is paid wholly in vegetables. He said he couldn\u0027t find employment anywhere else in the village, so he had to work that way.” “That boy stands very much in his own light,” said the squire. “How is that, father?” “I told him Mr. Banks would give him work if he would agree to sell me his cottage.” “He doesn\u0027t own it, does he?” “His mother, of course, I mean. It\u0027s the boy that keeps her from selling it.” “Why does he do that?” “Oh, they\u0027ve got a silly notion that no other place would seem like home to them, and, besides, they think I don\u0027t offer them enough.” “How much do you offer them?” “Eleven hundred dollars; that is, I have a mortgage on the place for seven hundred and fifty. I offer them three hundred and fifty dollars besides.” “Is that all the money they are worth?” “Yes; they are very foolish to refuse, for they\u0027ll have to come to it some time. In about a week the interest comes due, and I\u0027m very sure they won\u0027t be able to meet it.” “Suppose they don\u0027t?” “Then,” said the squire, with a satisfied smile, “I shall take possession, and they\u0027ll have to sell.” “Herbert says he hopes to be rich some time.” “I dare say,” said the squire, laughing heartily. “Everybody does, so far as I know.” “Do you think there is any chance of it?” “About one in a thousand.” “I shouldn\u0027t want the lower classes to get rich,” said James, thoughtfully. “They\u0027d think they were our equals.” “Yes, no doubt.” James was not aware that his grandfather had once been a poor mechanic, or rather he ignored it. He chose to consider that he had sprung from a long line of wealthy ancestors. His father heard with pleasure that Herbert was not likely to realize any money at present for his services. Already he felt that the little cottage was as good as his. It was only a week now to the time of paying interest, and he was very sure that Mrs. Carter would be unprepared to meet it. “In that case,” he decided, “I will certainly foreclose. There will be no sense in granting them any further indulgence. It will be for their interest to sell the cottage, and get rid of the burden which the interest imposes. Really, they ought to consider it a favor that I am willing to take it off their hands.” We are very apt to think it is for the interest of others to do what we greatly desire, and I don\u0027t suppose the squire was singular in this. I think, however, that there are many who are less selfish and more considerate of others. Herbert, too, was thinking, and thinking seriously, of the interest that was so soon coming due. In spite of his own and his mother\u0027s economy, when the preceding day arrived, all they could raise toward the payment was thirteen dollars, and the sum required was twenty-two dollars and a half. “Mother,” said Herbert, at dinner the day before, “I see only one chance for us, and that is, to borrow the money. If anyone would lend us ten dollars we could pay the interest, and then we should be free from anxiety for six months.” “I am afraid you will find that difficult,” said his mother. “The squire is the only rich man in the village, and of course we can\u0027t apply to him.” “At any rate, I can but try. Instead of going to work this afternoon, I shall go about and try to borrow the money. If I can\u0027t, then I suppose we must give up the house.” Certainly the prospect seemed far from cheerful.","sourceLink":"http://novel.tingroom.com/ertong/2977/82055.html","bookId":346,"book":{"id":346,"title":"Herbert Carter\u0027s Legacy","description":"简介： Horatio Alger, Jr., an author who lived among and for boys and himself remained a boy in heart and association till death, was born at Revere, Mass., January 13, 1834. He was the son of a clergyman; was graduated at Harvard College in 1852, and at it...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2977","creation":"Aug 1, 2019 12:18:37 AM","modification":"Aug 1, 2019 12:18:37 AM"}}
