{"id":72179,"no":11,"title":"Page 11","content":"His phone rang and she slipped out. Might make her a dork, but she did a little happy dance in her office. A fulltime position. She could quit working at the Twin Pines. After all the years she’d bartended in college and grad school, she’d now have her weekends free. She probably wouldn’t know what to do with herself. Now you at least have the option of spending time with Dalton. Dalton. She’d managed to shove last night’s conversation to the back burner. Okay, after she’d stayed up half the night replaying it in her head. What was his end game? What did he have to prove? And was he proving it to her? Or to himself? But the part of her that’d always been crazy about him wanted to believe he’d pined for her these past few years. Okay, he hadn’t exactly said he’d pined. But he had said he’d thought about her a lot. Why had he been so vague about the business he needed to tie up while he was here? Did he consider her unfinished business he needed to handle? God. Why was she obsessing over this stuff like a teenage girl when she had work to do? Rory turned one more happy circle before she settled behind her desk. Yes, it was a good day. Chapter Six On his way back to Sundance, Dalton’s mom called. “Hey, Ma.” “Dalton! I’m so happy you’re finally in our neck of the woods.” “What’s up?” “What are you doing tonight?” He’d hoped to spend it with Rory, but then he remembered she worked at the Twin Pines after her regular job. “Nothing. Why?” “Come spend the night with me. I’ll whip up a batch of chicken and dumplings. And I’ll make your favorite sour cream strudel cake.” He groaned. “You win. I’ll swing by my place and pack a bag.” “I can’t wait to see you, son. I really missed you. Drive safe.” He texted Rory his plans to visit his mom; wouldn’t want her to think he was out catting around the night after he swore he’d prove to her he’d changed. Dalton pulled up to his mom’s condo a little after five. He’d barely gotten out of his truck when she threw herself at him. He hugged her back just as strongly. When she released him, she scrutinized his beard and whapped him on the chest. “If I hadn’t known your truck I would’ve believed some thug from a motorcycle gang was in my driveway.” “You’ve been watching too many episodes of Sons of Anarchy.” He held her at arm’s length. Her hair was styled short, in a trendy cut, blond and brown mixed in with the gray. With no Casper stress in her life, a good portion of her worry lines were gone. She looked a decade younger now than she had a decade ago. Dalton kissed her cheek and caught a whiff of the perfume she wore on special occasions. Made him feel guilty his visit was considered a special occasion. “You look great. I might not’ve recognized you either.” She looped her arm through his. “Come inside. I’ve got beer or coffee.” “Coffee would be great.” He shot her a grin. “To go with the cake.” “Which is for dessert,” she reminded him. “My new motto is dessert first.” “Then it’s a good thing I already cut you a slice, isn’t it?” While his mother futzed around in the kitchen, he wandered through the living room of her condo. He’d never thought much about decorating styles growing up—the stuff in their house was just the stuff that’d always been there. Her furniture—a couch, loveseat and recliner in vivid red—reflected the bold changes in her life. The end tables were simple and clutter-free except for the photos of her sons as boys, as teens and as young men. Now pictures of her grandsons were interspersed with those snapshots. Pictures of Brandt and Jessie. Tell and Georgia. He squinted at the last one on the shelf. How had she gotten a picture of him at the world poker tournament? And a rare one of him smiling during a poker game? “I got that by watching the video of you online and freezing it. I made a print off the computer. I didn’t have any recent pics of you.” Dalton faced her. “Are you gonna chew me out for—” “No.” She placed her hand on his biceps and squeezed. “You needed to go, Dalton. I’m glad you did. And we don’t have to talk about this two minutes after you’ve walked in the door.” “Thanks.” “Dump your bag in the spare bedroom. You get to bunk in the room with the toys I keep around for my grandsons. Then wash up and come to the kitchen.” He took his time checking out the remaining pictures in the hallway, surprised to see his parents’ wedding photo in the mix. Why would she keep that? But as he looked around, he didn’t see another picture of Casper McKay anywhere. Dalton wandered to the kitchen. “Smells good in here.” “I sort of went overboard. Get tired of cooking for one so be warned. I hope you’re hungry.” “Always.” “So the last time I talked to you, you were getting ready to lead your last hunting party of the season. How’d that go?” “Great. Hunters are always happy when they get an elk. All three guys did. They were lucky they got to see the rugged beauty of Montana and not the rugged weather.” His mother poured him a cup of coffee and sat across from him. “I promise I will get up there sometime.” She shot him a look. “Unless you’re moving back to Sundance permanently?” He hedged. “So you didn’t let Brandt and Tell know we’d kept in contact the last three years?” “No. If they suspected I knew where you were they never pushed me to tell them.” “I appreciate that.” “I appreciate that you did keep in touch with me, Dalton. You’re a grown man, but I still worry. I’m thrilled you got out of Wyoming and saw the world. Even if you’re still trying to find your place in it.” “You ever encourage Luke or Brandt or Tell to take off?” She wiped her mouth with a napkin. “Luke? No. Brandt? No. Wait, I take that back. Maybe after Luke started stepping out on Jessie. Brandt wanted to be anywhere besides on the ranch where he had to watch his brother act like a fool and destroy the woman Brandt loved. But Brandt was loyal to both of them even when it ripped him apart. And Tell? If you remember, I did push him to go out on the road rodeoin’ that one summer. But he had it in his head he’d never be good enough to make a living on the rodeo circuit, so he came back home.” “Casper tellin’ him he sucked all the time might’ve played a part in that,” Dalton said dryly. “Not that I disagree, but bein’ the cousin of Chase McKay had a lot more to do with it.” Dalton cut a dumpling in half and popped it in his mouth. The taste took him back to his teen years. Mealtimes were some of his favorite memories growing up. His brothers laughing and teasing each other. Casper had behaved for the most part, rarely picking fights with his sons at the dinner table, lest his wife stop cooking. She’d insisted they’d enjoy at least one civilized meal each day. “Dalton, sweetheart, are you okay?” He glanced up at her and smiled. “Yeah. Just thinkin’. This food takes me back. To, you know, growing up.” He paused. “It wasn’t all bad, was it?” “No son, it wasn’t. When you boys were little, for a few years, it was decent. I’d hoped Casper…” She shook her head. “Like so many things with him, it didn’t stick.” “Why did you stick around?” Dalton couldn’t think of any woman who’d put up with what Joan McKay had. “Because I thought I loved him. I wanted to believe that Casper was capable of being a good father. I thought if I didn’t micromanage every second he spent with you boys, he’d grow into his role in your lives.” She reached for his hand. “It was the hardest thing I’ve ever done, besides burying Luke, letting you boys work with him every day.” Her eyes filled with tears. “Look how that turned out with you. I had no idea what he was doing and you paid the price for my trust and hope. I’ve gone over this dozens of times with my counselor—” “You’re still seeing a counselor?” “I stopped for a while. Then Tell and I had that big blowup and I realized not all the changes I’d made in my life since the divorce were good. I’m more…settled when I have an unbiased person to unload on.” She squeezed his hand. “Which still makes me wonder if you resent me.” Dalton wasn’t sure how to answer. Wasn’t sure if he should answer. His mother retreated. “You know what? Scratch that question.” “No. It’s okay. There’s no way you could’ve protected us from him twenty-four/seven—especially not in the family ranch environment. Luke told me he’d figured out when he was fourteen that if he didn’t learn how to do everything on the ranch and teach us how to do it, there wouldn’t be anything for us to inherit. He also explained that Casper failing on his section of land didn’t reflect poorly on him, but all the McKays. That’s what Casper wanted—to be a burden to his brothers so they couldn’t ignore him. “He’s that guy, Mom. An expert at verbal abuse and manipulation. Takin’ out his bitterness on everyone around him. He showed us that ugly side and it wasn’t like you were safe from his mean mouth. I’d resent you if you’d hid in the house so we bore the brunt of whatever fucking anger was eating him, rather than you. But you’ve never been that type of mother.” “I appreciate you understanding that.” She sniffled. “I did leave Casper once.” A sick feeling formed in the pit of his stomach. “When?” “Tell was just out of diapers. I don’t remember what Casper had done, wasn’t anything like he did in later years, but I’d had enough. I left for five days, maybe a week.” A faraway look entered her eyes. Then she caught herself. “Didn’t mean to ruin your appetite with this conversation. Eat up.”","sourceLink":"https://allnovel.net/redneck-romeo-rough-riders-15/page-11.html","bookId":2697,"book":{"id":2697,"title":"Redneck Romeo (Rough Riders #15)","description":"Storyline: Redneck Romeo (Rough Riders #15) The last McKay standing is knocked to his knees… Three years ago, Dalton McKay looked across the altar and saw the woman he knew he’d love for the rest of his life…only it wasn’t his bride. That’s when he took the McKays’ love-’em-and-leave-’em reputation to new heights—fleeing the ceremony and Wyoming. Now a family issue has brought Dalton back to Sundance, giving him a chance to prove to everyone—especially the woman he thought he lost—that he’s a changed man. Aurora “Rory” Wetzler has fallen for cowboy hottie Dalton’s smooth-talkin’ ways too many times. So he’s determined to convince her he’s playing for keeps this go around? Fine. She’ll call that bluff—she can’t ignore their intense chemistry or resist smokin’ hot sex, but she’s not willing to gamble her heart again. Dalton has plenty of fences to mend with the McKays, but his biggest fear is that Rory doesn’t believe they have a future. He’ll have to pull out all the stops to show her they belong together for the long haul. Warning: Contains a sexy cowboy who tames his sassy lady love with his romantic and his kinky side. In explicit detail.","cover":"https://allnovel.net/images/redneck-romeo-rough-riders-15.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/redneck-romeo-rough-riders-15.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:22:20 AM"}}
