{"id":109218,"no":24,"title":"Page 24","content":"A PREMATURE POST-MORTEM Her eyes dry, she wrapped Lily in a sheet. The corpse was already rotting, face withering on to the skull like an orange left too long in the bowl. The girl would have to be removed to quicklime and a pauper\u0027s grave before the smell became too bad to bear. The job of winding done, Genevieve would have to fill out a certificate of death for Jack Seward to sign and draft an account for the Hall\u0027s files. Whenever anyone died about her, another grain of ice clung to her heart. It would be easy to become a monster of callousness. A few more centuries and she could be a match for Vlad Tepes: caring for nothing but power and hot blood in her throat. An hour before dawn, the news came. One of the ponces, arm carved up by someone\u0027s razor, was brought in; the crowd with him had five different versions of the story. Jack the Ripper was caught, and being held at the police station, identity concealed because he was one of the Royal Family. Jack had gutted a dozen in full view and eluded pursuers by leaping over a twenty-foot wall, springs on his boots. Jack\u0027s face was a silver skull, his arms bloodied scythes, his breath purging fire. A constable told her the bare facts. Jack had killed. Again. First, Elizabeth Stride. And now Catharine Eddowes. Cathy! That shocked her. The other woman, she said she didn\u0027t think she knew. \u0027She was in here last month, though,\u0027 Morrison said. \u0027Liz Stride. She was turning and wanted blood to keep her going. You\u0027d remember her if you\u0027d met her. She was tall, and kind of foreign, Swedish. Handsome woman, once.\u0027 \u0027He\u0027s takin\u0027 them two at a time,\u0027 the constable said, \u0027you almost have to admire him, the Devil.\u0027 Everybody left again, for the second or third time, the crowd melting away from the Hall. Genevieve was alone in the quiet of the dawn. After a while, each fresh atrocity just added to an awful monotony. Lily had bled her dry. She had nothing more to feel. No grief left for Liz Stride or Cathy Eddowes. As the sun rose, she fell into a doze in her chair. She was tired of keeping things together. She knew what would happen later. It had been getting worse with each murder. A troupe of whores would call, mainly in hysterical tears, begging for money to escape from the death-trap of Whitechapel. In truth, the district had been a deathtrap long before the Ripper silvered his knives. In her half-dream, Genevieve was warm again, heart afire with anger and pain, eyes hot with righteous tears. A year before the Dark Kiss, she had cried herself empty at the news from Rouen. The English had burned Jeanne d\u0027Arc, slandering her as a witch. At fourteen, Genevieve swore herself to the cause of the dauphin. It was a war of children, carried to bloody extremes by their guardians. Jeanne never saw her nineteenth birthday, Dauphin Charles was in his teens; even Henry of England was a child. Their quarrels should have been settled with spinning tops, not armies and sieges. Not only were the boy-kings now dead, so were their houses. Today\u0027s France, a country as strange to her as Mongolia, did not even have a monarch. If some of the English blood of Henry IV still flowed in Victoria\u0027s German veins, then it was also liable to have filtered down to most of the world, to Lily Mylett and Cathy Eddowes and John Jago and Arthur Morrison. There was a commotion - another commotion - in the receiving rooms. Genevieve was expecting more injuries during the day. After the murders, there would be street brawls, vigilante victims, maybe even a lynching in the American style... Four uniformed policemen were in the hallway, something heavy slung in an oilcloth between them. Lestrade was chewing his whiskers. The coppers had had to fight their way through hostile crowds. \u0027It\u0027s as if he\u0027s laughin\u0027 at us,\u0027 one of them said, \u0027stirrin\u0027 them all up against us.\u0027 With the police was a new-born girl in smoked glasses and practical clothes, tagging along, looking hungry. Genevieve thought she might be one of the reporters. \u0027Mademoiselle Dieudonne, clear a private room.\u0027 \u0027Inspector...\u0027 \u0027Don\u0027t argue, just do it. One of them\u0027s still alive.\u0027 She understood at once and checked her charts. She realised immediately that there was an empty room. They followed her, straining under their awkward burden, and she let them into Lily\u0027s room. She shifted the tiny bundle and the policemen manoeuvred their baggage into its place, pulling away the oilcloth. Skinny legs flopped over the end of the cot, skirt-edge trailing on odd stockings. \u0027Mademoiselle Dieudonne, meet Long Liz Stride.\u0027 The new-born was tall and thin, rouge smeared on her cheeks, hair a tatty black. Under an open jacket, she wore a cotton shift, dyed red in a splash from neckline to waist. Her throat was opened to the bone, cut from ear to ear like a clown\u0027s smile. She was gurgling, her cut pipes trying to mesh. \u0027Jackie Boy didn\u0027t have enough time with her,\u0027 Lestrade explained. \u0027Saved it all up for Cathy Eddowes. Warm bastard.\u0027 Liz Stride tried to yell, but couldn\u0027t call up air from her lungs into her throat. A draught whispered through her wound. Her teeth were gone but for sharp incisors. Her limbs convulsed like galvanised frogs\u0027 legs. Two of the coppers had to hold her down. \u0027Hold her, Watkins,\u0027 Lestrade said. \u0027Hold her head still.\u0027 One of the constables tried to get a hold on Liz Stride\u0027s head, but she shook it violently, ripping apart her wound even as it tried to mend. \u0027She won\u0027t last,\u0027 Genevieve told him. \u0027She\u0027s too far gone.\u0027 An older or stronger vampire might have survived - Genevieve had herself lived through worse - but Liz Stride was a new-born and had been turned too late in life. She\u0027d been dying for years, poisoning herself with rough gin. \u0027She doesn\u0027t have to last, she just has to give a statement.\u0027 \u0027Inspector, I don\u0027t know that she can talk. I believe her vocal cords have been severed.\u0027 Lestrade\u0027s rat-eyes glittered. Liz Stride was his first chance at the Ripper, and he did not want to let her go. \u0027I think her mind\u0027s lost too, poor thing,\u0027 Genevieve said. There was nothing in the red eyes to suggest intelligence. The human part of the new-born had been burned away. The door pushed in and people crowded through. Lestrade turned to shout \u0027Out!\u0027 at them but swallowed his command. \u0027Mr Beauregard, sir,\u0027 he said. The well-dressed man Genevieve had seen at Lulu Sch?n\u0027s inquest came into the room, with Dr Seward in his wake. There were more people - nurses, attendants - in the corridor. Amworth slipped in and stood against the wall. Genevieve would want her to look at the new-born. \u0027Inspector,\u0027 Beauregard said. \u0027May I...\u0027 \u0027Always a pleasure to help the Diogenes Club,\u0027 said Lestrade, tone suggesting it was rather more of a pleasure to pour caustic soda into one\u0027s own eyes. Beauregard nodded a greeting to the new-born girl, acknowledging her with her name, \u0027Kate\u0027. She stood out of his way, eyes lowered. If she wasn\u0027t in love with Beauregard, Genevieve would be very surprised. He slid between the constables with an elegant movement, polite but forceful. He flicked his cloak over his shoulders, to give his arms freedom of movement. \u0027Good God,\u0027 he said. \u0027Can nothing be done for this poor wretch?\u0027 Genevieve was strangely impressed. Beauregard was the first person who had said anything to suggest he thought Liz Stride was worth doing something for, rather than a person something ought to be done about. \u0027It\u0027s too late,\u0027 Genevieve explained. \u0027She\u0027s trying to renew herself, but her injuries are too great, her reserves of strength too meagre...\u0027 The torn flesh around Liz Stride\u0027s open throat swarmed, but failed to knit. Her convulsions were more regular now. \u0027Dr Seward?\u0027 Beauregard said, asking for a second opinon. The director approached the bucking, thrashing woman. Genevieve had not noticed his return, but assumed the news must have dragged him back to the Hall. She saw again that he had a distaste - almost always held tightly in check - for vampires. \u0027Genevieve is right, I\u0027m afraid. Poor creature. I have silver salts upstairs. We could ease her passing. It would be the kindest course.\u0027 \u0027Not until she gives us answers,\u0027 Lestrade interrupted. \u0027Heaven\u0027s sake, man,\u0027 Beauregard countered. \u0027She\u0027s a human being, not a clue.\u0027 \u0027The next will be a human being too, sir. Maybe we can save the next. The next ones.\u0027 Seward touched Liz Stride\u0027s forehead and looked into her eyes, which were red marbles. He shook his head. In an instant, the wounded new-born was possessed of a surge of strength. She threw off Constable Watkins and lunged for the director, jaws open wide. Genevieve pushed Seward out of the way and ducked to avoid Liz Stride\u0027s slashing talons. \u0027She\u0027s changing,\u0027 Kate shouted. Liz Stride reared up, backbone curving, limbs drawing in. A wolfish snout grew out of her face, and swathes of hair ran over her exposed skin. Seward crab-walked backwards to the wall. Lestrade called his men out of danger. Beauregard was reaching under his cloak for something. Kate had a knuckle in her mouth. Liz Stride was trying to become a wolf or a dog. As Mrs Amworth said, it was a hard trick. It took immense concentration and a strong sense of one\u0027s own self. Not the resources available to a gin-soaked mind, or to a new-born in mortal pain. \u0027Hellfire,\u0027 Watkins said. Liz Stride\u0027s lower jaw stuck out like an alligator\u0027s, too large to fix properly to her skull. Her right leg and arm shrivelled while her left side bloated, slabs of muscle forming around the bone. Her bloody clothes tore. The wound in her throat mended over and reformed, new yellow teeth shining at the edges of the cut. A taloned foot lashed out and tore into Watkins\u0027s uniformed chest. The half-creature yelped screeches out of its neck-hole. She leaped, pushing through policemen, and landed in a clump, scrabbling across the floor, one powerfully-razored hand reaching for Seward. \u0027Aside,\u0027 Beauregard ordered. The man from the Diogenes Club held a revolver. He thumb-cocked and took careful aim. Liz Stride turned, and looked up at the barrel. \u0027That\u0027s useless,\u0027 Amworth protested. Liz Stride sprung into the air. Beauregard pulled the trigger. His shot took her in the heart and slammed her back against the wall. She fell, lifeless, on to Seward, body gradually reverting to what it had been. Genevieve looked a question at Beauregard. \u0027Silver bullet,\u0027 he explained, without pride. \u0027Charles,\u0027 Kate breathed, awed. Genevieve thought the girl might faint, but she didn\u0027t. Seward stood up, wiping the blood from his face. Lips pressed into a white line, he was shaking, barely repressing disgust. \u0027Well, you\u0027ve finished the Ripper\u0027s business, and that\u0027s a fact,\u0027 Lestrade muttered. \u0027I\u0027m not complainin\u0027,\u0027 said the gash-chested Watkins. Genevieve bent over the corpse and confirmed Liz Stride\u0027s death. With a last convulsion, an arm - still part-wolfish - leaped out, and claws fastened in Seward\u0027s trousers-cuff.","sourceLink":"https://allnovel.net/anno-dracula-anno-dracula-1/page-24.html","bookId":2524,"book":{"id":2524,"title":"Anno Dracula (Anno Dracula #1)","description":"Storyline: Anno Dracula (Anno Dracula #1) It is 1888 and Queen Victoria has remarried, taking as her new consort Vlad Tepes, the Wallachian Prince infamously known as Count Dracula. Peppered with familiar characters from Victorian history and fiction, the novel follows vampire Geneviève Dieudonné and Charles Beauregard of the Diogenes Club as they strive to solve the mystery of the Ripper murders. Anno Dracula is a rich and panoramic tale, combining horror, politics, mystery and romance to create a unique and compelling alternate history. Acclaimed novelist Kim Newman explores the darkest depths of a reinvented Victorian London. This brand-new edition of the bestselling novel contains unique bonus material, including a new afterword from Kim Newman, annotations, articles and alternate endings to the original novel.","cover":"https://allnovel.net/images/anno-dracula-anno-dracula-1.jpg","author":"Kim Newman","type":"Horror","source":"allnovel","link":"https://allnovel.net/anno-dracula-anno-dracula-1.html","creation":"Oct 5, 2019 8:58:50 AM","modification":"Oct 5, 2019 11:32:32 PM"}}
