{"id":109235,"no":42,"title":"Page 42","content":"THE MOST DANGEROUS GAME\n Genevieve Dieudonne,\u0027 Beauregard introduced her, \u0027Colonel Sebastian Moran, formerly of the First Bangalore Pioneers, author of Heavy Game of the Western Himalayas, and one of the greatest scoundrels unhanged...\u0027\n The new-born in the coach was an angry-looking brute, uncomfortable in evening dress, moustache bristling fiercely. When warm, he must have had the ruddy tan of an \u0027Injah hand\u0027, but now he looked like a viper, poison sacs bulging under his chin.\n Moran grunted something that might count as an acknowledgement, and ordered them to get into the coach. Beauregard hesitated, then stepped back to allow her to go first. He was being clever, she realised. If the Colonel meant harm, he would keep an eye on the man he considered a threat. The new-born would not believe her four and a half centuries stronger than he. If it came to it, she could tear him apart.\n Genevieve sat opposite Moran and Beauregard took the seat next to her. Moran tapped the roof and the cab moved off. With the motion, the black-hooded bundle next to the Colonel nodded forwards, and had to be straightened up and leaned back.\n \u0027A friend?\u0027 Beauregard asked.\n Moran snorted. Inside the bundle was a man, either dead or insensible. \u0027What would you say if I told you this was the veritable Jack the Ripper?\u0027\n \u0027I suppose I\u0027d have to take you seriously. I understand you only hunt the most dangerous game.\u0027\n Moran grinned, tiger-fangs under his whiskers. \u0027Huntin\u0027 hunters. It\u0027s the only sport worth talkin\u0027 about.\u0027\n \u0027They say Quatermain and Roxton are better than you with a rifle, and the Russian who uses the Tartar warbow is the best of all.\u0027\n The Colonel brushed away the comparisons. \u0027They\u0027re all warm.\u0027\n Moran had a stiff arm out, holding back the clumsy bundle. \u0027We\u0027re on our own in this huntin\u0027 trip,\u0027 he said. \u0027The rest of the Ring aren\u0027t in it.\u0027\n Beauregard considered.\n \u0027It\u0027s been nearly a month since the last matter,\u0027 the Colonel said. \u0027Saucy Jack\u0027s finished. Probably cut his throat on one of his own knives. But that\u0027s not enough for us, is it? If business is to get back to the usual, Jack has to be seen to be finished.\u0027\n They were near the river. The Thames was a sharp, foul undertaste. All the filth of the city wound up in the river, and was disseminated into the seven seas. Garbage from Rotherhithe and Stepney drifted to Shanghai and Madagascar.\n Moran got a grip on the black winding sheet and wrenched it away from a pale, bloodied face.\n \u0027Druitt,\u0027 Genevieve said.\n \u0027Montague John Druitt, I believe,\u0027 the Colonel said. \u0027A colleague of yours, with very singular nocturnal habits.\u0027\n This was not right. Druitt\u0027s left eye opened in a rind of blood. He had been badly beaten.\n \u0027The police considered him early in the investigation,\u0027 Beauregard said - a surprise to Genevieve - \u0027but he was ruled out.\u0027\n \u0027He had easy access,\u0027 Moran said. \u0027Toynbee Hall is almost dead centre of the pattern made by the murder sites. He fits the popular picture, a crackpot toff with bizarre delusions. Nobody - beggin\u0027 your pardon, ma\u0027am - really believes an educated man works among tarts and beggars out of Christian kindness. And nobody is goin\u0027 to object to Druitt takin\u0027 the blame for the slaughter of a handful of harlots. He\u0027s not exactly royalty, is he? He don\u0027t even have an alibi for any of the killings.\u0027\n \u0027You evidently have close friends at the Yard?\u0027\n Moran flashed his feral grin again. \u0027So, do I extend my congratulations to you and your ladyfriend?\u0027 the Colonel asked. \u0027Have you caught Jack the Ripper?\u0027\n Beauregard took a long pause and thought. Genevieve was confused, realising how much had been kept from her. Druitt was trying to talk, but his broken mouth couldn\u0027t frame words. The coach was thick with the smell of slick blood and her own mouth was dry. She had not fed in too long.\n \u0027No,\u0027 Beauregard said. \u0027Druitt will not fit. He plays cricket.\u0027\n \u0027So does another blackguard I could name. That don\u0027t prevent him from bein\u0027 a filthy murderer.\u0027\n \u0027In this case, it does. On the mornings after the second and fourth and fifth murders, Druitt was on the field. After the \"double event\", he made a half-century and took two wickets. I hardly think he could have managed that if he\u0027d been up all night chasing and killing women.\u0027\n Moran was not impressed. \u0027You\u0027re beginnin\u0027 to sound like that rotten detective they sent to Devil\u0027s Dyke. All clues and evidence and deductions. Druitt here is committin\u0027 suicide tonight, fillin\u0027 his pockets with stones and takin\u0027 a swim in the Thames. I dare say the body\u0027ll have been bashed about a bit before he\u0027s found. But before he does the deed, he\u0027ll leave behind a confession. And his handwritin\u0027 is goin\u0027 to look deuced like those bloody crank letters.\u0027\n Moran made Druitt\u0027s head nod.\n \u0027It won\u0027t wash, Colonel. What if the real Ripper starts killing again?\u0027\n \u0027Harlots die, Beauregard. It happens often. We found one Ripper, we can always find another.\u0027\n \u0027Let me guess. Pedachenko, the Russian agent? The police considered him for a moment or two. Sir William Gull, the Queen\u0027s physician? Dr Barnardo? Prince Albert Victor? Walter Sickert? A Portuguese seaman? It\u0027s a simple matter to put a scalpel into someone\u0027s hand and make him up for the part. But that won\u0027t stop the killing...\u0027\n \u0027I didn\u0027t take you for such a fastidious sort, Beauregard. You don\u0027t mind servin\u0027 vampires, or - \u0027 a sharp nod at Genevieve \u0027 - consortin\u0027 with them. You may be warm but you\u0027re chillin\u0027 by the hour. Your conscience lets you serve the Prince Consort.\u0027\n \u0027I serve the Queen, Moran.\u0027\n The Colonel started to laugh, but - after a flash of razor lightning in the dark of the cab - found Beauregard\u0027s sword-cane at his throat.\n \u0027I know a silversmith, too,\u0027 Beauregard said. \u0027Just like Jack.\u0027\n Druitt tumbled off his seat and Genevieve caught him. His groan told her that he was broken inside.\n Moran\u0027s eyes glowed red in the gloom. The silvered length of steel held fast, point dimpling the Colonel\u0027s adam\u0027s apple.\n \u0027I\u0027m going to turn Druitt,\u0027 Genevieve said. \u0027He\u0027s too badly hurt to be saved any other way.\u0027\n Beauregard nodded to her, his hand steady. With a nip, she bit into her wrist, and waited for the blood to well up. If Druitt could drink enough of her blood as she drained him, the turn would begin.\n She never had any get. Her father-in-darkness had served her well, and she would not be a profligate fool like Lily\u0027s murgatroyd or Lord Godalming.\n \u0027Another new-born,\u0027 Moran snorted. \u0027We should\u0027ve been more selective when it all started. Too many bloody vampires in this business.\u0027\n \u0027Drink,\u0027 she cooed.\n What did she really know about Montague John Druitt? Like her, he was a lay practitioner, not a doctor but with some medical knowledge. She did not even know why a man with some small income and position should want to work in Toynbee Hall. He was not an obsessive philanthropist like Seward. He was not a religious man like Booth. Genevieve had taken him for granted as a useful pair of hands; now, she would have to take responsibility for him, possibly for ever. If he became a monster, like Vlad Tepes or even Colonel Sebastian Moran, then it would be her fault. She would be killing all the people Druitt killed. He had been a suspect: even if innocent, there was something about Druitt that had made him seem a likely Ripper.\n \u0027Drink,\u0027 she said, forcing the word from her mouth. Her wrist was dripping red.\n She held her hand to Druitt\u0027s mouth. Her incisors slid from their gumsheaths and she dipped her head. The scent of Druitt\u0027s blood was stinging in her nostrils. He had a convulsion and she realised his need was urgent. If he did not drink her blood now, he would die. She touched her wrist to his mashed lips. He flinched away, trembling.\n \u0027No,\u0027 he gargled, refusing her gift, \u0027no...\u0027\n A shudder of disgust ran through him and he died.\n \u0027Not everybody wants to live for ever,\u0027 Moran observed. \u0027What a waste.\u0027\n Genevieve reached across the space between them and backhanded the Colonel across the face, knocking away Beauregard\u0027s cane. Moran\u0027s red eyes shrank and she could tell he was afraid of her. She was still hungry, having allowed the red thirst to rise in her. She could not drink Druitt\u0027s spoiled dead blood. She could not even drink Moran\u0027s second- or third-hand blood. But she could relieve her frustration by ripping meat off his face.\n \u0027Call her off,\u0027 Moran spluttered.\n One of her hands was at his throat, the other was drawn back, the fingers gathered into a point, sharp talons bunched like an arrowhead. It would be easy to put a hole in Moran\u0027s face.\n \u0027It\u0027s not worth it,\u0027 Beauregard said. Somehow, his words cut through her crimson rage and she held back. \u0027He may be a worm, but he has friends, Genevieve. Friends you wouldn\u0027t want to make enemies of. Friends who have already troubled you.\u0027\n Her teeth slipped back into her gums and her sharpened fingernails settled. She was still itchy for blood, but she was in control again.\n Beauregard put up his sword and Moran ordered the cabby to stop the coach. The Colonel, his new-born\u0027s confidence in shreds, was shaking as they stepped down. A trickle of blood leaked from one eye. Beauregard sheathed his cane and Moran wrapped a scarf around his pricked neck.\n \u0027Quatermain wouldn\u0027t have flinched, Colonel,\u0027 Beauregard said. \u0027Good night, and give my regards to the Professor.\u0027\n Moran turned his face away into the darkness and the cab wheeled away from the pavement, rushing into the fog. Genevieve\u0027s head was spinning. They were back where they had started. Near the Ten Bells. The pub was no quieter now than when they left. Women loitered by the doors, strutting for passersby.\n Genevieve\u0027s mouth hurt and her heart hammered. She made fists and tried to shut her eyes.\n Beauregard held his wrist to her mouth. \u0027Here, take what you must.\u0027\n A rush of gratitude made her ankles weak. She almost swooned but at once dispelled the fog in her mind, concentrating on her need.\n \u0027Thank you.\u0027\n \u0027It\u0027s nothing.\u0027\n \u0027Don\u0027t be so sure.\u0027\n She bit him gently and took as little as possible to slake the red thirst. His blood trickled down her throat, calming her, giving her strength. When it was over, she asked him if it were his first time and he nodded.\n \u0027It\u0027s not unpleasant,\u0027 he commented, neutrally.\n \u0027It can be less formal,\u0027 she said. \u0027Eventually.\u0027\n \u0027Good night, Genevieve,\u0027 he said, turning away. He walked into the fog and left her, his blood still on her lips.\n She knew as little about Charles Beauregard as she had about Druitt. He had never really told her why he was interested in the Ripper. Or why he continued to serve his vampire queen. For a moment, she was frightened. Everyone around her wore a mask and behind that mask might be...\n Anything. \n","sourceLink":"https://allnovel.net/anno-dracula-anno-dracula-1/page-42.html","bookId":2524,"book":{"id":2524,"title":"Anno Dracula (Anno Dracula #1)","description":"Storyline: \n Anno Dracula (Anno Dracula #1) \n It is 1888 and Queen Victoria has remarried, taking as her new consort Vlad Tepes, the Wallachian Prince infamously known as Count Dracula. Peppered with familiar characters from Victorian history and fiction, the novel follows vampire Geneviève Dieudonné and Charles Beauregard of the Diogenes Club as they strive to solve the mystery of the Ripper murders. \n Anno Dracula is a rich and panoramic tale, combining horror, politics, mystery and romance to create a unique and compelling alternate history. Acclaimed novelist Kim Newman explores the darkest depths of a reinvented Victorian London. \n This brand-new edition of the bestselling novel contains unique bonus material, including a new afterword from Kim Newman, annotations, articles and alternate endings to the original novel.\n \n","cover":"https://allnovel.net/images/anno-dracula-anno-dracula-1.jpg","author":"Kim Newman","type":"Horror","source":"allnovel","link":"https://allnovel.net/anno-dracula-anno-dracula-1.html","creation":"Oct 5, 2019 8:58:50 AM","modification":"Oct 5, 2019 11:32:32 PM"}}
