{"id":91351,"no":12,"title":"Page 12","content":"\n “Hey, hey!” Lang said.\n “Please, God.” Groaning, Peter struggled upright, hooked his fingers around the iron bars snugged against the wall, and hung on, fists working the metal against another wave of pain. “No no no, Peter, don’t scream, Peter, don’t scream.”\n Not for the first time, Peter wondered how long and hard he’d have to whack his head for his skull to crack and his brain to squish out like runny yolk. Or he could let himself drift close to the bars where the Changed waited. Thread his hands through and pull Kate close, let her sink her teeth into his throat, give her the first taste. It would be over before the guards could beat her and her cellmates back. But he was a coward; he couldn’t let himself die. He wasn’t ready, and there were Penny and Simon to think about. There was Chris.\n Count; he should count. Counting was good. Ten cells, there are ten. . . . His feverish gaze touched on one after another. Five to a side, one two three four five . . . “This little piggy went to market, this little piggy stayed home, this little piggy had roast beef . . . help me, help me, help . . . bong, bong, bong . . .”\n “Okay, that’s pretty crazy,” Jug Ears said.\n “No, no, no, nononono,” Peter chanted, knuckling his temples, shaking his head back and forth. “Eight . . . eight eight eight eight days since the bells, but ten cells ten ten ten, ten little piggies, wee, wee, wee . . .” He heard his voice rising to a cracking falsetto. “Wee, wee, wee, weeweewee . . . no, stop! Stop, stop!” He wasn’t aware he was punctuating the word with a punch to his jaw until his knuckles barked with pain.\n “Shouldn’t we do something?” Jug Ears asked.\n “If he starts digging out his eyes or something,” said Lang. “He ever done that?”\n “Only once.”\n “Stop,” Peter panted, but he was no longer sure to whom he spoke. He had to let go of this, get control. He punched his jaw again and again, harder, harder! This time, the soft inner flesh of his cheek ripped against his teeth. His mouth flooded with the tang of metal and swamp water—the boat, deep in the dark—a taste he now knew very well. But this is me, this is good. He drank himself back. This is my blood; it’s not anyone I had to eat—\n “No.” He straightened abruptly as if a hidden spring had suddenly released at his waist. “I’m not going to think about that either. I’m going to think about something else. I’m going to think think think.” He began to pace the limits of his cage, past the eyes of the Changed but well away from their grasping hands and Kate, Kate, Kate, around and around and around. Count, do something, do anything, but get a grip. “Get a grip, get a grip, I’m Peter, I’m in a cell, I’m in a camp . . .”\n “You’re Peter, you’re in a cell, you’re in a camp.” Simon was an echo, a ghost from the graveyard of Peter’s memories. “You’re in a cell, this is hell, and I’m Simon, and it’s ten little piggies and they went wee wee wee . . .”\n “I’m not listening to you.”\n “You’re talking to me.”\n “I’m not hearing you!” Peter shouted, over the bong-bong-BONG. “Jesus, please, let me go!” The top of his head hurt so much it felt like someone had cratered his skull with a brick. Please, God, please. Why won’t you let me die?\n “Because it’s not your time,” Simon said.\n “But I can’t take this anymore.” Peter ran his tongue over his upper lip, skimming a rank and now very familiar lace of dried copper and old salt. “Please, Simon—”\n “Simon?” said Jug Ears.\n “Old rev’s grandson,” Lang said, bored. “Kid he was real close to.” “Grandson? I thought Chris Prentiss was Yeager’s grandson.” “Him, too—which is weird, ’cause the old guy had only one kid.” “So how’s that work?” asked Jug Ears.\n “Beats shit out of me,” said Lang.\n “You’re not allowed to die yet, Peter,” Simon said. “Penny and I need you.”\n “Don’t you think I know that?” Raging, he whirled, trying for a grab, coming up empty as Simon danced away, always out of reach. “You need me, Penny needs me. But I can’t help you right now—don’t you get that? I can’t even help myself !”\n “Who’s Penny?” Jug Ears said.\n “His sister. Guys from Rule said she was a real looker. Just”—Lang cupped his hands in front of his chest—“fine.”\n “Shut up!” Peter whipped his head so fast bloody spit flew. But in his heart, he was also glad because it gave him someone else to hate other than himself. “Don’t you say my sister’s name! Don’t you even think it!”\n “Gone by the time I got there. Heard she maybe went native.” Lang kept talking as if Peter wasn’t there—and this was so true, in so many ways. Lang skimmed the pale pink eel of his tongue over teeth stained black with decay and ancient nicotine. “Damn shame. Be real sweet to show all those girls what a man can . . .”\n “Shut up!” Fisting the bars in both hands, Peter cranked his elbows like a chimp. “Shut up, Lang! I’ll fucking kill you if you don’t shut up shut up shut up!”\n “Yeah, yeah?” Scraping back his chair, Lang reached for his scabbard. A whip of his wrist, and twenty-six inches of black chromed steel snapped into place. Lang advanced half the distance to Peter’s cell, smacking iron with sharp, clanging bang-bang-bangs that somehow synchronized to the bong-bong-bongs. In the other cells, the Changed cringed back. “You getting tough, boy, huh? You going to kill me? Like to see you try.”\n Yes! Go ahead, split my skull, pulp my brain, kill me kill me kill me! “Bring it, bring it!” Peter howled. “Come on, you prick, come on! You’re brave out there; you can talk about showing girls what kind of man you are, so come on!”\n Lang’s cheeks flooded scarlet. “Don’t think I won’t—”\n “Lang!” Jug Ears was on his feet. “I don’t think this is a real good—”\n “Shut up!” Advancing, Lang cut iron with a vicious BAP. “You little pissant—”\n “Peter.” It was Simon—and then it wasn’t. Calm and small, this voice was nonetheless powerful, a kick in the gut that knocked the wind right out of him. “Peter, don’t.”\n Like that, Peter felt the fight drain away, leaving him boneless, water-weak. He looked to his right, where Simon always hovered out of sight, then gasped as the air suddenly split—and Chris, shimmery and bright, slid into being.\n “Peter.” Chris’s face was a white blare. “Stop. You can’t beat them like this.”\n “Chris,” Peter breathed. His knees tried to buckle. The sight rocked him back so hard that if he hadn’t been clinging to the bars, he’d have crumpled to the filthy concrete. Chris couldn’t be here; he knew that. The fact that Chris was . . . What if he’s dead? No, please, God. Peter’s throat knotted with grief. His vision clouded, and he squeezed his eyes tight. “Chris, you can’t be here. I can’t be seeing you. I’m not.”\n “Yeah?” Lang barked. When he whapped the bars again, the sound was much weaker and didn’t hurt Peter’s ears as much. Why was that? “Look at me when I’m talking!”\n “Open your eyes, Peter,” Chris said. “Look at me. Let me help you.”\n “No.” He was trembling and cold, so cold. “If I do . . . if I can see you, it means you’re dead, or Changed and . . .”\n “See me,” Chris said. “Hear me.”\n He couldn’t help himself. His lids crept open, and then he cried out. Chris’s face was chalk-white, his eyes not black but a stunning, glistering violet. He shouldn’t look. He ought to cover his eyes. Keep this up, he’d go blind. But he was also afraid that if he took his gaze elsewhere—if he looked for Simon or doe-eyed Kate or Lang or even Finn—the sight would destroy him completely. The dark was its own terrible light.\n “I see you.” This was a hallucination, a vision conjured by a fevered mind because he had nothing else, no hope. I’ll never wake up from this, because I never sleep. “Chris . . . God . . . help me.”\n “I’ll help you.” Lang whapped the bars again.\n “I will.” Always the calm one, Chris’s voice was a cool cloth on a hot brow, water in the desert. “But you have to listen. You have to trust me and do what I say.”\n Chris wasn’t here any more than Simon was real. They were hallucinations. They were symptoms of the past and his choices and eyes like holes in stone and black water as deep and still as the grave. This was a conscience divided against itself. Yet if Chris was the voice of sanity, a piece of real estate in Peter’s mind no larger than a dime trying to talk itself down and help him survive . . . Listen to this voice, listen hard. “What?” Peter said. “What do you want me to do?”\n “Step away from the bars, Peter,” Chris said. “Don’t let them hurt you anymore. You’re not strong enough yet.”\n “I’m not anything anymore.” A slow, hot trickle leaked down his cheeks. “I’m not strong. Simon’s right. I’m nothing.”\n “Now you’re learning,” Lang said.\n “You can be strong again,” Chris said. “You will. But you must be brave enough to let go of this fight for now.”\n “But I’ll fall,” Peter said.\n “Only to the floor,” Chris said. “Trust me, Peter.”\n “Oooohhhh,” Peter moaned. He retreated four blundering steps before his joints completely unlimbered, and he sank to his knees.\n “See?” Lang broke down his baton. “Can’t let the little shit get on top of you.”\n They’re already on top of me. Bowing his head, Peter screwed his fists to his eyes like a weary child, and then he was choking, his pentup grief and guilt a terrible sound that still, somehow, seemed to quiet those damn bonging bells, just a little. Or maybe Lang was right, and whatever Finn had done would pass into something much worse, if that was even possible. He thought it might be, and he was afraid. Maybe it was good he couldn’t sleep, because when he woke, what would he be then? I’m sorry, Chris, I’m so sorry, I’m so— \n","sourceLink":"https://allnovel.net/monsters-ashes-trilogy-3/page-12.html","bookId":2566,"book":{"id":2566,"title":"Monsters (Ashes Trilogy #3)","description":"Storyline: \n Monsters (Ashes Trilogy #3) \n The Changed are on the move. The Spared are out of time. The End...is now. \n When her parents died, Alex thought things couldn\u0027t get much worse-until the doctors found the monster in her head. \n She headed into the wilderness as a good-bye, to leave everything behind. But then the end of the world happened, and Alex took the first step down a treacherous road of betrayal and terror and death. \n Now, with no hope of rescue-on the brink of starvation in a winter that just won\u0027t quit-she discovers a new and horrifying truth. \n The Change isn\u0027t over. \n The Changed are still evolving. \n And...they\u0027ve had help. \n With this final volume of The Ashes Trilogy, Ilsa J. Bick delivers a riveting, blockbuster finish, returning readers to a brutal, post-apocalyptic world where no one is safe and hope is in short supply. \n A world where, from these ashes, the monsters may rise.\n \n","cover":"https://allnovel.net/images/monsters-ashes-trilogy-3.jpg","author":"Ilsa J. Bick","type":"Horror","source":"allnovel","link":"https://allnovel.net/monsters-ashes-trilogy-3.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 5, 2019 5:47:30 PM"}}
