{"id":91365,"no":26,"title":"Page 26","content":"know what I’m doing.” “Do you?” In the Coleman’s flat light, her gray eyes were stones and her lips were purple. “Because I’m starting to wonder, Weller. No one is indispensable, not even Tom.” “Jesus Christ on a crutch, I hope you’re listening to yourself.” Exasperated, he turned, propping his butt against the kitchen counter. “Tom is actually the one person in this camp who is. Think about Luke and Cindi, what they’re willing to do for him. I guarantee not one kid would take a bullet for you or me.” “Tom is only useful so long as he remains an asset, Weller, not a liability. The last thing we need is for him to decide that this girl is alive and it’s his mission to track her down.” Weller had to work to keep the chagrin from making its way to his face. This was precisely what Tom thought and wanted: There was the ski pole, Weller. There’s the Glock. Tell me how I can ignore that. If those Chuckies got her out, if there’s even a chance she’s alive . . . “Why don’t you focus on the fact that he’s out of that damn tower, and he came back.” Although that, Weller thought, was more a matter of luck than anything else. If that Chucky hadn’t shown her face, he wasn’t sure Tom would’ve returned. He could picture the boy taking off, looking for some sign of where those Chuckies had taken Alex—which, he thought, wasn’t necessarily as crazy as it sounded. What Tom said about that entire fiasco on the ridge the night they blew the mine and the way those Chuckies just kept coming . . . made a lot of sense, damn it. “Right now, he wants to talk, so I’ll listen.” “Yeah, and I bet you’re just so very understanding.” Her eyes suddenly slitted. “Did you promise to help him look for her?” It was a little disconcerting that she’d jumped to that conclusion so easily. “Not exactly.” “Oh, for God—” She huffed. “What did you say?” “That when we’re done with Rule, if there’s some sign, a direction . . . I’ll help him.” Mellie’s mouth unhinged. “She’s dead, Weller. He’s basing this on a ski pole and a gun that’s not even hers.” “Look, Mellie, he’s not so far gone he doesn’t see it’s nuts, a long shot at best. But you weren’t up on that rise. You’re not carrying what he is. The last thing he needs is us rubbing his nose in it, or you interfering, lecturing . . .” “I will do whatever I think—” “Shut the hell up,” he rapped. “Mellie, I need you to listen good and hard. Tom is a soldier. He’s smart, he’s strong. He’s braver and more loyal than almost anyone I’ve ever known—” “And insane to go up there alone—” “Because he still has a heart to break,” Weller grated. “For God’s sake, Mellie, think for a damned second. Tom’s not eating; he’s barely slept. He’s grieving. Now, there’s that Glock, and he’s grabbed hold of this little bubble of hope, but it’s a fragile thing, and so is his soul, and I am not going to be the one to crush either. I know he has to let go eventually. He does, too, I think. But people let go in their own way at their own time. He’s not ready yet, but he will be. This fight was a good thing, all in all.” “How do you figure that?” “Nothing like a little near-death to make you reevaluate the merits of living,” Weller said, but didn’t smile. “That boy nearly got his head handed to him today, and that scared the hell out of him. Now, he’s talking and that’s good. But it can go either way. Push him too hard and he’ll bottle himself right back up. That’s what Tom does: handles things on his own.” “Like going to the lake by himself.” “Yeah, yeah.” She was tiring him out. “Can we get past this already? And give the kid some credit: other boys’d crawl into their bags and never come out after a fight like this.” “My God.” Her eyes sharpened. “You admire him. What is he, the boy you always wanted to be but weren’t? Or is it more? Don’t tell me you care about him. For heaven’s sake . . . he’s a tool, Weller.” “Anyone can tell you, you got to take good care of your tools, you want them to work.” “Don’t give me any of your folksy cowboy bullshit.” She let go of a humorless grunt. “So when the sudden conversion?” On the rise. When I heard her call and him answer and near about kill himself to get to her. Then I realized just what I’d done and that nothing, not even revenge, is worth this. If ever anyone needed to let go of the past . . . But he doubted it would be wise to share any of this with Mellie, who had her own allegiances and none of them to him. Showing her his back, Weller tore open a second packet of instant. The aroma of strong coffee hit him the way it always did, something so fine and good it hurt to think there would come a time when this simple pleasure would also vanish. No one would be importing coffee beans or manufacturing instant for years, maybe decades. “I’m only saying I understand where he’s coming from. I also think it’s in our best interest to get at what’s bothering him about that Chucky. I’m just not sold that he’s told us everything.” “Oh?” He practically heard her eyebrows arch. “What do you think he’s leaving out?” “I don’t think it’s conscious,” he said, tipping the pack of instant so the granules came in a slow stream. “Just a hunch. I think he knows something but can’t put his finger on it. Understand what I’m saying? Like seeing someone in a crowd you could swear you’ve met but you can’t remember their name or even how you know them. Anyway, I figure, sit with him awhile, don’t push, let him calm down . . . whatever’s bothering him will find its way out.” With a little help, that is. But Mellie didn’t need to know that. “Best thing for him now is some rest; then get him back out there with the kids. They’ll anchor him better than anything.” “Uh-huh.” Pause. “I wonder how well you and Tom will get along once we get to Rule.” His heart skipped a beat. Easy. Don’t let her goad you. He tried relaxing the angry jut of his jaw. “Yeah, what’s the word on that any way? How much longer we going to sit here?” “You have a problem with that?” He stirred, watching as the liquid quickened and grew dark. “Just asking.” Another pause. “We’re supposed to wait.” He turned a look. “For what?” She favored him with a wintery smile. “Well, let me see. You’re a little banged up, Tom is a mess, and only a few of these children can actually fight. I agree that with Tom back, it’s best to put his time to good use. Instead of running all over creation looking for a girl who’s dead, a few bombs, some flamethrowers—they’d be nice.” “But that’s not why we’re waiting,” he said. “He has plenty of firepower to spare. That’s where we got the C4 in the first place. So what’s the holdup?” “What do you care? Frankly, I’d think you’d be relieved. Every second we delay is one more when Tom never knows just how much you’ve lied.” Despite himself, he felt a jab of fear. “I don’t recall you being all that honest yourself.” “True, but you and Tom being blood brothers all of a sudden . . . have you ever considered that it might be better all around if Tom never makes it?” He gave her a sharp look. “Don’t you even think it.” “Someone has to.” She spread her hands, which were blunt and weathered, like the rest of her. “Once Tom discovers the truth, I wouldn’t be surprised if he can’t decide between throwing you to the Chuckies or killing you very, very slowly.” “Why don’t you let me worry about that?” “Sure. That’s your call . . . until it’s not. As for when we go”—she hunched a shoulder, then let it fall—“I do what I’m told. He wants us to wait.” Wait for what? That was the question. To be honest, the idea of going back to Rule wasn’t all that appealing, because Mellie was right. Weller had told a lot of lies to a lot of people. He’d thought that bringing down Peter, who really was to blame, then destroying the mine and killing all of Rule’s precious little Chuckies would ease the old grief that just wouldn’t let go. Or make the face of sweet dead Mandy finally fade. Yet he had done much worse, not only lying but turning in Kincaid, a friend, so that little pissant Aidan could do his devil’s work as Kincaid screamed and screamed, sacrificing himself to buy Chris time to get clear. And for what? If the cold hadn’t taken Chris, the Chuckies would’ve. Nathan, too, and the girl, Lena. And now here’s Tom, self-destructing in front of my eyes, and this is on me, too. “So.” He looked away from his thoughts to find her steady gray gaze. “Can you control him?” she said. “Oh yeah,” he said, not at all sure, and not liking that one bit","sourceLink":"https://allnovel.net/monsters-ashes-trilogy-3/page-26.html","bookId":2566,"book":{"id":2566,"title":"Monsters (Ashes Trilogy #3)","description":"Storyline: Monsters (Ashes Trilogy #3) The Changed are on the move. The Spared are out of time. The End...is now. When her parents died, Alex thought things couldn\u0027t get much worse-until the doctors found the monster in her head. She headed into the wilderness as a good-bye, to leave everything behind. But then the end of the world happened, and Alex took the first step down a treacherous road of betrayal and terror and death. Now, with no hope of rescue-on the brink of starvation in a winter that just won\u0027t quit-she discovers a new and horrifying truth. The Change isn\u0027t over. The Changed are still evolving. And...they\u0027ve had help. With this final volume of The Ashes Trilogy, Ilsa J. Bick delivers a riveting, blockbuster finish, returning readers to a brutal, post-apocalyptic world where no one is safe and hope is in short supply. A world where, from these ashes, the monsters may rise.","cover":"https://allnovel.net/images/monsters-ashes-trilogy-3.jpg","author":"Ilsa J. Bick","type":"Horror","source":"allnovel","link":"https://allnovel.net/monsters-ashes-trilogy-3.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 5, 2019 5:47:30 PM"}}
