{"id":91382,"no":43,"title":"Page 43","content":"hours? He was like this when I come on shift. Lang gave him a whack with his baton. Right there in the side . . . see where the bruise is coming up? Kid didn’t even flinch. Ask me . . . I don’t know. The way he’s breathing, he’s either real crazy or dying.” Both. Neither. Bwahahaha. Naked, eyes screwed shut, sprawled on the floor of his cell, Peter let go of another gargling, guttural groan and shuddered, his hands fluttering like dying moths. His skin was so caked in filth, huge dried chunks cracked from his flanks. And it’s showtime, folks. Dragging in another grudging inhale, he began to jitter and flop like a dying fish, spluttering and choking, the foam bubbling to froth over his lips. From the taste, there was some blood, too. The back of his head bounced against concrete and he felt a spray of pain, but it was muted and very distant. “Oh, shit, shit.” He heard the tinkling chatter of metal, then a clack as Old Coot slotted in a key. “Son of a bitch is having a fit. Come on, before he swallows his tongue.” “I don’t know.” Jug Ears. “Lang said we shouldn’t—” “Screw Lang. He’s not here. The boss is back, too, from that training exercise. Now, you want to explain how this kid choked to death on his own damn tongue while we watched it go down with our thumbs up our butts? Get something to stick between his teeth and come on!” There was a harsh bawl of metal hinges, and then boots on concrete. A hand on his forehead now and another on his jaw. Jug Ears, on his left, shouting: “Okay, I got a ruler, I got a ruler. Come on, open his mouth, open his mouth!” “Hang on,” Old Coot grunted, trying to hook his fingers in the soft notches at the corners of Peter’s mouth and away from his clashing teeth. Peter obliged, letting his lower jaw sag, throwing in a choking guh guh guh for good measure. “Jesus, he’s goddamn dying.” Old Coot wrenched Peter’s jaws open so far Peter heard the tendons creak. “Damn it to hell! Come on, get that thing in there, get it over his tongue, get it—” “I got it.” A rigid edge of wood sliced Peter’s lower lip, and then there was a tick-tick-tick-tick as Jug Ears tried butting the ruler between the shelves of Peter’s teeth. Jug Ears wormed his fingers over Peter’s tongue. “I got it,” Jug Ears sang, “I got—” Peter snapped, hard and fast. There was an audible crunch, a burst of blood in his mouth, and then he was grinding his jaws from side to side, his teeth sawing through skin and stringy tendons down to the joints. The bones snapped as Jug Ears screeched and beat at Peter’s face with his free fist: “Get him off, get him off, get him—” Spitting out the ruin of what had been two fingers, Peter surged from the floor. His left hand was already driving for the man’s throat, his right sweeping up the dropped ruler. Jug Ears got out a pained gah as Peter cocked his right elbow and then pistoned fast, driving the ruler into the old man’s mouth. Jug Ears gave a tremendous jerk. A huge gush of blood jetted, hot and wet, splashing Peter’s face and hand. Through the wood, Peter could feel the harder plate of bone at the back of the man’s throat. The guard’s eyes bugged; his hands flew to Peter’s wrist and tried clawing the ruler free, his nails and jagged splinters of bone from his missing digits frantically scoring Peter’s wrist. Rearing up, Peter flipped Jug Ears onto his back, stabbed the ruler down like a pike, and bellowed: “Eat it, eat it, eat it!” There was another bony crunch, this one duller, muted by the boil of blood. Jug Ears flailed in a brief but violent spasm as if he’d stuck a wet finger in a live socket, the connections between brain and body suddenly severed as the ruler slammed through to skewer vertebrae and the delicate spinal cord. All this took less than five seconds. Without pause, Peter rounded on Old Coot, who’d scuttled back only a few feet and was now fetched up against the iron bars of Peter’s cage. His knobbed fingers scrabbled for his pistol, but when Peter’s shadow swam over his body, the guard screamed: “N-nuh-nuh-noooo!” Horror bleached all the color from the guard’s face, and Peter had a moment’s clarity where he understood what he must look like to this old man: naked, painted with gore, a Medusa’s crown of jungle hair, as inexorable as fate. He was something born from a nightmare, or hell. “D-don’t look at m-me with th-those eyes!” Old Coot shrieked. “I n-never . . . I never h-hurt you!” “True,” Peter said. “But you never helped me either.” * * * Two minutes later, flipping the globe of Old Coot’s left eyeball onto his tongue, he was at the door. He’d strapped the guard’s knife to his right calf but taken nothing else. No clothes, no coat, no boots, not even gloves. He didn’t need any of that. But it’s cold, Peter. It was that still-sane, dime-sized portion of his mind. You’re outnumbered. Don’t you think you might want a rifle and some clothes? “Clothes are for the rest of you.” Swallowing back eye jelly, he worried the lens between his teeth, then crunched. About the consistency of a slightly stale Tic-Tac, minus the peppermint. From the milky color, Old Coot had been on his way to a major cataract. He felt the press of the Changed staring but didn’t look back. Although, yes, he had considered releasing them—Fly, my pretties, fly, fly!—and taking the doe-eyed Kate right there on the filthy concrete in the bargain. But while he was nuts, he wasn’t crazy. As strong as he was now, he doubted even he would survive a fight with so many Changed. Instead, cocking his head, he listened with his oh-so-acute hearing for Lang or another guard. All that came was the sough of the wind. The icy air smelled of razors and cut through the sour reek steaming from his flesh. I want to be clean. Sprinting across the threshold, he plunged facefirst into a pillow of snow. His heart gave a startled jump at the shock of it, a baptism first of ice and then fire as his skin shrieked. After so long in the prison house, it was the most wonderful thing he’d ever felt in his life. Gasping, he rolled once, twice, came to rest on his back. Clots of snow clung to his hair; he could feel lumps of ice on his lashes. He let out a laugh that was another of those breathy, ecstatic moans. Snow cupped his back; he was melting into it but felt no cold. For him, cold was only a concept, nothing more than a faraway twinkle of a distant star. I am new. He felt the winged presence, the one that had been growing for days now, pulse and swell. Its low muttering surged. Yes. He pounded his chest with a fist. Yes, yes! He was butt-naked and maybe out of his mind, but this was his time, it was his. No one’s ever seen anything like me before. I’m a fucking warrior, I’m— A very distant, very dull thud. And another. His ears tingled as his brain translated: boots, on snow, coming this way. Lang. Or Finn. Either would do. Rising, he bulleted down the wooded path toward a bend where, if he remembered right, the hemlocks were thick—the perfect cover because no one remembered to look up. His feet slapped snow, a dull puh-puh-puh-puh. His soles should be shredded, cut by ice, but he felt no pain at all, no fingers of cold kneading his flesh. Wind tugged his blond hair. His heart thumped, strong and steady, fueled by the manic exhilaration of the winged thing and freedom. Ahead, hemlocks pulled together out of the gloom. Then he spied a knotty red pine to the right. This was better still because its lowest limbs were even higher, a good six feet off the ground and big around as his thigh. Backing up, he dug in with his toes, and took off in a diving run. He didn’t even think about whether he might slip. As a boy, he’d climbed higher, taken greater risks. The thought did flash through his mind that, really, he wasn’t a featherweight kid clambering up to his tree house to read or dream or sneak his first smoke; that this was an awful risk; and where was he finding the strength, the stamina? Then he stopped thinking, and leapt. His palms slapped wood, his fingers hooked, and then he was heaving, boosting himself from the snow, swinging up like a gymnast. Hitching a leg up and around, he seated himself, got a foot under and then the other, and stood. To his right, another branch jutted at a thirty-degree angle, an easy straddle. The path was directly between the V of his legs. Reaching into his long blond hair, he fished out a slender spike of bone. The bone, which he’d hidden between his butt cheeks, had come from that left foot. Over the last week, he’d laboriously ground the bone to a needle: perfect for popping an eye or jamming through a throat. Of course, if all else failed, he still had the knife. His hands. His teeth. But he really wanted to try out the bone. His ears prickled with the sound of a man’s breaths, the squeal of snow. Wait for it, wait . . . In the well of his mind, the winged thing waited, too: taut, breathless. Then Lang was there, passing immediately below: a hunched, plodding old man in olive-drab. Now. Peter dropped. There was a millisecond’s free fall, the rush of air past his ears. At the last instant, Lang must’ve sensed something, because Peter saw a startled, silver oval flicker up and then the black holes of Lang’s eyes. Eyes, eyes in the dark, eyes in stone. Peter’s feet hammered Lang’s forehead, an impact that jarred Peter’s heels and shivered into his shins. A wild ah leapt from Lang’s mouth. Peter hit the snow, rolled, set his feet, then swarmed over Lang, still turtled on his back, who was gagging and choking against blood. Lang saw him coming, tried getting his hands up, but Peter batted them away and dropped on Lang’s chest. As Lang began to buck, Peter slammed Lang with a stunning blow. There was a crackle as Lang’s nose caved, and more blood, a river of it. “Ha-how?” Lang gargled. The old man was far down in the snow, with no leverage at all. He tried a weak punch that Peter blocked with his forearm. “How d-did you . . .” “Does it matter?” Planting his knees in the knobs of the man’s shoulders, Peter ground down until Lang moaned. Jamming the bone needle between the second and ring fingers of his right hand, Peter cupped his left over Lang’s throat and squeezed—not a crushing grip but enough that Lang’s face suddenly darkened. Peter held the quivering spike of bone just above Lang’s left eye, so close that Lang’s eyes crossed. “You’re a traitor and I’m going to kill you. But first I’m going to blind you. You’ll hear it, that little pop.” Leering, Peter dragged his tongue over his lower lip, cleaning it of Lang’s blood. “Then I’ll eat it. I’ll rip out your tongue so you can’t scream. I’ll take you apart a piece at a time.”","sourceLink":"https://allnovel.net/monsters-ashes-trilogy-3/page-43.html","bookId":2566,"book":{"id":2566,"title":"Monsters (Ashes Trilogy #3)","description":"Storyline: Monsters (Ashes Trilogy #3) The Changed are on the move. The Spared are out of time. The End...is now. When her parents died, Alex thought things couldn\u0027t get much worse-until the doctors found the monster in her head. She headed into the wilderness as a good-bye, to leave everything behind. But then the end of the world happened, and Alex took the first step down a treacherous road of betrayal and terror and death. Now, with no hope of rescue-on the brink of starvation in a winter that just won\u0027t quit-she discovers a new and horrifying truth. The Change isn\u0027t over. The Changed are still evolving. And...they\u0027ve had help. With this final volume of The Ashes Trilogy, Ilsa J. Bick delivers a riveting, blockbuster finish, returning readers to a brutal, post-apocalyptic world where no one is safe and hope is in short supply. A world where, from these ashes, the monsters may rise.","cover":"https://allnovel.net/images/monsters-ashes-trilogy-3.jpg","author":"Ilsa J. Bick","type":"Horror","source":"allnovel","link":"https://allnovel.net/monsters-ashes-trilogy-3.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 5, 2019 5:47:30 PM"}}
