{"id":91394,"no":55,"title":"Page 55","content":"\n “Because Peter never came back to school,” she said. “And about six months later, Simon tried to kill himself.”\n Plopping down on the last step up from the boathouse, Alex decided to steal a few minutes to spaz in private. Chugga-chugging ahead like the little asthmatic engine that could, Darth was already halfway to the house. Or maybe he was daring her to run so he could shoot first, eat second, and ask questions later.\n You have lost your mind, honey. She propped her back against a knotty red pine. The pistol knuckled her spine. She’d slipped the capped syringe into a right cargo pant pocket. What was she thinking? Wolf always slept close. If he sniffed or felt that pistol? She was sunk.\n So far, all her grand schemes had been pipe dreams of an oh-sodaring getaway. But now, she had a real weapon. Two, if she counted the tanto. (That funky syringe she wasn’t sure about. The more she mulled over that feathery thing, the more she thought: fletchings. Was this some kind of dart?) But no kidding around this time. Execute this just right—blind someone, set a few Changed on fire—she could swipe a couple rifles, have herself some real gun-guns. For that matter, she could’ve shot Darth right then and there. Of course, a twelve-gauge shell in a tiny little gun had to be loud. Still, she could’ve grabbed his rifle and skedaddled before anyone knew what was going on. If she really wanted to throw a monkey wrench into things? Set the house on fire. Those propane canisters she’d found, combined with popcorn-dry, resin-rich pine certain to throw off a ton of sparks—what’s not to like?\n So what’s wrong with me? Wolf ’s not here. So it wasn’t a question that she might hurt or kill him. But whoever was left standing might take it out on Wolf. That would be on her. And so what?\n Tired of this endless, mental rat race, she reached into her parka, withdrew the candy bar, inhaled memories. Jump, sweetheart. “I agree, Dad.” She slid another nibble of candy onto her tongue. “Live a little.”\n Why care about Wolf ? How long was she supposed to be grateful? Wolf was not Chris. She was starting to think like those kidnap victims . . . what was it? Stockholm syndrome? Sympathy with the devil’s more like it. She worried coconut between her teeth. What is this, I kissed a zombie and liked it? He ate part of your shoulder, for God’s sake. So what if he protects you now? He put you in this position—\n She suddenly stiffened. Hello. That familiar and yet very weird scent—wolf and not-wolf—was very close, much more so than ever before. Dead ahead, in fact, and practically in her lap. Oh shit. Did it sense easy prey? Here she was, alone, in the open. What help she might count on—hah!—was too distant to do her any good, if Darth even bothered.\n Just be calm. The scent hadn’t deepened to And, oh, what big teeth you have, but she felt her heart giddyap in a spastic gallop. She inched her eyes, sweeping up from untrammeled snow to the denser green of the woods and a screen of low cedar—and it was right there, so perfectly still that were it not for its scent, she’d never have known where to look.\n What , she thought, are you?\n A flare gun? Sighing, Chris massaged his aching temples and let himself sink more deeply into the bed. What the hell had Penny been thinking?\n He was alone again, Hannah having locked him in almost a half hour ago, according to the old clock. He could hear her moving around in the kitchen downstairs, caught the chatter of plates and chinks of glass as she put together food to take out to Isaac in the lambing barn. His own lunch still waited. He should probably eat, but the prospect of dragging himself off the bed made him groan and pull a pillow over his eyes to blot out the bright afternoon light. After two weeks spent dreaming, he’d have thought he would never want to lie down again. Yet the creep of a deep weariness was too powerful to ignore, the bed very inviting—and he needed some time to digest all this.\n Having burned so bright and hot, Peter’s boat sank fast in water over five hundred feet deep. Neither it nor the dead girl were ever recovered, and so they joined the litter of wrecks at the bottom of the largest and deepest of the Great Lakes. Which meant that Peter’s story—an engine room fire ignited by an electrical short—never could be investigated. According to Hannah, the Coast Guard and then the police questioned them but got nowhere. Simon was the only eyewitness who hadn’t been drinking, and he backed up Peter.\n “I knew what I’d seen,” Hannah had said. “But it all happened so fast, I kept thinking I might be wrong. I didn’t know it was even a flare until Simon finally told me. Can you believe Penny still had the gun? After she shot it off, she crammed everything into her pockets.”\n From below came the muted thump of a door: Hannah, leaving for the barn. The silence settled. His clock ticked off the seconds.\n Why Hannah kept in touch with Simon was a mystery. All she said was, We got close. Even so, Simon’s suicide attempt was a shock. But Chris could see it. He understood the impulse.\n Your father kills his girlfriend. Chris hugged the pillow to his eyes. You—the little kid—help him hide the evidence. You lie to the police because your dad says it’s the only way.\n He remembered that, too. His father, reeking of booze, the smell of blood wreathing him like a fog: They’ll split us up, boy. Put you in a home where there won’t be no one to give a shit about you. You want to be safe? You don’t want boys and old men doing filthy things to you? You want a roof over your head? Then this is what you’re gonna say. This is what you’re gonna do.\n “Shut up, Dad,” Chris muttered. “It was never about me. It was always about protecting you.” And keeping secrets until you wake up one day to find you live with two monsters, the one with your dad’s face and the thing rotting inside—\n “Chris.”\n The sound of his name felt unreal, like the slash of an exclamation point at the end of a sentence you hadn’t realized you’d written. The sound was short and sharp, like knuckles on a door, and knocked him from his thoughts. Before he could reply, he heard the doorknob rattle.\n “Come in,” he said, not moving from the bed. Probably Hannah, back from the barn, wanting his dishes. When he didn’t hear the hinges complain, he waited a moment. “Hannah?”\n The knock came again. This time, he tossed the pillow with a groan. “Hang on,” he said, swinging his feet to the floor. That was when he remembered. “I can’t unlock it from my side.”\n Hannah said something he didn’t catch. “What?” he called. She said something else, but her voice was muffled. There was another rattle, followed this time by the scrape of the bolt. Without thinking much about it, he turned the knob and pulled open the door. “Sorry, I was—”\n Everything in him—his brain, his breath and blood, the thump of his heart—stopped.\n There, her lime-green scarf still twined around her neck, was Lena.\n 65\n Alex had been right. It was a wolf—and it wasn’t. Some kind of hybrid. This animal was much larger than even a malamute, but without the curlicue tail. Its fur was virtually white, with only streaks of gray. The shape of the head, snout, and ears reminded her of Jet, Chris’s black German shepherd, but the facial markings and light black mask resembled a husky.\n Why show itself now? Was that because of the candy? What it thought was an offer of food? Possibly, but the scent wasn’t right. Like the alpha wolf, this animal’s scent didn’t scream hunger or danger. Over the lingering sweetness of chocolate and coconut, she could taste the emptiness here, all cold dust and gray ash. This wolfdog was both alone and lonely.\n But where did you come from? For that matter, why had it risked following her? Maybe it was like the dogs before: how they always clamored to be near and protect her, if need be.\n They stared at one another. Unlike Jet, the wolfdog’s eyes were an intense, stunning gold. Only after they’d locked gazes did she remember that it was dangerous to stare down a wild animal. Yet as their eyes held, that lonely taste again washed over her tongue; her chest ached. It had been a long time since she’d seen a dog. Even a wolfdog was somehow more normal. It made her feel . . . human.\n Moving slowly, she swiveled her head to the right. Head jutting like a Neanderthal’s, Darth was clomping past the wraparound porch, heading for Bert and Penny, who were just emerging from the woods. From the crinkly nip in the air, she knew they’d hauled back mostly desert-dry pine, which she, oh joy, would then sort through, because these kids just didn’t learn: pine + fire \u003d big trouble. But this meant she had a few more minutes.\n She turned back to the animal. “Hey, boy, whatcha doing?” she said, softly, knowing better. This was something poor, cranky, sweet little Ellie would’ve done: Hey, strange animal, come give me rabies. The thought pushed a lump into her throat. If Ellie magically reappeared, she could make nice to every animal in the forest, and Alex wouldn’t bat an eye. She should know better, too. Given Wolf ’s interesting fetish, encouraging this animal to stick around was a death warrant. But she suddenly longed to touch it. Just ruffle her fingers behind its ears. Selfish, she knew, but she really, really needed this.\n “Hey, boy, whatcha doing? You stealing my food? Huh? That’s okay,” she soothed, and saw the tip of its tail twitch back and forth. Relax, breathe out; let go, so it can. “But next time, you think you might leave me some—”\n There was a sudden urgent push in her head, a kind of mental shove in the center of her brain. A split second later, she felt a heaving sensation that was like the unfolding of arms and legs, the swiveling of a gigantic head, the baring of needle-teeth. The opening of yellow eyes. What the hell? Her mind shimmied as if the ground were shifting under her feet, the snow ready to let go and carom down a rise and sweep her away. Gasping, she flinched away, nearly tumbling down the steps, barely aware of the wolfdog’s small, queer yip of alarm.\n The monster? Why was it waking up now? Not because of Wolf. There was no way to get used to a monster, but she was beginning to sense a difference in what the monster did. Never fully asleep now, the monster always poked its nose up for a sniff whenever Wolf was near. That feeling was close to her dream: fire and need. Desire. The monster reaching out in a lover’s embrace because it wanted Wolf. \n","sourceLink":"https://allnovel.net/monsters-ashes-trilogy-3/page-55.html","bookId":2566,"book":{"id":2566,"title":"Monsters (Ashes Trilogy #3)","description":"Storyline: \n Monsters (Ashes Trilogy #3) \n The Changed are on the move. The Spared are out of time. The End...is now. \n When her parents died, Alex thought things couldn\u0027t get much worse-until the doctors found the monster in her head. \n She headed into the wilderness as a good-bye, to leave everything behind. But then the end of the world happened, and Alex took the first step down a treacherous road of betrayal and terror and death. \n Now, with no hope of rescue-on the brink of starvation in a winter that just won\u0027t quit-she discovers a new and horrifying truth. \n The Change isn\u0027t over. \n The Changed are still evolving. \n And...they\u0027ve had help. \n With this final volume of The Ashes Trilogy, Ilsa J. Bick delivers a riveting, blockbuster finish, returning readers to a brutal, post-apocalyptic world where no one is safe and hope is in short supply. \n A world where, from these ashes, the monsters may rise.\n \n","cover":"https://allnovel.net/images/monsters-ashes-trilogy-3.jpg","author":"Ilsa J. Bick","type":"Horror","source":"allnovel","link":"https://allnovel.net/monsters-ashes-trilogy-3.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 5, 2019 5:47:30 PM"}}
