{"id":91419,"no":80,"title":"Page 80","content":"\\n\\n “Amanda was just the nicest girl,” Jack Laparma, a close friend, said. “She’d had some hard times, but she was completely determined, ready to move on.”\\n\\n Pederson is reported to have enjoyed snowmobiling as well as time spent with family and friends.\\n\\n The names of Pederson’s fellow passengers as well as the boat’s owner are currently being withheld until a preliminary investigation is completed and a cause of the engine fire can be established. Given the loss of the boat, however, and the reported lack of eyewitness accounts, a source close to the current investigation suggested that the death will be classified as accidental. No criminal charges are currently pending or anticipated.\\n\\n Pederson is survived by her parents, Claire and Benjamin; a brother, Theodore; and grandparents Ron and Esther Pederson of Houghton, and William and Rosemary Weller of Marenisco. The picture accompanying the article showed Weller’s granddaughter in jeans and a tee, sitting atop a picnic table. In the background was a river, boats, and a lift bridge.\\n\\n The Polaroid was so aged most of the color had bled. The ghostly image of two men posed before a Quonset. Each held an M16. Both wore camo battle dress, but only Weller, just as grizzled then as now, sported three tabs on his left sleeve—special forces, rangers, and airborne—and a smoke tucked behind one ear.\\n\\n The man Tom zeroed in on stood to Weller’s right: grim and blocky, with a barrel chest and thighs like tree trunks. His skull was so large, his dark hair, cut high and tight, looked like the bristles of a broom.\\n\\n On the back, in faded ballpoint: Finn ’68 Ben Tre. The name of the town or village meant nothing to Tom. He squinted at Finn’s uniform, trying to make out his rank. Major or lieutenant colonel—and was that a medical corps insignia? He thought it might be. Weller’s three chevrons put his rank as a sergeant. A commander and his sarge. Now, Tom had two names: Chris Prentiss and Finn.\\n\\n Which monster to take on first . . . that was the question.\\n\\n Weller had marked the most likely spots where Rule might post archers, but Tom spotted none, and no arrows came whizzing from the trees. While he was happy not to end up with an arrow through his neck or in his back, Tom began to suspect that something was seriously wrong. By the third block in from the woods, he was positive.\\n\\n The doors of every house stood open. From the splintered jambs and screens hanging at cockeyed angles, these were forced entries. Each home had been stormed, searched, and then—his eyes drifted to a drippy, red, spray-painted X right of a jamb—ticked off the to-do list. Raids for food and other supplies would be his first guess.\\n\\n But what if they were looking for Chuckies? If Rule’s children and grandchildren and all their friends had returned, going door-to-door to hunt them down made sense. The timing was about right. Judging from blown snow in front halls, whatever happened was a couple weeks back. But you wouldn’t stop there, would you? There was no timetable, no way of knowing when more kids might show up. You’d mount patrols and guards. So where was everyone?\\n\\n He turned a slow, careful circle. Long icicles fanged eaves and gutters on those homes with southern and western exposures. Most of the houses facing north were mantled with thick snow. Anyone still around would need to stay warm. He sniffed and got a light scent of wood smoke: drifting down from the northeast and the center of town. He still didn’t hear anything other than the faint sough of a light breeze. But people would be conserving energy, not moving around much.\\n\\n Something orange and large suddenly slunk around the corner of a two-story to his left. Startled, he spun, Uzi up before he realized what he was looking at. The instant the cat spotted Tom, it froze, one paw poised above the snow. Something furry dangled from its jaws. They regarded one another for a beat. He couldn’t speak for the cat, but his heart was hammering. Evidently unimpressed, the cat trotted up snowy steps, then eeled through an open front door.\\n\\n Tom lowered his weapon. A cat? This made no sense. You break down doors; you look for supplies. In a starvation situation, pets were fair game. Dogs, he could see sparing; they sensed Chuckies. You needed horses, too. But no one really needed—\\n\\n If he hadn’t been staring after the cat, he never would have seen them. As it was, what his eye snagged on was a distant olive-green blur—a parka—and a quick spark of sun in the far woods to the left behind the house.\\n\\n Theoretically, you could get into Rule any number of ways. Those two boys angling through the trees must have dropped down from the north. Both had rifles and were moving slowly, cautiously, their heads tilted to the snow. They hadn’t spotted him yet, but they would.\\n\\n Darting up the steps, he bolted into the house after the cat. As soon as he was inside, he noticed two things at the same time: a long-dried bloodstain on the floor and the stink of decay. That cat had a nice stash of rotting mice somewhere. Trotting past a narrow understairs closet to his left, he moved into the kitchen, which was a shambles. Cupboards stood open, drawers had been pulled and dumped. The pantry door was open by a hair. Several floorboards had been pried up, too, both in the pantry and out here, leaving dark rectangular slots wide enough for a person to drop through. The aroma of decay was stronger here, as was the smell of cold dirt from the crawl space under the house. The cat was nowhere in sight.\\n\\n Sidestepping a gap, he peered over a window sill above the sink. The two boys were just clearing a woodpile alongside a detached garage. Both simultaneously looked over their shoulders at something further back. One boy—smaller, a mop of brown hair—made a warding-off gesture, waving someone back. Bad news, if there’s more than just these two. Craning, he took his eyes away a split second to see if he could make out who else was there, and how many.\\n\\n It was a split second too long. When he jumped his gaze back, the other boy—older, taller, dark-eyed—was looking right at him.\\n\\n “Shit!” he hissed. He ducked, already knowing it was too late. But he still might be able to avoid a fight. Pivoting, he started out of the kitchen, intending to head for the second story because it was always easier to defend high and he might be able to make his way out a window. Something flickered to his left, and he saw a boy dashing around to the front and the second, taller boy, down low, wheeling around the kitchen side steps.\\n\\n No time for the stairs. Dropping to a sit, Tom threw his legs over the edge of the gap in the kitchen floor, then slid all the way through. No more than two feet high, the crawl space was virtually pitch black except for thin stringers of light dashing through chinks in the floor. The air reeked of mildew and the eye-watering stench of dead mice. Tongue cringing from the clog of decay, he took small sips through his teeth as he slithered, on his belly, over cold earth and deeper into the crawl space. The smell of rot and, now, a septic system desperately in need of emptying. The people who’d lived here must’ve kept on crapping until their toilets overflowed.\\n\\n Far enough. Turning onto his side, he faced the way he’d come. Light glimmered through the gap. If they looked, they wouldn’t see him so long as he remained still. Then he remembered that Chuckies saw very well in the dark. Either way, if it came down to a fight, he thought he had a chance. Even with Jed’s Bravo in its scabbard, there was a foot of clearance between his Uzi and the underbelly of the house, plenty of room to roll.\\n\\n Take out anything that comes through the gap. He tucked the silenced Uzi to his chest, business end trained on that wedge of silver light. After that, he would have to be fast. The remaining kid could shoot down, but both boys were carrying bolt-actions. He fingered the Uzi’s selector to full auto. Shoot up, really spray it, and then—\\n\\n Directly over his head, the floorboards creaked. A soft screee. More steps, the gauzy light rippling as the boy moved across the kitchen. He heard more thumps as the second boy came down the front hall. Cringing back, Tom tried making himself as small as possible—\\n\\n And felt a hand on his shoulder.\\n\\n 99\\n\\n A scream surged up Tom’s throat, crashed over his tongue, then flattened against the wall of his teeth. Tucking, he rolled away, once, twice, then brought the silenced Uzi to bear. Just before it was too late, in the split second before his finger tightened on the trigger and sprayed gunfire he could not take back, he saw what he’d missed before, because his eyes hadn’t adjusted and he’d been focused on the gap, not what waited at his back, in the dark.\\n\\n The Chucky who’d decided on the crawl space as his personal meat locker had been a busy, busy boy. In the gray gloaming, Tom thought there might be as many as four bodies, but certainly two, because of the heads. (Pro forma for an accurate count at any bomb scene: forget heads. Heads pop like corks from champagne. Count left feet.) The soft, fleshy parts—eyes, noses, lips, tongues—were gone. The heads stared with wide, black-eyed wonder. One body was being systematically consumed from the waist up, the Chucky probably reaching in and scooping out all the good stuff before setting to work on the leaner rib meat. Alongside a half-gnawed thigh was a spool of colon in a neat cobra’s coil.\\n\\n Jesus. Fear spidered down his neck. Either those boys were living here, or had dropped by to grab a quick snack. And here, I’ve saved them the trouble of hunting me down.\\n\\n But they hadn’t figured out where he was yet. Sweat oozing over his temples, he rolled away from the grisly sight and readied the Uzi. He could still take them. If these Chuckies weren’t the only ones, or they lived nearby, he would have to make tracks pretty fast. Maybe this was why the village had pulled back: because there were too many Chuckies and no way to defend against them all. But then I should’ve spotted more, not just these two . . .\\n\\n Then, he heard one of the boys: “Did you—”\\n\\n “—hear that?” Jayden whispered. From his place in the middle of the kitchen, Chris gave Jayden a slow nod, then put a finger to his lips. The sound had been brief, a kind of scurry like a rat or opossum. Or a raccoon. He tipped a look at the hole in the floor. From the smell, it seemed as if something had taken up residence. Maybe the cat, whose prints he’d spotted in back. His gaze inched from the hole to the hall beyond Jayden. In the weak light, he saw watery tread marks. Too late to ask Jayden if there’d been water before. \\n\\n","sourceLink":"https://allnovel.net/monsters-ashes-trilogy-3/page-80.html","bookId":2566,"book":{"id":2566,"title":"Monsters (Ashes Trilogy #3)","description":"Storyline: Monsters (Ashes Trilogy #3) \\n The Changed are on the move. The Spared are out of time. The End...is now. \\n When her parents died, Alex thought things couldn\u0027t get much worse-until the doctors found the monster in her head. \\n She headed into the wilderness as a good-bye, to leave everything behind. But then the end of the world happened, and Alex took the first step down a treacherous road of betrayal and terror and death. \\n Now, with no hope of rescue-on the brink of starvation in a winter that just won\u0027t quit-she discovers a new and horrifying truth. \\n The Change isn\u0027t over. \\n The Changed are still evolving. \\n And...they\u0027ve had help. \\n With this final volume of The Ashes Trilogy, Ilsa J. Bick delivers a riveting, blockbuster finish, returning readers to a brutal, post-apocalyptic world where no one is safe and hope is in short supply. \\n A world where, from these ashes, the monsters may rise.\\n","cover":"https://allnovel.net/images/monsters-ashes-trilogy-3.jpg","author":"Ilsa J. Bick","type":"Horror","source":"allnovel","link":"https://allnovel.net/monsters-ashes-trilogy-3.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 5, 2019 5:47:30 PM"}}
