{"id":79653,"no":23,"title":"Page 23","content":"I close my fists into tiny balls and keep them glued to my side. I have to control myself here. I have no choice. I can’t lunge at him like a hormonal freak, which is exactly what I am right now. I clear my voice, trying to play it cool.\\n\\n “Are you sure? Because the most you’re getting out of me are club sodas.”\\n\\n “I’m okay with that,” I hear him whisper. “For now.” His bottom lip slides in between his teeth, and the temperature in the room instantly rises by twenty degrees. Penny’s has turned into a bloody sauna and my mind has scattered into oblivion as I struggle to stand.\\n\\n But I do manage to stand and stare at Trent as the grating announcer’s voice comes over the microphone. “Gentleman …” The next dancer is on her way out. I’ve learned how to drown that voice out, and have no trouble doing it now as I lose myself in Trent’s presence.\\n\\n That is until I hear:\\n\\n “… A special feature performance of the night … Storm!”\\n\\n “You’ve got to be f**king shitting me!” I spin around, checking the bar to find Ginger and Penelope behind it. All attention is transfixed to the stage in anticipation as a mystical green glow hangs over the stage, like they’re waiting for a life-altering performance and not another naked girl in a strip club. My naked friend. “Ohmigod. This is going to be so awkward. She didn’t even warn me!” I don’t realize I’m moving back until I bump into Trent’s inner thigh.\\n\\n “You don’t have to watch, you know,” he whispers into my ear.\\n\\n The slow throb of a dance beat starts pounding through the club, and a spotlight lifts above the stage to illuminate a scantily clad female body, sitting in silver hoop, suspended. I can’t look away, even if I want to.\\n\\n It’s Storm in a sequined bikini that leaves nothing to the imagination, floating in the air on this metal hoop. When the music picks up, she flips backward, every muscle in her arm straining as she dangles by one hand. With no visible effort, she folds her legs back over and fluidly slides her body through the hoop to hold another impressive pose. The music picks up tempo and she kicks her legs out, gaining momentum until the hoop swings back and forth like a pendulum. Then suddenly she’s hanging by her arms, spinning fast, her hair flying through the air, her body contorting and diving into various graceful poses. She’s like one of those people in Cirque du Soleil—beautiful, poised, doing things I never believed humanly possible.\\n\\n “Wow,” I hear myself murmur, mesmerized.\\n\\n Storm is an acrobat.\\n\\n The scrap of material covering her br**sts somehow flies off.\\n\\n Storm is a stripper acrobat.\\n\\n Something brushes against my fingers and I flinch. My head jerks down to see Trent’s hand resting on his knee, his fingertips an inch away from mine. So close. Too close, and yet I don’t pull away. Something deep inside me spurs me forward. I wonder if there’s any chance … what if … Inhaling, I look up into his face and see a world of calm and possibilities. For the first time in four years, the thought of a hand covering mine doesn’t send me into a dizzying spiral down.\\n\\n And I realize that I want Trent to touch me.\\n\\n Trent doesn’t move though. He stares at me, but he doesn’t push. It’s like he knows this is a bridge I’ve all but torched and turned away from. How does he know? Storm must have told him. Keeping my focus locked on those gorgeous blue eyes, I force my hand to close the distance. My fingers are trembling, and that voice screams at me to stop. She screams that this is a mistake; that the waves are waiting to crash down over my head, to drown me.\\n\\n I shove the voice aside.\\n\\n So slow, so light, my fingertip skims his index finger.\\n\\n He still doesn’t move his hand. He remains completely frozen, as if waiting for me to make my move.\\n\\n Swallowing hard, I let my entire hand skate over his. I hear a sharp intake of air as he gasps, his jaw clenching. His eyes are locked on mine and they’re unreadable. Finally, his hand shifts and covers mine, his fingers gently slipping in between. Not forceful, not rushed.\\n\\n A load roar of approval erupts on the fringe of my eardrums, but I barely hear it over the rush of blood in my ears. One … two… three … I began taking those ten little breaths.\\n\\n I can’t contain the euphoria swelling inside me.\\n\\n Trent’s touch is full of life.\\n\\n I’m sure I hear glass shattering somewhere nearby, but I’m too stunned for anything to register. “Is this okay?” he whispers, his brow pulled together before I can process his question, his hand is wrenched out of mine as a pair of giant mitts land on his shoulders, tearing the warmth and life with it.\\n\\n “You’ll need to leave, sir,” Nate’s voice thunders. “No touching the ladies.”\\n\\n My peripherals catch motion beneath me. Looking down, I find a bus boy sweeping up the shards of Trent’s empty glass. I guess it slipped out of my free hand.\\n\\n “Is it okay?” Trent asks again earnestly, like he knows it might not be okay to touch my hand. Like that’s a perfectly acceptable fear to have. Like I’m not a head case.\\n\\n Try as I might, I can’t open my mouth or move my tongue. I’m suddenly like a statue. Petrified.\\n\\n “Kacey!”\\n\\n Nate yanks Trent back and out the door and I do nothing but watch him go, that intense pleading gaze riveted to my face until it’s out of sight.\\n\\n Everything seems wobbly as I wander back to the bar in a daze. The walls, the people, the dancers, my legs. I mumble an apology to Ginger for taking more than fifteen minutes. She waves it away with a smile as she pours someone a drink. With wooden movements, I turn back to see that a shapely native woman has taken center stage, doing some sort of rain dance reenactment in a scant feather costume. Storm is nowhere to be seen.\\n\\n The world moves forward, oblivious to this significant shift in my tiny universe.\\n\\n Stage Four ~ Acceptance\\n\\n Chapter Seven\\n\\n “So, what’d ya think?” Storm interrupts the silence in the car on the ride home.\\n\\n I frown, not understanding her question. My mind’s still stuck on Trent, on the feel of his hand; on me, standing there like an idiot, not saying a thing. I’m so wound up over Trent and that pivotal moment that I’m for once not fazed by the confines of Storm’s Jeep. He held my hand. Trent held my hand and I didn’t drown.\\n\\n I notice Storm’s small fists curled tightly around her steering wheel and she’s looking everywhere but at me. She’s nervous. “What do I think about what?” I ask slowly.\\n\\n “About … my show?”\\n\\n Oh! Right. “I don’t know how those boobs of yours don’t throw your balance off.”\\n\\n Her head tips back and she laughs. “It took some getting used to, believe me.”\\n\\n “Seriously, that was the most amazing thing I’ve ever seen. What the hell are you doing in a strip club? You could be in Cirque du Soleil or some shit like that.”\\n\\n I catch a hint of sadness in her giggle. “Not a lifestyle I can handle anymore. That means training all day and shows all night. I can’t do that with Mia to care for.”\\n\\n “Why is this the first show I’ve seen?”\\n\\n “I can’t do that every night. It’s hard enough to stay upright and get a bit of a work out in everyday.”\\n\\n Huh. Storm works out. I had no idea. “Why didn’t you tell me?”\\n\\n She shrugs. “We all have our secrets.”\\n\\n My eyes drift out the window. “Well, that’s one hell of a way to reveal a secret.” \\n\\n","sourceLink":"https://allnovel.net/ten-tiny-breaths-ten-tiny-breaths-1/page-23.html","bookId":1854,"book":{"id":1854,"title":"Ten Tiny Breaths (Ten Tiny Breaths #1)","description":"Storyline: Just breathe, Kacey. Ten tiny breaths. Seize them. Feel them. Love them. \\n Four years ago Kacey Cleary’s life imploded when her car was hit by a drunk driver, killing her parents, boyfriend, and best friend. Still haunted by memories of being trapped inside, holding her boyfriend’s lifeless hand and listening to her mother take her last breath, Kacey wants to leave her past behind. Armed with two bus tickets, twenty-year-old Kacey and her fifteen-year-old sister, Livie, escape Grand Rapids, Michigan, to start over in Miami. Struggling to make ends meet, Kacey needs to figure out how to get by. But Kacey’s not worried. She can handle anything—anything but her mysterious neighbor in apartment 1D. \\n Trent Emerson has smoldering blue eyes, deep dimples, and he perfectly skates that irresistible line between nice guy and bad boy. Hardened by her tragic past, Kacey is determined to keep everyone at a distance, but their mutual attraction is undeniable and Trent is determined to find a way into Kacey’s guarded heart—even if it means that an explosive secret could shatter both their worlds.\\n","cover":"https://allnovel.net/images/ten-tiny-breaths-ten-tiny-breaths-1.jpg","author":"K.A. Tucker","type":"Romance","source":"allnovel","link":"https://allnovel.net/ten-tiny-breaths-ten-tiny-breaths-1.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:17:57 PM"}}
