{"id":14448,"no":55,"title":"Chapter V.","content":"THE gentlemen came upstairs looking very cheerful and friendly, so of course everything had been satisfactory in their conversation. After a little while Mr. Cresswell came to tell me all about it. He said the papers seemed all quite satisfactory, and he had no doubt Mrs. Langham was really Richard Mortimer’s daughter, the nearest, and indeed only relation, on the Mortimer side of the house, that we had in the world. “I have no doubt about it,” said I; “but I am very glad, all the same, to have it confirmed. Now, my dear child, you know that we belong to each other. My sister and I are, on your father’s side, the only relations you have in the world.” Milly turned round to receive the kiss I gave her, but trembled and looked as if she dared not lift her eyes to me. Somehow I believe that idea which brightened her husband, came like a cold shadow between her and me, the thought that I would take care of her when he was away. It was very unreasonable, to be sure; but, dear, dear, it was very natural! I did not quarrel with her for the impulse of her heart. “But softly, softly, my dear lady,” said Mr. Cresswell; “the papers all seem very satisfactory, I admit; but the ladies are always jumping at conclusions. I shall have to get my Irish correspondent to go over the whole matter, and test it, step by step. Not but that I am perfectly satisfied; but nobody can tell what may happen. A suit might arise, and some of these documents might be found to have a flaw in it. We must be cautious, very cautious, in all matters of succession.” “A suit! Why, wouldn’t Richard Mortimer, if he were alive, be heir-at-law? Who could raise a suit?” cried I. I suppose he saw that there was some anxiety in my look which I did not express; and, to be sure, he owed me something for having thwarted and baffled him. “There is no calculating what mysterious claimant might appear,” said Mr. Cresswell, quite jauntily. “I heard somebody say, not very long ago, that all the romance now-a-days came through the hands of{253} conveyancers and attorneys. My dear lady, leave it to me; I understand my own business, never fear.” I felt as if a perfect fever possessed me for the moment. My pulse beat loud, and my ears rang and tingled. “What mysterious claimant could there be to the Park?” I cried. I betrayed myself. He saw in a moment that this was the dread that was on my mind. “Quite impossible to say. I know no loophole one could creep in through,” he said, with a little shrug of his shoulders and a pretended laugh. “But these things defy all probabilities. It is best to make everything safe for our young friends here.” Now this, I confess, nettled me exceedingly; for though we had taken so much notice of his daughter, and had lived so quietly for many years, neither Sarah nor I had ever given up the pretensions of the Mortimers to be one of the first families in the county. And to hear an attorney speaking of “our young friends here,” as if they were falling heirs to some old maiden lady’s little bit of property! I was very much exasperated. “It seems to me, Mr. Cresswell, that you make a little mistake,” said I. “Our family is not in such a position that its members could either be lost or found without attracting observation. In a different rank of life such things might happen; but the Mortimers, and all belonging to them, are too well known among English families, if I am not mistaken, to allow of any unknown connections turning up.” Mr. Cresswell immediately saw that he had gone too far, and he muttered a kind of apology and got out of it the best way he could. I drew back my chair a little, naturally indignant. But Cresswell, whose father and his father’s father had been the confidential agents of our family, who knew very well what we had been, and what we were whenever we chose to assert ourselves,—to think of him, a Chester attorney, patronising our heirs and successors! You may imagine I had a good right to be angry, and especially as I could see he was quite pluming himself on his cleverness in finding out what was in my mind. He thought it was a whim that had taken possession of me, no doubt,—a kind of monomania. I could even see, as he thought it all quietly over by himself over his cup of tea, what a smile came upon his face. Young Langham, however, just then contrived to gain my attention. He did it very carefully, watching his opportunities when Milly was not looking at him, or when he thought she{254} was not looking at him. “I am heartily glad to have found you out now, of all times,” said the young man. “Milly would not have gone to her relations in Ireland, and I have no relations. She will be very lonely when we are gone. Poor Milly! It is a hard life I have brought her into, and she so young.” “You are not much older yourself,” said I; “and if you children bring such trouble on yourselves, you must be all the braver to bear it. I doubt if she’d change with Sara Cresswell at this moment, or any other unmarried young creature in the world.” The young man looked up at me gratefully. “I can’t tell you how good she is,” he said, in his simplicity. “She never breaks down nor complains of anything. I don’t understand how she has saved and spared our little means and made them do; but she has, somehow. Now, though she’s pale with thinking of this—don’t you think she’s pale? but I forgot, you never saw her before—she has set all her mind upon my outfit, and will hear of nothing else. I wish it were true what the books say. I wish one’s young wife would content herself with thoughts of glory and honour; indeed, I wish one could do as much one’s self,” said the good young fellow, with a smile and sigh. “I fear I am only going, for instance, because I must go; and that I’ll cast many a look behind me on my Milly left alone. She’s just twenty,” he said, with an affectionate look at her which brought her eyes upon us and our conversation, and interrupted so far the confidential character of the interview between him and me. “Say nothing about it just now,” said I, hurriedly, “it only vexes her to hear you talk of what she is to do; leave her alone, dear soul—but at the same time don’t be afraid. The very day you go I’ll fetch her to the Park. She shall be our child while you are away—and it is to the Park you shall come when you come home. But say nothing about it now. She cannot bear to think of it at present. When the worst is over she’ll breathe again. Hush! don’t let her hear us now!” “But you know her, though you don’t know her,” said he, under his breath, with a half-wondering grateful look at me that quite restored my good-humour. I remember I nodded at him cheerfully. Know her! I should like to know who had as good a right! These young creatures can’t understand how many things an old woman knows. Here Milly came up to us, a little jealous, thinking somehow{255} we were plotting against her. “Harry is talking to you of something?” she said, with a little hesitation in her voice. “On the subject we both like best, just now,” said I. “But I wish you both to go with me to the Park. You can manage it, can you not? The dear baby, and the little nurse, and—but the fat Italian? Ah! he doesn’t belong to you. “No! he was in great triumph to-night; his master has come home,” said young Langham. “He does not belong to us; but he is a devoted slave of Milly’s for all that.” “His master came home to-night!” I repeated the words over to myself involuntarily; and then a sudden thought struck me in the feverish impulse which came with that news. “Children,” said I, with a little gasp, “it is deeply to all our interest to know who that young man is. I can never rest, nor take comfort in anything till I know. Will you try to have him with you to-morrow, and I will come and speak to him? Hush! neither the Cresswells nor anybody is to know; it concerns only us Mortimers. Will you help me to see him at your house?” “You are trembling,” said Milly, suddenly taking hold of my hand. “Tell Harry what it is and he will do it. He is to be trusted; but it will agitate you.” “I cannot tell Harry, for I do not know,” said I, below my breath, leaning heavily upon the arm, so firm and yet so soft, that had come to my aid. “But I will take Harry’s support and yours. It shall be in your house. Whatever is to be said shall be said before you. Thank heaven! if I do get agitated and forget myself you will remember what he says.” “It is something that distresses you?” said the young stranger, once more looking into my face, not curious but wistful. I should have been angry had Sara Cresswell asked as much. I was glad and comforted to see Milly anxious on my account. “I cannot tell what it is; but whatever it is, it is right that you should know all about it,” said I. “For anything I can tell you it may interfere both with your succession and ours. I can’t tell you anything about it, that is the truth! I know no more than your baby does how Mr. Luigi can have any connection with our family; but he has a connection somehow—that is all I know. To-morrow, to-morrow, please God! we’ll try to find out what it is.” The two young people were a good deal startled by my{256} agitation; perhaps, as was natural, they were also moved by the thought of another person who might interfere with the inheritance that had just begun to dazzle their eyes; but as I leaned back in my chair, exhausted with the flutter that came over me at the very thought of questioning Mr. Luigi, my eyes fell upon Mr. Cresswell, still sipping a cup of tea, and quietly watching me over the top of his spectacles; and at the same moment Sara came in from the back drawing-room with great agitation and excitement in her face. I could see that she scarcely could restrain herself from coming to me and telling me something; but with a sudden guilty glance at her father, and a sudden unaccountable blush, she stole off into a corner, and, of all the wonderful things in the world, produced actually some work out of some fantastic ornamental work-table or other! That was certainly a new development in Sara. But I could read in her face that she had seen him too. She too had somehow poked her curls into this mystery. All around me, everybody I looked at, were moved by it, into curiosity or interest, or something deeper—I, the principal person in the business, feeling them all look at me, could only feel the more that I was going blindfold to, I could not tell what danger or precipice. Blindfold! but at least it should be straightforward. I knew that much of the to-morrow, which it made me tremble with excitement to think of; but I knew nothing more.","sourceLink":"http://novel.tingroom.com/jingdian/1702/50146.html","bookId":1151,"book":{"id":1151,"title":"The Last of the Mortimers","description":"简介： I THOUGHT I heard a slight rustle, as if Sarah had taken off her spectacles, but I was really so interested in the matter which I was then discussing with Mr. Cresswell, our solicitor, that I did not look round, as I certainly should have done in any...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1702","creation":"Aug 1, 2019 12:24:28 AM","modification":"Aug 1, 2019 12:24:28 AM"}}
