{"id":11332,"no":20,"title":"Chapter 19: Liegnitz.","content":"\"I have news,\" the count said, when he came in to lunch, after he had been down into the town; \"a messenger has come in with a despatch this morning, saying that the king, with his army, is marching hither with all speed.\" An exclamation of alarm broke from Thirza, and one of surprise from Fergus. They had been in the garden together all the morning. \"It will be but a day or two earlier,\" Fergus said in a low tone to her. \"I told you that in three days, at the most, I must leave. The surgeon gave me six weeks, but I have so thoroughly recovered that I feel I ought to be with the king.\" Then he raised his voice. \"That is startling news indeed, count; but I can hardly believe that he intends to besiege Dresden. He has no siege guns with him, and though, I suppose, he has as usual got a start of Daun, he can hardly hope to capture the city before the Austrians come up. At any rate, I must ride out and report myself, and join him as soon as he gets close. It is hard, indeed, at this moment. Still, there is no question but that it is my duty.\" \"I see that, and I am sure that Thirza would not wish to keep you from it. As long as you are a soldier, duty is the first thing. However, as the king is coming hither, we shall doubtless see you sometimes. As we are half a mile outside the walls, we shall be within the besieging lines.\" \"I hope that if the king besieges, count, it will not be on this side, for you might be exposed to shot from the town batteries.\" \"If we are so, we must move beyond their range and go to our place at Wirzow. That is but twelve miles away. It is a small house, but will do very well for a time.\" \"I should hope, count, that there will be no occasion for that. The king cannot hope to lay siege in regular form, though he may try an assault. Slow as Daun is, he must be here within ten days or so of Frederick\u0027s arrival; and it is probable that the march here is intended rather to draw Daun away from his Russian allies, than with any hope of taking Dresden.\" \"Will you go this afternoon?\" \"I think that I ought to, count. If the news has come that Frederick is marching to besiege Dresden, he cannot be far away; for it is certain that he will march as fast as he can, and will himself follow closely on the news. \u0027Tis plain that Lacy feels himself unable to oppose him, and must be falling back with all speed before him. If I were to report myself this evening as convalescent, I can join him tomorrow, if I find that he is but a march away.\" \"I will take you in my carriage, as before,\" the count said. \"I can get back here before dark.\" Two hours later they started, Thirza consoled to some extent by the assurance that, in all probability, Fergus would be back again in the course of two or three days. They found that the Austrian advanced posts had already been withdrawn, and experienced no difficulty with the Prussians; so that by five o\u0027clock they arrived at the hospital, the count at once starting on his return journey. Karl was delighted at seeing his master looking himself again. \"I hardly thought that a month could do so much for you,\" he said, \"especially as you were mending but slowly, before you went.\" \"Yes, I was a poor creature then, Karl; and I did not think, myself, that I should be really fit for work for some time to come; but at any rate, in such weather as this, I have no fear of breaking down.\" Putting on his uniform, he went to the principal medical officer, and reported his return and his fitness for duty. \"You have certainly gained strength a great deal faster than I expected, Colonel Drummond. I don\u0027t know that you are fit for any really hard work, but I suppose that you will be at least a week before you join the king; and by that time you may be able to do a fair amount of work.\" \"I fancy I shall join the king tomorrow, doctor.\" \"Tomorrow?\" the surgeon repeated in surprise. \"Yes, sir. Have you not heard the news? The king is marching with all speed this way. I do not know what his intention is--to force Lacy to give battle single handed before Daun can arrive, or to besiege Dresden--but in the city they believe that they are going to be besieged.\" \"This is news indeed,\" the surgeon said. \"The scouts brought in word this morning that a considerable force was seen, coming along the road from Bautzen. It must be Lacy\u0027s army.\" \"We may be sure that the king is pretty close at his heels,\" Fergus said. \"I have no doubt that by tomorrow morning we shall have news of him, and I fancy that I shall not have far to ride to join him.\" The opinion was justified. That evening Lacy joined the Confederate army, in their strong position behind the gap of Plauen. He had been hotly chased, indeed. Frederick had been manoeuvring to pass Daun and carry on a campaign in Silesia; but the Austrian general had been too cautious, and it was impossible to pass him without fighting; so on the night of the 8th he left Bautzen suddenly and silently, and marched all night, in hopes of catching Lacy at Godau. The latter\u0027s Croats, however, brought him news in time, and he at once retreated. After a short halt the Prussians pressed on for another eighteen miles, capturing some of Lacy\u0027s hussars, but failing to come up with his main body; which, marching all that day and the next night, arrived near Dresden on the morning of the 10th, Lacy himself reaching the town the evening before. By Thursday evening the whole of his army had crossed Dresden bridge and got in safely behind Plauen, leaving ten thousand men to aid the four thousand in the garrison. At noon Fergus, hearing that, without doubt, the whole of the enemy had fallen back, started with Karl; and that evening rode into the royal camp, and reported himself to the king. \"I am glad to see you back, Drummond,\" Frederick said heartily. \"I have sorely missed you; and indeed, when I rode away the accounts of you were so bad that I doubted whether you would ever be able to be with me again. You don\u0027t look quite yourself yet, but no doubt the air and exercise will soon bring you round. Have you any news?\" \"Lacy has left ten thousand men in Dresden, sire, and with the rest of his force has joined the Confederate army at Plauen.\" \"Just what I wished,\" the king said. \"It has saved me a long march, and we will now go straight to Dresden.\" The next day the army marched forward, circled round the western and southern sides of Dresden, and encamped at Gruna, a mile to the southeast of the city; and throughout the night laboured at getting up batteries. The division under Holstein was planted on an eminence on the other side of the river, across which a pontoon bridge was at once thrown. There was no fear of disturbance from Lacy, the united force of the enemy having retreated to the old Saxon camp at Pirna. The king, after seeing the batteries marked out, retired to bed early; and Fergus was able to ride round and pay a short visit to the count. On the 14th the batteries opened fire--Maguire having refused the summons to surrender--and continued for four days without making much impression upon the walls, the heaviest guns being only twenty-five pounders. On the 18th some heavy guns arrived from Magdeburg. The batteries were all ready for them, and as soon as they arrived they were set to work. Maguire burnt the suburbs outside the town, and answered the cannonade hotly. Finding that the guns on the walls did but little damage to the Prussian batteries, Maguire mounted two or three guns on to the leads of the Protestant church, and from this commanding position he was able to throw shot right into them. The Prussian fire was at once concentrated on the church, which was speedily set on fire. This spread through the surrounding streets, and a tremendous conflagration raged for the next forty-eight hours. But by this time Daun, who had lost some days before setting out in pursuit of Frederick, was within five miles of the town, had driven Holstein across the river, and was in communication with Maguire. On the night of the 21st-22nd Maguire\u0027s garrison, led by General Nugent, sallied out from Dresden; while four thousand of Daun\u0027s men marched round from the north side. For a time the assault on the Prussian intrenchments was successful, although Nugent was, on his first attack, repulsed and taken prisoner. But when Daun\u0027s people arrived the regiments defending the trenches were driven out. Then fresh battalions came up and drove the Austrians out, taking many prisoners. Daun remained passive for some days after this, and Frederick continued to cannonade the city until the 29th; making, however, his preparations for departure, and going off unmolested by the enemy towards Meissen. The news reached him that Glatz, one of the barrier fortresses of Silesia, had been taken by Loudon, and that the latter was besieging Breslau. Daun had guessed the way by which Frederick would retire, and had broken up the roads and bridges, and felled trees in the forests so as to render them impassable; and as soon as Frederick started he moved in the same direction, his position so serving him that, marching by a road parallel to that taken by the king, he was ahead of him. Lacy had been warned to be prepared, and he too started with his army, so that the three forces moved eastward at a comparatively short distance apart. Although hampered by the obstacles in their way, and by a train of two thousand wagons, the Prussians moved rapidly and covered a hundred miles in five days. Daun made what was, for him, prodigious efforts also, and kept the lead he had gained. On the 7th of August Frederick was thirty miles west of Liegnitz. Here he halted for a day, and on the 9th marched to the Katzbach valley, only to find that Daun was securely posted on the other side of the river, and Lacy on the hills a few miles off. The next morning Frederick marched down the bank of the Katzbach to Liegnitz, Daun keeping parallel with him on the other side of the river. Knowing that Daun had been joined during the night by Loudon, and that they were vastly too strong to be attacked, Frederick started at eleven at night, and at daybreak was back on his old camping ground. He crossed the river, hoping to be able to fall upon Lacy; but the latter had moved off, and Frederick, pressing on, would have got fairly ahead of his enemies if it had not been for the heavy baggage train, which delayed him for five hours; and by the time it came up he found that Lacy, Daun, and Loudon were all round him again. The situation seemed desperate. The army had but four days\u0027 provisions left, and a scout sent out on the 12th reported that the roads over the hills were absolutely impassable for baggage. At eight o\u0027clock the army set out again, recrossed the Katzbach, and again made for Liegnitz, which they reached after a sixteen hours\u0027 march. Here the king halted for thirty hours, and his three enemies gathered round him again. They were ninety thousand strong, while he was but thirty. Daun made elaborate reconnaissances, and Frederick had no doubt that he would be attacked, that night or early the next morning. After dark the army marched quietly away, and took up its position on the heights of Torberger, its fires being left burning brightly, with two drummers to beat occasionally. Daun\u0027s and Lacy\u0027s fires were clearly visible; but they, like his own, were deserted, both having marched to catch him, as they hoped, asleep at Liegnitz; but it chanced that Loudon had been ordered to take post just where Frederick had halted, and his troops came suddenly upon the Prussians in the dark. A battalion was despatched at once, with some cannon, to seize the crest of the Wolfberg. Loudon, whose work was to prevent Frederick from flying eastward, had hurried forward; his scouts having informed him that a number of the Prussian baggage waggons were passing, and hoped to effect a capture of them; and he was vastly surprised when, instead of finding the baggage guard before him, he was received with a tremendous musketry fire and volleys of case shot. He at once rallied his troops and, with five battalions in front, dashed forward. He was repulsed, but returned to the attack three times. He kept edging round towards the right, to take Frederick in flank; but the Prussians also shifted their ground, and met him. The Austrian cavalry poured down again and again, and fresh battalions of infantry were continually brought up. At last Loudon felt that the contest was hopeless, and fell back across the Katzbach. The Prussians captured six thousand of his men before they could get across the river, four thousand were killed and wounded, and eighty-two cannons captured. Thus his army of thirty-five thousand strong had been wrecked by the Prussian left wing, numbering fifteen thousand; the rest of the Prussian forces, under Ziethen, keeping guard lest Daun and Lacy should come on to aid him. Daun, however, was miles away, intent upon catching Frederick; and did not know until morning that his camp had been deserted, and Loudon beaten. As soon as he was assured of this, he poured his cavalry across the river, but Ziethen\u0027s cannon drove them back again; and he saw that, with Ziethen standing in order of battle, in a commanding position, with his guns sweeping the bridges, he could do nothing. Frederick remained four hours on the battlefield, collected five thousand muskets lying on the field and, with the six thousand prisoners, his wounded, and newly-captured cannon, marched away at nine o\u0027clock in the morning. A Russian force of twenty-four thousand still blocked the way; but, desirous above all things to effect a junction with Prince Henry, Frederick got rid of them, by sending a peasant with instructions to let himself be taken by the Russians. The slip of paper he carried contained the words: \"Austrians totally beaten this day. Now for the Russians, dear brother, and swift. Do what we have agreed upon.\" The ruse had its effect. The Russian general, believing that Frederick and Prince Henry were both about to fall upon him, retreated at once, burning the bridge behind him; and the king pushed on to Breslau, which he reached on the 16th; having, thanks to the wonderful marching of his troops, and his own talent, escaped as if by a miracle from what seemed certain destruction. For a fortnight Frederick remained encamped, at a short distance from Breslau, waiting to see what Daun and Soltikoff intended to do. Daun was busy urging the Russians to come on. Soltikoff was sulky that Daun had failed in all his endeavours, and that the brunt of the affair was likely, again, to fall on him and his Russians. Elsewhere things had gone more favourably for the king. Ferdinand of Brunswick had now twenty thousand British with him, and fifty thousand Hanoverians and Brunswickers; while the French army under Broglio was one hundred and thirty thousand strong. A check was first inflicted on the French at Korbach and, a few days later, an English cavalry regiment and a battalion of Scotch infantry cut up or captured a brigade of French dragoons. On the 29th of July, as Frederick was leaving Dresden, a serious engagement took place at Warburg. Here Broglio\u0027s rear guard of thirty thousand infantry and cavalry, under the Chevalier du Muy, were attacked; in the first place by a free corps called the British Legion, composed of men of many nationalities, who turned Du Muy\u0027s right wing out of Warburg. Then the Prince of Brunswick fell upon the whole French line, and the fight was a stubborn one for two or three hours, Maxwell\u0027s British brigade fighting most obstinately. They were greatly outnumbered, but were presently joined by Lord Granby, at the head of the English cavalry, and these decided the battle. The French lost fifteen hundred killed, over two thousand prisoners, and their guns; the allies twelve hundred killed and wounded, of whom eight hundred were British, showing how large a share they had taken in the fighting. Another good bit of news for Frederick was that Hulsen, whom he had left to watch the enemy in Saxony, had, with ten thousand men, defeated an army thirty thousand strong; who, as they thought, had caught him in a net. The Russians had fallen back, but only to besiege Colbert again. Prince Henry was ill, but Frederick had made a junction with his army, bringing his force up to fifty thousand. During the whole of September there were marches and counter-marches, Frederick pushing Daun backwards, and preventing him from besieging any of his fortresses, and gradually cutting the Austrians from their magazines. General Werner on the 18th, with five thousand men, fell suddenly upon fifteen thousand Russians covering the siege of Colbert, defeated, and scattered them in all directions. The Russian army at once marched away from Colbert; not however, as Frederick hoped, back to Poland but, in agreement with Daun, to make a rush on Berlin. One force, twenty thousand strong, crossed the Oder. The main body, under Fermor, for Soltikoff had fallen sick, moved to Frankfort; while Lacy, with fifteen thousand, marched from Silesia. On the 3rd of October the Russian vanguard reached the neighbourhood of Berlin, and summoned it to surrender, and pay a ransom of four million thalers. The garrison of twelve hundred strong, joined by no small part of the male population, took post at the gates and threw up redoubts; and Prince Eugene of Wuertemberg, after a tremendous march of forty miles, threw himself into the city. The Russian vanguard drew off, until joined by Lacy. Hulsen, with nine thousand, had followed Lacy with all speed; and managed to throw himself into Berlin before the twenty thousand Russians arrived. There were now fourteen thousand Prussians in the city, thirty-five thousand Russians and Austrians outside. The odds were too great. Negotiations were therefore begun with the Russian general Tottleben, and Berlin agreed to pay one million and a half thalers, in the debased coin that now served as the medium of circulation. Lacy was furious and, when he and the Russians marched in, his men behaved so badly that the Russians had, two or three times, to fire upon them. Saxon and Austrian parties sacked Potsdam and other palaces in the neighbourhood, but the Russians behaved admirably; and so things went on until, on October 11th, came the news that Frederick was coming. Lacy at once marched off with all speed towards Torgau; while Tottleben and the Russians made for Frankfort-on-Oder, the Cossacks committing terrible depredations on the march. The king halted when he heard that Berlin had been evacuated. He was deeply grieved and mortified that his capital should have been in the hands of the invaders, even for three days; and his own loss, from the sacking of Potsdam and other palaces, was very heavy. However, he paid the ransom from his own pocket, and bitterly determined to get even with the enemy, before winter came on. While Hulsen was away, the Confederate army had captured all the strongholds in Saxony. Daun had, as usual, advanced with his sixty thousand men, and intended to winter in Saxony; but before he could get there, Frederick had dashed south and recaptured Wittenberg and Leipzig, crossed the Elbe, and driven the scattered corps of the Confederate army before him. Prince Eugene had also hurried that way, and defeated his brother, the reigning Duke of Wuertemberg. Daun moved with the intention of aiding the Confederate army, but before he could reach them Hulsen had driven them across the mountain range into Bohemia, and fell back towards Torgau. Long before this Fergus had received a reply, from his mother, to his letter announcing the glad news of the restoration of the estate: \"It will be doubly dear to me,\" she said, \"as having been won back by your own exertions and bravery. These four years have been an anxious time, indeed, for me, Fergus; but the thought that you are restored to your own, as the result of what you have done, makes up for it all. I quite see that as long as the war continues you cannot, with honour, leave the king; but I cannot think that this war will go on very much longer, and I can wait patiently for the end. \"And, Fergus, I am not quite sure that the end will be that you will quietly settle down in the glens. A mother\u0027s eye is sharp, and it seems to me that that young countess near Dresden is a very conspicuous figure in your letters. During the four years that you have been out, you have not mentioned the name of any lady but her and her mother; and you always speak of going back there, as if it were your German home. That is natural enough, after the service that you have rendered them. Still, \u0027tis strange that you should apparently have made the acquaintance of no other ladies. I don\u0027t think that you have written a single letter, since you have been away, in which you have not said something about this Saxon count and his family. \"However, even if it should be so, Fergus, I should not be discontented. It is only natural that you should sooner or later marry; and although I would rather that it had been into a Scotch family, it is for you to choose, not me. I am grateful already, very grateful for the kindness the family have shown you; and am quite inclined to love this pretty young countess, if she, on her part, is inclined to love you. I don\u0027t think I could have said so quite as heartily, before I received your last letter; for I had a great fear that you might marry and settle down, altogether, in Germany; but now that the estate is yours, and you are the head of your clan, I feel sure that you will, at any rate, spend a part of your time among your own people.\" A second letter reached Fergus at the beginning of October; in answer to his from the camp in front of Dresden, in the middle of July, which had been delayed much on its way, owing to the rapid marches of the army, until it had shaken itself free from its pursuers after the battle of Liegnitz. It began: \"I congratulate you, my dear Fergus, congratulate you with all my heart; and if there is just a shadow of regret that you should not have married and settled here entirely, it is but a small regret, in proportion to the pleasure I feel. It is not even reasonable, for when I consented to your going abroad to take service in Prussia, I knew that this would probably end in your settling down there altogether; for it was hardly likely that you could win a fortune that would admit of your coming back to live here. \"Of course, had your estate at that time been restored to you, you would probably not have gone at all; or if you had done so, it would have been but to stay for a few years, and see service under your cousin Keith, and then return to live among your own people. As it was, there was no reason why you should greatly wish to return to Scotland, where you were landless, with no avenues open to employment. However, what you tell me, that the count and countess are willing that you should spend some months here, every year, is far better than I could have expected or even hoped; and, as you may imagine, quite reconciles me to the thought of your marrying abroad. \"In all other respects, nothing could be more satisfactory than what you tell me. Your promised wife must be a charming young lady, and her father and mother the kindest of people. Of course, your worldly prospects will be vastly beyond anything that even my wildest dreams have ever pictured for you, and in this respect all my cares for you are at an end. \"It will be delightful, indeed, to look forward to your homecoming every year; and I consider myself in every way a fortunate woman. I am sure that I shall come to love your Thirza very dearly. \"The only question is, when is the first visit to take place? Everyone says that it does not seem that the war can go on very much longer; and that, wonderful as the king\u0027s resistance to so many enemies has been, it cannot continue. However, from what you say of his determination, and the spirit of the people, I cannot think that the end can be so near as people think. They have been saying nearly the same thing for the last three years; and yet, though everything seemed as dark as possible, he always extricated himself somehow from his difficulties. \"Besides, his enemies must at last get tired of a war in which, so far, they have had more defeats than victories, and have lavished such enormous sums of money. France has already impoverished herself, and Russia and Austria must feel the strain, too. In every church here prayers are offered for the success of the champion of Protestantism; and I am sure that if he had sent Scottish officers, as Gustavus Adolphus did, to raise troops in Scotland, he could have obtained forty or fifty thousand men in a very few weeks, so excited is everyone over the struggle. \"You would be surprised what numbers of people have called upon me, to congratulate me upon your rising to be a colonel in Frederick\u0027s army--people I have never seen before; and I can assure you that I never felt so important a person, even before the evil days of Culloden. When you come back the whole countryside will flock to give you welcome.\" This letter was a great comfort to Fergus. That his mother would rejoice at his good fortune, he knew; but he feared that his marriage with a German lady, whatever her rank, would be a sore disappointment to her, not so much perhaps for her own sake as for that of the clansmen. The English ambassador was no longer with the army. At the fierce fight of Liegnitz he had been with Frederick, but had passed the night in his carriage, which was jammed up among the baggage wagons, and had been unable to extricate himself or to discover how the battle was going on. Several times the Austrian cavalry had fallen upon the baggage, and had with great difficulty been beaten off by its guard; and the discomforts of the time, and the anxiety through which he had gone, so unhinged him that he was unable to follow Frederick\u0027s rapid movements throughout the rest of the campaign. Fergus had confided to Earl Marischal Keith, later, his engagement to the Count Eulenfurst\u0027s daughter. \"You are a lucky young dog, Fergus,\" he said. \"My brother and I came abroad too late for any young countess to fall in love with us. There is nothing like taking young to the business of soldiering abroad. Bravery is excellent in its way; but youth and bravery, combined with good looks, are irresistible to the female mind. I am heartily glad that one of our kin should have won something more than six feet of earth by his sword. \"Count Eulenfurst is one of the few men everyone speaks well of. There is no man in Saxony who stands higher. In any other country he would have been the leading statesman of his time, but the wretched king, and his still more wretched minister, held in disfavour all who opposed their wanton extravagance and their dangerous plans. \"It is an honour indeed to be connected with such a family, putting aside all question of money; but indeed, in this respect nothing could be more satisfactory. His daughter is the sole heiress of his wide estates, and as her husband you will have a splendid position. \"I am very glad, lad, that the count has no objection to your passing a portion of your time in Scotland. They say, you know, that much as Scotchmen boast of their love of their country, they are always ready to leave it to better themselves; and that it is very seldom they ever return to it. Such was, unhappily, the case with my brother; such will probably be the case with myself; but I am glad that you will be an exception, and that you will still keep up your connection with your old home. \"I hope, lad, that you will have more than one son. The first, of course, will make Saxony his home; but bring up the second as a Scotchman, send him home to be educated, and let him succeed you in the glens. If he has the family instinct for fighting, let him go into the British army--he can go into no better--but let your people have some one who will be their own laird, and whose interests will be identified with their own.\" Fergus smiled at the old man\u0027s earnestness. \"That is rather looking ahead, sir,\" he said. \"However, it is certainly what I should like to do, myself; and if, as you say, I have more than one son, I will certainly give the second the training you suggest, and make a Scotchman of him. Certainly, if he has fighting instincts, he will see that he will have more opportunities of active service, in the British army, than he could have in that of Saxony; which has been proved unable to stand alone, and can only act as a small ally to either Prussia or Austria. Even putting aside my nationality, I would rather be fighting under Clive, in India, than in any service in the world--even in that of Prussia.\" \"You are right, lad. Since the days of Marlborough, people have begun to think that the British were no longer a fighting people; but the way in which they have wrested Canada from the French, and achieved marvels in India, to say nothing of the conduct of their infantry at Minden, shows that the qualities of the race are unchanged; and some day they will astonish the world again, as they have done several times in their history.\" The king soon heard the news from the Earl, and one evening said to Fergus: \"So, as the Earl Marischal tells me, you have found time, Colonel Drummond, for love making. I thought, that day I went to express my regrets for the outrage that had been committed at Count Eulenfurst\u0027s, that it would make a pretty romance if the young lady who received me should take a fancy to you; which was not altogether unlikely, after the gallant manner in which you had saved them all from those rascals of mine; and when you told me, at Dresden, that they had been nursing you, the idea again occurred to me. Well, I am glad you have done so well for yourself. As a king, I rejoice that one who has fought so bravely should obtain a meet reward; and as one who dabbles in poetry, the romance of the thing is very pleasant to me. \"But I am not to lose your services, I hope?\" \"No, sire. So long as the war goes on, I shall continue to serve your majesty to the best of my powers.\" The king nodded. \"It is what I should have expected, from one of Marshal Keith\u0027s relations,\" he said; \"but it is not everyone who would care to go on leading this dog\u0027s life, when a pretty and well-endowed bride is awaiting him. \"However, it cannot last much longer. The crisis must come, ere long. If we can defeat Daun, it may be put off for a time. If we are beaten, I do not see that I can struggle longer against fate. With Berlin already in their hands, with the country denuded of men and almost exhausted in means, with the Russian and Austrian armies already planted on Prussian soil, I can do no more, if I lose another great battle.\" \"We must hope that it will not be so, sire. The spirit of the soldiers is as high as ever and, now that they will be fighting nearly within sight of their homes, they can be trusted to achieve almost impossibilities.\" \"The men are good men,\" the king said, \"and if I had Keith and Schwerin by my side, I should feel more hopeful; but they are gone, and there are none to fill their places. My brother Henry is a good soldier, but he is over cautious. Seidlitz has not recovered from his wounds. Hulsen has done well of late, and has shown wonderful energy, considering that he is an old man. But there are none of them who are at once prudent when it behoved them to be prudent, and quick to strike when they see an opening, like Schwerin and Keith. \"Ziethen is a splendid cavalry officer, but he is fit to command cavalry only; and the whole burden falls upon my shoulders, which are getting too old to bear so heavy a weight.\" \"I trust, sire, that they will not have to bear the burden much longer. Just at present Russia and Austria are doubtless encouraged by success; but the strain must be heavy on them also, and another defeat might well cause them to doubt whether it is worthwhile to continue to make sacrifices that produce such small results.\" \"Heaven grant that it may be so!\" the king said earnestly. \"God knows that I never wanted this war, and that from the day it began I have eagerly grasped every chance that presented itself of making peace, short of the dismemberment of my kingdom. I would at this moment willingly accede to any terms, however onerous, in order to secure peace for my country.\"","sourceLink":"http://novel.tingroom.com/duanpian/3134/86180.html","bookId":890,"book":{"id":890,"title":"With Frederick the Great","description":"简介： It was early in 1756 that a Scottish trader, from Edinburgh, entered the port of Stettin. Among the few passengers was a tall young Scotch lad, Fergus Drummond by name. Though scarcely sixteen, he stood five feet ten in height; and it was evident, fr...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3134","creation":"Aug 1, 2019 12:23:48 AM","modification":"Aug 1, 2019 12:23:48 AM"}}
