{"id":69451,"no":31,"title":"Page 31","content":"I have often said, in speaking and in writing, that the qualified science fiction writer avoids the scientifically impossible. Yet I can\u0027t bring myself to make that rule an absolute one, because there are some plot devices that offer such dramatic possibilities that we are forced to overlook the utter implausibilities that are involved. The most glaring example of this is time-travel.\n There are infinite tortuosities one can bring to plot development if only you allow your characters to move along the time axis, and I, for one, can\u0027t resist them, so that I have written a number of time-travel stories, including one novel, The End of Eternity.\n You can get away with a kind of diluted time-travel story, if you have your character move in the direction we all move-from present to future-and suspend the usual consciousness that accompanies the move by having him (please understand that, for conciseness I am using \"him\" as a shorthand symbol for \"him or her\") sleep away a long period of time, as Rip van Winkle did, or, better, having him frozen for an indefinite period at liquid nitrogen temperatures. Better still, you might make use of relativistic notions and have your character move into the future by having his subjective time slowed through motion at speeds close to that of light, or motion through an enormously intense gravitational field.\n These are plausible devices that do not do damage to the structure of the Universe, but they are one-way motions, with no return possible. I did it in Pebble in the Sky although I made use of an unknown (and unspecified) natural law involving nuclear fission, which was then quite new. This was a weakness in the plot, but I got past it in the first couple of pages and never brought it up again so I hoped no one would notice it. (Alas, many did.)\n The same device can be used to make repeated jumps, always into the future, or to bring someone from the past into the present.\n Once you have a device that sends someone into the future, however, it is asking too much of writer-nature not to use some device-such as a blow on the head-to send a person into the past. (Mark Twain does it in \" A Connecticut Yankee at King Arthur\u0027s Court.\") For that, there is some scientific justification at the subatomic level, where individual particles are involved and entropy considerations are absent. For ordinary objects, where entropy is involved, there is none.\n But all one-shot changes in either direction are only devices to start the story, which then usually proceeds in a completely timebound fashion. That\u0027s not the true, or pure, time-travel story. In true time- travel, the characters can move, at will, back and forth in time. Nor is it fair if this is done through supernatural intervention as in Charles Dickens\u0027s A Christmas Carol. It must be done by an artificial device under the control of a human being.\n The first true time-travel story was H. G. Wells\u0027s The Time Machine, published in 1895. Wells, who was probably the best science fiction writer of all time [If others, since, seem to have reached greater heights, it is only because they stand on Well\u0027s shoulders.], carefully explained the rationale behind it. It requires four dimensions to locate an object: it is somewhere on the north-south axis, somewhere on the east-west axis, somewhere on the up-down axis, and somewhere on the past-future axis. It exists not only in a certain point of three-dimensional space but at a certain instant of time. A merely three-dimensional object is as much a mathematical abstraction as is a two-dimensional plane, or a one-dimensional line, or a zero-dimensional point. Suppose you considered the Great Wall of China as existing for zero time and therefore consisting of three dimensions only. It would then not exist at all and you could walk through its supposed position at any time.\n Since duration is a dimension like height, width, and thickness, and since we can travel at will north and south, east and west, and (if only by jumping) up and down, why shouldn\u0027t we also travel yesterward and tomorrowward as soon as we work out a device for the purpose?\n That was 1895, remember, and Wells\u0027s analysis at that time had some shadow of justification. But then, in 1905, came Einstein\u0027s special theory of relativity, and it became clear that time is a dimension but it is not like the three spatial dimensions, and it can\u0027t be treated as though it were.\n And yet Wells\u0027s argument was so winning and the plots it made possible so enticing that science fiction writers generally just ignore Einstein and follow Wells. (1 do so myself in The End of Eternity. )\n The dead giveaway that true time-travel is flatly impossible arises from the well-known \"paradoxes\" it entails. The classic example is \"What if you go back into the past and kill your grandfather when he was still a little boy?\" In that case, you see, the murderer was never born, so who killed the little boy?\n But you don\u0027t need anything so drastic. What if you go back and change any of the many small items that made it possible for your father and mother to meet, or to fall in love after they met, or to marry after they fall in love. Suppose you merely interfered with the crucial moment of sex and had it happen the next evening, or perhaps just five minutes later than it did, so that another sperm fertilized the ovum rather than the one that should have. That, too, would mean the person committing the act would never come into existence, so who would commit the act?\n In fact, to go into the past and do anything would change a great deal of what followed perhaps everything that followed. So complex and hopeless are the paradoxes that follow, so wholesale is the annihilation of any reasonable concept of causality, that the easiest way out of the irrational chaos that results is to suppose that true time-travel is, and forever will be, impossible.\n However, any discussion of this gets so philosophical that I lose patience and would rather consider something simpler.\n Suppose you get into a time machine and travel twenty-four hours into the future. The assumption is that you are traveling only in the time dimension, and that the three spatial dimensions are unchanged. However, as is perfectly obvious, Earth is moving through the three dimensions in a very complex way.\n The point on the surface on which the time-machine is located is moving about the Earth\u0027s axis. The Earth is moving about the center of gravity of the Earth-Moon system, and also about the center of gravity of the Earth-Sun system; is accompanying the Sun in its motion about the center of the galaxy, and the galaxy in its undefined motion relative to the center of gravity of the Local Group and to the center of gravity of the universe as a whole if there is one.\n You might, of course, say that the time-machine partakes of the motion of the Earth, and wherever Earth goes, the time-machine goes, too. Suppose, though, we consider the Earth\u0027s motion (with the solar system generally) around the galactic center. Its speed relative to that center is estimated to be about 220 kilometers per second. If the time-machine travels twenty-four hours into the future in one second, it travels 220 kilometers x 86,400 (the number of seconds in a day), or 19,008,000 kilometers in one second. That\u0027s over sixty-three times the speed of light. If we don\u0027t want to break the speed-of-light limit, then we must take not less than twenty-three minutes to travel one day forward (or backward) in time.\n What\u0027s more, I suspect that considerations of acceleration would have to be involved. The time- machine would have to accelerate to light speed and then decelerate from it, and perhaps the human body could only stand so much acceleration in the time direction. Considering that the human body has never in all its evolution accelerated at all in the time direction, the amount of acceleration it ought to be able to endure might be very little indeed, so that the time-machine would have to take considerably more than an hour to make a one-day journey-say, at a guess, twelve hours.\n That would mean we could only gain half a day per day, at most, in traveling through time. Spending ten years to go twenty years into the future, would not be in the least palatable. (Can a time machine carry a life-support system of that order of magnitude?)\n And, on top of that, I don\u0027t see that having to chase after the Earth would fail to cost the usual amount of energy just because we\u0027re doing it by way of the time dimension. Without calculating the energy, I am positive time-travel is insuperably difficult, quite apart from the theoretical considerations that make it totally impossible. So let\u0027s eliminate it from serious consideration.\n But not from science fiction! Time-travel stories are too much fun for them to be eliminated merely out of mundane considerations of impracticability, or even impossibility. \n","sourceLink":"https://allnovel.net/gold-the-final-science-fiction-collection/page-31.html","bookId":1733,"book":{"id":1733,"title":"Gold: The Final Science Fiction Collection","description":"Storyline: \n Gold: The Final Science Fiction Collection \n by Isaac Asimov, Orson Scott Card (Introduction) \n Gold is the final and crowning achievement of the fifty-year career of science fiction\u0027s transcendent genius, the world-famous author who defined the field of science fiction for its practitioners, its millions of readers, and the world at large. \n The first section contains stories that range from the humorous to the profound, at the heart of which is the title story, \"Gold,\" a moving and revealing drama about a writer who gambles everything on a chance at immortality: a gamble Asimov himself made -- and won. The second section contains the grand master\u0027s ruminations on the SF genre itself. And the final section is comprised of Asimov\u0027s thoughts on the craft and writing of science fiction.\n \n","cover":"https://allnovel.net/images/gold-the-final-science-fiction-collection.jpg","author":"Isaac Asimov","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/gold-the-final-science-fiction-collection.html","creation":"Oct 5, 2019 8:57:54 AM","modification":"Oct 5, 2019 10:12:22 AM"}}
