{"id":69463,"no":43,"title":"Page 43","content":"Every once in a while I get a letter that strikes a chord. Jeanne s. King of Marietta, Georgia, suggested that I write an editorial on what writers go through. Her tender heart bled for writers and I think she has a point. First, let me make it clear what I mean by \"writers.\" I don\u0027t want to confine the word only to those who are successful, who have published bestselling books, or who crank out reams of published material every year (if not every day), or who make a lavish living out of their pens, typewriters, or word processors, or who have gained fame and adulation. I also mean those writers who just sell an occasional item, who make only a bit of pin money to eke out incomes earned mainly in other fashions, whose names are not household words, and who are not recognized in the street. In fact, let me go farther and say I even mean those writers who never sell anything, who are writers only in the sense that they work doggedly at it, sending out story after story, and living in a hope that is not yet fulfilled. We can\u0027t dismiss this last classification as \"failures\" and not \"real\" writers. For one thing, they are not necessarily failures forever. Almost every writer, before he becomes a success, even a runaway supernova success, goes through an apprentice period when he\u0027s a \"failure.\" Secondly, even if a writer is destined always to be a failure, and even if he is never going to sell, he remains a human being for whom all the difficulties and frustration of a writer\u0027s life exist and, in fact, exist without the palliation of even an occasional and minor triumph. If we go to the other extreme and consider the writer whose every product is an apparently sure sale, we find that the difficulties and frustrations have not disappeared. For one thing, no number of triumphs, no amount of approval, seem to have any carrying power at the crucial moment. When even the most successful writer sits down before a blank piece of paper, he is bound to feel that he is starting from scratch and, indeed, that the Damoclean sword of rejection hangs over him. (By the way, when I say \"he\" and \"him,\" I mean to add \"she\" and \"her\" every time.) If I may use myself as an example, I always wince a little when anyone, however sincerely and honestly, assumes that I am never rejected. I admit that I am rarely rejected, but between \"rarely\" and \"never\" is a vast gulf. Even though I no longer work on spec and write only when a particular item is requested, I still run the risk. The year doesn\u0027t pass without at least one failure. It was only a couple of months ago that Esquire ordered a specific article from me. I duly delivered it; and they, just as duly, handed it back. That is the possibility all of us live with. We sit there alone, pounding out the words, with our heart pounding in time. Each sentence brings with it a sickening sensation of not being right. Each page keeps us wondering if we are moving in the wrong direction. Even if, for some reason, we feel we are getting it right and that the whole thing is singing with operatic clarity, we are going to come back to it the next day and reread it and hear only a duck\u0027s quacking. It\u0027s torture for everyone of us. Then comes the matter of rewriting and polishing; of removing obvious flaws (at least, they seem obvious, but are they really?) and replacing them with improvements (or are we just making things worse?). There\u0027s simply no way of telling if the story is being made better or is just being pushed deeper into the muck until the time finally comes when we either tear it up as hopeless, or risk the humiliation of rejection by sending it off to an editor. Once the story is sent off, no amount of steeling one\u0027s self, no amount of telling one\u0027s self over and over that it is sure to be rejected, can prevent one from harboring that one wan little spark of hope. Maybe-Maybe The period of waiting is refined torture in itself. Is the editor simply not getting round to it, or has he read it and is he suspended in uncertainty? Is he going to read it again and maybe decide to use it, or has it been lost, or has it been tossed aside to be mailed back at some convenient time and been forgotten? How long do you wait before you write a query letter? And if you do write a letter, is it subservient enough? Sycophantic enough? Groveling enough? After all, you don\u0027t want to offend him. He might be just on the point of accepting; and if an offensive letter from you comes along, he may snarl and rip your manuscript in two, sending you the halves. And when the day comes that the manila envelope appears in the mail, all your mumbling to yourself that it is sure to come will not avail you. The sun will go into eclipse. It\u0027s been over forty years since I\u0027ve gone through all this in its full hellishness, but I remember it with undiminished clarity. And then even if you make a sale, you have to withstand the editor\u0027s suggestions which, at the very least, mean you have to turn back to the manuscript, work again, add or change or subtract material, and perhaps produce a finished product that will be so much worse than what had gone before that you lose the sale you thought you had made. At the worst, the changes requested are so misbegotten from your standpoint that they ruin the whole story in your eyes; and yet you may be in a position where you dare not refuse, so that you must maim your brainchild rather than see it die. (Or ought you to take back the story haughtily and try another editor? And will the first editor then blacklist you?) Even after the item is sold and paid for and published, the triumph is rarely unalloyed. The number of miseries that might still take place are countless. A book can be produced in a slipshod manner or it can have a repulsive book jacket, or include blurbs that give away the plot or clearly indicate that the blurb writer didn\u0027t follow the plot. A book can be nonpromoted, treated with indifference by the publisher and therefore found in no bookstores, and sell no more than a few hundred copies. Even if it begins to sell well, that can be aborted when it is reviewed unsympathetically or even viciously by someone with no particular talent or qualifications in criticism. If you sell a story to a magazine you may feel it is incompetently illustrated, or dislike the blurb, or worry about misprints. You are even liable to face the unsympathetic comments of individual readers who will wax merry, sardonic, or contemptuous at your expense-and what are their qualifications for doing so? You will bleed as a result. I never met a writer who didn\u0027t bleed at the slightest unfavorable comment, and no number of favorable or even ecstatic remarks will serve as a styptic pencil. In fact, even total success has its discomforts and inconveniences. There are, for instance: People who send you books to autograph and return, but don\u0027t bother sending postage or return envelopes, reducing you to impounding their books or (if you can\u0027t bring yourself to do that) getting envelopes, making the package, expending stamps, and possibly even going to the post office. People who send you manuscripts to read and criticize (Nothing much, just a page-by-page analysis, and if you think it\u0027s all right, would you get it published with a generous advance, please? Thank you.). People who dash off two dozen questions, starting with a simple one like: What in your opinion is the function of science fiction and in what ways does it contribute to the welfare of the world, illustrating your thesis with citations from the classic works of various authors. (Please use additional pages, if necessary.) People who send you a form letter, with your name filled in (misspelled), asking for an autographed photograph, and with no envelope or postage supplied. Teachers who flog a class of thirty into each sending you a letter telling you how they liked a story of yours, and sending you a sweet letter of her own asking you to send a nice answer to each one of the little dears. And so on Well, then, why write? A seventeenth-century German chemist, Johann Joachim Becher, once wrote: \"The chemists are a strange class of mortals, impelled by an almost insane impulse to seek their pleasure among smoke and vapor, soot and flame, poi sins and poverty; yet among all these evils I seem to live so sweetly, that may I die if I would change places with the Persian King.\" Well, what goes for chemistry, goes for writing. I know all the miseries, but somewhere among them is happiness. I can\u0027t easily explain where it is or what it consists of, but it is there. I know the happiness and I experience it, and I will not stop writing while I live-and may I die if I would change places with the President of the United States.","sourceLink":"https://allnovel.net/gold-the-final-science-fiction-collection/page-43.html","bookId":1733,"book":{"id":1733,"title":"Gold: The Final Science Fiction Collection","description":"Storyline: Gold: The Final Science Fiction Collection by Isaac Asimov, Orson Scott Card (Introduction) Gold is the final and crowning achievement of the fifty-year career of science fiction\u0027s transcendent genius, the world-famous author who defined the field of science fiction for its practitioners, its millions of readers, and the world at large. The first section contains stories that range from the humorous to the profound, at the heart of which is the title story, \"Gold,\" a moving and revealing drama about a writer who gambles everything on a chance at immortality: a gamble Asimov himself made -- and won. The second section contains the grand master\u0027s ruminations on the SF genre itself. And the final section is comprised of Asimov\u0027s thoughts on the craft and writing of science fiction.","cover":"https://allnovel.net/images/gold-the-final-science-fiction-collection.jpg","author":"Isaac Asimov","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/gold-the-final-science-fiction-collection.html","creation":"Oct 5, 2019 8:57:54 AM","modification":"Oct 5, 2019 10:12:22 AM"}}
