{"id":98731,"no":16,"title":"Page 16","content":"A word of caution about our genetic programs. When we breed for speed, we breed as well for very specific kinds of decisions. Speed chops out, edits out certain kinds of reflexive choices and long-term considerations. Everything becomes the decision of the moment.\\n\\n - Jesus Lewis, The E-Clone Directive\\n\\n WHEN TEMPORARY seals had closed off the breaks in the perimeter of the Redoubt, Lewis directed the careful dayside cleanup of the interior. It was a long frustrating job, and they worked through the night with emergency lighting. The entire Redoubt stank of chlorine, so strong in some areas that they were forced to wear filters and portable breathing equipment.\\n\\n In the morning, they drenched the courtyard with chlorine several times before daring to touch the corpses there. Even then, they moved the bodies with hastily improvised claw grabs attached to mobile equipment.\\n\\n Chlorine everywhere, and the inevitable burns of both flesh and fabrics made it an even slower task.\\n\\n At Sub-level Four, they came on a welcome surprise: twenty-nine clones and five more of the Redoubt crew sealed in an un-lighted storage chamber - all of them hungry, thirsty and terrified. The chamber contained spare charges for the gushguns, permitting Lewis to add fire to the chlorine for a final sterilization sweep.\\n\\n Lewis was surprised to find that the E-clones had not attacked the five crewmen. Then he learned that the crewmen had sounded the alarm at the Nerve Runner attack and herded the clones into the chamber. A sense of fellowship between E-clones and normals had developed during the long confinement. Lewis noted it as they emerged - clones helping normals and vice versa. Very dangerous, that. He gave sharp orders to separate them, clones to the more dangerous task of courtyard cleanup, normals to their regular supervisory tasks.\\n\\n One observation particularly annoyed him: the sight of a trusted guard, Pattersing, being solicitous over a delicate female E-clone of the new mix. She was tall and emaciated by human standards, a light brown skin and large eyes. Her whole series was flawed by fragile bones, and Lewis had almost decided to abandon it - except that now she was one of his remaining examples of the genetic mix between human and Pandoran.\\n\\n Perhaps Pattersing was merely being careful with valuable material. He must know how fragile the bones of this series were. Ye.... that could be it.\\n\\n Lewis was pleased to note other more successful examples of the new E-clones, the breed incorporating native genetic material. There would be no need to go back through that long, slow and costly development program. The disaster here at the Redoubt had not been total.\\n\\n A mood of euphoria came over him as it became increasingly clear that they had sterilized the Redoubt, and that they had a new weapon effective against Runners.\\n\\n \"At least we\u0027ve solved the food problem,\" he told Illuyank.\\n\\n Illuyank gave him a strange, measuring look which Lewis did not like.\\n\\n \"Counting E-clones, there are only fifty of us left,\" Illuyank said.\\n\\n \"But we\u0027ve saved the heart of the project,\" Lewis said.\\n\\n Too late, Lewis realized he had said too much to this perceptive aide. Illuyank had proved himself capable of making correct deductions on limited information.\\n\\n Wel.... Illuyank was going Colony side. Murdoch would see to things there.\\n\\n \"We\u0027ll need replacements, lots of them,\" Illuyank persisted.\\n\\n \"I expect us to be stronger because of this testing,\" Lewis said.\\n\\n Lewis diverted Illuyank then by ordering a complete inspection of the Redoubt - every corner, every bay, no space missed - chlorine and/or fire everywhere. They moved slowly through the passages and across the open areas, their progress marked by the hissing flames of the gushguns and great splashing washes of chlorine. Lewis ordered a final purging with chlorine gas, opening all valves, all hatches within the Redoubt. They then made another inspection with sensor eyes.\\n\\n Clean. When it was finished, they pumped the chlorine residue onto the surrounding ground, following it by waves of gas which swept around the rocks and hillocks where the clones had huddled when he had ordered them thrust from the safety of the Redoubt.\\n\\n Inevitably, some of the chlorine spilled over the cliff into the sea. It ignited a violent, churning retreat by the hallucinogenic kelp in the cove. A pack of hylighters came to the excitement. They floated at a safe distance over the surrounding hills, spectators, while Lewis and his meager force sterilized the area around the Redoubt.\\n\\n Later, Lewis went grinding out of a lock in an armored vehicle to direct the outside sterilizing team, taking Illuyank as his driver. At one point, Lewis ordered Illuyank to stop and shut down while they studied the arc of hylighters in the distance. It was a scene framed by the thick barrier of plazglass in the crawler. The giant orange bags floated in disconcerting silence, anchored by long black tendrils twining in the rocks of the hills. They were a perimeter of mystery about three kilometers distant and they filled Lewis with angry fear.\\n\\n \"We\u0027ll have to eliminate those damned things!\" he said. \"They\u0027re floating bombs!\"\\n\\n \"And maybe more,\" Illuyank said.\\n\\n One of the surviving clones took this moment to drop his chlorine backpack. The clone turned to face the arc of hylighters, spread his stumpy arms wide and called out in a voice heard through the area: \"Avata! Avata! Avata!\"\\n\\n \"Get that damned fool out of here and into confinement!\" Lewis ordered. Illuyank relayed the order over their vehicle\u0027s external speakers. Two supervisors scrambled to obey.\\n\\n Lewis watched in grumbling impatience. Avata - that had been the other cry of the clone revolt. Avata, and, We\u0027re hungry now!\\n\\n If the particular clone out there had not been one of the precious new ones with the genetic mix, Lewis knew he would have ordered the stupid creature killed immediately.\\n\\n New security precautions would have to be put into effect, he told himself. Tougher rules about clone behavior. Oakes would have to be brought into these decisions. They would have to raid Colony, and Ship, for replacements - more clones, more staff, more guards, more supervisors. Murdoch and the Scream Room were going to be very busy for a time. Very busy. Well, gardening had always been a brutal business: root out the weeds, kill off the predatory grazers, destroy the pests. Lab One\u0027s special-purpose area was correctly labeled: The Garden. Producing flowers for Pandora.\\n\\n \"We\u0027ve used up the chlorine and it looks clean out here,\" Illuyank said.\\n\\n \"Take us back inside,\" Lewis ordered. Then: \"When you get back to Colony, I don\u0027t want any mention of the chlorine.\"\\n\\n \"Right.\"\\n\\n Lewis nodded to himself. It was time now to consider what he would tell Oakes, how this disaster would be explained to make it an important victory. \\n\\n","sourceLink":"https://allnovel.net/the-jesus-incident-destination-void-2/page-16.html","bookId":2170,"book":{"id":2170,"title":"The Jesus Incident (Destination: Void #2)","description":"Storyline: The Jesus Incident (Destination: Void #2) \\n A determined group of colonists are attempting to establish a bridgehead on the planet Pandora, despite the savagery of the native lifeforms, as deadly as they are inhospitable. But they have more to deal with than just murderous aliens: their ship\u0027s computer has been given artificial consciousness and has decided that it is a God. Now it is insisting - with all the not inconsiderable force of its impressive array of armaments to back it up - that the colonists find appropriate ways to worship It.\\n","cover":"https://allnovel.net/images/the-jesus-incident-destination-void-2.jpg","author":"Frank Herbert","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-jesus-incident-destination-void-2.html","creation":"Oct 5, 2019 8:58:25 AM","modification":"Oct 5, 2019 6:35:10 PM"}}
