{"id":98765,"no":51,"title":"Page 51","content":"Myths are not fiction, but history seen with a poet\u0027s eyes and recounted in a poet\u0027s terms. - Shipquotes FERRY SAT at his command couch sipping a pale liquid which reeked of mint. He had been reviewing biostats on a shielded viewscreen when Hali and Waela entered and he did not lower the shields. The command cubby, which had been tacked onto the Processing complex after Oakes\u0027 departure, was brightly illuminated by corner remotes which filled the room with yellow light. There was a sharp smell of caustic cleaner in the air. Hali noted two things immediately: Ferry was not yet overcome by the drink and he appeared fearful. Then she saw that the command center had been tidied recently. Anywhere Ferry worked was soon a scattered mes...notorious situation shipside where instincts of neatness equated with survival. But things had been made neat here. Unusual. She saw Murdoch then and realized that Ferry feared what Murdoch might report to Oakes. Murdoch stood at one side of the command center, arms folded, impassive. Ferry closed down his screen with a conscious flourish, swiveled to face the newcomers. \"Thank you for coming along so quickly.\" Ferry\u0027s voice was reedy with controlled emotions. He stroked the bridge of his nose once, an unconscious imitation of Oakes. Waela noted that his fingers were trembling. What does he fear? she wondered. The man\u0027s furtiveness spoke of terrified concealments. Is it something to do with my baby? The characteristic blip of her own fears lifted and fell. And there was Kerro\u0027s voice: \"Trust Hali and Ship, Waela. Trust them.\" Waela tried to swallow in a dry throat. Could no one else hear him? She shot a furtive glance around the room. When she heard the voice, she felt sure of it. The instant it was gone, she doubted. Her real-time perceptions were demanding full attention, though. Physical senses honed to high sensitivity by the necessities of survival on Pandora - these she trusted. And Ferry demanded her attention. The man was a menace, operating on several levels of deception. She had heard the stories about Ferry, a competent-enough medical man with a few eccentricities, but not to be trusted alone with a young woman. Her eyes told her something else. A humbler, Waela told herself, who sits in the command seat. Interesting. Why did Oakes choose a humbler? Waela\u0027s Pandora-sensitized nostrils detected alcohol in Ferry\u0027s drink. She put on her best impassive mask to conceal the recognition. The groundside uses of alcohol and tetrahydrocannabinol in their various forms were generally accepted in Colony. But somehow she had not expected this shipside. With Ship to protect the.... well, Shipmen had long held that alcohol was a risky and undesirable poison shipside. But then again, she knew that Ferry, like herself, had spent his early years Earthside. His reversion might not be all that unusual. Still, Ferry\u0027s actions interested her. If the fact of her impregnation outside Ship\u0027s regular breeding program were taken seriously in certain circle.... ? Well, why else would Ferry be using viewscreen shields? And alcohol! She did not want her life, nor her baby\u0027s life, depending on someone who deliberately lowered his acuities. Drinking, she thought. The word was dredged up out of her childhood and she had a bottomless-pit feeling about the hyb-plus-waking time which had passed since she had equated that word with alcohol. The shielded screen bothered her. It was time someone invaded Ferry\u0027s privacy, she thought. \"That drink smells like fresh mint. Could I taste it?\" \"Ye.... of course.\" It was not of course, but he offered her the glass. \"Just a taste. It\u0027s not the kind of thing a prospective mother should have.\" The glass was cold against her fingers. She sipped the drink and closed her eyes, recalling a scorched afternoon in Earthside summer when her mother had let her have a diluted mint julep with the grownups. The color of this drink was paler, but it was definitely bourbon with mint. She opened her eyes and saw Ferry\u0027s gaze fixed on the glass. Hungry for it, she saw. He\u0027s nearly drooling. \"It\u0027s quite good,\" she said. \"Where did you get it?\" He reached for the glass, but Waela handed it to Hali, who hesitated and looked at Ferry, then at Waela. \"Go ahead,\" Waela said. \"Everyone should have one sometime. I had my first when I was twelve.\" When Hali still hesitated, Ferry said, \"Perhaps she shouldn\u0027t, what with this strange illness going around. What if it\u0027s catching?\" He treats it like a precious jewel, Waela thought. It must be hard to get. She said: \"If it\u0027s that contagious, we\u0027ve caught it. Go ahead, Hali.\" The younger woman sipped, swallowed and immediately bent her head in a fit of coughing, the glass thrust out for someone to take it. Ferry grabbed it from her hand. Eyes watering, Hali said: \"That\u0027s terrible!\" \"It\u0027s all in knowing what to expect,\" Ferry said. \"And lots of practice,\" Waela said. \"You never told us where you got it. Not one of our lab alcohols, is it?\" Ferry placed the glass carefully on the deck beside his seat. \"It\u0027s from Pandora.\" \"Must be hard to get.\" \"Don\u0027t we have more important things to discuss?\" Murdoch asked. They were his first words, and they transfixed Ferry. He reached down for the drink, drew his hand back without it. He turned and fussed with the controls for his screen, dropped the shield, hesitated, then left it down. Waela promised herself that she would use the first opportunity to call up the records Ferry found so interesting. With unrestricted use of Ship\u0027s research facilities, it would not be difficult. Murdoch moved around behind Ferry, an action which increased Ferry\u0027s nervousness. Waela found herself sympathizing with the old man. Murdoch in that position would make anyone\u0027s shoulderblades twitch. Ferry sputtered, then: \"I wa.... ahh, waiting for some ahhh, others to come up before, ahhh, taking up the, ahh business w.... I mea....\" \"What are we doing here?\" Hali asked. She did not like the undercurrents flowing through this room. Unspoken threats lay heavy on Ferry\u0027s shoulders and it was obvious they came from Murdoch. Ferry reached for the drink with a convulsive motion, but before he could put it to his lips, Murdoch reached over Ferry\u0027s shoulder and removed the glass from his hand. \"This\u0027ll wait.\" Murdoch put the glass on a ledge behind him. As he turned back toward the others, the hatch opened and three people entered. Hali recognized Brulagi from Medical, a heavy-set woman with fat arms and a thick lower lip. She wore her auburn hair in the regular close-cropped style, and her eyes shone bright blue above a flat nose. Right behind her came Andrit from Behavioral, a large dark man with quick almond eyes of deep brown and a nervous, darting manner. Behind these two was Usija, gray-haired, a thin-lipped, soft-spoken woman from the Natali, who had assigned Hali to monitor Waela TaoLini. \"Ahhh, here you are,\" Ferry said. \"Please be seated, everyone. Please be seated.\" Hali was glad to sit. She found a sling chair for Waela and another for herself. Waela moved her own chair to seat herself directly across from Ferry. It put her apart from the others, an observer\u0027s distance, and let her focus on Ferry and Murdoch without having to turn. Ferry would notice and it would annoy him, she thought. He wanted attention, not investigation. What is it with you, old man? Waela wondered. What do you fear? The three latecomers perched on a couch at right angles to Ferry. Murdoch remained standing. Hali, noting Waela\u0027s move, wondered about it, but was distracted by the sudden realization that Andrit from Behavioral must be the father of young Raul. What was going on here? Murdoch touched Ferry\u0027s shoulder and the older man jumped. \"Show them the map.\" Ferry swallowed, turned to his keyboard, punched at it clumsily. A miniature projection of Ship\u0027s schematic materialized at the holofocus beside him. Hali recognized the special Natali area outship from Behavioral and noted a number of red dots through the projection. Brulagi from Medical leaned forward with her thick arms on her legs and stared at the three-dimensional map. Andrit appeared agitated by it. Usija merely nodded. \"What are the red markers?\" Hali asked. \"Each dot represents a stricken child,\" Ferry said. \"If you connect them, they form a spiral and you\u0027ll note that they increase in density as they reach the spiral\u0027s center.\" \"A vortex,\" Murdoch said. Waela peered closely at the schematic. She caught her breath and glanced up to catch a look of unguarded fury on Andrit\u0027s face. He was clenching and unclenching his fists. She saw the heavy muscles of his forearms knotting under his singlesuit. Ferry pulled some papers from the ledge beside his keyboard and shuffled through them while he spoke: \"For the sake of those who might not know, ahh, where is your cubby, Waela?\" Andrit leaned forward, almost falling from the couch as he glared at Waela. She saw Murdoch repress a smile. What amused him? \"You all know where I sleep, Doctor. My cubby\u0027s at the center of the spiral.\" Andrit lunged as quickly as anyone Waela had ever seen ship-side. But even though she felt heavily pregnant, Pandora had conditioned her reflexes to blurring speed. When Andrit hit the space where Waela had been sitting, she no longer was there. Before he could recover, Waela felled him with a blow to his carotid - every move automatic. She felt strength flowing through her. It gushed from the fetus within her and out through every fiber of her body. Hali, out of her chair by this time, looked from Andrit sprawled unconscious on the deck to Waela who stood poised and breathing easily in front of them. The sudden exertion had fanned the reddish glow under her skin to a blaze. As she turned slowly on one heel to see if there would be more attack, she was an awesome sight. Dazed, Hali asked: \"Why did he do that?\" Waela confronted Ferry. \"Why?\" She stood balanced on the balls of her feet. Andrit had threatened not her but her unborn child! Let any of them try to harm her child! Murdoch chose to answer, an odd glint in his eyes. He appeared to be enjoying this. \"He wa.... personally upset, you understand? One of the stricken children is his son.\" \"What do those red dots really mean?\" Hali demanded. \"Ahh, there have been some energy problems, we believe,\" Murdoch said. \"We saw a similar thing in Lab One.\" Waela took a step toward Ferry. \"I want to hear it from you. Oakes left you in charge here. What\u0027s going on?\" \"I, uhh, don\u0027t really know much about it.\" Ferry licked his lips, shot a glance over his shoulder at Murdoch. \"You mean you\u0027re not supposed to know anything about it,\" Waela said. \"Tell us what you do know.\" \"Now, let\u0027s change our tone a bit,\" Murdoch said. \"There\u0027s an injured man on the deck and this whole unfortunate matter does not require more passion.\" He turned toward the Natali representative. \"Doctor Usija, since the med-tech appears unable to respon....\" Hali looked down at Andrit who was beginning to stir. \"He\u0027ll recover,\" Waela said. \"I pulled my blow.\" Hali stared at her. The implication was obvious: She could have killed the man. Belatedly, Hali bent to examine him. Her pribox showed a bruise on his neck, some nerve damage, but Waela was right: He would recover. \"What happened in Lab One?\" Waela directed her question to Murdoch. \"A.... artificial form of this phenomenon. You are the first natural example of this we\u0027ve seen.\" \"Natural example of what?\" Waela forced the words out. \"The draining of energy fro.... other people.\" Waela glared at him. What was he saying? She took a step toward him and felt Hali\u0027s hand on her arm. Waela whirled on the med-tech and almost brought her down. Sensing this, Hali jerked her hand back. \"Waela? Just a moment. I\u0027m beginning to understand.\" \"Understand what?\" \"They think you\u0027re responsible for the sick children.\" \"Me? How?\" She turned back toward Ferry. \"Explain.\" Murdoch started to speak, but she snapped an angry glare at him. \"Not you! Him.\" \"Now, Waela, calm yourself,\" Ferry said. \"This has all been an unfortunate mistake.\" \"What do you mean unfortunate mistake, you drunk? You set this up. You invited Andrit here. You knew about that spiral in your schematic. What were you trying to do?\" \"I will not take that tone from you,\" Ferry said. \"This is m....\" \"This is your funeral if you don\u0027t tell me what\u0027s going on here!\" Hali stared at Waela. What was happening to the woman? Murdoch, Hali noted, was standing very still - no threatening movements at all. Usija and Brulagi were frozen in their seats. \"Now, don\u0027t you threaten me, Waela,\" Ferry said. There was a plaintive note in his voice. She\u0027s perfectly capable of killing him if he doesn\u0027t satisfy her demand, Hali thought. Ship, save us! What has come over her? Usija began to speak very softly, but her voice was compelling in the tense air of the room. \"Doctor Ferry, you are looking at the phenomenon of the threatened feral mother. It goes very deep. It is dangerous to you. Since Waela is Pandora-conditioned, I advise you to answer her.\" Ferry pushed himself back in his seat as far as he could go. He wet his lips with his tongue. \"I, ahh.... your circumstances shipside, Waela. There has been some, ahhh, let us call it superstition.\" \"About what?\" \"About, ahhh, you. We have tested you since your return an.... ahhh, we do not find usable answers. Even Ship is no help. Whatever it is, Ship has locked it away - Restricted. O....\" He shot a venomous glance at Hali. \"...we are referred to Med-tech Hali Ekel.\" Hali could not repress a gasp. Waela whirled and glared at her. Hali realized suddenly that now she was a target. \"Waela, I swear to you that I don\u0027t know what he\u0027s talking about. I\u0027m here to protect you and your baby, not to hurt you.\" Waela gave a curt nod, returned her attention to Ferry. Andrit groaned and pushed himself upright. Waela bent and, with one hand, hoisted him to his feet. In the same motion, she hurled him toward the couch where he narrowly missed Brulagi and Usija. The effortless way Waela did this made Hali hold her breath, then exhale slowly. Very dangerous, indeed. \"Tell us the circumstances where Ship refers you to Hali Ekel,\" Waela said. Her voice was like a bubbling volcano. Andrit leaned forward abruptly and vomited, but no one looked. \"When we asked if it was the child causing this or if it was you,\" Ferry said. Hali gasped, her vision suddenly blurred by memory of a dusty hillside, the setting of a blazing yellow sun, and three figures tortured on crosses. What kind of a child was Waela carrying? Waela spoke without turning. \"Hali, does that mean anything to you?\" \"How was your child conceived?\" Hali asked. Waela turned a startled look toward her. \"Kerro an.... . for Ship\u0027s sake, you know how babies are made! Do you think we carry axolotl tanks on those subs?\" Hali looked at the deck. The legend said immaculate conception - no man involved. A go.... But it was only a legend, a myth. Why would Ship refer the questioners to her? Many times since that trip through time, Hali had asked herself why? What was I supposed to learn? Ship spoke of holy violence. The accounts concerning the Hill of Skulls which she had scanned since the experience certainly confirmed this. Holy violence and Waela\u0027s child? Waela continued to stare at her. \"Well, Hali?\" \"Perhaps your child is not confined to this time.\" She shrugged. \"I can\u0027t explain, but that\u0027s what occurs to me.\" Apparently, this satisfied Waela. She glanced at Andrit, who was holding his head and remaining quiet. She turned back to Ferry. \"What is it about my baby? What\u0027re you afraid of?\" \"Murdoch?\" It was a desperate plea from Ferry. Murdoch crossed his arms and said, \"We got the reports from Ferry an....\" \"What reports?\" Murdoch swallowed, nodded at the holoprojection with its spiral of red dots. \"What were you supposed to do to me?\" Waela asked. \"Nothing. I swear it. Nothing.\" He\u0027s terrified, Hali thought. Has he seen this feral threatened-mother phenomenon before? \"Questions?\" Waela asked. \"Oh, yes, of course - questions.\" \"Ask them.\" \"Well, I wa.... I mean, I discussed this with the Natali and, we, that is, Oakes, wanted me to ask if you would return ground-side to have your baby?\" \"Violate our rules of WorShip?\" Waela looked at Usija. \"You do not have to go groundside,\" Usija said. \"We merely agreed that he could ask.\" Waela returned her attention to Murdoch. \"Why groundside? What did you hope to do there?\" \"We have stockpiled a large supply of burst,\" Murdoch said. \"It\u0027s my belief you will need every ounce of it you can get.\" \"Why?\" \"Your baby is growing at an accelerated rate. The physical requirements for the cellular growth ar.... very large.\" \"But what about the sick children?\" She turned toward Andrit. \"What have they told you!\" He lifted his head, glared at her. \"That you\u0027re responsible! That they\u0027ve seen this before groundside.\" \"Do you want me to go groundside?\" They could see him battling with his WorShip conditioning. He swallowed hard, then: \"I just want it to go away, whatever\u0027s making my son sick.\" \"How do they explain my responsibility for this?\" \"They say it\u0027.... . psychic drain, often observed but never explained. Perhaps Shi....\" He was incapable of repeating outright blasphemy. They chose a poor tool to attack me, Waela thought. The pattern of the plot was clear now: Andrit was to demonstrate potential violence in shipside opposition to her. She would be forced to go groundside \"for your own good, my dear.\" They wanted her down there badly. Why? How am I dangerous to them? \"Hali, have you ever heard of this phenomenon?\" \"No, but I would agree that the evidence points at you or your baby. You don\u0027t need burst, though.\" \"Why?\" Murdoch demanded. \"Ship is feeding her from the shiptits.\" Murdoch glared at her, then: \"How long have you Natali known that this baby was growing too rapidly?\" \"How do you know it?\" Usija countered. \"It\u0027s part of this phenomenon - rapid growth, abnormal demand for energy.\" \"We\u0027ve known since our first examinations of her,\" Hali said. \"You kept it under wraps and proceeded with caution,\" Murdoch said. \"Precisely what we did groundside.\" \"Why would you want to feed me on burst?\" Waela asked. \"If the fetus gets enough energy from burst, the psychic drain does not take place.\" \"You\u0027re lying,\" Waela said. \"What!\" \"You\u0027re as transparent as a piece of plaz,\" Waela said. \"Burst cannot be better than elixir.\" Usija cleared her throat. \"Tell us, Murdoch, about your experience with this phenomenon.\" \"We were doing some DNA work with kelp samples. We found thi.... this survival characteristic. The organism absorbs energy from the nearest available source,\" Murdoch said. \"The mother\u0027s the nearest available source,\" Hali said. \"The mother\u0027s the host and immune. The organism takes from other organisms around it which are, ahhh, similar to the hungry one.\" \"I\u0027m not aging,\" Hali said. \"And I\u0027m around her more than anyone.\" \"It does that,\" Murdoch said. \"It takes from some people and not from others.\" \"Why from children?\" Hali asked. \"Because they\u0027re defenseless!\" That was Andrit, fearful but still angry. Waela felt energy charging every muscle in her body. \"I\u0027m not going groundside.\" Andrit started to get to his feet, but Usija restrained him. \"What are you going to do?\" Usija asked. \"I\u0027ll move out to the Rim beyond one of the agraria. We\u0027ll keep people, especially children, away from me while Hali studies this condition.\" She looked at Hali, who nodded. Murdoch did not want to accept this. \"It would be far better if you came groundside where we\u0027ve had experience wit....\" \"Would you try to force me?\" \"No, oh no.\" \"Perhaps if you sent us a supply of burst,\" Usija said. \"We would not be able to justify shipment of such a precious food at this time,\" Murdoch said. \"Tell us what you know about the phenomenon,\" Hali said. \"Can we develop an immunity? Does it recur or is it chronic? Doe.... ?\" \"This is the first time we\u0027ve seen it outside a lab. We know that Waela TaoLini conceived outside the breeding program and outside Colony\u0027s protective barriers, bu....\" \"Why don\u0027t I get answers from Colony?\" Ferry asked. He had been sliding his chair slowly to one side while Murdoch spoke, and now he looked up at the man. \"That has nothing to do wit....\" \"You speak of not shipping burst at this time\" Ferry said. \"What is special about this time?\" Waela heard desperation in the old man\u0027s voice. What is Ferry doing? Something deep in him was driving these questions out. \"Your questions do not relate to this problem,\" Murdoch said, and Waela heard death in his voice. Ferry heard it, too, because he fell into abashed silence. \"What do you mean about the conception being outside of Colony\u0027s barriers?\" Usija asked. It was the scientist\u0027s voice gnawing at an interesting question. Murdoch appeared thankful for the interruption. \"They were floating i.... . in a kind of plaz bubble. It was in the sea, completely surrounded by the kelp. We don\u0027t know all of the details, but some of our people have suggested that Waela and her child may no longer be humantype.\" \"Don\u0027t try to get me groundside!\" Waela said. Usija climbed to her feet. \"Humans bred freely Earthside and anywhere they liked. We\u0027re merely seeing it happen agai.... plus an unknown which must be studied.\" Murdoch directed his glare at her. \"You sai....\" \"I said you could ask her. She has made her decision. Her plan is a sensible one. Isolate her from children, put her under constant monitorin....\" Usija\u0027s voice droned on outlining specifics to implement Waela\u0027s decisio...place with a shiptit, a rotation of Natali med-tech.... Waela tuned out the droning voice. The babe was turning again. Waela felt dizzy. None of this is normal. Nothing is as it should be. Blip. The fear lifted in her awareness, then dropped. What did Murdoch mean that she might no longer be humantype? Waela tried to recall details of what had happened in the gondola as it floated on Pandora\u0027s sea. All she could remember was the ecstatic wash of her union with something awesome. This shipside command cubby, Usija\u0027s voice - none of this was important any longer. Only the baby growing at its terrible pace within her was important. I need a shiptit. An image of Ferry pressed itself into her awareness. He was somewhere else with his inevitable drink in his hand. Murdoch was talking to him. Ferry was trying to protest without success. She heard faint voices, distant and muffled as though they came from a sealed room. There was a high view of Pandora\u0027s sea glowing in the light of two suns. It was replaced by a blurred vision of Oakes and Legata Hamill. They were making love. Oakes lay on his back on a brown woven mat. She was astride hi.... slow movemen.... very slo.... an insane look of joy on her face, her hands clenching and unclenching the fat of his chest. In the vision, Legata leaned back, trembling and Oakes caught her as she fell. It\u0027s a dream, a strange waking dream, Waela told herself. Now, the dream shifted to Hali on her knees in her own cubby. Atop a ledge in front of Hali stood an odd construction of wood - two smooth sticks, one of them fixed off-center across the other. Hali leaned her head close to the crossed sticks and, as she did this, Waela experienced the unmistakable fragrance of cedar, as fresh as anything she had ever smelled in a treedome. Abruptly, she was back in the command cubby. Hali\u0027s arm was around her shoulder, leading her out the hatch while Usija and Brulagi argued with Murdoch behind them. \"You need food and rest,\" Hali said. \"You\u0027ve overstressed yourself.\" \"Shiptit,\" Waela whispered. \"Ship will feed me.\"","sourceLink":"https://allnovel.net/the-jesus-incident-destination-void-2/page-51.html","bookId":2170,"book":{"id":2170,"title":"The Jesus Incident (Destination: Void #2)","description":"Storyline: The Jesus Incident (Destination: Void #2) A determined group of colonists are attempting to establish a bridgehead on the planet Pandora, despite the savagery of the native lifeforms, as deadly as they are inhospitable. But they have more to deal with than just murderous aliens: their ship\u0027s computer has been given artificial consciousness and has decided that it is a God. Now it is insisting - with all the not inconsiderable force of its impressive array of armaments to back it up - that the colonists find appropriate ways to worship It.","cover":"https://allnovel.net/images/the-jesus-incident-destination-void-2.jpg","author":"Frank Herbert","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-jesus-incident-destination-void-2.html","creation":"Oct 5, 2019 8:58:25 AM","modification":"Oct 5, 2019 6:35:10 PM"}}
