{"id":98769,"no":55,"title":"Page 55","content":"The forgotten language of our animal past conveys the necessity for challenges. Not to be challenged is to atrophy. And the ultimate challenge is to overcome entropy, to break through those barriers which enclose and isolate life, limiting the energy for work and fulfillment. - Kerro Panille, I Sing to the Avata FOR A long heartbeat, Hali stood immobile in the passage while she stared at Murdoch and the weapon he carried - that deadly laser scalpel. She could see Docking Bay Eight directly behind him - the freighter and escape lay there. They had less than two minutes now until the automatic system propelled that freighter into space for the long dive to Pandora. A quick glance at the unconscious Waela on the gurney beside her showed no change there, but the target of that laser scalpel appeared obvious. Hali interposed her own body between Murdoch and Waela. She heard old Win Ferry gasp as she moved. Hali kept her attention on the scalpel, cleared her throat, and found her voice astonishingly calm. \"Those things are meant to save lives, Murdoch, not take them.\" \"I\u0027ll be saving a lot of lives by getting rid of this TaoLini woman.\" His voice reminded her of that faraway time when Ship had allowed her to be confronted by Foul-breath below the Hill of Skulls. Ship? The unspoken plea filled her mind. Ship made no response. It all depended on her then. Ferry had stopped the gurney two paces from Murdoch and stood now at Hali\u0027s left, trembling. Murdoch waved the scalpel at them. \"This is made to excise unnatural growth from a healthy body. Sh....\" He glared at the unconscious Waela. \"...defiles us.\" Again, Hali found her memory filled with the faces of the Hill of Skulls - passionate eyes and violence thinly restrained behind them. Murdoch\u0027s face was one of those. \"You have no right,\" she said. \"I have this.\" He flicked the scalpel\u0027s laser blade in a searing arc past her right cheek. \"That\u0027s all the right I need.\" \"But Shi....\" \"The ship be damned!\" He took one step toward her, thrusting out with his free hand to sweep her aside. In this instant, Ferry moved. He was so fast that Hali saw only the backwards jerk of Murdoch\u0027s chin, the blur of old Ferry\u0027s elbow. Murdoch went sprawling to the deck, the scalpel spinning from his hand. Hali was as shocked by the old man\u0027s speed as by his action. Desperation moved Ferry. \"Go!\" Ferry yelled at her. \"Get Waela out of here!\" Murdoch was scrambling to his feet as Ferry lunged for him. Hali moved instinctively. She grabbed the gurney, jerked it past the struggling men. Its howling wheels grated on her senses. How much time do we have? And she asked herself as she swept the gurney through the Bay Eight hatch: What made Ferry so desperate? The sealed hatch into the freighter lay directly beyond the Bay Eight opening. She wheeled the gurney across the bump of the interlock and in ten steps brought it up short against the freighter\u0027s hatch. It was then that she realized she could not escape without Ferry. He carried the freighter\u0027s transit program. She stared at the control panel beside the hatch. Without the program, the freighter would land them at Colony. Her instincts told her that something worse than Murdoch awaited them there. Without that program, they could not enter the freighter - they would be cooked alive here in the Docking Bay. Without that program, she could not switch the freighter from automatic to life-support. The inventory in her mind stopped as she heard the panel relays click into the final stages before separation. She whirled at a grunting sound and saw Murdoch and Ferry struggling in the short passage to the freighter\u0027s hatch, Murdoch slowly pushing the old man backward toward Hali. Once more, the panel clicked. One by one, the hatches to the docking bay hissed shut. Bolts clicked into their locks, sealing the bay and the four of them from the rest of Ship. There was a scream from Murdoch and she saw his ear skid like a fragile blossom across the red-smeared deck. It was then she realized that Ferry had recovered the scalpel. She whirled to the panel, threw it open and found a hold program key. In desperation, she hit the key. I hope I haven\u0027t trapped us. An ominous ticking issued from the control panel. Ferry thrust her aside, slipped a small metal wafer into a slot in the panel. His trembling hand touched the add program key and the freighter\u0027s hatch popped open. They pushed the gurney inside and, as they moved, Waela sat up. She looked at Ferry, then at Hali, and said: \"My child will sleep in the sea. Where the hylighters calm the waves to the touch of a cradle, there my child will sleep.\" Her head fell forward onto her chest. They slipped her from the gurney and wrestled her gently across to a passenger couch, locked her in it. As they worked, Hali heard the freighter\u0027s hatch hiss closed. The freighter quivered. Ferry propelled her toward one of the forward control couches and they strapped in. \"You ever fly one of these?\" Ferry asked. She shook her head. \"Me neither. I had simulator experience, but that was a long time ago.\" His hand hesitated over the launch program key and, before he could move, the red automatics light flashed on the board. Hali looked forward to the plaz curve nested into the bay, expecting it to separate. Nothing happened. \"What\u0027s wrong?\" She felt hysteria bubbling in her throat. \"Why doesn\u0027t it launch?\" \"Ferry! Ekel! Shut that thing down and come back inside!\" \"Murdoch,\" Ferry said. \"Always spoiling things. He must\u0027ve escaped from the bay. He\u0027s taken over the auto-pilot and we can\u0027t release the docking bolts.\" \"Ferry, Ekel - if we don\u0027t get TaoLini back into Sickbay, she could die. You want that on your conscience? Don\u0027t let yourselves in for trouble ove.... .\" Ferry snapped off the vocoder. Hali took a deep breath. \"What now?\" \"This will either be the ride of your life or no life at all. Hang on.\" Ferry cleared the console and hit the reset key, then override and manual. His finger hesitated several blinks over launch program. \"Hit it,\" Hali said. He depressed the key. A powerful trembling rippled through their cabin. Hali looked at him. She had never suspected such action and determination in old Ferry. He seemed beyond desperation, caught up in some overriding program of his own. She realized then that the old man was sober. \"If we only had a flight manual,\" he said. A metallic female voice startled them, crackling from an overhead vocoder: \"You have a manual.\" \"Who the hell are you?\" Ferry demanded. \"I am Bitten. I am the system of this freighter. I am designed for conventional or conversational program in emergencies. You wish to separate from Ship, correct?\" \"Yes, bu....\" A roar shuddered through the freighter. The forward plaz displayed a blinding glimpse of Rega, then a panorama of stars as they shot free of Ship. They began a slow one-eighty turn toward Pandora, and Hali saw a gaping hole that had been Docking Bay Eight. Roboxes already were swarming over the area like insects, starting repairs on the ragged edges. \"Well,\" Ferry muttered, \"what now?\" Hali tried to swallow in a dry throat, then: \"What Waela said - the cradle of the sea. Does she know something abou.... ?\" \"Life support has been activated,\" Bitten announced. \"Does the sleeping one require additional attention?\" Hali jerked around and studied her patient. Waela lay in quiet sleep, her chest rising and falling evenly. Hali unstrapped, crept back to Waela\u0027s side and ran a test series: Everything read as normal as could be expected - blood pressure up a bit, adrenaline on the high side but dropping. No medication was indicated. Ferry\u0027s voice intruded on Hali\u0027s thoughts then as he asked Bitten for their ETA to Pandora\u0027s atmosphere. Hali turned and stared at the planet with a growing sense of wonder. Her shipboard life was ended. The only thing she knew for sure about her life now was that she still had it. Bitten\u0027s metallic rasping filled the cabin: \"Two hours, thirty-five minutes to atmosphere. Additional twenty-five minutes for entry and docking at Colony.\" \"We can\u0027t dock at Colony!\" Hali said. She made her way back to her seat and strapped down. \"What are our alternatives?\" \"Colony is the only docking station approved for this vessel,\" Bitten intoned. \"What about a surface landing?\" \"Certain conditions permit surface landing without damage to vessel and crew. But our departure destroyed all forward landing gear and docking valves. These are not necessary at Colony.\" \"But we can\u0027t land at Colony!\" She stared at Ferry, who sat frozen either in fear or complete resignation. \"Survival of unprotected crew elsewhere on Pandora surface not likely,\" Bitten intoned. Hali felt her mind whirling. Survival not likely! She had the sudden feeling that this whole thing was high drama, something staged and unreal. She looked at Ferry. He continued to stare out the forward plaz. That was it: Ferry was acting out of character - too far out. But Murdoch\u0027s ea.... that hole in Shi.... \"We can\u0027t go back to Ship and we can\u0027t dock at Colony and we can\u0027t land in the open,\" she said. \"We\u0027re trapped,\" Ferry agreed, and she did not like the calm way he said it.","sourceLink":"https://allnovel.net/the-jesus-incident-destination-void-2/page-55.html","bookId":2170,"book":{"id":2170,"title":"The Jesus Incident (Destination: Void #2)","description":"Storyline: The Jesus Incident (Destination: Void #2) A determined group of colonists are attempting to establish a bridgehead on the planet Pandora, despite the savagery of the native lifeforms, as deadly as they are inhospitable. But they have more to deal with than just murderous aliens: their ship\u0027s computer has been given artificial consciousness and has decided that it is a God. Now it is insisting - with all the not inconsiderable force of its impressive array of armaments to back it up - that the colonists find appropriate ways to worship It.","cover":"https://allnovel.net/images/the-jesus-incident-destination-void-2.jpg","author":"Frank Herbert","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-jesus-incident-destination-void-2.html","creation":"Oct 5, 2019 8:58:25 AM","modification":"Oct 5, 2019 6:35:10 PM"}}
