{"id":92887,"no":9,"title":"Page 9","content":"Buzzing filled my head. Seeing him, I could think only: 1. Alcántara killed Emma. 2. I despised Alcántara. 3. Alcántara was the enemy. My enemy. Like downed power lines bucking and snapping inside my skull, my thoughts were wild, volatile, charged. Lethal. I would discover what he’d done to Emma. What they’d done to her. The decision was irrefutable. My goal, unignorable. I glanced around, looking for a place to sit, but hostile faces were all around me. Girls in variations of tough and pretty, every one of them waiting for the opportunity to plunge a knife in my back. It was Alcántara’s fault I had no friends left. When Emma died, I’d also lost Yasuo. And if Master Al had his way, he’d take Carden from me, too. It was unthinkable. Memories flooded me. Unbearable memories. I flashed back to those days when I’d walk into a class to sit beside Emma or Yas. Our world had been fraught with terror, and yet who knew those had been my good old days? Trembling now, I made my way to a seat, any seat, unable to meet anyone’s eye. But even as I steered myself, going on autopilot, lurching toward an empty spot, I knew. I’d do what I always did: I’d survive. And I’d uncover the truth of this hell. I crumpled into a desk, and it was a pretty ungraceful landing, the chair leg squealing along the floor the moment my butt hit the seat. Some girl behind me muttered something. The girl next to her tittered. I turned to see who they were. The mutterer was a silky-haired creature named Lissa whom I recognized from last year’s Phenomena class, and her tittering pal was a pert-nosed thing from my dorm floor whose name I never bothered to get. I had nothing to lose anymore, nobody to protect. I snapped, “Let me guess…. Is it my butt? My hair?” It was satisfying to give them a good, long, fearless glare. I’d been responsible for the death of my best friend. I was so beyond their meaningless middle school taunts. “Do you seriously think you’re going to take me down with…what? Your snarky little comments? If that’s how you roll, then you should probably give up now. I mean, how are you even alive?” God, was I losing it? I needed to get it together. Keep to myself. Fly under the radar. Follow all those personal rules I’d once clung to. “What the fuck?” Lissa muttered, and her friend added a whispered, “Freak.” But they’d averted their eyes. Two points to me. I couldn’t resist one last jab. “I’ll bet you both just ruled seventh grade, didn’t you?” “Children, children.” The sound of Alcántara’s patronizing tone galvanized my annoyance into anger. He was studying them, and I imagined he didn’t miss one little thing. He’d have noted who mocked whom, where they sat, and why. I felt his attention zeroing in on me. Maybe it was my imagination, but I felt an anticipatory energy radiate from him, rippling over me. Like he’d been saving the best for last. Hatred erupted from a place deep in my gut, churning through me with no place else to go. I had to look down, so strong was the bile burning my throat. I knew he kept his eyes on me, but I pretended not to notice and instead fumbled in my bag like I was looking for just the right pen. He paused, a heavy moment of quiet, then made a noise in the back of his throat that sounded like amusement. “How I’ve missed your pretty faces.” The comment was aimed at me, and I felt it like a slapped cheek. He’d been staring at me, surely the only girl in the room who’d kept her pretty face averted. What I’d said to my classmates hadn’t been entirely true: Snarky little comments could take me down in a second…if they came from Alcántara. “I extend my greetings,” he continued, “and my congratulations. It is an elite group who survives their first year on Eyja næturinnar. You have been placed in Initiate-level Assassination and Elimination Techniques. Do you know what this means?” “It’s a survey of assassination theory and praxis?” Frost chimed from the front row. I hadn’t seen her when I’d come in, but now my eyes followed her voice, and sure enough, there she was, sitting ramrod straight, looking her most kiss-assy self. And, by the way, did she not understand the concept of rhetorical question? I scowled, then quickly smoothed my features before anyone saw. On this island, it was stupid to do anything other than play things close to the vest. Nothing got past Alcántara, though. He probably knew how much tension there was between us, and he probably also relished every strained bit of it. Vampires liked things hard and fraught and dramatic. To them, we were just pawns in some screwed-up deadly chess game. I was sure Frost’s and my mutual enmity was why we were placed together as roommates in the first place. Why we’d been put in so many classes together. He gave her a bland smile. If his obsession with me—not to mention his bond with Masha before me—was any indication, he preferred his girls with an edge. “That is one answer, yes. But not the answer I sought.” Snap. I was right. Blatant brown-nosing wasn’t Al’s thing. He preferred his girls hard to get. Hard to kill. He moved from behind the podium to glide around the room. “You are here, on this island, to recognize your potential, and the next phase of your journey begins in this very classroom. Assassination…elimination. You are here because soon you will be embarking on missions, and these are some of the skills you will require to stay alive.” More missions. I’d already had my first, rescuing Carden. I’d ended up with him as an ally—or was it boyfriend? I still couldn’t wrap my head around the word, so out of place in the context of my superfierce Scottish vampire. When you shared a blood bond with an ancient, terms like boyfriend seemed a bit watered down. Either way, I adored Carden and so couldn’t regret that particular mission. And yet that assignment—discovering an island of enemy vampires, getting embroiled in long-standing Directorate politics—had almost been the death of me. I wasn’t exactly anxious to set sail on another. “But I get ahead of myself,” Alcántara continued lightly, and instead of sounding frivolous, his silly-me tone made him seem all the more menacing. “We must begin at the beginning. With the basics.” He wandered back to the front of the class, leaning on the edge of his desk. “The concept of assassination is not a new one. Though generally an affair conducted in secret, do not be fooled. Assassinations have changed the course of history for millennia. Assassinations have made and broken kings. It is the purview of the mighty. Of those with influence. With power. And now, dear Initiates, it is your purview as well.” Power. There was that word again. I leaned forward in my seat. I had that feeling of a nascent idea dancing on the edge of my consciousness. Like, if I only peered harder at Alcántara, listened more closely, some essential truth would drift into my mind like a red balloon. “The first lesson of assassination is discretion. The word has two meanings, does it not? The first is caution. On a mission, you rely on discretion to remain unseen, invisible to those around you. Hidden in plain sight.” I thought of the book Carden had given me and its secret hiding place. Unobserved, unnoticed…I was well acquainted with the concept, on all kinds of levels. “And the second meaning?” He raised his brows as though one of us might like to pipe up with the answer, but we kept our mouths shut—we’d seen how Frost had been given the shutdown. “I will tell you. It is choice.” I bit my cheek, seriously doubting we’d ever have any choice in anything on this island, but sure, I’d give him the point for argument’s sake. The elaborate wordplay was so like Master Al, who was scholarly to the point of aggravation. “Discretion implies preference,” he explained. “Inclination. Elements with which your future assignments will be rife. You will need to know the how of a job. When, where. And, sometimes, there is a choice…to act or not to act? These things you must answer for yourselves. Perhaps you’ll make a decision your classmate does not; perhaps your subtle alteration will be the thing that keeps you alive and the thing that finds them dead. “We will study a history of assassination and thus learn through example. Through the successes—and mistakes—of others. And I have a surprise, my dear Initiates.” His lips curled into a smile, those coal-dark eyes dancing with a cruel bemusement that chilled me. “To make this more real, less of an academic endeavor, as a part of your curriculum, you will receive a top-secret assignment.” The classroom was so quiet, I could hear the breathing of the girl next to me. The silence told me I wasn’t the only one who knew that, on this island, top-secret assignments were often a clever way to cut class size, generally resulting in a more favorable student-teacher ratio. Meaning: Acari who got special assignments often found themselves dead. “Perhaps it will be a treat for some of you,” he went on, and that chilling smile turned into an all-out grin. “You will each be assigned a Trainee, one of the young men from among our newest recruits. You will eliminate your Trainee, using skills learned in this class.” A hand shot up. “You mean, we have to kill someone? Like, for class credit?” “You must kill someone,” he confirmed. “An assassination…like, for class credit.” His lip curled, speaking to his distaste for her diction. “Moreover, you will not disclose your target to anyone.” “We get to kill one of the guys?” A couple girls high-fived one another. Wow. Did these girls have no clue? I’d killed before, and each time it stole a part of my soul. Maybe these girls simply lacked humanity altogether, and that was how they’d found themselves on this island in the first place. “I ask that your project be thoughtfully executed. Extra credit is given for kills that move me. I appreciate the…poetic.” I shuddered. I wanted to drop my head, to cradle my forehead in my palm like the girl in front of me was doing. But I knew better than to show emotion and kept my face a cold blank, eyes glued to Alcántara.","sourceLink":"https://allnovel.net/the-keep-the-watchers-4/page-9.html","bookId":2294,"book":{"id":2294,"title":"The Keep (The Watchers #4)","description":"Storyline: The Keep (The Watchers #4) JUST BECAUSE YOU WORK FOR THE DEAD DOESN’T MEAN YOU WANT TO JOIN THEM. Drew has just started her second year on the Isle of Night, and the weather isn’t the only thing changing drastically. She has ascended to the rank of Initiate. She’s also found an intimate love in the handsome vampire, Carden. But most of all, she no longer dreams of escape. She dreams of vengeance. Her friend, Emma, was brutally wounded by the savage vampire Alcántara, and may have been taken to the dreaded castle, from which none of the living return. But there are so many different stories from so many people with so many of their own deceits and machinations, Drew can’t be sure of anything—except that she must find a way into the castle to discover the truth and take down Alcántara once and for all. But Drew isn’t the only one out for revenge. Someone very dangerous on the island is also out for blood… Hers…","cover":"https://allnovel.net/images/the-keep-the-watchers-4.jpg","author":"Veronica Wolff","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-keep-the-watchers-4.html","creation":"Oct 5, 2019 8:58:34 AM","modification":"Oct 5, 2019 5:57:39 PM"}}
