{"id":85540,"no":16,"title":"Page 16","content":"His eyes were dark, his pupils dilated as he watched me. “Fuck, girl. You’re too good.”\\n\\n I smiled up at him, and Ben’s hand cupped my cheek, stroking lovingly as his eyes met mine. I felt beautiful. Desirable. Tugging him by the hand, I pulled him onto the bed. I needed him closer.\\n\\n Once he’d successfully rid me of my shirt and bra, Ben pressed against me again, easing inside me slowly. I wrapped my legs around his waist and held on as he rocked into me, slowly at first, letting me adjust, then with an urgent rhythm.\\n\\n He felt incredible. Big. Almost too big, but pleasurably so. I lost myself in the sensations: the roughness of his stubbled jaw rubbing my cheek, his fingertips biting into my hips, his broad chest rasping against mine as he moved over me.\\n\\n Losing all control, his body pounded against mine ruthlessly, bringing us closer and closer to release. I wanted to make it last, to savor everything he had to offer, but all too soon the pressure built inside me. Ben read my body and slowed his thrusts, dragging himself almost all of the way out of me and sinking in again slowly. My back arched and I tilted my pelvis to meet him, letting the sensations overtake me. I came loudly, groaning his name in a litany of murmured whispers. Ben pressed his mouth to my neck, lightly biting me as he found his release. His body shuddered against mine as hot jets of semen exploded within me.\\n\\n Refusing to move, we lay together in bed, a heap of sweaty, tangled limbs and sheets strewn about. I was glad to see there was no postsex awkwardness. Why had I been so desperate to flee last time? Ben was proving to be nothing like I would have imagined. He wasn’t the overconfident, self-absorbed model my worst fears had made him out to be. He was sweet and caring and apparently liked to cuddle. He pulled me close, his arms circling my waist in a tight embrace.\\n\\n Once our breathing had returned to normal, Ben lifted up on one elbow to look down on me. “Hi.”\\n\\n “Hi.” I smiled. I liked the easy playfulness between us.\\n\\n “I have an extra toothbrush, pajamas, whatever you want.” He leaned down and kissed my forehead then removed himself from the bed. I got a peek at his tight backside before he slipped back into his discarded boxer briefs. He removed a white T-shirt from his wardrobe and tossed it on the bed for me before heading into the bathroom. He left the door open and I could hear the water running and the soft hum of his electric toothbrush.\\n\\n I stretched in the bed, taking my time before moving. Slipping the T-shirt over my head, I joined him in the bathroom. I guessed he was serious about this being a sleepover. With toothpaste bubbles on his bottom lip, he smiled lazily and surveyed me from head to toe. Messy bedroom hair, smudged makeup, and an oversized T-shirt that fell to midthigh. By the look on his face, you’d think he’d never seen me look more gorgeous.\\n\\n He leaned in to kiss me, leaving a dot of toothpaste on my top lip. “I like you in my clothes.” Ben handed me a spare toothbrush, still wrapped in plastic, and leaned down to rinse his mouth.\\n\\n This felt very comfortable and domestic, sharing a sink with him. I liked it. I couldn’t help but notice his bottles of pills were neatly lined up on the counter. I wanted to ask him about them, but Ben wiped his mouth and headed out, giving me some privacy. All types of special creams and serums lined his bathroom vanity, but I liked that he seemed to be low maintenance. I didn’t think I could handle a guy who had a more involved bathroom regimen than me.\\n\\n When I returned to the bedroom, Ben had turned off the lights so just the dim glow of the bedside lamp illuminated my path to the bed. He lifted the covers and I crawled in beside him. He wasted no time pulling me closer so that we lay spooned together.\\n\\n “You feel so good,” he mumbled against my neck “So soft. So warm.”\\n\\n I relished the feel of his arms around me. I felt safe. And warm. And feminine. His hard body pressed against mine. The few times I’d spent the night with my college boyfriend, he’d rolled over, facing away from me to sleep, his large back looming like an impenetrable wall. And when I tried to hug him from behind, he’d shrug me off, saying he was too hot. This was different . . . and nice. Our own little warm cocoon, away from the prying eyes of the world. He didn’t have to be the man everyone expected, and I wasn’t the meek little assistant, out of her element. I was just Emmy. I felt at peace.\\n\\n Ben pulled me closer, wrapping his arms around my waist and pulling me in until my back was pressed against his front. “Sleep, baby.”\\n\\n I couldn’t forget the pills I’d seen in his bathroom. I knew now might not be the best time to ask, but . . . “Ben?” I whispered.\\n\\n “Hmm?”\\n\\n I couldn’t resist asking the question burning a hole in my brain. “Those pills in your bathroom . . . I know I shouldn’t pry, but . . .”\\n\\n He released a heavy breath.\\n\\n “Tell me.” I rolled over to face him, his features barely visible in the soft moonlight. “Are you okay? Are you sick?”\\n\\n “I’m okay, Emmy,” he whispered.\\n\\n “That’s a lot of pills, Ben. I’m just worried.”\\n\\n His warm hand captured mine and squeezed. “I don’t want to hide anything from you.”\\n\\n “So don’t,” I whispered.\\n\\n He was quiet for a moment, just the sounds of our breathing in the silent room. “But I also don’t want to scare you away.”\\n\\n My heart rate kicked up a notch. Did he have a pill-popping addiction? Was he sick? I braced for the worst. “You won’t. I’m here.”\\n\\n “Just don’t go anywhere.”\\n\\n I squeezed his hand back. “I’m not planning on it.” I was here for the next three months, or however long this thing between us lasted. He was quickly getting under my skin.\\n\\n “I will tell you. But it’s a conversation for another time.”\\n\\n “Okay.” I wasn’t going to lie. I was a little disappointed. Now seemed like a fine time, we were safe and warm, and it was dark. But Ben wasn’t ready. I guess I had to respect that.\\n\\n “Rest, baby.” He clutched me tighter, like he was truly afraid I was going to leave.\\n\\n I closed my eyes, curling into his warm body, and tried not to worry about what the future might hold.\\n\\n Within a few minutes he was breathing deeply against the skin on the back of my neck, his heavy exhales signaling he’d already fallen asleep. I couldn’t help remembering all the times he said he had trouble sleeping, and a smile overtook my mouth. He was asleep. My baby. I curled my legs up, getting comfortable, and let him hold me.\\n\\n 11\\n\\n Emmy\\n\\n In the morning, Ben woke me with a trail of soft kisses down my thigh. I blinked my eyes open to find him leaning over my lower half. He lifted my leg to his mouth, kissing along my calf muscle, my ankle, the arch of my foot.\\n\\n “Morning,” I whispered, stretching my arms above my head. His scent still clung to my skin and I was deliciously sore.\\n\\n “You’re fucking sexy in the morning,” he growled in a sleep-roughened voice.\\n\\n I laughed, watching him press soft kisses along the top of my foot, my toes. It was a lovely way to be woken up. I felt worshipped, pretty, and very much wanted.\\n\\n He kept his gaze on mine, the hungry look in his eyes making my belly flutter. His teeth grazed my instep and the laughter died on my lips, need filling my system almost instantly. Memories of last night danced through my mind, watching Ben’s mouth move over my skin. He kissed a path up my lower leg, hovering briefly at the skin on the back of my knee. His breath tickled and I squirmed in the bed, already anticipating where he was heading.\\n\\n He gently bit the flesh inside my thigh and my sex clenched. Pushing my T-shirt up, his fingers hooked into my panties and he dragged them down my legs. I pulled the shirt over my head and tossed it beside the bed while Ben shoved off his boxers. I noticed the clock read ten after seven. He had a fitting at eight.\\n\\n “You have to be at the Versace offices at eight.”\\n\\n “Yes, but first I need breakfast, and this little pussy has been begging me to taste it.” He resumed nibbling along my inner thigh and my protests died. He pressed a tender kiss on the top of my pubic bone and began kissing his way lower. I had never felt so cherished, so thoroughly worshipped. The feeling was addictive. I could sense his warm breath, his unshaven jaw scratching my inner thighs. Completely unrushed, Ben continued lightly kissing me all over. I squirmed against the mattress, ready to have his mouth cover me. He gripped my hips, holding me in place, and softly chuckled against my skin.\\n\\n “Lie still, you naughty little thing.”\\n\\n His tongue made lazy strokes against me, tasting me, torturing me with his unrushed exploration. I whimpered and threaded my fingers in his hair, fighting the urge to pull him closer.\\n\\n Ben delivered on the promise that he excelled at oral. His warm mouth covered me, sucking lightly, swirling his tongue against my sensitive flesh in a hypnotic pattern. Within minutes, my world exploded in pleasure and I thrashed against him, clutching the sheets in my fists as I came.\\n\\n He rose on his knees, his lips pink and swollen from his assault on my lady parts. He was fucking sexy. His hand caught his eager erection and he stroked himself slowly, continuing to watch me. My body was still trembling from the intense orgasm when Ben positioned himself against me and pressed forward. I dug my heels into his ass, and arched my back, forcing him deeper. His thick length invaded me, parting me, making me whimper.\\n\\n A low growl murmured in his throat. “Fuck, your body feels good. I’ll never get tired of this.”\\n\\n My walls clenched around him and I clung to his shoulders. Ben pounded into me, not holding back as he sent us both closer to release. He captured my wrists and held my hands above my head as our lower bodies joined in a frantic rhythm. He released one hand to grip my bottom, lifting me to meet his thrusts, and drove into me with wild abandon, his eyes slipping closed, and his forehead resting against mine. Our mouths brushed, lips parted with heavy breaths.\\n\\n For only knowing each other a short time, we were closer than two people had a right to be. But I didn’t care, didn’t want to overanalyze why I’d fallen so deeply. I only knew I had. And that Ben seemed to be falling for me, too.\\n\\n “Emmy . . .” he groaned, releasing a sigh. “I can’t last, baby.”\\n\\n “Inside me.” I breathed. “Come inside me . . .”\\n\\n He clutched my ass, capturing my mouth with his, and kissed me deeply as he exploded inside me.\\n\\n “Shit. You’re too much, beautiful girl.” Ben kissed my forehead then moved to lay beside me.\\n\\n My galloping heart soared at his words. I constantly wondered what he thought of me, of my looks, always nervous that I didn’t measure up, but his little declaration did a lot to ease my worries. It was a small thing, but hearing him call me beautiful made everything okay. His hand rested against my hip, and as much as I wanted to turn and snuggle into his warm, broad body, I knew we were running late and didn’t have the luxury of cuddle time. I sat up and tugged the sheet to cover my breasts. I wasn’t completely comfortable with Ben seeing my body, especially in the stark morning light.\\n\\n He watched me, his eyes sweeping over the bare skin of my shoulder, with a dark, hungry look that my body already seemed to know. My stomach chose that exact moment to rumble loudly, interrupting the silence.\\n\\n Ben smiled lightly. “I’m sorry I don’t have time to take you out for a proper breakfast.”\\n\\n I smirked. “Your idea of breakfast or mine? I’m craving my momma’s cooking. Biscuits and gravy, eggs, and homemade pecan pancakes.”\\n\\n He laughed. “Hmm. I’ll have to see where you come from sometime. I can’t say I’ve ever had a true southern breakfast.”\\n\\n I liked the idea of taking Ben to Tennessee. “Yes, well, vitamins and a green smoothie hardly count as a proper breakfast where I come from.”\\n\\n Ben chuckled. “Fiona means well, Emmy. She really does.”\\n\\n My quirked-up eyebrow told him I disagreed.\\n\\n “I’ve been with her a long time. I want to make sure you guys get along.”\\n\\n “I’m pretty sure she hates me,” I mumbled.\\n\\n “Hmm.” He thought it over, not disagreeing. “She’s just protective of me.” He rubbed the back of his neck. “And things certainly won’t get easier once she knows I’m seeing you.”\\n\\n Oh, I was seeing Ben Shaw now. Whatever happened to going on actual dates, knowing where you stood, who you were dating—if you were exclusive? Ellie and I complained about that often. Nowadays, you had guys you were talking to, seeing, or hanging out with casually, or in the case of Ben and I, having mind-blowing sex with. But I didn’t dare inquire about what this was between us. Because let’s be serious, if this was all he had to offer, I would take it. No questions asked. Already, I was in too deep. I couldn’t hold back.\\n\\n Men like Ben didn’t do traditional relationships. For all my Googling, I’d never once turned up a past girlfriend. Maybe he kept his private life private; but still, jetting around the globe was hardly conducive for maintaining a healthy relationship. Not to mention he had girls throwing themselves at his feet on a daily basis. Why would he need to bother dating? He could get regular sex whenever he wanted it, without any strings, any hassles. Getting the milk for free, my momma would say.\\n\\n I wasn’t like him. I knew I’d want more. I wanted it all—a committed boyfriend, monogamy, eventual marriage, two kids, and a house in Tennessee, hopefully near my parents. But I could enjoy this with Ben and worry about my future later. I was choosing to live in the here and now. And I had a very tempting half-naked man in front of me. It was no question. All doubts and insecurities fled my brain.\\n\\n “Ben, we should just keep this between us. Fiona doesn’t need to know.”\\n\\n He watched me thoughtfully, stroking my thigh with his fingertips.\\n\\n I could only imagine how she’d treat me if she found out about me and Ben.\\n\\n He ran a hand through his wildly misbehaving hair, cursing softly. “You might be right.” At least he wasn’t so fooled by Fiona that he couldn’t see that. “But I don’t want to have to sneak around. I’ll find a way to talk to her.” \\n\\n","sourceLink":"https://allnovel.net/working-it-love-by-design-1/page-16.html","bookId":2763,"book":{"id":2763,"title":"Working It (Love by Design #1)","description":"Storyline: Working It (Love by Design #1) \\n Emmy Clarke is out of her depth in New York City’s fashion world, but when she lands a job as an assistant at a modeling agency it seems like the perfect mix of business and pleasure. Working under the notorious Fiona Stone is a nightmare, but there’s one distinct perk: ogling the ridiculously hot male models who parade through the office—particularly rising star Ben Shaw. \\n Ben is everything Emmy’s not: exquisitely gorgeous, highly paid, and well-traveled. He’s also got more issues than Vogue. Emmy looks after Ben on photo shoots, but she refuses to become another one of his lusting groupies. Ben finds Emmy’s refreshingly real attitude to be surprisingly attractive. \\n Against a backdrop of the most fashionable cities in the world, casual flirting turns into an illicit affair, but when Ben’s twisted past is revealed, and the bitter Fiona catches wind of their relationship, their careers and hearts are threatened.\\n","cover":"https://allnovel.net/images/working-it-love-by-design-1.jpg","author":"Kendall Ryan","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/working-it-love-by-design-1.html","creation":"Oct 5, 2019 8:59:21 AM","modification":"Oct 5, 2019 5:06:22 PM"}}
