{"id":111475,"no":43,"title":"Page 43","content":"\\n\\n Somewhere below, a plate of steel was stretching and splitting, and rivets were flying loose as hard and fast as bullets. Somewhere to the side, a thruster was spitting and hissing, making sounds that no working thruster ought to.\\n\\n Somewhere in front of them, the Blight was smudging the landscape—and it took Zeke a moment to realize that he could see the Blight directly in front of him because the ship was fully facing down, soaring toward a collision with whatever was underneath the pea-soup air. “We’re going to crash!” he shrieked, but no one heard him.\\n\\n The swelling back-and-forth of the crew’s conversation occupied them all, and not even the boy’s screams could distract them. “Left thruster!”\\n\\n “Disabled, or stuck, or… I don’t know! I can’t find the stabilizer pad!”\\n\\n “This idiot bird might not have one. Right thrust, air brakes. Jesus Christ, if we don’t pull up soon, we’re never pulling up at all.”\\n\\n “They’re coming back for another round!”\\n\\n “Are they crazy? They’ll kill us all if they drive us to ground!”\\n\\n “I’m not sure they care—”\\n\\n “Try that pedal—no, that other one! Kick it, and hold it back—”\\n\\n “It’s not working!”\\n\\n “We’re coming up on—”\\n\\n “Not fast enough!”\\n\\n Zeke closed his eyes and he felt them stretching, pushing back in his eye sockets from the pressure of their descent. “I’m going to die here, or I’m going to die down there, on the ground, in an airship. This isn’t what I meant…” he said to himself, for no one else was listening. “This isn’t what I meant to do. Oh, God.”\\n\\n The airship’s underside dragged itself along a new surface, one that was rougher and made with bricks, not metal; and the dusty, pebbled sound of stones crushed along the ship and rattled to the ground. “What’d we hit?” Parks asked.\\n\\n “Wall!”\\n\\n “City wall?”\\n\\n “Can’t tell!”\\n\\n The ship was spinning in an uncontrolled orbit that knocked it against hard things here and sharp things there, but it was slowing and then it was rising—so suddenly that the immediate lift and leap brought more bile into Zeke’s mouth. He spit a little spray against his visor.\\n\\n Then the ship stopped with a pitiless shrug, like the yank of a dog’s leash.\\n\\n Zeke fell off the wheel lock and went facedown onto the floor.\\n\\n “Tethered,” the captain said grimly. “Damn us all, they’ve locked us.”\\n\\n Someone stepped on Zeke’s hand and he yelped, but there was no time to complain. A demanding knock was beating a drum-tune against the main portal. It was the sound of someone big and very, very angry. Zeke pulled himself up and scuttled away, back to his cubby by the cargo door. He hunkered there while the captain and his crew pulled out guns and blades.\\n\\n They abandoned their buckled seats and tried at first to hold the door shut, but it had been damaged before when the Clementine had hit the Smith Tower, and now it was barely affixed to its hinges. Shoulders shoved and feet braced, but whoever was on the other side was heavier or more determined. Inch by inch, the door came peeling away.\\n\\n Zeke had nowhere to go and nothing to contribute; he watched from the floor as a coal-black arm reached through the opening on one side and a burly white one burst through from the left. The black arm caught Parks by the hair and beat his head against the frame, but Parks used his knife to cut at the hand until it retreated, bleeding—only to swipe inside again a moment later with a blade of its own.\\n\\n The larger arm on the other side could’ve belonged to a giant, or one of those amazing gorillas Zeke had once seen in a circus. Though it wasn’t covered in hair, it was longer than any arm the boy had ever personally set eyes upon; and he shuddered to consider the man who might wield it.\\n\\n The white arm dipped down, took hold of the nearest boot, and pulled. Mr. Guise went dropping to the floor, where he kicked against the arm, the door, and everything else. The monstrous hand retreated for less than a second and reappeared holding a revolver, which it fired straight through the bottom of Mr. Guise’s foot.\\n\\n Up through the boot the bullet blew, not stopping there but searing in a straight line through Guise’s thigh, and up into the soft flesh of his forearm. He howled and fired his own gun at the door, at the arm, at anything moving on the other side.\\n\\n But the bullets wouldn’t penetrate the plated doors, and the giant hand appeared unharmed.\\n\\n The door caved in another half a foot, denting beneath the force of the men who pushed against it. The captain left his spot at the door to come to the vault. He kicked Zeke out of the way, bruising the boy’s leg and ribs as he cast him aside and spun the wheel to open the hold.\\n\\n “Hold that door!” he commanded. His officers were doing their best, but Guise was bleeding and Parks had a nasty smash that looked like the skin of a rotting fruit on his forehead.\\n\\n The burly Indian brothers braced their backs against the dented door and held their ground against the encroaching raiders.\\n\\n On the other side of the bridge, an escape hatch opened with the creak of hinges that were not often used. Zeke watched the captain sling himself outside the ship, clinging to it and crawling along it like a spider, until he’d disappeared and the opened door showed nothing but a square of Blight-poisoned sky. He could hear the man’s feet and knees beating against the exterior of the craft as he climbed along it, seeking the hijacking hooks and trying to yank them out by hand.\\n\\n Zeke couldn’t imagine it, being up above the earth, heaven knew how high, and scaling a ship’s exterior with no harness, no ropes, no guarantee that anything soft was waiting below. But the captain’s handholds and footholds sounded like small gongs across the ceiling and around the back.\\n\\n Parks hollered, “What’s he doing?” Zeke could scarcely hear him, for his ears were still ringing with the percussion of the shots fired in such a close space.\\n\\n “Their hooks!” Mr. Guise said, though he was breathless with pain and trying to daub at his wounds while he pressed his back against the door. “He’s freeing them.”\\n\\n Zeke wanted to help, but he had no idea how to do so; and he wanted to run, but there was nowhere to go except into the sky and down to the ground, which would surely receive him in pieces.\\n\\n Beside Mr. Guise, a sharp-pointed bowie knife had fallen out of someone’s reach. Zeke slid a foot across the floor to grab it and pull it close. When no one objected to this action, he pulled it into his hands and clutched it up to his chest.\\n\\n With a tearing sort of tin-can rip, something came loose and the ship gave a gut-swabbing heave.\\n\\n The door that stood between the crews of the Clementine and the attacking ship slammed shut, and almost slammed clear out into the sky because there was nothing on its other side; the other craft had rebounded, and they had fallen apart from one another.\\n\\n “Got it!” Brink shouted, though he could barely be heard inside the belly of the airship.\\n\\n The other ship’s crewmembers yelped. Someone might have fallen out as the ships swayed apart from one another—Zeke didn’t know, and could not see.\\n\\n “Get away from that door!” Mr. Guise hollered, and scooted himself away from it, back over to his chair, which he could scarcely pull himself up to reach.\\n\\n The door was bent in all the wrong ways, and it wasn’t going to hold. The final hinge gave way to the weight of the steel slab. With a tiny squeal, the door dropped to the city below.\\n\\n Everyone listened, and counted seconds until they heard it land.\\n\\n Zeke counted almost to four before the crash echoed up from the streets. So they were high up, still. Real high up.\\n\\n The captain came swinging down into the door on the far side of the cargo hold. He shut the door, sprinted back to the cockpit, and took his seat, despite the teetering angle and missing door that exposed the whole cabin to the stinking sky. “Out of here,” he gasped, fully out of breath and quivering from exertion. “Now. If we can’t get over the wall, we’re done for.”\\n\\n Parks leaned over the slumping form of Mr. Guise and pulled a lever, then stretched his foot over the slouching body to push a pedal. It was the wrong pedal, or maybe the right one. The ship bounced up, and with a hearty half-roll, it dislodged Zeke from his defensive position by the wheel lock.\\n\\n He bumped, sprang, and toppled over to the open door.\\n\\n Without dropping his knife, Zeke lashed out with one hand to seize the frame, or the hinge, or anything else he could catch; but the ship was listing up and there was no helping hand to assist him. The twisted, split hinge cut a gash into his palm too deep to allow him to hold his position—swinging half out of the deck, half out in the air—and by reflex and terror he let go.\\n\\n He fell.\\n\\n … And smashed against something hard much sooner than he’d expected, even in his fear-addled state.\\n\\n And then the giant hand Zeke had seen before grabbed onto his arm with the crushing force of a cabinetmaker’s vise.\\n\\n Zeke’s head swam with adages about frying pans and fires.\\n\\n He couldn’t decide whether or not to struggle, but his body decided for him—even though there was nothing beneath his feet but sickly air. He kicked and fussed, trying to twist against the grip of the enormous fingers.\\n\\n “You stupid kid,” growled a voice that matched the hugeness of the hand. “You don’t really want me to let go, do you?”\\n\\n Zeke grumbled something back, but nobody heard it.\\n\\n The big hand reeled him up, to the very edge of the other ship’s deck.\\n\\n The boy tried hard not to gasp, lest he suck in any more vomit off the mask’s visor. Holding him up by the wrist was the biggest man he’d ever seen, or even heard of. He was crouching in order to fit in the opening where the door of his own ship had been pushed aside—it did not open out on hinges, but slid from side to side on a track. The man’s mask was a close-fitting model without a large breathing apparatus. It made him look bald, and something like a snub-faced dog.\\n\\n Behind the big man, Zeke heard voices bickering unhappily. “They disengaged! The son of a bitch disengaged us! By hand!” \\n\\n","sourceLink":"https://allnovel.net/boneshaker-the-clockwork-century-1/page-43.html","bookId":2550,"book":{"id":2550,"title":"Boneshaker (The Clockwork Century #1)","description":"Storyline: Boneshaker (The Clockwork Century #1) \\n In the early days of the Civil War, rumors of gold in the frozen Klondike brought hordes of newcomers to the Pacific Northwest. Anxious to compete, Russian prospectors commissioned inventor Leviticus Blue to create a great machine that could mine through Alaska’s ice. Thus was Dr. Blue’s Incredible Bone-Shaking Drill Engine born. \\n But on its first test run the Boneshaker went terribly awry, destroying several blocks of downtown Seattle and unearthing a subterranean vein of blight gas that turned anyone who breathed it into the living dead. \\n Now it is sixteen years later, and a wall has been built to enclose the devastated and toxic city. Just beyond it lives Blue’s widow, Briar Wilkes. Life is hard with a ruined reputation and a teenaged boy to support, but she and Ezekiel are managing. Until Ezekiel undertakes a secret crusade to rewrite history. \\n His quest will take him under the wall and into a city teeming with ravenous undead, air pirates, criminal overlords, and heavily armed refugees. And only Briar can bring him out alive.\\n","cover":"https://allnovel.net/images/boneshaker-the-clockwork-century-1.jpg","author":"Cherie Priest","type":"Horror","source":"allnovel","link":"https://allnovel.net/boneshaker-the-clockwork-century-1.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 6, 2019 12:21:56 AM"}}
