{"id":111492,"no":61,"title":"Page 61","content":"\\n\\n “You said it,” he replied.\\n\\n By then, Zeke was already headed down the hall at a pace halfway between a jog and a sprint. He found the stairs a moment later, and he crashed up them with a newfound sense of direction. There might be trouble upstairs, but there might also be people with gas masks. It didn’t matter what kind, and it didn’t matter whom he had to sleal it from—Zeke was going to get his hands on one if it killed him.\\n\\n There was no light in the stairwell, and he couldn’t find any obvious way to illuminate it, but he only needed to scale one flight and he could follow the noise that was rising steadily from above.\\n\\n It sounded like heavy men running back and forth. Shouts added to the chaos, and as he climbed higher in the dark, stumbling over every other step, an explosion shook the floor.\\n\\n Zeke flailed and grasped for a rail or a support, but found none. He fell down to his hands and knees.\\n\\n The last vibrations thudded away and he scrambled to his feet. He dusted off his hands on his pants and felt along the wall until a white line on the floor revealed the bottom of a door with some light behind it. But if there was a handle, he couldn’t find it. As he pressed himself against the door and frantically fought to open it, the commotion outside escalated further, making him wonder if this was really the way he wanted to go.\\n\\n The unmistakable percussion of gunfire joined the shouting and the running.\\n\\n Zeke stopped searching for a way out and held still, jarred by the shots and on the verge of changing his mind. It sounded like open warfare up there, in contrast to the calm, rich, quiet surroundings just one floor below. Was this what Lester had been whispering about in Minnericht’s ear?\\n\\n He hadn’t yet seen a rotter up close. Not a real one, not a hungry one—and certainly not a pack of them.\\n\\n An irrational burst of curiosity sent him seeking the handle again.\\n\\n His fingers wrapped around something that could’ve been a lever, set a little higher than an ordinary doorknob. He squeezed it and yanked, and nothing happened. He tugged again, using his weight to pry the thing downward, but the door didn’t budge.\\n\\n But then it was hit from the other side.\\n\\n Something big and hard smashed against it, throwing it inward and violently sandwiching Zeke between the panels and the wall. The force of it knocked the wind out of him. He crumpled to the floor holding his injured head, although it was too late to protect it. He gasped, and drew in ragged breaths of air that stunk of gunpowder and Blight residue. The air was sticky against the back of his throat and he gagged—a tiny sound that no one should’ve heard above the clamor on the door’s other side.\\n\\n Except that someone heard it.\\n\\n Someone pulled the door aside and looked behind it, discovering the battered, folded form of Zeke trying to keep his head and face covered. This someone cast a very wide shadow; even as Zeke was peering between his fingers, he could see the block of darkness clogging the doorway.\\n\\n “You there. What are you doing? Get up,” a man said through a device that turned his voice into a mechanical hum. It was as if all his words came filtered through a metal sieve.\\n\\n “I… um… shut the door, would you?” Zeke was flustered and frightened, and more gunshots were springing from wall to wall, fired from nearby at a terrible volume. He moved his hands and squinted up, peering at the backlit hulk and seeing nothing but a shape that was not human, exactly. It was the shape of a man wearing armor, or a suit made of steel with a mask shaped like an ox’s head.\\n\\n The man in the mask didn’t speak for a few seconds while the bullets whizzed and clanged, ricocheting off his shoulders. Then he said, “This place ain’t safe for a boy. What are you doing here?” He asked it slowly, like the answer might be very important.\\n\\n Zeke said, “I’m trying to get out of here! They took my mask, downstairs. I thought—”\\n\\n His thoughts were cut off by something louder and longer than the mere firing of a revolver sounding through the semibrightness on the other side of the armored man.\\n\\n “What’s that?” Zeke almost screamed.\\n\\n The man quavered against the blast behind him; he braced himself against the doorframe, his wide, bulky arms spreading and stretching to hold himself upright. He said, “That’s Dr. Minnericht’s Sonic Gusting Gun. It… it throws sound at people, like a cannon.” For a moment he seemed as if he had more to say about it, but he changed his mind and said, “Out of here’s a good idea. But not this way. You’d better not…” And then he added, “Ezekiel. That’s you, ain’t it?”\\n\\n “Who are you? And what do you care?”\\n\\n “I know someone’s who’s looking for you” he said, but the answer wasn’t too comforting. The first face that sprang to Zeke’s mind was the giant who’d piloted the ship that’d crash-landed in the fort.\\n\\n This man who blocked the way purely with his size could be kin to the pilot, or worse. He could be crew or mercenary, and of all the things Zeke wanted to do, going back to that man with the hands as big as buckets was at the bottom of the queue. He was furthermore concerned that this masked man seemed to know his name, which only made the situation worse: Now the air pirate knew whom he was looking for, and was sending soldiers after him.\\n\\n “No,” Zeke said, as a general answer to everything that was being asked of him. “No, forget it. Let me go.”\\n\\n The man shook his head, and the seams on his mask creaked as the metal squeaked against his reinforced shoulders. “You can go, but you can’t come up here. You’ll get yourself killed.”\\n\\n “I need to get myself a mask!”\\n\\n “Tell you what” said the man. He looked back over his shoulder and spied something promising. He said, “You stay here, and I’ll go get you one.”\\n\\n The masked man looked as impassable as a moat, even with all the confidence Zeke could muster. But if the other man was willing to wander off for a few seconds, it’d give the boy time to bolt.\\n\\n “All right,” he whispered, and nodded his head.\\n\\n “You’ll stay here, and you won’t move?”\\n\\n “No, sir, I won’t move,” Zeke assured him.\\n\\n “Good. I’ll be back in a minute.”\\n\\n But as soon as the clanking armored man pivoted on his heel, Zeke zipped out behind him and dived into the fringe of the fray.\\n\\n Too frightened to freeze and too exposed to stand still, he crouched and ran for the closest cover he could find: a stack of crates that were splintering, dissolving by slow degrees as bullets chipped away at their corners. A hot streak of something fast and hard went burning across his back, searing a hole in his shirt.\\n\\n He struggled to wrangle his arms behind himself so he could touch the stinging line between his shoulder blades, but it was hard to reach and he gave up once he concluded that he was not dead, and not dying. All things being equal, his head still hurt far worse than any other part of him, even his torn-up hand.\\n\\n Zeke crouched, cornered and horrified by the scene.\\n\\n Around him, the room had divided into factions. Just like it had sounded below, it was war up there. But contrary to everyone’s explanation, he saw no rotters—no shambling, wheezing undead like the ones he’d heard described. He saw only men, armed and scowling and shooting back and forth across a shining expanse of chipped-up marble that had once been a beautiful floor. On one side were a group of three Chinamen, joined by a pair of men who were dressed like the airmen aboard theClementine. On the other, Zeke saw Lester and a handful of fellows who looked like they’d come from underneath the station.\\n\\n From the ceiling, a cascade of glimmering lights dripped like formations inside a cave, lending plenty of light to show the horrible events unfolding in all the dusty, cobwebbed corners.\\n\\n Along the windowless walls there were padded seats and plants made of silk that would never need watering, though they’d need mending from bullet holes. Behind those plants, and crammed under seats, and behind the rows of chairs that were locked together and bolted to the floor in tidy, waiting-room lines, pockets of scowling, grimacing men were doing their best to force their opponents to surrender, or to kill them all outright.\\n\\n Zeke wasn’t sure where he was. The room looked a bit like the lobby of a train station. And he didn’t know who any of these people except Lester were, or why they were fighting. Some were wearing masks and some weren’t, and at least three of them were dead, sprawled across the shiny-hard surface—two facedown, one faceup. The faceup man was missing most of his throat and his eyes were open, glazed, and staring at nothing but heaven beyond the ceiling.\\n\\n But one of the facedown men was wearing a mask.\\n\\n And to Zeke’s total astonishment, the burly, armored fellow who’d confronted him in the corridor was in the process of stripping that mask away. The dead man’s neck wobbled like an empty sock, and with a slip of a final strap, the mask came loose.\\n\\n The armored man turned around, seeking the corridor entrance and the door behind it. Seeing that the door was open and Zeke wasn’t there anymore, he swore loudly and spun in a circle. A bullet pinged against his shoulder blade with the light chime of a cymbal, but it didn’t seem to harm him any.\\n\\n He spied Zeke jammed behind the crates.\\n\\n For a moment, Zeke thought that the man was going to pull that enormous gun down off his back and fire it, and then Zeke would dissolve into a thousand pieces and not even his mother would recognize him.\\n\\n Instead, the man palmed the mask, wadded it into ball, and chucked it into the boy’s lap before turning around and pulling an oversized six-shooter out of his waistband and firing it again and again and again. He made a line of bullets from one side of the room to the other, creating cover for his own getaway or for Zeke’s—suddenly, Zeke wasn’t sure.\\n\\n At the far edge of the room there was another door, and something big was beating against it from the outside. Or maybe it wasn’t something big. Maybe it was something many.\\n\\n It wasn’t one beating bash, like a battering ram or a machine. It was a constant, pounding, pushing, thrusting pressure being forced against the door—which seemed to be strongly reinforced. Even from his own limited perspective, Zeke could see that the door was barricaded as if it expected an army to fling itself against it. \\n\\n","sourceLink":"https://allnovel.net/boneshaker-the-clockwork-century-1/page-61.html","bookId":2550,"book":{"id":2550,"title":"Boneshaker (The Clockwork Century #1)","description":"Storyline: Boneshaker (The Clockwork Century #1) \\n In the early days of the Civil War, rumors of gold in the frozen Klondike brought hordes of newcomers to the Pacific Northwest. Anxious to compete, Russian prospectors commissioned inventor Leviticus Blue to create a great machine that could mine through Alaska’s ice. Thus was Dr. Blue’s Incredible Bone-Shaking Drill Engine born. \\n But on its first test run the Boneshaker went terribly awry, destroying several blocks of downtown Seattle and unearthing a subterranean vein of blight gas that turned anyone who breathed it into the living dead. \\n Now it is sixteen years later, and a wall has been built to enclose the devastated and toxic city. Just beyond it lives Blue’s widow, Briar Wilkes. Life is hard with a ruined reputation and a teenaged boy to support, but she and Ezekiel are managing. Until Ezekiel undertakes a secret crusade to rewrite history. \\n His quest will take him under the wall and into a city teeming with ravenous undead, air pirates, criminal overlords, and heavily armed refugees. And only Briar can bring him out alive.\\n","cover":"https://allnovel.net/images/boneshaker-the-clockwork-century-1.jpg","author":"Cherie Priest","type":"Horror","source":"allnovel","link":"https://allnovel.net/boneshaker-the-clockwork-century-1.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 6, 2019 12:21:56 AM"}}
