{"id":111504,"no":74,"title":"Page 74","content":"\n “Or a woman either, as I heard it.”\n “Or a woman either, maybe.” She gave him that much. “But maybe that don’t apply to us. Maybe I’m a killer, and you’re a runaway. Maybe we deserve this city, and these people, and maybe we can make something good of it. It can’t be much worse than the life we’ve got outside the wall.”\n Captain Cly’s hulking shadow met them in the parlor, and Croggon Hainey came in through the front door, adjusting his mask and still swearing softly about his missing ship. He paused long enough to say, “This is a strange thing, Miss Wilkes. I don’t think I’ve ever been invited to steal from anyone’s home before.”\n She looked around at the coiled strips of damp wallpaper, the mushy rugs, and the squares of strange colors where paintings had once hung. Shells of furnishings languished along the walls and beside the fireplace, and the crisp, sharp edges of broken window glass made funny lines of burned shadows across the dirty walls. Through the windows, she could see that the sun was coming up outside—barely enough to lighten the gloom within, and not bright enough yet to make the place look truly tragic.\n Zeke’s grin hadn’t stayed, but he raised it again like a flag and said, “Hard to believe there’s anything worth having in this old wreck. But Momma says there’s money stashed upstairs.”\n She left her arm around him and kept him as warm and close as he’d let her. To the two air captains she declared, “This is my house. If there’s anything left that’s worth taking away, then let’s go get it. Otherwise, I’m finished here. I’ve salvaged what I can, and it’s enough to lean on.”\n Zeke held still while she ruffled his hair; then he turned to Captain Cly and asked, “Is it true you were there, at the jailbreak? Momma says you were one of the fellows who took my grandfather back home.”\n Cly nodded and said, “That’s a fact. Me and my brother. Let’s clean this place out, get back on board, and then I’ll tell you about it, if you want. I’ll tell you the whole story.”\n Epilogue\n At the ’works, a supervisor with a peevish face and very thick gloves told Hale Quarter that no, Mrs. Blue hadn’t been to work that day. For that matter, she hadn’t worked a shift in nearly a week, and as far as the supervisor was concerned, she was no longer employed at the plant. Furthermore, he did not know what had become of her. And no, he had no idea where she might’ve gone, or what she might be doing now.\n But if Hale was truly interested, or desperate, or bored, he was welcome to rummage through whatever personal effects of hers remained. As far as the supervisor knew, no one had cleaned off her shelf or emptied her cubby.\n Briar didn’t have anything that anyone wanted.\n The young biographer nodded and wormed his finger between his shirt collar and his neck, for the room was astonishingly warm. Steam oozed, billowed, and sometimes sprayed out from between the cracks on the big machines; and boiling water for processing was dumped from crucible to crucible in sizzling, foaming waterfalls of heat and heaviness. The other workers eyed him with suspicion and open contempt even though no one had told them who Hale had come seeking. It was enough that he was dressed in clothes that fit him, and that he carried a notebook under his arm. It was enough that he wore glasses that fogged with every fresh pour from a hanging vat above and beyond his head. He was not their kind, and they were not prepared to be kind to him. They wanted him out from underfoot, and off their working floor.\n Hale accommodated them. He scuttled out of the main processing area, slipping a little on the steam-slicked grates that served as floors between the stations. Before he was clear altogether, he asked in a coughing yell, over his shoulder, “How will I know which things are hers?”\n The supervisor didn’t even look up from the valves he was monitoring. A fat red needle was quivering between a blue zone and a yellow one. He simply said back, “You’ll know.”\n Hale wandered back to the rear entrance and to the room where the employees kept their personal belongings, and within a few moments he understood what the supervisor meant. He found a shelf with Briar’s last name written on it—or presumably, that was the original idea. Graffiti had scrawled, scribbled, and argued its way across the shelf’s little ledge until there was no way to know for certain.\n Atop the shelf lay a pair of gloves, but when Hale tried to lift and examine them, they clung to the wood.\n He stood on the tips of his toes and peered over the edge to see the puddle of blue paint that had congealed into something as firm as glue. He left the gloves where they were, and since the paint was dry enough to work around, he fished past them, hoping to find some trace of Briar’s life. From the back corners of the cubby he withdrew a single lens from a pair of cheap goggles, a broken strap from a bag, and an envelope with Briar’s name on the outside—but nothing within it.\n He found nothing else, so he rocked back down onto his heels until he stood flat on the floor again. He tapped one knuckle against the edge of his belt, because it helped him think; but nothing new came to him. This meant that he was fully out of ideas. Wherever Briar Wilkes Blue had gone, she’d gone suddenly. She’d never said goodbye, formally quit her job, packed her things, or breathed a word of her plans to anyone, anywhere.\n There was no sign of her son, either.\n One last time, Hale decided to check her house. Even if no one was home, he might be able to tell if anyone had been home, or if anyone had visited. If nothing else, perhaps one of Ezekiel’s friends might be lingering around the property. If nothing else, Hale might peek inside a window or two and confirm the obvious even further: Wherever Briar Wilkes Blue had gone, she wasn’t coming back.\n Hale Quarter tucked his notebook up under his arm and began the long hike up the mudflats, through the soggy Outskirts streets, and into the neighborhood where Maynard Wilkes was buried in his own backyard. It was still early, and the drizzling, noncommittal rain wasn’t so bad. The sun strained weakly through veiny breaks in the clouds, casting inverse shadows on the horse and wagon tracks that cut through the soft roads. The wind shoved at his back and it was cold, but it didn’t have the bite of some days, and it drove only a little water up against his papers.\n By the time he reached the Wilkes house, the afternoon was turning dark a little too early, like it always did at that time of year. Down the street, young boys were lighting the street lanterns for a penny apiece, and what was left of the light sufficed to let Hale see the house in all its absent glory.\n It was a squat place, and gray like everything else around it. The walls were tainted with streaks of Blight-tinged rainwater, and the windows were likewise etched, as if with acid.\n The front door was closed, but it was not locked. Hale knew that much already. He put out a hand to turn the knob and slopped himself.\n Instead, he took a moment to peer into the nearest window. Seeing nothing, he returned again to the door. His palm was damp around the chilled metal knob. He gave it half a turn, changed his mind for the hundredth time, and released it.\n The rain picked up, jerking into a gust that flung cold needles of water into his ears. The porch would not shelter him much, or for long. He clutched at his notebook with its leather flaps holding the paper out of the weather; and he considered the unfastened door once more.\n He sat down against it, as far out of the rain as he could get, and he pulled his notebook into his lap. The wind combed through the trees around the dilapidated little house, and the rain came and went like the drawing and undrawing of theater curtains.\n Hale Quarter jabbed a pen against his tongue to moisten it, and he began to write. \n","sourceLink":"https://allnovel.net/boneshaker-the-clockwork-century-1/page-74.html","bookId":2550,"book":{"id":2550,"title":"Boneshaker (The Clockwork Century #1)","description":"Storyline: \n Boneshaker (The Clockwork Century #1) \n In the early days of the Civil War, rumors of gold in the frozen Klondike brought hordes of newcomers to the Pacific Northwest. Anxious to compete, Russian prospectors commissioned inventor Leviticus Blue to create a great machine that could mine through Alaska’s ice. Thus was Dr. Blue’s Incredible Bone-Shaking Drill Engine born. \n But on its first test run the Boneshaker went terribly awry, destroying several blocks of downtown Seattle and unearthing a subterranean vein of blight gas that turned anyone who breathed it into the living dead. \n Now it is sixteen years later, and a wall has been built to enclose the devastated and toxic city. Just beyond it lives Blue’s widow, Briar Wilkes. Life is hard with a ruined reputation and a teenaged boy to support, but she and Ezekiel are managing. Until Ezekiel undertakes a secret crusade to rewrite history. \n His quest will take him under the wall and into a city teeming with ravenous undead, air pirates, criminal overlords, and heavily armed refugees. And only Briar can bring him out alive.\n \n","cover":"https://allnovel.net/images/boneshaker-the-clockwork-century-1.jpg","author":"Cherie Priest","type":"Horror","source":"allnovel","link":"https://allnovel.net/boneshaker-the-clockwork-century-1.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 6, 2019 12:21:56 AM"}}
