{"id":63939,"no":15,"title":"Page 15","content":"I didn’t like the idea of being with someone this rich. Someone who I had nothing in common with. I forgot for a second what I was even doing there.\n James stepped up behind me, not touching, but unbearably close, and I remembered then. Oh yeah, that.\n “Where’s your bedroom?” I asked bluntly. Perhaps it would be less intimidating than what I had seen so far. I highly doubted it.\n A strong hand fell on my nape, squeezing, then massaging. I leaned into the contact. Even his simplest touch was pleasurable.\n He grabbed my hair there, pulling the strands together into a ponytail. He used it like a handle. Or a leash. He pulled me, not ungently, up the stairs by it. My chin lifted up with his handling. It was firm and controlling, but with no pain. Yet.\n We passed by eight doors in the long hallway to his bedroom. His room was on the very end, the door already opened.\n He took me just inside of it, stopping to let me take it all in.\n The room was softly lit and colossal. Double doors opened into a well lit bathroom on the opposite side of the room. The walls were a medium taupe, the colors themed to the desert, similar to the rest of what I’d seen of the house.\n His bed was massive. I’d never seen a bed like that. It had to have been custom made. It had a massive four poster frame, made up of heavy dark wood that was intricately carved and nearly reached the high ceiling.\n It was topped by a heavy, latticed top of the same wood. It was patterned and carved into a piece of art. It was beautiful and frightening. It was a bed made for beauty and pleasure. And bondage and pain.\n I picked out the more alarming little details slowly, as I took in the entire massive bedroom. Restraints were hanging, attached to the latticed top. And more were fastened to the posters themselves, laid out neatly against the crisp white sheets.\n “Are those ropes?” I asked in a breathless voice. There was some kind of cushioned ramp in the middle of the bed, in a sandy beige that matched the carpet. I wasn’t sure what it was for.\n “Yes,” he answered, and didn’t elaborate.\n My eyes caught on the object they had perhaps been avoiding. A black riding crop lay on the ramp. “Is that a riding crop?” I asked, my voice catching, but I knew the answer.\n “Yes,” he answered, moving for the first time since we’d entered the room, nudging me forward by his grip on my hair until I was several steps closer to the bed. “I have more toys that I want to use on you, but I didn’t want to intimidate you by laying them all out.”\n I laughed, and it was a desperate kind of noise. So this was how he tried not to intimidate me?\n “You need to pick a safe word,” he told me. It was an order.\n I took a deep breath. “I assume you know I’ve never done any of this before?” It was a question.\n “Yes,” he breathed, his voice thick and intense.\n My mind went blank. “Sotnos,” I said finally. It was as though my mind had worked independently of my brain.\n “Sotnos?” he asked archly. He imitated the accenting of the word perfectly on the first try.\n “Yes.” I wouldn’t tell him why. I was shocked at myself for choosing it, though it made a sick kind of sense. But I certainly wouldn’t explain it to him.\n He tugged on my hair, hard, tilting my head back and to the side until I looked at him. His gaze was hard. “There are rules in here. I become your master in here, and I will punish you when you defy me. I will read your reactions, and try not to go too far, but if I do, or if there’s something you just can’t handle, that’s the word you use.”\n “What about outside of here? Didn’t you say you would punish me for lying to you? But we weren’t in here when I lied to you.”\n He smiled at me, and it was wicked. “There are exceptions. I will never lie to you, and I expect you to learn to do the same. Tell me what your safe word means.”\n I shook my head stubbornly. “No.”\n “Would you rather take more lashes than just tell me what that means?”\n I nodded. “Yes.” I tried to sound sure, but I wasn’t. I had no concept of how hard he would hit me, or how much it would hurt, but I had spent my formative years being conditioned for pain, and I couldn’t imagine that I wouldn’t have a higher tolerance for this than most.\n He ran a tongue over his teeth. It was incredibly hot, watching that skilled tongue run across his straight white teeth. I hadn’t seen it before, but the teeth on the outside of his canines were a little sharp, almost faint fangs, the four teeth between them straight and perfect. Even his teeth were impossibly sexy.\n Figures, I thought, almost resentfully.\n “How about an exchange? Is there something I could give you in exchange for that information? Something you want to know about me? Something you want in general?” His voice had turned to velvet as he spoke.\n I wasn’t even tempted. I was not talking about it. I shook my head. He gripped my hair, hard.\n “You’re driving me crazy,” he said softly, then nudged me towards the bed. “We need to talk. We need to figure out this arrangement. But I can’t wait any more for this. Nothing has ever made me feel this wild before. I need to mark you. I need to own you. I need to punish you. I need to open you up and strip every detail out of you. And I will get you to tell me what that word means to you.”\n The last two sentences made my heart beat the fastest. That was never going to happen, but I couldn’t find the voice to tell him that just now. I couldn’t find the breath. It was panting out of me in a harsh rhythm of mindless fear and anticipation.\n CHAPTER THIRTEEN\n Mr. BDSM\n “Lift your arms,” he told me, when we were a scant foot from his forbidding bed.\n I did, and he lifted my dress off in one smooth move. He sucked in a breath and circled me slowly. I barely noticed how he perused my body. I was too busy drinking in the sight of him.\n His exquisite torso was even closer now, and the lighting was much better. He was even more perfect than I had realized. There wasn’t an ounce of fat on him. Just hard, rippling muscles roping his tall form.\n His hair was the color of caramel in the soft light. It trailed into his stunning face temptingly. I wanted to touch it, I wanted to touch him, but he had said there were rules in here, and the thought gave me pause.\n He bent down in a swift move when he reached my left breast, biting me hard through my lacy black bra.\n I made a little yelp at the sharp bite, and he pulled back, continuing to circle me. He snapped my thong as he reached my hip.\n “You are too much,” he told me. He stopped at my back. “A virgin with the sexiest body I’ve ever seen in my life. Too fucking perfect.” As he spoke, I felt him kneel behind me. I puzzled over what he was doing only a moment before he bit my butt, hard.\n I sobbed in a breath. It had hurt. I glanced back. He was kissing the wound now, his teeth marks clearly imprinted into my skin. I glanced at the nipple he had bitten. Teeth marks were clearly imprinted there as well, though he hadn’t bitten me there anywhere near as hard.\n “I want to cut all of your clothes off, but I love everything I see you wear, and I have no idea where you got any of it, so I don’t know how to replace it.” He fingered my panties as he spoke.\n “The thongs are from Victoria’s Secret. So is the bra,” I told him. Just trying to be helpful.\n He gave me an approving smile that was all teeth, followed by a sharp slap on the ass.\n “Don’t move,” he told me, moving to the closest bedside table.\n My eyes widened. I don’t know what I had expected when he said cut, but the sight of a knife in this room of pain sent a streak of panic through me.\n How far would he go? How far would I let him go?\n He laughed wickedly at the look on my face. “It’s just for cutting clothes. I would never cut your skin. The thought is abhorrent to me. I just want to blister it a little.”\n He came back to me, grabbing the front of my bra and tugging it out from my breasts, cutting it in one clean motion, directly between the cups. His gaze was glued to my small, rosy nipples, and I felt them getting impossibly tighter by the second. He pinched them one by one, softly, then harder, finally giving them a firm pinch.\n “How sensitive are they? Did you like the first touch better, or the last?” He pinched them harder still, and I moaned. “Or the fourth time?” he asked.\n I swallowed. It was an easy answer for me. I just couldn’t seem to get the words out. I cleared my throat. “The fourth.”\n “Good. I have something for you.” He walked back to the side table, reaching inside and taking out some sort of light silver chain.\n He was back in front of me, fastening some kind of clamp onto both of my nipples before I even had a clue what they were.\n “Nipple clamps. Are they too tight?”\n I shook my head, looking down at them. Each nipple was pinched by a small, peach colored clamp, the silver chain connected between them. He wrapped the chain around the back of my neck, fastening it there. The sight of that thin chain, and those hungry little clamps, and the feel, god, the feel, was so erotic that I had to press my thighs together to try to stop the rush of liquid there.\n He sliced each side of my thong, removing it and stuffing it in his pocket.\n “Climb on the bed,” he ordered me, his voice low and hoarse. I did so. “Climb over to that ramp until your knees are touching it. Yes, right there.”\n I felt him climbing up right behind me. Just as my knees touched the ramp, his hand applied a firm pressure to the nape of my neck, pushing until I was face down on the ramp. My cheek lay on the broad end of the riding crop he had left there. My face was low, my ass lifted. Perfect spanking position, I thought.\n “This isn’t your knee,” I told him.\n He laughed, and it was a very pleased noise. “It is not. My lap isn’t a safe place for you at the moment. We’ll get to that, though, I promise.” As he spoke, I felt him slipping a rope over my ankle. He tightened it firmly, but it wasn’t at all uncomfortable.\n “The more you struggle, the more these will chafe. Keep that in mind.” He secured my other ankle and my wrists with swift, economical movements.\n He climbed back to a position behind me and the ramp. He leaned over me then, his torso pressing into my back, his groin against my butt. I wiggled, and a hard hand swatted me lightly.\n “Hold still,” he told me, slipping the crop out from under my cheek. He lifted his weight completely off of me. I moaned at the loss. He swatted me with his hand for that, too.\n There was a long pause while I waited for him, breath held.\n “Do you have anything to say before I begin?” he asked me.\n “I’m sorry, Mr. Cavendish,” I told him, my tone repentant. Instinctively, I arched my back.\n He made a delicious little humming noise in his throat and began to work. The first slap of the leather was more startling than painful, but the slaps got harder as he warmed up. As I had expected, I felt the pain, but my reaction to it wasn’t a negative one. I moaned and wriggled helplessly when the crop hit lower, closer to my sex. He began to slap the crop against me hard and fast.\n Abruptly, he stopped. I had received only twenty slaps, distributed all over my butt and the backs of my thighs. \n","sourceLink":"https://allnovel.net/in-flight-up-in-the-air-1/page-15.html","bookId":1926,"book":{"id":1926,"title":"In Flight (Up in the Air #1)","description":"Storyline: \n In Flight (Up in the Air #1) \n When reserved flight attendant Bianca gets one look at billionaire hotel owner James Cavendish, she loses all of her hard-won composure. For a girl who can easily juggle a tray of champagne flutes at 35,000 feet in three inch heels, she finds herself shockingly weak-kneed from their first encounter. The normally unruffled Bianca can\u0027t seem to look away from his electrifying turquoise gaze. They hold a challenge, and a promise, that she finds impossible to resist, and she is a girl who is used to saying no and meaning it. \n Bianca is accustomed to dealing with supermodels and movie stars in her job as a first class flight attendant, but James Cavendish puts them all to shame in the looks department. If only it were just his looks that she found so irresistible about the intimidating man, Bianca could have ignored his attentions. But what tempts her like never before is the dominant pull he seems to have over her from the moment they meet, and the promise of pleasure, and pain, that she reads in his eyes.\n \n","cover":"https://allnovel.net/images/in-flight-up-in-the-air-1.jpg","author":"R.K. Lilley","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/in-flight-up-in-the-air-1.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:52:24 AM"}}
