{"id":63940,"no":16,"title":"Page 16","content":"I arched and muttered a protest then and I could hear his breathing, harsh and uneven, behind me. I rubbed my clamped nipples against the soft material of the ramp, liking the harsh bite of sensation it caused.\n James remained still behind me for long moments.\n “I need to stop there. I don’t want you too sore to lie on your back when I take you. Fuck. I can see the liquid running down your legs.” I felt his fingers stroking my thighs, sliding through the moisture there.\n “We need to do a few things before I fuck you. I have a health exam on the table over there. I’ve been tested. All the results are clean. Do you want to see it? It’s available for you. I want to bury my cock in you bare, if you’ll allow. You said you’re on the pill, right?”\n I nodded. “I am. I’ll take your word for it. If I thought you would lie about something like that, I wouldn’t be letting you tie me up and pound the V-card out of me, now would I?”\n He laughed, a happy sound, and I felt him kiss my cheek from behind in a surprisingly sweet gesture.\n He slid the ramp from underneath me with no warning, knocking it right off the bed. I fell to the bed with a soft little whoosh.\n He had my ankles free in the next instant, gripping them with his hands. He pushed me up higher on the bed, and in a shocking movement flipped me onto my back with just that contact. My arms twisted above my head, confining me even more. He had my legs spread wide when he tied them this time, and if I’d thought they were tight before, I’d been mistaken. I couldn’t move them at all now. No more wiggling for me.\n He studied me in my new position, and I studied him. His gaze was so intense it was mesmerizing. His eyes drank in every inch of me, and then he bent to start on me with his mouth. He started with a soft chaste kiss on the mouth. And then he moved down and not an inch of the front of my body was left chaste. He kissed me from my jaw, down my neck, to my collar bone. Not a nerve in my body was safe. And all the while, I couldn’t move an inch.\n He buried his face between my breasts, and pulled up in a quick push-up motion, the chain between the clamps clenched in his teeth.\n I cried out at the harsh sensation, but it was a cry of pleasure more than pain. He kept pushing up until my nipples were pulled up, the chain taut. It was exquisitely agonizing. He finally released the chain, opening his mouth, and that was just as devastating, the end of the torture making me sob out a plea.\n He suckled each breast then, soft and conciliatory noises coming from his throat as he tended to them.\n He licked to the undersides of my heavy breasts, down to my ribs, into my naval, nuzzling my hips, and stopping at my shaved sex. The tiniest patch of trimmed blond hair remained there. He fingered it, looking up at me.\n “Fucking perfect,” he murmured, his face serious, and buried his face there to work it’s magic.\n I was so wet and ready that he had me coming in seconds. Two fingers inside my cleft and his tongue on my clitoris, his knowledge of those two perfect buttons mind-boggling, and I was so gone, screaming without holding back. His head lifted briefly, and I looked down the length of my body at him. He was framed perfectly between my heaving breasts. I felt absolutely drugged from his attentions.\n His caramel-colored hair trailed into his eyes. “Again,” he told me, and did it again.\n He straightened after that, slipping his shorts off to finally reveal his full naked self to me. I swallowed hard at the sight of him. That was when I started begging.\n His rock hard length looked too big to fit inside of me, but I didn’t care. I wanted it inside of me. If he made me wait another second, I thought I would cry.\n “I can’t wait anymore,” he told me in a rough voice. “This is going to hurt. From what I’ve heard, that’s unavoidable.”\n I didn’t care. “Please, James. Please, please, please.”\n He didn’t hesitate after that, lowering himself on top of me, and lining his cock up against my slick cleft. Sleek muscles sharply defined his broad shoulders as he held himself over me.\n An exquisite work of art is about to fuck me, I thought, dazed and out of my mind turned on.\n He thrust into me with one hard, brutal motion, piercing my hymen without further ado. I cried out at the shock. I felt so impossibly full. He didn’t stop, thrusting fast and hard, setting an inexhaustible pace that had his sweat dripping down onto me in delicious trails. That initial sharp, biting pain faded as he thrust, turning into the purest pleasure, and the empty space at my core was filled to bursting with a wash of sensations that I could never have imagined.\n I couldn’t keep back the sobs that escaped my throat, the tears that trailed down the sides of my face at the exquisite feeling of being both dominated and filled by this man.\n He watched me the entire time with those intensely vivid turquoise eyes. My eyes started to close with the pleasure once, and he barked out a harsh order for me to open my eyes and look at him.\n I obeyed, though the intimacy of that extra contact was almost too much for me. It was hard to remember that we weren’t supposed to feel anything for each other when he looked at me like I was more important than his next breath.\n He pulled out almost completely, had me pleading with him to stay, before he pounded back in with a growl. If I had thought he was letting go before, now he was pounding me into the mattress until I thought I might leave a permanent imprint.\n He reached a hand down between us, rubbing circles around my clit without slowing his furious pace.\n “Come, Bianca, now,” he ordered, and his order worked as a trigger. I screamed as I came, and he shouted my name as he followed me, burying himself to the hilt as tremors wracked him, his neck arcing with his pleasure. As the waves started to subside a little, he gripped my chin, looking at me with an almost angry, and certainly possessive, gleam.\n “You’re mine,” he told me. I had no idea what to say to that, but I didn’t need to respond. In the next instant, he was kissing me passionately, desperately.\n He released my wrists and ankles and undid my nipple clamps more quickly than I would have thought possible. He pulled me against him, lining us up flesh to flesh, and started kissing my mouth again, as though he would never stop.\n “Thank you,” he told me quietly, just once, when he came up for air, then began kissing me again.\n CHAPTER FOURTEEN\n Mr. Sensitive\n Eventually he stopped kissing me and pulled my cheek against his chest. I was reeling with the realization that casual sex could feel so intimate. I felt so cherished as he stroked my back reverently and whispered sweet words to me.\n He left me. “Don’t move,” he said, his voice almost a whisper, as though afraid to intrude on the moment with noise.\n I heard him start the bath, and couldn’t think of anything that sounded more perfect than a hot bath at that moment.\n I lay on my back, exactly as he had left me, feeling more relaxed in every part of my body than I could ever remember. I felt…peaceful. It was a revelation.\n When he’d been gone for several minutes, I opened my eyes to look around.\n He stood at the foot of the bed, watching me, his eyes ablaze. I glanced down my body and realized there was blood spread around on the sheets rather messily.\n “I didn’t realize I would bleed so much,” I said, starting to sit up.\n “Don’t,” he told me, and I lay back down. We watched each other. I saw that his erection was as hard as though he’d never come.\n I pointed at it. “Can you go again? Is that possible?”\n He smiled, and stroked his cock idly with one hand. “Oh, yes. But you’re too sore tonight. I was just enjoying the view. Embedding this image into my brain.”\n He came to my side, lifting me until I was cradled against his chest. He rose from the bed with my weight in his arms. He showed no visible strain. I loved that, his strength, and all of the amazing things he could do with his body, seemingly effortlessly.\n “Let’s take a bath and talk about what we’re gonna do about this,” he said, stroking my hair, as though the ‘this’ was me.\n It made me smile for some odd reason, though the thought of talking about anything held no appeal for me at that moment.\n He stepped into the biggest tub I’d ever seen, still holding me.\n The bathroom was one giant slab of greenish-black granite, so far as I could see. The tub was square and he slid down against one side of it, holding me in front of him until we were sitting up together, him spooning me from behind.\n He pumped some divine smelling soap out of a built-in granite dispenser and began to lather soap over my entire body leisurely. It smelled like him, and I breathed it in. I felt positively decadent, laying there bonelessly while he tended to my bath.\n “I love that soap. It smells like you,” I told him, eyes closed in pleasure.\n He brought his lips to my ear, biting the lobe teasingly. “Now you smell like me. I love that.”\n He washed me in silence for a few minutes, stroking as much as cleaning. He kept coming back to my breasts, stroking and kneading the pliable flesh thoroughly.\n “We need to talk,” he told me.\n I groaned, and not in pleasure this time. “I’d prefer that you spank me again. Can we do that instead?” I was only half-joking.\n He made a delicious purring noise against my neck. “Not tonight. We need to set up the rules for this. If my self-control hadn’t deserted me tonight, we would have settled it before I ever touched you.”\n I cringed at his terminology. The word ‘settled’ gave me a bad feeling. I didn’t think it boded well for the conversation to come.\n “What is there to talk about?” I finally asked.\n He sighed, the motion shifting me where I lay with my back on his chest.\n “Well, I suppose I’d like to know what you would like out of our arrangement. What’s important to you?“ As he spoke, he turned me so that he could see my face more clearly, my head supported by the crook of his elbow.\n I wrinkled my nose at him. The term ‘arrangement’ was even worse than ‘settled’.\n “Really, the only thing I expect from you is an exclusive sexual relationship while we’re…having sex, even if we’re done with each other in a week. And by done, I mean some type of communication before you start seeing anybody else, sexually or otherwise. And if that’s a struggle for you, just let me know so I can bail out on the whole mess now.”\n He blinked at me, looking stunned, and I thought for an awful moment that he considered that too much of a concession. I was about a second away from getting the hell out of there when he spoke. “Yes, of course.” His tone implied that he hadn’t even considered anything else.\n “And you want to not date,” I prompted him. I was avidly curious to know what that meant for him.\n He nodded, studying my face. “I want to see you, though, as often as possible. I would just prefer for our relationship to remain private. So most of our meetings will be at one of my homes or yours. I won’t be taking you out to a lot of public places, I regret.”\n Sure he did, I thought cynically.\n I made my face go blank, suddenly feeling a little delicate for reasons I wasn’t willing to examine at that moment. \n","sourceLink":"https://allnovel.net/in-flight-up-in-the-air-1/page-16.html","bookId":1926,"book":{"id":1926,"title":"In Flight (Up in the Air #1)","description":"Storyline: \n In Flight (Up in the Air #1) \n When reserved flight attendant Bianca gets one look at billionaire hotel owner James Cavendish, she loses all of her hard-won composure. For a girl who can easily juggle a tray of champagne flutes at 35,000 feet in three inch heels, she finds herself shockingly weak-kneed from their first encounter. The normally unruffled Bianca can\u0027t seem to look away from his electrifying turquoise gaze. They hold a challenge, and a promise, that she finds impossible to resist, and she is a girl who is used to saying no and meaning it. \n Bianca is accustomed to dealing with supermodels and movie stars in her job as a first class flight attendant, but James Cavendish puts them all to shame in the looks department. If only it were just his looks that she found so irresistible about the intimidating man, Bianca could have ignored his attentions. But what tempts her like never before is the dominant pull he seems to have over her from the moment they meet, and the promise of pleasure, and pain, that she reads in his eyes.\n \n","cover":"https://allnovel.net/images/in-flight-up-in-the-air-1.jpg","author":"R.K. Lilley","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/in-flight-up-in-the-air-1.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:52:24 AM"}}
