{"id":63953,"no":29,"title":"Page 29","content":"“Would you pose nude for me?” I asked him when he ended a call.\n He looked surprised.\n “Out here?” he asked, glancing around my backyard.\n I laughed. It was tiny, but the barrier was high, giving it a fair amount of privacy.\n “On my bed?” I asked cautiously. I couldn’t believe that he would do it, but I was starting to feel hopeful.\n “Okay, but I need to make one more phone call.”\n I nodded, grinning, very happy at the prospect of such a painting.\n “I’ll be in my room, setting up.”\n He came in several minutes later. He was still in his boxers.\n “Where do you want me?” he asked, eyeing up my small room.\n “Just on the bed. On your side, I think, though I may experiment a little.”\n He slid out of his only piece of clothing and complied. He lounged on the bed, looking relaxed. Well, most of him anyway. His cock was not relaxed, jutting huge and erect between his legs.\n I licked my lips.\n “Should I paint it like that?” I asked, pointing at him. “Or will it get soft?”\n He laughed. “You might as well paint it like that. It won’t be getting soft any time soon. It has a mind of it’s own.”\n I licked my lips again. “Can I do anything for it? For you? Before I start painting. I could take you in my mouth.”\n His eye got a little glassy at the suggestion. “No. I need to prove to myself that I can abstain for a few days.” But he stroked himself roughly with his hand.\n I moved to him, but he waved me off, letting go of himself.\n “No,” he told me firmly. “It’s important to me that I know I have control of what I do to you.”\n I swallowed, but respected his wishes. Whatever the reason.\n I began to paint him without any of my normal prep work. It was a joy to work on him, and I lost myself in the process for the second time that day.\n It was unusual for me to get so engrossed in two projects in one day, though it did feel like more of a continuation of one project.\n “I love painting you,” I told him.\n He watched me tirelessly, his hard jaw propped against his fist. “That works out well, since I love watching you paint. You have such dreams in your eyes. It’s mesmerizing.”\n I gave him a warm look, thinking that he could be almost unbelievably sweet.\n “What are you going to do with this painting?” he asked after a long period of comfortable silence.\n “Hang it right next to my other painting of you, as part of my spank bank,” I told him, trying to make him laugh.\n It worked. He clutched his stomach, falling onto his back as he laughed.\n “What on earth do you know about a spank bank?” he asked me with an infectious grin.\n I smiled back, still painting. “My best friend is a guy. I’ve heard the term often enough, though I never really related to it before.”\n He moved back into his pose, an irrepressible smile still on his face.\n “I’m surprised you can sit still for so long. I wouldn’t have guessed you had it in you. You seem like a constantly on the move type of guy,” I told him.\n “It is unusual for me. I like your house. It’s a peaceful, happy place.”\n I couldn’t help it. I beamed at him. “I’m pleased you like it. I like it, too.”\n “I hope I’m invited back often.”\n I just smiled, working on the painting intently.\n We’ll see, I thought.\n He let me paint him for hours before I finally quit, needing a break.\n He had taken to reading a Manga from my bedside table. It was a Shojo Manga, and I blushed a little when he found it, embarrassed for him to see that I was interested in something so romantic and silly.\n He was smiling at something as he turned a page. It was a library copy, the only kind I could afford. I hadn’t read it yet, but it was #15 in a series I’d been following for years. I’d been on the library’s waiting list for it for almost six months.\n “Don’t give anything away,” I warned him. “I haven’t had a chance to read it yet.”\n He looked up with a toothy grin. “You’re that into this? I have to say, that almost gives me hope. It’s so sweet and romantic.”\n I gave him my little shrug. “I don’t know what it is, but I’m totally infatuated with manga and anime. It’s all very funny to me. And I love the characters.”\n He wiggled his brows at me as I finished putting my supplies away, coming back into the room, where he was still reading the manga.\n “So let’s watch some anime. You watch it on your computer?” he asked.\n I nodded. It was the only place I watched anything at my house, since I didn’t have a television.\n “I want to see your favorite,” he told me.\n My old computer was set up in a small nook in my living room. James pulled my love seat close to the computer, and I set up an episode of a vampire anime that I had watched several times. I loaded the first episode.\n I couldn’t imagine that James would enjoy it. It was kind of screwed up, and I thought that the target audience for it must be girls. But it was the first anime I had thought of when he’d asked me to play my favorite.\n We watched it for hours. James cuddled me against his chest, but seemed glued to the screen, transfixed by the anime. I had always found it fascinating, as well. I got caught up in it again.\n “So we’re voting for her to choose the silver-haired guy, right?” James asked me as we finished a cliff-hanger episode.\n I scoffed at him. “No. The dark-haired one. She totally adores him. She’s been in love with him forever.”\n He threw up his hands, laughing at me. “We just found out that that one’s her brother!”\n I glared at him, feeling defensive about my beloved characters. “He was just raised as her brother. He was reincarnated, or whatever.” It had a convoluted plot, which seemed to happen a lot in the animes I loved.\n He laughed harder. “So that makes him her great-great-great-great grandfather? And that’s somehow better?”\n I poked him in the ribs with my elbow, but couldn’t help but laugh as well.\n He nuzzled against my ear, then pinned me down beneath him, holding my wrists above my head.\n “You’re a perverted girl, aren’t you? I bet you like hentai,” he teased me, referring to the X-rated version of anime.\n He began to tickle me. I slapped at his hands, giggling helplessly.\n “Say it,” he laughingly insisted. “Say, I like hentai, you naughty girl.”\n I said it, and he kissed me, but it was a quick kiss, since we were both still laughing.\n “You can call me Grandpa, if that does it for you,” he teased.\n I laughed, tugging on his hair.\n I’d never had so much fun watching anime, especially since I usually only ever watched them by myself. Stephan didn’t care for anime. He said they never had happy endings. He thought even the silly, funny ones were a little sad. Whereas, I thought even the saddest ones were a little silly and funny.\n I made a quick trip to the bathroom, but froze when I saw what James was looking at on my computer when I re-emerged. I blushed harder than I’d ever blushed in my entire life.\n I didn’t look up porn often. Hardly ever, in fact. But I had felt a strange urge to look up some sites with very specific BDSM content the night I’d come home after meeting James for the first time on a flight.\n I had always had an unwilling fascination with BDSM, and even with the small interaction James and I had had on that flight, that fascination had been triggered, to the point that I’d come home and looked up the things that I fantasized him doing to me.\n I still didn’t know why, even with my inexperience, I had known so certainly what he wanted to do to me. There had just been something in his eyes, a hint of the dominant in him so clear to me that I couldn’t deny it.\n He was watching one of the videos I’d found that night. A bound and gagged woman was being flogged rather vigorously by a huge man who stood behind her. She was wearing a black leather corset that still left her breasts bare. Her lips were bloody red, her hair raven black.\n The man was dark-haired and burly, with coarse hair matting his barrel chest. He was a crude beast of a man, especially compared to James. It had simply been the closest thing I could find to the things I pictured James doing to me, the things I had imagined he craved to do to me. I had turned out to be very right about him. In fact, my fantasies never could have done him justice.\n “You looked at my history,” I said softly, moving to step up behind him. If he had looked up my history, that meant he knew just when I had been watching the raunchy video.\n He just turned and looked at me, his eyes very knowing.\n “Yes,” he said without shame. Then he smiled. It made my breath catch. “You were quite the busy, kinky girl the night we met. You never fail to surprise and delight me, Bianca. But I do hope this brute of a man is not your type.” He waved his hand at the screen.\n I shook my head vigorously, my eyes wide. “I never had a type until I met you, James. And now I suppose my type would be impossibly beautiful men with honey colored hair, turquoise eyes and an unexplainable, perpetual tan. There wasn’t any BDSM porn available with that ‘type’.”\n He lounged back in the small computer chair, running his tongue over his teeth just so.\n I clenched my thighs together, feeling a rush of heat between my legs.\n “You know what I did that night when I got home?” James asked, his voice very low, his eyes so warm on my face.\n I shook my head.\n He smiled. “I jerked myself off three times in a row just thinking about that little blush you got every time our eyes met. You were so composed, so professional, but I knew you would submit to me perfectly in bed. Just one look at you, and I was lost.”\n I blushed, my mind flying back to that first meeting.\n I had been called in to do a charter flight from Las Vegas to New York. Our CEO had personally requested for me to work the flight on my day off, so I could hardly refuse. I had been baffled when Stephan hadn’t been asked. I hadn’t looked forward to the trip, even though it was good overtime, because our CEO tended to be a little too friendly, slimy even, with female flight attendants.\n But I had gone. The plane had been nearly deserted, and I had been the only flight attendant to work first class. Three flight attendants worked main cabin with less than twenty passengers to tend to. I had only had two. James and the CEO.\n James had arrived first, and we had frozen at the sight of each other. He had just been stepping into first class when our eyes met. I had been paralyzed, and he had been, well, intense.\n I had forgotten the job I was supposed to do, the things I was supposed to say, as we just stared at each other for long minutes.\n I told myself I was imagining all of the things I saw in his eyes, that they were just wild fantasies about an impossibly beautiful man in an impeccable suit.\n I had looked into those eyes and seen a man who I wanted to submit to on the most basic level.\n We hadn’t moved until my CEO’s voice boomed from behind James, prompting him to take a seat. I had shaken myself and gone back to work, but every interaction, every glance his way, had made shocks of awareness shake my body, heat rising to my cheeks every time I met his incredible turquoise eyes. \n","sourceLink":"https://allnovel.net/in-flight-up-in-the-air-1/page-29.html","bookId":1926,"book":{"id":1926,"title":"In Flight (Up in the Air #1)","description":"Storyline: \n In Flight (Up in the Air #1) \n When reserved flight attendant Bianca gets one look at billionaire hotel owner James Cavendish, she loses all of her hard-won composure. For a girl who can easily juggle a tray of champagne flutes at 35,000 feet in three inch heels, she finds herself shockingly weak-kneed from their first encounter. The normally unruffled Bianca can\u0027t seem to look away from his electrifying turquoise gaze. They hold a challenge, and a promise, that she finds impossible to resist, and she is a girl who is used to saying no and meaning it. \n Bianca is accustomed to dealing with supermodels and movie stars in her job as a first class flight attendant, but James Cavendish puts them all to shame in the looks department. If only it were just his looks that she found so irresistible about the intimidating man, Bianca could have ignored his attentions. But what tempts her like never before is the dominant pull he seems to have over her from the moment they meet, and the promise of pleasure, and pain, that she reads in his eyes.\n \n","cover":"https://allnovel.net/images/in-flight-up-in-the-air-1.jpg","author":"R.K. Lilley","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/in-flight-up-in-the-air-1.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:52:24 AM"}}
