{"id":63960,"no":36,"title":"Page 36","content":"I felt overwhelmed by his home, but still appreciative of it’s beauty. I ran a finger along the gleaming dark gray top of the heavy, colossally large table that dominated the room.\\n\\n I admired the huge arrangement of flowers in the middle of the table. It was a mix of vibrantly colored orchids, displayed in a short, square, intricately carved crimson vase.\\n\\n I was studying the extravagant view of central park when James reappeared a few minutes later, holding a thin square box and smiling.\\n\\n CHAPTER THIRTY-ONE\\n\\n Mr. Mercurial\\n\\n He took my hand and began to lead me again. “I’ll give you the grand tour later,” he muttered, hurrying. He led me up both flights of stairs, then down a long hallway.\\n\\n “I seem to only get to see very specific parts of your houses,” I responded archly.\\n\\n He sent me a conciliatory smile. “I’ll make it up to you. Later.”\\n\\n He pulled me into a room that I could see was the master bedroom just from the monumental size of the bed. The blinds were opened to the same amazing view of the park as the dinning room, just a few stories higher. The window lined nearly an entire wall of the room, floor to ceiling. The bed was a more modern take on the one he had in Vegas, with cleaner lines, but I was sure it had the same function by the cage-like top and thick, square posts. The hues in the room were a mix of bright, varying shades of green, accented with white, with starkly dark wood dominating all of the furniture and the floor. With an entire wall framing a spectacular view of the park, it had the feel of an indoor forest.\\n\\n “It’s amazing,” I told him honestly.\\n\\n He smiled, pleased with my reaction.\\n\\n I noticed a small door with no handle near the open bathroom. It was conspicuous because there was a lit panel with a button beside it. I pointed at it. “Is that an elevator?”\\n\\n His smile turned wicked. “Yes.”\\n\\n “I didn’t realize the apartment had an elevator.”\\n\\n “It has a few, actually. But that one goes somewhere special. I’ll be showing you soon. First, I want you to get on your knees and close your eyes.”\\n\\n I sent him a startled look. He had switched gears without blinking, as usual. It was hard to keep up with his changing moods.\\n\\n I knelt, obeying him because we were in his bedroom, and it was just so natural to let him rule me here.\\n\\n I closed my eyes. After a few heartbeats I felt something cool being placed against the very upper edges of my collarbone.\\n\\n James straightened the collar of my uniform, shifting it around.\\n\\n “Perfect,” he murmured. “You can wear it to work.” He tucked what felt like a slightly rough circle of some kind against my chest.\\n\\n “Okay, open your eyes,” he said finally.\\n\\n I did, and he pulled me to my feet, leading me into a large, softly lit closet. The closet was twice the size of my bedroom, with expensive men’s clothing lining the walls. It smelled divine, like James himself.\\n\\n He positioned me in front of a large floor-length mirror, and began to undress me without a word. He undid my tie first, politely hanging it on a hanger. He showed me a large, bare rack in the closet. “This will be for your things. If you run out of room, I’ll make more for you.”\\n\\n I was a little stunned at his assumption that I would be keeping things here.\\n\\n “I would very much like for you to use my personal shopper to buy a wardrobe for you here in New York, so you don’t have to move your things across the country. She should be getting in touch with you in a few days.”\\n\\n “That’s silly. I don’t want you buying me clothes,” I told him, trying not to get angry. “It feels too much like being kept.”\\n\\n He sighed. “It’s just clothing. I thought we had decided that you weren’t going to balk at gifts.”\\n\\n I glared at him, and he saw my expression.\\n\\n “Please, just consider it. You don’t have to decide right now. We have other things to talk about, at the moment.”\\n\\n I lost my train of thought as he removed my jacket and vest, hanging them. His fingers lingered on the button at my throat. He undid my top four buttons, spreading my shirt open to reveal the necklace he had placed around my neck.\\n\\n It was lovely, made of some kind of silver metal into what looked like one solid band, but was in fact soft and moveable, just a very seamless looking, tightly linked necklace. It sat right at the very top of my collarbone, at the base of my throat. He was right. It had been hidden just perfectly under my uniform. At the center of the thick choker sat a large diamond studded hoop. I fingered it, and he reached around me to hook his index finger into the loop, tugging lightly.\\n\\n “It’s lovely,” I told him, but I was troubled. What was it’s significance to him?\\n\\n “I had it made as a sort of workable version of a slave collar.”\\n\\n I froze at the word, instantly wanting to take off anything with such a name. He gripped my hands tightly, holding them down at my sides firmly, as though sensing my intent.\\n\\n “Just hear me out. We already have a dominant-submissive relationship. It comes naturally to us. It is just who we are. But that can mean whatever we want it to mean. Do you understand? I want to find the best balance for us both.”\\n\\n I was already shaking my head at him. “That only comes natural to us in bed. I don’t want this going anywhere else. You don’t get to boss me around in any other part of my life. And I’m no slave.”\\n\\n He inclined his head, although he looked displeased.\\n\\n “I’m not trying to boss you around anywhere else. I’m trying to have a relationship with you, something I’ve never done before, and I’ll take what I can get. I want you to see that I will work with you. I will make…concessions for you, if there’s something that you can’t accept. I simply want you to give me all that you can. And not to run, if you get overwhelmed. And it’s called a slave collar only because it denotes ownership. It is a symbol of your commitment to me, to give your body only to me and no one else. To submit your body only to me. There is a lock and a key that only I will be the owner of, but I won’t lock you in until you agree. I want you to tell me when you’re ready for that. Until then, you can wear it unlocked.”\\n\\n I stared at him for long minutes, my mind having a hard time processing what he was saying, when I was conflicted about so much of what he’d revealed.\\n\\n He wanted a relationship? What the hell did he mean by that? I shook myself, trying to focus on the issue at hand.\\n\\n “What if I’m never ready to be locked in?”\\n\\n He gave me an almost sinister smile. “I will endeavor to convince you.”\\n\\n He began to unbutton the rest of my shirt. I didn’t stop him, just stared at my collar, my mind racing.\\n\\n He stripped me with quick sure motions until I was only in stockings and garters. He watched me for a long time in the mirror, wearing just that, but eventually stripped those off too. He tugged off my watch and even my small stud earrings. My first instinct when standing completely nude in front of him was to cover myself with my hands, but I stifled the urge with effort. I knew it wouldn’t please him, and my overpowering urge to please him had only grown during our short, tempestuous acquaintance…\\n\\n He reached into a drawer and pulled out a tiny scrap of see-through black cloth. He wrapped it around my hips, fastening it with a tiny silver chain. It fit perfectly, sitting right below my waist, as though I’d been measured for it. It seemed to show as much as it concealed, every curve clearly visible beneath it, but James seemed very pleased with the results, his eyes positively glowing as he stared at me.\\n\\n I assumed by it’s ready location in the drawer that it was some sort of submissive uniform for him. God only knew how many women he had dressed in just this way. I tried my best not to think about that.\\n\\n He pulled something out of his pocket. It just looked like a lovely silver chain at first, but I saw the little clamps as he straightened the chain into a smooth line. He used a tiny clip on the chain to fasten it to the hoop in my collar.\\n\\n I gasped.\\n\\n He wrapped it through the hoop several times until there was just enough of the chain left to reach my nipples with the clamps. He fastened them, his eyes hooded, while my breath grew rough in agitation. It looked like a sort of obscene halter top of metal. With a slave collar…\\n\\n He smoothed my errant hairs into the chignon at my nape. He couldn’t seem to stop touching me. He stroked my shoulders and my waist and hips, but his fingers always found their way back to my breasts. He was tweaking the clamps until I could hardly stand the wait.\\n\\n “If you enjoy the clamps, you should be well suited to the piercings. The clamps actually apply more pressure than the piercings, after the initial pain.” He continued to play with my tortured nipples, tugging until I moaned.\\n\\n He pulled me by the hoop at my neck through his room and to the elevator. I could feel every step and pull in my achy breasts. I trailed after him, barefoot and nearly naked, him fully clothed in one of his mouth-watering suits. I looked back at his bed longingly.\\n\\n “I want you to take me on your bed,” I told him, a strange note of a plea in my voice. It just looked so perfect, and I was suddenly so needy.\\n\\n “I will, Love. But, first things first, ” he said, pulling me into the elevator the second it opened.\\n\\n The elevator began to move, descending smoothly.\\n\\n “How far down does this thing go?” I asked him, after it seemed like we had gone impossibly far.\\n\\n “Just four floors.” The elevator finally stopped, opening slowly.\\n\\n James tugged me out. “Welcome to the 4th floor, Bianca.”\\n\\n We entered a plain gray hallway first. The floor was smooth gray wood. It was clean and flawless, but starkly monotone.\\n\\n It feels like a dungeon, I thought with a shiver.\\n\\n We passed by two rooms before we entered the door at the end of the hall. I wanted to ask what the other rooms were, but I was suddenly terrified, my mind running wild with strange possibilities, feeling transported into another century. For all I know, he could have other women in them.\\n\\n The thought stopped me, and James had to tug harder to get me to follow him this time.\\n\\n “This is not the place to be obstinate, Bianca.”\\n\\n “Yes, Mr. Cavendish,” I said, a tremor in my voice.\\n\\n What was the worst that could happen? I asked myself, trying to talk myself out of my sudden, disproportionate terror.\\n\\n He positioned me in front of him, giving me a full view of the huge, dark gray room that he’d led me to. He waited patiently, giving me time to process what I was seeing.\\n\\n It was indeed a playground. It was a BDSM wet dream, from what I understood of what I saw. Chains, whips, shackles. Various torturous looking devices were set up in stations around the room.\\n\\n My attention seemed to focus first on some sort of swing to my right. It was a series of leather straps and metal that fascinated me. I shifted towards it without thinking.\\n\\n James followed my gaze and my movement. “So you like the swing? We can start with that. Since it’s your first time on the 4th floor, I’ll let you pick. I’m feeling generous today.”\\n\\n “Are you going to punish me?” I asked, my voice breathless.\\n\\n He just tsked at me, pulling me towards the swing. “If you disobey me in here, I will punish you. Until then, consider this just a lesson. Do you understand?” \\n\\n","sourceLink":"https://allnovel.net/in-flight-up-in-the-air-1/page-36.html","bookId":1926,"book":{"id":1926,"title":"In Flight (Up in the Air #1)","description":"Storyline: In Flight (Up in the Air #1) \\n When reserved flight attendant Bianca gets one look at billionaire hotel owner James Cavendish, she loses all of her hard-won composure. For a girl who can easily juggle a tray of champagne flutes at 35,000 feet in three inch heels, she finds herself shockingly weak-kneed from their first encounter. The normally unruffled Bianca can\u0027t seem to look away from his electrifying turquoise gaze. They hold a challenge, and a promise, that she finds impossible to resist, and she is a girl who is used to saying no and meaning it. \\n Bianca is accustomed to dealing with supermodels and movie stars in her job as a first class flight attendant, but James Cavendish puts them all to shame in the looks department. If only it were just his looks that she found so irresistible about the intimidating man, Bianca could have ignored his attentions. But what tempts her like never before is the dominant pull he seems to have over her from the moment they meet, and the promise of pleasure, and pain, that she reads in his eyes.\\n","cover":"https://allnovel.net/images/in-flight-up-in-the-air-1.jpg","author":"R.K. Lilley","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/in-flight-up-in-the-air-1.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:52:24 AM"}}
