{"id":63928,"no":4,"title":"Page 4","content":"Stephan raised his brows at me as I came back to stand beside him to see off the other passengers. “What did he say to you?” he asked, obviously curious. “The look on his face, and then on yours…”\n I just shook my head. “You don’t wanna know.”\n I went through the motions of our usual deplaning routine, not feeling at all like myself. Being around that man made me feel…strange. It felt a little like I’d been plucked away from my own orderly life and placed in the middle of some kind of a game. A game with rules that I hadn’t been told. And I had no frame of reference with which to learn those rules. I told myself firmly that I was only relieved that I had told James Cavendish no. He was just too much for me. He was too experienced, too jaded, too rich. And all of that would have been enough to dissuade me even if I was interested in dating, which I certainly was not. I never had been. And he was obviously into some kind of S\u0026M besides. I had my own demons to deal with, and that sort of thing was the last thing I should be interested in. But still… in spite of myself, I did find it fascinating. And frightening. And exciting. I knew that it was probably because of my violent childhood that an excited shiver ran through me at the thought of some of the things he’d said. Like putting me over his knee… I knew from countless visits to a shrink that the things that horrified people in childhood could also excite us as adults. The thought was sobering. I worked really hard not to be a victim of my childhood. That made it all the more important that I stay away from someone like James Cavendish.\n It took some convincing, but I felt I had adequately convinced myself of this as we got our luggage down, and then waited for the rest of the crew to join us.\n Stephan and I walked in the front of our little inflight parade as we made our way briskly through JFK. “Mmmm, I’d kill for a coffee right now. Shall we grab one on our way out?” Stephan murmured to me as we approached a small coffee stand to our right.\n I shot him a puzzled frown. “You know I’d never sleep a wink if I had coffee, but I’ll wait in line with you while you get one.”\n He gave an odd little shrug, his eyes intently on the coffee stand. “Nah, I guess I’ll wait til’ after a nap.”\n I followed his gaze to see Mr. Cavendish waiting at the coffee counter. He gave us an enigmatic smile, nodding cordially to Stephan. My head whipped around to eye Stephan suspiciously. He was nodding back at James Cavendish, smiling.\n “What are you up to, Stephan?” I growled at him, my voice pitched low so that the rest of the crew wouldn’t hear.\n He pursed his lips. I nodded stiffly as we made our way past Mr. Cavendish. I was going for polite, but cold. I thought I pulled it off well.\n “What? I can’t be polite?” he asked, his tone all innocence. I didn’t trust that tone at all. When I’d met Stephan he’d been a fourteen year old street hustler who could lie the wallet off of anyone breathing. He had long ago mastered the art of playing dumb. But I knew him better than anyone, and I wasn’t fooled for a second.\n “That smile you shared with him was downright conspiratorial. Tell me what you did. Did you give him my number?”\n He sent me a wounded glance. “I wouldn’t do that.”\n I was relieved. Stephan could skate around the truth like a pro, but he would never outright lie to me. If he said he wouldn’t give James my number, I knew it was the truth, so I left it alone after that.\n The crew van to the hotel was full of excited chatter about the plans for the evening. Apparently, everyone was planning to go out for drinks together at the bar on the corner near our hotel. Karaoke night. I cringed a little at the thought. It sounded a little too loud and embarrassing for my taste, or my mood. But I would be a good sport. It was a new crew, and I’d hate to be the only anti-social one in the bunch, when they were all so obviously excited.\n Also, I knew Stephan liked one of the bartenders at that bar. They’d been feeling each other out slowly for the last couple of months. We went there for either lunch or dinner almost every week, when we came to town. Stephan was ninety percent sure that the bartender was flirting with him, and not just a friendly guy. But it took him a long time to work up to actually asking a guy out.\n Stephan wasn’t out of the closet. I didn’t know if he would ever be ready for that. Gay guys who were out of the closet usually just weren’t okay with dating in secret as though they were doing something wrong.\n I knew that Stephan also preferred dating other men who weren’t out, because it made it easier to keep it low-key. But this made it much harder for him to date. I’d suggested to him that he could probably find people easier online, considering his restrictions, but he wouldn’t even consider it. He said online dating just felt wrong for him. He was a little old-fashioned about the strangest things.\n “You’re quiet, Buttercup,” he whispered in my ear. Melissa was describing to the van at large what she was planning to wear that night, and what she was planning to sing for her karaoke numbers. Her selection of ‘Sexy Back’ did not surprise me in the least. “You’ll come with us to the bar, right?” he asked me, a plea already in his voice. He thought I was going to try to duck out. I wasn’t. The bartender was the first guy he’d been interested in since a particularly hard breakup a year ago, and if he needed me there for moral support, I’d be there.\n I looked at him. His eyes were wide and doing their best ‘Puss in Boots’ impression for me already. Wow, he’s ready to bring out the big guns to get me to go tonight. I decided to let him off the hook. “I’ll go. But you have to swear not to make me sing or dance.”\n He nodded earnestly, smiling his happiest, boyish smile. “I know better. You’d have to be pretty drunk to get up on that stage. And I can’t remember the last time you had a drink.”\n It’d been years, I knew. The month I’d turned twenty-one had been fun, and I’d indulged at a few parties then, but me and alcohol just didn’t mix well. It was a family trait. Still, I considered having a few drinks with the crew. I was just so damned tense. Maybe I would indulge. Just let myself relax for a few hours. I couldn’t find a good reason not to. “Maybe I’ll have a few drinks tonight,” I told him.\n His eyes widened. “Yeah?” He was a moderate drinker himself, but he indulged more than I did.\n I shrugged. “Maybe.”\n “Okay, Chickee,” he said, drawing the end of the word into a long eeee sound. He put his arm along the back of my seat, giving my shoulder a squeeze.\n “You two are so darn cute,” Melissa gushed, when she saw his affectionate gesture.\n We both gave her neutral smiles. We didn’t know her well enough to explain ourselves to her, and frankly, I doubted we’d ever be close enough friends with her to do so. I tried to always give people a chance, but so far Melissa had not impressed me. I just found her untrustworthy, though I had nothing concrete so far to prove that. Although, she did openly admit that her goal in life was to find a rich man to take care of her. That seemed pretty damned shady to me.\n “And I just love all those pet names he has for you.”\n Stephan gave her his most charming smile. “I’ll call you Chickee, too, if you like.”\n She giggled. She was always like this when pilots were around, just way sweeter than she acted if they weren’t present. “I think that’s adorable. But my favorite is Buttercup. I heard you call her that the other day.”\n He gave me a soft smile that was all for me. “That one is only for Bee.”\n She clapped her hands together. “Oh, oh, oh, is there a story behind that pet name? I love stories!”\n My nose crinkled. She was laying it on a little thick today. I shot a glance at the two pilots who were watching our interaction from the front row of seats in the huge van. I was guessing that she liked one of them, from the affected way she was acting.\n The First Officer was younger and better looking than the Captain. Jeff, I recalled his name. He had dark brown hair, and attractive brown eyes. He was tall, with a rangy build. But my bet was she liked the Captain, since he made twice Jeff’s salary.\n The Captain, whose name I was ninety percent sure was Peter, was older, with balding gray hair, a beer gut, and eyes that never strayed north of a woman’s chest.\n She reaffirmed my guess almost as I thought it, sending the captain a positively beaming smile. “Don’t you just love stories, too, Peter?” she asked him.\n He gave her what I thought was a slightly greasy smile. “You betcha.”\n Stephan shook his head. “That story is between me and Bee. But, Peter, I’m dying to know what song you’ll choose to serenade us with tonight.” Stephan changed the subject easily, and with much charm. He had Peter laughingly refusing to sing and steering the conversation in the direction he chose with no effort whatsoever.\n CHAPTER FOUR\n Mr. Beautiful\n I awoke to the sound of my alarm with even less enthusiasm than usual. I had tossed and turned for four hours. I’d been trying to catch enough sleep to make it through until at least eight p.m. I had failed. I would be dead on my feet by late afternoon, I guessed. I was in a positively sour mood as I stalked into my hotel room’s bathroom.\n “We working out?” Stephan called out to me from his room as I came back out.\n Our rooms adjoined, as they usually did when we were in this hotel. We came here often, and knew the front desk staff well enough to arrange our rooms how we preferred. We just kept the door between our rooms open. We’d been roommates for years, and only recently become neighbors instead, so it was a relaxed, effortless arrangement. We both found comfort in the other’s presence.\n My only response was a mannerless grunt. He laughed. “The times when you don’t want to the most, are the times that you definitely should,” he told me.\n I made a raspberry noise at him, and he laughed harder.\n A moment later he came into my room, already in his gym clothes and carrying a cup of coffee from my favorite cafe on the corner. The sight cheered me instantly.\n He smiled at me, wiggling his brows. “Will this change your mind? Large mocha with soy, no whip, and an extra shot of espresso.” He named off my order, though he hadn’t needed to. I’d known as soon as I saw the cup that he’d know just what I’d want.\n I grinned. “You’re the best.”\n “It’s a fact,” he agreed.\n We worked out for an hour. The hotel’s gym was tiny and unimpressive, with one treadmill, one elliptical, one stationary bike, and some free weights. I stuck to the elliptical for the full hour, but Stephan flitted around from the bike, to the treadmill, and spent a half an hour lifting weights. It was his usual routine, and I watched him, feeling good as I listened to music on my phone and worked out.\n Stephan had been right. I had been so tempted to skip a workout today, but it had ended up being just what I needed. I felt worlds better when we finished up.\n We grabbed a quick sandwich for lunch. It was a beautiful late spring day in New York City, and I enjoyed our walk along the bustling street. “Wanna eat in the park?” I asked Stephan as we waited in line at a crowded local deli. \n","sourceLink":"https://allnovel.net/in-flight-up-in-the-air-1/page-4.html","bookId":1926,"book":{"id":1926,"title":"In Flight (Up in the Air #1)","description":"Storyline: \n In Flight (Up in the Air #1) \n When reserved flight attendant Bianca gets one look at billionaire hotel owner James Cavendish, she loses all of her hard-won composure. For a girl who can easily juggle a tray of champagne flutes at 35,000 feet in three inch heels, she finds herself shockingly weak-kneed from their first encounter. The normally unruffled Bianca can\u0027t seem to look away from his electrifying turquoise gaze. They hold a challenge, and a promise, that she finds impossible to resist, and she is a girl who is used to saying no and meaning it. \n Bianca is accustomed to dealing with supermodels and movie stars in her job as a first class flight attendant, but James Cavendish puts them all to shame in the looks department. If only it were just his looks that she found so irresistible about the intimidating man, Bianca could have ignored his attentions. But what tempts her like never before is the dominant pull he seems to have over her from the moment they meet, and the promise of pleasure, and pain, that she reads in his eyes.\n \n","cover":"https://allnovel.net/images/in-flight-up-in-the-air-1.jpg","author":"R.K. Lilley","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/in-flight-up-in-the-air-1.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:52:24 AM"}}
