{"id":11350,"no":16,"title":"CHAPTER XVI. WAR","content":"Who, when they slash and cut to pieces, Do so with civilest addresses. There is no power so subtle and so strong as that of association. We have learnt to associate mustard with beef, and therefore mustard shall be eaten with beef until the day when the lion shall lie down with the lamb. Miss Millicent Chyne became aware, as the year advanced towards the sere and yellow leaf, that in opposing her wayward will in single combat against a simple little association in the public mind she was undertaking a somewhat herculean task. Society—itself an association—is the slave of a word, and society had acquired the habit of coupling the names of Sir John Meredith and Lady Cantourne. They belonged to the same generation; they had similar tastes; they were both of some considerable power in the world of leisured pleasure; and, lastly, they amused each other. The result is not far to seek. Wherever the one was invited, the other was considered to be in demand; and Millicent found herself face to face with a huge difficulty. Sir John was distinctly in the way. He had a keener eye than the majority of young men, and occasionally exercised the old man\u0027s privilege of saying outright things which, despite theory, are better left unsaid. Moreover, the situation was ill-defined, and an ill-defined situation does not improve in the keeping. Sir John said sharp things—too sharp even for Millicent—and, in addition to the original grudge begotten of his quarrel with Jack and its result, the girl nourished an ever-present feeling of resentment at a persistency in misunderstanding her of which she shrewdly suspected the existence. Perhaps the worst of it was that Sir John never said anything which could be construed into direct disapproval. He merely indicated, in passing, the possession of a keen eyesight coupled with the embarrassing faculty of adding together correctly two small numerals. When, therefore, Millicent allowed herself to be assisted from the carriage at the door of a large midland country house by an eager and lively little French baron of her acquaintance, she was disgusted but not surprised to see a well-known figure leaning gracefully on a billiard-cue in the hall. “I wish I could think that this pleasure was mutual,” said Sir John with his courtliest smile, as he bowed over Millicent\u0027s hand. “It might be,” with a coquettish glance. “If—?” “If I were not afraid of you.” Sir John turned, smiling, to greet Lady Cantourne. He did not appear to have heard, but in reality the remark had made a distinct impression on him. It signalised a new departure—the attack at a fresh quarter. Millicent had tried most methods—and she possessed many—hitherto in vain. She had attempted to coax him with a filial playfulness of demeanour, to dazzle him by a brilliancy which had that effect upon the majority of men in her train, to win him by respectful affection; but the result had been failure. She was now bringing her last reserve up to the front; and there are few things more dangerous, even to an old campaigner, than a confession of fear from the lips of a pretty girl. Sir John Meredith gave himself a little jerk—a throw back of the shoulders which was habitual—which might have been a tribute either to Millicent behind, or to Lady Cantourne in front. The pleasantest part of existence in a large country house full of visitors is the facility with which one may avoid those among the guests for whom one has no sympathy. Millicent managed very well to avoid Sir John Meredith. The baron was her slave—at least he said so—and she easily kept him at her beck and call during the first evening. It would seem that that strange hollow energy of old age had laid its hand upon Sir John Meredith, for he was the first to appear in the breakfast-room the next morning. He went straight to the sideboard where the letters and newspapers lay in an orderly heap. It is a question whether he had not come down early on purpose to look for a letter. Perhaps he could not stay in his bed with the knowledge that the postman had called. He was possibly afraid to ask his old servant to go down and fetch his letters. His bent and knotted hands fumbled among the correspondence, and suddenly his twitching lips were still. A strange stillness indeed overcame his whole face, turning it to stone. The letter was there; it had come, but it was not addressed to him. Sir John Meredith took up the missive; he looked at the back, turned it, and examined the handwriting of his own son. There was a whole volume—filled with pride, and love, and unquenchable resolve—written on his face. He threw the letter down among its fellows, and his hand went fumbling weakly at his lips. He gazed, blinking his lashless lids, at the heap of letters, and the corner of another envelope presently arrested his attention. It was of the same paper, of the same shape and hue, as that addressed to Miss Chyne. Sir John drew a deep breath, and reached out his hand. The letter had come at last. At last, thank God! And how weakly ready he was to grasp at the olive branch held out to him across a continent! He took the letter; he made a step with it towards the door, seeking solitude; then, as an afterthought, he looked at the superscription. It was addressed to the same person, Miss Chyne, but in a different handwriting—the handwriting of a man well educated but little used to wielding the pen. “The other,” mumbled Sir John. “The other man, by God!” And, with a smile that sat singularly on his withered face, he took up a newspaper and went towards the fireplace, where he sat stiffly in an armchair, taking an enormous interest in the morning\u0027s news. He read a single piece of news three times over, and a fourth time in a whisper, so as to rivet his attention upon it. He would not admit that he was worsted—would not humble his pride even before the ornaments on the mantelpiece. Before Millicent came down, looking very fresh and pretty in her tweed dress, the butler had sorted the letters. There were only two upon her plate—the twin envelopes addressed by different hands. Sir John was talking with a certain laboured lightness to Lady Cantourne, when that lady\u0027s niece came into the room. He was watching keenly. There was a certain amount of interest in the question of those two envelopes, as to which she would open first. She looked at each in turn, glanced furtively towards Sir John, made a suitable reply to some remark addressed to her by the baron, and tore open Jack\u0027s envelope. There was a gravity—a concentrated gravity—about her lips as she unfolded the thin paper; and Sir John, who knew the world and the little all-important trifles thereof, gave an impatient sigh. It is the little trifle that betrays the man, and not the larger issues of life in which we usually follow precedent. It was that passing gravity (of the lips only) that told Sir John more about Millicent Chyne than she herself knew, and what he had learnt did not seem to be to his liking. There is nothing so disquieting as the unknown motive, which disquietude was Sir John\u0027s soon after breakfast. The other men dispersed to put on gaiters and cartridge-bags, and the old aristocrat took his newspaper on to the terrace. Millicent followed him almost at once. “Sir John,” she said, “I have had a letter from Africa.” Did she take it for granted that he knew this already? Was this spontaneous? Had Jack told her to do it? These questions flashed through the old man\u0027s mind as his eyes rested on her pretty face. He was beginning to be afraid of this girl: which showed his wisdom. For the maiden beautiful is a stronger power in the world than the strong man. The proof of which is that she gets her own way more often than the strong man gets his. “From Africa?” repeated Sir John Meredith, with a twitching lip. “And from whom is your letter, my dear young lady?” His face was quite still, his old eyes steady, as he waited for the answer. “From Jack.” Sir John winced inwardly. Outwardly he smiled and folded his newspaper upon his knees. “Ah, from my brilliant son. That is interesting.” “Have you had one?” she asked, in prompt payment of his sarcasm. Sir John Meredith looked up with a queer little smile. He admired the girl\u0027s spirit. It was the smile of the fencer on touching worthy steel. “No, my dear young lady, I have not. Mr. John Meredith does not find time to write to me—but he draws his allowance from the bank with a filial regularity.” Millicent had the letter in her hand. She made it crinkle in her fingers within a foot of the old gentleman\u0027s face. A faint odour of the scent she used reached his nostrils. He drew back a little, as if he disliked it. His feeling for her almost amounted to a repugnance. “I thought you might like to hear that he is well,” she said gently. She was reading the address on the envelope, and again he saw that look of concentrated gravity which made him feel uneasy for reasons of his own. “It is very kind of you to throw me even that crumb from your richly-stored intellectual table. I am very glad to hear that he is well. A whole long letter from him must be a treat indeed.” She thought of a proverb relating to the grapes that are out of reach, but said nothing. It was the fashion that year to wear little flyaway jackets with a coquettish pocket on each side. Millicent was wearing one of them, and she now became aware that Sir John had glanced more than once with a certain significance towards her left hand, which happened to be in that pocket. It, moreover, happened that Guy Oscard\u0027s letter was in the same receptacle. She withdrew the hand and changed colour slightly as she became conscious that the corner of the envelope was protruding. “I suppose that by this time,” said Sir John pleasantly, “you are quite an authority upon African matters?” His manner was so extremely conversational and innocent that she did not think it necessary to look for an inner meaning. She was relieved to find that the two men, having actually met, spoke of each other frankly. It was evident that Guy Oscard could be trusted to keep his promise, and Jack Meredith was not the man to force or repose a confidence. “He does not tell me much about Africa,” she replied, determined to hold her ground. She was engaged to be married to Jack Meredith, and whether Sir John chose to ignore the fact or not she did not mean to admit that the subject should be tabooed. “No—I suppose he has plenty to tell you about himself and his prospects?” “Yes, he has. His prospects are not so hopeless as you think.” “My dear Miss Chyne,” protested Sir John, “I know nothing about his prospects beyond the fact that, when I am removed from this sphere of activity, he will come into possession of my title, such as it is, and my means, such as they are.” “Then you attach no importance to the work he is inaugurating in Africa?” “Not the least. I did not even know that he was endeavouring to work. I only trust it is not manual labour—it is so injurious to the finger-nails. I have no sympathy with a gentleman who imagines that manual labour is compatible with his position, provided that he does not put his hand to the plough in England. Is not there something in the Scriptures about a man putting his hand to the plough and looking back? If Jack undertakes any work of that description, I trust that he will recognise the fact that he forfeits his position by doing so.” “It is not manual labour—I can assure you of that.” “I am glad to hear it. He probably sells printed cottons to the natives, or exchanges wrought metal for ivory—an intellectual craft. But he is gaining experience, and I suppose he thinks he is going to make a fortune.” It happened that this was precisely the thought expressed by Jack Meredith in the letter in Millicent\u0027s hand. “He is sanguine,” she admitted. “Of course. Quite right. Pray do not discourage him—if you find time to write. But between you and me, my dear Miss Chyne, fortunes are not made in Africa. I am an old man, and I have some experience of the world. That part of it which is called Africa is not the place where fortunes are made. It is as different from India as chalk is from cheese, if you will permit so vulgar a simile.” Millicent\u0027s face dropped. “But SOME people have made fortunes there.” “Yes—in slaves! But that interesting commerce is at an end. However, so long as my son does not suffer in health, I suppose we must be thankful that he is creditably employed.” He rose as he spoke. “I see,” he went on, “your amiable friend the baron approaching with lawn-tennis necessaries. It is wonderful that our neighbours never learn to keep their enthusiasm for lawn-tennis in bounds until the afternoon.” With that he left her, and the baron came to the conclusion, before very long, that something had “contraried” the charming Miss Chyne. The truth was that Millicent was bitterly disappointed. The idea of failure had never entered her head since Jack\u0027s letters, full of life and energy, had begun to arrive. Sir John Meredith was a man whose words commanded respect—partly because he was an old man whose powers of perception had as yet apparently retained their full force, and the vast experience of life which was his could hardly be overrated. Man\u0027s prime is that period when the widest experience and the keenest perception meet. Millicent Chyne had lulled herself into a false security. She had taken it for granted that Jack would succeed, and would return rich and prosperous within a few months. Upon this pleasant certainty Sir John had cast a doubt, and she could hardly treat his words with contempt. She had almost forgotten Guy Oscard\u0027s letter. Across a hemisphere Jack Meredith was a stronger influence in her life than Oscard. While she sat on the terrace and flirted with the baron she reflected hurriedly over the situation. She was, she argued to herself, not in any way engaged to Guy Oscard. If he in an unguarded moment should dare to mention such a possibility to Jack, it would be quite easy to contradict the statement with convincing heat. But in her heart she was sure of Guy Oscard. One of the worst traits in the character of an unfaithful woman is the readiness with which she trades upon the faithfulness of men.","sourceLink":"http://novel.tingroom.com/duanpian/2775/76805.html","bookId":1327,"book":{"id":1327,"title":"With Edged Tools","description":"简介： Which with pain purchased doth inherit pain.My dearMadamwhat you call heart does not come into the question at all.Sir John Meredith was sitting slightly behind Lady Cantourne, leaning towards her with a somewhat stiffened replica of his former grac...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2775","creation":"Aug 1, 2019 12:24:51 AM","modification":"Aug 1, 2019 12:24:51 AM"}}
