{"id":11359,"no":25,"title":"CHAPTER XXV. TO THE RESCUE","content":"I must mix myself with action lest I wither by despair. Jocelyn had not conveyed to her brother by word or hint the accusation brought against him by Victor Durnovo. But when he returned home it almost seemed as if he were conscious of the knowledge that was hers. She thought she detected a subtle difference in his manner towards herself—something apologetic and humble. This was really the result of Victor Durnovo\u0027s threat made in the office of the factory long before. Maurice Gordon was not the sort of man to carry through the burden of a half-discovered secret. It needs a special temperament for this—one that is able to inspire fear in whomsoever it may be necessary to hold in check—a temperament with sufficient self-reliance and strength to play an open game steadily through to the end. Since Durnovo\u0027s plain-spoken threat had been uttered Gordon had thought of little else, and it was well known that Jocelyn\u0027s influence was all that prevented him from taking hopelessly to drink. When away from her at the sub-factories it is to be feared that he gave way to the temptation. There is nothing so wearing as a constant suspense, a never-resting fear; and if a man knows that both may be relieved by a slight over-indulgence he must be a strong man indeed if he can turn aside. Gordon betrayed himself to Jocelyn in a thousand little ways. He consulted her wishes, deferred to her opinion, and sought her advice in a way which never had been his hitherto; and while both were conscious of this difference, both were alike afraid of seeking to explain it. Jocelyn knew that her repulse of Victor Durnovo was only a temporary advantage; the position could not remain long undecided. Victor Durnovo would have to be met sooner or later. Each day increased the strength of her conviction that her brother was in the power of this man. Whether he had really allowed himself to be dragged into the horrors of even a slight connection with the slave-trade she could not tell; but she knew the world well enough to recognise the fact that Durnovo had only to make the accusation for it to be believed by the million sensation-mongers who are always on the alert for some new horror. She knew that should Durnovo breathe a word of this in the right quarter—that is to say, into the eager journalistic ear—there would hardly be a civilised country in the world where Maurice Gordon of Loango could dwell under his own name. She felt that they were all living on a slumbering volcano. It was one of those rare cases where human life seems no longer sacred; and this refined, educated, gentle English lady found herself face to face with the fact that Victor Durnovo\u0027s life would be cheap at the price of her own. At this moment Providence, with the wisdom of which we sometimes catch a glimpse, laid another trouble upon her shoulders. While she was half distracted with the thought of her brother\u0027s danger, the news was put into her hand by the grinning Nala that Jack Meredith—the man she openly in her own heart loved—was in an even greater strait. Here, at all events, was a peril that could be met, however heavy might be the odds. Her own danger, the horror of Maurice\u0027s crime, the hatred for Victor Durnovo, were all swallowed up in the sudden call to help Jack Meredith. And Jocelyn found at least a saving excitement in working night and day for the rescue of the man who was to be Millicent Chyne\u0027s husband. Maurice aided her loyally. His influence with the natives was great; his knowledge of the country second only to Durnovo\u0027s. During the fortnight that elapsed between the despatch of the telegram to Guy Oscard and the arrival of that resourceful individual at Loango, the whole coast was astir with preparation and excitement. Thus it came about that Guy Oscard found a little army awaiting him, and to Maurice Gordon was the credit given. Victor Durnovo simply kept out of the way. The news that an expedition was being got together to go to the relief of Jack Meredith never reached him in his retreat. But after a fortnight spent in idleness in the neighbouring interior, he could stand the suspense no longer, and came down into the town, to be pounced upon at once by Guy Oscard. As he stood on the beach near to Oscard, watching the embarkation of the men, his feelings were decidedly mixed. There was an immense relief from the anxiety of the last few weeks. He had stood on the verge of many crimes, and had been forcibly dragged back therefrom by the strong arm of Guy Oscard. It had been Victor Durnovo\u0027s intention not only to abandon Jack Meredith to his certain fate, but to appropriate to his own use the consignment of Simiacine, valued at sixty thousand pounds, which he had brought down to the coast. The end of it all was, of course, the possession of Jocelyn Gordon. The programme was simple; but, racked as he was by anxiety, weakened by incipient disease, and paralysed by chronic fear, the difficulties were too great to be overcome. To be a thorough villain one must possess, first of all, good health; secondly, untiring energy; and thirdly, a certain enthusiasm for wrong-doing for its own sake. Criminals of the first standard have always loved crime. Victor Durnovo was not like that. He only made use of crime, and had no desire to cultivate it for its own sake. To be forcibly dragged back, therefore, into the paths of virtue was in some ways a great relief. The presence of Guy Oscard, also, was in itself a comfort. Durnovo felt that no responsibility attached itself to him; he had entire faith in Oscard, and had only to obey. Durnovo was not a person who suffered from too delicate a susceptibility. The shame of his present position did not affect him deeply. Indeed, he was one of those men who have no sense of shame before certain persons; and Guy Oscard was one of those. The position was not in itself one to be proud of, but the half-breed accepted it with wonderful equanimity, and presently he began to assist in the embarkation. It was nearly dark when the little coast steamer secured by Maurice Gordon for the service turned her prow northward and steamed away. “The truth is,” Durnovo took an early opportunity of saying to Oscard, “that my nerve is no longer up to this work. I should not care to undertake this business alone, despite my reputation on the coast. It is a wonderful thing how closely the nerves are allied to the state of one\u0027s health.” “Wonderful!” acquiesced Guy Oscard, with a lack of irony which only made the irony keener. “I\u0027ve been too long in this d——d country,” exclaimed Durnovo, “that\u0027s the fact. I\u0027m not the man I was.” Guy Oscard smoked for some moments in silence; then he took his pipe from his lips. “The only pity is,” he said judicially, “that you ever undertook to look for the Simiacine if you were going to funk it when the first difficulty arose.” Without further comment he walked away, and entered into conversation with the captain of the steamer. “All right,” muttered Durnovo between his teeth—“all right, my sarcastic grand gentleman. I\u0027ll be even with you yet.” The strange part of it was that Guy Oscard never attempted to degrade Durnovo from his post of joint commander. This puzzled the half-breed sorely. It may have been that Oscard knew men better than his indifferent manner would have led the observer to believe. Durnovo\u0027s was just one of those natures which in good hands might have been turned to good account. Too much solitude, too much dealing with negro peoples, and, chiefly, too long a sojourn in the demoralising atmosphere of West Africa, had made a worse man of Victor Durnovo than Nature originally intended. He was not wholly bad. Badness is, after all, a matter of comparison, and, in order to draw correctly such a comparison, every allowance must be made for a difference in standard. Victor Durnovo\u0027s standard was not a high one; that was all. And in continuing to treat him as an equal, and trust him as such, Guy Oscard only showed that he was a cleverer man than the world took him to be. In due time Msala was reached. As the canoes suitable for up-river traffic were by no means sufficient to transport the whole of the expeditionary force in one journey, a division was made. Durnovo took charge of the advance column, journeying up to the camp from which the long march through the forest was to begin, and sending back the canoes for Oscard and the remainder of the force. With these canoes he sent back word that the hostile tribes were within a few days\u0027 march, and that he was fortifying his camp. This news seemed to furnish Guy Oscard with food for considerable thought, and after some space of time he called Marie. She came, and, standing before him with her patient dignity of mien, awaited his communications. She never took her eyes off the letter in his hand. Oscard noticed the persistency of her gaze at the time, and remembered it again afterwards. “Marie,” he said, “I have had rather serious news from Mr. Durnovo.” “Yes?” rather breathlessly. “It will not be safe for you to stay at Msala—you must take the children down to Loango.” “Does he say that?” she asked, in her rapid, indistinct English. “Who?” “Vic—Mr. Durnovo.” “No,” replied Oscard, wondering at the question. “He does not say anything about me or the children?” persisted Marie. “No.” “And yet he says there is danger?” There was a strange, angry look in her great dark eyes which Oscard did not understand. “He says that the tribes are within two days\u0027 march of his camp.” She gave an unpleasant little laugh. “He does not seem to have thought of us at Msala.” “I suppose,” said Oscard, folding the letter and putting it in his pocket, “that he thinks it is my duty to do what is best for Msala. That is why I asked you to speak to me.” Mario did not seem to be listening. She was looking over his head up the river, in the direction from whence the message had come, and there was a singular hopelessness in her eyes. “I cannot leave until he tells me to,” she said doggedly. Guy Oscard took the pipe from his lips and examined the bowl of it attentively for a moment. “Excuse me,” he said gently, “but I insist on your leaving with the children to-morrow. I will send two men down with you, and will give you a letter to Miss Gordon, who will see to your wants at Loango.” She looked at him with a sort of wonder. “You insist?” she said. He raised his eyes to meet hers. “Yes,” he answered. She bowed her head in grave submission, and made a little movement as if to go. “It is chiefly on account of the children,” he added. Quite suddenly she smiled, and seemed to check a sob in her throat. “Yes,” said she softly, “I know.” And she went into the house. The next morning brought further rumours of approaching danger, and it seemed certain that this news must have filtered through Durnovo\u0027s fortified camp further up the river. This time the report was more definite. There were Arabs leading the tribes, and rumour further stated that an organised descent on Msala was intended. And yet there was no word from Durnovo—no sign to suggest that he had even thought of securing the safety of his housekeeper and the few aged negroes in charge of Msala. This news only strengthened Oscard\u0027s determination to send Marie down to the coast, and he personally superintended their departure before taking his seat in the canoe for the up-river voyage. The men of his division had all preceded him, and no one except his own boatmen knew that Msala was to be abandoned. There was in Guy Oscard a dogged sense of justice which sometimes amounted to a cruel mercilessness. When he reached the camp he deliberately withheld from Durnovo the news that the Msala household had left the river station. Moreover, he allowed Victor Durnovo to further inculpate himself. He led him on to discuss the position of affairs, and the half-breed displayed an intimate knowledge of the enemy\u0027s doings. There was only one inference to be drawn, namely, that Victor Durnovo had abandoned his people at Msala with the same deliberation which had characterised his cowardly faithlessness to Jack Meredith. Guy Oscard was a slow thinking man, although quick in action. He pieced all these things together. The pieces did not seem to fit just then—the construction was decidedly chaotic in its architecture. But later on the corner-stone of knowledge propped up the edifice, and everything slipped into its place. Despite disquieting rumours, the expedition was allowed to depart from the river-camp unmolested. For two days they marched through the gloomy forest with all speed. On the third day one of the men of Durnovo\u0027s division captured a native who had been prowling on their heels in the line of march. Victor Durnovo sent captor and prisoner to the front of the column, with a message to Oscard that he would come presently and see what information was to be abstracted from the captive. At the midday halt Durnovo accordingly joined Oscard, and the man was brought before them. He was hardly worthy of the name, so disease-stricken, so miserable and half-starved was he. At first Durnovo and he did not seem to be able to get to an understanding at all; but presently they hit upon a dialect in which they possessed a small common knowledge. His news was not reassuring. In dealing with numbers he rarely condescended to the use of less than four figures, and his conception of a distance was very vague. “Ask him,” said Oscard, “whether he knows that there is an Englishman with a large force on the top of a mountain far to the east.” Durnovo translated, and the man answered with a smile. In reply to some further question the negro launched into a detailed narrative, to which Durnovo listened eagerly. “He says,” said the latter to Oscard, “that the Plateau is in possession of the Masais. It was taken two months ago. The blacks were sold as slaves; the two Englishmen were tortured to death and their bodies burnt.” Oscard never moved a muscle. “Ask him if he is quite sure about it.” “Quite,” replied Durnovo, after questioning. “By God! Oscard; what a pity! But I always knew it. I knew it was quite hopeless from the first.” He passed his brown hand nervously over his face, where the perspiration stood in beads. “Yes,” said Oscard slowly; “but I think we will go on all the same.” “What!” cried Durnovo. “Go on?” “Yes,” replied Guy Oscard; “we will go on, and if I find you trying to desert I\u0027ll shoot you down like a rat.”","sourceLink":"http://novel.tingroom.com/duanpian/2775/76814.html","bookId":1327,"book":{"id":1327,"title":"With Edged Tools","description":"简介： Which with pain purchased doth inherit pain.My dearMadamwhat you call heart does not come into the question at all.Sir John Meredith was sitting slightly behind Lady Cantourne, leaning towards her with a somewhat stiffened replica of his former grac...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2775","creation":"Aug 1, 2019 12:24:51 AM","modification":"Aug 1, 2019 12:24:51 AM"}}
