{"id":11378,"no":44,"title":"CHAPTER XLIV. MADE UP","content":"My faith is large in Time, And that which shapes it to some perfect end. “MY DEAR JACK,—At the risk of being considered an interfering old woman, I write to ask you whether you are not soon coming to England again. As you are aware, your father and I knew each other as children. We have known each other ever since—we are now almost the only survivors of our generation. My reason for troubling you with this communication is that during the last six months I have noticed a very painful change in your father. He is getting very old—he has no one but servants about him. You know his manner—it is difficult for any one to approach him, even for me. If you could come home—by accident—I think that you will never regret it in after life. I need not suggest discretion as to this letter. Your affectionate friend, “CAROLINE CANTOURNE.” Jack Meredith read this letter in the coffee-room of the Hotel of the Four Seasons at Wiesbaden. It was a lovely morning—the sun shone down through the trees of the Friedrichstrasse upon that spotless pavement, of which the stricken wot; the fresh breeze came bowling down from the Taunus mountains all balsamic and invigorating—it picked up the odours of the Seringa and flowering currant in the Kurgarten, and threw itself in at the open window of the coffee-room of the Hotel of the Four Seasons. Jack Meredith was restless. Such odours as are borne on the morning breeze are apt to make those men restless who have not all that they want. And is not their name legion? The morning breeze is to the strong the moonlight of the sentimental. That which makes one vaguely yearn incites the other to get up and take. By the train leaving Wiesbaden for Cologne, “over Mainz,” as the guide-book hath it, Jack Meredith left for England, in which country he had not set foot for fifteen months. Guy Oscard was in Cashmere; the Simiacine was almost forgotten as a nine days\u0027 wonder except by those who live by the ills of mankind. Millicent Chyne had degenerated into a restless society “hack.” With great skill she had posed as a martyr. She had allowed it to be understood that she, having remained faithful to Jack Meredith through his time of adversity, had been heartlessly thrown over when fortune smiled upon him and there was a chance of his making a more brilliant match. With a chivalry which was not without a keen shaft of irony, father and son allowed this story to pass uncontradicted. Perhaps a few believed it; perhaps they had foreseen the future. It may have been that they knew that Millicent Chyne, surrounded by the halo of whatever story she might invent, would be treated with a certain careless nonchalance by the older men, with a respectful avoidance by the younger. Truly women have the deepest punishment for their sins here on earth; for sooner or later the time will come—after the brilliancy of the first triumph, after the less pure satisfaction of the skilled siren—the time will come when all that they want is an enduring, honest love. And it is written that an enduring love cannot, with the best will in the world, be bestowed on an unworthy object. If a woman wishes to be loved purely she must have a pure heart, and NO PAST, ready for the reception of that love. This is a sine qua non. The woman with a past has no future. The short March day was closing in over London with that murky suggestion of hopelessness affected by metropolitan eventide when Jack Meredith presented himself at the door of his father\u0027s house. In his reception by the servants there was a subtle suggestion of expectation which was not lost on his keen mind. There is no patience like that of expectation in an old heart. Jack Meredith felt vaguely that he had been expected thus, daily for many months past. He was shown into the library, and the tall form standing there on the hearthrug had not the outline for which he had looked. The battle between old age and a stubborn will is long. But old age wins. It never raises the siege. It starves the garrison out. Sir John Meredith\u0027s head seemed to have shrunk. The wig did not fit at the back. His clothes, always bearing the suggestion of emptiness, seemed to hang on ancient-given lines as if the creases were well established. The clothes were old. The fateful doctrine of not-worth-while had set in. Father and son shook hands, and Sir John walked feebly to the stiff-backed chair, where he sat down in shamefaced silence. He was ashamed of his infirmities. His was the instinct of the dog that goes away into some hidden corner to die. “I am glad to see you,” he said, using his two hands to push himself further back in his chair. There was a little pause. The fire was getting low. It fell together with a feeble, crumbling sound. “Shall I put some coals on?” asked Jack. A simple question—if you will. But it was asked by the son in such a tone of quiet, filial submission, that a whole volume could not contain all that it said to the old man\u0027s proud, unbending heart. “Yes, my boy, do.” And the last six years were wiped away like evil writing from a slate. There was no explanation. These two men were not of those who explain themselves, and in the warmth of explanation say things which they do not fully mean. The opinions that each had held during the years they had left behind had perhaps been modified on both sides, but neither sought details of the modification. They knew each other now, and each respected the indomitable will of the other. They inquired after each other\u0027s health. They spoke of events of a common interest. Trifles of everyday occurrence seemed to contain absorbing details. But it is the everyday occurrence that makes the life. It was the putting on of the coals that reconciled these two men. “Let me see,” said John, “you gave up your rooms before you left England, did you not?” “Yes.” Jack drew forward his chair and put his feet out towards the fire. It was marvellous how thoroughly at home he seemed to be. “Then,” continued Sir John, “where is your luggage?” “I left it at the club.” “Send along for it. Your room is—er, quite ready for you. I shall be glad if you will make use of it as long as you like. You will be free to come and go as if you were in your own house.” Jack nodded with a strange, twisted little smile, as if he were suffering from cramp in the legs. It was cramp—at the heart. “Thanks,” he said, “I should like nothing better. Shall I ring?” “If you please.” Jack rang, and they waited in the fading daylight without speaking. At times Sir John moved his limbs, his hand on the arm of the chair and his feet on the hearth-rug, with the jerky, half-restless energy of the aged which is not pleasant to see. When the servant came, it was Jack who gave the orders, and the butler listened to them with a sort of enthusiasm. When he had closed the door behind him he pulled down his waistcoat with a jerk, and as he walked downstairs he muttered “Thank \u0027eaven!” twice, and wiped away a tear from his bibulous eye. “What have you been doing with yourself since I saw you?” inquired Sir John conversationally when the door was closed. “I have been out to India—merely for the voyage. I went with Oscard, who is out there still, after big-game.” Sir John Meredith nodded. “I like that man,” he said, “he is tough. I like tough men. He wrote me a letter before he went away. It was the letter of—one gentleman to another. Is he going to spend the rest of his life \u0027after big-game\u0027?” Jack laughed. “It seems rather like it. He is cut out for that sort of life. He is too big for narrow streets and cramped houses.” “And matrimony?” “Yes—and matrimony.” Sir John was leaning forward in his chair, his two withered hands clasped on his knees. “You know,” he said slowly, blinking at the fire, “he cared for that girl—more than you did, my boy.” “Yes,” answered Jack softly. Sir John looked towards him, but he said nothing. His attitude was interrogatory. There were a thousand questions in the turn of his head, questions which one gentleman could not ask another. Jack met his gaze. They were still wonderfully alike, these two men, though one was in his prime while the other was infirm. On each face there was the stamp of a long-drawn, silent pride; each was a type of those haughty conquerors who stepped, mail-clad, on our shore eight hundred years ago. Form and feature, mind and heart, had been handed down from father to son, as great types are. “One may have the right feeling and bestow it by mistake on the wrong person,” said Jack. Sir John\u0027s fingers were at his lips. “Yes,” he said rather indistinctly, “while the right person is waiting for it.” Jack looked up sharply, as if he either had not heard or did not understand. “While the right person is waiting for it,” repeated Sir John deliberately. “The right person—?” “Jocelyn Gordon,” exclaimed Sir John, “is the right person.” Jack shrugged his shoulders and leant back so that the firelight did not shine upon his face. “So I found out eighteen months ago,” he said, “when it was too late.” “There is no such thing as too late for that,” said Sir John in his great wisdom. “Even if you were both quite old it would not be too late. I have known it for longer than you. I found it out two years ago.” Jack looked across the room into the keen, worldly-wise old face. “How?” he inquired. “From her. I found it out the moment she mentioned your name. I conducted the conversation in such a manner that she had frequently to say it, and whenever your name crossed her lips she—gave herself away.” Jack shook his head with an incredulous smile. “Moreover,” continued Sir John, “I maintain that it is not too late.” There followed a silence; both men seemed to be wrapped in thought, the same thoughts with a difference of forty years of life in the method of thinking them. “I could not go to her with a lame story like that,” said Jack. “I told her all about Millicent.” “It is just a lame story like that that women understand,” answered Sir John. “When I was younger I thought as you do. I thought that a man must needs bring a clean slate to the woman he asks to be his wife. It is only his hands that must be clean. Women see deeper into these mistakes of ours than we do; they see the good of them where we only see the wound to our vanity. Sometimes one would almost be inclined to think that they prefer a few mistakes in the past because it makes the present surer. Their romance is a different thing from ours—it is a better thing, deeper and less selfish. They can wipe the slate clean and never look at it again. And the best of them—rather like the task.” Jack made no reply. Sir John Meredith\u0027s chin was resting on his vast necktie. He was looking with failing eyes into the fire. He spoke like one who was sure of himself—confident in his slowly accumulated store of that knowledge which is not written in books. “Will you oblige me?” he asked. Jack moved in his chair, but he made no answer. Sir John did not indeed expect it. He knew his son too well. “Will you,” he continued, “go out to Africa and take your lame story to Jocelyn just as it is?” There was a long silence. The old worn-out clock on the mantelpiece wheezed and struck six. “Yes,” answered Jack at length, “I will go.” Sir John nodded his head with a sigh of relief. All, indeed, comes to him who waits. “I have seen a good deal of life,” he said suddenly, arousing himself and sitting upright in the stiff-backed chair, “here and there in the world; and I have found that the happiest people are those who began by thinking that it was too late. The romance of youth is only fit to write about in books. It is too delicate a fabric for everyday use. It soon wears out or gets torn.” Jack did not seem to be listening. “But,” continued Sir John, “you must not waste time. If I may suggest it, you will do well to go at once.” “Yes,” answered Jack, “I will go in a month or so. I should like to see you in a better state of health before I leave you.” Sir John pulled himself together. He threw back his shoulders and stiffened his neck. “My health is excellent,” he replied sturdily. “Of course I am beginning to feel my years a little, but one must expect to do that after—eh—er—sixty. C\u0027est la vie.” He made a little movement of the hands. “No,” he went on, “the sooner you go the better.” “I do not like leaving you,” persisted Jack. Sir John laughed rather testily. “That is rather absurd,” he said; “I am accustomed to being left. I have always lived alone. You will do me a favour if you will go now and take your passage out to Africa.” “Now—this evening?” “Yes—at once. These offices close about half-past six, I believe. You will just have time to do it before dinner.” Jack rose and went towards the door. He went slowly, almost reluctantly. “Do not trouble about me,” said Sir John, “I am accustomed to being left.” He repeated it when the door had closed behind his son. The fire was low again. It was almost dying. The daylight was fading every moment. The cinders fell together with a crumbling sound, and a greyness crept into their glowing depths. The old man sitting there made no attempt to add fresh fuel. “I am accustomed,” he said, with a half-cynical smile, “to being left.” \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2775/76833.html","bookId":1327,"book":{"id":1327,"title":"With Edged Tools","description":"简介： Which with pain purchased doth inherit pain.My dearMadamwhat you call heart does not come into the question at all.Sir John Meredith was sitting slightly behind Lady Cantourne, leaning towards her with a somewhat stiffened replica of his former grac...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2775","creation":"Aug 1, 2019 12:24:51 AM","modification":"Aug 1, 2019 12:24:51 AM"}}
