{"id":11342,"no":8,"title":"CHAPTER VIII. A RECRUIT","content":"Said the Engine from the East, “They who work best talk the least.” It is not, of course, for a poor limited masculine mind to utter heresies regarding the great question of woman\u0027s rights. But as things stand at present, as, in fact, the forenamed rights are to-day situated, women have not found comprehension of the dual life. The dual life is led solely by men, and until women have found out its full compass and meaning, they can never lead in the world. There is the public life and the private; and the men who are most successful in the former are the most exclusive in the latter. Women have only learned to lead one life; they must be all public or all private, there is no medium. Those who give up the private life for which Providence destined them, to assume the public existence to which their own conceit urges them, have their own reward. They taste all the bitterness of fame and never know its sweets, because the bitterness is public and the sweets are private. Women cannot understand that part of a man\u0027s life which brings him into daily contact with men whom he does not bring home to dinner. One woman does not know another without bringing her in to meals and showing her her new hat. It is merely a matter of custom. Men are in the habit of associating in daily, almost hourly, intercourse with others who are never really their friends and are always held at a distance. It is useless attempting to explain it, for we are merely reprimanded for unfriendliness, stiffness, and stupid pride. Soit! Let it go. Some of us, perhaps, know our own business best. And there are, thank Heaven! amidst a multitude of female doctors, female professors, female wranglers, a few female women left. Jack Meredith knew quite well what he was about when he listened with a favourable ear to Durnovo\u0027s scheme. He knew that this man was not a gentleman, but his own position was so assured that he could afford to associate with any one. Here, again, men are safer. A woman is too delicate a social flower to be independent of environments. She takes the tone of her surroundings. It is, one notices, only the ladies who protest that the barmaid married in haste and repented of at leisure can raise herself to her husband\u0027s level. The husband\u0027s friends keep silence, and perhaps, like the mariner\u0027s bird, they meditate all the more. What Meredith proposed to do was to enter into a partnership with Victor Durnovo, and when the purpose of it was accomplished, to let each man go his way. Such partnerships are entered into every day. Men have carried through a brilliant campaign—a world-affecting scheme—side by side, working with one mind and one heart; and when the result has been attained they drop out of each other\u0027s lives for ever. They are created so, for a very good purpose, no doubt. But sometimes Providence steps in and turns the little point of contact into the leaven that leaveneth the whole lump. Providence, it seems—or let us call it Fate—was hovering over that lone African river, where two men, sitting in the stern of a native canoe, took it upon themselves to prearrange their lives. A month later Victor Durnovo was in London. He left behind him in Africa Jack Meredith, whose capacities for organisation were developing very quickly. There was plenty of work for each to do. In Africa Meredith had undertaken to get together men and boats, while Durnovo went home to Europe for a threefold purpose. Firstly, a visit to Europe was absolutely necessary for his health, shattered as it was by too long a sojourn in the fever-ridden river beds of the West Coast. Secondly, there were rifles, ammunition, and stores to be purchased and packed in suitable cases. And, lastly, he was to find and enlist the third man, “the soldierly fellow full of fight,” who knew the natives and the country. This, indeed, was his first care on reaching London, and before his eyes and brain were accustomed to the roar of the street life he took a cab to Russell Square, giving the number affixed to the door of a gloomy house in the least frequented corner of the stately quadrangle. “Is Mr. Guy Oscard at home?” he inquired of the grave man-servant. “He is, sir,” replied the butler, stepping aside. Victor Durnovo thought that a momentary hesitation on the part of the butler was caused by a very natural and proper feeling of admiration for the new clothes and hat which he had purchased out of the money advanced by Jack Meredith for the outfit of the expedition. In reality the man was waiting for the visitor to throw away his cigar before crossing the threshold. But he waited in vain, and Durnovo stood, cigar in mouth, in the dining-room until Guy Oscard came to him. At first Oscard did not recognise him, and conveyed this fact by a distant bow and an expectant silence. “You do not seem to recognise me,” said Durnovo with a laugh, which lasted until the servant had closed the door. “Victor Durnovo!” “Oh—yes—how are you?” Oscard came forward and shook hands. His manner was not exactly effusive. The truth was that their acquaintanceship in Africa had been of the slightest, dating from some trivial services which Durnovo had been able and very eager to render to the sportsman. “I\u0027m all right, thanks,” replied Durnovo. “I only landed at Liverpool yesterday. I\u0027m home on business. I\u0027m buying rifles and stores.” Guy Oscard\u0027s honest face lighted up at once—the curse of Ishmael was on him in its full force. He was destined to be a wanderer on God\u0027s earth, and all things appertaining to the wild life of the forests were music in his ears. Durnovo was no mean diplomatist. He had learnt to know man, within a white or coloured skin. The effect of his words was patent to him. “You remember the Simiacine?” he said abruptly. “Yes.” “I\u0027ve found it.” “The devil you have! Sit down.” Durnovo took the chair indicated. “Yes, sir,” he said, “I\u0027ve got it. I\u0027ve laid my hand on it at last. I\u0027ve always been on its track. That has been my little game all the time. I did not tell you when we met out there, because I was afraid I should never find it, and because I wanted to keep quiet about it.” Guy Oscard was looking out of the window across to the dull houses and chimneys that formed his horizon, and in his eyes there was the longing for a vaster horizon, a larger life. “I have got a partner,” continued Durnovo, “a good man—Jack Meredith, son of Sir John Meredith. You have, perhaps, met him.” “No,” answered Oscard; “but I have heard his name, and I have met Sir John—the father—once or twice.” “He is out there,” went on Durnovo, “getting things together quietly. I have come home to buy rifles, ammunition, and stores.” He paused, watching the eager, simple face. “We want to know,” he said quietly, “if you will organise and lead the fighting men.” Guy Oscard drew a deep breath. There are some Englishmen left, thank Heaven! who love fighting for its own sake, and not only for the gain of it. Such men as this lived in the old days of chivalry, at which modern puny carpet-knights make bold to laugh, while inwardly thanking their stars that they live in the peaceful age of the policeman. Such men as this ran their thick simple heads against many a windmill, couched lance over many a far-fetched insult, and swung a sword in honour of many a worthless maid; but they made England, my masters. Let us remember that they made England. “Then there is to be fighting?” “Yes,” said Durnovo, “there will be fighting. We must fight our way there, and we must hold it when we get there. But so far as the world is concerned, we are only a private expedition exploring the source of the Ogowe.” “The Ogowe?” and again Guy Oscard\u0027s eyes lighted up. “Yes, I do not mind telling you that much. To begin with, I trust you; secondly, no one could get there without me to lead the way.” Guy Oscard looked at him with some admiration, and that sympathy which exists between the sons of Ishmael. Durnovo looked quite fit for the task he set himself. He had regained his strength on the voyage, and with returning muscular force his moral tone was higher, his influence over men greater. Amidst the pallid sons of the pavement among whom Guy Oscard had moved of late, this African traveller was a man apart—a being much more after his own heart. The brown of the man\u0027s face and hands appealed to him—the dark flashing eyes, the energetic carriage of head and shoulders. Among men of a fairer skin the taint that was in Victor Durnovo\u0027s blood became more apparent—the shadow on his finger-nails, the deep olive of his neck against the snowy collar, and the blue tint in the white of his eyes. But none of these things militated against him in Oscard\u0027s mind. They only made him fitter for the work he had undertaken. “How long will it take?” asked Guy. Durnovo tugged at his strange, curtain-like moustache. His mouth was hidden; it was quite impossible to divine his thoughts. “Three months to get there,” he answered at length. “One month to pick the leaf, and then you can bring the first crop down to the coast and home, while Meredith and I stay on at the plateau.” “I could be home again in eight months?” “Certainly! We thought that you might work the sale of the stuff in London, and in a couple of years or so, when the thing is in swing, Meredith will come home. We can safely leave the cultivation in native hands when once we have established ourselves up there, and made ourselves respected among the tribes.” A significance in his tone made Guy Oscard look up inquiringly. “How?” “You know my way with the natives,” answered Durnovo with a cruel smile. “It is the only way. There are no laws in Central Africa except the laws of necessity.” Oscard was nothing if not outspoken. “I do not like your way with the natives,” he said, with a pleasant smile. “That is because you do not know them. But in this affair you are to be the leader of the fighting column. You will, of course, have carte blanche.” Oscard nodded. “I suppose,” he said, after a pause, “that there is the question of money?” “Yes; Meredith and I have talked that over. The plan we fixed upon was that you and he each put a thousand pounds into it; I put five hundred. For the first two years we share the profits equally. After that we must come to some fresh arrangement, should you or Meredith wish to give up an active part in the affair. I presume you would not object to coming up at the end of a year, with a handy squad of men to bring down the crop under escort?” “No,” replied Oscard, after a moment\u0027s reflection. “I should probably be able to do that.” “I reckon,” continued the other, “that the journey down could be accomplished in two months, and each time you do the trip you will reduce your time.” “Yes.” “Of course,” Durnovo went on, with the details which he knew were music in Oscard\u0027s ears, “of course we shall be a clumsy party going up. We shall have heavy loads of provisions, ammunition, and seeds for cultivating the land up there.” “Yes,” replied Guy Oscard absently. In his ears there rang already the steady plash of the paddle, the weird melancholy song of the boatmen, the music of the wind amidst the forest trees. Durnovo rose briskly. “Then,” he said, “you will join us? I may telegraph out to Meredith that you will join us?” “Yes,” replied Oscard simply. “You may do that.” “There is no time to be lost,” Durnovo went on. “Every moment wasted adds to the risk of our being superseded. I sail for Loango in a fortnight; will you come with me?” “Yes.” “Shall I take a passage for you?” “Yes.” Durnovo held out his hand. “Good-bye,” he said. “Shall I always find you here when I want you?” “Yes—stay, though! I shall be going away for a few days. Come to-morrow to luncheon, and we will settle the preliminaries.” “Right—one o\u0027clock?” “One o\u0027clock.” When Durnovo had gone Guy sat down and wrote to Lady Cantourne accepting her invitation to spend a few days at Cantourne Place, on the Solent. He explained that his visit would be in the nature of a farewell, as he was about to leave for Africa for a little big-game hunting.","sourceLink":"http://novel.tingroom.com/duanpian/2775/76797.html","bookId":1327,"book":{"id":1327,"title":"With Edged Tools","description":"简介： Which with pain purchased doth inherit pain.My dearMadamwhat you call heart does not come into the question at all.Sir John Meredith was sitting slightly behind Lady Cantourne, leaning towards her with a somewhat stiffened replica of his former grac...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2775","creation":"Aug 1, 2019 12:24:51 AM","modification":"Aug 1, 2019 12:24:51 AM"}}
