{"id":33236,"no":29,"title":"II THE FIRST DIRIGIBLES","content":"Having got off the earth, the very early balloonists set about the task of finding a means of navigating the air, but, lacking steam or other accessory power to human muscle, they failed to solve the problem. Joseph Mongolfier speedily exploded the idea of propelling a balloon either by means of oars or sails, pointing out that even in a dead calm a speed of five miles an hour would be the limit achieved. Still, sailing balloons were constructed, even up to the time of Andree, the explorer, who proposed to retard the speed of the balloon by ropes dragging on the ground, and then to spread a sail which should catch the wind and permit of deviation of the course. It has been proved that slight divergences from the course of the wind can be obtained by this means, but no real navigation of the air could be thus accomplished. \n \n Professor Wellner, of Brunn, brought up the idea of a sailing balloon in more practical fashion in 1883. He observed that surfaces inclined to the horizontal have a slight lateral motion in rising and falling, and deduced that by alternate lowering and raising of such surfaces he would be able to navigate the air, regulating ascent and descent by increasing or decreasing the temperature of his buoyant medium in the balloon. He calculated that a balloon, 50 feet in diameter and 150332 feet in length, with a vertical surface in front and a horizontal surface behind, might be navigated at a speed of ten miles per hour, and in actual tests at Brunn he proved that a single rise and fall moved the balloon three miles against the wind. His ideas were further developed by Lebaudy in the construction of the early French dirigibles. \n \n According to Hildebrandt,11 the first sailing balloon was built in 1784 by Guyot, who made his balloon egg-shaped, with the smaller end at the back and the longer axis horizontal; oars were intended to propel the craft, and naturally it was a failure. Carra proposed the use of paddle wheels, a step in the right direction, by mounting them on the sides of the car, but the improvement was only slight. Guyton de Morveau, entrusted by the Academy of Dijon with the building of a sailing balloon, first used a vertical rudder at the rear end of his construction—it survives in the modern dirigible. His construction included sails and oars, but, lacking steam or other than human propulsive power, the airship was a failure equally with Guyot’s. \n \n Two priests, Miollan and Janinet, proposed to drive balloons through the air by the forcible expulsion of the hot air in the envelope from the rear of the balloon. An opening was made about half-way up the envelope, through which the hot air was to escape, buoyancy being maintained by a pan of combustibles in the car. Unfortunately, this development of the Mongolfier type never got a trial, for those who were to be spectators of the first flight grew exasperated at successive delays, and in the end, thinking that the balloon would never rise, they destroyed it. \n \n 333 Meusnier, a French general, first conceived the idea of compensating for loss of gas by carrying an air bag inside the balloon, in order to maintain the full expansion of the envelope. The brothers Robert constructed the first balloon in which this was tried, and placed the air bag near the neck of the balloon, which was intended to be driven by oars, and steered by a rudder. A violent swirl of wind which was encountered on the first ascent tore away the oars and rudder and broke the ropes which held the air bag in position; the bag fell into the opening of the neck and stopped it up, preventing the escape of gas under expansion. The Duc de Chartres, who was aboard, realised the extreme danger of the envelope bursting as the balloon ascended, and at 16,000 feet he thrust a staff through the envelope—another account says that he slit it with his sword—and thus prevented disaster. The descent after this rip in the fabric was swift, but the passengers got off without injury in the landing. \n \n Meusnier, experimenting in various ways, experimented with regard to the resistance offered by various shapes to the air, and found that an elliptical shape was best; he proposed to make the car boat-shaped, in order further to decrease the resistance, and he advocated an entirely rigid connection between the car and the body of the balloon, as indispensable to a dirigible.12 He suggested using three propellers, which were to be driven by hand by means of pulleys, and calculated that a crew of eighty would be required to furnish sufficient motive power. Horizontal fins were to be used to assure stability, and Meusnier thoroughly334 investigated the pressures exerted by gases, in order to ascertain the stresses to which the envelope would be subjected. More important still, he went into detail with regard to the use of air bags, in order to retain the shape of the balloon under varying pressures of gas due to expansion and consequent losses; he proposed two separate envelopes, the inner one containing gas, and the space between it and the outer one being filled with air. Further, by compressing the air inside the air bag, the rate of ascent or descent could be regulated. Lebaudy, acting on this principle, found it possible to pump air at the rate of 35 cubic feet per second, thus making good loss of ballast which had to be thrown overboard. \n \n Meusnier’s balloon, of course, was never constructed, but his ideas have been of value to aerostation up to the present time. His career ended in the revolutionary army in 1793, when he was killed in the fighting before Mayence, and the King of Prussia ordered all firing to cease until Meusnier had been buried. No other genius came forward to carry on his work, and it was realised that human muscle could not drive a balloon with certainty through the air; experiment in this direction was abandoned for nearly sixty years, until in 1852 Giffard brought the first practicable power-driven dirigible to being. \n \n Giffard, inventor of the steam injector, had already made balloon ascents when he turned to aeronautical propulsion, and constructed a steam engine of 5 horse-power with a weight of only 100 lbs.—a great achievement for his day. Having got his engine, he set about making the balloon which it was to drive; this he built with the aid of two other enthusiasts, diverging from335 Meusnier’s ideas by making the ends pointed, and keeping the body narrowed from Meusnier’s ellipse to a shape more resembling a rather fat cigar. The length was 144 feet, and the greatest diameter only 40 feet, while the capacity was 88,000 cubic feet. A net which covered the envelope of the balloon supported a spar, 66 feet in length, at the end of which a triangular sail was placed vertically to act as rudder. The car, slung 20 feet below the spar, carried the engine and propeller. Engine and boiler together weighed 350 lbs., and drove the 11 foot propeller at 110 revolutions per minute. \n \n As precaution against explosion, Giffard arranged wire gauze in front of the stoke-hole of his boiler, and provided an exhaust pipe which discharged the waste gases from the engine in a downward direction. With this first dirigible he attained to a speed of between 6 and 8 feet per second, thus proving that the propulsion of a balloon was a possibility, now that steam had come to supplement human effort. \n \n Three years later he built a second dirigible, reducing the diameter and increasing the length of the gas envelope, with a view to reducing air resistance. The length of this was 230 feet, the diameter only 33 feet, and the capacity was 113,000 cubic feet, while the upper part of the envelope, to which the covering net was attached, was specially covered to ensure a stiffening effect. The car of this dirigible was dropped rather lower than that of the first machine, in order to provide more thoroughly against the danger of explosions. Giffard, with a companion named Yon as passenger, took a trial trip on this vessel, and made a journey against the wind, though slowly. In commencing to descend, the nose of the envelope tilted upwards, and the weight336 of the car and its contents caused the net to slip, so that just before the dirigible reached the ground, the envelope burst. Both Giffard and his companion escaped with very slight injuries. \n \n Plans were immediately made for the construction of a third dirigible, which was to be 1,970 feet in length, 98 feet in extreme diameter, and to have a capacity of 7,800,000 cubic feet of gas. The engine of this giant was to have weighed 30 tons, and with it Giffard expected to attain a speed of 40 miles per hour. Cost prevented the scheme being carried out, and Giffard went on designing small steam engines until his invention of the steam injector gave him the funds to turn to dirigibles again. He built a captive balloon for the great exhibition in London in 1868, at a cost of nearly ￡30,000, and designed a dirigible balloon which was to have held a million and three-quarters cubic feet of gas, carry two boilers, and cost about ￡40,000. The plans were thoroughly worked out, down to the last detail, but the dirigible was never constructed. Giffard went blind, and died in 1882—he stands as the great pioneer of dirigible construction, more on the strength of the two vessels which he actually built than on that of the ambitious later conceptions of his brain. \n \n In 1872 Dupuy de Lome, commissioned by the French government, built a dirigible which he proposed to drive by man-power—it was anticipated that the vessel would be of use in the siege of Paris, but it was not actually tested till after the conclusion of the war. The length of this vessel was 118 feet, its greatest diameter 49 feet, the ends being pointed, and the motive power was by a propeller which was revolved by the efforts of eight men. The vessel attained to337 about the same speed as Giffard’s steam-driven airship; it was capable of carrying fourteen men, who, apart from these engaged in driving the propeller, had to manipulate the pumps which controlled the air bags inside the gas envelope. \n \n In the same year Paul Haenlein, working in Vienna, produced an airship which was a direct forerunner of the Lebaudy type, 164 feet in length, 30 feet greatest diameter, and with a cubic capacity of 85,000 feet. Semi-rigidity was attained by placing the car as close to the envelope as possible, suspending it by crossed ropes, and the motive power was a gas engine of the Lenoir type, having four horizontal cylinders, and giving about 5 horse-power with a consumption of about 250 cubic feet of gas per hour. This gas was sucked from the envelope of the balloon, which was kept fully inflated by pumping in compensating air to the air bags inside the main envelope. A propeller, 15 feet in diameter, was driven by the Lenoir engine at 40 revolutions per minute. This was the first instance of the use of an internal combustion engine in connection with aeronautical experiments. \n \n The envelope of this dirigible was rendered airtight by means of internal rubber coating, with a thinner film on the outside. Coal gas, used for inflation, formed a suitable fuel for the engine, but limited the height to which the dirigible could ascend. Such trials as were made were carried out with the dirigible held captive, and a speed of 15 feet per second was attained. Full experiment was prevented through funds running low, but Haenlein’s work constituted a distinct advance on all that had been done previously. \n \n Two brothers, Albert and Gaston Tissandier, were338 next to enter the field of dirigible construction; they had experimented with balloons during the Franco-Prussian War, and had attempted to get into Paris by balloon during the siege, but it was not until 1882 that they produced their dirigible. \n \n This was 92 feet in length and 32 feet in greatest diameter, with a cubic capacity of 37,500 feet, and the fabric used was varnished cambric. The car was made of bamboo rods, and in addition to its crew of three, it carried a Siemens dynamo, with 24 bichromate cells, each of which weighed 17 lbs. The motor gave out 1? horse-power, which was sufficient to drive the vessel at a speed of up to 10 feet per second. This was not so good as Haenlein’s previous attempt and, after ￡2,000 had been spent, the Tissandiers abandoned their experiments, since a 5-mile breeze was sufficient to nullify the power of the motor. \n \n Renard, a French officer who had studied the problem of dirigible construction since 1878, associated himself first with a brother officer named La Haye, and subsequently with another officer, Krebs, in the construction of the second dirigible to be electrically-propelled. La Haye first approached Colonel Laussedat, in charge of the Engineers of the French Army, with a view to obtaining funds, but was refused, in consequence of the practical failure of all experiments since 1870. Renard, with whom Krebs had now associated himself, thereupon went to Gambetta, and succeeded in getting a promise of a grant of ￡8,000 for the work; with this promise Renard and Krebs set to work. \n \n They built their airship in torpedo shape, 165 feet in length, and of just over 27 feet greatest diameter—the greatest diameter was at the front, and the cubic339 capacity was 66,000 feet. The car itself was 108 feet in length, and 4? feet broad, covered with silk over the bamboo framework. The 23 foot diameter propeller was of wood, and was driven by an electric motor connected to an accumulator, and yielding 8.5 horse-power. The sweep of the propeller, which might have brought it in contact with the ground in landing, was counteracted by rendering it possible to raise the axis on which the blades were mounted, and a guide rope was used to obviate damage altogether, in case of rapid descent. There was also a ‘sliding weight’ which was movable to any required position to shift the centre of gravity as desired. Altogether, with passengers and ballast aboard, the craft weighed two tons. \n \n In the afternoon of August 9th, 1884, Renard and Krebs ascended in the dirigible—which they had named ‘La France,’ from the military ballooning ground at Chalais-Meudon, making a circular flight of about five miles, the latter part of which was in the face of a slight wind. They found that the vessel answered well to her rudder, and the five-mile flight was made successfully in a period of 23 minutes. Subsequent experimental flights determined that the air speed of the dirigible was no less than 14? miles per hour, by far the best that had so far been accomplished in dirigible flight. Seven flights in all were made, and of these five were completely successful, the dirigible returning to its starting point with no difficulty. On the other two flights it had to be towed back. \n \n Renard attempted to repeat his construction on a larger scale, but funds would not permit, and the type was abandoned; the motive power was not sufficient to permit of more than short flights, and even to the340 present time electric motors, with their necessary accumulators, are far too cumbrous to compete with the self-contained internal combustion engine. France had to wait for the Lebaudy brothers, just as Germany had to wait for Zeppelin and Parseval. \n \n Two German experimenters, Baumgarten and Wolfert, fitted a Daimler motor to a dirigible balloon which made its first ascent at Leipzig in 1880. This vessel had three cars, and placing a passenger in one of the outer cars13 distributed the load unevenly, so that the whole vessel tilted over and crashed to the earth, the occupants luckily escaping without injury. After Baumgarten’s death, Wolfert determined to carry on with his experiments, and, having achieved a certain measure of success, he announced an ascent to take place on the Tempelhofer Field, near Berlin, on June 12th, 1897. The vessel, travelling with the wind, reached a height of 600 feet, when the exhaust of the motor communicated flame to the envelope of the balloon, and Wolfert, together with a passenger he carried, was either killed by the fall or burnt to death on the ground. Giffard had taken special precautions to avoid an accident of this nature, and Wolfert, failing to observe equal care, paid the full penalty. \n \n Platz, a German soldier, attempting an ascent on the Tempelhofer Field in the Schwartz airship in 1897, merely proved the dirigible a failure. The vessel was of aluminium, 0.008 inch in thickness, strengthened by an aluminium lattice work; the motor was two-cylindered petrol-driven; at the first trial the metal developed such leaks that the vessel came to the ground within four miles of its starting point. Platz, who was aboard341 alone as crew, succeeded in escaping by jumping clear before the car touched earth, but the shock of alighting broke up the balloon, and a following high wind completed the work of full destruction. A second account says that Platz, finding the propellers insufficient to drive the vessel against the wind, opened the valve and descended too rapidly. \n \n The envelope of this dirigible was 156 feet in length, and the method of filling was that of pushing in bags, fill them with gas, and then pulling them to pieces and tearing them out of the body of the balloon. A second contemplated method of filling was by placing a linen envelope inside the aluminium casing, blowing it out with air, and then admitting the gas between the linen and the aluminium outer casing. This would compress the air out of the linen envelope, which was to be withdrawn when the aluminium casing had been completely filled with gas. \n \n All this, however, assumes that the Schwartz type—the first rigid dirigible, by the way—would prove successful. As it proved a failure on the first trial, the problem of filling it did not arise again. \n \n By this time Zeppelin, retired from the German army, had begun to devote himself to the study of dirigible construction, and, a year after Schwartz had made his experiment and had failed, he got together sufficient funds for the formation of a limited liability company, and started on the construction of the first of his series of airships. The age of tentative experiment was over, and, forerunner of the success of the heavier-than-air type of flying machine, successful dirigible flight was accomplished by Zeppelin in Germany, and by Santos-Dumont in France. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2712/74574.html","bookId":412,"book":{"id":412,"title":"A History of Aeronautics","description":"简介： Although successful heavier-than-air flight is less than two decades old, and successful dirigible propulsion antedates it by a very short period, the mass of experiment and accomplishment renders any one-volume history of the subject a matter of sel...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2712","creation":"Aug 1, 2019 12:18:44 AM","modification":"Aug 1, 2019 12:18:44 AM"}}
