{"id":26249,"no":10,"title":"Chapter 11 The Two Things","content":"THE TWO THINGS AT THE VERY TOP OF MY THINGS-I-NEVER-WANT-TO-DO LIST \n \n Sam started moving the others into formation while i was still on the ground. Embry and Quil were at mysides, waiting for me to recover and take the point. \n \n 　　I could feel the drive, the need, to get on my feet and lead them. The compulsion grew, and I fought ituselessly, cringing on the ground where I was. \n \n 　　Embry whined quietly in my ear. He didn\u0027t want to think the words, afraid that he would bring me toSam\u0027s attention again. I felt his wordless plea for me to get up, for me to get this over with and be donewith it. \n \n 　　There was fear in the pack, not so much for self but for the whole. We couldn\u0027t imagine that we wouldall make it out alive tonight. Which brothers would we lose? Which minds would leave us forever? Whichgrieving families would we be consoling in the morning? \n \n 　　My mind began to work with theirs, to think in unison, as we dealt with these fears. Automatically, Ipushed up from the ground and shook out my coat. \n \n 　　Embry and Quil huffed in relief. Quil touched his nose to my side once. \n \n 　　Their minds were filled with our challenge, our assignment. We remembered together the nights we\u0027dwatched the Cullens practicing for the fight with the newborns. Emmett Cullen was strongest, but Jasperwould be the bigger problem. He moved like a lightning strike—power and speed and death rolled intoone. How many centuries\u0027 experience did he have? Enough that all the other Cullens looked to him forguidance. \n \n 　　/\u0027// take point, if you want flank, Quil offered. There was more excitement in his mind than most of theothers. When Quil had watched Jasper\u0027s instruction those nights, he\u0027d been dying to test his skill againstthe vampire\u0027s. For him, this would be a contest. Even knowing it was his life on the line, he saw it thatway. Paul was like that, too, and the kids who had never been in battle, Collin and Brady. Seth probablywould\u0027ve been the same—if the opponents were not his friends. \n \n 　　Jake?Quil nudged me. How do you want to roll? \n \n 　　I just shook my head, t couldn\u0027t concentrate—the compulsion to follow orders felt like puppet stringshooked intoall of my muscles. One foot forward, now another. \n \n 　　Seth was dragging behind Collin and Brady—Leah had assumed point there. She ignored Seth whileplanning with the others, and I could see that she\u0027d rather leave him out of the fight.There was a maternaledge to her feelings for her younger brother. She wished Sam would send him home. Seth didn\u0027t registerLeah\u0027s doubts. He was adjusting to the puppet strings, too. \n \n 　　Maybe if you stopped resisting...,Embry whispered. \n \n 　　Just focus on our part. The big ones. We can take them down. We own them!Quil was working himselfup—like a pep talk before a big game. \n \n 　　I could see how easy it would be—to think about nothing more than my part. It wasn\u0027t hard to imagingattacking Jasper and Emmett. We\u0027d been close to that before. I\u0027d thought of them as enemies for a verylong time. I could do that now again. \n \n 　　I just had to forget that they were protecting the same thing I would protect. I had to forget the reasonwhy I might want them to win.... \n \n 　　Jake,Embry warned. Keep your head in the game. \n \n 　　My feet moved sluggishly, pulling against the drag of the strings. \n \n 　　There\u0027s no point fighting it,Embry whispered again. \n \n 　　He was right. I would end up doing what Sam wanted, if he was willing to push it. And he was. \n \n 　　Obviously. \n \n 　　There was a good reason for the Alpha\u0027s authority. Even a pack as strong as ours wasn\u0027t much of aforce without a leader. We had to move together, to think together, in order to be effective. And thatrequired the body to have a head. \n \n 　　So what if Sam was wrong now? There was nothing anyone could do. No one could dispute hisdecision. \n \n 　　Except. \n \n 　　And there it was—a thought I\u0027d never, never wanted to have. But now, with my legs all tied up in strings,I recognized the exception with relief—more than relief, with a fierce joy. \n \n 　　No one could dispute the Alpha\u0027s decision—except for me. \n \n 　　I hadn\u0027t earned anything. But there were things that had been born in me, things that I\u0027d left unclaimed. \n \n 　　I\u0027d never wanted to lead the pack. I didn\u0027t want to do it now. I didn\u0027t want the responsibility for all ourfates resting on my shoulders. Sam was better at that than I would ever be. \n \n 　　But he was wrong tonight. \n \n 　　And I had not been born to kneel to him. \n \n 　　The bonds fell off my body the second that I embraced my birthright. \n \n 　　I could feel it gathering in me, both a freedomand also a strange, hollow power.Hollow because anAlpha\u0027s power came from his pack, and I had no pack. For a second, loneliness overwhelmed me. \n \n 　　I had no pack now. \n \n 　　But I was straight and strong as I walked to where Sam stood, planning with Paul and Jared. He turnedat the sound of my advance, and his black eyes narrowed. \n \n 　　A/o, I told him again. \n \n 　　He heard it right away, heard the choice that I\u0027d made in the sound of the Alpha voice in my thoughts. \n \n 　　He jumped back a half step with a shocked yelp. \n \n 　　Jacob? What have you done? \n \n 　　I won\u0027t follow you, Sam. Not for something so wrong. \n \n 　　He stared at me, stunned. You would... you would choose your enemies over your family? \n \n 　　They aren\u0027t—I shook my head, clearing it— they aren\u0027t our enemies. They never have been. Until Ireally thought about destroying them, thought it through, I didn\u0027t see that. \n \n 　　This isn\u0027t about them,he snarled at me. This is about Bella. She has never been the one for you, shehas never chosen you, but you continue to destroy your life for her! \n \n 　　They were hard words, but true words. I sucked in a big gulp of air, breathing them in. \n \n 　　Maybe you\u0027re right. But you\u0027re going to destroy the pack over her, Sam. No matter how many of themsurvive tonight, they will always have murder on their hands. \n \n 　　We have to protect our families! \n \n 　　I know what you\u0027ve decided, Sam. But you don\u0027t decide for me, not anymore. \n \n 　　Jacob— you can\u0027t turn your back on the tribe. \n \n 　　I heard the double echo of his Alpha command, but it was weightless this time. It no longer applied tome. He clenched his jaw, trying to force me to respond to his words. \n \n 　　I stared into his furious eyes. Ephraim Black\u0027s son was not born to follow Levi Uley\u0027s. \n \n 　　Is this it, then, JacobBlack? His hackles rose and his muzzle pulled back from his teeth. Paul and Jaredsnarled and bristled at his sides. Even if you can defeat me, the pack will never follow you! \n \n 　　Now /jerked back, a surprised whine escaping my throat. \n \n 　　Defeat you? I\u0027m not going to fight you, Sam. \n \n 　　Then what\u0027s your plan? I\u0027m not stepping aside so that you can protect the vampire spawn at the tribe\u0027sexpense. \n \n 　　I\u0027m not telling you to step aside. \n \n 　　If you order them to follow you—/\u0027// never take anyone\u0027s will away from him. \n \n 　　His tail whipped back and forth as he recoiled from the judgment in my words. Then he took a stepforward so that we were toe to toe, his exposed teeth inches from mine. I hadn\u0027t noticed till this momentthat I\u0027d grown taller than him. \n \n 　　There cannot be more than one Alpha. The pack has chosen me. Will you rip us apart tonight? Will youturn on yourbrothers? Or will you end this insanity and join us again?Every word was layered with command, but itcouldn\u0027t touch me. Alpha blood ran undiluted in my veins. \n \n 　　Icould see why there was never more than one Alpha male in a pack. My body was responding to thechallenge. I could feel the instinct to defend my claim rising in me. The primitive core of my wolf-selftensed for the battle of supremacy. \n \n 　　I focusedall my energy to control that reaction. I would not fall into a pointless, destructive fight withSam. He was my brother still, even though I was rejecting him. \n \n 　　There is only one Alpha for this pack. I\u0027m not contesting that I\u0027m just choosing to go my own way. \n \n 　　Do you belong to acoven now, Jacob? \n \n 　　I flinched. \n \n 　　/ don\u0027t know, Sam. But I do know this—He shrunk back as he felt the weight of the Alpha in my tone. It affected him more than his touched me. \n \n 　　Because I had been born to lead him. \n \n 　　/ will stand between you and the Cullens. I won\u0027t just watch while the pack kills innocent—it washard to apply that word to vampires, but it was true— people. The pack is better than that. Leadthem in the right direction, Sam. \n \n 　　I turned my back on him, and a chorus of howls tore into the air around me. \n \n 　　Digging my nails into the earth, I raced away from the uproar I\u0027d caused. I didn\u0027t have much time. Atleast Leah was the only one with a prayer of outrunning me, and I had a head start. \n \n 　　The howling faded with the distance, and I took comfort as the sound continued to rip apart the quietnight. They weren\u0027t after me yet. \n \n 　　I had to warn the Cullens before the pack could get it together and stop me. If the Cullens wereprepared,it might give Sam a reason to rethink this before it was too late. I sprinted toward the whitehouse Istill hated, leaving my home behindme. Home didn\u0027t belong to me anymore. I\u0027d turned my backon it. \n \n 　　Today had begun like any other day. Made it home from patrol with the rainy sunrise, breakfast withBilly and Rachel, bad TV, bickering withPaul... How did it change so completely, turn all surreal? Howdid everything get messed up and twisted so that I was here now, all alone, an unwilling Alpha, cut offfrom my brothers, choosing vampires over them? \n \n 　　The sound I\u0027d been fearing interrupted my dazed thoughts—it was the soft impact of big paws againstthe ground, chasing after me. I threw myself forward, rocketing through the black forest. I just had to getclose enough so that Edward could hear the warning in my head. Leah wouldn\u0027t be able to stop mealone. \n \n 　　And then I caught the mood of the thoughts behind me. Not anger, but enthusiasm. Not chasing... butfollowing. \n \n 　　My stride broke. I staggered two steps before it evened out again. \n \n 　　Wait up. My legs aren\u0027t as long as yours. \n \n 　　SETH! What do you think you\u0027re DOING? GO HOME! \n \n 　　He didn\u0027t answer, but I could feel his excitement as he kept right on after me. I could see through hiseyes as hecould see through mine. The night scene was bleak for me—fullof despair. For him, it was hopeful. \n \n 　　I hadn\u0027t realized I was slowing down, but suddenly he was on my flank, running in position beside me. \n \n 　　/ am not joking, Seth! This is no place for you. Get out of here. \n \n 　　The gangly tan wolf snorted. I\u0027ve got your back, Jacob. I think you\u0027re right. And I\u0027m not going tostand behind Sam when—Oh yes you are the hell going to stand behind Sam! Get your furry butt back to La Push and do whatSam tells you to do. \n \n 　　No. \n \n 　　Go, Seth! \n \n 　　Is that anorder. Jacob? \n \n 　　His question brought me up short. I skidded to a halt, my nails gouging furrows in the mud. \n \n 　　I\u0027m not ordering anyone to do anything. I\u0027m just telling you what you already know. \n \n 　　He plopped down on his haunches beside me. /\u0027// tell you what I know —I know that it\u0027s awful quiet. \n \n 　　Haven\u0027t you noticed? \n \n 　　I blinked. My tail swished nervously as I realized what he was thinking underneath the words. It wasn\u0027tquiet in one sense. Howls still filled the air, far away in the west. \n \n 　　They haven\u0027t phased back,Seth said. \n \n 　　I knew that. The pack would be on red alert now. They would be using the mind link to see all sidesclearly. But I couldn\u0027t hear what they were thinking. I could only hear Seth. No one else. \n \n 　　Looks to me like separate packs aren\u0027t linked. Huh. Guess there was no reason for our fathers to knowthat before. \u0027Cause there was no reason for separate packs before. Never enough wolves for two. Wow. \n \n 　　It\u0027sreally quiet. Sort of eerie. But also kinda nice, don\u0027t you think? I bet it was easier, like this, forEphraim and Quil and Levi. Not such a babble with just three. Or just two. \n \n 　　Shut up, Seth. \n \n 　　Yes, sir. \n \n 　　Stop that! There are not two packs. There is THE pack, and then there is me. That\u0027s all. So you can gohome now. \n \n 　　If there aren\u0027t two packs, then why can we hear each other and not the rest? I think that when youturned your back on Sam, that was a pretty significant move. A change. And when I followed you away,I think that was significant, too. \n \n 　　You\u0027ve got a point,I conceded. But what can change can change right back. \n \n 　　He got up and started trotting toward the east. No time to argue about it now. We should be movingright along before Sam... \n \n 　　He was right about that part. There was no time for this argument. Ifell into a run again, not pushingmyself quite as hard. Seth stayed on my heels, holding the Second\u0027s traditional place on my right flank. \n \n 　　/ can run somewhere else, he thought, his nose dipping a little. / didn\u0027t follow you because I was aftera promotion. \n \n 　　Run wherever you want. Makes no difference to me. \n \n 　　There was no sound of pursuit, but we both stepped it up a little at the same time. I was worried now. IfI couldn\u0027t tap into the pack\u0027s mind, it was going to make this more difficult. I\u0027d have no more advancewarning of attack than the Cullens. \n \n 　　We\u0027ll run patrols,Seth suggested. \n \n 　　And what do we do if the pack challenges us?My eyes tightened. Attack our brothers? Your sister? \n \n 　　No— we sound the alarm and fall back. \n \n 　　Good answer. But then what? I don\u0027t think... \n \n 　　I know,he agreed. Less confident now. / don\u0027t think I can fight them, either. But they won\u0027t be anyhappier with the idea of attacking us than we are with attacking them. That might be enough tostop them right there. Pius, there\u0027re only eight of them now. \n \n 　　Stop being so...Took me a minute to decide on the right word. Optimistic. It\u0027s getting on my nerves. \n \n 　　No problem. You want me to be all doom and gloom, or just shut up? \n \n 　　Just shut up. \n \n 　　Can do. \n \n 　　Really? Doesn\u0027t seem like it. \n \n 　　He was finally quiet. \n \n 　　And then we were across the road and moving through the forest that ringed the Cullens\u0027 house. CouldEdward hear us yet? \n \n 　　Maybe we should be thinking something like,\u0027We come in peace.\"Go for itEdward?He called the name tentatively. Edward, you there? Okay, now I feel kinda stupid. \n \n 　　You sound stupid, too. \n \n 　　Think he can hear us? \n \n 　　We were less than a mile out now. / think so. Hey, Edward. If you can hear me— circle the wagons,bloodsucker. You\u0027ve got a problem. \n \n 　　We\u0027ve got a problem, Seth corrected. \n \n 　　Then we broke through the trees into the big lawn. The house was dark, but not empty. Edward stoodon the porch between Emmett and Jasper. They were snow white in the pale light. \n \n 　　\"Jacob? Seth? What\u0027s going on?\"I slowed and then paced back a few steps. The smell was so sharp through this nose that it felt like itwas honestly burning me. Seth whined quietly, hesitating, and then he fell back behind me. \n \n 　　To answer Edward\u0027s question, I let my mind run over the confrontation with Sam, moving through itbackward. Seth thought with me, filling in the gaps, showing the scene from another angle. We stoppedwhen we got to the partabout the \"abomination,\" because Edward hissed furiously and leaped off the porch. \n \n 　　\"They want to kill Bella?\" he snarled flatly. \n \n 　　Emmett and Jasper, not having heard the first part of the conversation, took his inflectionless question fora statement. They were right next to him in a flash, teeth exposed as they moved on us. \n \n 　　Hey, now,Seth thought, backing away. \n \n 　　\"Em, Jazz—not theml The others. The pack is coming.\"Emmett and Jasper rocked back on their heels; Emmett turned to Edward while Jasper kept his eyeslocked on us. \n \n 　　\"What\u0027s their problem?\" Emmett demanded. \n \n 　　\"The same one as mine,\" Edward hissed. \"But they have their own plan to handle it. Get the others. CallCarlisle! He and Esme have to get back here now.\"I whined uneasily. They were separated. \n \n 　　\"They aren\u0027t far,\" Edward said in the same dead voice as before. \n \n 　　I\u0027m going to go take a look,Seth said. Run the western perimeter. \n \n 　　\"Will you be in danger, Seth?\" Edward asked. \n \n 　　Seth and I exchanged a glance. \n \n 　　Don\u0027t think so,we thought together. And then I added, But maybe I should go. Just in case... \n \n 　　They\u0027ll be less likely to challenge me,Seth pointed out. I\u0027m just a kid to them. \n \n 　　You\u0027re just a kid to me, kid. \n \n 　　I\u0027m outta here. You need to coordinate with the Cullens. \n \n 　　He wheeled and darted into the darkness. I wasn\u0027t going to order Seth around, so I let him go. \n \n 　　Edward and I stood facing each other in the dark meadow, i could hear Emmett muttering into hisphone. Jasper was watching the place where Seth had vanished into the woods. Alice appeared on theporch and then, after staring at me with anxious eyes for a long moment, she flitted to Jasper\u0027s side. Iguessed that Rosalie was inside with Bella. Still guarding her—from the wrong dangers. \n \n 　　\"This isn\u0027t the first time I\u0027ve owed you my gratitude, Jacob,\" Edward whispered. \"I would never haveasked for this from you.\"I thought of what he\u0027d asked me for earlier today. When it came to Bella, there were no lines hewouldn\u0027t cross. Yeah, you would. \n \n 　　He thought about it and then nodded. \"I suppose you\u0027re right about that.\"I sighed heavily. Well, this isn\u0027t the first time that I didn\u0027t do it for you. \n \n 　　\"Right,\" he murmured. \n \n 　　Sorry I didn\u0027t do any good today. Told you she wouldn\u0027t listen to me. \n \n 　　\"I know. I never really believed she would. But...\"You had to try. I get it. She any better? \n \n 　　His voice and eyes went hollow. \"Worse,\" he breathed. \n \n 　　I didn\u0027t want to let that word sink in. I was grateful when Alice spoke. \n \n 　　\"Jacob, would you mind switching forms?\" Alice asked. \"I want to know what\u0027s going on.\"I shook my head at the same time Edward answered. \n \n 　　\"He needs to stay linked to Seth.\"\"Well, then would you be so kind as to tell me what\u0027s happening?\"He explained in clipped, emotionless sentences. \"The pack thinks Bella\u0027s become a problem. Theyforesee potential danger from the... from what she\u0027s carrying. They feel it\u0027s their duty to remove thatdanger. Jacob and Seth disbanded from the pack to warn us. The rest are planning to attack tonight.\"Alice hissed, leaning away from me. Emmett and Jasper exchanged a glance, and then their eyes rangedacross the trees. \n \n 　　Nobody out here,Seth reported. All\u0027s quiet on the western frontThey may go around. \n \n 　　I\u0027ll make a loop. \n \n 　　\"Carlisle and Esme are on their way,\" Emmett said. \"Twenty minutes, tops.\"\"We should take up a defensive position,\" Jasper said. \n \n 　　Edward nodded. \"Let\u0027s get inside.\"/\u0027// run perimeter with Seth. If I get too far for you to hear my head, listen for my howl. \n \n 　　\"Iwill.\"They backed into the house, eyes flickering everywhere. Before they were inside, I turned and rantoward the west. \n \n 　　I\u0027m still not finding much,Seth told me. \n \n 　　/\u0027// take half the circle. Move fast— we don\u0027t want them to have a chance to sneak past us. \n \n 　　Seth lurched forward in a sudden burst of speed. \n \n 　　We ran in silence, and the minutes passed. I listened to the noises around him, double-checking hisjudgment. \n \n 　　Hey —something coming up fast!he warned me after fifteen minutes of silence. \n \n 　　On my way! \n \n 　　Hold your position—/ don\u0027t think it\u0027s the pack. It sounds different. \n \n 　　Seth —But he caught the approaching scent on the breeze, and I read it in his mind. \n \n 　　Vampire. Bet it\u0027s Carlisle. \n \n 　　Seth, fall back. It might be someone else. \n \n 　　No, it\u0027s them. I recognize the scent Hold up, I\u0027m going to phase to explain it to them. \n \n 　　Seth, I don\u0027t think —But he was gone. \n \n 　　Anxiously, I raced along the western border. Wouldn\u0027t it be just peachy if I couldn\u0027t take care of Sethfor one freaking night? What if something happened to him on my watch? Leah would shred me intokibble. \n \n 　　At least the kid kept it short. It wasn\u0027t two minutes later when I felt him in my head again. \n \n 　　Yep, Carlisle and Esme. Boy, were they surprised to see me! They\u0027re probably inside by now. Carlislesaid thanks. \n \n 　　He\u0027s a good guy. \n \n 　　Yeah. That\u0027s one of the reasons why we\u0027re right about this. \n \n 　　Hope so. \n \n 　　Why\u0027re you so down, Jake? I\u0027ll bet Sam won\u0027t bring the pack tonight. He\u0027s not going to launch a suicidemission. \n \n 　　I sighed. It didn\u0027t seem to matter, either way. \n \n 　　Oh. This isn\u0027t about Sam so much, is it? \n \n 　　I made the turn at the end of my patrol. I caught Seth\u0027s scent where he\u0027d turned last. We weren\u0027t leavingany gaps. \n \n 　　You think Bella\u0027s going to die anyway,Seth whispered. \n \n 　　Yeah, she is. \n \n 　　Poor Edward. He must be crazy. \n \n 　　Literally. \n \n 　　Edward\u0027s name brought other memories boiling to the surface. Seth read them in astonishment. \n \n 　　And then he was howling. Oh, man! No way! You did not/ That just plain oT sucks rocks, Jacob! \n \n 　　And you know it, too! I can\u0027t believe you said you\u0027d kill him. What is that? You have to tell him no. \n \n 　　Shut up, shut up, you idiot! They\u0027re going to think the pack is coming! \n \n 　　Oops!He cut off mid-howl. \n \n 　　I wheeled and started loping in toward the house. Just keep out of this, Seth. Take the whole circlefor now. \n \n 　　Seth seethed and I ignored him. \n \n 　　False alarm, false alarm,I thoughtas I ran closer in. Sorry. Seth is young. He forgets things. No one\u0027sattacking. False alarm. \n \n 　　When I got to the meadow, I could see Edward staring out of a dark window. I ran in, wanting to besure he got the message. \n \n 　　There\u0027s nothing out there— you got that? \n \n 　　He nodded once. \n \n 　　This would be a lot easier if the communication wasn\u0027t one way. Then again, I was kinda glad I wasn\u0027t inhis head. \n \n 　　He looked over his shoulder, back into the house, and I saw a shudder run through his whole frame. Hewaved me away without looking in my direction again and then moved out of my view. \n \n 　　What\u0027s going on? \n \n 　　Like I was going to get an answer. \n \n 　　I sat very still in the meadow and listened. With these ears, I could almost hear SetlYs soft footfalls,miles out into the forest. It was easy to hear every sound inside the dark house. \n \n 　　\"It was a false alarm,\" Edward was explaining in that dead voice, just repeating what I\u0027d told him. \"Sethwas upset about something else, and he forgot we were listening for a signal. He\u0027s very young.\"\"Nice to have toddlers guarding the fort,\" a deeper voice grumbled. Emmett, I thought. \n \n 　　\"They\u0027ve done us a great service tonight, Emmett,\" Carlisle said. \"At great personal sacrifice.\"\"Yeah, I know. I\u0027m just jealous. Wish I was out there.\"\"Seth doesn\u0027t think Sam will attack now,\" Edward said mechanically. \"Not with us forewarned, andlacking two members of the pack.\"\"What does Jacob think?\" Carlisle asked. \n \n 　　\"He\u0027snot as optimistic.\"No one spoke. There was a quiet dripping sound that I couldn\u0027t place. I heard their low breathing—andI could separateBella\u0027s from the rest. It was harsher, labored. It hitched and broke in strange rhythms. Icould hear her heart. It seemed... too fast. I paced it against my own heartbeat, but I wasn\u0027t sure if thatwas any measure. It wasn\u0027t like I was normal. \n \n 　　\"Don\u0027t touch her! You\u0027ll wake her up,\" Rosalie whispered. \n \n 　　Someone sighed. \n \n 　　\"Rosalie,\" Carlisle murmured. \n \n 　　\"Don\u0027t start with me, Carlisle. We let you have your way earlier, but that\u0027s all we\u0027re allowing.\"It seemed like Rosalie and Bella were both talking in plurals now. Like they\u0027d formed a pack of theirown. \n \n 　　I paced quietly in front of the house. Each pass brought me a little closer. The dark windows were like aTV set running in some dull waiting room—it was impossible to keep my eyes off them for long. \n \n 　　A few more minutes, a few more passes, and my fur was brushing the side of the porch as I paced. \n \n 　　I couldsee up through the windows—see the top of the walls and the ceiling, the unlit chandelier thathung there. I was tall enough thatall I would have to do was stretch my neck a little... and maybe onepaw up on the edge of the porch.... \n \n 　　I peeked into the big, open front room, expecting to see something very similar to the scene thisafternoon. But it had changed so much that I was confused at first. For a second I thought I\u0027d gotten thewrong room. \n \n 　　The glass wall was gone—it looked like metal now. And the furniture was all dragged out of the way,withBella curled up awkwardly on a narrow bed in the center of the open space. Not a normalbed—one with rails like in a hospital. Also like a hospital were the monitors strapped to her body, thetubes stuck into her skin. The lights on the monitors flashed, but there was no sound. The dripping noisewas from the IV plugged into her arm—some fluid that was thick and white, not clear. \n \n 　　She choked a little in her uneasy sleep, and both Edward and Rosalie moved in to hover over her. Herbodyjerked, and she whimpered. Rosalie smoothed her hand across Bella\u0027s forehead. Edward\u0027s bodystiffened—his back was to me, but his expression must have been something to see, because Emmettwrenched himself between them before there was time to blink. He held his hands up to Edward. \n \n 　　\"Not tonight, Edward. We\u0027ve got other things to worry about.\"Edward turned away from them, and he was the burning man again. His eyes met mine for one moment,and then I dropped back to all fours. \n \n 　　I ran back into the dark forest, running to join Seth, running away from what was behind me. \n \n 　　Worse. Yes, she was worse. \n \n","sourceLink":"http://novel.tingroom.com/jingdian/151/5980.html","bookId":740,"book":{"id":740,"title":"暮光之城：破晓 Breaking Dawn","description":"简介： Bella and Edward are married, but their honeymoon is cut short when Bella discovers that she is pregnant. Her pregnancy progresses rapidly, severely weakening her. She nearly dies giving birth to her and Edward\u0027s half-vampire-half-human daughter, Rene...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1292209551bf31c.jpg","type":"Children\u0027s","link":"http://novel.tingroom.com/jingdian/151","creation":"Aug 1, 2019 12:19:15 AM","modification":"Aug 1, 2019 12:19:15 AM"}}
