{"id":26244,"no":5,"title":"Chapter 4 Gesture","content":"The wedding flowed into the reception party smoothly—proof of Alice\u0027s flawless planning. It was justtwilight over the river; the ceremony had lasted exactly the right amount of time, allowing the sun to setbehind the trees. The lights in the trees glimmered as Edward led me through the glass back doors,making the white flowers glow. There were another ten thousand flowers out here, serving as a fragrant,airy tent over the dance floor set up on the grass under two of the ancient cedars. 　　Things slowed down, relaxed as the mellow August evening surrounded us. The little crowd spread outunder the soft shine of the twinkle lights, and we were greeted again by the friends we\u0027d just embraced. 　　There was time to talk now, to laugh. 　　\"Congrats, guys,\" Seth Clearwater told us, ducking his head under the edge of a flower garland. Hismother, Sue, was tight by his side, eyeing the guests with wary intensity. Her face was thin and fierce, anexpression that was accented by her short, severe hairstyle; it was as short as her daughter Leah\u0027s—Iwondered if she\u0027d cut it the same way in a show of solidarity. Billy Black, on Seth\u0027s other side, was notas tense as Sue. 　　When I looked at Jacob\u0027s father, I always felt like I was seeing two people rather than just one. Therewas the old man in the wheelchair with the lined face and the white smile that everyone else saw. Andthen there was the direct descendant of a long line of powerful, magical chieftains, cloaked in theauthority he\u0027d been born with. Though the magic had—in the absence of a catalyst—skipped hisgeneration, Billy was still a part of the power and the legend. It flowed straight through him. It flowed tohis son, the heir to the magic, who had turned his back on it. That left Sam Uley to act as the chief oflegends and magic now___Billy seemed oddly at ease considering the company and the event—his black eyes sparkled like he\u0027djust gotten some good news. I was impressed by his composure. This wedding must have seemed a verybad thing, the worst thing that could happen to his best friend\u0027s daughter, in Billy\u0027s eyes. 　　I knew it wasn\u0027t easy for him to restrain his feelings, considering the challenge this event foreshadowed tothe ancient treaty between the Cullens and the Quileutes—the treaty that prohibited the Cullens from evercreating another vampire. The wolves knew a breach was coming, but the Cullens had no idea how theywould react. Before the alliance, it would have meant an immediate attack. A war. But now that theyknew each other better, would there be forgiveness instead? 　　As if in response to that thought, Seth leaned toward Edward, arms extended. Edward returned the hugwith his free arm. 　　I saw Sue shudder delicately. 　　\"It\u0027s good to see things work out for you, man,\" Seth said. \"I\u0027m happy for you.\"\"Thank you, Seth. That means a lot to me.\" Edward pulled away from Seth and looked at Sue and Billy. 　　\"Thank you, as well. For letting Seth come. For supporting Bella today.\"\"You\u0027re welcome,\" Billy said in his deep, gravelly voice, and I was surprised at the optimism in his tone. 　　Perhaps a stronger truce was on the horizon. 　　A bit of a line was forming, so Seth waved goodbye and wheeled Billy toward the food. Sue kept onehand on each of them. 　　Angela and Ben were the next to claim us, followed by Angela\u0027s parents and then Mike and Jessica—who were, to my surprise, holding hands. I hadn\u0027t heard that they were together again. That was nice. 　　Behind my human friends were my new cousins-in-law, the Denali vampire clan. I realized I was holdingmy breath as the vampire in front—Tanya, I assumed from the strawberry tint in her blondcurls—reached out to embrace Edward. Next to her, three other vampires with golden eyes stared at mewith open curiosity. One woman had long, pale blond hair, straight as corn silk. The other woman andthe man beside her were both black-haired, with a hint of an olive tone to their chalky complexions. 　　And they were all four so beautiful that it made my stomach hurt. 　　Tanya was still holding Edward. 　　\"Ah, Edward,\" she said. \"I\u0027ve missed you.\"Edward chuckled and deftly maneuvered out of the hug, placing his hand lightly on her shoulder andstepping back, as if to get a better look at her. \"It\u0027s been too long, Tanya. You look well.\"\"So do you.\"\"Let me introduce you to my wife.\" It was the first time Edward had said that word since it was officiallytrue; he seemed like he would explode with satisfaction saying it now. The Denalis all laughed lightly inresponse. \"Tanya, this is my Bella.\"Tanya was every bit as lovely as my worst nightmares had predicted. She eyed me with a look that wasmuch more speculative than it was resigned, and then reached out to take my hand. 　　\"Welcome to the family, Bella.\" She smiled, a little rueful. \"We consider ourselves Carlisle\u0027s extendedfamily, and I am sorry about the, er, recent incident when we did not behave as such. We should havemet you sooner. Canyou forgive us?\"\"Of course,\" I said breathlessly. \"It\u0027s so nice to meet you.\"\"The Cullens are all evened up in numbers now. Perhaps it will be our turn next, eh, Kate?\" She grinnedat the blonde. 　　\"Keep the dream alive,\" Kate said with a roll of her golden eyes. She took my hand from Tanya\u0027s andsqueezed it gently. \"Welcome, Bella.\"The dark-haired woman put her hand on top of Kate\u0027s. \"I\u0027m Carmen, this is Eleazar. We\u0027re all so verypleased to finally meet you.\"\"M-me, too,\" I stuttered. 　　Tanya glanced at the people waiting behind her—Charlie\u0027s deputy, Mark, and his wife. Their eyes werehuge as they took in the Denali clan. 　　\"We\u0027ll get to know each other later. We\u0027ll have eons of time for that!\" Tanya laughed as she and herfamily moved on. 　　All the standard traditions were kept. I was blinded by flashbulbs as we held the knife over a spectacularcake—too grand, I thought, for our relatively intimate group of friends and family. We took turns shovingcake in each other\u0027s faces; Edward manfully swallowed his portion as I watched in disbelief. I threw mybouquet with atypical skill, right into Angela\u0027s surprised hands. Emmett and Jasper howled with laughterat my blush while Edward removed my borrowed garter—which I\u0027d shimmied down nearly to myankle— verycarefully with his teeth. With a quick wink at me, he shot it straight into Mike Newton\u0027sface. 　　And when the music started, Edward pulled me into his arms for the customary first dance; I wentwillingly, despite my fear of dancing—especially dancing in front of an audience—just happy to have himholding me. He did all the work, and I twirled effortlessly under the glow of a canopy of lights and thebright flashes from the cameras. 　　\"Enjoying the party, Mrs. Cullen?\" he whispered in my ear. 　　I laughed. \"That will take a while to get used to.\"\"We have a while,\" he reminded me, his voice exultant, and he leaned down to kiss me while we danced. 　　Cameras clicked feverishly. 　　The music changed, and Charlie tapped on Edward\u0027s shoulder. 　　It wasn\u0027t nearly as easy to dance with Charlie. He was no better at it than I was, so we moved safelyfrom side to side in a tiny square formation. Edward and Esme spun around us like Fred Astaire andGinger Rogers. 　　\"I\u0027m going to miss you at home, Bella. I\u0027m already lonely.\"I spoke through a tight throat, trying to make a joke of it. \"I feel just horrible, leaving you to cook foryourself—it\u0027s practically criminal negligence. You could arrest me.\"He grinned. \"I suppose I\u0027ll survive the food. Just call me whenever you can.\"\"I promise.\"It seemed like I danced with everyone. It was good to see all my old friends, but I really wanted to bewith Edwardmore than anything else. I was happy when he finally cut in, just half a minute after a new dance started. 　　\"Still not that fond of Mike, eh?\" I commented as Edward whirled me away from him. 　　\"Not when I have to listen to his thoughts. He\u0027s lucky I didn\u0027t kick him out. Or worse.\"\"Yeah, right.\"\"Have you had a chance to look at yourself?\"\"Urn. No, I guess not. Why?\"\"Then I suppose you don\u0027t realize how utterly, heart-breakingly beautiful you are tonight. I\u0027m notsurprised Mike\u0027s having difficulty with improper thoughts about a married woman. I am disappointed thatAlice didn\u0027t make sure you were forced to look in a mirror.\"\"You are very biased, you know.\"He sighed and then paused and turned me around to face the house. The wall of glass reflected the partyback like a long mirror. Edward pointed to the couple in the mirror directly across from us. 　　\"Biased, am I?\"I caught just a glimpse of Edward\u0027s reflection—a perfect duplicate of his perfect face—with adark-haired beauty at his side. Her skin was cream and roses, her eyes were huge with excitement andframed with thick lashes. The narrow sheath of the shimmering white dress flared out subtly at the trainalmost like an inverted calla lily, cut so skillfully that her body looked elegant and graceful—while it wasmotionless, at least. 　　Before I could blink and make the beauty turn back into me, Edward suddenly stiffened and turnedautomatically in the other direction, as if someone had called his name. 　　\"Oh!\" he said. His brow furrowed for an instant and then smoothed out just as quickly. 　　Suddenly, he was smiling a brilliant smile. 　　\"What is it?\" I asked. 　　\"A surprise wedding gift.\"\"Huh?\"He didn\u0027t answer; he just started dancing again, spinning me the opposite way we\u0027d been headed before,away from the lights and then into the deep swath of night that ringed the luminous dance floor. 　　He didn\u0027t pause until we reached the dark side of one of the huge cedars. Then Edward looked straightinto the blackest shadow. 　　\"Thank you,\" Edward said to the darkness. \"This is very... kind of you.\"\"Kind is my middle name,\" a husky familiar voice answered from the black night. \"Can i cut in?\"My hand flew up to my throat, and if Edward hadn\u0027t been holding me I would have collapsed. 　　\"Jacob!\" I choked as soon as I could breathe. \"Jacob!\"\"Hey there, Bells.\"I stumbled toward the sound of his voice. Edward kept his grip under my elbow until another set ofstrong hands caught me in the darkness. The heat from Jacob\u0027s skin burned right through the thin satindress as he pulled meclose. He made no effort to dance; he just hugged me while I buried my face in his chest. He leaneddown to press his cheek to the top of my head. 　　\"Rosalie won\u0027t forgive me if she doesn\u0027t get her official turn on the dance floor,\" Edward murmured, andI knew he was leaving us, giving me a gift of his own—this moment with Jacob. 　　\"Oh, Jacob.\" I was crying now; I couldn\u0027t get the words out clearly. \"Thank you.\"\"Stop blubbering,Bella. You\u0027ll ruin your dress. It\u0027s just me.\"\"Just? Oh, Jake! Everything is perfect now.\"Hesnorted. \"Yeah—the party can start. The best man finally made it.\"\"Now everyone I love is here.\"I felthis lips brush my hair. \"SorryI\u0027m late, honey.\"\"I\u0027m just so happy you came!\"\"That was the idea.\"I glanced toward the guests, but I couldn\u0027t see through the dancers to the spot where I\u0027d last seenJacob\u0027s father. I didn\u0027t know if he\u0027d stayed. \"DoesBilly know you\u0027re here?\" As soon as I asked, I knewthat he must have—it was the only way to explain his uplifted expression before. 　　\"I\u0027m sure Sam\u0027s told him. I\u0027ll go see him when... when the party\u0027s over.\"\"He\u0027ll beso glad you\u0027re home.\"Jacob pulled back a little bit and straightened up.He left one hand on the small of my back and grabbedmy right hand with the other. He cradled our hands to his chest; I could feel his heart beat under mypalm, and I guessed that he hadn\u0027t placed my hand there accidentally. 　　\"I don\u0027t know if I get more than just this one dance,\" he said, and he began pulling me around in a slowcircle that didn\u0027t match the tempo of the music coming from behind us. \"I\u0027d better make the best of it.\"We moved to the rhythm of his heart under my hand. 　　\"I\u0027m glad Icame,\" Jacob said quietly after a moment. \"I didn\u0027t think I would be. But it\u0027s good to see you... 　　one more time. Not as sad as I\u0027d thought it would be.\"\"I don\u0027t want you to feel sad.\"\"I know that. And I didn\u0027t come tonight to make you feel guilty.\"\"No—it makes me very happy that you came. It\u0027s the best gift you could have given me.\"He laughed. \"That\u0027s good, because I didn\u0027t have time to stop for a real present.\"My eyes were adjusting, and I could see his face now, higher up than I expected. Was it possible that hewas still growing? He had to be closer to seven feet than to six. It was a relief to see his familiar featuresagain after all this time—his deep-set eyes shadowed under his shaggy black brows, his highcheekbones, his full lips stretched over his bright teeth in the sarcastic smile that matched his tone. Hiseyes were tight around the edges—careful; I could see that he was being very careful tonight. He wasdoing all he could to make me happy, to not slip and show how much this cost him. 　　I\u0027d never done anything good enough to deserve a friend like Jacob. 　　\"When did you decide to come back?\"\"Consciously or subconsciously?\" He took a deep breath before he answered his own question. \"I don\u0027treally know. I guess I\u0027ve been wandering back this direction for a while, and maybe it\u0027s because I washeaded here. But it wasn\u0027t until this morning that I really started running. I didn\u0027t know if I could makeit.\" He laughed. \"You wouldn\u0027t believe how weird this feels—walking around on two legs again. Andclothes! And then it\u0027s more bizarre because it feels weird. I didn\u0027t expect that. I\u0027m out of practice with thewhole human thing.\"We revolved steadily. 　　\"It would have been a shame to miss seeing you like this, though. That\u0027s worth the trip right there. Youlook unbelievable, Bella. So beautiful.\"\"Alice invested a lot of time in me today. The dark helps, too.\"\"It\u0027s not so dark for me, you know.\"\"Right.\" Werewolf senses. It was easy to forget all the things he could do, he seemed so human. 　　Especially right now. 　　\"You cut your hair,\" I noted. 　　\"Yeah. Easier, you know. Thought I\u0027d better take advantage of the hands.\"\"It looks good,\" I lied. 　　He snorted. \"Right. I did it myself, with rusty kitchen shears.\" He grinned widely for a moment, and thenhis smile faded. His expression turned serious. \"Are you happy, Bella?\"\"Yes.\"\"Okay.\" I felt his shoulders shrug. \"That\u0027s the main thing, I guess.\"\"How are you, Jacob? Really?\"\"I\u0027m fine, Bella, really. You don\u0027t need to worry about me anymore. You can stop bugging Seth.\"\"I\u0027m not just bugging him because of you. I like Seth.\"\"He\u0027s a good kid. Better company than some. I tell you, if I could get rid of the voices in my head, beinga wolf would be about perfect.\"I laughed at the way it sounded. \"Yeah, I can\u0027t get mine to shut up, either.\"\"In your case, that would mean you\u0027re insane. Of course, I already knew that you were insane,\" heteased. 　　\"Thanks.\"\"Insanity is probably easier than sharing a pack mind. Crazy people\u0027s voices don\u0027t send babysitters towatch them.\"\"Huh?\"\"Sam\u0027s out there. And some of the others. Just in case, you know.\"\"In case of what?\"\"In case I can\u0027t keep it together, something like that. In case I decide to trash the party.\" He flashed aquicksmile at what was probably an appealing thought to him. \"But I\u0027m not here to ruin your wedding, Bella. 　　I\u0027m here to .. .\" He trailed off. 　　\"To make it perfect.\"\"That\u0027s a tall order.\"\"Good thing you\u0027re so tall.\"He groaned at my bad joke and then sighed. \"I\u0027m just here to be your friend. Your best friend, one lasttime.\"\"Sam should give you more credit.\"\"Well, maybe I\u0027m being oversensitive. Maybe they\u0027d be here anyway, to keep an eye on Seth. There area lot of vampires here. Seth doesn\u0027t take that as seriously as he should.\"\"Seth knows that he\u0027s not in any danger. He understands the Cullens better than Sam does.\"\"Sure, sure,\" Jacob said, making peace before it could turn into a fight. 　　It was strange to have him being the diplomat. 　　\"Sorry about those voices,\" I said. \"Wish I could make it better.\" In so many ways. 　　\"It\u0027s not that bad. I\u0027m just whining a little.\"\"You\u0027re... happy?\"\"Close enough. But enough about me. You\u0027re the star today.\" He chuckled. \"I bet you\u0027re just lovingthat. Center of attention.\"\"Yeah. Can\u0027t get enough attention.\"He laughed and then stared over my head. With pursed lips, he studied the shimmering glow of thereception party, the graceful whirl of the dancers, the fluttering petals falling from the garlands; I lookedwith him. It all seemed very distant from this black, quiet space. Almost like watching the white flurriesswirling inside a snow globe. 　　\"I\u0027ll give them this much,\" he said. \"They know how to throw a party.\"\"Alice is an unstoppable force of nature.\"He sighed. \"Song\u0027s over. Do you think 1 get another one? Or is that asking too much?\"I tightened my hand around his. \"You can have as many dances as you want.\"He laughed. \"That would be interesting. I think I\u0027d better stick with two, though. Don\u0027t want to starttalk.\"We turned in another circle. 　　\"You\u0027d think I\u0027d be used to telling you goodbye by now,\" he murmured. 　　I tried to swallow the lump in my throat, but I couldn\u0027t force it down. 　　Jacob looked at me and frowned. He wiped his fingers across my cheek, catching the tears there. 　　\"You\u0027re not supposed to be the one crying, Bella.\"\"Everyone cries at weddings,\" I said thickly. 　　\"This is what you want, right?\"\"Right.\"\"Then smile.\"I tried. He laughed at my grimace. 　　Tm going to try to remember you like this. Pretend that...\"\"That what?That I died?\"He clenched his teeth. He was struggling with himself—with his decision to make his presence here a giftand not a judgment. I could guess what he wanted to say. 　　\"No,\" he finally answered. \"But I\u0027ll see you this way in my head. Pink cheeks. Heartbeat. Two left feet. 　　All of that.\"I deliberately stomped on his foot as hard as I could. 　　He smiled. \"That\u0027s my girl.\"He started to say something else and then snapped his mouth closed. Struggling again, teeth grittedagainst the words he didn\u0027t want to say. 　　My relationship with Jacob used to be so easy. Natural as breathing. But since Edward had come backinto my life, it was a constant strain. Because—in Jacob\u0027s eyes—by choosing Edward, I was choosing afate that was worse than death, or at least equivalent to it. 　　\"What is it, Jake? Just tell me. You can tell me anything.\"\"I—I... I don\u0027t have anything to tell you.\"\"Oh please. Spit it out.\"\"It\u0027s true.It\u0027s not... it\u0027s—it\u0027s a question. It\u0027s something I want you to tell me\"\"Ask me.\"He struggled for another minute and then exhaled. \"I shouldn\u0027t. It doesn\u0027t matter. I\u0027m just morbidlycurious.\"Because I knew him so well, I understood. 　　\"It\u0027s not tonight, Jacob,\" I whispered. 　　Jacob was even more obsessed with my humanity than Edward. He treasured every one of myheartbeats, knowing that they were numbered. 　　\"Oh,\" he said, trying to smother his relief. \"Oh.\"A new song started playing, but he didn\u0027t notice the change this time. 　　\"When?\" he whispered. 　　\"I don\u0027t know for sure. A week or two, maybe.\"His voice changed, took on a defensive, mocking edge. \"What\u0027s the holdup?\"\"I just didn\u0027t want to spend my honeymoon writhing in pain.\"\"You\u0027d rather spend it how? Playing checkers? Ha ha.\"\"Very funny.\"\"Kidding, Bells. But, honestly, I don\u0027t see the point. You can\u0027t have a real honeymoon with yourvampire, so why go through the motions? Call a spade a spade. This isn\u0027t the first time you\u0027ve put this off. 　　That\u0027s a good thing, though,\" he said, suddenly earnest. \"Don\u0027t be embarrassed about it.\"\"I\u0027m not putting anything off,\" I snapped. \"And yes I can have a real honeymoon! I can do anything Iwant! Butt out!\"He stopped our slow circling abruptly. For a moment, I wondered if he\u0027d finally noticed the musicchange, and I scrambled in my head for a way to patch up our little tiff before he said goodbye to me. 　　We shouldn\u0027t part on this note. 　　And then his eyes bulged wide with a strange kind of confused horror. 　　\"What?\" he gasped. \"What did you say?\"\"About what... ? Jake? What\u0027s wrong?\"\"What do you mean? Have a real honeymoon? While you\u0027re still human? Are you kidding? That\u0027s a sickjoke, Bella!\"I glared at him. \"I said butt out, Jake. This is so not your business. I shouldn\u0027t have... we shouldn\u0027t evenbe talking about this. It\u0027s private—\"His enormous hands gripped the tops of my arms, wrapping all the way around, fingers overlapping. 　　\"Ow, Jake! Let go!\"He shook me. 　　\"Bella! Have you lost your mind? You can\u0027t be that stupid! Tell me you\u0027re joking!\"He shook me again. His hands, tight as tourniquets, were quivering, sending vibrations deep into mybones. 　　\"Jake—stop!\"The darkness was suddenly very crowded. 　　\"Take your hands off her!\" Edward\u0027s voice was cold as ice, sharp as razors. 　　Behind Jacob, there was a low snarl from the black night, and then another, overlapping the first. 　　\"Jake, bro, back away,\" I heard Seth Clearwater urge. \"You\u0027re losing it.\"Jacob seemed frozen as he was, his horrified eyes wide and staring. 　　\"You\u0027ll hurt her,\" Seth whispered. \"Let her go.\"\"Now!\" Edward snarled. 　　Jacob\u0027s hands dropped to his sides, and the sudden gush of blood through my waiting veins was almostpainful. Before I could register more than that, cold hands replaced the hot ones, and the air wassuddenly whooshing past me. 　　I blinked, and I was on my feet a half dozen feet away from where I\u0027d been standing. Edward wastensed in front of me. There were two enormous wolves braced between him and Jacob, but they did notseem aggressive to me. More like they were trying to prevent the fight. 　　And Seth—gangly, fifteen-year-old Seth—had his long arms around Jacob\u0027s shaking body, and he wastugging him away. If Jacob phased with Seth so close... 　　\"C\u0027mon, Jake. Let\u0027s go.\"\"I\u0027ll kill you,\" Jacob said, his voice so choked with rage that it was low as a whisper. His eyes, focusedonEdward, burned with fury. \"I\u0027ll kill you myself! I\u0027ll do it now!\" He shuddered convulsively. 　　The biggest wolf, the black one, growled sharply. 　　\"Seth, get out of the way,\" Edward hissed. 　　Seth tugged on Jacob again. Jacob was so bewildered with rage that Seth was able to yank him a fewfeet farther back. \"Don\u0027t do it, Jake. Walk away. C\u0027mon.\"Sam—the bigger wolf, the black one—joined Seth then. He put his massive head against Jacob\u0027s chestand shoved. 　　The three of them—Seth towing, Jake trembling, Sam pushing—disappeared swiftly into the darkness. 　　The other wolf stared after them. I wasn\u0027t sure, in the weak light, about the color of his fur—chocolatebrown, maybe? Was it Quil, then? 　　Tm sorry,\" I whispered to the wolf. 　　\"It\u0027sall right now,Bella,\" Edward murmured. 　　The wolf looked at Edward. His gaze was not friendly. Edward gave him one cold nod.The wolf huffedand then turned to follow the others, vanishing as they had. 　　\"All right,\" Edward said to himself, and then he looked at me. \"Let\u0027s get back.\"\"But Jake—\"\"Sam has him in hand. He\u0027s gone.\"\"Edward, I\u0027m so sorry. Iwas stupid—\"\"You did nothing wrong—\"\"I have such a big mouth! Why would I... I shouldn\u0027t have let him get to me like that. What was Ithinking?\"\"Don\u0027t worry.\" He touched my face. \"We need to get back to the reception before someone notices ourabsence.\"I shook my head, trying to reorient myself. Before someone noticed? Had anyone missed that? 　　Then, as I thought about it, I realized the confrontation that had seemed so catastrophic to me had, inreality, been very quiet and short here in the shadows. 　　\"Give me two seconds,\" I pleaded. 　　My insides were chaotic with panic and grief, but that didn\u0027t matter—only the outside mattered rightnow. Putting on a good show was something I knew I had to master. 　　\"My dress?\"\"You look fine. Not a hair out of place.\"I took two deep breaths. \"Okay. Let\u0027s go.\"He put his arms around me and led me back to the light. When we passed under the twinkle lights, hespun me gently onto the dance floor. We melted in with the other dancers as if our dance had never beeninterrupted. 　　I glanced around at the guests, butno one seemed shocked or frightened. Only the very palest facesthere showed any signs of stress, and they hid it well. Jasper and Emmett were on the edge of the floor,close together,and I guessed that they had been nearby during the confrontation. 　　\"Are you—\"Tm fine,\" I promised. \"I can\u0027t believe I did that. What\u0027s wrong with me?\"\"Nothing is wrong with you\"I\u0027d been so glad to see Jacob here. I knew the sacrifice it had taken him. And then I\u0027d ruined it, turnedhis gift into a disaster. I should be quarantined. 　　But my idiocy would not ruin anything else tonight. I would put this away, shove it in a drawer and lock itup to deal with later. There would be plenty of time to flagellate myself for this, and nothing I could donow would help. 　　\"It\u0027s over,\" I said. \"Let\u0027s not think of it again tonight.\"I expected a quick agreement from Edward, but he was silent. 　　\"Edward?\"He closed his eyes and touched his forehead to mine. \"Jacob is right,\" he whispered. \"What am Ithinking?\"\"He is not.\" I tried to keep my face smooth for the watching crowd of friends. \"Jacob is way tooprejudiced to see anything clearly.\"He mumbled something low that sounded almost like \"should let him kill me for even thinking ...\"\"Stop it,\" I said fiercely. I grabbed his face in my hands and waited until he opened his eyes. \"You andme. That\u0027s the only thing that matters. The only thing you\u0027re allowed to think about now. Do you hearme?\"\"Yes,\" he sighed. 　　\"Forget Jacob came.\" I could do that. I would 60 that. \"For me. Promise that you\u0027ll let this go.\"He stared into my eyes for a moment before answering. \"I promise.\"\"Thank you. Edward, I\u0027m not afraid.\"\"I am,\" he whispered. 　　\"Don\u0027t be.\" I took deep breath and smiled. \"By the way, I love you.\"He smiled just a little in return. \"That\u0027s why we\u0027re here.\"\"You\u0027re monopolizing the bride,\" Emmett said, coming up behind Edward\u0027s shoulder. \"Let me dance withmy little sister. This could be my last chance to make her blush.\" He laughed loudly, as unaffected as heusually was by any serious atmosphere. 　　It turned out there were actually lots of people I hadn\u0027t danced with yet, and that gave me a chance totruly compose and resolve myself. When Edward claimed me again, I found that the Jacob-drawer wasshut nice and tight. As he wrapped his arms around me, I was able to unearth my earlier sense of joy, mycertainty that everything in my life was in the right place tonight. I smiled and laid my head against hischest. His arms tightened. 　　\"I could get used to this,\" I said. 　　\"Don\u0027t tell me you\u0027ve gotten over your dancing issues?\"\"Dancing isn\u0027t so bad—with you. But I was thinking more of this,\"—and I pressed myself to him eventighter—\"of never having to let you go.\"\"Never,\" he promised, and he leaned down to kiss me. 　　It was a serious kind of kiss—intense, slow but building.... 　　I\u0027d pretty much forgotten where I was when I heard Alice call, \"Bella! It\u0027s time!\"I felt a brief flicker of irritation with my new sister for the interruption. 　　Edward ignored her; his lips were hard against mine, more urgent than before. My heart broke into asprint and my palms were slick against his marble neck. 　　\"Do you want to miss your plane?\" Alice demanded, right next to me now. \"I\u0027m sure you\u0027ll have a lovelyhoneymoon camped out in the airport waiting for another flight.\"Edward turned his face slightly to murmur, \"Go away, Alice,\" and then pressed his lips to mine again. 　　\"Bella, do you want to wear that dress on the airplane?\" she demanded. 　　I wasn\u0027t really paying much attention. At the moment, I simply didn\u0027t care. 　　Alice growled quietly. \"I\u0027ll tell her where you\u0027re taking her, Edward. So help me, I will.\"He froze. Then he lifted his face from mine and glared at his favorite sister. \"You\u0027re awfully small to be sohugelyirritating.\"\"I didn\u0027t pick out the perfect going-away dress to have it wasted,\" she snapped back, taking my hand. 　　\"Come with me, Bella.\"I tugged against her hold, stretching up on my toes to kiss him one more time. She jerked my armimpatiently, hauling me away from him. There were a few chuckles from the watching guests. I gave upthen and let her lead me into the empty house. 　　She looked annoyed. 　　\"Sorry, Alice,\" I apologized. 　　\"I don\u0027t blame you, Bella.\" She sighed. \"You don\u0027t seem to be able help yourself.\"I giggled at her martyred expression, and she scowled. 　　\"Thank you, Alice. It was the most beautiful wedding anyone ever had,\" I told her earnestly. \"Everythingwas exactly right. You\u0027re the best, smartest, most talented sister in the whole world.\"That thawed her out; she smiled a huge smile. \"I\u0027m glad you liked it.\"Renee and Esme were waiting upstairs. The three of them quickly had me out of my dress and intoAlice\u0027s deep blue going-away ensemble. I was grateful when someone pulled the pins out of my hair andlet it fall loose down my back, wavy from the braids, saving me from a hairpin headache later. Mymother\u0027s tears streamed without a break the entire time. 　　\"I\u0027ll call you when I know where I\u0027m going,\" I promised as I hugged her goodbye. I knew thehoneymoon secret was probably driving her crazy; my mother hated secrets, unless she was in on them. 　　\"I\u0027ll tell you as soon as she\u0027s safely away,\" Alice outdid me, smirking at my wounded expression. Howunfair, for me to be the last to know. 　　\"You have to visit me and Phil very, very soon. It\u0027s your turn to go south—see the sun for once,\" Reneesaid. 　　\"It didn\u0027t rain today,\" I reminded her, avoiding her request\"A miracle.\"\"Everything\u0027s ready,\" Alice said. \"Your suitcases are in the car—Jasper\u0027s bringing it around.\" She pulledme back toward the stairs with Renee following, still halfway embracing me. 　　\"I love you, Mom,\" I whispered as we descended. Tm so glad you have Phil. Take care of each other.\"\"I love you, too, Bella, honey.\"\"Goodbye, Mom. I love you,\" I said again, my throat thick. 　　Edward was waiting at the bottom of the stairs. I took his outstretched hand but leaned away, scanningthe little crowd that was waiting to see us off. 　　\"Dad?\" I asked, my eyes searching. 　　\"Over here,\" Edward murmured. He pulled me through the guests; they made a pathway for us. Wefound Charlie leaning awkwardly against the wall behind everyone else, looking a little like he was hiding. 　　The red rims around his eyes explained why. 　　\"Oh, Dad!\"I hugged him around the waist, tears streaming again—I was crying so much tonight. He patted myback. 　　\"There, now. You don\u0027t want to miss your plane.\"It was hard to talk about love with Charlie—we were so much alike, always reverting to trivial things toavoid embarrassing emotional displays. But this was no time for being self-conscious. 　　\"I love you forever, Dad,\" I told him. \"Don\u0027t forget that.\"\"You, too, Bells. Always have, always will.\"I kissed his cheek at the same time that he kissed mine. 　　\"Call me,\" he said. 　　\"Soon,\" I promised, knowing this was all I could promise. Just a phone call. My father and my mothercould not be allowed to see me again; I would be too different, and much, much too dangerous. 　　\"Go on, then,\" he said gruffly. \"Don\u0027t want to be late.\"The guests made another aisle for us. Edward pulled me close to his side as we made our escape. 　　\"Are you ready?\" he asked. 　　\"I am,\" I said, and I knew that it was true. 　　Everyone applauded when Edward kissed me on the doorstep. Then he rushed me to the car as the ricestorm began. Most of it went wide, but someone, probably Emmett, threw with uncanny precision, and Icaught a lot of the ricochets off Edward\u0027s back. 　　The car was decorated with more flowers that trailed in streamers along its length, and long gossamerribbons that were tied to a dozen shoes—designer shoes that looked brand-new—dangling behind thebumper. 　　Edward shielded me from the rice while I climbed in, and then he was in and we were speeding away asI waved out the window and called \"I love you\" to the porch, where my families waved back. 　　The last image I registered was one of my parents. Phil had both arms wrapped tenderly around Renee. 　　She had one arm tight around his waist but had her free hand reached out to hold Charlie\u0027s. So manydifferent kinds of love, harmonious in this one moment. It seemed a very hopeful picture to me. 　　Edward squeezed my hand. 　　\"I love you,\" he said. 　　I leaned my head against his arm. \u0027That\u0027s why we\u0027re here,\" I quoted him. 　　He kissed my hair. 　　As we turned onto the black highway and Edward really hit the accelerator, I heard a noise over thepurr of the engine, coming from the forest behind us. If I could hear it, then he certainly could. But he saidnothing as the sound slowly faded in the distance. I said nothing, either. 　　The piercing, heartbroken howling grew fainter and then disappeared entirely.","sourceLink":"http://novel.tingroom.com/jingdian/151/5975.html","bookId":740,"book":{"id":740,"title":"暮光之城：破晓 Breaking Dawn","description":"简介： Bella and Edward are married, but their honeymoon is cut short when Bella discovers that she is pregnant. Her pregnancy progresses rapidly, severely weakening her. She nearly dies giving birth to her and Edward\u0027s half-vampire-half-human daughter, Rene...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1292209551bf31c.jpg","type":"Children\u0027s","link":"http://novel.tingroom.com/jingdian/151","creation":"Aug 1, 2019 12:19:15 AM","modification":"Aug 1, 2019 12:19:15 AM"}}
