{"id":68439,"no":15,"title":"Page 15","content":"The sad reality was that after many temporary fixes, her car was dead. There was no possibility of reviving it. The junkyard had offered her a flat hundred bucks and she took it. That hundred dollars, however, wasn’t going to provide reliable transportation. Her only recourse was to ask for a loan—and the only person she could approach was her sister, Teri.\\n\\n With a knot in her stomach, Christie made the call. Teri answered so quickly, she must’ve been sitting next to the phone.\\n\\n “Can you talk?” she asked, trying to keep any hint of anxiety out of her voice.\\n\\n “Sure. What’s up?”\\n\\n “I’d rather do this face-to-face,” Christie told her. She felt like weeping, which was an anomaly on its own. She didn’t easily give in to emotion. Oh, she’d cried her share of tears, but generally it took a crisis like having her bank account emptied by some low-life scum she’d been convinced she could reform. She’d wept buckets over that, and her divorce, too. What upset her this time was the fact that it wasn’t a man but a stupid car.\\n\\n “Come on by,” Teri said. “I’d love the company.”\\n\\n “That’s…the problem. I don’t have a car.”\\n\\n “What happened?”\\n\\n Christie didn’t want to go into all of that now. “Has Bobby hired a new driver?”\\n\\n “Not yet. Bobby’s positive James will return. I—”\\n\\n “Please don’t talk about James,” she interrupted stiffly. Even his name was enough to make her stomach tense.\\n\\n “Okay, if that’s the way you want it.”\\n\\n “Ido.”\\n\\n “Take a taxi to the house and I’ll pay for it.”\\n\\n Although Christie appreciated the offer, she refused to do that. “I’ll take the bus.”\\n\\n “Christie, don’t be silly.”\\n\\n “It’s no problem. Buses run regularly this time of day.”\\n\\n Still Teri hesitated. “I’d come and get you myself but the doctor doesn’t want me driving.”\\n\\n Christie wasn’t surprised. Teri was due in May, although with triplets she’d probably deliver early. “When did he say you couldn’t drive?”\\n\\n “At my last visit. Doc wants to play it safe. Okay, I know it’s for a good reason, but I have to tell you I’m going crazy sitting around the house. I could definitely use a distraction.”\\n\\n “I’ll be there as soon as I can.”\\n\\n “Grab a taxi,” Teri insisted again.\\n\\n “I’ll think about it.” Actually, Christie already had and she’d dismissed the idea. She was coming to Teri for a loan as it was and she didn’t want her sister having to open her wallet for cab fare before they’d even begun the conversation. And no way was she spending fifteen hard-won dollars herself if she didn’t have to.\\n\\n There was nothing wrong with the bus. She would normally have considered it for transportation to her job, but she worked the early shift at Wal-Mart and the bus schedule was extremely limited at that time of the morning.\\n\\n The queasiness in her stomach hadn’t lessened as she made the long trek down Teri and Bobby’s driveway. Walking to the house, she automatically glanced at the garage and the apartment above it, where James had once lived. She chastised herself for looking.\\n\\n James was out of her life, out of all their lives. Bobby might be deluding himself that his driver and best friend would return. Best friend, now that was a joke. Some friend James had been!\\n\\n When she finally reached the door and rang the bell, her nose had lost feeling. Her winter jacket was little protection against the wind, which seemed to slice straight through her. She kept her hands clenched in her pockets for warmth.\\n\\n “You’re frozen!” Teri shrieked when she saw her. “I told you to take a cab.”\\n\\n Rather than start an argument, Christie conceded. “Yeah, I should have.”\\n\\n “Come in, come in.” Teri pulled her into the house and helped her off with her coat and gloves.\\n\\n Mutely Christie followed her sister into the kitchen and gladly accepted a mug of hot herbal tea. The first sip burned all the way down her throat, but Christie didn’t care. The taste and aroma of the tea revived her.\\n\\n Slipping onto a stool at the breakfast bar, she braced her elbows there, clutching the mug with both hands, as she considered the best approach to asking her sister for the loan. This was even more difficult than she’d expected. It made her feel like such a failure when she was working so hard to get her life on track. Her credit had been ruined by yet another deadbeat she’d thought she could transform. There’d been a transformation, all right—a negative one. The guy had become an even bigger jerk, and he’d ripped her off, to boot. Why was it lessons like this had to be so painful, with consequences that lingered for years?\\n\\n Teri seemed to be waiting for her to say something.\\n\\n “I took your advice,” she said conversationally.\\n\\n Teri set her mug on the counter and clambered onto the stool directly across from her. “What advice was that?”\\n\\n “Remember when you said I should make some positive changes in my life? You were right. I’ve signed up for two courses at the community college in Bremerton.”\\n\\n “Really?” Teri seemed impressed.\\n\\n Actually, Christie was impressed with herself. “I never figured I’d be hanging around a college campus at my age.”\\n\\n “You’re not old.”\\n\\n Christie laughed. “I am compared to most of those kids.” Shaking her head, she sighed. “Were we ever that young?”\\n\\n “We were born old,” Teri said with a sad look. “The education we got wasn’t in history or literature, it was in the ways of the world.”\\n\\n That was true. Having grown up with an alcoholic mother and a series of stepdads and “uncles,” Christie knew they’d both been robbed of a normal childhood.\\n\\n “So tell me—” Teri changed the subject “—what are you taking?”\\n\\n Christie’s heart raced with excitement as she said the word. “Photography.”\\n\\n Teri’s eyes widened. “Why photography? I didn’t know you had any interest in that.”\\n\\n “I didn’t until recently.” She might as well let it all out. “I went in to the agent to pay my car insurance premium—while I still had a car—and he was on the phone.” It’d been one of those rare instances, Christie realized later, when an opportunity had presented itself at precisely the right moment. “He was bemoaning the fact that there isn’t anyone locally to document household inventory for home insurance purposes.”\\n\\n “So…”\\n\\n “So when he got off the phone, I asked him what would be involved in learning to do this, and he told me. On his advice, I registered for Basic Photography and Elementary Business. He said if I was willing to follow through, he had two assignments coming up that he could give me. Plus, he’d pass the word along to other agents in town.”\\n\\n “That’s great!”\\n\\n Christie shrugged. “I started the class last week and there’s a lot more to taking a picture than you’d think. This isn’t just point and shoot. I have to learn about lighting and lenses and all kinds of stuff.”\\n\\n “But you’ll get there.”\\n\\n Teri’s confidence in her was reassuring. Christie sipped her tea again, then decided she couldn’t delay this any longer. With a deep breath, she looked up at her sister.\\n\\n “Do you know why I’m here?”\\n\\n Teri didn’t answer; instead, she reached for her own tea. Her dark hair was pulled away from her face and secured at the nape of her neck and she wore no makeup at all. Under ordinary circumstances she wouldn’t consider herself dressed without styling her hair and applying lip gloss. That was the bare minimum.\\n\\n “Do you really want to play guessing games?” her sister asked.\\n\\n “No.” Christie straightened and met her eyes. “I need a loan.”\\n\\n There, it was out, although the words had nearly stuck in her throat.\\n\\n “How much?”\\n\\n “I need reliable transportation.”\\n\\n “You mean a new car?”\\n\\n “Yes. Well, no. A used car.”\\n\\n “Have you found one?”\\n\\n “Not yet…”\\n\\n “Will five thousand be enough?” Teri asked.\\n\\n Christie nearly swallowed her tongue. “No.”\\n\\n “Ten?”\\n\\n “No, no, I meant five thousand would be far too much.” Christie fully intended to pay back every penny, with interest. If her credit rating hadn’t been ruined, she would’ve applied for a bank loan. But that was out of the question now. Reestablishing her credit was taking far longer than she’d thought it would.\\n\\n “Three thousand?”\\n\\n “I was thinking more along the lines of one thousand,” Christie said. She should be able to repay that amount within a reasonable period of time.\\n\\n “That’s not enough! You’d only be getting yourself another junker. We’ll begin with five thousand,” Teri insisted.\\n\\n “Teri…I can’t.”\\n\\n “You can and you will, and that’s the end of it.”\\n\\n Undecided, Christie bit her lip. “You’ll want to talk this over with Bobby.”\\n\\n Teri sipped her tea. “I already did. He only had one stipulation.”\\n\\n Maybe Christie should’ve been surprised that her sister had known the purpose of her visit, but she wasn’t. “Which is?”\\n\\n “That you let someone help you.”\\n\\n “In what way?”\\n\\n “Finding the right car.”\\n\\n “Okay.” She didn’t want to admit how inadequate she felt when it came to purchasing a vehicle. Generally she looked at the interior. The cleanliness and appearance of the car indicated how well the previous owner had cared for the engine—at least, that was her theory. Perhaps not a very accurate basis for judgment, but Christie knew next to nothing about anything mechanical.\\n\\n “Who?”\\n\\n “Bobby has a friend who’d be willing to do the research.”\\n\\n “What’s his name?”\\n\\n “It’s a guy in the business. Let Bobby handle it, okay?”\\n\\n “Okay.” Christie had no objection to that; in fact, she was grateful. “Fine by me. If this guy doesn’t mind, have him pick it out and buy it. I don’t need to be there,” she told her sister. Besides, between her job at Wal-Mart and her photography and business classes, she didn’t have spare time to be running around checking out used cars.\\n\\n Then, because she was afraid she hadn’t adequately expressed her gratitude, Christie added, “Thank you.” Her voice trembled.\\n\\n “I want to help,” Teri said. “You’re my sister.”\\n\\n “I’m so glad I have a sister.” For far too long they’d done their best to ignore each other.\\n\\n “I’ll sign loan documents.” Christie had a stipulation of her own. She wasn’t a charity case and wanted Teri to understand she wouldn’t accept this money as a gift. This was a loan and an opportunity to prove herself. “I’m going to pay that money back, plus interest.” \\n\\n","sourceLink":"https://allnovel.net/92-pacific-boulevard-cedar-cove-9/page-15.html","bookId":1951,"book":{"id":1951,"title":"92 Pacific Boulevard (Cedar Cove #9)","description":"Storyline: 92 Pacific Boulevard (Cedar Cove #9) \\n Olivia Lockhart-GriffinCedar Cove, Washington \\n Dear Listener, \\n I\u0027m sorry to say that our good sheriff, Troy Davis, has suffered a disappointment in love. He was hoping to marry his onetime girlfriend, Faith Beckwith, who recently moved back to town. Well, the latest is that Faith ended the relationship last month, even though both of them are widowed and available. According to Troy, there were a few misunderstandings between them?some inadvertently caused, it seems, by his daughter, Megan. \\n Troy\u0027s got plenty to keep him occupied, though?like the unidentified remains found in a cave outside town. And the break-ins at 204 Rosewood Lane, the house Faith just happens to be renting from Grace Harding?. \\n All of that\u0027s a distraction from what\u0027s happening in my life. I\u0027m going through chemo right now, and I\u0027m so grateful for my husband, Jack, my family and my friends, who give me the strength and support I need to beat this. But beat it I will! \\n I\u0027d suggest meeting at Troy\u0027s place, 92 Pacific Boulevard, so we can all talk, but the Pancake Palace is probably a better choice if you want a decent cup of coffee! \\n Olivia\\n","cover":"https://allnovel.net/images/92-pacific-boulevard-cedar-cove-9.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/92-pacific-boulevard-cedar-cove-9.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:08:31 AM"}}
