{"id":110546,"no":22,"title":"Page 22","content":"\"How did you get away from the cannibals?\" Bill asked.\n \"Same as you two,\" Tyler said. \"I ran my ass off and didn\u0027t look back.\"\n Mortimer grinned. \"So you decided to sign on with Armageddon, eh?\"\n \"I\u0027ve always worked for Armageddon,\" Tyler said. \"Who do you think owned the Muscle Express?\"\n A man popped his head through the sunroof of another Cooper, holding a set of headphones to one ear. \"They\u0027re starting engines, boss. We\u0027d better crank \u0027em up.\"\n \"Good seeing you\u0027re alive,\" Tyler said. \"Got to go.\"\n \"Wait,\" Mortimer said. \"Malcolm said you might have room for us.\"\n Tyler nodded. \"I have room in my car. Jimmy needs a gunner too.\" She pointed to the Cooper all the way at the end of the line.\n Sheila elbowed her way into the conversation. \"Me too.\"\n \"Don\u0027t need anyone else,\" Tyler said.\n \"I\u0027m not being left behind.\"\n \"You can sit in the passenger side of my car,\" Tyler said. \"But if you get in the way of my driving, I\u0027ll pull over and dump your ass on the side of the road.\"\n Bill laughed. \"That\u0027s the charm school dropout I remember.\"\n THE ROAD WARRIORS\n LI\n The semithunderous whine of fifty-one Toyota hybrids and ten MINI Coopers flying south on I-75 was surprisingly impressive. Mortimer had not traveled this fast in years. Even the Muscle Express hadn\u0027t topped more than forty miles per hour. The MINI Cooper, with the steely-eyed Tyler behind the wheel, ate up the highway at seventy.\n \"Isn\u0027t this a little fast for this fog?\" Mortimer asked.\n \"Advance scouting reports the road clear of debris,\" Tyler said. \"General Malcolm is hoping those underground people really threw off the Czar\u0027s schedule. If we swoop in fast enough we might catch them before they\u0027re set. Here, you\u0027re going to need this if you want to follow the play-by-play.\" She handed a set of headphones back over her shoulder.\n Mortimer put them on, adjusted the microphone in front of his mouth.\n Tyler\u0027s voice crackled in his ear. \"The radio has been rigged with a few different settings. Right now we\u0027re just talking to each other. I can flip a switch to talk to the five Coopers in Blue Group, or I flip another switch and get the whole attack force, or hear Malcolm\u0027s orders or whatever. It\u0027s all plugged into the car\u0027s electrical system.\"\n \"What do you want me to do back here when the trouble starts?\" Mortimer asked.\n \"The MINI is too small to mount a heavy machine gun,\" Tyler told him. \"But there\u0027s an H \u0026K full-auto 9 mm back there and a shitload of ammo. They extended the moonroof to the backseat, so you can pop up and give them hell, especially if some joker gets on my tail. Just don\u0027t fly out if I take a sharp turn.\" To Sheila she said, \"You can reload for him, make sure he\u0027s always got a fresh magazine.\"\n Sheila gave the thumbs-up. \"Okay.\"\n \"I\u0027ll need you to cut the chatter while I tune in the ball game. Maybe we can get the score.\" Tyler flipped to the main channel.\n \"-and get that first group in tight when you see them,\" came Malcolm\u0027s hard-edged voice through the headphones. \"If we catch them in camp, then rip through and turn around for another pass as soon as possible. Don\u0027t let them mount up, whatever you do. If they\u0027ve already hit the road, then we\u0027ll have to do it toe to toe, in which case keep your radios clear because I\u0027m going to be issuing orders on the fly.\"\n Mortimer slapped a fresh magazine into the H \u0026K, stuck two more into his belt so he could grab them quickly. He reached into his shirt pocket for the cigar Bill had given him, bit the end and stuck it in his mouth. He tapped Sheila on the shoulder, gestured to the cigarette lighter. She pressed it in, waited, and it popped out a few seconds later. She handed it back to Mortimer, who puffed the cigar to life, then handed the lighter back to her.\n Tyler smelled the smoke, wrinkled her nose and glanced in the rearview mirror. She put a hand over her microphone and said, \"Those things will kill you.\"\n Mortimer cocked the H \u0026K. \"Gee, and I\u0027m usually such a careful guy.\"\n A grin flickered at the corners of Tyler\u0027s mouth. Just for a second.\n Mortimer stuck his head up through the moonroof, the wind ripping at him. He looked around to get his bearings. The Blue Group of MINI Coopers held together in a tight formation, Tyler\u0027s in the middle, one on either side, one in the front and one in the back. Mortimer looked at the MINI behind them, saw Bill\u0027s head sticking up through the moonroof, his Union hat tied on with a strip of rawhide under his chin. They traded thumbs-ups and Mortimer ducked back into the car.\n The headphones crackled. \"Big Duck, this is Silverfish, we have movement on the overpass just ahead, now we\u0027ve passed it, looking back. Can\u0027t get a count, Big Duck.\"\n Suddenly a flurry of voices on the radio. Mortimer could barely follow it.\n ¨C \"I read you, Silverfish. Bullfrog, stay in formation. Slow it down, Dragonfly.\"\n ¨C \"Big Duck, this is Dragonfly. I\u0027m way in the back. Already going pretty slow.\"\n ¨C Malcolm cursed. \"Well who the hell is this on my left?\"\n ¨C \"Willow Switch, sir.\"\n ¨C \"I thought I was Willow Switch,\" came another voice.\n ¨C \"We traded, remember? You wanted to be Iron Man.\"\n ¨C \"Big Duck, this is Starfish. What about me? I can\u0027t see if I\u0027m in formation or not.\"\n ¨C \"This is Big Duck. I thought you were on point, Starfish.\"\n ¨C \"No, that\u0027s Silverfish.\"\n ¨C \"Babble Fish, here. Did you just radio to me? I was getting some apple juice.\"\n ¨C \"Goddamn it, everyone shut the hell up!\" Malcolm shouted. \"I knew I shouldn\u0027t have let you pick your own call signs. Silverfish, stay on point.\"\n ¨C \"Multiple sightings, multiple sightings, Big Duck. We have Red Stripes on the next two overpasses. I count at least a dozen, maybe-\"\n ¨C \"Everyone, tighten up,\" Malcolm ordered. \"Keep sharp.\"\n Far ahead, Mortimer saw a section of the fog glow bright orange with the sound of an explosion. Two more quick explosions followed.\n ¨C \"Goddamn, Larry\u0027s on fire, I can\u0027t see-\"\n ¨C \"-mortars, I think. Where the hell did they get-\"\n ¨C \"Lost a tire, for Christ\u0027s sake, I can\u0027t steer this fucking thing-\"\n More explosions, almost on top of them now.\n Tyler flipped the radio to the Blue Group setting. \"Buckle up and spread out. Jimmy, I said spread out, but maintain speed, okay? You\u0027ve got to keep up.\"\n ¨C \"Sorry, boss.\"\n Tyler switched back to the main channel.\n ¨C \"-put some goddamn fire on those overpasses, make them duck their heads. The rest of you people spread out and keep going and we\u0027ll get through them as quickly as possible.\"\n Another explosion to Mortimer\u0027s left. He winced at the flash. Two more mortar rounds chewing up highway to his right.\n ¨C \"Silverfish here, I got headlights a hundred yards, a dozen pair easy, whoa! No, make that a lot more. Here they come, Big Duck.\"\n ¨C \"Get back with the group, Silverfish. You can\u0027t do any more out there on point, and your ass is hanging in the wind.\"\n A ball of fire erupted in front of them. Tyler yelled and swerved. A MINI Cooper from Yellow Group was tossed into the air, the flaming wreckage passing over Mortimer and obliterating the blue Cooper directly to Mortimer\u0027s left. The Cooper behind him swerved sharply, tires squealing, debris strewing fifty yards in a line of flame and smoke.\n ¨C \"Jesus, that was Eddie.\"\n ¨C \"Cut the chatter-\"\n ¨C \"Look out, they\u0027re already-\"\n ¨C \"This is Big Duck. Everyone shut the fuck up right now. I\u0027m looking at trucks, V-8\u0027s, big stuff. Do not engage head-on, repeat, take \u0027em on the side streets if you can. You can\u0027t take these guys with speed or muscle, so it\u0027s going to have to be maneuverability. If you can-shit!\"\n Another series of explosions, machine-gun fire, flashes ahead in the fog. They passed a half-dozen demolished hybrids, still aflame. Mortimer\u0027s heart pounded in his throat. He saw Sheila sitting rigid in the passenger seat, Tyler\u0027s knuckles white on the steering wheel.\n It came out of the fog like a charging bull, smashed through the left front quarter of a Yellow Group Cooper, sending it spinning off into the guardrail. A V-8 Mustang Mach 1. The engine roared. It had iron plates riveted across the front to guard the engine, more armor on the windshield, with only narrow slits for the driver to see through.\n Tyler jerked the wheel, and the Mustang missed by an inch, passed them and immediately screeched the tires in a fishtail, coming back for them.\n Tyler flipped to the channel for Blue Group. \"Jimmy, you\u0027re with me. The rest of you stay with the attack force. You there, Jimmy?\"\n ¨C \"Right on your six, boss.\"\n \"This exit. Here we go.\"\n She took three lanes sharply, barely making the off-ramp in time, scraping the curb as she took the turn at the bottom, flying past a defunct gas station and a doughnut shack. Mortimer looked behind. Jimmy was right there, the Mustang right behind him.\n ¨C \"He\u0027s right on me, boss. Jesus, he\u0027s coming fast.\"\n Mortimer saw Bill pop up through the moonroof. The machine pistol bucked in Bill\u0027s hand, a three-foot jet of fire pulsing from the barrel. The lead sparked off the Mustang\u0027s armor, doing it no damage, but apparently catching it by surprise. It swerved slightly, slowed its pursuit.\n An arm came out the passenger window of the Mustang holding a weapon, rattled bullets at them. Mortimer ducked back into the car.\n Tyler slammed on the brakes, fishtailed, turned suddenly down a residential street. Jimmy stayed right with her. The Mustang couldn\u0027t make the turn so sharply, went wide and chewed up a line of mailboxes before wrenching itself back onto the street.\n \"Split up, Jimmy!\"\n ¨C \"Bad idea, boss.\"\n \"We\u0027ll never get a good shot at the thing if we\u0027re both running away from it. Now go,\" Tyler ordered.\n ¨C \"See you on the flip side.\"\n Jimmy turned abruptly down a cross street. The Mustang never wavered, pushed the gas hard and came up behind Mortimer fast. Tyler turned, accelerated, turned again, zigzagging through what had once been a middle-class neighborhood. Malcolm had been right. The big bruisers had speed and muscle but couldn\u0027t maneuver so well, and every time Tyler took a sharp turn, the Mustang lost twenty yards.\n But the muscle car made up for it on the straightaways, the big engine howling as the Mustang pulled within three feet of the Cooper\u0027s rear bumper, the faceless assailant in the passenger\u0027s seat shooting wildly.\n Sheila had her hands over her eyes.\n Tyler was a taut, wired mass of muscle and sinew. She jerked the wheel suddenly, and the Cooper whipped into a circular driveway. Tyler tapped the brakes, slowed the vehicle only slightly, and the Mustang shot past on the street. Tyler stomped the accelerator.\n She shot out of the driveway, back onto the street, right behind the Mustang.\n \"Blast \u0027em,\" she shouted at Mortimer.\n He popped out of the moonroof and unleashed the H \u0026K, emptying a full clip in three seconds, ejecting it and slamming in a new one. He puffed the cigar like a lunatic locomotive. The Mustang had been modified for attack, not defense, and the exposed rear window presented an irresistible target. Mortimer fired, and the glass shattered. He fired again, and a neat row of holes appeared along the roof with metallic tunks.\n The Mustang slammed on the brakes.\n \"Shit!\" Tyler hit the brakes too.\n Not fast enough. The MINI slammed hard, crunching the front end. Mortimer pitched forward, managed to hang on instead of flying over the MINI\u0027s hood. The cigar flew out of his mouth. Tyler threw the car into reverse, backed up at full speed, headlight glass and the front bumper on the ground in front of them.\n By the time the Mustang made its slow turn, the Cooper was flying back the way it had come. Soon the muscle car was on the Cooper\u0027s bumper again. Tyler resumed the zigzag strategy, but finally made a wrong turn into a cul-de-sac.\n \"Oh, fuck,\" Sheila said. \n","sourceLink":"https://allnovel.net/go-go-girls-of-the-apocalypse/page-22.html","bookId":1578,"book":{"id":1578,"title":"Go-Go Girls of the Apocalypse","description":"Storyline: \n Mortimer Tate was a recently divorced insurance salesman when he holed up in a cave on top of a mountain in Tennessee and rode out the end of the world. Go-Go Girls of the Apocalypse begins nine years later, when he emerges into a bizarre landscape filled with hollow reminders of an America that no longer exists. The highways are lined with abandoned automobiles; electricity is generated by indentured servants pedaling stationary bicycles. What little civilization remains revolves around Joey Armageddon\u0027s Sassy A-Go-Go strip clubs, where the beer is cold, the lap dancers are hot, and the bouncers are armed with M16s. \n Accompanied by his cowboy sidekick Buffalo Bill, the gorgeous stripper Sheila, and the mountain man Ted, Mortimer journeys to the lost city of Atlanta -- and a showdown that might determine the fate of humanity.\n \n","cover":"https://allnovel.net/images/go-go-girls-of-the-apocalypse.jpg","author":"Victor Gischler","type":"Humorous","source":"allnovel","link":"https://allnovel.net/go-go-girls-of-the-apocalypse.html","creation":"Oct 5, 2019 8:57:45 AM","modification":"Oct 6, 2019 12:00:09 AM"}}
