{"id":95775,"no":36,"title":"Page 36","content":"“Oh,” he said.\\n\\n “It couldn’t wait, and who knew where you were or when you’d be back? You should really call in when you leave town.”\\n\\n “I didn’t think of it.”\\n\\n “Well, why would you? You never leave town.\\n\\n When’s the last time you had a vacation?”\\n\\n “I’m on vacation most of my life,” he said. “Right here in New York.”\\n\\n “Then I guess it was about time you went away for something besides work. I suppose you had company.”\\n\\n “Well…”\\n\\n “Good for you, Keller. It’s just as well I couldn’t reach you. But next time…”\\n\\n “Next time I’ll keep you posted,” he said. “Better than that, next time I’ll bring home a seashell.”\\n\\n This time he didn’t try to track the story in the papers. Even if Pompano Beach had a newspaper of its own, you couldn’t expect to find it at the UN newsstand. They’d have theMiami Herald there, but somehow he didn’t figure theHerald ran a story every time an old fellow drifted off in the sunshine. If they did, there’d be no room left in the paper for hurricanes and carjackings.\\n\\n Besides, why did he want to read about it? He had carried out his mission and the traitor was dead. That was all he had to know.\\n\\n It was almost two months before Bascomb got in touch again. This time there was no face-to-face contact, however fleeting.\\n\\n Instead, Keller got a phone call. The voice was presumably Bascomb’s, but he couldn’t have sworn to it. The call was brief, and the voice never rose much above a low murmur.\\n\\n “Stay home tomorrow,” the voice said. “There’ll be something delivered to you.”\\n\\n And in fact the FedEx guy came around the following morning, bringing a flat cardboard envelope that held a photograph, an index card with a name and address printed on it, and a sheaf of used hundreds.\\n\\n There were ten of the bills, a thousand dollars again, although the address this time was in Aurora, Colorado, which involved quite a few more air miles than Pompano Beach. That rankled at first, but when he thought about it he decided there was something to be said for the low payment. If you lost money every time you did this sort of thing, it underscored your commitment to your role as a patriot. You never had to question your motives, because it was clear you weren’t in it for the money.\\n\\n He squared up the bills and put them in his wallet, then took a good long look at the photo of the latest traitor.\\n\\n And the phone rang.\\n\\n Dot said, “Keller, I’m lonesome and there’s nothing on TV but Sally Jessy Raphae ël. Come on out here and keep me company.”\\n\\n Keller took a train out to White Plains and another one back to New York. He packed a bag, called an airline, and took a cab to JFK. That night his plane landed in Seattle, where he was met by a lean young man in a double-breasted brown suit. The fellow wore a hat, too, a fedora that gave him a sort of retro look.\\n\\n The young man-Jason, his name was-dropped Keller at a hotel. In the morning they met in the lobby, and Jason drove him around and pointed out various points of interest, including the Kingdome and the Space Needle and the home and office of the man Keller was supposed to kill. And, barely visible in the distance, the snow-capped peak of Mount Rainier.\\n\\n They ate lunch at a good downtown restaurant, and Jason put away an astonishing amount of food. Keller wondered where he put it. There wasn’t a spare ounce on him.\\n\\n The waitress was refilling the coffee when Jason said, “Well, I was starting to wonder if we missed him today. Just coming through the door? Gray suit, blue tie? Big red face on him? That’s Cully Wilcox.”\\n\\n He looked just like his photo. It never hurt, though, to have somebody ID the guy in the flesh.\\n\\n “He’s a big man in this town,” Jason said, his lips barely moving. “Harder they fall, right?”\\n\\n “I beg your pardon?”\\n\\n “Isn’t that the expression? ‘The bigger they are, the harder they fall’?”\\n\\n “Oh, right,” Keller said.\\n\\n “I guess you don’t feel like talking right now,” Jason said. “I guess you got things to think about, details to work out.”\\n\\n “I guess so,” Keller said.\\n\\n “This may take a while,” he told Dot. “The subject is locally prominent.”\\n\\n “Locally prominent, is he?”\\n\\n “So they tell me. That means more security on the way in and more heat on the way out.”\\n\\n “Always the way when it’s somebody big.”\\n\\n “On the other hand, the bigger they are, the harder they fall.”\\n\\n “Whatever that means,” she said. “Well, take your time, Keller. Smell the flowers. Just don’t let the grass grow under your feet.”\\n\\n Hell of a thing, Keller thought.\\n\\n He muted the TV just in time to stop a cute young couple from advising him that Certs was two, two, two mints in one. He closed his eyes and adapted the dialogue to his own circumstances.“Keller is a contract killer.” “No, Keller is a traitor killer.” “He’s two, two, two killers in one… ”\\n\\n It was tough enough, he thought, to lead one life at a time. It was a lot trickier when they overlapped. He couldn’t stall the old man, couldn’t put off the trip to Seattle while he did his Uncle Sam’s business in Colorado. But how long could he delay the mission? How urgent was it?\\n\\n He couldn’t call Bascomb to ask him. So he had to assume a high degree of urgency.\\n\\n Which meant he had to find a way to do two, two, two jobs in one.\\n\\n Just what he needed.\\n\\n It was a Saturday morning, a week and a half after he’d flown to Seattle, when Keller flew home. This time he had to change planes in Chicago, and it was late by the time he got to his apartment. He’d already called White Plains the night before to tell them the job was done. He unpacked his bag, shucked his clothes, took a hot shower, and fell into bed.\\n\\n The following afternoon the phone rang.\\n\\n “No names, no pack drill,” said Bascomb. “I just wanted to sayWell done. ”\\n\\n “Oh,” Keller said.\\n\\n “Not our usual thing,” Bascomb went on, “but even a seasoned professional can use the occasional pat on the back. You’ve done fine work, and you ought to know it’s appreciated.”\\n\\n “That’s nice to hear,” Keller admitted.\\n\\n “And I’m not just speaking for myself. Your efforts are appreciated on a much higher level.”\\n\\n “Really?”\\n\\n “On the highest level, actually.”\\n\\n “The highest level?”\\n\\n “No names, no pack drill,” Bascomb said again, “but let’s just say you’ve earned the profound gratitude of a man who never inhaled.”\\n\\n He called White Plains and told Dot he was bushed. “I’ll come out tomorrow around lunchtime,” he said. “How’s that?”\\n\\n “Oh, goody,” she said. “I’ll make sandwiches, Keller. We’ll have a picnic.”\\n\\n He got off the phone and couldn’t think what to do with himself. On a whim he took the subway to the Bronx and spent a few hours at the zoo. He hadn’t been to a zoo in years, long enough for him to have forgotten that they always made him sad.\\n\\n It still worked that way, and he couldn’t say why. It’s not that it bothered him to see animals caged. From what he understood, they led a better life in captivity than they did in the wild. They lived longer and stayed healthier. They didn’t have to spend half their time trying to get enough food and the other half trying to keep from being food for somebody else. It was tempting to look at them and conclude that they were bored, but he didn’t believe it. They didn’t look bored to him.\\n\\n He left unaccountably sad as always and returned to Manhattan. He ate at a new Afghan restaurant and went to a movie. It was a western, but not the sort of Hollywood classic he would have preferred. Even after the movie was over, you couldn’t really tell which ones were the good guys.\\n\\n Next day Keller caught an early train to White Plains and spent forty minutes upstairs with the old man. When he came downstairs Dot told him there was fresh coffee made, or iced tea.\\n\\n He went for the coffee. She already had a tall glass of iced tea poured for herself. They sat at the kitchen table and she asked him how it had gone in Seattle. He said it went okay.\\n\\n “And how’d you like Seattle, Keller? From what I hear it’s everybody’s city du jour these days. Used to be San Francisco and now it’s Seattle.”\\n\\n “It was fine,” he said.\\n\\n “Get the urge to move there?”\\n\\n He had found himself wondering what it might be like, living in one of those converted industrial buildings around Pioneer Square, say, and shopping for groceries at Pike Market, and judging the quality of the weather by the relative visibility of Mount Rainier. But he never went anywhere without having thoughts along those lines. That didn’t mean he was ready to pull up stakes and move.\\n\\n “Not really,” he said.\\n\\n “I understand it’s a great place for a cup of coffee.”\\n\\n “They’re serious about their coffee,” he allowed. “Maybe too serious. Wine snobs are bad enough, but when all it is is coffee… ”\\n\\n “How’s that coffee, by the way?”\\n\\n “It’s fine.”\\n\\n “I bet it can’t hold a candle to the stuff in Seattle,” she said. “But the weather’s lousy there. Rains all the time, the way I hear it.”\\n\\n “There’s a lot of rain,” he said. “But it’s gentle. It doesn’t bowl you over.”\\n\\n “It rains but it never pours?”\\n\\n “Something like that.”\\n\\n “I guess the rain got to you, huh?”\\n\\n “How’s that?”\\n\\n “Rain, day after day. And all that coffee snobbery. You couldn’t stand it.”\\n\\n Huh? “It didn’t bother me,” he said.\\n\\n “No?”\\n\\n “Not really. Why?”\\n\\n “Well, I was wondering,” she said, looking at him over the brim of her glass. “I was wondering what the hell you were doing in Denver.”\\n\\n The TV was on with the sound off, tuned to one of the home shopping channels. A woman with unconvincing red hair was modeling a dress. Keller thought it looked dowdy, but the number in the lower right corner kept advancing, indicating that viewers were calling in a steady stream to order the item.\\n\\n “Of course I could probablyguess what you were doing in Denver,” Dot was saying, “and I could probably come up with the name of the person you were doing it to. I got somebody to send me a couple of issues of theDenver Post, and what did I find but a story about a woman in someplace called Aurora who came to a bad end, and I swear the whole thing had your fingerprints all over it. Don’t look so alarmed, Keller. Not your actual fingerprints. I was speaking figuratively.”\\n\\n “Figuratively,” he said.\\n\\n “It did look like your work,” she said, “and the timing was right. I’d say it might have lacked a little of your usual subtlety, but I figure that’s because you were in a big hurry to get back to Seattle.” He pointed at the television set. He said, “Do you believe how many of those dresses they’ve sold?” \\n\\n","sourceLink":"https://allnovel.net/hit-man-keller-1/page-36.html","bookId":2312,"book":{"id":2312,"title":"Hit Man (Keller #1)","description":"Storyline: Hit Man (Keller #1) \\n Keller is an assassin – he is paid by the job and works for a mysterious man who nominates hits and passes on commissions from elsewhere. Keller goes in, does the job, gets out: usually at a few hours’ notice . . . Often Keller’s work takes him out of New York to other cities, to pretty provincial towns that almost tempt him into moving to the woods and the lakeshores. Almost but not quite. \\n But then one job goes wrong in a way Keller has never imagined and it leaves him with a big problem. Finding himself with an orphan on his hands, Keller\u0027s job begins to interfere with his carefully guarded life. And once you let someone in to your life, they tend to want to know what you do when you\u0027re away. And killing for a living, lucrative though it is, just doesn\u0027t find favour with some folks.\\n","cover":"https://allnovel.net/images/hit-man-keller-1.jpg","author":"Lawrence Block","type":"Thriller","source":"allnovel","link":"https://allnovel.net/hit-man-keller-1.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:16:32 PM"}}
