{"id":1922,"no":14,"title":"Chapter 14","content":"There was never any end to it. The Quarter was like a tight gravitational system, with many small bodies swinging around each other in eccentric orbits, and the whole shrinking in upon itself as time went on, so that it grew more and more certain that one collision would engender half a dozen more. And in the mind, too, each event went on forever. Cudyk remembered Burgess, in the stretcher as he was being carried home, weeping silently because he had failed to kill the man who had murdered his daughter\u0027s lover. And he remembered Rack, sitting silent and weary as he waited for Moskowitz to attend to him: sitting without anger for the man who had shot him, sitting with patience, filled with his own inner strength. And De Grasse, tortured soul, who had once more shown himself willing to sacrifice himself to any loyalty he felt. Even Monk, even Spider, lived not for himself but for Rack. There were all the traditional virtues, dripping their traditional gore: nobility, self-sacrifice, patience, even generosity. By any test except the test of results, Rack was a great man and Burgess another. And the test of results was a two-edged razor: for by that test, Cudyk himself was a total failure, a nonentity. He thought, We are the hollow men, we are the stuffed men.... When every action led to disaster, those who did nothing were damned equally with those who acted. \n \n","sourceLink":"http://novel.tingroom.com/kehuan/2922/80396.html","bookId":71,"book":{"id":71,"title":"The Earth Quarter","description":"简介： The sun had set half an hour before. Now, from the window of Laszlo Cudyk\u0027s garret, he could see how the alien city shone frost-blue against the black sky; the tall hive-shapes that no man would have built, glowing with their own light....","cover":"https://cunovel.com/defaultCover.png","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/2922","creation":"Aug 1, 2019 12:18:14 AM","modification":"Aug 1, 2019 12:18:14 AM"}}
