{"id":70470,"no":14,"title":"Page 14","content":"“Just listen,” Hassie said, closing her eyes. “What am I supposed to be listening to?” Leta asked. “The joy,” Hassie told her. “The friendship. These women are the very breath of this community.” Hassie was grateful she’d lived long enough to witness the town’s reversal of fortunes. It was because of women like Lindsay and Rachel and Maddy and Sarah and Joanie Wyatt…. And maybe she herself had played a small part. “What I can’t get over is all the babies,” Leta said. “Future generations for Buffalo Valley.” “Rachel Quantrill is pregnant again,” Hassie said, nodding at the young woman on the other side of the room talking with Sarah. Hassie was particularly fond of Rachel. She’d watched the young widow struggle to get by after the death of her first husband. She’d driven a school bus and worked as a part-time bookkeeper for Hassie. Later she’d opened the pizza-delivery service. That was how she’d met Heath. New to the banking business, Heath had rejected her loan application. His grandmother, who’d started the bank, had been furious with him, Hassie recalled. But things had a way of working out for the best. Lily Quantrill had lived to see her grandson and Rachel marry. Rachel had brought a son into the marriage, and later she and Heath had a daughter they’d named after Lily. A third child was expected in early summer. “I’ll have to remember that,” Hassie murmured absently. Leta gave her a puzzled look. “What?” Hassie wasn’t aware she’d spoken aloud. “About things working out for the best.” Despite her efforts, her thoughts had returned to Value-X and the potential for disaster. All her hopes for this town and the people she loved so dearly were at stake. “You feeling all right?” Leta asked in a concerned tone. “I’m fine,” Hassie assured her. “Just tired. It’s been a busy day.” Joyce Dawson sat down at the piano, and soon the room was filled with sweetly raised voices. The women and children gathered around, breaking naturally into two-part harmony. To Hassie it sounded as though the very angels from heaven were singing. “Hassie—” Carrie Hendrickson crouched by her chair “—are you ill?” Leta answered for her. “She’s just tired.” “No wonder,” Carrie murmured. “She was up before dawn baking cookies and then there was the visit from Barbara Kyle, plus a big order came in for the pharmacy.” Hassie grinned, amused that they spoke as if she wasn’t even there. “Let me walk you home,” Carrie suggested, taking her hand. “Fiddlesticks. I’m perfectly capable of walking back on my own. No need for you to leave the party.” “I insist,” Carrie said. “It’ll only take a few minutes and no one will miss me.” Hassie was weary, wearier than she cared to admit, so she agreed. Carrie retrieved their coats and led the way outside, sliding her arm through Hassie’s to lend her support. They walked slowly, in companionable silence. The night sky was bright and clear, the stars scattered against it like diamonds. Most of the snow had been swept aside and the sidewalks salted. As they crossed the street, a truck pulled up to the curb and rolled down the window. “You two need a ride?” Chuck Hendrickson asked. “We’re fine, thanks, anyway,” Carrie told her brother. “Say, that fellow you had dinner with phoned a few minutes ago.” “Must be Vaughn,” Hassie said. It did seem that Carrie and Vaughn were seeing a lot of each other, and that pleased her. From now on, Hassie resolved to look only at the positive side of things. She refused to let herself fret over situations she couldn’t control. “I’ll call him back once I’m finished over at the church,” Carrie told her brother, who drove off. “You could do worse, Carrie,” Hassie said. “He’s a fine man.” “I think so, too.” “Not every man is another Alec.” “I know,” she said. Hassie patted Carrie’s hand. She would go home and think good thoughts for the young woman and for Buffalo Valley. Happy, positive thoughts. “It’s about time you called,” Natalie snapped. There’d been no word of greeting. Vaughn sat on the bed in his parents’ guest room and pressed his cell phone to his ear. He felt guilty about not returning Natalie’s repeated calls. He’d delayed it, needing to put his thoughts in order first. He felt guilty about other things, too, but he didn’t want to think about Carrie, not when he had to deal with Natalie. No one in Buffalo Valley knew he’d taken a job with Value-X. Not his parents. Not Hassie. And certainly not Carrie. His visit to North Dakota at a time when the company was considering an outlet in this area had seemed a fortuitous coincidence. Now it felt like the very opposite. He’d agreed to check out the town, but that had been a mistake he regretted heartily. And Natalie was hounding him for information. “You’re right, I should’ve phoned sooner,” he admitted. “Yes, you should have.” Her voice softened. “I’ve missed hearing from you.” He didn’t have an excuse to offer her, and the truth was…well, difficult to explain. Not only did he have serious doubts about working for this company, he’d met Carrie, and the attraction between them was undeniable. Just a few days ago his future had seemed assured, but now, after meeting Hassie and Carrie, his entire sense of what was right had been challenged. And his assumptions about love and marriage, about Natalie—they’d changed, too. Natalie’s voice was hard when she spoke again. “I was beginning to wonder if I made a mistake recommending you for this position. I put my reputation on the line.” “I assumed I’d been hired on my own merits.” “You were but…” She sighed heavily. “Let’s forget all that, shall we? I didn’t know what to think when you didn’t phone.” She gave a stilted laugh. “I realize you’re not officially on the payroll until January, but it’s so advantageous for you to be near this little town.” “The town has a name.” “I know that,” she said, and some of the stiffness returned to her voice. “I’m sorry, Vaughn, but I’ve had a trying day. Apparently Buffalo Valley is mounting opposition against Value-X.” “I know.” “You do?” She slowly released her breath. “You can’t imagine how hectic everything is here, with the holidays and everything else. Now this. I spoke with a woman in town. I can’t remember her name exactly. Lesley, Lindy…” “Lindsay Sinclair.” “You know her?” “I’ve met her.” “She made the town’s position very clear,” Natalie continued. “It seems we’ve got some public-relations work ahead of us. Okay, we can deal with that—we’ve done it before. We know how to present our case in a positive light. It won’t take much to change their attitude, and really, at this point, they really don’t have much choice.” Vaughn was sorry to hear that. So it was too late; Value-X had obviously succeeded in buying the property. This was what he’d feared. “Lindsay told me Value-X is sending someone out after Christmas.” “I volunteered for the job myself,” she said, excited now. “It was providential, don’t you think? I can meet your parents and settle this unfortunate matter with Buffalo Valley at the same time. Combine business with pleasure, in other words.” She sounded pleased with herself for having so neatly arranged this trip. “I’ve got everything in motion for a Value-X campaign.” “I hope you’ll be willing to listen to the town’s concerns.” “Well, yes, of course I’ll listen, but I’m hoping to present our case, too. In fact, I’ve already authorized a letter to be delivered to every family in Buffalo Valley. It’s scheduled to arrive just after the first of the year.” “A letter?” “Everyone thinks it’s a great idea.” Her satisfaction was unmistakable. “I wrote it myself for a personal touch. I want the town to understand that they’ve unfairly prejudged Value-X. I told them not to look at any negatives they might’ve heard about the company, but at the positives—everything we can do for their community. We plan to be a good neighbor.” Vaughn knew that Natalie’s letter would most likely anger the people of Buffalo Valley, not reassure them. “I didn’t realize you’d signed the deal on the land,” he muttered. Without being completely aware of it, Vaughn had held out hope that the controversy would die a natural death if the land deal fell through. His heart sank. It looked as if he’d have no choice now but to get involved. The question was: on which side would he stand? If he followed his heart, he’d join Hassie and Carrie in their fight, but if he did that, he’d compromise his future with Value-X and Natalie… Natalie hesitated before she answered. “There’ve been a few snags with the property deal. Mr. Kohn isn’t an easy man to work with.” Vaughn’s relief was swift. So there was hope. “That’s what I hear about Ambrose Kohn.” “Have you met him?” “No, he lives in Devils Lake. Listen, Natalie, I have to tell you I’m not convinced Buffalo Valley is a good site.” She laughed, but he could tell she wasn’t amused. “You haven’t even started work yet and you’re already telling me my job?” “You chose Buffalo Valley as a development site?” “I sure did,” she said smugly. “We did a study on small towns that have shown substantial growth over the last five years. Buffalo Valley is a perfect target area for retail expansion.” Vaughn’s hand tightened around the telephone receiver. “They don’t have enough retail choices,” he muttered. “Exactly.” Apparently she hadn’t noticed the sarcasm in his voice. Vaughn felt tension creeping across his shoulders. He probably couldn’t influence her to change her letter or withdraw it; he was in no position to tell Natalie news she didn’t want to hear. She returned to the subject of Ambrose Kohn. “I’m interested in what you know about him,” she said. “I don’t know him, but I have heard about him.” Vaughn didn’t feel comfortable saying anything more than he already had. As it was, he felt traitor enough. “He will sign, and soon.” Natalie’s confidence sounded unshakable. “The transaction is as good as done.” Vaughn rotated his neck in order to ease the tension. “I know what’s happened,” she said, catching him by surprise. “You’ve seen this little town and now you have doubts that Value-X is doing the right thing.” It was as though she’d read his mind. He found himself nodding. “You’re confused,” Natalie continued. “It happens to a lot of us when we first hire on with the company. Don’t worry, it’s something we all work through. Trust me, Vaughn, Value-X knows what it’s doing.”","sourceLink":"https://allnovel.net/buffalo-valley/page-14.html","bookId":1965,"book":{"id":1965,"title":"Buffalo Valley","description":"Storyline: Buffalo Valley (Dakota #4) In this charming volume, Buffalo Valley faces a new challenge. Everyone thinks Vaughn Kyle has come to town to meet Hassie Knight. After all, Vaughn was named after Hassie\u0027s dead son, and this is the first time he\u0027s come to town. What the folks in town don\u0027t know is that Vaughn\u0027s fiancée, Natalie Nichols, works for the Value-X conglomerate, and that Natalie has asked Vaughn to use this visit as a scouting trip to evaluate Buffalo Valley as a location for one of their superstores. If that store gets built, it will be goodbye Main Street, including Hassie Knight\u0027s drugstore. Once Vaughn meets Hassie\u0027s assistant, Carrie Hendrickson, it doesn\u0027t take long for him to realize that he\u0027s facing one of the most important choices of his life. He\u0027s caught between Value-X and Buffalo Valley, between Natalie\u0027s corporate savvy and Carrie\u0027s country-girl smarts, and between the future he always envisioned for himself and the appealing way of life that he glimpsed in the unique little town.","cover":"https://allnovel.net/images/buffalo-valley.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/buffalo-valley.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:16:41 AM"}}
