{"id":105032,"no":22,"title":"Page 22","content":"\"He was the only vampire who could have done it.\" Pausing in the act of trying to do up shirt buttons one-handed-as he had paused already half a dozen times that afternoon-Asher looked again at the brown velvet box where it lay on a corner of the dressing table, with its empty ampoules and its bloodstained needle. \"I don\u0027t think a living man, much less a younger vampire, would have survived to inject himself a second time.\"\n Lydia shook her head. \"How did he know?\" Frowning with concen-tration, she stood before Asher\u0027s shaving mirror to construct a running Windsor knot in one of his ties around her own neck. The last of the evening sunlight, falling through the cheap lace curtains of Asher\u0027s rooms on Prince of Wales Colonnade, sprinkled the ghosts of shadow flowers over her white shirtwaist and freckled her auburn hair with gold.\n \"About the ampoules themselves? If he\u0027d been following us from Paris, he could easily have listened through the windows of your room when Ysidro and I spoke of it. Ysidro tells me vampires often listen for days to the conversations of their prey. And he wasn\u0027t unfamiliar with the activities and technology of modern men, you know-merely apart from them, as the other vampires, the so-called \u0027good\u0027 vampires, were not. If he was following me the day Dennis attacked me at Grippen\u0027s house, he would have seen Dennis and guessed that only something as -as heroic as the measures he took-would have served.\"\n \"Poor Dennis.\" Lydia loosened the tie, stood for a moment, looking into Asher\u0027s eyes in the mirror before them. \"He used to say the most horrid things about the other girls at Somerville-about them wanting to act like men because they couldn\u0027t get men-absolutely without thinking. And whenever I\u0027d point out it was what I was doing, he\u0027d be so patronizing, as if I were only at University until I could find a husband and a home and have children. \u0027You\u0027re different,\u0027 he\u0027d say... He could be so sweet to me, so kind, and yet...\"\n She shook her head. Removing the tie from her own neck, she turned to slip it over Asher\u0027s head. \"He wanted so much to be a hero, but the fact is that I never took him seriously at all.\"\n He took her wrist in the fingers of his good hand as she adjusted his collar. \"You have to admit that, in my place, he never would have let you endanger yourself by coming to London.\"\n \"I know.\" The expression of sorrow that was more pity than grief faded; she smiled ruefully up into his eyes. \"That\u0027s why I never took him seriously. He couldn\u0027t conceive of anyone being able to save a situation but himself.\" She sighed and fixed her attention for a few moments on the placing of his stickpin and the minute adjustments in the set of his tie. \"The awful thing is that I\u0027m sure that\u0027s why he injected himself with his father\u0027s serum-because he couldn\u0027t stand the thought of such powers as Calvaire had going to anyone but him.\"\n They had burned Brother Anthony\u0027s body before the coming of dawn on a pyre hastily assembled from the Peaks\u0027 woodshed-Anthony\u0027s, and Dennis\u0027 with him. The flames were searingly hot and blue, and Asher had been wryly amused to see Lydia studying the atypical blaze with interest, clearly taking notes in her head. But she hadn\u0027t, he no-ticed, suggested preserving either of the vampires for further experimen-tation. Whatever alien pathologies lingered in their tainted blood, she had no desire to permit them further existence, even in the allegedly controlled conditions of a laboratory.\n Ysidro had been gone long before the fire began to sink. By the time the police arrived, drawn by a shepherd\u0027s report of the blaze, it was sunup, and Asher and Lydia were far down the road to Prince\u0027s Ris-borough, looking like a couple of tinkers and walking the motorcycle Dennis had disabled between them, the grimy brown ulster thrown round both their shoulders for warmth. The fire had been reported in a minor article on a back page in that afternoon\u0027 sDaily Mail, There was no mention of human remains in the blaze.\n \"In any case,\" Lydia went on after a moment, turning back from gazing rather abstractedly out at the sunset maze of rooftops and chim-neys, \"if the positions had been reversed, Dennis would have told me nothing of what was going on-merely not to worry myself about such things. And it wouldn\u0027t have answered. Because the killer, the day stalker-Dennis-knew me, and wanted me. He did see me once, while he was stalking Bully Joe Davies. And he\u0027d been-calling me, tracking me-in my dreams. He wasn\u0027t as good as the other vampires were at it, but... And then again, sooner or later, whether you or I or anyone did anything about it or not, he would have learned somehow about how to make another vampire like himself and he would have come after me.\" She wiped her eyes almost surreptitiously and shoved her spectacles more firmly up onto the bridge of her nose. \"My going to snoop about Blaydon\u0027s place in Queen Anne Street only speeded things up.\"\n She picked up his coat from the bed and came over to help him on with it again. By the time they\u0027d waked up after their return from the Peaks, the short autumn afternoon had been far advanced, and a goodly portion of what remained had been spent at Middlesex Hospital, getting Asher\u0027s battered arm reset. He could cheerfully have gone back to bed now and slept the clock round, but there remained one thing yet to do.\n \"Are you sure you want to?\" Lydia asked.\n Asher glanced past her at his own reflection in the mirror. Shaved and bathed, he no longer looked like a tramp, but his face had a drawn, exhausted look he hadn\u0027t seen there in years. He knew it, however, from his missions abroad-the familiar, soul-deep ache he associated with climbing tiredly onto the boat train for home.\n \"No,\" he said. \"But with Dennis gone, I don\u0027t think there\u0027s any danger. And someone has to tell him. Just promise me you\u0027ll stay here -stay indoors-\u0027til I come back. All right?\"\n She nodded. Asher cast one last glance at the sky, visible through the windows, satisfying himself that, before full dark fell, he would be well away from these rooms. Grippen knew about Lydia\u0027s rooms in Bruton Place, but he didn\u0027t-or at least Asher thought he didn\u0027t-know about 6 Prince of Wales Colonnade,\n Unless, of course, Ysidro had told him.\n While the doctors at Middlesex had beentushing and fussing over his arm, he\u0027d sent Lydia out to Lambert\u0027s to buy five more silver chains; he was conscious of the two around his throat and left wrist as he de-scended the lodging-house steps and began his unhurried walk toward Oxford Street. The gas lamps were lighted, soft and primrose in the dusk. He had made sure Lydia was wearing hers, though he privately suspected they wouldn\u0027t do either of them much good, if the vampires were really determined to let no one who knew of their existence sur-vive.\n His term of service to Ysidro was over.\n And in the meantime, someone had to tell Blaydon... And some-one had to make sure that there weren\u0027t going to be any more experi-ments \"for the good of the country.\"\n The other thing Lydia had bought on her shopping trip had been a revolver, though he hadn\u0027t told her who it was for. He suspected he wouldn\u0027t have needed to.\n In the deep twilight, Queen Anne Street had a placid air, the win-dows of its tall, narrow houses bright with lights. Occasionally Asher could see into one of them, through the shams of curtain lace: two friends playing chess beside a parlor fire; a dark woman standing dreaming in a window, her arm around the tall form of an androgynous youth. Were he a vampire, Asher thought, he could have heard their every word.\n There was a light on in Blaydon\u0027s house, in the room he guessed was the study on the same floor as the laboratory and the little prison. He rapped sharply at the front door, and it gave back beneath his knuckles.\n \"Blaydon?\"\n He didn\u0027t raise his voice much. The shadows of the stairwell swal-lowed the echoes of his words; for an instant, he seemed to be back in Oxford again, listening to the ominous stillness of a house he knew was not empty.\n Then, like a whisper more within his skull than without, he heard Ysidro say, \"Up here.\"\n He climbed the stairs, knowing already what he would find.\n Ysidro sat in the study at Blaydon\u0027s inlaid Persian desk, sorting pa-pers-they spilled down in drifts and covered the carpet for a yard around. The vampire himself was as Asher had first seen him, a delicate thing of alabaster and peeled ivory, cobweb hair falling to the shoulders of his gray Bond Street suit-a displaced grandee, a nobleman in exile from another age, who had once danced with the Virgin Queen, with every cell petrified as it had been, and with his soul trapped somewhere among them like a mantis in amber. Asher wondered with what study or pastime Ysidro had beguiled those passing centuries; he had never even found that out.\n Pale as brimstone or the clearest champagne, the calm eyes lifted to meet Asher\u0027s.\n \"You will find him in his laboratory,\" he said quietly. \"His neck is broken. He was working on another batch of serum, taken from the last of Chloe\u0027s blood.\"\n \"Did he know about Dennis?\"\n \"There was a telegram there from the Buckinghamshire police, say-ing that there had been a mysterious fire at the Peaks. The metal but-tons of a man\u0027s trousers had been found in the ashes, along with a few cracked glass beads, a steel crucifix, and some unidentifiable bones.\"\n Asher was silent. Ysidro upended another folder of notes over the general mess. They slithered across the top of the pile before him and swooped like awkward birds to the floor.\n \"Would you have done it?\"\n Asher sighed. He had done worse than kill Blaydon, and for slighter cause. He knew if he\u0027d been caught he could always have pleaded his Foreign Office connections, and might even have been backed up by friends in the Department. The pistol weighed heavily in his ulster pocket. \"Yes.\"\n \"I thought you would have.\" Simon smiled, wry and yet oddly sweet, and Asher had the impression-as he had fleetingly during the dark horrors of the previous night-of dealing with the man Ysidro had once been, before he had become a vampire. \"I wished to spare you awk-wardness.\"\n \"You wished to spare me a discussion with the police on the subject of Blaydon\u0027s experiments.\"\n That faint, cynical smile widened and, for the first time, warmed Ysidro\u0027s chilly eyes. \"That, too.\"\n Asher came over and stood beside the desk, looking down at the slender form of white and gray. If the gouges left in Ysidro\u0027s flesh by Dennis\u0027 fangs still pained him, as Asher\u0027s broken arm throbbed dully beneath its shroud of novocaine, he gave no sign. His slender hands were neatly bandaged. Asher wondered if Grippen had done that.\n \"You realize,\" Asher said slowly, \"that not only was Brother An-thony the only vampire who could have killed Dennis-the only vam-pire who physically could have survived that much silver in his system for even the minute or so it took for Dennis to drink his blood-but he was the only one who would have. He was the only vampire who valued the redemption of his soul above the continuation of his existence.\"\n A stray gust of wind shook the trees in the back garden, knocking bonily against the windows; distantly, a church clock chimed six. Ysidro\u0027s long fingers lay unmoving in the jumbled leaves of notes before him, the pale gold of his ring shining faintly in the gaslight. \"Do you think he achieved it?\" he asked at last.\n \"Are you familiar with the legend of Tannha\u0027user?\"\n The vampire smiled slightly. \"The sinner who came to the Pope of Rome and made confession of such frightful deeds that the Holy Father drove him forth, saying, \u0027There is more likelihood of my staff putting forth flowers, than there is of God forgiving such wickedness as yours.\u0027 Tannha\u0027user despaired and departed from Rome, to return to his life of sin, and three days later the Pope found his staff standing in a corner where he had left it, covered in living blossom. Yes.\" The gaslight ech-oed itself softly in a thousand tiny flickers in the endless labyrinth of his eyes. \"But as Brother Anthony himself said, I will never know.\"\n A faint sound behind him caused Asher to turn. In the doorway at his back stood Anthea Farren and Lionel Grippen, the woman weary and pinched-looking, the doctor a massive form of inexhaustible, ruddy-faced evil, his fangs bright against the stolen redness of his lips.\n Ysidro went on softly, \"I don\u0027t think it would even have occurred to any of us that such sacrifice was conceivable. Certainly I don\u0027t think it occurred to Brother Anthony until he encountered you, a mortal man, in the catacombs, and you spoke of God\u0027s eternal willingness to forgive and that there might be, for such as he, a way out.\"\n \"If that\u0027s what he chose to fool himself into thinking, that was his affair,\" Grippen grunted. \"A man casting about for a polite excuse to leave the table in the midst of a feast he\u0027d no stomach for, that is all.\"\n And Anthea tipped her head slightly to the side and agreed softly, \"It was a mortal thing to do.\"\n \"Huh,\" Grippen said. \"He found it mortal enough.\"\n For a moment Asher studied the woman\u0027s smooth white face framed in the woody black of her hair, gazing into those immense brown eyes. \"Yes,\" he said. \"It was the act of a man and not of a vampire.\"\n \"And in any case, it has fulfilled the bargain between us,\" Ysidro said, without rising from the desk. \"And so you are free to go.\"\n \"Go?\" Asher glanced back at him, then to the two vampires who stood behind him, Grippen on his right, and the Countess of Ernchester on his left, cold and strong and old, the gaslight playing softly over those faces of white nacre in which burned living eyes.\n \"Go,\" Ysidro\u0027s gentle, whispering voice repeated. \"Oh, I dare say you could, if you would, turn vampire-hunter and run the last of us to earth, or at least such of us as you personally dislike. Or all of us, since you are at least in part still a man of principle, albeit somewhat eroded principle.\n \"Yet I think that unlikely. We know how you and Mistress Lydia tracked us-we have been repairing omissions made, finding new lairs under \u0027cover,\u0027 as you call it, which will better bear scrutiny in the modern world. You could hunt us down eventually, I dare say, were you willing to put the time into it, to give your soul to it, to become obsessed, as all vampire-hunters must be obsessed with their prey. But it would still take years. Are you willing to give it years?\"\n Asher gazed at him, saying nothing, while those pale, unhuman eyes looked without mockery into his. It was ethically wrong, be knew.\n Poor, stupid Dennis had killed twenty-four men and women, blindly, feverishly, in the grip of a craving that amounted to madness; Ysidro\u0027s coolly executed murders totaled in the tens of thousands at least. Ethi-cally it was his duty to hunt them down and to destroy them before they could kill again or create other killers like themselves, in a widening pool of blood.\n But in his heart he knew Ysidro was right. It would take obsession to track them now, and the obsession with abstract \"shoulds\" had burned out of him six years ago, when he\u0027d blown out the brains of a boy who had been his friend, simply because his duty demanded that he ought. He felt suddenly weary of this, bitterly weary of it all, knowing that he was simply not up to it anymore.\n \"We will stay away from you and yours,\" the vampire went on. \"What more can you ask? This is not payment-it is simply prudence on our part. A man whose own ox has not been gored seldom makes a persistent hunter. To hunt us would be to hunt smoke, James, for we have what you do not have. We have time. The days and hours of your happiness are precious to you, and you know how few they are. But we have all the time there is-or at least,\" he smiled ironically, \"all of it that we want.\"\n Something-a sense of danger, the tug of the vampire\u0027s psychic glam-our at his mind-made Asher turn, sensing a trap, ready to defend himself... But Grippen and Anthea were gone,\n He turned back to the desk, and saw it empty.\n His footfalls echoed softly in the empty house as he left. When he was halfway down the street, he saw the gold leap of flame in the study window and the gray curl of smoke, but he kept on walking. People were running past him, shouting as they, too, saw the fire spreading in the house. With the papers scattered everywhere, the whole place would go quickly.\n At the corner of Harley Street, he hailed a cab to return him to his lodgings in Prince of Wales Colonnade, where Lydia would be curled up in bed, her red hair lying in swathes over the lace of her shoulders, reading a medical journal and waiting for his return. \n","sourceLink":"https://allnovel.net/those-who-hunt-the-night-james-asher-1/page-22.html","bookId":2489,"book":{"id":2489,"title":"Those Who Hunt the Night (James Asher #1)","description":"Storyline: \n Those Who Hunt the Night (James Asher #1) \n The vampires had been living in London since the time of Elizabeth I, but now they were being ruthlessly murdered by someone who ripped their coffins open for the light of day to burn them to ashes. No vampire could endure the daylight to destroy the murderer. They had to turn to a mortal human for aid. \n Thus it was that Professor James Asher, one-time spy, returned home to find his young wife in a strange coma and Simon Ysidro, oldest of the London vampires, waiting for him. Ysidro, although polite, left no doubt of his power to locate his spell on the young woman, wherever she might flee. Asher must agree to find the destroyer of the vampires for them. \n But if he found the killer, what must happen to them? What would inevitably be the fate of any mortal human who learned the identities and locations of the vampires? The answer was all too obvious. Whether he succeeded or failed, it seemed that Professor James Asher was doomed!\n \n","cover":"https://allnovel.net/images/those-who-hunt-the-night-james-asher-1.jpg","author":"Barbara Hambly","type":"Horror","source":"allnovel","link":"https://allnovel.net/those-who-hunt-the-night-james-asher-1.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:41:48 PM"}}
