{"id":86953,"no":16,"title":"Page 16","content":"“He likes to toy with his victims. The first two were acting odd for several days before they were killed. He thralls them, then hunts them.” “You think the fact they could escape gives him a thrill?” “Yes.” “But you said your partner seemed fine the night before she died. She didn’t act like she was under any kind of influence.” He took a longer drink from his beer, and then swallowed and stared at me, gaze running down from my face to my body. Ignoring the tingling along my spine his eyes elicited, I said, “No, she didn’t. I think she wasn’t a victim he planned on. I think he killed her out of necessity. He didn’t play with her as long.” “Necessity?” “Yes. Amanda didn’t match his other victims. She was a cop and a witch. Tough as nails. She did bodybuilding for a hobby. She was a black belt. Nothing about her suggested she was a normal, weak human.” I stifled a gasp as he reached out and pushed a chunk of my hair behind my ear, scooting closer to me. “Why her? He hasn’t gone after investigators before,” he said in a low voice. “Except our psychic, and she wasn’t exactly a badass cop.” “She took some of the last victim’s hair with her when she left the scene, and was going to try a locator spell using it. Whatever she did, it must have led her to him.” Or him to her, I mentally amended, remembering Natalie’s warning. He frowned. “Makes sense. But then why did he send her out at all? She went to the restaurant by herself. Maybe other places.” “I think he still needed to get some kind of thrill out of it. He’s driven to kill a certain way. Maybe he wanted the rush. Needed it. Especially because of who she was, and how powerful she was. Might give him an even better high than the weaker victims.” I considered telling Aidan about the spell I’d cast with Natalie, but it seemed pointless. It hadn’t worked, after all. “Perhaps.” He leaned in closer to me. “Which means he might be even more dangerous now, and expand his list of potential victims.” “Might…make him slip up,” I said, trying to keep my voice steady. “We can hope.” He took the empty beer bottle from my hand and set it on the coffee table along with his. I almost sighed when he moved away from me. Out of relief or disappointment, I wasn’t sure. My relief, if that’s what it was, proved short-lived. He leaned back toward me and lowered his face to mine. I took in a quick, short breath and looked up into his eyes. They were dark pools that would drown me if I let them, but I couldn’t pull myself away. Scratch that, I didn’t want to pull myself away. I wanted him to kiss me. “You’re irresistible,” he whispered, his voice caressing me. “I promised myself I’d leave you alone, but I cannot.” He lowered his lips to mine. It was a soft kiss, but it lit a match inside of me. I deepened the kiss, opening my mouth to his. His tongue slipped between my lips and stroked mine. A moan escaped me, and my arms found their way around his neck. He tensed even as I relaxed in his arms. He pulled back from me and stared at my face. His lips were slightly parted and his eyes were heavily lidded. His breathing came in harsh gasps. He looked passionate, seductive, and in painful need. Did I look the same to him? “If you want me to leave, tell me now,” he whispered, stroking my hair with his hand. I answered without thinking, but it was an honest reply. “I want you to stay.” He smiled, a fierce expression that was wholly male. “Good.” His mouth took mine forcefully, all hesitation gone, and I returned his force, pushing all of the emotions that assailed me into the kiss. He tasted of peppermint and alcohol, and it intermingled with the scent of him to overwhelm me. Warm hands pushed me into the couch. The cushions were soft against my back, contrasting against the hardness of his body on my front. As he licked and nibbled his way down my neck, pausing to suck softly on my collarbone, my skin tingled. He moved back and I cried out in protest, but he silenced me with a grin and a kiss before tugging my shirt over my head. “Here?” I gasped, giving the living room a quick glance as he cupped my breast, running his finger over the lace at the top of my bra. “Here,” he growled in agreement, and he grasped my knees, pulling me closer to the edge of the couch. Then he slipped between my legs and took my breast in his mouth. I couldn’t think, couldn’t do anything but feel him sucking and biting at my nipple through the thin fabric. Hot and wet, I could scarcely believe how my body reacted to him. Since he’d shown up I’d had only a tenuous hold on my self-control. When was the last time I’d felt like this? I hadn’t, I realized, and the thought hit me like a splash of cold water. Aidan raised his eyes, as if sensing the change in me. He took one look at my face and shook his head. “No thinking,” he said, tipping my chin, and then he took my mouth with his again. He kissed me until I forgot my fear, his hands straying to stroke my sides, and then back to my breasts. The lacy bra unlatched in the front, and he made short work of it. As he pulled back to take my bare chest in with his eyes, I reached for his shirt, tugging it free of his pants. He revealed muscular shoulders and a smooth chest when he pulled the shirt over his head. Somehow he looked bigger without the T-shirt hiding him, and suddenly I felt very small. When he helped me to my feet, he seemed to tower over me. Then he knelt in front of me and pulled my pants down over my hips, bringing my thong with them. When I was free of my clothing, he settled back on his heels and raked his eyes over my body. I couldn’t feel embarrassed, not with those hungry eyes all over me, wanting me. “You’re so beautiful,” he whispered, and then he pushed up to his feet and wrapped his arms around me. His body was hard against mine, the soft skin of his chest held me, but his jeans were rough. I ached for that roughness, and couldn’t help rubbing my body against his erection. He cursed and yanked off his jeans. Then he stopped for a moment, only a couple of feet in front of me. As he watched me take in his body, a smile touched his lips. A smug look of a man who knew he was being admired. Heat touched my cheeks and I tore my gaze from him and looked at the floor. He chuckled, and moved to me. Fingertips touched under my chin, and I raised my eyes to meet his. I glared at him, and his smile widened. “You never have to be embarrassed with me.” I raised an eyebrow, and he pulled me back into his arms so fast I squeaked. His tongue met mine and then I felt his arm under my knees. In one quick motion, he picked me up then laid me on the carpet. My objections were forgotten when he turned his attention to my breasts again, plucking and pinching and sucking them until they were taut and red. The gentleness had disappeared, and there was no amusement in his expression. I reached for him, wrapping my hand around his erection, squeezing the base before running my fingertips lightly to the moist tip. I wanted—needed—to forget all the bad. Just for a while. His hand moved to palm between my legs and I cried out at the small touch. When was the last time I’d felt this enflamed, this out of control? Had I ever? Moving from my grip, he lowered his head and nipped at me. He licked my most sensitive spot with quick, confident touches of his tongue. But the touch was too light, and I was close—so close—to release. “Please,” I gasped. “Please what?” he whispered, looking up at me from between my knees. The expression on his face was almost bestial, like he wanted nothing more than to shove me down and drive into me until I begged him to stop. Just the thought almost pushed me over the edge. “Fuck me,” I demanded, desperation making my voice hoarse. He growled and then he was on top of me, pushing my legs farther apart with his hips, taking my mouth with his. I’d never been more grateful in my life for OWs’ immunity to human disease—or for my consistent use of birth control despite my lack of a sex life. I turned my face from him, gasping for breath as he pushed his cock into me, gentle for a few, agonizing seconds, and then as his fingers dug into the carpet, he thrust himself into my tightness, forcing my body to take him fully. “Aidan!” I cried, and he moved his hands to grip my shoulders, holding me in place as I raised my hips to meet him. His chest rubbed against my sensitive breasts, pushing me to the brink. And when he slipped a hand between us to touch me, I exploded. He stiffened above me, and then drove himself into me, his body spasming. Chapter Eight I wasn’t entirely sure what pissed me off more that morning, the fact I’d experienced maybe the best sex of my life only to wake up to an empty pillow, or that I was dragged out of my comfortable bed by a phone call from my irate boss at six o’clock in the morning. It was a toss-up, really. Waiting outside Lieutenant Vasquez’s office for a half hour after I hauled myself to the precinct certainly didn’t help things, especially considering how little rest I’d gotten the night before. I rubbed the sleep from my eyes and stared at my coffee cup while I waited. Last night had been amazing—even trying to tell myself that it was only because I was highly emotional from losing a close friend didn’t quite meet the sniff test. Aidan was just as good in bed as his dark eyes suggested he would be, and then some. Worse, I felt safe during the time he held me. We talked for hours, and while some of the details were a bit fuzzy, I confided more in him than I had in anyone for a long time. Then, this morning when the phone rang, he was gone. The other side of the bed was cold, only the wrinkled pillow suggesting he had been there at all. I was an idiot. You’re an adult; you can sleep with whomever you want, I told myself. That was true—I was no prude—but the talking…it made me too close to a man I still didn’t know enough about. The door to the lieutenant’s office swung open, startling me from my thoughts. A uniform stepped out and gave me a small wave as he passed. I couldn’t remember his name offhand, but I’d seen him around. Giving him a quick nod, I got up and headed into Vasquez’s office.","sourceLink":"https://allnovel.net/banshee-charmer-files-of-the-otherworlder-enforcement-agency-1/page-16.html","bookId":2262,"book":{"id":2262,"title":"Banshee Charmer (Files of the Otherworlder Enforcement Agency #1)","description":"Storyline: Banshee Charmer (Files of the Otherworlder Enforcement Agency #1) When she’s sent to a crime scene and finds her second dead woman in as many weeks, half-banshee detective Kiera “Mac” McLoughlin is convinced a serial killer is on the loose. Incubi are extinct, her boss insists. But what else can kill a woman in the throes of pleasure? When her partner is murdered after using witchcraft to locate the killer and Mac is thrown off the case, her frustration turns to desperation. Certain the killer is an incubus, Mac works behind her department’s back to chase down slim, sometimes perilous leads. While the killer eludes her, she does discover handsome Aidan Byrne, an investigative counterpart from the enigmatic Otherworlder Enforcement Agency. Mac typically runs her investigations fast and hard, but with Aidan at her side, she’s running this one “hot” as well. But Aidan knows more than he’s letting on—something that could shatter their blazing romance and add Mac to the killer’s growing body count…","cover":"https://allnovel.net/images/banshee-charmer-files-of-the-otherworlder-enforcement-agency-1.jpg","author":"Tiffany Allee","type":"Mystery","source":"allnovel","link":"https://allnovel.net/banshee-charmer-files-of-the-otherworlder-enforcement-agency-1.html","creation":"Oct 5, 2019 8:58:31 AM","modification":"Oct 5, 2019 5:19:41 PM"}}
