{"id":106056,"no":18,"title":"Page 18","content":"\"What have they done to you?\" Tucker whispered as he stroked her hair. She struggled to find words. \"You must get me something to eat. You must hunt for me, I can\u0027t do it.\" \"Hunt? What do you mean?\" \"I must have blood,\" Lizzie said. The hunger in her body and soul was almost crippling. Tucker stared, unable to comprehend the truth of the matter. He wrapped his arm around her. \"Honey, you didn\u0027t have no pulse. And now you want blood. What have they done to you?\" he repeated, his eyes wide and heart heavy. Her hands trembled and her voice grew shaky. \"I didn\u0027t believe. Last night, I thought it was all a game, but the light came out of me, and the voices. Then I ate a rat. I needed the blood. And I died. I died, Tucker. I was dead until just now.\" She looked into his eyes, terrified. \"Tucker, what are we going to do?\" \"I have no idea, sweetheart,\" he replied, his mind struggling to keep up with a heart that at the sight of her breathing had immediately and without question resigned itself to her changed circumstances. She was living, in a way. He could talk to her, touch her, kiss her and for this he was grateful, but she was something grotesque too, something he would never have believed if he had not lived through the past few days. \"I guess we\u0027d better get you fed,\" he whispered. \"I can\u0027t kill anyone, I can\u0027t do it.\" He swallowed hard. \"We\u0027ll do it together. I\u0027ll help,\" he said, \"and then we\u0027ll kill them all, every last one of them blood-sucking bastards.\" Out on the streets of Manhattan, they strolled silently, hand in hand, safe in the seclusion that only a huge city can offer, hiding their emotions awkwardly behind the immediacy of her needs. \"We have to break into a blood bank somehow,\" said Lizzie, more to break the silence than anything else. \"Blood bank?\" \"Yeah, one of those Red Cross deals.\" \"Red Cross?\" \"Tucker, this is a shock to both of us but do you think you could get more than two words out at a time?\" \"More than two words?\" \"That\u0027s a start. That was four words.\" She smiled at him. \"You better not get me started. I could go on and on.\" His lips were tight. \"This\u0027d be a hell of a topic for one of them daytime talk shows. You see, Oprah, I\u0027m involved with this real nice gal, kind of the girl-next-door type. The problem is, every time the sun comes up, she dies. Now, I don\u0027t mean she stays in bed all day, I mean she\u0027s dead. No pulse, no blood pressure. Blue lips. Dead. Now if that don\u0027t beat all, when she does finally come back to life, the first thing she\u0027s thinking about is finding someone to suck the life out of...\" \"Okay, okay, I get the picture.\" She cut him off. \"We can talk about that later. Let\u0027s go to the Bowery, to one of those places that stays open all night to buy blood from the winos and junkies when they need a few bucks.\" Lizzie hailed a cab. She pulled open the door fiercely and the hinges groaned. \"Hey, lady, what are you, a body-builder? Careful with my cab,\" snorted the driver. Lizzie was startled, surprised at her own strength. She jumped inside the taxi. Tucker stood on the street corner. Lizzie looked at him from inside the cab. Now was the time to leave, and they both knew it: get himself out of this mess. Lizzie looked away, into the traffic on the street. She felt sad, resigning herself to the idea that maybe he should go. She could go it alone, if she had to. And it would certainly be better for him. Turning back, she saw that he was watching her intently, as if memorizing her features for some distant, future time when he would have to struggle to recall her face from a long-ago dream. Rex jumped into the cab next to Lizzie. He barked. She smiled weakly and stroked his head. Tucker shook his head and climbed in the cab. He scooted over close and planted a kiss on her lips, then glared at Rex. \"Like you\u0027re so goddamn smart. Stupid mutt.\" Outside the Red Cross, they were like children in a candy store, faces pressed to the front pane of the window. The tired volunteers moved with graceless efficiency through the spent bodies of the blood donors, all willing to give up a pint of their life for a few dollars. It was a square room, sterile, with a stained gray carpet and once white walls turned sickly yellow with time and inattention. There were a few worn-out, upholstered chairs, intravenous devices for blood-letting, and several stacks of coolers where the yawning nurses placed the pouches of blood. It wasn\u0027t very busy, only two people giving blood, with a receptionist and a nurse overseeing the process. \"I wonder if I could give my own blood and then drink that?\" asked Lizzie. \"Naw, that\u0027d be like some kind of Vampire eating disorder. And besides, what\u0027d happen if your blood is green or something even more disgusting? It would be a dead giveaway.\" \"So, you think my blood is disgusting?\" She paused. \"You probably think I\u0027m fat, too. How about this dress? Completely unflattering? Maybe I should cut my hair?\" Tucker laughed. \"Nice to know there\u0027s still a woman underneath the Vampire. But don\u0027t worry. I hadn\u0027t forgotten.\" She slid her hand inside his coat pocket in a familiar fashion, felt the cold edge of metal, the gun she had yet to see. He took a hard look at the blood bank. \"Well, it sure ain\u0027t the Betty Ford clinic. Goddamn, this is depressing. And I thought LonePine was a sad little town.\" Unexpectedly, Lizzie\u0027s knees buckled and she sagged toward the sidewalk. Tucker caught her and held her up. \"What\u0027s the matter?\" he asked. \"I don\u0027t know, I\u0027m dizzy. My head feels like it\u0027s filled with light.\" But it was light and voice combined, the now-familiar cacophony of female voices urging her to feed, to take a victim, Tucker if she must, but to survive at all costs. \"Leave me,\" she whispered, \"I don\u0027t want to do anything bad.\" \"Hold on. Just a little longer.\" \"I\u0027ll try.\" He pulled away and walked toward the entrance of the blood bank, his boot heels striking hard on the pavement. \"Be right back.\" \"What are you going to do?\" she asked. \"I could use a little extra cash. That should at least give you a snack to tide you over.\" \"I can\u0027t drink your blood.\" \"Why not? I\u0027d just as soon you drink mine as some other cowboys.\" She smiled faintly and watched him walk inside. Kneeling on the sidewalk, she put her face close to the store-front window. Her breath formed a veil on the glass, a mist through which she watched his every move. Inside, Tucker smiled brightly at the receptionist who noticeably cheered when she saw the cowboy who had just walked in. Lizzie scowled, figuring that he was flirting, damn him. The receptionist handed him a clipboard with a paper and pen and pointed to a chair against the wall on the other side of the room, smiling radiantly at him all the time. He smiled again, from ear to ear, shuffled his feet a little and, as he passed through the center of the small, understaffed room, he paused. Planting his feet, he pulled out the shiniest, biggest pistol that Lizzie had ever seen. It was long and sinister and glinted in the harsh light and she wondered how he had managed to conceal it, her finger remembering the edge of metal in his pocket, what must have simply been the tip of the iceberg. \"Nobody move, this is a hold-up.\" As it turned out, nobody moved because nobody believed him. \"Come on,\" he yelled louder, \"get against the wall.\" A bedraggled street man looked up from his seat, needle in his arm slowly dripping blood into a bulging pouch. \"What gives, Tex? Are you nuts? It\u0027s a blood bank, not a money bank. Who the hell steals from a blood bank?\" \"I do.\" Tucker backed toward the stack of coolers. Pointing the gun at the nurse, he yelled, \"C\u0027mon, c\u0027mon. I\u0027m on a schedule here. Open one of them up.\" The nurse started to cry. \"Oh, damn, I\u0027m sorry ma\u0027am,\" he said, feeling guilty. He rummaged through his pocket for a tattered old handkerchief and moved close to comfort her, but then Lizzie tapped her nails against the glass and he caught himself. \"Look, this is hard on me too. Just move it. Open that cooler.\" Inside were at least thirty pouches of blood in an orderly stack, jewels as far as he was concerned. \"All right, everyone, stay where you are, I\u0027m taking this cooler and getting out of here.\" Again no one moved, largely because they were still astonished that they were being robbed. Tucker struggled to hoist the cooler onto his shoulder with one arm while still managing to wave the gun around in a mostly comical fashion. When he looked at Lizzie, she had her hand over her mouth, giggling. Then she turned, hailed a cab and waited for Tucker to emerge from his robbery. \"The things a man will do for love,\" he said as he got into the waiting taxi. Lizzie reached into the cooler and tore open a bag. She gulped down the blood, so greedily that it dribbled out her mouth, down her chin, on to her now-ruined blue dress. That first one gone, she looked up at Tucker, half embarrassed, half relieved, too happy to say anything. She grabbed another and drained it, too. Her weak frame and ashen face, that only moments ago had convinced Tucker that she could die at any moment, were quickly transformed as the fresh blood flushed her skin and her eyes began to glimmer. Her lips turned deep crimson, pouty, before his eyes. In a matter of seconds, she was radiant. Tucker was transfixed by her beauty, and simultaneously repulsed. \"Hey, you plan on telling me where you\u0027re going?\" asked the driver. Startled, Tucker responded, \"Just drive for a while. And it\u0027s tomato juice, really.\" The cab driver only shrugged his shoulders and pulled out into traffic. \"Ah,\" she said, wiping the crimson juice from her lips with his shirt sleeve. \"Feel better?\" he asked, looking at the stain on his shirt with an arched eyebrow. \"Much. Thanks, Tucker.\" \"How long will this last you?\" \"I have no idea. Guess we\u0027ll learn the ways of a Vampire together.\" She paused. \"And I have a feeling there are many things to find out. I don\u0027t know if I can eat regular food. And will I still have my period? Will wine still make me tipsy? Just how strong am I?\" She drifted off, asking herself more questions inside her mind, emanating a blood-satisfied vitality and exuberance. Tucker was quiet. All he cared about was what it all meant for them and just how long it would take Julius to catch up. \"Now, I have to tell you about the safe-deposit box,\" Lizzie said, assuming a business tone of voice. \"You\u0027ll need to get into it tomorrow during the day sometime, while I\u0027m sleeping.\" \"Sleeping? Honey, it ain\u0027t sleeping. Let\u0027s call a cow a cow. You\u0027ll be dead. And while you\u0027re dead, you want me to rob a bank. Isn\u0027t a blood bank enough? You want me to break into a real bank during the light of day?\" \"No, honey I have a key. And I\u0027ll need some clothes too.\" \"But we can\u0027t go back. They gotta be watching your apartment.\" \"I\u0027ll call the landlady. She can do it for us and just meet you somewhere.\" Her landlady was not particularly happy to be disturbed in the middle of the night, but after the initial surprise and the promise of fifty dollars, she agreed to meet Tucker the following morning with a suitcase full of clothes and the desired key. He took the key to her bank and looked inside the safe-deposit box. There were two letters, yellowed by age, both with Lizzie\u0027s name neatly inked on the outside. Tucker shoved them into his pocket and beat a quick retreat from the bank. Hungry as hell, he grabbed six hot dogs from a corner vendor for the cab ride back to the church. There wasn\u0027t any need to rush as she\u0027d still be in her dead sleep, but watching over her would give him more comfort than wandering aimlessly among the streets of Manhattan with six hot dogs. Plus, he wanted to make sure she fed right off the bat. That thought brought up a problem. Their stolen blood booty was rapidly dwindling and he knew that they would have to do something soon to get more. More precisely, he would have to do something to get her more. The concept of blood had little impact on him, he had long ago butchered too many cows and skinned too many deer for the gore to bother him, but supplying her was another matter. Would he be able to do what, ultimately, he guessed he would someday have to do? Could he kill an innocent being for Lizzie? She was like a child now. She didn\u0027t know anything about this new life, this new death. In order to survive, she would have to learn and she would definitely need some help - help, he feared, she would seek in him. How in the world did he get himself into these situations? Nursemaid to a baby Vampire? He sat on a park bench to eat and watched the pigeons. Maybe it would be best to contact Julius after all, pondered Tucker. Maybe he could cut a deal, get Julius to teach him what to do, and he, in turn, could teach Lizzie. Then, after she was stronger, and knew which end was up, maybe she would choose to join Julius. Or maybe not. He guessed that Julius would agree to just about anything to get his little Queen back, or at least, the hope of getting her back. Yeah, he thought, what could be the harm? I hold all the cards on this one, and Julius ain\u0027t got cow shit. It was getting on toward late afternoon by the time Tucker made it back to the Vampire compound, thankful that they would be safely in their coffins. He rang the doorbell to apartment 4F. To Tucker\u0027s surprise, Jenkins himself answered. \"Hey, Jenk. What\u0027cha doing getting the door yourself? Where are all your underlings?\" \"I have been instructed to wait for you.\" \"I got a message for your boss. I want...\" Jenkins interrupted. \"Where is your dog, Mr. Tucker?\" \"My dog? Oh, yeah, Rex. He\u0027s with Lizzie.\" Jenkins was deadly silent. Tucker felt suddenly uncomfortable, uneasy. What was going on? \"Your message?\" inquired Jenkins. \"Well, maybe I should write it down. It\u0027s kinda important.\" \"There is no need. Every word we say is being videotaped.\" Tucker regained his composure, smiled for the invisible camera. Jenkins looked mildly embarrassed for him. \"Tell your pale-faced Master that I\u0027ll maybe put a good word in for him with Lizzie, under one condition.\" \"Yes?\" \"He\u0027s got to teach me the ways of a Vampire.\" \"And you, I presume, would provide lessons for Ms. Vaughan?\" \"Pretty bright, Jenkins.\" \"At least one of us is,\" muttered Jenkins in response. \"What was that?\" \"I shall relay the message. And how will Master Julius contact you?\" \"I\u0027ll come back here tomorrow, same time, same place.\" \"Very well, sir.\" Tucker left the compound. Pretty damn smart of me if I do say so myself, he was thinking. Better get back quick, he thought. He hailed a cab. He was surprised at how quickly a yellow-top made it to the corner. Jenkins, of course, was not at all surprised, as it had been dispatched from the garage beneath the compound. It was getting dark quickly now, and Tucker wanted to get back to the church straight away, but he was figuring he might have been followed. \"Hey,\" he said to the cab driver, \"I\u0027ll give you an extra fifty bucks to drive like such a lunatic that no one could possibly be following us.\" \"It will be my pleasure, sir,\" answered the cabbie, smiling. \"It\u0027s quite infrequent that I\u0027m able to amuse myself in this line of work.\" \"Finally, a cab driver who speaks English,\" sighed Tucker, too unfamiliar with the urban immigrant jungle to know that a cabdriver speaking Oxford English definitely was out of the ordinary He gloated as the cab sped off, anticipating the surprise he would give Lizzie when he told her he had figured out a way to be her tutor in the ancient art of Vampiring. He settled back into the seat, feeling like he was starting to get the situation under control. Now, all he wanted to do was get back before she woke up. That part of her sure hadn\u0027t changed, he thought - not based on what had happened the night before. Before, it was coffee and cigarettes she had craved. Now, it was blood. At least, she seemed to have quit smoking, although he wondered if it mattered. Could cigarettes shorten the undead life of an eternal Vampire? Somehow he doubted it. Ah, the irony of love, he thought, always something to worry about. He wondered if he should tell Lizzie about his visit to the compound and his message for Julius. Nah, he thought, he\u0027d wait and surprise her when he gave her a first lesson in Vampiring. Back in the catacombs, he waited, looking at the letters. Sealed in linen envelopes, one was clearly marked with what he guessed was her mother\u0027s handwriting and said \"open first.\" He rattled the envelopes around. There was something in both of them. He was aching to rip the letters open, to find out everything before she woke up and use the information to somehow make it all better. Instead, he decided to wait until she regained life, until she drank her fill of stolen blood. And then wait, he hoped, until after they\u0027d made love. They had yet to come together in that way, not since she had become what she had. He wondered if the future held any hope for that and whether Vampires even wanted to roll around in the hay. Then he remembered Elita and his question was answered. Rex crawled up, snuggling against his neck. He shoved the letters into his jacket pocket, took Lizzie\u0027s cold, distant hand, and nodded off. Within the hour, she moved. She awoke with the same feeling from the night before and wondered if it would always be the same. First, the darkness touched something in her soul, then tickled behind her eyes until they opened. Seconds later, there was an ecstatic feeling, a sense of completion, and the power and mystery of the universe seemed to fill her. But this glorious sensation lasted only a minute or two, replaced, overcome, by the need for blood. This time, she was ready. This time, she had it under control, or at least close. It was like Christmas as a little girl, lying in bed and knowing that Santa Claus had filled her stocking with presents. Desperate to dash into the parlor, anticipating the happiness of a new doll or violin in her hands. Back then, she had fought to control her impulse to get up before the sun. She felt the same now, only it was her desire for blood that she was struggling to control, and the battle was in a scary and grown-up world with consequences more dire than a gentle scolding from her mother. As the shadows coalesced into forms and the night became visible, she looked over at Tucker. He was holding her hand and sleeping, quietly and without moving. He looked dead himself. Rex\u0027s eyes followed hers and his stump of a tail banged softly against the floor. She smiled in spite of her hunger, happy that she could keep her blood-lust from destroying her two heroes. She saw the bag of blood in Tucker\u0027s other hand. Sweet Tucker, he had remembered to keep the blood well within reach. Her mind and spirit soared in ecstatic anticipation. Quietly, she took the bag from his hand and ripped a hole in the tough plastic, sucking the contents down. She hoped he wouldn\u0027t wake up, suspecting he would not find this exactly a glorious moment. Watching her lust be so easily satisfied with the crimson heat might make him jealous. Or her ashamed. \"I have the letters from your mother,\" he said quietly. She sat bolt upright. He had been awake after all, but for how long, she wondered. She wiped the blood from her mouth like a child wiping away a milk mustache. \"Give them to me. Please.\" She was embarrassed to the point of anger, snatching them from his hand. She tore open the first letter. Inside was a black and white photograph. She turned it over, reading the words written faintly on the rear. It was a picture of her mother and father, an unfamiliar one that must have been taken many years ago. Odd. Her mother had always told her there were no other photos of her father. But now with a start, she realized who it was. Her face turned pale. She handed the photo to Tucker. \"Who is it?\" he asked, yet to look. \"My mother and father, my real father, before I was born.\" He looked at the image and swallowed audibly. \"Lizzie, that man, it\u0027s Julius.\" \"Yes, it certainly is, isn\u0027t it?\" Lizzie pulled a note, hastily written, from the envelope, then paused. \"Wait a minute. How do you know what Julius looks like?\" \"It\u0027s a long story.\" \"I have time.\" She looked at him expectantly. \"All eternity, in fact.\" \"Read your letters first.\" Tucker felt a vague discomfort about his visit to Julius this afternoon. Maybe total separation would have been better. Never mind, he thought, I can just not go back. Lizzie read: Dearest Elizabeth, You once swore to me that you would not come to this box unless day had turned to night. If you still do not know what that means, if you have not been contacted by Julius, Elita, or Lazarus, I beg you not to open the next letter. Burn it immediately. I know, dear daughter, that your natural curiosity will be overwhelming, but you must trust me. Your life would be better served to live without this knowledge, and I will rest more comfortably knowing that my past actions continue to protect you. I am with you always. Your loving Mother Lizzie ripped open the next letter. A simple, well-worn pendant on a gold chain fell out. Her hands were shaking, but she felt a resolute calm, the calm that comes before the storm, the calm of impending knowledge. The pendant was a crucifix with a thorny rose wound around it, the full, heavy bloom hanging just in the center, and a crescent moon perched on the top, through which the chain passed. My darling Elizabeth, I am so sorry. Since you are reading this letter, you are surely tormented by the newly found knowledge of your heritage. My heart is breaking for you. I tried hard to protect you from the past, but it seems I have failed. All I can do for you now is to tell you everything, absolutely everything, so you will have the power of knowledge to face what lies before you. And what lies before you is grave indeed. I wish I could be with you, and hold you as if you were a child. But you are no longer a child and it would certainly offer you little protection but right now, comfort may be more important than protection. I dearly hope that there is someone in your life that you can trust, someone who will look after you, but I guess that is too much to hope for. Please wear this locket, and know that I am always close to your heart. It was given to me by my mother, and to her by her mother, your ancestors. I only wish I could have told you about them, about the power and magic that was their lives. The moon will be your sun for the rest of your days. Always let the power of the cross guide your actions, and pray that something beautiful blooms in your heart. Lizzie paused from her reading and looked up at Tucker. He was staring closely at the photo, looking a little ruffled. \"Tucker, did you eat today?\" \"Don\u0027t worry about me. I\u0027m fine. I had some hot dogs.\" He scowled. \"Besides, I could always try some of this.\" He held up a bag of blood. \"Don\u0027t be disgusting.\" \"Why not? It sure seems to make you happy.\" He ripped the top of the bag and dribbled a little blood in his mouth. \"Stop it!\" His face twisted in disgust. \"A fine vintage, a little on the bitter side. My guess? A forty-year-old Caucasian in reasonable health, but with an appetite for chocolate that produces a flowery bouquet, but unfortunately, will contribute to his untimely death due to arterial inflammation...\" he trailed off and spat the blood out onto the floor. Rex regarded them both curiously, his tail wagging indecisively. Lizzie shook her head, laughing. The sound was foreign in the void of sadness around them. \"I love you, Tucker. Just Tucker.\" \"Read your letter, sweetheart.\" She turned back to her mother\u0027s words. The recognition of her handwriting evoked a longing, a tenderness. Do you remember when you were a little girl and hurt yourself? You used to be so fascinated by your own blood. It nearly made me faint to see you suck at your cut finger, knowing what I know. Many years have passed and you are all grown up. I cannot tell you what course of action to take now, but I believe in you. Believe you can, must, make the right decisions and handle what has happened in your life. Trust in yourself The Book of Revelations in the Vampiric Bible prophesies a new Savior, one who will carry on the legacy of Susej. The wording is vague, typical of the mysteries of the Bible, but it is believed that the power which will create the Savior will stem from a descendant of the first Queen. Revelations predicts that the Savior will be created from the powers given to a girl-child born of that noble line every 700 years. The world will know of her coming because she will be the only girl-child born in that generation. Further, the father of the girl-child must be descended from Susej\u0027s first-born male. The girl-child must be turned at age thirty by one who is capable of becoming the Savior, that is, someone who has the power to turn. But the Savior does not come into his powers, does not become the reincarnation of Susej until one more critical event occurs. This event is related to part of Susej\u0027s legacy, bringing new blood into the Vampiric lineage. Exactly twenty-one days from the girl-child\u0027s turning, she will have her first menses as a Vampire. The blood that leaves her body that first night is where the power of the future Savior lies. If he who turns her also drinks that blood, then it is prophesied that he will have the power to turn a full-blooded Adamite into a Vampire. If no one drinks this blood, the power will pass bach into the Cosmos. Revelations also says that the Savior may in fact be the girl-child who carries the blood, if she chooses to drink it herself. The girl-child prophesied by Revelations is you, my love. Julius has always believed strongly in the literal truth of the Vampiric Bible. I am not sure if these prophecies are true or not. It doesn\u0027t matter. All that matters is that Julius believes in them and has spent the last thousand years manipulating lives so that he would be the only one capable of becoming the Savior. He will stop at nothing to have you under his control during your menses. He believes that he is Susej reincarnated, and it is his fate to assume the powers soon to be manifested in you. As you know by now, turning can only occur for those who carry the Vampiric bloodline. If full Adamites can be turned, the consequences for the world will be awesome, devastating. If an individual has the power to turn both Vampires and Adamites, they ultimately have the power to rule the world. And it\u0027s not just humans who would suffer. Not all Vampires are like Julius and his people. The world needs Vampires. As I already said, I cannot know precisely what Julius\u0027 plans are. I do know, however, that he will unquestionably seek to drink your menses in order to have the dual power. He has been waiting a long time for this moment. Lizzie handed the first few pages to Tucker. \"You\u0027d better read this too,\" she whispered. Julius is your real father. I mated with him because this was the only way he would agree to allow me to live my life as an Adamite, which I wanted desperately to do. I had no idea what he really intended. While not all those with Vampiric blood are selected to live this destiny, once Julius decides, there is no more choice in the matter. My ancestors, our ancestors, had lived both as Vampires and Adamites. I believed the Adamite life preferable. He duped me into thinking that he gave me this choice because he loved me. At the time, I thought I loved him and very naively, I did not understand the significance of what I was doing. Julius had been systematically mating with all possible candidates who could carry the second girl-child, given that the 700-year interval was then fast approaching. Shortly after you were conceived, I was visited by a Vampire named Lazarus, who explained Julius\u0027 scheme to obtain the dual power. I did not believe him at first, did not want to believe him, but in time, I learned the truth. I left with him and lived under his protection until you were born. I had expected you to be a boy, as were all of the children born to Julius\u0027 hundreds of consorts. For what it is worth, I believe that the power of dual turning is very dangerous, one which should be allowed to simply pass away into nothing. You, of course, must come to your own decision. Lazarus and I agreed that, ideally, you would simply be able to live your life as an Adamite, never having to face these awesome decisions. We also realized that if there was any hope of you living an Adamite life, you could not be raised in the Vampiric environment You and I left Lazarus when you turned three and lived quietly, supported by him, protected by him, hidden by him. The separation was very difficult for me, for I had grown to love him very deeply It was of him that I spoke when I talked of your father when you were a child, for he is the father of your heart. I never saw him after we left. Lazarus is a powerful force in the world of Vampires, with an entire army and billions of dollars behind him. While Vampires may seem monstrous in the context of the human world, some manifest their vow to embody evil in a manner very different than Julius and his factions. You will come to understand this when you meet Lazarus. Like Julius, he too has the power to turn. You must seek him out now in order to protect yourself. He has sworn to me that he will see you through this if you have the will to stand up to Julius, to not give in to his ways. I wish there was some way I could have saved you from this. I tried. But now it is up to you. Good luck. I love you. Tears were streaming down Lizzie\u0027s face, dripping onto the white paper, smearing the ink. She cried quietly as Tucker finished reading the last pages. He leaned over and brought her hand to his lips, kissing it softly. \"I don\u0027t understand. How could she have kept so much from me?\" \"Doesn\u0027t seem like she had much choice.\" \"What could she have hoped to accomplish by keeping me in the dark? What? She should have prepared me.\" \"She prepared you pretty damn well. You\u0027re smart and tough as nails, and that\u0027s more\u0027n most can say. And after one day of being a Vampire you already got a cowboy robbing the Red Cross for you.\" A hint of a smile escaped from Lizzie\u0027s tortured face. \"She loved you, honey. She was your mother and although I ain\u0027t a parent, my guess is she wanted to protect you as best she could. She thought giving you a chance, however slim, that you might be able just to live a normal human life was the best gift she could ever give you.\" Lizzie did not respond, and her sad silence screamed through the catacombs and through Tucker\u0027s heart. Tucker just let it be, figuring that sooner or later she would break it herself. LonePine behavioral psychological training in action, yet again. Plus, although he himself was still reeling from everything that had happened in the last few weeks, he had to admit that at least he did not crave blood or disdain the sun. She was the Vampire, not him, and he figured that she had more things to get used to than he ever would. Give it time, he thought, give it time, sweetheart. You got a lot of that now, might as well put it to use. Finally, Lizzie handed the locket to Tucker and lifted up her hair for him to clasp it around her neck. \"It\u0027s strange being back here, in the church I mean,\" she said, \"odd that all this should occur here in the church catacombs. She always told me that this church was where my father\u0027s funeral had been. But he didn\u0027t die. He was already dead.\" The emptiness of this statement rang in her heart. \"We used to come here every Sunday whenever we were in New York and sit in the back of the church. She never sang, or went up to pray Just sat in the same pew and listened. No one knew her, not really. Not even Mr. Sully, and he was always sitting next to us every time we came here, without fail.\" She looked around them. \"It was my mother who showed me these catacombs, told me that they were secret, that I should remember them. When I was little she used to tell me that this would be a great place for hide and seek. When I got older, she would still make me come down here with her from time to time, just to visit. She had an arrangement with the parish priest, some kind of agreement to keep the catacombs open. I think she even contributed money to the church so that they would never be sealed off. But I finally stopped coming altogether when I started college, although Mother attended this church until she died.\" Tucker stretched his legs out in front of him. \"Who was this Sully guy?\" \"I don\u0027t know. Some strange old man that was always at the service.\" \"What do you mean, strange?\" \"He never said a word to us though we sat next to him on and off for years. And,\" her voice trailed off, \"we only came to the evening masses, well after dark.\" Her eyes widened as a new-found realization began to sink in. \"And Mr. Sully never got older. Even after I\u0027d gone away to college, so that made it about twenty years we had been coming here on and off, he looked exactly the same, like Dick Clark.\" Lizzie paused, excitement in her voice. \"Tucker, I think that Mr. Sully was a Vampire. He must have been. He must have been connected to Lazarus.\" \"You don\u0027t think he\u0027s still coming, after all these years?\" asked Tucker, incredulously. \"I don\u0027t see why not.\" Tucker\u0027s shoulders slumped. \"God, my mother would have loved you.\" \"What?\" she asked, confused. \"Why?\" \"She always said I needed a woman who\u0027d make me go to church.\" SANTA FE, NEW MEXICO October 12, 2001, 11:10 P.M. Lazarus lowered himself into the small pool of still water. Several hundred years ago when he had moved to this part of the world with the Spanish, he had designed and built this pool specifically for his body size, and other more subtle concerns. It was constructed of local materials, nothing more than a deep hole reinforced by strategically placed red sandstone from the desert. Located just outside his private quarters in his carefully maintained interior gardens, it was not really a swimming pool, but more a dipping pool. Far from elaborate, a circle only 4 feet across and exactly 5 feet, 11 inches in depth, it was perfectly tailored so that when he soaked he could stand upright, feet resting on the soft sand at the base, with the water just up to his neck. These days, however, his ever-expanding belly threatened to overflow the edges of the pool. Each time he soaked, he was unpleasantly reminded of just how desperately jolly looking he had become. He shook his head and ripples spread out around him. His one luxury for his modest pool was, after the technology had developed several decades ago, refrigerated coils wrapped around it beneath the surface. This kept the water just above freezing. Vampires, as a rule, despise the cold. Through the years, however, Lazarus had discovered that the cold was a tremendous aid to controlling his appetites. It had become his nightly ritual. Each evening as the sun set and he was resurrected, he came first to his dipping pool to cool his body and his hunger. He was then able to think clearly about the coming night. Tonight, like all other nights, as he dipped himself, the frigidity of the water took his breath away for an instant. He felt his heart skip a beat, but continued resolutely to immerse his body into the water. His naked body shimmered in the moonlight streaming in through the skylights carved out of the solid stone above. Lazarus looked up into the blackness of the night sky the millions of stars blazing there. The sounds of the desert passed through his entire being, the quiet certainty of the life moving there, the insect hum, the warmth of the wind, the slow but certain shifting of the sands. At last he let out a deep breath. His mind was cleared of the cobwebs collected during the long, empty day before. Yes, he thought, the die has indeed been cast. Last night, he had completed the process of putting his contingent of supporters throughout the world on full alert. He honestly did not know what to expect from Julius and his New York world of darkness, but expected it would be drastic. The real wild card was that he had no idea how much Lizzie knew, if anything. Whatever she knew, the power was building in her body, power that would issue forth in twenty-one days - no, it was more like eighteen days now. Oh, women and their periods and their other mysterious processes. If the Adamite women only knew about the power of Vampire menses. What a magnificent article he could write for their tabloids, thought Lazarus. One of his greatest pleasures in life was reading the tabloids. Daily, his minions made the trip to a convenience store outside Santa Fe for the sole purpose of purchasing the latest issues, as well as chocolate milk and HoHos. In the glossy, shocking pages were luridly captured the real interests of the Adamites, the subtleties of thought, their childlike worries, their strange attachments. Unlike the mindless and polished void of respected media, the tabloids were a direct link to their psyches. Often, he ghost-wrote articles, telling the truth about Vampires, ancient biblical prophecies, and the like. Imagine if he told them about the pain of existence for Vampiric women, the pain that kept them so slim and firm. And forever young. \"Stars Flock to Try Fantastic Vampire Blood Diet!\" What a headline. He smiled even wider and in doing so, began to laugh. Lazarus liked to laugh, even if it was at himself. \"Sir, would you care for your tea now?\" Carlos asked. Lazarus lazily opened his eyes. \"No. Bring me some whiskey instead. I suspect I may have to learn to enjoy it, based on what I know about cowboys.\" \"Do you think they\u0027ll be here soon?\" he asked hopefully. \"I reckon I don\u0027t know.\" \"Sir?\" \"Never mind. I\u0027m just practicing. I would like to be able to relate to my girl\u0027s main squeeze.\" Carlos laughed. \"Your ability to pick up the nuances of languages never ceases to amaze me.\" \"If only they had accepted my offer to translate those parts of the Dead Sea Scrolls that were in Aramaic. I could have turned the academic world upside down with an accurate translation. Instead they have that poppycock version full of educated guesses. It\u0027s my mother tongue, for God\u0027s sake. Oh well. I guess my enthusiasm does rather intimidate the Adamites.\" \"Sir, with all due respect, they thought you were a fanatic. When you started speaking Aramaic, words that, in this day and age, have been experienced only as an ancient and dead language, they thought you were crazy. An academic bag-lady If memory serves, that is exactly what the distinguished professor called you.\" Lazarus waved his hand, dismissing the memory, although his eyes took on a gleeful sheen, and his mouth turned up in a familiar smile. \"Fetch me that whiskey, pardner.\" He ducked his head under water and held his breath as long as he could. When he emerged, a bottle and glass on a floating tray were pushed toward him. Lazarus poured two fingers and took a long sip. \"I have to admit, I\u0027m awfully excited to see her, to actually be able to talk to her. It\u0027s been so long.\" \"I wish it could be under different circumstances.\" \"It surely is a double-edged sword. Nevertheless, I remain optimistic. We can protect her. But she must seek the sanctuary here by choice. I will not force it on her. I owe her mother that.\" \"I understand. But no one has been able to find her since she left Julius.\" Lazarus let out a belly laugh. The water around his naked body shook, sending waves out from him, circles of water undulating from the force of his laughter, ripples cresting over the edge of his dipping pool, spilling carelessly and pointlessly onto the hot desert sand. \"That\u0027s my girl.\" \"By the way, he telephoned. Several hours ago.\" \"Oh, he did? What did the old fart have to say?\" \"He was very polite. Asked if we had seen his protege.\" The waves of undulating laughter again engulfed Lazarus\u0027 pool. \"Fortunately, you were not put in a position of needing to tell a falsehood.\" \"Julius was not at all pleased.\" Lazarus sighed. \"No, I imagine not.\" \"Now what?\" \"We must be certain that every opportunity is available for her to contact us. It must be simple, once she makes the connection, once she understands what is happening.\" \"We have Vampires out all over the world.\" \"Is Sully still in New York?\" \"Sir, Sully has been in New York, attending the same church on the same night for the last twenty-seven years. I hardly think he would stop now.\" \"Yes, excellent. Remind me to send Sully a reward for his hardship posting. I suppose his assignment has been rather tedious this last decade, after she stopped going to the church altogether. I\u0027m guessing it\u0027s about to get considerably more exciting.\" The sounds of the desert deepened in Lazarus\u0027 ears, mixed with the warmth of the whiskey in his mouth. \"Bring the Book of Revelations into the library I\u0027d like to read it again.\" \"I reckon I can do that, pardner. Pardner-Sir.\" Lazarus let out a belly laugh that shook the stars.","sourceLink":"https://allnovel.net/the-cowboy-and-vampire/page-18.html","bookId":2496,"book":{"id":2496,"title":"The Cowboy and Vampire","description":"Storyline: Saddle up for a hilarious, existential gallop through the dying American west with an army of ancient bloodsuckers in hot pursuit. Welcome to LonePine, Wyoming, population 438, where the best of the west faces off against the rise of the undead. It’s a love story for the ages. Worlds collide in The Cowboy and the Vampire: A Very Unusual Romance, when a broke cowboy and a glamorous big city reporter fall lipstick over boot heels in love. But she carries a 2000-year-old secret in her veins that will test their unusual romance. Can her big city smarts combined with his western courage keep an undead love alive? This is the first book of The Cowboy and the Vampire Collection.","cover":"https://allnovel.net/images/the-cowboy-and-vampire.jpg","author":"Clark Hays","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-cowboy-and-vampire.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:50:55 PM"}}
