{"id":106046,"no":8,"title":"Page 8","content":"I knew my request was really putting Lenny under the gun, no pun intended, but I also knew that if anybody could help me in my quest to kill as many damn Vampires as it took to get Lizzie back, it was him.\n \"June,\" he said, \"you\u0027d better bring dinner to the shop. Cmon, Tucker.\"\n The shop was where Lenny did his creating. In it, near as I could tell, there was a machine for everything except splitting atoms.\n \u0027Course, I wouldn\u0027t know what one of them looked like anyway. He opened up a fridge that had been a water heater in a previous life. It was icy on the inside and stocked with cans of beer, candy bars, and some vials of amber liquid I decided not to ask about. He popped two beers and handed me one. Between the horse medicine and the caffeine, my brain was in no condition for alcohol, but I started in on it anyway.\n \"The first thing we got to figure out is what killed that old boy. Fire or wood? Or was it the combination of the two?\"\n \"Everybody knows wood kills them. You know, a stake through the heart,\" I said. \"Least that\u0027s what Doc Near told me this morning.\"\n \"I wouldn\u0027t take nothing he says too seriously,\" Lenny said, taking a pull at his beer.\n \"Why not?\" I asked.\n He spread some recycled paper out across the table. \"Because he\u0027s a government agent.\"\n I pulled a stool up and dusted it off. \"Doc Near is a government agent? I can\u0027t hardly believe that,\" I said.\n \"Believe it. It\u0027s too obvious. I don\u0027t know why you ain\u0027t already figured it out. Anyway, we got to get serious.\" He pulled out a worn-down nub of a grease pencil and sketched out a stick figure of a Vampire with oversized fangs, labeling it Dracula. Across the page he sketched out a rough image of a cowboy which, despite the lack of handsome distinguishing features, I assumed was me. \"I figure it\u0027s a combination of both fire and wood. So, what we got to do is figure out how to get fire and wood from here,\"\n he underlined me, \"to here,\" he underlined Dracula, \"without you getting close enough for them to get their fangs into you.\" Just for emphasis, he circled the fangs a couple of times.\n \"Yep,\" I said, \"that sounds like just exactly what we got to figure out.\" His eyes started to glaze over and I grabbed my beer and wandered off. I could see that he was getting himself all worked up into one of those foamy creative states of mind.\n The creative process has always been a mystery to me. Watching Lenny struggle with the technical muse was what it must have been like watching Michelangelo just before he painted the Sistine Chapel. I\u0027ve painted my share of ceilings, but they was pretty small and generally of one color. Michelangelo painted a big old church with all kinds of little pictures and I reckon the difference between us, other than I can\u0027t paint little pictures whatsoever, is agony Artists have to agonize. Creation springs from it. They have to torture themselves before they can work up enough interest and motivation to undertake such an endeavor. If they wasn\u0027t in agony, if they was just working at any old job and laughing and goofing around, they wouldn\u0027t be artists. I suppose that\u0027s what separates them from the rest of us folk. They don\u0027t mind subjecting themselves to the tortured state from which they can sit down and write War and Peace or paint the Sistine Chapel, whereas most of us would just as soon take a nap or else go have a beer.\n Inconspicuous as possible, I watched Lenny. He drew stuff. He talked to himself. He flipped through books and laughed at jokes in his head.\n He held his knees and rocked back and forth like a child. I just kept on drinking beer and stacking up the empties until his eyes sort of cleared and he said, \"Come back later. I got some ideas.\"\n By the time I got back to Dad\u0027s, it was getting on to dark. The sun was setting over the mountains and staining the clouds bunched up there, so I sat in the truck for a few minutes trying to memorize the beauty there. Dad come out on the porch and waved me in. He set out a pot of beans he\u0027d cooked up with a ham bone, along with some fried potatoes, store-bought tortillas, and fresh tomatoes cut up and a couple of deviled eggs from the Widow Johnson.\n We didn\u0027t say much and I could tell he was troubled of mind. \"I still think I should go with you, Tuck.\"\n \"Nope. I want you here. Lizzie may be trying to call or even come back. If she does, you got to take care of her until I can get back. I\u0027ll give you a call every couple of days to check in. Can I borrow the Casull?\"\n He looked at his prize pistol in its holster hanging from the bedpost. \"What am I supposed to do if they come back for me?\" he said.\n \"Give \u0027em some of these deviled eggs, I reckon.\"\n He sighed, slumped down in his chair. \"I hope Lizzie\u0027s okay,\" he said.\n \"Me too. Now let me help you with the dishes.\"\n Afterward he turned on the TV so he could read a book and I gnawed off some more of that horse painkiller. Pretty soon it had me nodding and I curled up on the couch, letting my mind wander unchecked until it settled on Lizzie. It felt like I was somehow spanning the distance from LonePine to New York with just my thoughts. She was the focusing point, like my love was the sun shining through a giant magnifying glass and reflecting down into one tiny, burning, hopeful point. I tried to expand it, to make it real, but a terrible darkness stole over the sun like a wet blanket.\n Something tugged hard at my heart and waves of sorrow and despair washed over me like a rock had been thrown into hell\u0027s pond and the ripples eventually come crashing up to pull me down. Underneath it all I could see the evil, smiling face of the Vampire I\u0027d shot, with his arms reaching out for me. Behind him, growing faint, was Lizzie, looking beautiful and sorrowful and sinking away.\n I awoke with a shout that startled Dad out of his chair. I checked the clock on the VCR and it was just after midnight. \"Let\u0027s head back over to Lenny\u0027s, see what he\u0027s rustled up.\"\n It was a quiet drive on a dark night. There ain\u0027t much traffic around LonePine at midnight, save the occasional folks returning from late night social events hosted by women whose husbands work the graveyard shift. The lights were all off in Lenny\u0027s trailer so we idled on down to the shop.\n He had fallen asleep over the workbench, but the sound of the door opening roused him. His hair was tangled over his face and littered with shreds of candy-bar wrappers and metal shavings; a pyramid of beer cans surrounded him. Dad nodded at him.\n \"Lenny, how you doing?\" I asked.\n He stretched, rubbed his eyes and yawned. \"Damn, Tucker, you owe me for this one.\" He pointed at a bundle on the table.\n \"That\u0027s the best I could come up with on such short notice.\" He dumped out a bucket full of peculiar-looking shotgun shells and unwrapped a sawed-off double barrel shotgun beside them. \"I took apart these standard three-inch mag shells and replaced the buckshot with a seven-inch birch dowel. I sharpened it up and reinforced the tip with sterling silver so it won\u0027t splinter apart when it hits one of \u0027em. Silver is supposed to be disagreeable to all things supernatural. Of course, you can only use them in a breech loader like this here. Watch this.\"\n He cracked it open and snuggled one of the shells into it, then put on some earplugs.\n \"Hold your ears.\"\n We did and he shouldered it and took aim across the room at an easy chair against the wall. There was a roar and a flash and bitter gunsmoke filled the air. The chair jerked backwards as if it\u0027d been kicked and the ragged end of a wooden dowel poked out of the fabric. \"It ain\u0027t much good over about twenty yards, but up to that it\u0027ll shoot straight. \u0027Course the downside is, you can only shoot twice before you have to reload.\" He tossed the shells into a canvas bag.\n \"Now these,\" he unwrapped a box of more familiar-looking shells, \"are from my own personal supply. They shoot a thermite load which, in case you ain\u0027t familiar, is magnesium based and burns white hot at like a thousand degrees or something. I\u0027d suggest one of each in the barrel. Stake them, then scorch \u0027em.\" He dropped them in the bag, too.\n \"Lastly, and this I\u0027m particularly proud of, is some homemade thermite grenades.\" He laid a half dozen duct-taped balls on the table. \"The engine case for a Volkswagen is pure magnesium. I ground one up and coated these here fragmentation grenades with the powder and then duct-taped it all into place. Once you pull the pin and give them a toss, you got about seven seconds to duck and run before the grenade blows, the magnesium ignites, and then rains down like lava. Expect about a twenty-foot kill zone and then add another forty to feel comfortable.\"\n \"Goddamn,\" I said, my mouth hanging open. \"Where the hell did you get this stuff?\"\n \"I have my sources.\"\n \"You scare me, Lenny.\"\n \"Ain\u0027t you I\u0027m worried about.\" He headed for the door. \"I think you\u0027re covered,\" he said. \"Let me know how this stuff works when you get back. Maybe we could start marketing it. I gotta go see if I\u0027m still married, and if so, get some sleep.\"\n I stuck the ammo and grenades in the duffel along with the shotgun, after wrapping it up in my denim jacket, then tossed the whole thing in the back of the truck. As we pulled out, Dad took a look at Lenny stumbling up to the trailer. \"You sure have some strange friends.\" \n","sourceLink":"https://allnovel.net/the-cowboy-and-vampire/page-8.html","bookId":2496,"book":{"id":2496,"title":"The Cowboy and Vampire","description":"Storyline: \n Saddle up for a hilarious, existential gallop through the dying American west with an army of ancient bloodsuckers in hot pursuit. Welcome to LonePine, Wyoming, population 438, where the best of the west faces off against the rise of the undead. It’s a love story for the ages. Worlds collide in The Cowboy and the Vampire: A Very Unusual Romance, when a broke cowboy and a glamorous big city reporter fall lipstick over boot heels in love. But she carries a 2000-year-old secret in her veins that will test their unusual romance. Can her big city smarts combined with his western courage keep an undead love alive? This is the first book of The Cowboy and the Vampire Collection.\n \n","cover":"https://allnovel.net/images/the-cowboy-and-vampire.jpg","author":"Clark Hays","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-cowboy-and-vampire.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:50:55 PM"}}
