{"id":111778,"no":21,"title":"Page 21","content":"WESTCHESTER COUNTY, NY OCTOBER 22 \"Mr. Kraft wants to see you in his office,\" Maggie said as Patrick passed her desk. The strained look on his secretary\u0027s face told him the managing senior partner wasn\u0027t requesting a social visit. Patrick\u0027s stomach roiled. Great. He was living out of a suitcase, Pamela wouldn\u0027t return his calls, his clients were either bailing out - like Ben Armstrong who\u0027d taken Jarman\u0027s business to another firm with no explanation - or giving him ultimatums: Say good-bye to the sims or say good-bye to us. And now Alton Kraft was waiting for him. Just what he needed. Well, at least things couldn\u0027t get much worse. Or could they? Patrick laid his briefcase on his desk and glanced around. His office was small, as was his window with its limited view of downtown White Plains. But that left extra wall space for his law books. He liked his office. Cozy. He wondered how long he\u0027d be rating a window if his clients kept heading for the hills. He walked down the hall to Alton\u0027s office, took a deep breath, then stepped inside. A bigger office than Patrick\u0027s. Much bigger. Thicker carpet, bigger desk. Lots of window glass, and still plenty of space for books. \"Hi, Alton.\" \"Patrick,\" Kraft replied. No \"good morning\" or even a \"hello.\" Just his name, spoken in a flat tone from the man seated behind the mahogany desk. And no handshake. Kraft was something of a compulsive hand shaker, but apparently not today. His blue eyes were ice, glinting within a cave of wrinkles. Patrick\u0027s gut tightened. This did not look good. He dropped into a chair, trying to look relaxed. \"Maggie said you wanted to see me.\" \"A serious matter has come up,\" Kraft said, bridging his hands. \"One that needs to be addressed immediately. We all know about the recent exodus of your clients - \" \"Just a temporary thing, Alton. I - \" Kraft held up his hand. When the senior managing partner held up his hand, you stopped talking and listened. \"We\u0027ve been aware of the losses you\u0027ve been suffering and we\u0027ve sympathized. We were confident you\u0027d recover. But now things have taken an ugly turn. It was bad enough when it was just your client base that was eroding, but now the dissatisfaction is spreading to the partners\u0027 clients.\" \"Oh, hell,\" Patrick said. He could barely hear his own voice. \"\u0027Oh, hell\u0027 doesn\u0027t even begin to say it, Patrick. Two of the firm\u0027s oldest and biggest clients called yesterday to say they\u0027re having second thoughts about staying with us. They said they\u0027d always thought of Payes \u0026 Hecht as a firm that represented people, a firm above suchstunts - their word, not mine, Patrick - as representing animals. Who do we prefer as clients, they want to know: people or animals? Because it\u0027s time to choose.\" \"The sons of bitches,\" Patrick muttered. \"They may well be, but they\u0027re sons of bitches who pay a major part of the freight around here.\" And account for a lot of the senior partners\u0027 billable hours, Patrick thought. The partners had sat back and watched with clucks of the tongue and sympathetic shakes of the head as his client base headed south. No need for immediate concern: The firm adjusted salaries and bonuses according to each member\u0027s billing, so Patrick\u0027s bottom line would take the hit, not theirs. But when they saw their own paychecks threatened...ah, now that was a different story. Not that Patrick blamed them. He\u0027d do exactly the same. \"I don\u0027t think I have to tell you what needs to be done,\" Kraft said. Patrick knew. Shit, yes, he knew. \"And if I don\u0027t?\" \"I\u0027m already taking heat because of this, Patrick. Don\u0027t make it more difficult than it already is.\" Patrick understood. Alton Kraft had been his biggest supporter for partnership. If Patrick looked bad, he looked bad. The partners had probably told him to give Sullivan a choice: Stick with the sims or stay with the firm. Mutually exclusive options. The decision should have been a no-brainer except for the inconvenient fact that he\u0027d become attached to the Beacon Ridge sims. He enjoyed visiting them, liked the feelings that rolled off them - probably the nearest thing to worship he\u0027d ever experience. But all that was going to end. Because on his next visit he\u0027d have to tell them he was dropping their case. He\u0027d make up something good, and they\u0027d believe him, and they wouldn\u0027t hold it against him, because Mist Sulliman the best, Mist Sulliman never lie to sim, Mist Sulliman never let sim down. Yeah, right. Mist Sulliman feel like slime mold. He fought the urge to grab Kraft by his worsted lapels and shout, Fuck you, fuck the firm, and fuck all its candy-assed clients! Instead, he sighed and nodded. \"All right.\" He\u0027d lost his house, his girlfriend, and a shitload of clients. He couldn\u0027t afford to lose his job too. \"Good man,\" Kraft said. He rose and thrust out his hand. \"I\u0027ll tell the others.\" Nowthe handshake. Patrick made it as perfunctory as possible and beat it the hell out of there. Or maybe crawled was more like it. Or slithered. He felt like he\u0027d just ratted out a friend to the police. If the carpet had been shag he would have needed a machete to reach the door. As he passed Maggie again she cocked her head toward the waiting room farther down the hall. \"New client. No appointment. Wants to know if you can squeeze her in.\" \"Anew client? No kidding? What\u0027s my morning look like?\" \"Empty.\" Figured. \"Then by all means, \u0027squeeze her in.\u0027\" A few minutes later Maggie showed a statuesque brunette into his office and introduced her as Romy Cadman. Short dark hair, dark eyes, full lips, and long legs. Dressed on the casual side in a sweater and flared slacks under a long leather coat, all black. Patrick\u0027s spirits lifted. Nothing like a new client, and a beautiful one to boot. Maggie placed the woman\u0027s card on his desk:Romy Cadman - Consultant. \"I won\u0027t take up much of your time, Mr. Sullivan,\" she said as he rose to shake her hand. Patrick fixed on her eyebrows, so smooth, so dark, tapering to perfect points. Penciled? No, just naturally perfect. But he couldn\u0027t find much warmth in the deep brown eyes below - at least not for him. All business. A woman with a mission. Aconsultant with a mission. \"Take as much as you need,\" he said, thinking, I\u0027ve gotaaaaall day. He gestured to a seat. \"Please.\" \"That won\u0027t be necessary.\" Because she remained standing, so did Patrick. \"I understand, Mr. Sullivan, that you\u0027ve come under a lot of pressure from SimGen lately.\" \"SimGen?\" What was she talking about? \"No...I haven\u0027t heard a thing from SimGen.\" \"Indirectly, you have. They\u0027ve been contacting all your clients and either cajoling or coercing them into dropping you.\" Patrick decided he\u0027d sit now. It sounded so paranoid, but only for a second or two, and then it made terrible sense. \"How do you know? Howcan you know?\" \"Not important,\" Ms. Cadman said. \"What matters is whether they\u0027re succeeding.\" \"What do you mean?\" She cocked her hip and released an exasperated sigh. \"They want you to drop the sims. Are you going to stand up to SimGen, or cave in?\" Cave in...hell of a way to put it. At least he knew where Ms. Romy Cadman\u0027s sympathies lay. So no way was he going to tell her he\u0027d decided to do just that: cave in. His eyes drifted to those long legs. They looked strong. \"May I inquire as to your interest in this?\" \"I want to see the sims get a fair shake.\" He glanced at her card again.Consultant ...to whom? \"Are you with one of those animal rights groups?\" \"My interest is personal. So what\u0027s your decision, Mr. Patrick Sullivan, attorney at law?\" The subtle little twist she put on those last three words gave Patrick the impression that somehow she\u0027d already guessed the answer. \"I haven\u0027t come to one yet.\" She stared at him a moment, her expression dubious. Then she put her briefcase on the table and released the catches. \"Very well. If you\u0027re sitting on the fence, perhaps this will tip you toward the sims.\" She gave the briefcase a one-eighty swivel, lifted the top, and Patrick found himself nose to nose with more cash than he\u0027d ever seen in one spot in his life - he\u0027d handled bigger checks, sure, but this wascash . Hoping his eyes weren\u0027t bugging, he lifted a packet and fanned it. \"All twenties, Mr. Sullivan.\" \"How - ?\" The words seemed to catch in his throat. \"How many?\" \"Exactly twelve hundred and fifty. To spare you from doing the math, that\u0027s a quarter of a million dollars. When I have your assurance that you will continue the fight, I will deposit all of it into the sim legal defense fund.\" Patrick eyed the money. This would take him a long way into that case; and with other contributions he could stir up during the proceedings, probably all the way through, with maybe a good chunk left over at the end. Tempting...Jesus, it was tempting. The added prospect of spending time with this woman because of it made the offer even more tempting. Pamela had been gone for weeks and... No. Staying with the sims meant being booted from the firm...going solo. He didn\u0027t care for that idea. Payes \u0026 Hecht could be a cutthroat place at times, but even on the worst days he found a certain level of comfort in having a firm behind him. Like a security blanket - one trimmed with barbed wire, perhaps, but still... And where would he be after the sim case, whatever the outcome? Who\u0027d be his future clients? Sims? Hardly. Uh-uh. Tempting as all that cash might be, he wasn\u0027t going to commit professional seppuku for it. But he couldn\u0027t say that to this beautiful woman. Painfully he pulled his gaze away from the money and looked at her. \"I\u0027ll take that into consideration, Ms. Cadman.\" \"Good.\" She snapped the cover closed on all that beautiful green. \"When do you expect to finalize your decision?\" \"Before the end of the day.\" \"Wonderful.\" One word...but the acid she managed to lace through it seared him to the core. She was looking right through him, and her eyes, the twist of her lips, everything in her body language radiated contempt. \"My number is on the card. Call me when you decide.\" She turned and walked out, leaving him mired in a pool of dismay. A woman like that, you wanted her looking at you with admiration, not like something that had just crawled out from under a rock. But what else was he supposed to do? What elsecould he do? Sometimes you simply had to be pragmatic. Patrick sighed. The perfect cap on the worst weeks of his life. He heard a patter behind him and turned toward the window. It had begun to rain. Great. With his mood darker than the weather, Patrick stepped out into the hall. Off to his right he spotted the pretty lady with the briefcase full of pretty money waiting for the elevator. \"I\u0027m going to grab a cup of coffee,\" he told Maggie. \"Want me to get it for you?\" she said, looking up from her computer screen. \"Thanks, but you\u0027re busier than I am at the moment.\" Down the hall, laughter echoed from the open doorway of the kitchenette that housed the coffee maker and a small refrigerator. He slowed his approach when he heard his name. A voice he recognized as belonging to Rick Berger, one of the younger associates, was saying, \"...and so when Istill won\u0027t give Skipper a steak instead of dog chow, he says, \u0027I\u0027ll get you! I\u0027m calling Sim- Sim Sullivan!\u0027\" More laughter. Patrick felt his face flush. Setting his jaw he turned and glanced back at the waiting area. The elevator doors were sliding open and Romy Cadman was stepping inside. He broke into a run. \"Ms. Cadman! Hold those doors!\" She turned and gave him a curious look, but put out a hand to stall the doors. He hopped into the cab beside her. \"I\u0027ve made up my mind,\" he told her. She blinked, shock and disbelief playing tag across her features. \"You mean - \" I know I\u0027m going to regret this, he thought, but fuck \u0027em. Fuck \u0027em all. \"Damn right. Want to meet my clients?\" Her smile lit the elevator. \"I\u0027d love to.\"","sourceLink":"https://allnovel.net/sims/page-21.html","bookId":2553,"book":{"id":2553,"title":"SIMS","description":"Storyline: Sims (Sims complete) Just a few hundred genes separate humans from chimpanzees. Imagine someone altering the chimp genome, splicing in human genes to increase the size of the cranium, reduce the amount of body hair, enable speech. What sort of creature would result? Sims takes place in the very near future, when the science of genetics is fulfilling its vaunted potential. It\u0027s a world where genetically transmitted diseases are being eliminated. A world where dangerous or boring manual labor is gradually being transferred to \"sims,\" genetically altered chimps who occupy a gray zone between simian and human. The chief innovator in this world is SimGen, which owns the patent on the sim genome and has begun leasing the creatures worldwide. But SimGen is not quite what it seems. It has secrets . . . secrets beyond patents and proprietary processes . . . secrets it will go to any lengths to protect. Sims explores this brave new world as it is turned upside down and torn apart when lawyer Patrick Sullivan decides to try to unionize the sims. Right now, as you read these words, some company somewhere in the world is toying with the chimp genome. That is not fiction, it is fact. Sims is a science thriller that will come true. One way or another.","cover":"https://allnovel.net/images/sims.jpg","author":"F. Paul Wilson","type":"Horror","source":"allnovel","link":"https://allnovel.net/sims.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 6, 2019 12:30:31 AM"}}
