{"id":111791,"no":34,"title":"Page 34","content":"SUSSEX COUNTY, NJ\n NOVEMBER 14\n As soon as Luca stepped into the room, the usually listless Sinclair-2 rose from his seat and came toward him. He looked like he\u0027d slept in his clothes; his face flushed as he started shouting.\n \"It was you, wasn\u0027t it! You killed those sims! You monster! Youmonster !\"\n \"Calm down, Ellis,\" Abel Voss said, putting an arm around the man\u0027s shoulders. \"You can\u0027t go makin wild accusations like that.\"\n \"I can!\" Sinclair-2 cried. \"I know this man\u0027s methods. And if he didn\u0027t do it himself, he sent one of his hired thugs!\"\n No, Luca thought. I did it myself. A one-man op. That\u0027s what you have to do sometimes if you want to be sure a job gets done right.\n It had taken Luca about a week after the Saw Mill River Parkway debacle to put all the pieces in place. Two nights ago he\u0027d made his move.\n But the op developed an early hitch: a tail. If he hadn\u0027t been looking for one, he never would have spotted it. But he\u0027d been prepared.\n He\u0027d driven into midtown Manhattan and valet-parked his car at the New York Hilton, then zipped through the lobby and out a side exit where he hailed a cab that took him to a second car that had been left for him in a lot near the theater district. He\u0027d driven out of town immediately, directly to Westchester where he\u0027d parked a good mile from the Beacon Ridge Country Club. He\u0027d walked the rest of the way, ducking into the shadows whenever a car approached. When he reached the club, he\u0027d huddled in the hedges until the sims were all in their barrack and the last human had left.\n Or so he\u0027d thought. That was when he\u0027d almost got caught. He\u0027d been about to step out of the bushes when he spotted two dark figures gliding between the shadows near the barrack. As he\u0027d watched, they separated, one swiftly climbing a tree, the other disappearing into the bushes.\n Someone had the sim quarters under guard. Sullivan? Cadman? No matter. That hadn\u0027t been Luca\u0027s destination. He was headed for the sprawling structure on the crest of the hill, the club\u0027s main building.\n Soon he\u0027d reached his destination: the kitchen. Once he\u0027d located the cooking pot labeledSIMS he removed a vial of clear odorless liquid from his breast pocket. A brand new compound sent down through Lister from SIRG; so new it didn\u0027t have a name yet, only a number: J7683452.\n He\u0027d emptied the vial into the big pot and begun swirling the liquid around, coating the sides and bottom. When it dried, it was invisible. The only thing that could have gone wrong was somebody washing out the pot. But it had been hung up clean, so that was unlikely.\n Amazing stuff, J7683452. He could have stuck his head into that pot, licked its insides clean, and he\u0027d be fine. Perfectly harmless in that state. But heat it to a hundred-and-sixty degrees or more and...\n Bon appetit.\n As for here and now, he didn\u0027t owe the Sinclair brothers an explanation. And they didn\u0027t deserve one.\n \"Admit it, Portero! You murdered those nineteen sims!\"\n \"Murdered?\" he said with a calculatedly derisive snort - few things gave him more pleasure than getting under these twits\u0027 skins. \"They\u0027re animals. They can be killed, they can be slaughtered, they can be sacrificed to the gods, but they can\u0027t be murdered.\"\n With a hoarse roar Sinclair-2 launched himself at Luca, only to be hauled back by the heavier, stronger Voss.\n \"You don\u0027t want to be doin that, son,\" Voss said. \"Trust me, you don\u0027t.\"\n \"Ellis, for God\u0027s sake control yourself!\" Sinclair-1 said.\n \"Listen to them,\" Luca said softly.\n He hadn\u0027t moved a muscle. He\u0027d take no pleasure in hurting Sinclair-2 - it would be like fighting a woman - but he could not allow another man to lay a hand on him.\n Sinclair-2 struggled a moment, then pulled free and returned to his usual spot on the sofa where he dropped his face into his hands.\n What gives with that guy? Luca wondered. How can he be such a wimp?\n \"Did you?\" Sinclair-1 said, staring at him. \"Were you responsible for poisoning those sims?\"\n \"Does it matter?\" Luca said.\n No one answered.\n Just as I thought. They don\u0027twant to know.\n \"Just tell me one thing,\" Voss said. \"And think very carefully on your answer: Will the perpetrator or perpetrators ever be found?\"\n \"My guess?\" Luca shook his head. \"Never. But whoever they were, they did us a favor. The Beacon Ridge club has surrendered. They\u0027re giving the sims what they want.\"\n \"Since when?\" Voss said. \"I ain\u0027t heard nothin about this.\"\n \"That\u0027s because they haven\u0027t made the announcement yet.\"\n \"If that\u0027s true,\" the attorney said, his eyes widening, \"it takes the matter out of the court\u0027s hands.\"\n \"No precedent,\" Sinclair-1 whispered.\n Luca watched cautious optimism grow in their eyes. He\u0027d be sharing in that good feeling if not for a call he\u0027d received this morning. Nothing more than a hoax, he hoped - prayed. Or maybe a wild fantasy cooked up by some drugged-out waste of protoplasm. He\u0027d fed it to Lister who\u0027d pass it up the SIRG ladder, but he\u0027d keep it from the Sinclairs for now. He suspected a leak somewhere, and if he was right, the less said here, the better.\n But he dearly wished he could lay it on these two. The mere mention now of what the woman on the phone had told him would snuff out the relief warming Sinclair-1 and Voss as if it had never been.\n Because if this woman had been telling the truth about a sim named Meerm, it made the threat they\u0027d just overcome seem like a pebble in a mountain gorge. \n","sourceLink":"https://allnovel.net/sims/page-34.html","bookId":2553,"book":{"id":2553,"title":"SIMS","description":"Storyline: \n Sims (Sims complete) \n Just a few hundred genes separate humans from chimpanzees. Imagine someone altering the chimp genome, splicing in human genes to increase the size of the cranium, reduce the amount of body hair, enable speech. What sort of creature would result? \n Sims takes place in the very near future, when the science of genetics is fulfilling its vaunted potential. It\u0027s a world where genetically transmitted diseases are being eliminated. A world where dangerous or boring manual labor is gradually being transferred to \"sims,\" genetically altered chimps who occupy a gray zone between simian and human. The chief innovator in this world is SimGen, which owns the patent on the sim genome and has begun leasing the creatures worldwide. \n But SimGen is not quite what it seems. It has secrets . . . secrets beyond patents and proprietary processes . . . secrets it will go to any lengths to protect. Sims explores this brave new world as it is turned upside down and torn apart when lawyer Patrick Sullivan decides to try to unionize the sims. \n Right now, as you read these words, some company somewhere in the world is toying with the chimp genome. That is not fiction, it is fact. Sims is a science thriller that will come true. One way or another.\n \n","cover":"https://allnovel.net/images/sims.jpg","author":"F. Paul Wilson","type":"Horror","source":"allnovel","link":"https://allnovel.net/sims.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 6, 2019 12:30:31 AM"}}
