{"id":111798,"no":41,"title":"Page 41","content":"Patrick sat in the driver seat of Zero\u0027s van, idly watching the little office building. He\u0027d parked across the street in a church parking lot - Our Lady of Something-or-other - and left the engine idling to run the heater, but he was keeping his window open to let out the pungent odor that seemed to be ingrained into the van\u0027s metal frame. The driver seat felt like little more than a sheet of newspaper spread over a collection of rusty springs. But the sharp jabs against his butt were inconsequential compared to the discomfort of sharing the van with the shadowy form seated behind him. Here was a perfect opportunity to probe Zero, maybe get a line on what made this bird tick, but Patrick found himself tongue-tied. What do you say to a masked man? Had to give it a shot: \"Do you mind if I ask you a personal question?\" Zero\u0027s deep voice echoed from the dark recess at the rear of the van. \"Depends.\" \"Why do you call yourself \u0027Zero\u0027?\" \"That is my name.\" Ooookay. Try another tack. \"How about them Mets?\" That was usually a foolproof conversation opener, especially out here on the Island, even in the off-season. \"What do you think of that last round of trades?\" \"I don\u0027t follow sports.\" Okay, strike that. Maybe if we concentrate more on the moment... \"You have any idea what this van was used for before you got it?\" \"It was a delivery truck run by a Korean Christian group in Yonkers.\" \"Smells like they spilled a gallon of roast puppy stew on the way to the annual church potluck dinner.\" Patrick heard a soft chuckle. \"I can think of worse things to spill.\" Hey, he laughs! \"You mean, be grateful for small favors, right?\" \"Small and large. I\u0027m grateful the Reverend Eckert has finally been able to purchase space on a satellite.\" \"That means he\u0027ll be beaming his anti-SimGen sermons direct.\" \"Right. No more worries about SimGen influencing the syndicate that distributes his show to local stations. Not only can he beam his shows to the syndicate, but he\u0027s now got direct access to anyone with a satellite dish.\" \"Nice. A big jump in audience.\" \"I\u0027m grateful too,\" Zero said, \"for how well you and Romy are working together.\" \"So far, so good. She\u0027s a piece of work.\" \"That she is. One very intense young woman. Tell me, Patrick, do you hope for a closer relationship between the two of you?\" Patrick blinked in surprise. Odd question. \"Do you mean working or personal?\" \"Personal.\" \"Is there something I don\u0027t know?\" he said, turning to look at Zero. He wished he\u0027d take off that mask. \"Is there something going on between you and Romy? Because if there is - \" Zero gave a dismissive wave. \"Nothing, I assure you. I am...unavailable.\" That was a relief. \"Well, okay, but all I can say is, whether or not we go the next step is up to her. If you\u0027re worried about a romance between us interfering with our job performance, rest easy. The lady has thus far found the strength of character to resist my charms.\" \"Which I\u0027m sure are considerable.\" \"As me grandma used to say,\" he said in a pretty fair Irish accent, \"from yer lips to Gawd\u0027s ear.\" \"Speaking of God, I\u0027ve been looking at this church. Are you Catholic?\" \"With a name like Patrick Michael Sullivan, could I be anything else?\" \"Practicing?\" \"No. Pretty much the fallen-away variety. Haven\u0027t seen the inside of a church for some time.\" \"But you do believe in God.\" \"Yeah, sure.\" Where was this going? \"Did you know that some sims believe in God, even pray to Him?\" \"No. I didn\u0027t.\" For some reason the idea made him uncomfortable. \"Any particular faith?\" \"They tend toward Catholicism. They like all the statues, although they find the crucifix disturbing. They\u0027re most comfortable with the Virgin Mary. Pick through any sim barrack and you\u0027ll usually find a few statues of her.\" \"I can see that. A mother figure is comforting.\" \"Sims pray to God, Patrick. But does God hear them?\" \"What do you mean?\" \"Do sims have souls?\" \"This is heavy stuff.\" \"Most enlightened believers accept evolution. Genetics makes it impossible for an intelligent person to deny a common ancestor between chimps and humans. Some theologians posit a \u0027transcendental intervention\u0027 along the evolutionary tree, the moment when God imbued an early human with a soul. So I ask you, Patrick: When human genes were spliced into chimps to make sims, did a soul come along with them?\" \"To tell the truth,\" Patrick said, \"I\u0027ve never given it an instant\u0027s thought until you just mentioned it.\" Who had time to ponder such imponderables? Zero, obviously. And it seemed important to him. \"Think about it,\" Zero said. \"Sims praying to a God who won\u0027t listen because they have no souls. Imagine believing in a God who doesn\u0027t believe in you. Tragic, don\u0027t you think?\" \"Absolutely. But I wonder - \" The wail of a siren cut him off. He watched as an ambulance screamed into the parking lot across the street. \"You think that\u0027s for Romy?\" \"I imagine so.\" Zero\u0027s voice now was close behind him. \"I told her to give it her best performance.\" They watched a pair of EMTs, a wiry male and a rather hefty woman, hurry inside. A few moments later they reemerged, pulled a stretcher from their rig, and hauled it inside. \"Wow,\" Patrick muttered. \"She must be bucking for an Oscar.\" He kept his tone light but felt a twinge of anxiety at the way those EMTs were hustling. A long ten minutes later they exited, wheeling the stretcher between them. But it wasn\u0027t empty this trip. Patrick could make out a slim figure in the blanket. Had to be Romy. He noticed that her head was swathed in gauze...with a crimson stain seeping through. \"Shit!\" he cried, fear stabbing him as he reached for the door handle. \"She\u0027s bleeding!\" \"Wait!\" he heard Zero say, but he was already out and moving toward the street. No way he could sit in a van and watch Romy be wheeled into an ambulance by strangers when she was hurt and bleeding. Her gaze flicked his way as he dashed into the parking lot. When he saw her hand snake out from under the blanket and surreptitiously wave him off, he slowed his approach. And when she gave him a quick thumbs-up sign, he veered off and headed for the office building. He waited inside until the ambulance wailed off, then crossed back to the van. \"She seems okay,\" he said as he climbed back into the driver seat. \"Wonderful,\" replied the voice from the dim rear. \"But what the hell happened in there?\" He threw the shift into forward and took off after the receding ambulance. \"She was supposed to stand clear and fake being hurt. How the hell did she cut her head open?\" \"I should have foreseen this,\" Zero said. \"This is so Romy.\" \"What do you mean?\" \"Don\u0027t you understand? She had to make it real. She had to send a message to Manassas and SimGen and whoever else is involved that she\u0027s ready to bleed for her beliefs.\" \"Sheesh,\" Patrick muttered. \"Isn\u0027t she wonderful.\" It wasn\u0027t a question. In that moment Patrick realized that the mysterious Zero, although \"unavailable,\" was as smitten with Romy Cadman as he was. \"What is it about her?\" Patrick said. The ambulance was still in sight, though blocks ahead. Tailing it was easy in the light traffic. \"I mean, you\u0027re obviously taken by her, and I confess I\u0027m drawn to her - \" \"Drawn?\" \"Like a moth to a searchlight. And then that guy Portero - \" \"The SimGen security chief?\" \"He\u0027s got it bad for her. Might as well have written it on his forehead in DayGlo orange. What is it about Romy Cadman?\" \"Simple: her purity.\" Patrick didn\u0027t have to ask. He knew Zero wasn\u0027t talking about virginity. He was talking about heart, about purpose. \"I hear you. But Portero didn\u0027t strike me as the kind who\u0027d go for that.\" \"Some men approach purity like Romy\u0027s simply to protect it from harm; and some wish to draw closer in the hope that it will rub off on them or somehow cleanse them; and others want to possess it merely to defile it and extinguish it because it reminds them of what they have become, as opposed to what they could have been.\" Patrick glanced Zero\u0027s way in the rearview. He\u0027d obviously given a lot of thought to this. \"Well, I guess we know where Portero fits in that scheme.\" \"I think we do.\" \"But how about you?\" A long pause, then Zero said, \"If my circumstances were different, I\u0027d be content merely to warm myself in her glow. And if I couldn\u0027t do that I\u0027d settle for curling up outside her door every night to keep her safe from trespassers.\" Patrick swallowed, unexpectedly moved. \"You know, Zero,\" he said, his voice a tad hoarse, \"I\u0027ve got to admit I\u0027ve had my doubts about you. Major, heavy-duty doubts. But now...\" \"Now?\" Patrick didn\u0027t know quite what to say. Any man who could pinpoint Romy as Zero had, and who could not only feel about her the way he\u0027d described, but come out and say it... \"You\u0027re all right.\" Lame, but the best Patrick could do at the moment. At least it was sincere. Romy would appreciate that.","sourceLink":"https://allnovel.net/sims/page-41.html","bookId":2553,"book":{"id":2553,"title":"SIMS","description":"Storyline: Sims (Sims complete) Just a few hundred genes separate humans from chimpanzees. Imagine someone altering the chimp genome, splicing in human genes to increase the size of the cranium, reduce the amount of body hair, enable speech. What sort of creature would result? Sims takes place in the very near future, when the science of genetics is fulfilling its vaunted potential. It\u0027s a world where genetically transmitted diseases are being eliminated. A world where dangerous or boring manual labor is gradually being transferred to \"sims,\" genetically altered chimps who occupy a gray zone between simian and human. The chief innovator in this world is SimGen, which owns the patent on the sim genome and has begun leasing the creatures worldwide. But SimGen is not quite what it seems. It has secrets . . . secrets beyond patents and proprietary processes . . . secrets it will go to any lengths to protect. Sims explores this brave new world as it is turned upside down and torn apart when lawyer Patrick Sullivan decides to try to unionize the sims. Right now, as you read these words, some company somewhere in the world is toying with the chimp genome. That is not fiction, it is fact. Sims is a science thriller that will come true. One way or another.","cover":"https://allnovel.net/images/sims.jpg","author":"F. Paul Wilson","type":"Horror","source":"allnovel","link":"https://allnovel.net/sims.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 6, 2019 12:30:31 AM"}}
