{"id":111826,"no":70,"title":"Page 70","content":"NEWARK, NJ The rain clouds that had been threatening all day opened up just in time to snarl traffic throughout the metropolitan area. So it was well after dark when Luca and his men arrived at the crib. Benny Morales met them at the front door. \"Upstairs!\" he said, leading them up a narrow stairway. \"I got her trapped, locked up tight inna closet an I been keepin an eye on it all a time \u0027cept for when I was watchin for you at the window so I know she still in there.\" Morales had reminded Luca of a ferret last visit; now he was a ferret on speed. Luca could understand that. The little man was going to be a multi-millionaire. But Luca was going to recapture his pride and his credibility, and maybe even his future, and that was worth more. \"There it is,\" Morales said, as he led them into a bunk-filled space on the second floor. \"Where are the rest of your sims?\" \"Not back yet.\" He glanced at his watch. \"Maybe half hour. But look here.\" He stepped farther into the room and pointed to a door on the right. \"She in there.\" He held up an old-fashioned skeleton key. \"I got her locked and blocked. She ain\u0027t goin nowhere nohow.\" Luca smiled. Morales wasn\u0027t kidding. He\u0027d wedged a chair under the doorknob. Hiding his excitement, he held out his hand and Morales dropped the key into his palm. He stepped to the door, removed the chair, and poised the key before the lock. \"Meerm?\" he said though the door. \"My name is Luca Portero. I am from SimGen.\" He spoke softly, maintaining a calm, soothing tone. He wanted to take this sim with the least possible fuss and muss. Everyone - from the Sinclairs all the way to the top of SIRG - wanted her and her unborn baby alive and well. The better the condition he delivered her in, the better for him. But if she was going to make this difficult he\u0027d come prepared. One way or another, Luca intended to leave here tonight with the world\u0027s only pregnant sim. \"The company has sent me here to protect you, Meerm. We know you\u0027re not feeling good and we\u0027re here to take you back to where you can rest and get well. I\u0027m going to open the door now.\" Luca slipped the key into the lock and turned it. As he gripped the knob... \"Don\u0027t worry if you don\u0027t see her right away,\" Morales said from a few feet behind him. \"Like I told you, there\u0027s this loose piece of wallboard and - \" Without looking back, Luca waved for him to shut the hell up. He turned the knob and pulled the door open - slowly, so as not to appear the least bit aggressive. As Morales had said, the closet looked empty. Some old shoes, some hanging clothes, a hat or two on the shelf. \"Upper right,\" Morales said in a stage whisper. \"Above the shelf. See the loose board?\" Luca nodded. The remodeling had been done on the cheap, probably not even up to code. Or maybe the codes had been relaxed because the floor wasn\u0027t designated for human habitation. Whatever the reason, the framing studs looked to be about two feet apart and the wallboard carelessly nailed. As a result the whole upper corner of the inner wall had popped loose, allowing easy access to a dead space beyond. Luca held back a hand, palm up. \"Flashlight,\" he said, and one was slapped into it. He dragged the chair into the closet and stepped up on it for a better look. He pushed back the board and shone the light into the opening. But instead of the expected pair of frightened brown sim eyes staring back at him, he found an empty space. Cold sweat started in his armpits as he quickly angled the beam around, revealing knotty studs, the unfinished reverse sides of wallboard, lots of crumbling brick, but no sim. No goddamned sim! \"She\u0027s not here!\" he rasped through his sand-dry throat. \"You said she was here! Where is she?\" \"Whatchoo you mean, she not there?\" Morales cried, a panicky edge to his voice. \"She gotta be there! I lock her in myself! She can\u0027t be nowheres else!\" Luca poked his head through the opening. The dead space was deeper than he\u0027d have thought. It angled back around the rear of the closet, beyond his field of vision. \"Meerm?\" he called, still keeping his voice soft. \"Meerm, are you there? We\u0027re here to help you.\" No reply. Not a rustle of movement, not even a breath. Okay, he thought. She wants to play it that way, then the gloves have to come off. He swiveled and hopped off the chair. Morales was waiting for him right outside the closet door. \"Lemme see that light! I find her for you! I know she there!\" Luca studied him a moment. He hadn\u0027t been lying about seeing a sim in there. He was too upset. Probably he\u0027d had the five million already half spent in his head and now he saw it slipping away. Luca shoved him aside. \"Go find yourself a corner and stay out of the way, little man. We\u0027re going to do it our way.\" He looked at his three men and jerked a thumb over his shoulder, toward the street below. \"She\u0027s hiding in the wall. Get the tools.\" They were back in two minutes with crowbars, axes, and sledgehammers. \"Hey, whatchoo think you doin?\" Morales cried, running over. Luca held up a crowbar and glared at him. \"You want to be alive to collect your reward, right? Then stay the hell out of our way.\" With that he turned and smashed the curved end of the bar through the wallboard, gave it a half twist, and yanked back, dislodging one side of the board from its stud. His men did the same, attacking the closet and the walls around it with gusto. In five or six minutes they\u0027d stripped this end of the room back to the underlying brick. But still no sim. Luca wanted to scream. Where could she be? Had Morales lied to him? But there seemed no point to that. Then he heard Alessi\u0027s voice from his left, near the corner of the room. \"Aw, shit, boss. Take a look at this.\" Luca hurried over and saw a large hole in the bricks. He grabbed the flashlight and shined the beam through. More bricks inside. He stuck his head inside and looked up and down. Cool musty air wafted against his face from below. \"Looks like an old airshaft.\" His voice echoed off the walls. He pulled back and found Morales standing a few feet away, his hands rubbing over each other in a nervous, washing motion. \"Where\u0027s it go?\" Morales shrugged. \"I didn\u0027t even know it was there. Nobody tell me nothin.\" Okay. The sim had crawled from the dead space behind the closet into the air shaft. Once in there she had two directions to choose from: up or down. Considering she was frightened and pregnant, she\u0027d have taken the easiest and fastest route. \"Check out the first floor,\" he told his men. \"Tear out the wall and see if there\u0027s an opening down there.\" To Morales: \"You got a basement here?\" \"Sure.\" \"Show me.\" He followed the little man down two levels. When Morales turned on the basement lights, Luca saw a piece of plywood and its exposed nails dangling from the ceiling, smears of blood on the floor, on the wall, and on the sill of the open window, and he knew in one spirit-crushing instant what had happened. The sim had eased herself down the shaft and landed on the plywood that had closed the opening. Her weight knocked the crudely fixed board free and she\u0027d fallen to the floor, cutting herself on the nails in the process. She\u0027d limped to the window, opened it, and squeezed through. Gone! Without warning - Luca was barely aware of what he was doing - he grabbed Morales and flung him against the wall. The ferret-man slammed against the concrete and slumped to the floor, wincing and clutching his shoulder. \"Aw, man!\" he moaned. \"Whatchoo do that for?\" Because it feltgood! Luca wanted to scream. Instead he said, \"Because you had her and you let her slip away!\" \"I did everythin I could!\" \"Not enough!\" Luca sensed his rage peaking toward critical mass. He forced himself to step back, knowing if he let himself get any closer to the whining little bastard he\u0027d break his neck. \"You had her! You had her and you let her get away!\" At least that was the way it seemed. Luca glanced around. But what if she just wanted him to think that was what happened? What if - ? Wait. What was he thinking? He was dealing with a sim. They didn\u0027t have the brains for misdirection. Still...this one had made a fool of him once already... Just to be sure, Luca did a quick search of the basement. Not much down here; no closets or crawl spaces to hide in, just cinderblock walls and solid concrete floor. Satisfied that she was gone, he closed and locked the open window and headed for the stairs, leaving Morales behind on the floor. He called his three men together and faced them in the front hallway. \"All right,\" he said, forcing a calm demeanor, \"here\u0027s the situation: She\u0027s gone. Escaped through the basement window.\" \"Shit!\" Grimes muttered. He was wiry and redheaded, and his Adam\u0027s apple wobbled in his long neck when he spoke. \"We\u0027ll never find her out there in the dark!\" Luca wheeled and got in his face. \"She\u0027s hurt, she\u0027s bleeding, she\u0027s on foot, she\u0027s pregnant, and she\u0027s a sim! If you can\u0027t track something like that, you should be working for somebody else!\" Grimes backed up. \"Okay, okay. Sorry.\" Luca turned away. He needed more men. He reached for his phone to call Lister, have him find back- up. They\u0027d comb this area until - The sound of squeaking brakes just outside the front door made him turn. A battered old school bus had pulled to a stop at the curb. As he watched through the cracked glass, the bus doors folded back and a line of sims began stepping down to the sidewalk. \"Hold everything,\" Luca said as he headed for the door. \"I think reinforcements just arrived.\" He hadn\u0027t wanted to call for help Now he wouldn\u0027t have to. He stationed himself at the top of the front steps and held up his hands. \"Nobody goes inside yet,\" he told the sims. He made them wait in the fine drizzle until the bus had emptied out. They looked to number about forty or so. \"Hey!\" the grizzled old driver said. He\u0027d come to the bus door and stood staring at Luca. \"Who are you?\" \"Someone who\u0027s commandeering these sims.\" \"They ain\u0027t yours to commandeer! Where do you get off thinkin - \" Luca glared at him. \"Move on, old man. This isn\u0027t your concern.\" The driver looked as if he were about to say something, then changed his mind. As the bus wheezed away, Luca turned back to the sims. \"We\u0027ve come for Meerm,\" he told them, raising his voice. \"We know you\u0027ve been hiding her. But that\u0027s all right. We\u0027re here to help her and - \" \"No!\" said a sim, pointing at Grimes. \"No help sim! Hurt sim!\" Luca looked more closely at the sim who\u0027d spoken and noticed that his left eye sported the yellowing remains of a shiner. He turned to Grimes. \"What\u0027d you do, Grimes?\" he said, keeping it low and through his teeth. \"Beat him up?\" Grimes blinked and swallowed. \"I thought he\u0027d lied to us, so I just - \" \"So you just scared the shit out of them, guaranteeing they\u0027d never tell us a thing. This could have been over a week ago, you fucking stupid - \" He turned away before he ripped out the man\u0027s bobbing Adam\u0027s apple and made him eat it. \"I\u0027ll deal with you later.\" Fighting for calm, he faced the sims again. He\u0027d hoped to enlist their voluntary support, make themwant to find Meerm for him. But Grimes had blown that, so he\u0027d have to take a direct approach. \"I know it\u0027s cold out and you\u0027re all probably tired and hungry. There\u0027s nothing you\u0027d like better now than to get inside and eat and relax, right? Well, guess what? That\u0027s not going to happen until Meerm is found. We\u0027re going to start searching now, and we\u0027re going to keep searching till we find her, even if it takes all night, understand?\" Luca could see from the resignation in their eyes that they understood, all right. They understood just fine. And this would work. He had forty-plus searchers instead of the maximum dozen humans he\u0027d be able to muster on such short notice. And these were better than humans. Who better to sniff out a sim than another sim? Yeah, this will work. Damn well better. But what if it didn\u0027t? What if they came up empty tonight and all this commotion caught the attention of some of Eckert\u0027s followers? Or Morales opened his yap to the wrong people? Eckert could wind up with the pregnant sim. He turned and found Morales standing in the front hallway. \"Listen up,\" he told the little man. \"If I find the sim, you get the five million. Anyone else finds her, you\u0027re out in the cold. So keep your mouth shut about this.\" Morales stared at him, rubbing his shoulder. \"First you push me around, then you do this. You loco, man?\" Not loco, Luca thought, turning away. But if anyone\u0027s going to bring in this sim, it\u0027s going to beme.","sourceLink":"https://allnovel.net/sims/page-70.html","bookId":2553,"book":{"id":2553,"title":"SIMS","description":"Storyline: Sims (Sims complete) Just a few hundred genes separate humans from chimpanzees. Imagine someone altering the chimp genome, splicing in human genes to increase the size of the cranium, reduce the amount of body hair, enable speech. What sort of creature would result? Sims takes place in the very near future, when the science of genetics is fulfilling its vaunted potential. It\u0027s a world where genetically transmitted diseases are being eliminated. A world where dangerous or boring manual labor is gradually being transferred to \"sims,\" genetically altered chimps who occupy a gray zone between simian and human. The chief innovator in this world is SimGen, which owns the patent on the sim genome and has begun leasing the creatures worldwide. But SimGen is not quite what it seems. It has secrets . . . secrets beyond patents and proprietary processes . . . secrets it will go to any lengths to protect. Sims explores this brave new world as it is turned upside down and torn apart when lawyer Patrick Sullivan decides to try to unionize the sims. Right now, as you read these words, some company somewhere in the world is toying with the chimp genome. That is not fiction, it is fact. Sims is a science thriller that will come true. One way or another.","cover":"https://allnovel.net/images/sims.jpg","author":"F. Paul Wilson","type":"Horror","source":"allnovel","link":"https://allnovel.net/sims.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 6, 2019 12:30:31 AM"}}
