{"id":39716,"no":1,"title":"CHAPTER I. INTRODUCTORY.","content":"I am beginning to write this book on board the brig ——, trading between Kingston, in Jamaica, and Cien Fuegos, on the southern coast of Cuba. At the present moment there is not a puff of wind, neither land breeze nor sea breeze; the sails are flapping idly against the masts; there is not motion enough to give us the command of the rudder; the tropical sun is shining through upon my head into the miserable hole which they have deluded me into thinking was a cabin. The marine people—the captain and his satellites—are bound to provide me; and all that they have provided is yams, salt pork, biscuit, and bad coffee. I should be starved but for the small ham—would that it had been a large one—which I thoughtfully purchased in Kingston; and had not a kind medical friend, as he grasped me by the hand at Port Royal, stuffed a box of sardines into my pocket. He suggested two boxes. Would that I had taken them! It is now the 25th January, 1859, and if I do not reach Cien Fuegos by the 28th, all this misery will have been in vain. I might as well in such case have gone to St. Thomas, and spared myself these experiences of the merchant navy. Let it be understood by all men that in these latitudes the respectable, comfortable, well-to-do route from every place to every other place is via the little Danish island of St. Thomas. From Demerara to the Isthmus of Panamá, you go by St. Thomas. From Panamá to Jamaica and Honduras, you go by St. Thomas. From Honduras and Jamaica to Cuba and Mexico, you go by St. Thomas. From Cuba to the Bahamas, you go by St. Thomas—or did when this was written. The Royal Mail Steam Packet Company dispense all their branches from that favoured spot. But I was ambitious of a quicker transit and a less beaten path, and here I am lying under the lee of the land, in a dirty, hot, motionless tub, expiating my folly. We shall never make Cien Fuegos by the 28th, and then it will be eight days more before I can reach the Havana. May God forgive me all my evil thoughts! Motionless, I said; I wish she were. Progressless should have been my word. She rolls about in a nauseous manner, disturbing the two sardines which I have economically eaten, till I begin to fear that my friend\u0027s generosity will become altogether futile. To which result greatly tends the stench left behind it by the cargo of salt fish with which the brig was freighted when she left St. John, New Brunswick, for these ports. \"We brought but a very small quantity,\" the skipper says. If so, that very small quantity was stowed above and below the very bunk which has been given up to me as a sleeping-place. Ugh! \"We are very poor,\" said the blue-nosed skipper when he got me on board. \"Well; poverty is no disgrace,\" said I, as one does when cheering a poor man. \"We are very poor indeed; I cannot even offer you a cigar.\" My cigar-case was immediately out of my pocket. After all, cigars are but as coals going to Newcastle when one intends to be in Cuba in four days. \"We are very poor indeed, sir,\" said the blue-nosed skipper again when I brought out my solitary bottle of brandy—for I must acknowledge to a bottle of brandy as well as to the small ham. \"We have not a drop of spirits of any kind on board.\" Then I altered my mind, and began to feel that poverty was a disgrace. What business had this man to lure me into his stinking boat, telling me that he would take me to Cien Fuegos, and feed me on the way, when he had not a mouthful to eat, or a drop to drink, and could not raise a puff of wind to fill his sails? \"Sir,\" said I, \"brandy is dangerous in these latitudes, unless it be taken medicinally; as for myself, I take no other kind of physic.\" I think that poverty on shipboard is a disgrace, and should not be encouraged. Should I ever be on shore again, my views may become more charitable. Oh, for the good ship \u0027Atrato,\u0027 which I used to abuse with such objurgations because the steward did not come at my very first call; because the claret was only half iced; because we were forced to close our little whist at 11 p.m., the serjeant-at-arms at that hour inexorably extinguishing all the lights! How rancorous were our tongues! \"This comes of monopoly,\" said a stern and eloquent neighbour at the dinner-table, holding up to sight a somewhat withered apple. \"And dis,\" said a grinning Frenchman from Martinique with a curse, exhibiting a rotten walnut—\"dis, dis! They give me dis for my moneys—for my thirty-five pounds!\" And glancing round with angry eye, he dropped the walnut on to his plate. Apples! and walnuts!! What would I give for the \u0027Atrato\u0027 now; for my berth, then thought so small; for its awning; for a bottle of its soda water; for one cut from one of all its legs of mutton; for two hours of its steam movement! And yet it is only now that I am learning to forgive that withered apple and that ill-iced claret. Having said so much about my present position, I shall be glad to be allowed to say a few words about my present person. There now exists an opportunity for doing so, as I have before me the Spanish passport, for which I paid sixteen shillings in Kingston the day before I left it. It is simply signed Pedro Badan. But it is headed Don Pedro Badan Calderon de la Barca, which sounds to me very much as though I were to call myself Mr. Anthony Trollope Ben Jonson. To this will be answered that such might have been my name. But then I should not have signed myself Anthony Trollope. The gentleman, however, has doubtless been right according to his Spanish lights; and the name sounds very grand, especially as there is added to it two lines declaring how that Don Pedro Badan is a Caballero. He was as dignified a personage as a Spanish Don should be, and seemed somewhat particular about the sixteen shillings, as Spanish and other Dons generally are. He has informed me as to my \"Talla,\" that it is Alta. I rather like the old man on the whole. Never before this have I obtained in a passport any more dignified description of my body than robust. I certainly like the word \"Alta.\" Then my eyes are azure. This he did not find out by the unassisted guidance of personal inspection. \"Ojos, blue,\" he suggested to me, trying to look through my spectacles. Not understanding \"Ojos,\" I said \"Yes.\" My \"cejas\" are \"casta?as,\" and so is my cabello also. Casta?as must be chestnut, surely—cejas may mean eyebrows—cabello is certainly hair. Now any but a Spaniard would have declared that as to hair, I was bald; and as to eyebrows, nothing in particular. My colour is sano. There is great comfort in that. I like the word sano. \"Mens sana in corpore sano.\" What has a man to wish for but that? I thank thee once more, Don Pedro Badan Calderon de la Barca. But then comes the mystery. If I have any personal vanity, it is wrapped up in my beard. It is a fine, manly article of dandyism, that wears well in all climates, and does not cost much, even when new. Well, what has the Don said of my beard? It is poblada. I would give five shillings for the loan of a Spanish dictionary at this moment. Poblada! Well, my first effort, if ever I do reach Cuba, shall be made with reference to that word. Oh; we are getting into the trade-winds, are we? Let ?olus be thanked at last. I should be glad to get into a monsoon or a simoom at the present moment, if there be monsoons and simooms in these parts. Yes; it comes rippling down upon us with a sweet, cool, airy breeze; the sails flap rather more loudly, as though they had some life in them, and then fill themselves with a grateful motion. Our three or four sailors rise from the deck where they have been snoring, and begin to stretch themselves. \"You may put her about,\" says the skipper; for be it known that for some hours past her head has been lying back towards Port Royal. \"We shall make fine track now, sir,\" he says, turning to me. \"And be at Cien Fuegos on the 28th?\" I demanded. \"Perhaps, sir; perhaps. We\u0027ve lost twenty-four hours, sir, doing nothing, you know.\" Oh, wretched man that I am! the conveyance from Cien Fuegos to the Havana is but once a week. The sails are still flopping against the yard. It is now noon on the 29th of January, and neither captain, mate, crew, nor the one solitary passenger have the least idea when the good brig —— will reach the port of Cien Fuegos; not even whether she will reach it at all. Since that time we have had wind enough in all conscience—lovely breezes as the mate called them. But we have oversailed our mark; and by how much no man on board this vessel can tell. Neither the captain nor the mate were ever in Cien Fuegos before; and I begin to doubt whether they ever will be there. No one knows where we are. An old stove has, it seems, been stowed away right under the compass, giving a false bias to the needle, so that our only guide guides us wrong. There is not a telescope on board. I very much doubt the skipper\u0027s power of taking an observation, though he certainly goes through the form of holding a machine like a brazen spider up to his eye about midday. My brandy and cigars are done; and altogether we are none of us jolly. Flap, flap, flap! roll, roll, roll! The time passes in this way very tediously. And then there has come upon us all a feeling not expressed, though seen in the face of all, of utter want of confidence in our master. There is none of the excitement of danger, for the land is within a mile of us; none of the exhaustion of work, for there is nothing to do. Of pork and biscuits and water there is, I believe, plenty. There is nothing tragic to be made out of it. But comic misery wears one quite as deeply as that of a sterner sort. It is hardly credible that men should be sent about a job for which they are so little capable, and as to which want of experience must be so expensive! Here we are, beating up the coast of Cuba against the prevailing wind, knowing nothing of the points which should guide us, and looking out for a harbour without a sea-glass to assist our eyes. When we reach port, be it Cien Fuegos or any other, the first thing we must do will be to ask the name of it! It is incredible to myself that I should have found my way into such circumstances. I have been unable not to recount my present immediate troubles, they press with such weight upon my spirits; but I have yet to commence my journeyings at their beginning. Hitherto I have but told under what circumstances I began the actual work of writing. On the 17th of November, 1858, I left the port of Southampton in the good ship \u0027Atrato.\u0027 My purposed business, O cherished reader! was not that of writing these pages for thy delectation; but the accomplishment of certain affairs of State, of import grave or trifling as the case may be, with which neither thou nor I shall have further concern in these pages. So much it may be well that I should say, in order that my apparently purposeless wanderings may be understood to have had some method in them. And in the good ship \u0027Atrato\u0027 I reached that emporium of travellers, St. Thomas, on the 2nd of December. We had awfully bad weather, of course, and the ship did wonders. When men write their travels, the weather has always been bad, and the ship has always done wonders. We thought ourselves very uncomfortable—I, for one, now know better—and abused the company, and the captain, and the purser, and the purveyor, and the stewards every day at breakfast and dinner; not always with the eloquence of the Frenchman and his walnut, but very frequently with quite equal energy. But at the end of our journey we were all smiles, and so was the captain. He was tender to the ladies and cordial to the gentlemen; and we, each in our kind, reciprocated his attention. On the whole, O my readers! if you are going to the West Indies, you may do worse than go in the \u0027Atrato.\u0027 But do not think too much of your withered apples. I landed at St. Thomas, where we lay for some hours; and as I put my foot on the tropical soil for the first time, a lady handed me a rose, saying, \"That\u0027s for love, dear.\" I took it, and said that it should be for love. She was beautifully, nay, elegantly dressed. Her broad-brimmed hat was as graceful as are those of Ryde or Brighton. The well-starched skirts of her muslin dress gave to her upright figure that look of easily compressible bulk, which, let \u0027Punch\u0027 do what it will, has become so sightly to our eyes. Pink gloves were on her hands. \"That\u0027s for love, dear.\" Yes, it shall be for love; for thee and thine, if I can find that thou deservest it. What was it to me that she was as black as my boot, or that she had come to look after the ship\u0027s washing? I shall probably have a word or two to say about St. Thomas; but not now. It is a Niggery-Hispano-Dano-Yankee-Doodle place; in which, perhaps, the Yankee-Doodle element, declaring itself in nasal twang and sherry cobblers, seems to be of the strongest flavour; as undoubtedly will be the case in many of these parts as years go on revolving. That nasal twang will sound as the Bocca Romana in coming fashionable western circles; those sherry cobblers will be the Falernian drink of a people masters of half the world. I dined at the hotel, but should have got a better dinner on board the \u0027Atrato,\u0027 in spite of the withered apples. From St. Thomas we went to Kingston, Jamaica, in the \u0027Derwent.\u0027 We were now separated from the large host of Spaniards who had come with us, going to Peru, the Spanish Main, Mexico, Cuba, or Porto Rico; and, to tell the truth, we were not broken-hearted on the occasion. Spaniards are bad fellow-travellers; the Spaniard, at least, of the Western hemisphere. They seize the meats upon the table somewhat greedily; their ablutions are not plentiful; and their timidity makes them cumbersome. That they are very lions when facing an enemy on terra firma, I do not doubt. History, I believe, tells so much for them. But half a gale of wind lays them prostrate, at all hours except feeding-time. We had no Spaniards in the \u0027Derwent,\u0027 but a happy jovial little crew of Englishmen and Englishwomen—or of English subjects rather, for the majority of them belonged to Jamaica. The bad weather was at an end, and all our nautical troubles nearly over; so we ate and drank and smoked and danced, and swore mutual friendship, till the officer of the Board of Health visited us as we rounded the point at Port Royal, and again ruffled our tempers by delaying us for some thirty minutes under a broiling sun. Kingston harbour is a large lagune, formed by a long narrow bank of sand which runs out into the sea, commencing some three or four miles above the town of Kingston, and continuing parallel with the coast on which Kingston is built till it reaches a point some five or six miles below Kingston. This sandbank is called \"The Palisades,\" and the point or end of it is Port Royal. This is the seat of naval supremacy for Jamaica, and, as far as England is concerned, for the surrounding islands and territories. And here lies our flag-ship; and here we maintain a commodore, a dock-yard, a naval hospital, a pile of invalided anchors, and all the usual adjuncts of such an establishment. Some years ago—I am not good at dates, but say seventy, if you will—Port Royal was destroyed by an earthquake. Those who are geographically inclined should be made to understand that the communication between Port Royal and Kingston, as, indeed, between Port Royal and any other part of the island, is by water. It is, I believe, on record that hardy Subs, and hardier Mids, have ridden along the Palisades, and not died from sun-stroke in the effort. But the chances are much against them. The ordinary ingress and egress is by water. The ferry boats usually take about an hour, and the charge is a shilling. The writer of these pages, however, has been two hours and a quarter in the transit.","sourceLink":"http://novel.tingroom.com/duanpian/2742/75504.html","bookId":1379,"book":{"id":1379,"title":"The West Indies and the Spanish Main","description":"简介： I am beginning to write this book on board the brig , trading between Kingston, in Jamaica, and Cien Fuegos, on the southern coast of Cuba. At the present moment there is not a puff of wind, neither land breeze nor sea breeze; the sails are flapping...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2742","creation":"Aug 1, 2019 12:24:58 AM","modification":"Aug 1, 2019 12:24:58 AM"}}
