{"id":110678,"no":1,"title":"Page 1","content":"One\\n\\n HIS FINGERTIPS SLID ALONG my back, applying hardly any pressure, yet sending shock waves over my flesh. Slowly, slowly, his hands moved across my skin, down the sides of my stomach to finally rest in the curves of my hips. Just below my ear, I felt his lips press against my neck, followed by another kiss just below it, then another, then another. ...\\n\\n His lips moved from my neck toward my cheek and then finally found my mouth. We kissed, wrapping ourselves closer together. My blood burned within me, and I felt more alive in that moment than I ever had. I loved him, loved Christian so much that -\\n\\n Christian?\\n\\n Oh no.\\n\\n Some coherent part of me immediately realized what was happening - and boy, was it pissed off. The rest of me, however, was still actually living in this encounter, experiencing it as though I was the one being touched and kissed. That part of me couldn\u0027t break away. I\u0027d merged too much with Lissa, and for all intents and purposes, this was happening to me.\\n\\n No, I told myself sternly. It\u0027s not real - not for you. Get out of there.\\n\\n But how could I listen to logic when every nerve of my body was being set on fire?\\n\\n You aren\u0027t her. This isn\u0027t your head. Get out.\\n\\n His lips. There was nothing in the world right now except his lips.\\n\\n It\u0027s not him. Get out.\\n\\n The kisses were the same, exactly as I remembered with him. ...\\n\\n No, it\u0027s not Dimitri. Get out!\\n\\n Dimitri\u0027s name was like cold water hitting me in the face. I got out.\\n\\n I sat upright in my bed, suddenly feeling smothered. I tried kicking off the covers but mostly ended up entangling my legs even more. My heart beat hard in my chest, and I tried to take deep breaths to steady myself and return to my own reality.\\n\\n Times sure had changed. A long time ago, Lissa\u0027s nightmares used to wake me from sleep. Now her sex life did. To say the two were a little different would be an understatement. I\u0027d actually gotten the hang of blocking out her romantic interludes - at least when I was awake. This time, Lissa and Christian had (unintentionally) outsmarted me. In sleep, my defenses were down, allowing strong emotions to pass through the psychic link that connected me to my best friend. This wouldn\u0027t have been a problem if the two of them had been in bed like normal people - and by \"being in bed,\" I mean \"asleep.\"\\n\\n \"God,\" I muttered, sitting up and swinging my legs over the side of the bed. My voice was muffled in a yawn. Couldn\u0027t Lissa and Christian have seriously kept their hands off each other until waking hours?\\n\\n Worse than being woken up, though, was the way I still felt. Sure, none of that making out had actually happened to me. It hadn\u0027t been my skin being touched or my lips being kissed. Yet my body seemed to feel the loss of it nonetheless. It had been a very long time since I\u0027d been in that kind of situation. I ached and felt warm all over. It was idiotic, but suddenly, desperately, I wanted someone to touch me - even just to hold me. But definitely not Christian. The memory of those lips on mine flashed back through my mind, how they\u0027d felt, and how my sleepy self had been so certain it was Dimitri kissing me.\\n\\n I stood up on shaky legs, feeling restless and ... well, sad. Sad and empty. Needing to walk off my weird mood, I put on a robe and slippers and left my room for the bathroom down the hall. I splashed cool water on my face and stared in the mirror. The reflection looking back at me had tangled hair and bloodshot eyes. I looked sleep-deprived, but I didn\u0027t want to go back to bed. I didn\u0027t want to risk falling asleep quite yet. I needed something to wake me up and shake away what I\u0027d seen.\\n\\n I left the bathroom and turned toward the stairwell, my feet light on the steps as I went downstairs. The first floor of my dorm was still and quiet. It was almost noon - the middle of the night for vampires, since they ran on a nocturnal schedule. Lurking near the edge of a doorway, I scanned the lobby. It was empty, save for the yawning Moroi man sitting at the front desk. He leafed halfheartedly through a magazine, held to consciousness only by the finest of threads. He came to the magazine\u0027s end and yawned again. Turning in his revolving chair, he tossed the magazine on a table behind him and reached for what must have been something else to read.\\n\\n While his back was turned, I darted past him toward the set of double doors that opened outside. Praying the doors wouldn\u0027t squeak, I carefully opened one a crack, just enough to slip through. Once outside, I eased the door shut as gently as possible. No noise. At most, the guy would feel a draft. Feeling like a ninja, I stepped out into the light of day.\\n\\n Cold wind blasted me in the face, but it was exactly what I needed. Leafless tree branches swayed in that wind, clawing at the sides of the stone dorm like fingernails. The sun peeped at me from between lead-colored clouds, further reminding me that I should be in bed and asleep. Squinting at the light, I tugged my robe tighter and walked around the side of the building, toward a spot between it and the gym that wasn\u0027t quite so exposed to the elements. The slush on the sidewalk soaked into the cloth of my slippers, but I didn\u0027t care.\\n\\n Yeah, it was a typically miserable winter day in Montana, but that was the point. The crisp air did a lot to wake me up and chase off the remnants of the virtual love scene. Plus, it kept me firmly in my own head. Focusing on the cold in my body was better than remembering what it had felt like to have Christian\u0027s hands on me. Standing there, staring off at a cluster of trees without really seeing them, I was surprised to feel a spark of anger at Lissa and Christian. It must be nice, I thought bitterly, to do whatever the hell you wanted. Lissa had often commented that she wished she could feel my mind and experiences the way I could feel hers. The truth was, she had no idea how lucky she was. She had no idea what it was like to have someone else\u0027s thoughts intruding on yours, someone else\u0027s experiences muddling yours. She didn\u0027t know what it was like to live with someone else\u0027s perfect love life when your own was nonexistent. She didn\u0027t understand what it was like to be filled with a love so strong that it made your chest ache - a love you could only feel and not express. Keeping love buried was a lot like keeping anger pent up, I\u0027d learned. It just ate you up inside until you wanted to scream or kick something.\\n\\n No, Lissa didn\u0027t understand any of that. She didn\u0027t have to. She could carry on with her own romantic affairs, with no regard for what she was doing to me.\\n\\n I noticed then that I was breathing heavily again, this time with rage. The icky feeling I\u0027d felt over Lissa and Christian\u0027s late-night hookup was gone. It had been replaced by anger and jealousy, feelings born of what I couldn\u0027t have and what came so easily to her. I tried my best to swallow those emotions back; I didn\u0027t want to feel that way toward my best friend.\\n\\n \"Are you sleepwalking?\" a voice asked behind me.\\n\\n I spun around, startled. Dimitri stood there watching me, looking both amused and curious. It would figure that while I was raging over the problems in my unfair love life, the source of those problems would be the one to find me. I hadn\u0027t heard him approach at all. So much for my ninja skills. And honestly, would it have killed me to pick up a brush before I went outside? Hastily, I ran a hand through my long hair, knowing it was a little too late. It probably looked like an animal had died on top of my head.\\n\\n \"I was testing dorm security,\" I said. \"It sucks.\"\\n\\n A hint of a smile played over his lips. The cold was really starting to seep into me now, and I couldn\u0027t help but notice how warm his long leather coat looked. I wouldn\u0027t have minded wrapping up in it.\\n\\n As though reading my mind, he said, \"You must be freezing. Do you want my coat?\"\\n\\n I shook my head, deciding not to mention that I couldn\u0027t feel my feet. \"I\u0027m fine. What are you doing out here? Are you testing security too?\"\\n\\n \"I am security. This is my watch.\" Shifts of school guardians always patrolled the grounds while everyone else slept. Strigoi, the undead vampires who stalked living Moroi vampires like Lissa, didn\u0027t come out in sunlight, but students breaking rules - say, like, sneaking out of their dorms - were a problem night and day.\\n\\n \"Well, good work,\" I said. \"I\u0027m glad I was able to help test your awesome skills. I should be going now.\"\\n\\n \"Rose - \" Dimitri\u0027s hand caught my arm, and despite all the wind and chill and slush, a flash of heat shot through me. He released me with a start, as though he too had been burned. \"What are you really doing out here?\"\\n\\n He was using the stop fooling around voice, so I gave him as truthful an answer as I could. \"I had a bad dream. I wanted some air.\"\\n\\n \"And so you just rushed out. Breaking the rules didn\u0027t even cross your mind - and neither did putting on a coat.\"\\n\\n \"Yeah,\" I said. \"That pretty much sums it up.\"\\n\\n \"Rose, Rose.\" This time it was his exasperated voice. \"You never change. Always jumping in without thinking.\"\\n\\n \"That\u0027s not true,\" I protested. \"I\u0027ve changed a lot.\"\\n\\n The amusement on his face suddenly faded, his expression growing troubled. He studied me for several moments. Sometimes I felt as though those eyes could see right into my soul. \"You\u0027re right. You have changed.\"\\n\\n He didn\u0027t seem very happy about the admission. He was probably thinking about what had happened almost three weeks ago, when some friends and I had gotten ourselves captured by Strigoi. It was only through sheer luck that we\u0027d managed to escape - and not all of us had gotten out. Mason, a good friend and a guy who\u0027d been crazy about me, had been killed, and part of me would never forgive myself for it, even though I\u0027d killed his murderers.\\n\\n It had given me a darker outlook on life. Well, it had given everyone here at St. Vladimir\u0027s Academy a darker outlook, but me especially. Others had begun to notice the difference in me. I didn\u0027t like to see Dimitri concerned, though, so I played off his observation with a joke.\\n\\n \"Well, don\u0027t worry. My birthday\u0027s coming up. As soon as I\u0027m eighteen, I\u0027ll be an adult, right? I\u0027m sure I\u0027ll wake up that morning and be all mature and stuff.\"\\n\\n As I\u0027d hoped, his frown softened into a small smile. \"Yes, I\u0027m sure. What is it, about a month?\"\\n\\n \"Thirty-one days,\" I announced primly.\\n\\n \"Not that you\u0027re counting.\"\\n\\n I shrugged, and he laughed.\\n\\n \"I suppose you\u0027ve made a birthday list too. Ten pages? Single-spaced? Ranked by order of priority?\" The smile was still on his face. It was one of the relaxed, genuinely amused ones that were so rare to him.\\n\\n I started to make another joke, but the image of Lissa and Christian flared into my mind again. That sad and empty feeling in my stomach returned. Anything I might have wanted - new clothes, an iPod, whatever - suddenly seemed trivial. What did material things like that mean compared to the one thing I wanted most of all? God, I really had changed.\\n\\n \"No,\" I said in a small voice. \"No list.\"\\n\\n He tilted his head to better look at me, making some of his shoulder-length hair blow into his face. His hair was brown, like mine, but not nearly as dark. Mine looked black at times. He brushed the unruly strands aside, only to have them immediately blow back into his face. \"I can\u0027t believe you don\u0027t want anything. It\u0027s going to be a boring birthday.\"\\n\\n Freedom, I thought. That was the only gift I longed for. Freedom to make my own choices. Freedom to love who I wanted.\\n\\n \"It doesn\u0027t matter,\" I said instead.\\n\\n \"What do you - \" He stopped. He understood. He always did. It was part of why we connected like we did, in spite of the seven-year gap in our ages. We\u0027d fallen for each other last fall when he\u0027d been my combat instructor. As things heated up between us, we\u0027d found we had more things to worry about than just age. We were both going to be protecting Lissa when she graduated, and we couldn\u0027t let our feelings for each other distract us when she was our priority.\\n\\n Of course, that was easier said than done because I didn\u0027t think our feelings for each other were ever really going to go away. We\u0027d both had moments of weakness, moments that led to stolen kisses or saying things we really shouldn\u0027t have. After I\u0027d escaped the Strigoi, Dimitri had told me he loved me and had pretty much admitted he could never be with anyone else because of that. Yet, it had also become clear that we still couldn\u0027t be together either, and we had both slipped back into our old roles of keeping away from each other and pretending that our relationship was strictly professional.\\n\\n In a not-so-obvious attempt to change the subject, he said, \"You can deny it all you want, but I know you\u0027re freezing. Let\u0027s go inside. I\u0027ll take you in through the back.\"\\n\\n I couldn\u0027t help feeling a little surprised. Dimitri was rarely one to avoid uncomfortable subjects. In fact, he was notorious for pushing me into conversations about topics I didn\u0027t want to deal with. But talking about our dysfunctional, star-crossed relationship? That was a place he apparently didn\u0027t want to go today. Yeah. Things were definitely changing.\\n\\n \"I think you\u0027re the one who\u0027s cold,\" I teased, as we walked around the side of the dorm where novice guardians lived. \"Shouldn\u0027t you be all tough and stuff, since you\u0027re from Siberia?\"\\n\\n \"I don\u0027t think Siberia\u0027s exactly what you imagine.\"\\n\\n \"I imagine it as an arctic wasteland,\" I said truthfully.\\n\\n \"Then it\u0027s definitely not what you imagine.\"\\n\\n \"Do you miss it?\" I asked, glancing back to where he walked behind me. It was something I\u0027d never considered before. In my mind, everyone would want to live in the U.S. Or, well, they at least wouldn\u0027t want to live in Siberia.\\n\\n \"All the time,\" he said, his voice a little wistful. \"Sometimes I wish - \"\\n\\n \"Belikov!\"\\n\\n A voice was carried on the wind from behind us. Dimitri muttered something, and then shoved me further around the corner I\u0027d just rounded. \"Stay out of sight.\"\\n\\n I ducked down behind a bank of holly trees that flanked the building. They didn\u0027t have any berries, but the thick clusters of sharp, pointed leaves scratched where my skin was exposed. Considering the freezing temperature and possible discovery of my late-night walk, a few scratches were the least of my problems right now.\\n\\n \"You\u0027re not on watch,\" I heard Dimitri say several moments later.\\n\\n \"No, but I needed to talk to you.\" I recognized the voice. It belonged to Alberta, captain of the Academy\u0027s guardians. \"It\u0027ll just take a minute. We need to shuffle some of the watches while you\u0027re at the trial.\"\\n\\n \"I figured,\" he said. There was a funny, almost uncomfortable note in his voice. \"It\u0027s going to put a strain on everyone else - bad timing.\"\\n\\n \"Yes, well, the queen runs on her own schedule.\" Alberta sounded frustrated, and I tried to figure out what was going on. \"Celeste will take your watches, and she and Emil will divide up your training times.\"\\n\\n Training times? Dimitri wouldn\u0027t be conducting any trainings next week because - Ah. That was it, I realized. The field experience. Tomorrow kicked off six weeks of hands-on practice for us novices. We\u0027d have no classes and would get to protect Moroi night and day while the adults tested us. The \"training times\" must be when Dimitri would be out participating in that. But what was this trial she\u0027d mentioned? Did they mean like the final trials we had to undergo at the end of the school year?\\n\\n \"They say they don\u0027t mind the extra work,\" continued Alberta, \"but I was wondering if you could even things out and take some of their shifts before you leave?\"\\n\\n \"Absolutely,\" he said, words still short and stiff.\\n\\n \"Thanks. I think that\u0027ll help.\" She sighed. \"I wish I knew how long this trial was going to be. I don\u0027t want to be away that long. You\u0027d think it\u0027d be a done deal with Dashkov, but now I hear the queen\u0027s getting cold feet about imprisoning a major royal.\"\\n\\n I stiffened. The chill running through me now had nothing to do with the winter day. Dashkov?\\n\\n \"I\u0027m sure they\u0027ll do the right thing,\" said Dimitri. I realized at that moment why he wasn\u0027t saying much. This wasn\u0027t something I was supposed to hear.\\n\\n \"I hope so. And I hope it\u0027ll only take a few days, like they claim. Look, it\u0027s miserable out here. Would you mind coming into the office for a second to look at the schedule?\"\\n\\n \"Sure,\" he said. \"Let me check on something first.\"\\n\\n \"All right. See you soon.\"\\n\\n Silence fell, and I had to assume Alberta was walking away. Sure enough, Dimitri rounded the corner and stood in front of the holly. I shot up from my hiding spot. The look on his face told me he already knew what was coming.\\n\\n \"Rose - \"\\n\\n \"Dashkov?\" I exclaimed, trying to keep my voice low so Alberta wouldn\u0027t hear. \"As in Victor Dashkov?\"\\n\\n He didn\u0027t bother denying it. \"Yes. Victor Dashkov.\"\\n\\n \"And you guys were talking about...Do you mean...\" I was so startled, so dumbstruck, that I could barely get my thoughts together. This was unbelievable. \"I thought he was locked up! Are you saying he hasn\u0027t been on trial yet?\"\\n\\n Yes. This was definitely unbelievable. Victor Dashkov. The guy who\u0027d stalked Lissa and tortured her mind and body in order to control her powers. Every Moroi could use magic in one of the four elements: earth, air, water, or fire. Lissa, however, worked an almost unheard of fifth element called spirit. She could heal anything - including the dead. It was the reason I was now psychically linked to her - \"shadow-kissed,\" some called it. She\u0027d brought me back from the car accident that had killed her parents and brother, binding us together in a way that allowed me to feel her thoughts and experiences.\\n\\n Victor had learned long before any of us that she could heal, and he\u0027d wanted to lock her away and use her as his own personal Fountain of Youth. He also hadn\u0027t hesitated to kill anyone who got in his way - or, in the case of Dimitri and me, use more creative ways to stop his opponents. I\u0027d made a lot of enemies in seventeen years, but I was pretty sure there was no one I hated as much as Victor Dashkov - at least among the living.\\n\\n Dimitri had a look on his face I knew well. It was the one he got when he thought I might punch someone. \"He\u0027s been locked up - but no, no trial yet. Legal proceedings sometimes take a long time.\"\\n\\n \"But there\u0027s going to be a trial now? And you\u0027re going?\" I spoke through clenched teeth, trying to be calm. I suspected I still had the I\u0027m going to punch someone look on my face.\\n\\n \"Next week. They need me and some of the other guardians to testify about what happened to you and Lissa that night.\" His expression changed at the mention of what had occurred four months ago, and again, I recognized the look. It was the fierce, protective one he got when those he cared about were in danger.\\n\\n \"Call me crazy for asking this, but, um, are Lissa and I going with you?\" I had already guessed the answer, and I didn\u0027t like it.\\n\\n \"No.\"\\n\\n \"No?\"\\n\\n \"No.\"\\n\\n I put my hands on my hips. \"Look, doesn\u0027t it seem reasonable that if you\u0027re going to talk about what happened to us, then you should have us there?\"\\n\\n Dimitri, fully in strict-instructor mode now, shook his head. \"The queen and some of the other guardians thought it\u0027d be best if you didn\u0027t go. There\u0027s enough evidence between the rest of us, and besides, criminal or not, he is - or was - one of the most powerful royals in the world. Those who know about this trial want to keep it quiet.\"\\n\\n \"So, what, you thought if you brought us, we\u0027d tell everyone?\" I exclaimed. \"Come on, comrade. You really think we\u0027d do that? The only thing we want is to see Victor locked up. Forever. Maybe longer. And if there\u0027s a chance he might walk free, you have to let us go.\"\\n\\n After Victor had been caught, he\u0027d been taken to prison, and I\u0027d thought that was where the story had ended. I\u0027d figured they\u0027d locked him up to rot. It had never occurred to me - though it should have - that he\u0027d need a trial first. At the time, his crimes had seemed so obvious. But, although the Moroi government was secret and separate from the human one, it operated in a lot of the same ways. Due process and all that.\\n\\n \"It\u0027s not my decision to make,\" Dimitri said.\\n\\n \"But you have influence. You could speak up for us, especially if...\" Some of my anger dimmed just a little, replaced by a sudden and startling fear. I almost couldn\u0027t say the next words. \"Especially if there really is a chance he might get off. Is there? Is there really a chance the queen could let him go?\"\\n\\n \"I don\u0027t know. There\u0027s no telling what she or some of the other high-up royals will do sometimes.\" He suddenly looked tired. He reached into his pocket and tossed over a set of keys. \"Look, I know you\u0027re upset, but we can\u0027t talk about it now. I have to go meet Alberta, and you need to get inside. The square key will let you in the far side door. You know the one.\"\\n\\n I did. \"Yeah. Thanks.\"\\n\\n I was sulking and hated to be that way - especially since he was saving me from getting in trouble - but I couldn\u0027t help it. Victor Dashkov was a criminal - a villain, even. He was power-hungry and greedy and didn\u0027t care who he stepped on to get his way. If he were loose again...well, there was no telling what might happen to Lissa or any other Moroi. It enraged me to think that I could do something to help put him away but that no one would let me do it.\\n\\n I\u0027d taken a few steps forward when Dimitri called out from behind me. \"Rose?\" I glanced back. \"I\u0027m sorry,\" he said. He paused, and his expression of regret turned wary. \"And you\u0027d better bring the keys back tomorrow.\"\\n\\n I turned away and kept going. It was probably unfair, but some childish part of me believed Dimitri could do anything. If he\u0027d really wanted to get Lissa and me to the trial, I was certain he could have.\\n\\n When I was almost to the side door, I caught movement in my peripheral vision. My mood plummeted. Great. Dimitri had given me keys to sneak back in, and now someone else had busted me. That was typical of my luck. Half-expecting a teacher to demand to know what I was doing, I turned and prepared an excuse.\\n\\n But it wasn\u0027t a teacher.\\n\\n \"No,\" I said softly. This had to be a trick. \"No.\"\\n\\n For half an instant, I wondered if I\u0027d ever really woken up. Maybe I was actually still in bed, asleep and dreaming.\\n\\n Because surely, surely that was the only explanation for what I was now seeing in front of me on the Academy\u0027s lawn, lurking in the shadow of an ancient, gnarled oak.\\n\\n It was Mason. \\n\\n","sourceLink":"https://allnovel.net/shadow-kiss-vampire-academy-3/page-1.html","bookId":2062,"book":{"id":2062,"title":"Shadow Kiss (Vampire Academy #3)","description":"Storyline: Vampire Academy Series 3: Shadow Kiss \\n A little background... I am in my mid 20\u0027s and a high school teacher who loves to read when I can but doesn\u0027t get much time to do it in. I picked up the twilight series a year ago at a students request and was pleasantly surprised. Once the series was finished I needed another one! Before Twilight I had not been into teen romance/ fantasy books especially with vampires and such. I saw a book-list of recommendations by Twilight followers and picked up the \"House of Night\" series by PC Cast. This was worth reading and I am waiting for the next book to come. My husband now calls me addicted to Vamps since I started looking for a new series to pick up. I was strongly recommended to pick up the Vampire Academy series by my 20 year old sister who has always been a fan of this genre of books.\\n","cover":"https://allnovel.net/images/shadow-kiss-vampire-academy-3.jpg","author":"Richelle Mead","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/shadow-kiss-vampire-academy-3.html","creation":"Oct 5, 2019 8:58:18 AM","modification":"Oct 6, 2019 12:03:18 AM"}}
