{"id":110699,"no":22,"title":"Page 22","content":"Twenty-two\\n\\n DEIRDRE THE COUNSELOR must not have had much of a life, because she scheduled our next appointment on a Sunday. I wasn\u0027t thrilled about it, seeing as it wasn\u0027t just my day off - it was also the day my friends had off. Orders were orders, however, so I grudgingly showed up.\\n\\n \"You\u0027re wrong,\" I told her as soon as I sat down. We hadn\u0027t really addressed the questions from my first session yet. We\u0027d spent our last couple of times talking about my mother and what I thought of the field experience.\\n\\n \"What about?\" she asked. She wore a sleeveless floral dress that seemed too cold for a day like today. It also bore an eerie resemblance to the nature photographs that hung around the office.\\n\\n \"About the guy. I don\u0027t just like him because I can\u0027t have him. I like him because ... well, because he\u0027s him. I\u0027ve proven it to myself.\"\\n\\n \"Proven it how?\"\\n\\n \"It\u0027s a long story,\" I said evasively. I didn\u0027t really want to get into the details of my Adrian compulsion experiment. \"You just have to trust me.\"\\n\\n \"What about the other thing we talked about?\" she asked. \"What about your feelings about Lissa?\"\\n\\n \"That idea was wrong too.\"\\n\\n \"Did you prove it to yourself?\"\\n\\n \"No, but it wasn\u0027t the kind of thing I could really test the same way.\"\\n\\n \"Then how can you be sure?\" she asked.\\n\\n \"Because I am.\" That was the best answer she was going to get.\\n\\n \"How have things been with her recently?\"\\n\\n \"Recently how?\"\\n\\n \"Have you spent a lot of time together? Kept up with what she\u0027s been doing?\"\\n\\n \"Sure, kind of. I don\u0027t see her as much. She\u0027s doing the same things as usual though. Hanging out with Christian. Acing every test. Oh, and she\u0027s practically got Lehigh\u0027s website memorized.\"\\n\\n \"Lehigh?\"\\n\\n I explained the queen\u0027s offer to Deirdre. \"She won\u0027t even be there until fall, but Lissa\u0027s already looking at all her classes and trying to figure out what she wants to major in.\"\\n\\n \"What about you?\"\\n\\n \"What about me?\"\\n\\n \"What will you do while she attends classes?\"\\n\\n \"I\u0027ll go with her. That\u0027s what usually happens if a Moroi has a guardian close to her age. They\u0027ll probably enroll me too.\"\\n\\n \"You\u0027ll take the same classes she does?\"\\n\\n \"Yup.\"\\n\\n \"Are there classes you\u0027d rather take instead?\"\\n\\n \"How do I know? She hasn\u0027t even picked the ones she\u0027s going to take, so I don\u0027t know if I want to take them or not. But it doesn\u0027t matter. I have to go with her.\"\\n\\n \"And you don\u0027t have a problem with that?\"\\n\\n My temper was starting to prickle. This was exactly what I hadn\u0027t wanted to talk about. \"No,\" I said tightly.\\n\\n I knew Deirdre wanted me to elaborate, but I refused to. We held each other\u0027s eyes for a few moments, almost like we were challenging the other to look away. Or maybe I was reading too much into it. She glanced down at the mysterious notepad she always held and flipped through a couple of pages. I noticed that her nails were perfectly shaped and painted red. The polish on mine had started to chip.\\n\\n \"Would you rather not talk about Lissa today?\" she asked at last.\\n\\n \"We can talk about whatever you think is useful.\"\\n\\n \"What do you think is useful?\"\\n\\n Damn it. She was doing the question thing again. I wondered if one of the certificates on her wall gave her some sort of special qualification to do that.\\n\\n \"I think it\u0027d be useful if you stopped talking to me like I\u0027m a Moroi. You act like I have choices - like I have the right to be upset about any of this or pick what classes I want to take. I mean, let\u0027s say I could choose them. What good would it do? What am I going to do with those classes? Go be a lawyer or a marine biologist? There\u0027s no point in me having my own schedule. Everything\u0027s already decided for me.\"\\n\\n \"And you\u0027re okay with that.\" It could have been a question, but she said it like a statement of fact.\\n\\n I shrugged. \"I\u0027m okay with keeping her safe, and that\u0027s what you keep missing here. Every job has bad parts. Do I want to sit through her calculus classes? No. But I have to because the other part is more important. Do you want to listen to angry teenagers try to block your efforts? No. But you have to because the rest of your job is more important.\"\\n\\n \"Actually,\" she said unexpectedly, \"that\u0027s my favorite part of the job.\"\\n\\n I couldn\u0027t tell if she was joking or not, but I decided not to pursue it, particularly since she hadn\u0027t responded with a question. I sighed.\\n\\n \"I just hate everyone acting like I\u0027m being forced to be a guardian.\"\\n\\n \"Who\u0027s \u0027everyone\u0027?\"\\n\\n \"Well, you and this guy I met at Court...this dhampir named Ambrose. He\u0027s...well, he\u0027s a blood whore. A guy blood whore.\" Like that wasn\u0027t obvious. I waited to see if she\u0027d react to the term, but she didn\u0027t. \"He made it sound like I was trapped in this life and all that too. But I\u0027m not. This is what I want. I\u0027m good at this. I know how to fight, and I know how to defend others. Have you ever seen a Strigoi?\"\\n\\n She shook her head.\\n\\n \"Well, I have. And when I say I want to spend my life protecting Moroi and killing Strigoi, I mean it. Strigoi are evil and need to be wiped out. I\u0027m happy to do that and if I get to be with my best friend in the process, that\u0027s even better.\"\\n\\n \"I understand that, but what happens if you want other things - things that you can\u0027t have by choosing this lifestyle?\"\\n\\n I crossed my arms. \"Same answer as before. There are good and bad sides to everything. We just have to balance them as best we can. I mean, are you going to try to tell me that life isn\u0027t that way? That if I can\u0027t have everything perfect, then there\u0027s something wrong with me?\"\\n\\n \"No, of course not,\" she said, tilting back in her chair. \"I want you to have a wonderful life, but I can\u0027t expect a perfect one. No one can. But what I think is interesting here is how you respond and cope when you have to reconcile these contradictory pieces of your life - when having one thing means you can\u0027t have another.\"\\n\\n \"Everyone goes through that.\" I felt like I was repeating myself.\\n\\n \"Yes, but not everyone sees ghosts as a result of it.\"\\n\\n It took several heavy seconds for me to finally realize what she was getting at. \"So wait. You\u0027re saying that the reason I\u0027m seeing Mason is because I secretly resent Lissa for the things I can\u0027t have in my life? What happened to all the trauma I\u0027ve been through? I thought that was the reason I\u0027m seeing Mason?\"\\n\\n \"I think there are a lot of reasons you\u0027re seeing Mason,\" she said. \"And that\u0027s what we\u0027re exploring.\"\\n\\n \"And yet,\" I said, \"we never actually talk about Mason.\"\\n\\n Deirdre smiled serenely. \"Don\u0027t we?\"\\n\\n Our session ended.\\n\\n \"Does she always answer your questions with questions?\" I asked Lissa later. I was walking with her through the quad, heading toward the commons for dinner. Afterward, we were going to meet up with the others for a movie. It had been a while since she and I had hung out just by ourselves, and I realized now how much I\u0027d missed it.\\n\\n \"We don\u0027t see the same counselor,\" she laughed. \"It\u0027d be a conflict of interest.\"\\n\\n \"Well, does yours do that then?\"\\n\\n \"Not that I\u0027ve really noticed. I take it yours does?\"\\n\\n \"Yeah ... it\u0027s actually pretty amazing to watch.\"\\n\\n \"Who knew the day would come when we\u0027d be comparing notes on therapy?\"\\n\\n We both laughed at that. Several moments passed, and then she started to say something. She wanted to tell me about what had happened with Jesse and Ralf, not realizing I already knew. Before she could say anything, though, someone joined us. Dean Barnes.\\n\\n \"Hey, Rose. A bunch of us are trying to figure out why you\u0027re on half-time.\"\\n\\n Great. I\u0027d known somebody would ask about that sooner or later. And honestly, I was kind of surprised it hadn\u0027t happened already. Everyone had been too busy with their own field experiences to give it much thought until now. I had an excuse ready.\\n\\n \"I\u0027ve been sick. Dr. Olendzki didn\u0027t want me going full-time.\"\\n\\n \"Really?\" he asked, staggering a little. \"I thought they were always talking about how in the real world, you don\u0027t get sick days. Or something like that.\"\\n\\n \"Well, this isn\u0027t the real world, and Dr. Olendzki\u0027s word is final.\"\\n\\n \"I heard it was because you\u0027re a threat to Christian.\"\\n\\n \"No, believe me, that\u0027s not it.\" The scent of alcohol radiating off of him gave me a convenient way to change the subject. \"Have you been drinking?\"\\n\\n \"Yeah, Shane got some stuff and had a few of us up in his room. Hey.\"\\n\\n \"Hey what?\" I asked.\\n\\n \"Don\u0027t look at me like that.\"\\n\\n \"Like what?\"\\n\\n \"Like you disapprove.\"\\n\\n \"I\u0027m not,\" I argued.\\n\\n Lissa giggled. \"You are, actually.\"\\n\\n Dean put on an offended face. \"Hey, it\u0027s my day off, and even if it is Sunday, that doesn\u0027t mean I can\u0027t - \"\\n\\n Something moved beside us.\\n\\n I didn\u0027t even hesitate. It was too fast, too covert to be anything friendly. And it was wearing all black. I threw myself between it and Lissa and lashed out at my attacker. In the flurry of activity, I vaguely recognized a guardian who generally taught the elementary novices. Her name was Jane or Joan or something like that. Jean, that was it. She was taller than me, but my fist made contact with her face anyway. She staggered back, and then I noticed another shape coming up beside her. Yuri. I leapt over so that she was between him and me. I kicked her in the stomach. She fell toward him, and both stumbled. In that brief moment, I had my practice stake out and aimed for her heart. I hit the mark, and she immediately stepped aside since she was now technically \"dead.\"\\n\\n Yuri and I then faced off. Beyond me, I heard a muffled sound that I suspected was Dean fighting his own attacker or attackers. I didn\u0027t have time to check yet. I needed to dispatch Yuri, which was harder since he was stronger than Jean. He and I circled, both feinting and landing blows. Finally, he made his major move, but I was faster and wiggled out of his grip. I stayed out of his reach just long enough to stake him too.\\n\\n As soon as he backed away in defeat, I turned toward Dean. Lissa stood off to the side, watching as Dean sparred with his attacker. It was pathetic, to say the least. I\u0027d given Ryan a hard time, but his mistakes were nothing compared to this. Dean\u0027s practice stake was on the ground, and his moves were jerky and unsteady. I decided then that he was more of a liability if he stayed in the fight. I threw myself forward and shoved him out of the way, off toward Lissa. I think I might have pushed hard enough to make him fall, but I didn\u0027t care. I needed him out of the way.\\n\\n Facing my opponent, I saw: Dimitri.\\n\\n It was unexpected. Some little voice in the back of my head said I couldn\u0027t fight Dimitri. The rest of me reminded that voice that I\u0027d been doing it for the last six months, and besides, he wasn\u0027t Dimitri right now. He was my enemy.\\n\\n I sprang toward him with the stake, hoping to catch him by surprise. But Dimitri was hard to catch by surprise. And he was fast. Oh, so fast. It was like he knew what I was going to do before I did it. He halted my attack with a glancing blow to the side of the head. I knew it would hurt later, but my adrenaline was running too strong for me to pay attention to it now.\\n\\n Distantly, I realized some other people had come to watch us. Dimitri and I were celebrities in different ways around here, and our mentoring relationship added to the drama. This was prime-time entertainment.\\n\\n My eyes were only on Dimitri, though. As we tested each other, attacking and blocking, I tried to remember everything he\u0027d taught me. I also tried to remember everything I knew about him. I\u0027d practiced with him for months. I knew him, knew his moves, just as he knew mine. I could anticipate him the same way. Once I started using that knowledge, the fight grew tricky. We were too well matched, both of us too fast. My heart thumped in my chest, and sweat coated my skin.\\n\\n Then Dimitri finally got through. He moved in for an attack, coming at me with the full force of his body. I blocked the worst of it, but he was so strong that I was the one who stumbled from the impact. He didn\u0027t waste the opportunity and dragged me to the ground, trying to pin me. Being trapped like that by a Strigoi would likely result in the neck being bitten or broken. I couldn\u0027t let that happen.\\n\\n So, although he held most of me to the ground, I managed to shove my elbow up and nail him in the face. He flinched, and that was all I needed. I rolled him over and held him down. He fought to push me off, and I pushed right back while also trying to maneuver my stake. He was so strong, though. I was certain I wouldn\u0027t be able to hold him. Then, just as I thought I\u0027d lose my hold, I got a good grip on the stake. And like that, the stake came down over his heart. It was done.\\n\\n Behind me, people were clapping, but all I noticed was Dimitri. Our gazes were locked. I was still straddling him, my hands pressed against his chest. Both of us were sweaty and breathing heavily. His eyes looked at me with pride - and a hell of a lot more. He was so close, and my whole body yearned for him, again thinking he was a piece of me I needed in order to be complete. The air between us seemed warm and heady, and I would have given anything in that moment to lie down with him and have his arms wrap around me. His expression showed me that he was thinking the same thing. The fight was finished, but remnants of the adrenaline and animal intensity remained.\\n\\n Then a hand reached down, and Jean helped me stand up. She and Yuri were beaming, as were the spectators who had wandered up. Even Lissa looked impressed. Dean, understandably, looked miserable. I hoped word of my stunning victory would spread around campus as fast as the recent bad stuff about me had. Probably not.\\n\\n \"Well done,\" said Yuri. \"You took down all three of us. That was textbook perfect.\"\\n\\n Dimitri was on his feet now too. I looked pointedly at the other two guardians because I was pretty sure if I looked at him, my expression would give everything away. My breathing was still heavy. \"I hope ... I hope I didn\u0027t hurt any of you,\" I said.\\n\\n This made all of them laugh. \"That\u0027s our job,\" said Jean. \"Don\u0027t worry about us. We\u0027re tough.\" She glanced at Dimitri. \"She got you pretty good with her elbow.\"\\n\\n Dimitri rubbed his face near his eye, and I hoped I hadn\u0027t caused too much damage. \"The student surpasses the teacher,\" he joked. \"Or stakes, rather.\"\\n\\n Yuri was giving Dean a hard look. \"Alcohol isn\u0027t allowed on campus.\"\\n\\n \"It\u0027s Sunday!\" he exclaimed. \"We aren\u0027t supposed to be on duty.\"\\n\\n \"There are no rules in the real world,\" said Jean in a very teacherlike way. \"Consider this a pop quiz. You passed it, Rose. Very nice job.\"\\n\\n \"Thanks. Wish I could say the same for my clothes.\" I was wet and muddy. \"I\u0027m going to have to go change, Liss. I\u0027ll meet you for dinner.\"\\n\\n \"Okay.\" Her face was alight. She was so proud of me, she could barely contain it. I could also sense her keeping something secret, and I wondered if there would be a congratulations surprise when I saw her later. I didn\u0027t probe too deeply, lest I ruin it.\\n\\n \"And you,\" said Yuri, tugging at Dean\u0027s sleeve, \"are going to take a walk with us.\"\\n\\n I met Dimitri\u0027s eyes. I wished he could have stuck around and talked. My adrenaline was running high, and I wanted to celebrate. I\u0027d done it. Finally. After all the embarrassment over my fumbles and alleged incompetence, I\u0027d finally proven what I could do. I wanted to start dancing. Dimitri had to go with the others, though, and only a slight nod of his head told me he wished it were otherwise. I sighed and watched them leave, and then I walked back to my dorm alone.\\n\\n Back in my room, I discovered the situation was worse than I thought. Once I\u0027d stripped off my muddy clothes, I realized I was going to need a shower and a good scrubbing before I was presentable. By the time it was all done, nearly an hour had passed. I\u0027d missed most of dinner.\\n\\n I ran back over to the commons, wondering why Lissa hadn\u0027t sent me any nagging thoughts. She had a tendency to do that when I was running late. Probably she\u0027d decided I\u0027d deserved a break after my triumph. Thinking about it again, a big grin crept over my face, one that dried up when I headed down the hallway that led to the cafeteria.\\n\\n A big group of people had gathered around something, and I recognized the international sign of a fight. Considering how Jesse\u0027s band liked to conduct their beatings in secret, I figured this probably had nothing to do with them. Squeezing through people, I pushed myself forward and peeked over some heads, curious as to who could have drawn such a crowd.\\n\\n It was Adrian and Christian.\\n\\n And Eddie. But Eddie was clearly there in a referee role. He was standing between them, trying to keep them away from each other. Manners gone, I shoved aside the last few people in front of me and hurried to Eddie\u0027s side.\\n\\n \"What the hell\u0027s going on?\" I demanded.\\n\\n He looked relieved to see me. He might be able to fend off our instructors in combat, but this situation was clearly something he was confused about.\\n\\n \"No idea.\"\\n\\n I looked at the two combatants. Fortunately, no one seemed to have hit anybody ... yet. It also looked as though Christian was the one on the offensive.\\n\\n \"How long did you think you could get away with it?\" he exclaimed. His eyes were like blue fire. \"Did you seriously think everyone would keep buying your act?\"\\n\\n Adrian looked laconic as usual, but I could see some anxiety under that lazy smile. He didn\u0027t want to be in this situation, and, like Eddie, he wasn\u0027t even sure how it had happened.\\n\\n \"Honestly,\" said Adrian in a weary voice, \"I have no idea what you\u0027re talking about. Can we please just go sit down and discuss this reasonably?\"\\n\\n \"Sure. Of course you\u0027d want that. You\u0027re afraid I might do this.\" Christian held up his hand, and a ball of flame danced over his palm. Even under the fluorescent lights, it glowed bright orange with a deep blue core. There were gasps from the crowd. I\u0027d long since gotten used to the idea of Moroi fighting with magic - Christian in particular - but for most, it was still a taboo thing. Christian smirked. \"What have you got to fight back with? Plants?\"\\n\\n \"If you\u0027re going to go start fights for no reason, you should at least do it the old-fashioned way and throw a punch,\" said Adrian. His voice was light, but he was still uneasy. My guess was that he figured he could do better with hand-to-hand than spirit-to-fire.\\n\\n \"No,\" interrupted Eddie. \"No one\u0027s going to set anyone on fire. No one\u0027s going to punch anybody. There\u0027s been some huge mistake.\"\\n\\n \"What is it?\" I demanded. \"What happened?\"\\n\\n \"Your friend there thinks I\u0027m planning to marry Lissa and carry her off into the sunset,\" said Adrian. He spoke to me, but his eyes never left Christian.\\n\\n \"Don\u0027t act like it\u0027s not true,\" growled Christian. \"I know it is. It\u0027s been part of your plan - yours and the queen\u0027s. She\u0027s been backing you the whole time. Coming back here...the whole studying thing ... it was a scam to get Lissa away from me and tied to your family instead.\"\\n\\n \"Do you have any idea how paranoid you sound?\" asked Adrian. \"My great-aunt has to manage the entire Moroi government! Do you think she really cares about who\u0027s dating who in high school - especially with the state of affairs lately? Look, I\u0027m sorry about all the time I\u0027ve spent with her...we\u0027ll find her and figure this out. I really wasn\u0027t trying to get between you. There\u0027s no conspiracy going on here.\"\\n\\n \"Yes, there is,\" said Christian. He glanced over at me with a scowl \"Isn\u0027t there? Rose knows. Rose has known for a while about this. She even talked to the queen about it.\"\\n\\n \"That\u0027s ridiculous,\" said Adrian, surprised enough that he too shot me a quick glance. \"Right?\"\\n\\n \"Well ...\" I began, realizing this was getting very ugly very quickly. \"Yes and no.\"\\n\\n \"See?\" asked Christian triumphantly.\\n\\n The fire flew from his hand, but Eddie and I jumped into motion at the same time. People screamed. Eddie grabbed Christian, forcing the fire to fly high. Meanwhile, I grabbed Adrian and slammed him to the floor. It was a lucky division of labor. I didn\u0027t want to think what would have happened if Eddie and I had gone for the same person.\\n\\n \"Glad you care,\" muttered Adrian, wincing as he lifted his head from the floor.\\n\\n \"Compel him,\" I murmured as I helped him up. \"We need to sort this out without someone spontaneously combusting.\"\\n\\n Eddie was trying to restrain Christian from leaping forward. I grabbed a hold of one arm to help. Adrian didn\u0027t look thrilled about coming any closer, but he obeyed me nonetheless. Christian tried to jerk free but couldn\u0027t fight both Eddie and me. Uneasily, probably afraid of his hair catching on fire, Adrian leaned over Christian and made eye contact.\\n\\n \"Christian, stop this. Let\u0027s talk.\"\\n\\n Christian struggled a little against his restraints, but slowly, his face went slack and his eyes started to glaze over.\\n\\n \"Let\u0027s talk about this,\" repeated Adrian.\\n\\n \"Okay,\" said Christian.\\n\\n There was a collective sigh of disappointment from the crowd. Adrian had used his compulsion smoothly enough that no one suspected. It had looked as though Christian had simply seen reason. As the crowd dispersed, Eddie and I released Christian enough to a lead him over to far corner where we could talk in private. As soon as Adrian broke the gaze, Christian\u0027s face filled with fury, and he tried to leap at Adrian. Eddie and I were already holding on. He didn\u0027t move.\\n\\n \"What did you just do?\" exclaimed Christian. Several people down the hall glanced back, no doubt hoping there\u0027d be a fight after all. I shushed loudly in his ear. He flinched. \"Ow.\"\\n\\n \"Be quiet. Something\u0027s wrong here, and we need to figure it out before you do something stupid.\"\\n\\n \"What\u0027s wrong,\" Christian said, glaring at Adrian, \"is that they\u0027re trying to break up Lissa and me, and you knew about it, Rose.\"\\n\\n Adrian glanced at me. \"Did you really?\"\\n\\n \"Yeah, long story.\" I turned back to Christian. \"Look, Adrian didn\u0027t have anything to do with this. Not intentionally. It was Tatiana\u0027s idea - and she hasn\u0027t even actually done anything yet. It\u0027s just her long-term plan - hers alone, not his.\"\\n\\n \"Then how did you know about it?\" demanded Christian.\\n\\n \"Because she told me - she was afraid that I was moving in on Adrian.\"\\n\\n \"Really? Did you defend our love?\" Adrian asked.\\n\\n \"Be quiet,\" I said. \"What I want to know, Christian, is who told you?\"\\n\\n \"Ralf,\" he said, looking uncertain for the first time.\\n\\n \"You should have known better than to listen to him,\" remarked Eddie, face darkening at the name.\\n\\n \"Except, for once, Ralf was actually telling the truth - aside from Adrian being in on it. Ralf\u0027s related to the queen\u0027s best friend,\" I explained.\\n\\n \"Wonderful,\" said Christian. He seemed calm enough, so Eddie and I released him. \"We\u0027ve all been played.\"\\n\\n I looked around, suddenly taken aback by something. \"Where\u0027s Lissa? Why didn\u0027t she stop all of this?\"\\n\\n Adrian raised an eyebrow at me. \"You tell us. Where is she? She didn\u0027t come to dinner.\"\\n\\n \"I can\u0027t. ...\" I frowned. I\u0027d gotten so good at shielding myself when I needed to that long periods of time would go by without me feeling anything from her. This time, I sensed nothing because there was nothing coming from her. \"I can\u0027t feel her.\"\\n\\n Three sets of eyes stared at me.\\n\\n \"Is she asleep?\" asked Eddie.\\n\\n \"I can tell when she\u0027s asleep...This is something different...\" Slowly, slowly, I gained a sense of where she was. She\u0027d been blocking me out on purpose, trying to hide from me, but I\u0027d found her as I always did. \"There she is. She was - oh God!\"\\n\\n My scream rang down the hall, echoing Lissa\u0027s own screams as, far away, pain shot through her. \\n\\n","sourceLink":"https://allnovel.net/shadow-kiss-vampire-academy-3/page-22.html","bookId":2062,"book":{"id":2062,"title":"Shadow Kiss (Vampire Academy #3)","description":"Storyline: Vampire Academy Series 3: Shadow Kiss \\n A little background... I am in my mid 20\u0027s and a high school teacher who loves to read when I can but doesn\u0027t get much time to do it in. I picked up the twilight series a year ago at a students request and was pleasantly surprised. Once the series was finished I needed another one! Before Twilight I had not been into teen romance/ fantasy books especially with vampires and such. I saw a book-list of recommendations by Twilight followers and picked up the \"House of Night\" series by PC Cast. This was worth reading and I am waiting for the next book to come. My husband now calls me addicted to Vamps since I started looking for a new series to pick up. I was strongly recommended to pick up the Vampire Academy series by my 20 year old sister who has always been a fan of this genre of books.\\n","cover":"https://allnovel.net/images/shadow-kiss-vampire-academy-3.jpg","author":"Richelle Mead","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/shadow-kiss-vampire-academy-3.html","creation":"Oct 5, 2019 8:58:18 AM","modification":"Oct 6, 2019 12:03:18 AM"}}
