{"id":110702,"no":25,"title":"Page 25","content":"Twenty-five DEAD OR TAKEN AWAY. It wasn\u0027t enough that the Strigoi had come and attacked us, that they\u0027d killed Moroi and dhampirs alike. They\u0027d also carried some off. It was something Strigoi were known to do. Even they had limits on how much blood they could drink at once. So they\u0027d often take prisoners to keep as snacks for later. Or sometimes a powerful Strigoi who didn\u0027t want to do the dirty work would send his or her minions off to bring back the prey. Every once in a while, they\u0027d even purposely take back captives to turn into more Strigoi. Whatever the reason, it meant that some of our people might still be alive. Students, Moroi and dhampir, were gathered up once certain buildings had been declared Strigoi-free. Adult Moroi were herded inside with us, leaving the guardians to assess the damage. I wanted desperately to be with them, to help and do my part, but they made it clear my part was over. There was nothing I could do at that point except wait and worry with the others. It still seemed unreal. Strigoi attacking our school. How could it have happened? The Academy was safe. We\u0027d always been taught that. It had to be safe. It was why our school years were so long and why Moroi families endured being separated for most of the year. It was worth it for children to have a safe place to go. That was no longer true. It took only a couple hours for them to get a casualty count, but waiting while those reports trickled in felt like days. And the numbers...the numbers were harsh. Fifteen Moroi had been killed. Twelve guardians had been killed. A group of thirteen, both Moroi and dhampirs, had been taken away. The guardians estimated that there had been close to fifty Strigoi, which was beyond mind-boggling. They\u0027d found twenty-eight Strigoi bodies. The rest appeared to have escaped, many taking victims with them. For that size of a Strigoi party, our casualty count was still lower than one might have expected. A few things were credited for saving us. One was the early warning. The Strigoi had barely penetrated the school\u0027s inner grounds when I\u0027d warned Stan. The school had gone into lockdown quickly, and the fact that most everyone was already inside for curfew had helped. Most of the Moroi victims - dead or taken - were those who had been out in the open when the Strigoi came. The Strigoi had never made it into the elementary dorms, which Dimitri said was largely thanks to me and Christian. They had managed to breach one of the Moroi dorms, however - the one that Lissa lived in. My stomach had dropped when I heard that. And even though I could feel that she was fine through the bond, all I could see was that smirking blond Strigoi, telling me he was going to finish the Dragomirs off. I didn\u0027t know what had happened to him; the attacking Strigoi group hadn\u0027t gotten far into her dorm, thankfully, but there had been casualties. One of them was Eddie. \"What?\" I exclaimed when Adrian told me. We were eating in the cafeteria. I wasn\u0027t sure which meal it was since the campus had reverted to a daylight schedule that threw my sense of timing off. The cafeteria was nearly silent, all conversations in low whispers. Meals were the only reason students could leave their dorms. There was going to be a guardian meeting later on that I was actually invited to, but for now, I was confined with the rest of my friends. \"He was with you guys,\" I said. I focused on Lissa, almost accusingly. \"I saw him with you. Through your eyes.\" She looked up at me over the tray of food she had no interest in eating, her face pale and full of grief. \"When the Strigoi got in downstairs, he and some other novices went down to help.\" \"They didn\u0027t find his body,\" said Adrian. There was no smirk on his face, no humor anywhere. \"He was one of the ones they took.\" Christian sighed and leaned back in his chair. \"He\u0027s as good as dead, then.\" The cafeteria disappeared. I stopped seeing any of them. All I could see in that moment was that room back in Spokane, that room where we\u0027d been held. They\u0027d tortured Eddie and nearly killed him. That experience had changed him forever, affecting the way he now conducted himself as a guardian. He\u0027d grown extremely dedicated as a result, but it had cost him some of the light and laughter he used to have. And now it was happening again. Eddie captured. He\u0027d worked so hard to protect Lissa and others, risking his own life in the attack. I\u0027d been nowhere near the Moroi dorm when it had happened, but I felt responsible - like I should have watched over him. Surely I owed it to Mason. Mason. Mason who had died on my watch and whose ghost I hadn\u0027t seen since he\u0027d warned me earlier. I hadn\u0027t been able to save him, and now I\u0027d lost his best friend too. I shot up from my chair and shoved my tray away. That dark fury I\u0027d been fighting blazed through me. If Strigoi had been around, I could have burned them up with it, without any need of Christian\u0027s magic. \"What\u0027s wrong?\" asked Lissa. I stared at her in disbelief. \"What\u0027s wrong? What\u0027s wrong? Do you seriously have to ask that?\" In the silent cafeteria, my voice rang out. People stared. \"Rose, you know what she means,\" said Adrian, voice unusually calm. \"We\u0027re all upset. Sit back down. It\u0027s going to be okay.\" For a moment, I almost listened to him. Then, I shook it off. He was trying to use compulsion to chill me out. I glared at him. \"It is not going to be okay - not unless we do something about this.\" \"There\u0027s nothing to be done,\" said Christian. Beside him, Lissa was silent, still hurt from when I\u0027d snapped at her. \"We\u0027ll see about that,\" I said. \"Rose, wait,\" she called. She was worried about me - and scared, too. It was tiny and selfish, but she didn\u0027t want me to leave her. She was used to me being there for her. I made her feel safe. But I couldn\u0027t stay, not right now. I stormed out of the commons and into the bright light outside. The guardians\u0027 meeting wasn\u0027t for another couple hours, but that didn\u0027t matter. I needed to talk to someone now. I sprinted to the guardians\u0027 building. Someone else was walking into it as I was, and I bumped her in my haste. \"Rose?\" My fury turned to surprise. \"Mom?\" My famous guardian mother, Janine Hathaway, stood there by the door. She looked the same as she had when I\u0027d seen her at New Year\u0027s, her curly red hair still worn short and her face weathered from the sun. Her brown eyes seemed grimmer than last time, however, which was saying something. \"What are you doing here?\" I asked. As I\u0027d told Deirdre, my mother and I had had a troubled relationship for most of my life, largely because of the distance that inevitably came with having a parent who was a guardian. I\u0027d resented her for years and we still weren\u0027t super close, but she\u0027d been there for me after Mason\u0027s death, and I think we both tentatively hoped things might improve in coming years. She\u0027d left after New Year\u0027s, and last I\u0027d heard, she\u0027d gone back to Europe with the Szelsky she guarded. She opened the door, and I followed her through. Her manner was brusque and businesslike, as always. \"Replenishing the numbers. They\u0027ve called in extras to reinforce campus.\" Replenishing the numbers. Replacing the guardians who had been killed. All the bodies had been cleared away - Strigoi, Moroi, and dhampir alike - but the hole left behind by those who were gone was apparent to all. I could still see them when I closed my eyes. But with her here, I realized I had an opportunity. I grabbed hold of her arm, which startled her. \"We have to go after them,\" I said. \"Rescue the ones who were taken.\" She regarded me carefully, a small frown the only sign of her feelings. \"We don\u0027t do that kind of thing. You know that. We have to protect those who are here.\" \"What about those thirteen? Shouldn\u0027t we protect them? And you went on a rescue mission once.\" She shook her head. \"That was different. We had a trail. We wouldn\u0027t know where to find this group if we wanted to.\" I knew she was right. The Strigoi wouldn\u0027t have left an easy path to follow. And yet... suddenly, I had an idea. \"They put the wards back up, right?\" I asked. \"Yes, almost immediately. We\u0027re still not sure how they were broken. There were no stakes used to pierce them.\" I started to tell her my theory about that, but she wasn\u0027t up to speed with my ghostly shenanigans. \"Do you know where Dimitri is?\" She gestured toward groups of guardians hurrying all around. \"I\u0027m sure he\u0027s busy here somewhere. Everyone is. And now I need to go check in. I know you were invited to the meeting, but that\u0027s not for a while yet - you should stay out of the way.\" \"I will... but I need to see Dimitri first. It\u0027s important - it might play a role in what happens at the meeting.\" \"What is it?\" she asked suspiciously. \"I can\u0027t explain yet...It\u0027s complicated. It\u0027d take too much time. Help me find him, and we\u0027ll tell you later.\" My mother didn\u0027t seem happy about this. After all, Janine Hathaway wasn\u0027t someone people usually said no to. But she nonetheless helped me find Dimitri. After the events over winter break, I think she\u0027d come to regard me as more than a hapless teenager. We found Dimitri with some other guardians, studying a map of campus and planning how to distribute the newly arrived guardians. There were enough people gathered around the map that he was able to slip away. \"What\u0027s going on?\" he asked as he and I stood off to the side of the room. Even in the midst of this crisis, in the midst of worrying so much about others, I could tell that there was part of him that worried just about me. \"Are you okay?\" \"I think we should launch a rescue mission,\" I said. \"You know we - \" \" - don\u0027t usually do that. Yeah, yeah. And I know we don\u0027t know where they are ... except, I might.\" He frowned. \"How?\" I told him how it had been Mason who\u0027d warned us last night. Dimitri and I had had no time to talk alone since then, so we\u0027d never really debriefed on the events of the attack. We also hadn\u0027t really had a chance to talk about what had happened in the cabin. It made me feel weird because really, that was all I wanted to think about, but I couldn\u0027t. Not with so much else going on. So I kept trying to shove those memories of sex away, only to have them keep popping up and entangle my emotions further. Hoping I seemed cool and competent, I continued explaining my ideas. \"Mason\u0027s locked out now because the wards are back up, but somehow ... I think he knows where the Strigoi are. I think he could show us where they are.\" Dimitri\u0027s face told me he had his doubts about this. \"Come on! You have to believe me after what happened.\" \"I\u0027m still having a hard time with that,\" he admitted. \"But okay. Suppose this is true. You think he can just lead us? You can ask him and he\u0027ll do it?\" \"Yeah,\" I said. \"I think I can. I\u0027ve been fighting him all this time, but I think if I actually try to work with him, he\u0027ll help. I think that\u0027s what he\u0027s always wanted. He knew the wards were weak and that the Strigoi had been lying in wait. The Strigoi can\u0027t be too far away from us ... they had to have stopped for daylight and hidden out somewhere. We might be able to get to them before the captives die. And once we get close enough, I can actually find them.\" I then explained the nauseous feeling I\u0027d gotten when Strigoi were around. Dimitri didn\u0027t challenge this. I think too many weird things were going on for him to even question it. \"But Mason isn\u0027t here. You said he can\u0027t get through the wards. How will you get him to help us?\" he asked. I\u0027d been thinking about this. \"Take me to the front gates.\" After a quick word to Alberta about \"investigating something,\" Dimitri led me outside, and we walked the long way to the entrance to the school. Neither of us said anything as we walked. Even in the midst of all this, I still kept thinking of the cabin, of being in his arms. In some ways, it was part of what helped me cope with all the rest of this horror. I had a feeling it was on his mind too. The entrance to the school consisted of a long stretch of iron fence that lay right on top of the wards. A road that wound from the main highway twenty miles away came up to the gate, which was almost always kept closed. Guardians had a small booth here, and the area was monitored at all times of the day. They were surprised by our request, but Dimitri insisted it would just be for a moment. They slid the heavy gate open, revealing a space only big enough for one person to get through at a time. Dimitri and I stepped outside. A headache almost immediately built up behind my eyes, and I started to see faces and shapes. It was just like at the airport. When I was outside of wards, I could see all sorts of spirits. But I understood it now and no longer feared it. I needed to control it. \"Go away,\" I said to the gray, looming forms around me. \"I don\u0027t have time for you. Go.\" I put as much force as I could into my will and my voice, and to my astonishment, the ghosts faded. A faint hum remained with me, reminding me they were still out there, and I knew if I let down my guard even a moment, it would all hit me again. Dimitri was eyeing me with concern. \"You\u0027re okay?\" I nodded and peered around. There was one ghost I wanted to see. \"Mason,\" I said. \"I need you.\" Nothing. I summoned back up the command I\u0027d used on the other ghosts just a moment ago. \"Mason. Please. Come here.\" I saw nothing except the road in front of us winding off into the winter-dead hills. Dimitri was giving me that look from last night, the one that said he was deeply concerned for my mental health. And actually, I was worried at that moment too. Last night\u0027s warning had been the final proof for me that Mason was real. But now ... A minute later, his shape materialized before me, looking a little paler than before. For the first time since all this had begun, I was happy to see him. He, of course, looked sad. Same old same old. \"Finally. You were making me look bad.\" He simply stared, and I immediately felt bad for joking. \"I\u0027m sorry. I need your help again. We have to find them. We have to save Eddie.\" He nodded. \"Can you show me where they are?\" He nodded again and turned, pointing off in a direction that was almost directly behind me. \"They came in through the back of campus?\" He nodded yet again, and like that, I knew what had happened. I knew how the Strigoi had gotten in, but there was no time to dwell on that just now. I turned to Dimitri. \"We need a map,\" I said. He walked back through the gate and spoke a few words to one of the guardians on duty. A moment later, he returned with a map and unfolded it. It showed the layout of campus, as well as the surrounding roads and terrain. I took it from him and held it out to Mason, trying to keep it flat in the whipping wind. The only true road out from the school was right in front of us. The rest of the campus was surrounded by forests and steep cliffs. I pointed to a spot at the back of the school\u0027s grounds. \"This is where they came in, isn\u0027t it? Where the wards first broke?\" Mason nodded. He held out his finger and without touching the map, traced a route through the woods that flanked the edge of a small mountain. Following it long enough eventually led to a small dirt road that joined an interstate many miles away. I followed where he pointed and suddenly had my doubts about using him as a guide. \"No, that\u0027s not right,\" I said. \"It can\u0027t be. This stretch of woods by the mountain has no roads. They\u0027d have to go on foot, and it\u0027d take too long to walk from the school to this other road. They wouldn\u0027t have had enough time. They\u0027d be caught in daylight.\" Mason shook his head - to disagree with me, apparently - and again traced the route back and forth. In particular, he kept pointing to a spot not far beyond the Academy\u0027s grounds. At least, it wasn\u0027t far away on the map. The map wasn\u0027t particularly detailed, and I guessed the spot was probably a few miles away. He held his finger there, looked at me, and then looked back down. \"They can\u0027t be there now,\" I argued. \"It\u0027s outside. They might have come in through the back, but they had to have left through the front - gotten in some kind of vehicle and took off.\" Mason shook his head. I looked up at Dimitri, frustrated. I felt like the clock was ticking on us, and Mason\u0027s weird assertion that the Strigoi were a few miles away, outdoors in the daytime, was stirring up my irritable nature. I sincerely doubted they\u0027d gotten out tents and were camping. \"Is there any building or anything out there?\" I demanded, pointing at the spot Mason had indicated. \"He says they were going out to that road. But they couldn\u0027t have walked there before the sun came up, and he claims they\u0027re there.\" Dimitri\u0027s eyes narrowed thoughtfully. \"Not that I know of.\" He took the map from me and brought it to the other guardians to check with them. While they talked, I glanced back at Mason. \"You better be right about this,\" I warned him. He nodded. \"Have you...have you seen them? The Strigoi and their captives?\" He nodded. \"Is Eddie still alive?\" He nodded, and Dimitri walked over. \"Rose...\" There was a strange sound to Dimitri\u0027s voice as he brought the map back, like he couldn\u0027t entirely believe what he was saying. \"Stephen says there are caves right at the base of the mountain here.\" I met Dimitri\u0027s eyes, no doubt looking just as astonished as he did. \"Are they big enough - \" \"Big enough for the Strigoi to hide out in until nighttime?\" Dimitri nodded. \"They are. And they\u0027re only five miles away.\"","sourceLink":"https://allnovel.net/shadow-kiss-vampire-academy-3/page-25.html","bookId":2062,"book":{"id":2062,"title":"Shadow Kiss (Vampire Academy #3)","description":"Storyline: Vampire Academy Series 3: Shadow Kiss A little background... I am in my mid 20\u0027s and a high school teacher who loves to read when I can but doesn\u0027t get much time to do it in. I picked up the twilight series a year ago at a students request and was pleasantly surprised. Once the series was finished I needed another one! Before Twilight I had not been into teen romance/ fantasy books especially with vampires and such. I saw a book-list of recommendations by Twilight followers and picked up the \"House of Night\" series by PC Cast. This was worth reading and I am waiting for the next book to come. My husband now calls me addicted to Vamps since I started looking for a new series to pick up. I was strongly recommended to pick up the Vampire Academy series by my 20 year old sister who has always been a fan of this genre of books.","cover":"https://allnovel.net/images/shadow-kiss-vampire-academy-3.jpg","author":"Richelle Mead","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/shadow-kiss-vampire-academy-3.html","creation":"Oct 5, 2019 8:58:18 AM","modification":"Oct 6, 2019 12:03:18 AM"}}
