{"id":28607,"no":11,"title":"chapter 10","content":"The placid inhabitants of the parish of Welland, including warbling waggoners, lone shepherds, ploughmen, the blacksmith, the carpenter, the gardener at the Great House, the steward and agent, the parson, clerk, and so on, were hourly expecting the announcement of St. Cleeve’s death. The sexton had been going to see his brother-inlaw, nine miles distant, but promptly postponed the visit for a few days, that there might be the regular professional hand present to toll the bell in a note of due fulness and solemnity; an attempt by a deputy, on a previous occasion of his absence, having degenerated into a miserable stammering clang that was a disgrace to the parish. \\n\\n \\n\\n But Swithin St. Cleeve did not decease, a fact of which, indeed, the habituated reader will have been well aware ever since the rain came down upon the young man in the ninth chapter, and led to his alarming illness. Though, for that matter, so many maimed histories are hourly enacting themselves in this dun-coloured world as to lend almost a priority of interest to narratives concerning those \\n\\n \\n\\n ‘Who lay great bases for eternity \\n\\n Which prove more short than waste or ruining.’ \\n\\n \\n\\n How it arose that he did not die was in this wise; and his example affords another instance of that reflex rule of the vassal soul over the sovereign body, which, operating so wonderfully in elastic natures, and more or less in all, originally gave rise to the legend that supremacy lay on the other side. \\n\\n \\n\\n The evening of the day after the tender, despairing, farewell kiss of Lady Constantine, when he was a little less weak than during her visit, he lay with his face to the window. He lay alone, quiet and resigned. He had been thinking, sometimes of her and other friends, but chiefly of his lost discovery. Although nearly unconscious at the time, he had yet been aware of that kiss, as the delicate flush which followed it upon his cheek would have told; but he had attached little importance to it as between woman and man. Had he been dying of love instead of wet weather, perhaps the impulsive act of that handsome lady would have been seized on as a proof that his love was returned. As it was her kiss seemed but the evidence of a naturally demonstrative kindliness, felt towards him chiefly because he was believed to be leaving her for ever. \\n\\n \\n\\n The reds of sunset passed, and dusk drew on. Old Hannah came upstairs to pull down the blinds and as she advanced to the window he said to her, in a faint voice, ‘Well, Hannah, what news today?’ \\n\\n \\n\\n ‘Oh, nothing, sir,’ Hannah replied, looking out of the window with sad apathy, ‘only that there’s a comet, they say.’ \\n\\n \\n\\n ‘A WHAT?’ said the dying astronomer, starting up on his elbow. \\n\\n \\n\\n ‘A comet — that’s all, Master Swithin,’ repeated Hannah, in a lower voice, fearing she had done harm in some way. \\n\\n \\n\\n ‘Well, tell me, tell me!’ cried Swithin. ‘Is it Gambart’s? Is it Charles the Fifth’s, or Halley’s, or Faye’s, or whose?’ \\n\\n \\n\\n ‘Hush!’ said she, thinking St. Cleeve slightly delirious again. ‘’Tis God A’mighty’s, of course. I haven’t seed en myself, but they say he’s getting bigger every night, and that he’ll be the biggest one known for fifty years when he’s full growed. There, you must not talk any more now, or I’ll go away.’ \\n\\n \\n\\n Here was an amazing event, little noise as it had made in the happening. Of all phenomena that he had longed to witness during his short astronomical career, those appertaining to comets had excited him most. That the magnificent comet of 1811 would not return again for thirty centuries had been quite a permanent regret with him. And now, when the bottomless abyss of death seemed yawning beneath his feet, one of these much-desired apparitions, as large, apparently, as any of its tribe, had chosen to show itself. \\n\\n \\n\\n ‘O, if I could but live to see that comet through my equatorial!’ he cried. \\n\\n \\n\\n Compared with comets, variable stars, which he had hitherto made his study, were, from their remoteness, uninteresting. They were to the former as the celebrities of Ujiji or Unyamwesi to the celebrities of his own country. Members of the solar system, these dazzling and perplexing rangers, the fascination of all astronomers, rendered themselves still more fascinating by the sinister suspicion attaching to them of being possibly the ultimate destroyers of the human race. In his physical prostration St. Cleeve wept bitterly at not being hale and strong enough to welcome with proper honour the present specimen of these desirable visitors. \\n\\n \\n\\n The strenuous wish to live and behold the new phenomenon, supplanting the utter weariness of existence that he had heretofore experienced, gave him a new vitality. The crisis passed; there was a turn for the better; and after that he rapidly mended. The comet had in all probability saved his life. The limitless and complex wonders of the sky resumed their old power over his imagination; the possibilities of that unfathomable blue ocean were endless. Finer feats than ever he would perform were to be achieved in its investigation. What Lady Constantine had said, that for one discovery made ten awaited making, was strikingly verified by the sudden appearance of this splendid marvel. \\n\\n \\n\\n The windows of St. Cleeve’s bedroom faced the west, and nothing would satisfy him but that his bed should be so pulled round as to give him a view of the low sky, in which the as yet minute tadpole of fire was recognizable. The mere sight of it seemed to lend him sufficient resolution to complete his own cure forthwith. His only fear now was lest, from some unexpected cause or other, the comet would vanish before he could get to the observatory on Rings-Hill Speer. \\n\\n \\n\\n In his fervour to begin observing he directed that an old telescope, which he had used in his first celestial attempts, should be tied at one end to the bed-post, and at the other fixed near his eye as he reclined. Equipped only with this rough improvisation he began to take notes. Lady Constantine was forgotten, till one day, suddenly, wondering if she knew of the important phenomenon, he revolved in his mind whether as a fellow-student and sincere friend of his she ought not to be sent for, and instructed in the use of the equatorial. \\n\\n \\n\\n But though the image of Lady Constantine, in spite of her kindness and unmistakably warm heart, had been obscured in his mind by the heavenly body, she had not so readily forgotten him. Too shy to repeat her visit after so nearly betraying her secret, she yet, every day, by the most ingenious and subtle means that could be devised by a woman who feared for herself, but could not refrain from tampering with danger, ascertained the state of her young friend’s health. On hearing of the turn in his condition she rejoiced on his account, and became yet more despondent on her own. If he had died she might have mused on him as her dear departed saint without much sin: but his return to life was a delight that bewildered and dismayed. \\n\\n \\n\\n One evening a little later on he was sitting at his bedroom window as usual, waiting for a sufficient decline of light to reveal the comet’s form, when he beheld, crossing the field contiguous to the house, a figure which he knew to be hers. He thought she must be coming to see him on the great comet question, to discuss which with so delightful and kind a comrade was an expectation full of pleasure. Hence he keenly observed her approach, till something happened that surprised him. \\n\\n \\n\\n When, at the descent of the hill, she had reached the stile that admitted to Mrs. Martin’s garden, Lady Constantine stood quite still for a minute or more, her gaze bent on the ground. Instead of coming on to the house she went heavily and slowly back, almost as if in pain; and then at length, quickening her pace, she was soon out of sight. She appeared in the path no more that day. \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1372/41136.html","bookId":1447,"book":{"id":1447,"title":"Two on a Tower","description":"简介： This slightly-built romance was the outcome of a wish to set the emotional history of two infinitesimal lives against the stupendous background of the stellar universe, and to impart to readers the sentiment that of these contrasting magnitudes the s...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1372","creation":"Aug 1, 2019 12:25:08 AM","modification":"Aug 1, 2019 12:25:08 AM"}}
