{"id":28628,"no":32,"title":"XXXII","content":"What to do she could not tell. The step which Swithin had entreated her to take, objectionable and premature as it had seemed in a county aspect, would at all events have saved her from this dilemma. Had she allowed him to tell the Bishop his simple story in its fulness, who could say but that that divine might have generously bridled his own impulses, entered into the case with sympathy, and forwarded with zest their designs for the future, owing to his interest of old in Swithin’s father, and in the naturally attractive features of the young man’s career. \n \n A puff of wind from the open window, wafting the Bishop’s letter to the floor, aroused her from her reverie. With a sigh she stooped and picked it up, glanced at it again; then arose, and with the deliberateness of inevitable action wrote her reply:— \n \n ‘WELLAND HOUSE, June 29, 18 —. \n \n ‘MY DEAR BISHOP OF MELCHESTER — I confess to you that your letter, so gracious and flattering as it is, has taken your friend somewhat unawares. The least I can do in return for its contents is to reply as quickly as possible. \n \n ‘There is no one in the world who esteems your high qualities more than myself, or who has greater faith in your ability to adorn the episcopal seat that you have been called on to fill. But to your question I can give only one reply, and that is an unqualified negative. To state this unavoidable decision distresses me, without affectation; and I trust you will believe that, though I decline the distinction of becoming your wife, I shall never cease to interest myself in all that pertains to you and your office; and shall feel the keenest regret if this refusal should operate to prevent a lifelong friendship between us. — I am, my dear Bishop of Melchester, ever sincerely yours, \n \n ‘VIVIETTE CONSTANTINE.’ \n \n A sudden revulsion from the subterfuge of writing as if she were still a widow, wrought in her mind a feeling of dissatisfaction with the whole scheme of concealment; and pushing aside the letter she allowed it to remain unfolded and unaddressed. In a few minutes she heard Swithin approaching, when she put the letter out of the way and turned to receive him. \n \n Swithin entered quietly, and looked round the room. Seeing with unexpected pleasure that she was there alone, he came over and kissed her. Her discomposure at some foregone event was soon obvious. \n \n ‘Has my staying caused you any trouble?’ he asked in a whisper. ‘Where is your brother this morning?’ \n \n She smiled through her perplexity as she took his hand. ‘The oddest things happen to me, dear Swithin,’ she said. ‘Do you wish particularly to know what has happened now?’ \n \n ‘Yes, if you don’t mind telling me.’ \n \n ‘I do mind telling you. But I must. Among other things I am resolving to give way to your representations — in part, at least. It will be best to tell the Bishop everything, and my brother, if not other people.’ \n \n ‘I am truly glad to hear it, Viviette,’ said he cheerfully. ‘I have felt for a long time that honesty is the best policy.’ \n \n ‘I at any rate feel it now. But it is a policy that requires a great deal of courage!’ \n \n ‘It certainly requires some courage — I should not say a great deal; and indeed, as far as I am concerned, it demands less courage to speak out than to hold my tongue.’ \n \n ‘But, you silly boy, you don’t know what has happened. The Bishop has made me an offer of marriage.’ \n \n ‘Good gracious, what an impertinent old man! What have you done about it, dearest?’ \n \n ‘Well, I have hardly accepted him,’ she replied, laughing. ‘It is this event which has suggested to me that I should make my refusal a reason for confiding our situation to him.’ \n \n ‘What would you have done if you had not been already appropriated?’ \n \n ‘That’s an inscrutable mystery. He is a worthy man; but he has very pronounced views about his own position, and some other undesirable qualities. Still, who knows? You must bless your stars that you have secured me. Now let us consider how to draw up our confession to him. I wish I had listened to you at first, and allowed you to take him into our confidence before his declaration arrived. He may possibly resent the concealment now. However, this cannot be helped.’ \n \n ‘I tell you what, Viviette,’ said Swithin, after a thoughtful pause, ‘if the Bishop is such an earthly sort of man as this, a man who goes falling in love, and wanting to marry you, and so on, I am not disposed to confess anything to him at all. I fancied him altogether different from that.’ \n \n ‘But he’s none the worse for it, dear.’ \n \n ‘I think he is — to lecture me and love you, all in one breath!’ \n \n ‘Still, that’s only a passing phase; and you first proposed making a confidant of him.’ \n \n ‘I did. . . . Very well. Then we are to tell nobody but the Bishop?’ \n \n ‘And my brother Louis. I must tell him; it is unavoidable. He suspects me in a way I could never have credited of him!’ \n \n Swithin, as was before stated, had arranged to start for Greenwich that morning, permission having been accorded him by the Astronomer-Royal to view the Observatory; and their final decision was that, as he could not afford time to sit down with her, and write to the Bishop in collaboration, each should, during the day, compose a well-considered letter, disclosing their position from his and her own point of view; Lady Constantine leading up to her confession by her refusal of the Bishop’s hand. It was necessary that she should know what Swithin contemplated saying, that her statements might precisely harmonize. He ultimately agreed to send her his letter by the next morning’s post, when, having read it, she would in due course despatch it with her own. \n \n As soon as he had breakfasted Swithin went his way, promising to return from Greenwich by the end of the week. \n \n Viviette passed the remainder of that long summer day, during which her young husband was receding towards the capital, in an almost motionless state. At some instants she felt exultant at the idea of announcing her marriage and defying general opinion. At another her heart misgave her, and she was tormented by a fear lest Swithin should some day accuse her of having hampered his deliberately-shaped plan of life by her intrusive romanticism. That was often the trick of men who had sealed by marriage, in their inexperienced youth, a love for those whom their maturer judgment would have rejected as too obviously disproportionate in years. \n \n However, it was now too late for these lugubrious thoughts; and, bracing herself, she began to frame the new reply to Bishop Helmsdale — the plain, unvarnished tale that was to supplant the undivulging answer first written. She was engaged on this difficult problem till daylight faded in the west, and the broad-faced moon edged upwards, like a plate of old gold, over the elms towards the village. By that time Swithin had reached Greenwich; her brother had gone she knew not whither; and she and loneliness dwelt solely, as before, within the walls of Welland House. \n \n At this hour of sunset and moonrise the new parlourmaid entered, to inform her that Mr. Cecil’s head clerk, from Warborne, particularly wished to see her. \n \n Mr. Cecil was her solicitor, and she knew of nothing whatever that required his intervention just at present. But he would not have sent at this time of day without excellent reasons, and she directed that the young man might be shown in where she was. On his entry the first thing she noticed was that in his hand he carried a newspaper. \n \n ‘In case you should not have seen this evening’s paper, Lady Constantine, Mr. Cecil has directed me to bring it to you at once, on account of what appears there in relation to your ladyship. He has only just seen it himself.’ \n \n ‘What is it? How does it concern me?’ \n \n ‘I will point it out.’ \n \n ‘Read it yourself to me. Though I am afraid there’s not enough light.’ \n \n ‘I can see very well here,’ said the lawyer’s clerk stepping to the window. Folding back the paper he read:— \n \n ‘“NEWS FROM SOUTH AFRICA. \n \n ‘“CAPE TOWN, May 17 (via Plymouth). — A correspondent of the Cape Chronicle states that he has interviewed an Englishman just arrived from the interior, and learns from him that a considerable misapprehension exists in England concerning the death of the traveller and hunter, Sir Blount Constantine —”’ \n \n ‘O, he’s living! My husband is alive,’ she cried, sinking down in nearly a fainting condition. \n \n ‘No, my lady. Sir Blount is dead enough, I am sorry to say.’ \n \n ‘Dead, did you say?’ \n \n ‘Certainly, Lady Constantine; there is no doubt of it.’ \n \n She sat up, and her intense relief almost made itself perceptible like a fresh atmosphere in the room. ‘Yes. Then what did you come for?’ she asked calmly. \n \n ‘That Sir Blount has died is unquestionable,’ replied the lawyer’s clerk gently. ‘But there has been some mistake about the date of his death.’ \n \n ‘He died of malarious fever on the banks of the Zouga, October 24, 18 —.’ \n \n ‘No; he only lay ill there a long time it seems. It was a companion who died at that date. But I’ll read the account to your ladyship, with your permission:— \n \n ‘“The decease of this somewhat eccentric wanderer did not occur at the time hitherto supposed, but only in last December. The following is the account of the Englishman alluded to, given as nearly as possible in his own words: During the illness of Sir Blount and his friend by the Zouga, three of the servants went away, taking with them a portion of his clothing and effects; and it must be they who spread the report of his death at this time. After his companion’s death he mended, and when he was strong enough he and I travelled on to a healthier district. I urged him not to delay his return to England; but he was much against going back there again, and became so rough in his manner towards me that we parted company at the first opportunity I could find. I joined a party of white traders returning to the West Coast. I stayed here among the Portuguese for many months. I then found that an English travelling party were going to explore a district adjoining that which I had formerly traversed with Sir Blount. They said they would be glad of my services, and I joined them. When we had crossed the territory to the South of Ulunda, and drew near to Marzambo, I heard tidings of a man living there whom I suspected to be Sir Blount, although he was not known by that name. Being so near I was induced to seek him out, and found that he was indeed the same. He had dropped his old name altogether, and had married a native princess —”’ \n \n ‘Married a native princess!’ said Lady Constantine. \n \n ‘That’s what it says, my lady — “married a native princess according to the rites of the tribe, and was living very happily with her. He told me he should never return to England again. He also told me that having seen this princess just after I had left him, he had been attracted by her, and had thereupon decided to reside with her in that country, as being a land which afforded him greater happiness than he could hope to attain elsewhere. He asked me to stay with him, instead of going on with my party, and not reveal his real title to any of them. After some hesitation I did stay, and was not uncomfortable at first. But I soon found that Sir Blount drank much harder now than when I had known him, and that he was at times very greatly depressed in mind at his position. One morning in the middle of December last I heard a shot from his dwelling. His wife rushed frantically past me as I hastened to the spot, and when I entered I found that he had put an end to himself with his revolver. His princess was broken-hearted all that day. When we had buried him I discovered in his house a little box directed to his solicitors at Warborne, in England, and a note for myself, saying that I had better get the first chance of returning that offered, and requesting me to take the box with me. It is supposed to contain papers and articles for friends in England who have deemed him dead for some time.”’ \n \n The clerk stopped his reading, and there was a silence. ‘The middle of last December,’ she at length said, in a whisper. ‘Has the box arrived yet?’ \n \n ‘Not yet, my lady. We have no further proof of anything. As soon as the package comes to hand you shall know of it immediately.’ \n \n Such was the clerk’s mission; and, leaving the paper with her, he withdrew. The intelligence amounted to thus much: that, Sir Blount having been alive till at least six weeks after her marriage with Swithin St. Cleeve, Swithin St. Cleeve was not her husband in the eye of the law; that she would have to consider how her marriage with the latter might be instantly repeated, to establish herself legally as that young man’s wife. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1372/42903.html","bookId":1447,"book":{"id":1447,"title":"Two on a Tower","description":"简介： This slightly-built romance was the outcome of a wish to set the emotional history of two infinitesimal lives against the stupendous background of the stellar universe, and to impart to readers the sentiment that of these contrasting magnitudes the s...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1372","creation":"Aug 1, 2019 12:25:08 AM","modification":"Aug 1, 2019 12:25:08 AM"}}
