{"id":28632,"no":36,"title":"XXXVI","content":"The immediate effect upon St. Cleeve of the receipt of her well-reasoned argument for retrocession was, naturally, a bitter attack upon himself for having been guilty of such cruel carelessness as to leave in her way the lawyer’s letter that had first made her aware of his uncle’s provision for him. Immature as he was, he could realize Viviette’s position sufficiently well to perceive what the poor lady must suffer at having suddenly thrust upon her the responsibility of repairing her own situation as a wife by ruining his as a legatee. True, it was by the purest inadvertence that his pending sacrifice of means had been discovered; but he should have taken special pains to render such a mishap impossible. If on the first occasion, when a revelation might have been made with impunity, he would not put it in the power of her good nature to relieve his position by refusing him, he should have shown double care not to do so now, when she could not exercise that benevolence without the loss of honour. With a young man’s inattention to issues he had not considered how sharp her feelings as a woman must be in this contingency. It had seemed the easiest thing in the world to remedy the defect in their marriage, and therefore nothing to be anxious about. And in his innocence of any thought of appropriating the bequest by taking advantage of the loophole in his matrimonial bond, he undervalued the importance of concealing the existence of that bequest. The looming fear of unhappiness between them revived in Swithin the warm emotions of their earlier acquaintance. Almost before the sun had set he hastened to Welland House in search of her. The air was disturbed by stiff summer blasts, productive of windfalls and premature descents of leafage. It was an hour when unripe apples shower down in orchards, and unbrowned chestnuts descend in their husks upon the park glades. There was no help for it this afternoon but to call upon her in a direct manner, regardless of suspicions. He was thunderstruck when, while waiting in the full expectation of being admitted to her presence, the answer brought back to him was that she was unable to see him. This had never happened before in the whole course of their acquaintance. But he knew what it meant, and turned away with a vague disquietude. He did not know that Lady Constantine was just above his head, listening to his movements with the liveliest emotions, and, while praying for him to go, longing for him to insist on seeing her and spoil all. But the faintest symptom being always sufficient to convince him of having blundered, he unwittingly took her at her word, and went rapidly away. However, he called again the next day, and she, having gained strength by one victory over herself, was enabled to repeat her refusal with greater ease. Knowing this to be the only course by which her point could be maintained, she clung to it with strenuous and religious pertinacity. Thus immured and self-controlling she passed a week. Her brother, though he did not live in the house (preferring the nearest watering-place at this time of the year), was continually coming there; and one day he happened to be present when she denied herself to Swithin for the third time. Louis, who did not observe the tears in her eyes, was astonished and delighted: she was coming to her senses at last. Believing now that there had been nothing more between them than a too-plainly shown partiality on her part, he expressed his commendation of her conduct to her face. At this, instead of owning to its advantage also, her tears burst forth outright. Not knowing what to make of this, Louis said — ‘Well, I am simply upholding you in your course.’ ‘Yes, yes; I know it!’ she cried. ‘And it is my deliberately chosen course. I wish he — Swithin St. Cleeve — would go on his travels at once, and leave the place! Six hundred a year has been left him for travel and study of the southern constellations; and I wish he would use it. You might represent the advantage to him of the course if you cared to.’ Louis thought he could do no better than let Swithin know this as soon as possible. Accordingly when St. Cleeve was writing in the hut the next day he heard the crackle of footsteps over the fir-needles outside, and jumped up, supposing them to be hers; but, to his disappointment, it was her brother who appeared at the door. ‘Excuse my invading the hermitage, St. Cleeve,’ he said in his careless way, ‘but I have heard from my sister of your good fortune.’ ‘My good fortune?’ ‘Yes, in having an opportunity for roving; and with a traveller’s conceit I couldn’t help coming to give you the benefit of my experience. When do you start?’ ‘I have not formed any plan as yet. Indeed, I had not quite been thinking of going.’ Louis stared. ‘Not going? Then I may have been misinformed. What I have heard is that a good uncle has kindly bequeathed you a sufficient income to make a second Isaac Newton of you, if you only use it as he directs.’ Swithin breathed quickly, but said nothing. ‘If you have not decided so to make use of it, let me implore you, as your friend, and one nearly old enough to be your father, to decide at once. Such a chance does not happen to a scientific youth once in a century.’ ‘Thank you for your good advice — for it is good in itself, I know,’ said Swithin, in a low voice. ‘But has Lady Constantine spoken of it at all?’ ‘She thinks as I do.’ ‘She has spoken to you on the subject?’ ‘Certainly. More than that; it is at her request — though I did not intend to say so — that I come to speak to you about it now.’ ‘Frankly and plainly,’ said Swithin, his voice trembling with a compound of scientific and amatory emotion that defies definition, ‘does she say seriously that she wishes me to go?’ ‘She does.’ ‘Then go I will,’ replied Swithin firmly. ‘I have been fortunate enough to interest some leading astronomers, including the Astronomer Royal; and in a letter received this morning I learn that the use of the Cape Observatory has been offered me for any southern observations I may wish to make. This offer I will accept. Will you kindly let Lady Constantine know this, since she is interested in my welfare?’ Louis promised, and when he was gone Swithin looked blankly at his own situation, as if he could scarcely believe in its reality. Her letter to him, then, had been deliberately written; she meant him to go. But he was determined that none of those misunderstandings which ruin the happiness of lovers should be allowed to operate in the present case. He would see her, if he slept under her walls all night to do it, and would hear the order to depart from her own lips. This unexpected stand she was making for his interests was winning his admiration to such a degree as to be in danger of defeating the very cause it was meant to subserve. A woman like this was not to be forsaken in a hurry. He wrote two lines, and left the note at the house with his own hand. ‘THE CABIN, RINGS-HILL, July 7th. ‘DEAREST VIVIETTE — If you insist, I will go. But letter-writing will not do. I must have the command from your own two lips, otherwise I shall not stir. I am here every evening at seven. Can you come? — S.’ This note, as fate would have it, reached her hands in the single hour of that week when she was in a mood to comply with his request, just when moved by a reactionary emotion after dismissing Swithin. She went upstairs to the window that had so long served purposes of this kind, and signalled ‘Yes.’ St. Cleeve soon saw the answer she had given and watched her approach from the tower as the sunset drew on. The vivid circumstances of his life at this date led him ever to remember the external scenes in which they were set. It was an evening of exceptional irradiations, and the west heaven gleamed like a foundry of all metals common and rare. The clouds were broken into a thousand fragments, and the margin of every fragment shone. Foreseeing the disadvantage and pain to her of maintaining a resolve under the pressure of a meeting, he vowed not to urge her by word or sign; to put the question plainly and calmly, and to discuss it on a reasonable basis only, like the philosophers they assumed themselves to be. But this intention was scarcely adhered to in all its integrity. She duly appeared on the edge of the field, flooded with the metallic radiance that marked the close of this day; whereupon he quickly descended the steps, and met her at the cabin door. They entered it together. As the evening grew darker and darker he listened to her reasoning, which was precisely a repetition of that already sent him by letter, and by degrees accepted her decision, since she would not revoke it. Time came for them to say good-bye, and then — ‘He turn’d and saw the terror in her eyes, That yearn’d upon him, shining in such wise As a star midway in the midnight fix’d.’ It was the misery of her own condition that showed forth, hitherto obscured by her ardour for ameliorating his. They closed together, and kissed each other as though the emotion of their whole year-and-half’s acquaintance had settled down upon that moment. ‘I won’t go away from you!’ said Swithin huskily. ‘Why did you propose it for an instant?’ Thus the nearly ended interview was again prolonged, and Viviette yielded to all the passion of her first union with him. Time, however, was merciless, and the hour approached midnight, and she was compelled to depart. Swithin walked with her towards the house, as he had walked many times before, believing that all was now smooth again between them, and caring, it must be owned, very little for his fame as an expositor of the southern constellations just then. When they reached the silent house he said what he had not ventured to say before, ‘Fix the day — you have decided that it is to be soon, and that I am not to go?’ But youthful Swithin was far, very far, from being up to the fond subtlety of Viviette this evening. ‘I cannot decide here,’ she said gently, releasing herself from his arm; ‘I will speak to you from the window. Wait for me.’ She vanished; and he waited. It was a long time before the window opened, and he was not aware that, with her customary complication of feeling, she had knelt for some time inside the room before looking out. ‘Well?’ said he. ‘It cannot be,’ she answered. ‘I cannot ruin you. But the day after you are five-and-twenty our marriage shall be confirmed, if you choose.’ ‘O, my Viviette, how is this!’ he cried. ‘Swithin, I have not altered. But I feared for my powers, and could not tell you whilst I stood by your side. I ought not to have given way as I did to-night. Take the bequest, and go. You are too young — to be fettered — I should have thought of it! Do not communicate with me for at least a year: it is imperative. Do not tell me your plans. If we part, we do part. I have vowed a vow not to further obstruct the course you had decided on before you knew me and my puling ways; and by Heaven’s help I’ll keep that vow. . . . Now go. These are the parting words of your own Viviette!’ Swithin, who was stable as a giant in all that appertained to nature and life outside humanity, was a mere pupil in domestic matters. He was quite awed by her firmness, and looked vacantly at her for a time, till she closed the window. Then he mechanically turned, and went, as she had commanded.","sourceLink":"http://novel.tingroom.com/jingdian/1372/42907.html","bookId":1447,"book":{"id":1447,"title":"Two on a Tower","description":"简介： This slightly-built romance was the outcome of a wish to set the emotional history of two infinitesimal lives against the stupendous background of the stellar universe, and to impart to readers the sentiment that of these contrasting magnitudes the s...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1372","creation":"Aug 1, 2019 12:25:08 AM","modification":"Aug 1, 2019 12:25:08 AM"}}
