{"id":4132,"no":4,"title":"Alphonse Daudet — 1898","content":"It is sweet to talk decorously of the dead who are part of our past, our indisputable possession. One must admit regretfully that to-day is but a scramble, that to-morrow may never come; it is only the precious yesterday that cannot be taken away from us. A gift from the dead, great and little, it makes life supportable, it almost makes one believe in a benevolent scheme of creation. And some kind of belief is very necessary. But the real knowledge of matters infinitely more profound than any conceivable scheme of creation is with the dead alone. That is why our talk about them should be as decorous as their silence. Their generosity and their discretion deserve nothing less at our hands; and they, who belong already to the unchangeable, would probably disdain to claim more than this from a mankind that changes its loves and its hates about every twenty-five years — at the coming of every new and wiser generation. \n \n One of the most generous of the dead is Daudet, who, with a prodigality approaching magnificence, gave himself up to us without reserve in his work, with all his qualities and all his faults. Neither his qualities nor his faults were great, though they were by no means imperceptible. It is only his generosity that is out of the common. What strikes one most in his work is the disinterestedness of the toiler. With more talent than many bigger men, he did not preach about himself, he did not attempt to persuade mankind into a belief of his own greatness. He never posed as a scientist or as a seer, not even as a prophet; and he neglected his interests to the point of never propounding a theory for the purpose of giving a tremendous significance to his art, alone of all things, in a world that, by some strange oversight, has not been supplied with an obvious meaning. Neither did he affect a passive attitude before the spectacle of life, an attitude which in gods — and in a rare mortal here and there — may appear godlike, but assumed by some men, causes one, very unwillingly, to think of the melancholy quietude of an ape. He was not the wearisome expounder of this or that theory, here to-day and spurned to-morrow. He was not a great artist, he was not an artist at all, if you like — but he was Alphonse Daudet, a man as naively clear, honest, and vibrating as the sunshine of his native land; that regrettably undiscriminating sunshine which matures grapes and pumpkins alike, and cannot, of course, obtain the commendation of the very select who look at life from under a parasol. \n \n Naturally, being a man from the South, he had a rather outspoken belief in himself, but his small distinction, worth many a greater, was in not being in bondage to some vanishing creed. He was a worker who could not compel the admiration of the few, but who deserved the affection of the many; and he may be spoken of with tenderness and regret, for he is not immortal — he is only dead. During his life the simple man whose business it ought to have been to climb, in the name of Art, some elevation or other, was content to remain below, on the plain, amongst his creations, and take an eager part in those disasters, weaknesses, and joys which are tragic enough in their droll way, but are by no means so momentous and profound as some writers — probably for the sake of Art — would like to make us believe. There is, when one thinks of it, a considerable want of candour in the august view of life. Without doubt a cautious reticence on the subject, or even a delicately false suggestion thrown out in that direction is, in a way, praiseworthy, since it helps to uphold the dignity of man — a matter of great importance, as anyone can see; still one cannot help feeling that a certain amount of sincerity would not be wholly blamable. To state, then, with studied moderation a belief that in unfortunate moments of lucidity is irresistibly borne in upon most of us — the blind agitation caused mostly by hunger and complicated by love and ferocity does not deserve either by its beauty, or its morality, or its possible results, the artistic fuss made over it. It may be consoling — for human folly is very bizarre— but it is scarcely honest to shout at those who struggle drowning in an insignificant pool: You are indeed admirable and great to be the victims of such a profound, of such a terrible ocean! \n \n And Daudet was honest; perhaps because he knew no better — but he was very honest. If he saw only the surface of things it is for the reason that most things have nothing but a surface. He did not pretend — perhaps because he did not know how — he did not pretend to see any depths in a life that is only a film of unsteady appearances stretched over regions deep indeed, but which have nothing to do with the half-truths, half-thoughts, and whole illusions of existence. The road to these distant regions does not lie through the domain of Art or the domain of Science where well-known voices quarrel noisily in a misty emptiness; it is a path of toilsome silence upon which travel men simple and unknown, with closed lips, or, maybe, whispering their pain softly — only to themselves. \n \n But Daudet did not whisper; he spoke loudly, with animation, with a clear felicity of tone — as a bird sings. He saw life around him with extreme clearness, and he felt it as it is — thinner than air and more elusive than a flash of lightning. He hastened to offer it his compassion, his indignation, his wonder, his sympathy, without giving a moment of thought to the momentous issues that are supposed to lurk in the logic of such sentiments. He tolerated the little foibles, the small ruffianisms, the grave mistakes; the only thing he distinctly would not forgive was hardness of heart. This unpractical attitude would have been fatal to a better man, but his readers have forgiven him. Withal he is chivalrous to exiled queens and deformed sempstresses, he is pityingly tender to broken-down actors, to ruined gentlemen, to stupid Academicians; he is glad of the joys of the commonplace people in a commonplace way — and he never makes a secret of all this. No, the man was not an artist. What if his creations are illumined by the sunshine of his temperament so vividly that they stand before us infinitely more real than the dingy illusions surrounding our everyday existence? The misguided man is for ever pottering amongst them, lifting up his voice, dotting his i’s in the wrong places. He takes Tartarin by the arm, he does not conceal his interest in the Nabob’s cheques, his sympathy for an honest Academician plus bete que Nature, his hate for an architect plus mauvais que la gale; he is in the thick of it all. He feels with the Duc de Mora and with Felicia Ruys — and he lets you see it. He does not sit on a pedestal in the hieratic and imbecile pose of some cheap god whose greatness consists in being too stupid to care. He cares immensely for his Nabobs, his kings, his book-keepers, his Colettes, and his Saphos. He vibrates together with his universe, and with lamentable simplicity follows M. de Montpavon on that last walk along the Boulevards. \n \n “Monsieur de Montpavon marche e la mort,” and the creator of that unlucky gentilhomme follows with stealthy footsteps, with wide eyes, with an impressively pointing finger. And who wouldn’t look? But it is hard; it is sometimes very hard to forgive him the dotted i’s, the pointing finger, this making plain of obvious mysteries. “Monsieur de Montpavon marche e la mort,” and presently, on the crowded pavement, takes off his hat with punctilious courtesy to the doctor’s wife, who, elegant and unhappy, is bound on the same pilgrimage. This is too much! We feel we cannot forgive him such meetings, the constant whisper of his presence. We feel we cannot, till suddenly the very naivete of it all touches us with the revealed suggestion of a truth. Then we see that the man is not false; all this is done in transparent good faith. The man is not melodramatic; he is only picturesque. He may not be an artist, but he comes as near the truth as some of the greatest. His creations are seen; you can look into their very eyes, and these are as thoughtless as the eyes of any wise generation that has in its hands the fame of writers. Yes, they are seen, and the man who is not an artist is seen also commiserating, indignant, joyous, human and alive in their very midst. Inevitably they marchent e la mort — and they are very near the truth of our common destiny: their fate is poignant, it is intensely interesting, and of not the slightest consequence. \n \n \n","sourceLink":"http://novel.tingroom.com/mingren/870/17830.html","bookId":142,"book":{"id":142,"title":"Notes on Life and Letters","description":"简介： These words are reported as having been uttered in our midst not a hundred years ago, publicly, from the seat of justice, by a civic magistrate. The words of our municipal rulers have a solemnity and importance far above the words of other mortals, b...","cover":"http://novel.tingroom.com/file/upload/201409/28/10-35-03-84-1.jpg","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/870","creation":"Aug 1, 2019 12:18:19 AM","modification":"Aug 1, 2019 12:18:19 AM"}}
