{"id":80044,"no":20,"title":"Page 20","content":"Jonas picked it up and returned to the room that had contained the crystal. He stretched the handle of the broom out in front of him cautiously, applying pressure to the stone indicated in the diary.\n With an almost silent hiss a sinister blade shot from between two floor stones. If he had been crouching where he\u0027d been earlier, he would now have been a candidate for a boys\u0027 chorus, Jonas realized. He wiped sweat from his forehead.\n He waited a moment and then stepped cautiously around the quivering blade to examine the hollow stone behind it. The surface of the stone had slid back, revealing an empty interior. Jonas leaned down to probe the inside.\n He knew instantly that the move was a mistake—a bad one.\n A violent wave of emotion roared through him and the walls of the psychic corridor began to take shape.\n Jonas fought to keep himself from being sucked into the time tunnel. An overwhelming sense of foreboding nearly drowned him as he struggled to fight the inexorable pull of violence long past.\n Death awaited him. Death awaited anyone who dared to use the crystal.\n \"Verity. Verity!\"\n Jonas did not know if he screamed the words aloud or silently in his mind. Sweat was pouring from him as he gathered every ounce of his willpower and yanked his hand back out of the hollow stone.\n \"Jonas?\"\n He felt her there with him. It wasn\u0027t possible, he told himself, dazed. She was downstairs in another part of the villa. She wasn\u0027t close enough to help him.\n \"Jonas? What\u0027s wrong?\"\n Verity was reaching for him. He couldn\u0027t see her, but he could feel her presence, an anchor in the storm.\n Jonas squeezed his eyes shut and rolled clear of the section of floor that contained the trap and the hollow stone.\n Suddenly his vision cleared and everything returned to normal. The images of violent brutality and death disappeared as quickly as they\u0027d appeared.\n The blade slid back into the floor and the opening in the stone vanished without a trace.\n Jonas lay on the floor breathing heavily. He stared at the corner of the room where death awaited the unwary. He knew then that the real danger surrounding the missing crystal was not the blade hidden between the stones. Whatever the crystal was, whatever function it performed, it was evil. The knowledge sent a savage shudder of excitement through him. He was on the trail of something very big.\n For Jonas, the treasure hunt had just superseded the consulting work he was here to do. There were secrets hidden in this old villa. Important secrets. He had to discover them.\n Jonas rose slowly to his feet. He picked up the flashlight and edged out of the room, keeping his eyes on the dangerous stone until he was safely out in the hall. Then he firmly closed the door.\n It seemed to Jonas that he could hear laughter in his mind as he made his way back to the south wing of the villa. He thought at first that it was his imagination producing echoes of Digby Hazelhurst\u0027s amusement. Then he realized that the laughter was much older. About four hundred years old, to be exact.\n Jonas is all right. Verity felt reality slide gently back into place. Her pulse was still racing, and she felt lightheaded. She wished Slade Spencer weren\u0027t holding her right hand so tightly. On the other side of her Doug Warwick had his fingers laced lightly between hers. She felt trapped.\n She opened her eyes and glanced around at the intent faces of the the small circle of would-be psychics.\n Doug Warwick was staring over his sister\u0027s shoulder into the fire. He looked bored. Oliver Crump had his eyes closed. He seemed to be concentrating intently, as did Elyssa and Preston Yarwood. Elyssa had a dreamy expression on her face, as if she was seeing an inner vision. Preston was frowning.\n Slade Spencer kept squeezing Verity\u0027s fingers spasmodically. He had put aside his pipe and an afterdinner drink in order to join the circle. Sensing Verity\u0027s glance, he opened one eye and winked solemnly, squeezing her fingers until she thought they might break.\n Verity pulled her hand free from Slade\u0027s and released herself from Doug\u0027s loose grip. Doug glanced at her with an inquiring smile.\n \"Bored already?\"\n \"I… I have to go to my room,\" Verity whispered uneasily.\n \"I don\u0027t blame you for wanting out of this,\" Doug murmured. \"Go on, you\u0027re excused.\"\n Slade nodded at her as she edged free of the circle. His eyes were hooded and heavy with alcohol.\n \"Night, Verity. See you in the morning,\" he muttered. Crump, Elyssa, and Yarwood appeared not to notice Verity\u0027s departure. They obviously had their minds on higher matters.\n Verity slipped out of the salon. She paused outside in the chilly hall, letting her breathing return to normal. The sense of danger was gone, but she wouldn\u0027t be able to relax until she saw Jonas and found out what had happened.\n Every time before, she had been drawn into the psychic corridor with him only when they were physically close. The link between them didn\u0027t hold beyond a distance of a few feet. Yet, she could have sworn that for a moment she had experienced the familiar feeling of stepping into the time corridor with Jonas.\n She hurried painfully up the stone staircase to the bedroom she and Jonas had been assigned. She flung open the door hoping to find him inside but the room was empty.\n \"Dammit, Jonas,\" she grumbled aloud, \"where are you?\"\n He could be anywhere in the huge villa. It was useless to start prowling the halls for him. She would just have to wait until he returned. Verity wandered into the bathroom to start getting ready for bed. She had a long list of questions she planned to fire at Jonas when he finally showed up.\n But it wasn\u0027t Jonas who was waiting for her when she emerged from the bathroom wearing her flannel nightgown.\n \"Slade!\" Verity stopped abruptly. Spencer was sitting on the edge of the bed, and he looked drunker than ever.\n \"Don\u0027t worry, Verity,\" he said in a slurred voice. \"Got the message. I ditched that dumb psychic circle right after you did. Told everyone I was feeling a little sick. Which I was when I thought of Elyssa going into her channeling routine. Got up here as fast as I could. Any idea how long your friend Jonas will be gone? Maybe we oughta go to my room.\"\n \"What in the world do you think you\u0027re doing here? Are you out of your mind?\" Verity grabbed her robe and belted it around her waist. She was furious, but she realized that Spencer was too far gone to notice.\n \"You\u0027re drunk, Slade. Or maybe not just drank—that pipe of yours smells a little funny. Get out of here now!\"\n He looked bewildered and a bit hurt. He blinked his hooded, sleepy eyes in an attempt to focus on her face. \"But you want me here. You invited me up here,\" he whined.\n \"I did not invite you up here, and if you were sober, you\u0027d know that. Now leave. Immediately.\" \n","sourceLink":"https://allnovel.net/gift-of-fire-gift-2/page-20.html","bookId":1796,"book":{"id":1796,"title":"Gift of Fire (Gift #2)","description":"Storyline: \n HE FIGURES ONE AND ONE EQUAL TWO. SHE KNOWS HE\u0027S WRONG...IF BABY MAKES THREE. \n Jonas Quarrel was lean, sexy, and equally capable of quoting Renaissance poetry or wielding a dagger. Verity Ames knew Jonas was the perfect partner for an affair--and that he was not the marrying kind. Before long he would be looking for a new excitement, leaving Verity behind to run her gourmet restaurant in a California resort, hold on to misty colored memories, and wonder what she was going to do if she were pregnant with his child. Sure enough, her adventuring lover was soon off to an Italian villa rebuilt on a Pacific Northwest island. Jonas went to hunt for missing Renaissance jewels. Verity went along to snare a husband. A big, soft, four-poster bed might be the ideal place to try out her lures! But in this ancient mansion of hidden passageways and mysterious perils, there were some deadly traps for those blinded by love...unless Verity could help Jonas discover the most precious treasure a woman and man can find.\n \n","cover":"https://allnovel.net/images/gift-of-fire-gift-2.jpg","author":"Jayne Ann Krentz","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/gift-of-fire-gift-2.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:20:01 PM"}}
