{"id":64744,"no":14,"title":"Page 14","content":"“It was a direct order,” Thomas repeats. “Commander Jameson is not to be questioned. What don’t you understand about that? She knew that he hacked into the deceased persons’ database, along with a host of other high security government catalogs. Your brother broke the law, multiple times. Commander Jameson couldn’t have a well-respected captain of her patrol committing crimes right under her nose.” I narrow my eyes. “And that’s why you killed him in a dark alley, then framed Day for it? Because you’d happily follow your commander’s orders right off a cliff?” Thomas slams his hand down on the table hard enough to make me jump. “It was a signed order from the state of California,” he shouts. “Do you understand what I’m saying? I had no better choice.” Then his eyes widen—he hadn’t expected those words to come out, not that way. They stun me too. He keeps talking, now at a quicker pace, seemingly determined to erase the words. A strange light glows in his eyes, something that I can’t quite pinpoint. What is it? “I’m a soldier of the Republic. When I joined the military I took an oath to obey my superiors’ orders at all costs. Metias took the same oath, and he broke it.” There’s something odd about the way he refers to Metias, a sort of hidden emotion that throws me off. “The state is broken.” I take a deep breath. “And you’re a coward for leaving Metias at its mercy.” Thomas’s eyes constrict as if I’d stabbed him. I study him closer, but he notices me analyzing him and jerks his face away, turning to the side and hiding his head in his hands. I think about my brother again, this time flipping in my mind through his many years spent in Thomas’s company. Metias had known Thomas since they were kids, long before I was born. Whenever his father, our apartment floor’s janitor, would bring Thomas along to accompany him during his work shifts, Thomas and Metias would play for hours on end. Military video games. Toy guns. After I came into the picture, I remember the many quiet conversations the two of them would share in our living room, and how often they were together. I recall Thomas’s Trial score: 1365. Great for a poor sector kid, but average for kids in Ruby sector. Metias was the first to pick up on Thomas’s intense interest in being a soldier. He’d spend entire afternoons teaching Thomas everything he knew. Thomas would never have made it into Emerald sector’s Highland University without my brother’s help. My breaths turn shallow as something falls into place. I remember the way Metias’s gaze would linger on Thomas during their training sessions. I’d always assumed that was just my brother’s way of studying Thomas’s posture and performance for accuracy. I remember how patient and gentle Metias was when explaining things to Thomas. The way his hand would touch Thomas’s shoulder. The night when I’d eaten edame at that café with Thomas and Metias, when Metias first stopped shadowing Chian. The way Metias’s hand would sometimes rest on Thomas’s arm for a beat longer than it had to. The chat I had with my brother when he took care of me on the day of his induction. How he’d laughed. I don’t need girlfriends. I’ve got a baby sister to take care of. And it was true. He’d dated a couple of girls in college, but never for longer than a week, and always with polite disinterest. So obvious. How could I not have seen this before? Of course Metias never talked to me about it. Officer and subordinate relationships are strictly forbidden. Harshly punished. Metias had been the one to recommend Thomas for Commander Jameson’s patrol . . . He must have done it for Thomas’s sake, even though he knew that it meant any chance of a relationship would be impossible. All of this flashes through my thoughts in a matter of seconds. “Metias was in love with you,” I whisper. Thomas doesn’t reply. “Well? Is it true? You must have known.” Thomas still doesn’t answer. Instead, he keeps his head in his hands and repeats, “I took an oath.” “Wait a minute. I don’t understand.” I lean back against my chair and take a deep breath. My thoughts are now a whirling, jumbled mess. Thomas’s silence tells me far more than anything he’s said aloud. “Metias loved you,” I say slowly. My words are quivering. “And did so much for you. But you still turned him in?” I shake my head in disbelief. “How could you?” Thomas looks up at me from his hands, a flash of confusion lighting his face. “I never reported him.” We face each other for a long time. Finally, I say through clenched teeth, “Tell me what happened, then.” Thomas stares off into space. “Security admins found traces he left behind when he hacked through a loophole in the system,” he replies. “Into the deceased civilians’ database. The admins reported it to me first, with the understanding that I would pass the message to Commander Jameson. I’d always warned Metias about hacking. You cross the Republic too many times, and eventually you get burned. Stay loyal, stay faithful. But he never listened. Neither one of you do.” “So you kept his secret?” Thomas drops his head back into his hands. “I confronted Metias about it first. He admitted it to me. I promised him I wouldn’t tell anyone, but deep down, I wanted to. I have never kept anything from Commander Jameson.” He pauses here for a second. “Turns out that my silence wouldn’t have made a difference. The security admins decided to forward a message on to Commander Jameson anyway. That’s how she found out. Then she tasked me with taking care of Metias.” I listen in shocked silence. Thomas had never wanted to kill Metias. I try to imagine a scenario that I can bear. Maybe he even tried to persuade Commander Jameson to assign the mission to someone else. But she refused, and he chose to do it anyway. I wonder whether Metias ever acted on his attraction, and whether Thomas reciprocated. Knowing Thomas, I doubt it. Did he love Metias back? He had tried to kiss me that night after the celebration for Day’s capture. “The celebratory ball,” I muse, aloud this time. I don’t need to explain that evening for Thomas to know what I’m talking about. “When you tried to . . .” I trail off as Thomas continues to stare at the floor, his expression oscillating between blankness and pain. Finally, he runs a hand through his hair and mumbles, “I knelt over Metias and watched him die. My hand was on that knife. He . . .” I wait, light-headed from the words he’s saying. “He told me not to hurt you,” Thomas continues. “His last words were about you. And I don’t know. At Day’s execution, I tried to come up with a way to stop Commander Jameson from arresting you. But you make it so hard for people to protect you, June. You break so many rules. Just like Metias. That night at the ball—when I looked at your face—” His voice cracks. “I thought I could protect you, and that the best way might be to keep you close to me, to try to win you over. I don’t know,” he repeats bitterly. “Even Metias had trouble watching out for you. What chance did I have of keeping you safe?” The evening of Day’s execution. Had Thomas been trying to help me out when he escorted me down to see the electro-bomb storage basement? What if Commander Jameson was preparing to arrest me, and Thomas tried getting to me first? To what, help me escape? I don’t understand. “I did care for him, you know,” he says through my silence. He pretends bravado, some false professionalism. Still, I hear a tinge of sadness. “But I am also a soldier of the Republic. I did what I had to do.” I shove the table aside and lunge for him, even though I know I’m chained down to my chair. Thomas jumps back. I stumble against my restraints, fall to my knees, and then grab for his leg. For anything. You’re sick. You’re so twisted. I want to kill him. I’ve never wanted anything this much in my entire life. No, that’s not true. I want Metias to be alive again. The guards outside must’ve heard the commotion because they come pouring in, and before I know it I’m pinned down by several soldiers, cuffed with an extra set of shackles, and untied from my chair. They drag me to my feet. I kick out furiously, running through a list in my head of every attack I’ve ever learned in school, trying frantically to free myself. Thomas is so close. He’s only a few feet away. Thomas just looks at me. His hands dangle at his sides. “It was the most merciful way for him to go,” he calls out. It makes me nauseous I know he’s right, and that Metias would’ve almost certainly been tortured to death had Thomas not taken him down in that alley. But I don’t care. I’m blind, smothered by my anger and confusion. How could he do that to someone he loved? How could he possibly attempt to justify this? What is wrong with him? After Metias’s death, on nights when Thomas sat alone in his home, did he ever step out of his façade? Did he ever shed the soldier and let the civilian grieve? I’m dragged out of the room and back down the corridor. My hands tremble—I fight to steady my breathing, to calm my racing heart, to push Metias back into a safe corner of my mind. A small part of me had hoped that I was wrong about Thomas. That he hadn’t been the one to kill my brother. By the next morning, all traces of emotion have disappeared from Thomas’s face. He tells me the Denver court has gotten wind of my request for the Elector and has decided to transfer me to the Colorado State Penitentiary. I’m off to the capital. WE TOUCH DOWN IN LAMAR, COLORADO, ON A COLD, rainy morning, right on schedule. Razor leaves with his squadron. Kaede and I wait in the dark stairwell leading out from the back entrance of his office until the sounds outside have quieted and most of the ship’s crew have left. This time there are no guards performing fingerprint scans or ID checks, so we can follow the last of the soldiers straight off the exit ramp. We melt right in with the troops that are actually here to fight for the Republic. Sheets of icy rain pound the base as we step out of the pyramid dock and into the formidable grayness of this place. The sky’s completely covered with churning storm clouds. Landing docks line the side of the cracked cement street, an ominous row of enormous black pyramids stretching off in either direction, slick and shiny with rain. The air smells stale, wet. Jeeps packed with soldiers drive back and forth, splashing mud and gravel across the pavement. The soldiers here all have a wide stripe of black painted across their eyes from one ear to the other. Must be some sort of crazy warfront style. The rest of the city looms in front of us—gray skyscrapers that probably serve as barracks for the soldiers, some new with smooth sides and tinted glass windows, others pockmarked and crumbling as if they’ve been fed a steady diet of grenades. A few are ash and ruins, some with just one wall left, pointing upward like a broken monument. No terraced buildings here, no grassy levels dotted with herds of cattle. We hurry along the street with our stiff jacket collars turned up in a pitiful attempt to shield us from the rain. “This place has been bombed, yeah?” I mutter to Kaede. My teeth chatter with each word.","sourceLink":"https://allnovel.net/prodigy-legend-2/page-14.html","bookId":1695,"book":{"id":1695,"title":"Prodigy (Legend #2)","description":"Storyline: Prodigy (Legend #2) Injured and on the run, it has been seven days since June and Day barely escaped Los Angeles and the Republic with their lives. Day is believed dead having lost his own brother to an execution squad who thought they were assassinating him. June is now the Republic\u0027s most wanted traitor. Desperate for help, they turn to the Patriots - a vigilante rebel group sworn to bring down the Republic. But can they trust them or have they unwittingly become pawns in the most terrifying of political games?","cover":"https://allnovel.net/images/prodigy-legend-2.jpg","author":"Marie Lu","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/prodigy-legend-2.html","creation":"Oct 5, 2019 8:57:52 AM","modification":"Oct 5, 2019 9:55:01 AM"}}
