{"id":64755,"no":25,"title":"Page 25","content":"“Day!” Tess finally notices me. I give her a quick wave in return.\n She makes her way over to me, then pulls out two pills and a small roll of clean bandages from her pocket. She pushes them into my hands. “Stay safe tonight, okay?” she says breathlessly, fixing me with a firm stare. There’s no sign of the earlier tension between us. “I know how you get when your adrenaline’s pumping. Don’t do anything too crazy.” Tess nods at the blue pills in my hand. “They’ll warm you up if it’s too cold out there.”\n Acts old enough to be my caretaker, I swear. Tess’s concern leaves a warm feeling in my stomach. “Thanks, cousin,” I reply, tucking her gifts away in my own pockets. “Hey, I—”\n She stops my apology with a hand on my arm. Her eyes are as wide as ever, so comforting that I find myself wishing she could come with me. “Whatever. Just . . . promise me you’ll be careful.”\n So quick to forgive, in spite of everything. Had she said those things to me earlier in the heat of the moment? Is she still angry? I lean over and give her a brief hug. “I promise. And you be safe too.” She squeezes my waist in response, then heads off to rejoin the other young Medics before I can attempt my apology again.\n After she’s gone, I turn my attention back on Razor. He points to a grainy video that shows some street near the Lamar train tracks Kaede and I had passed earlier. A pair of soldiers hurry across the screen, their collars flipped up against the falling sleet, each of them munching on steaming empanadas. My mouth waters at the sight. The Patriots’ canned food is a luxury, but, man, what I wouldn’t give for a hot meat pastry. “First of all, I’d like to reassure everyone that our plans are on the right track,” he says. “Our Agent has successfully met with the Elector and told him about our decoy assassination plan.” He circles an area of the screen with his finger. “Originally the Elector had planned to visit San Angelo on his morale-boosting tour, then head here to Lamar. Now word is that he’ll be coming to Pierra instead. A few of our soldiers will be accompanying the Elector instead of his original troop.” Razor’s eyes sweep over me, then he gestures to the screen and falls silent.\n A video replaces the grainy Lamar train track scene; we’re seeing footage of a bedroom. The first thing I notice is a slender figure seated on the edge of a bed, her knees tucked up to her chin. June? But the room is a nice one—certainly doesn’t look like a prison cell to me—and the bed looks soft and thickly layered with blankets I would’ve killed to have back in Lake.\n Someone grabs my arm. “Hey. There you are, hotshot.” Pascao’s standing beside me, that permanently cheery grin plastered all over his face and those pale gray eyes pulsing with excitement.\n “Hey,” I reply, giving him a quick nod in greeting before turning my attention back to the screen. Razor has started giving the group a general overview of the next phase of the plans, but Pascao tugs on my sleeve again.\n “You, me, and a few other Runners are heading out in a couple of hours.” His eyes flicker to the video before settling back on me. “Listen up. Razor wanted me to give my crew a more specific rundown than the one he’s delivering to the group. I just briefed Baxter and Jordan.”\n I’m barely paying attention to Pascao anymore because now I can tell that the small figure on the bed is June. It must be her, what with the way she pushes her hair behind her shoulders and analyzes the room with a sweeping gaze. She’s dressed in pretty cozy-looking nightclothes, but she’s shivering as if the room’s cold. Is this elegant bedchamber really her prison cell? Tess’s words come back to me.\n Day, have you forgotten? June killed your mother.\n Pascao tugs on my arm again and forces me to face him, then leads me to the back of the group. “Listen up, Day,” he whispers again. “There’s a shipment coming into Lamar tonight, by train. It’ll have cartloads of guns, gear, food, and whatever else for the warfront soldiers, along with a whole ensemble of lab equipment. We’re going to steal some supplies and destroy a railcar’s worth of grenades on it. That’s our mission tonight.”\n Now June’s talking to the guard standing near the door, but I can barely hear her. Razor’s done addressing the room and has fallen deep into conversation with two other Patriots, both of them occasionally gesturing up at the screen, then drawing out something on their palms. “What’s the point of blowing up a cartload of grenades?” I ask.\n “This mission is the decoy assassination. The Elector was originally scheduled to come here to Lamar, at least before June had a talk with him. Our mission tonight should convince the Elector, if he isn’t convinced already, that June was telling him the truth. Plus, it’ll be a nice chance to steal a few grenades.” Pascao rubs his hands together with almost maniacal glee. “Mmmm. Nitroglycerin.” I raise an eyebrow. “Me and three other Runners are gonna do the train job, but we’ll need a special Runner to distract the soldiers and guards.”\n “What do you mean, special?”\n “What I mean,” Pascao says pointedly, “is that this is why Razor decided to recruit you, Day. This is our first chance to show the Republic that you’re alive. It’s why Kaede had you strip the dye from your hair. When word gets out that you were seen in Lamar, taking down a Republic train, people are gonna go nuts. The Republic’s notorious little criminal, still up and about even after the government’s attempt to execute him? If that doesn’t stir up people’s sense of rebellion, nothing will. That’s what we’re aiming for—chaos. By the time we’re done, the public will be so pumped about you that they’ll be salivating for revolution. It’s the perfect atmosphere for the Elector’s assassination.”\n Pascao’s excitement makes me smile a little. Messing with the Republic? This is what I was born to do. “Give me more details,” I say, moving my hand in a come-hither gesture.\n Pascao checks to make sure Razor’s still going through the plans with the others, then winks at me. “Our team is gonna unhook the grenade railcar a couple of miles from the station—by the time we get there, I don’t want there to be more than a handful of soldiers guarding the train. Be careful, now. There usually aren’t many troops near those train tracks, but tonight’s different. The Republic will be on the hunt for us after hearing June’s warning about the decoy assassination. Watch for extra soldiers. Buy us the time we need, and make sure they spot you.”\n “Fine. I’ll get you your time.” I cross my arms and point at him. “You just tell me where I need to go.”\n Pascao grins and slaps me hard on the back. “Great. You’re the best Runner out of us by far—you’ll throw those soldiers off without a hitch. Join up with me in two hours near the entrance where you came in. We’re gonna have a ball.” He snaps his fingers. “Oh, and don’t mind Baxter. He’s just sore that you get special treatment from both me and Tess.”\n As soon as he walks away, my eyes go back to the video screen and stay frozen on June’s figure. As it continues playing, pieces of Razor’s conversation with the other Patriots reach me. “—enough to hear what’s going on,” he’s saying. “She has him in position.”\n On the video, June seems to be dozing, with her knees tucked up to her chin. There’s no sound at all this time, but I don’t think much of it. Then I see someone step inside her cell, a young man with dark hair and an elegant black cloak. It’s the Elector. He bends down and starts talking to her, but I can’t make out what he’s saying. When he gets close to her, June tenses up. I can feel the blood draining from my face. All the chatter and bustle around me fades into the distance. The Elector puts a hand under June’s chin and brings her face toward his own. He is taking something that I thought was just for me, and I feel a sudden, shattering sense of loss. I want to rip my eyes away, but even from the corner of my vision, I can still see him kissing her. It seems to last forever.\n I watch numbly as they finally pull away from each other and the Elector steps out of the room, leaving June alone, curled up on the bed. What’s going through her mind right now? I can’t watch any longer. I’m about to turn my back, ready to follow Pascao out of the crowd and away from this scene.\n But then something catches my eye. I look up at the monitor. And just in time, I see June hold up two fingers to her brow in our signal.\n It’s past midnight when Pascao, me, and three other Runners paint wide black stripes across our eyes and suit ourselves up in dark warfront uniforms and military caps. Then we head out of the Patriots’ underground hideout for the first time since I arrived. A couple of soldiers wander by now and then, but we see more clusters of troops as we head farther out of our neighborhood and cross the train tracks. The sky’s still completely covered with clouds, and under the dim streetlights, I can see thin sheets of sleet falling. The pavement’s slick with drizzle and icy slush, and the air smells stale, like a mix of smoke and mold. I pull my stiff collar higher, swallow one of Tess’s blue pills, and actually wish I was back with her in Los Angeles’s humid slums. I tap the dust bomb hidden inside my jacket, double-checking that it’s dry. In the back of my mind, the scene between June and the Elector plays on repeat.\n June’s signal was for me. Which part of the plan does she want me to stop? Does she want me to forfeit the Patriots’ mission and escape? If I defect now, what will happen to her? The signal could’ve meant a million things. It could even mean she’s decided to stay with the Republic. I shake the thought furiously from my mind. No, she wouldn’t do that. Not even if the Elector himself wanted her? Would that make her stay?\n I also remember that the video footage of them didn’t have sound on it. Every other video we’ve seen has had crisp sound—Razor even insisted on making sure the volume was turned up. Had the Patriots stripped it from this one? Are they hiding something?\n Pascao stops us in the shadows of an alley not far from the train station. “Train arrives in fifteen minutes,” he says, his breath rising in clouds. “Baxter, Iris, you two come with me.” The girl named Iris—long and lean, with deep-set eyes that constantly dart around—smiles, but Baxter glowers and tightens his jaw. I ignore him and try not to think about whatever he’s trying to put in Tess’s mind about me. Pascao points to the third Runner, a petite girl with copper-colored braids who keeps sneaking glances at me. “Jordan, you’re going to pinpoint the right railcar for us.” She gives Pascao a thumbs-up.\n Pascao’s eyes shift to me. “Day,” he whispers. “You know your drill.”\n I tug the edge of my cap. “Got it, cousin.” Whatever June means, this is no time for me to leave the Patriots behind. Tess is still back there in the bunker, and I have no idea where Eden is. No way I’m going to put both of them in jeopardy. \n","sourceLink":"https://allnovel.net/prodigy-legend-2/page-25.html","bookId":1695,"book":{"id":1695,"title":"Prodigy (Legend #2)","description":"Storyline: \n Prodigy (Legend #2) \n Injured and on the run, it has been seven days since June and Day barely escaped Los Angeles and the Republic with their lives. Day is believed dead having lost his own brother to an execution squad who thought they were assassinating him. June is now the Republic\u0027s most wanted traitor. Desperate for help, they turn to the Patriots - a vigilante rebel group sworn to bring down the Republic. But can they trust them or have they unwittingly become pawns in the most terrifying of political games?\n \n","cover":"https://allnovel.net/images/prodigy-legend-2.jpg","author":"Marie Lu","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/prodigy-legend-2.html","creation":"Oct 5, 2019 8:57:52 AM","modification":"Oct 5, 2019 9:55:01 AM"}}
