{"id":24955,"no":18,"title":"CHAPTER XIV","content":"FIRST RECOGNITION OF RIGHTS OF CHILDREN—LAWS OF ROMULUS AND OF NUMA POMPILIUS—THE TWELVE TABLES—ATTITUDE OF PARENTS SHOWN IN TERENCE—PATRIA POTESTAS SPARINGLY USED. IT is interesting to think that what might be called the legal movement which fructified in the United States, in the latter half of the nineteenth century, had its beginning in the eighth century b. c. in Rome; it is doubly interesting that legend ascribes to Romulus the first interest in what can conservatively be called the child protection movement. Like all other lawmakers—even legendary ones—especially those who sought to prepare and safeguard their states for and against hostile neighbours, the first concern of the founder of Rome was a strong nation; and a strong nation meant necessarily as many adult males in good health and physical condition as possible. Soldiers were more important than other human beings; in this the supposed founder followed the spirit of his time and the standard of his age of development. According to the legend, Romulus, having made210 peace with the Sabines and become the king of both people on the death of Tatius, was bent on making the new city impregnable, working out a system of government that, in the mind of the historian, was worthy of “a man of great military accomplishments, personal courage and extremely capable of instituting the most perfect sort of government.”319 To the end that there might be as perfect a fighting machine as possible, Romulus pledged his people to bring up all males except those who were lame or monstrous from birth. To the same end, and according to the same authority, he pledged them to bring up the first-born of the females—and in this he acted purely in the spirit of the time and as the founder of a warlike race. Personal interest may be conceded, inasmuch as he would have been the victim of the practice of exposing children had his uncle Amulius had his way.320 In his introduction to the Institutes of Justinian,321 Sandars declares that Roman law will be better understood if those interested will apprehend the distinction between the contribution of Romulus and the tribe of Ramnes, who dwelt on the Palatine Hill, and the contribution of Numa and the Titienses who dwelt on the Capitoline and the Quirinal. The two races combined to make a united society, the Ramnes bringing distinct ideas of public law and, in the dimmest days of history,211 presenting the features of a carefully organized polity. “When the tribe went out to war it did not conquer lands for the benefit of individuals, but for the whole people.”322 The Titienses, or Quirites, on the other hand, were of Sabine extraction. To them are traceable the private law, and, what is of interest to us, the peculiar notions of the family and of property. The great peculiarity of the Sabine law, or as it was called by the Latin writers, the jus Quirium, was the form of the manus—the hand. The manus was the conqueror’s sign of conquest, or rather the insignia of the freebooter; all he laid hand upon became absolutely his; he could deal with it as he pleased. All that his wife and children had, also belonged to him, to be done with as he willed—even their lives. This was the Sabine contribution to what afterward became “Roman Law,” when the Sabine tribes of the Capitoline Hill and the Ramnes tribe of the Palatine united to form the city of Rome. Nowhere in law or history is there so interesting a duality as this origin of Rome and the Roman law, and no single custom arising as it did, has affected civilization as strangely and so widely. To think of a tribe living at Fleet Street super-imposing a law on a tribe living at Westminster, or a clan having its habitat in Wall Street grafting a law upon a people fortressed and buttressed in Madison Square Garden—taking either section of212 London or New York as an example of the extent of the Rome of that day—it seems impossible that such a law, thus accepted, should become the law of the world, and remain so for centuries. This power of the Roman father over the very lives of his children was called the patria potestas and nowhere else in a civilized community was there anything like it.323 He had the power to sell his children, he had the power to mutilate them, he had the power to kill them; and it is because there is evident first, in the laws ascribed to Romulus, an intention to abate that power, not only for military purposes but for what we would now call humane reasons, that I have referred to the first Roman lawmaker as an innovator along lines which have been historically neglected. It matters little whether or not the Romulus of Plutarch and Dionysius existed; it does matter that the human note was in the laws of his time, and that citizens of the new city were enjoined not only to bring up all healthy male children—and at least one female child—but that all children must be allowed to live until they were three years old, unless they were lame or monstrous. Surely here was the beginning of some recognition of the rights of children. Even the lame and213 the monstrous in the eyes of this early lawgiver had some rights, for it was further decreed that parents in doing away with them must act not entirely on their own judgment. “These (the lame and monstrous infants) he allowed their parents to expose, provided they first showed them to five of their neighbours and these also approved of it, and besides other penalties he punished those who disobeyed this law with the confiscation of half their fortunes.”324 It may be contended perhaps that we are giving high attributes to one who is not much more than a mythical person, but no other explanation of the law of Romulus is offered than that already referred to in Dionysius. Despite the credit given to Numa Pompilius, by both Plutarch and Gibbon, Romulus gains by the comparison, although Numa amended one of the laws of Romulus in the matter of the right of a father to control a son up to the point of being able to sell him as a slave.325 “If a father gives his son leave to marry a woman who, by law, is to partake of his sacrifices and fortunes, he shall no longer have power of selling214 his son”—such was the amendment of Numa for which Plutarch commends the Sabine lawmaker; but in amending the law of Romulus permitting a father to sell his children, the second king of Rome was actuated by the idea of making it attractive for the young women to marry; doubtless he was having no easy time in eradicating the differences between the two warlike tribes first brought together under his predecessor. Lessening the power of the parents, as he did in the most material degree,326 it was for the purpose of general polity and the accomplishment of his own harmonious designs, rather than for what I like to call, even in that early day, humanitarian reasons. There was no consideration of the child, or the female as such in Numa’s amendment. His object was to make marriages more desirable that there might be more male Romans.327 As a matter of fact, declaration of the power of the father over the women and children of his family was nothing more on the part of Romulus than the codification of the laws of the past, with the softening provisos to which I have already215 referred. The power of the father to imprison, scourge, or sell his son for a slave, or put him to death, was not lessened even when that son had risen to the highest honours of the State, as we shall see later. Expulsion of the kings and the establishment of the Republic is dated b. c. 509, some two hundred and fifty years after the reputed founding of the city. With this stern period begins a series of thrilling examples of the use made of the patria potestas—stories that in themselves show how the power of the father extended over the life of the child, even when the child had become a man, and that man had been honoured by the State as was Cassius Viscellinus. The latter, although a tribune of the people and the author of the first Agrarian Law, was tried in the house of his own father, who, after having him whipped, “commanded him to be put to death and his estate consecrated to Ceres.”328 That there was little progress made in the next great step in the history of Roman law, by which of course one refers to the adoption of the laws of the Twelve Tables, was because those laws were practically the codification of the ancient customary law of the people, despite the story that the patricians dispatched three commissioners to216 Athens to bring home a copy of the laws of Solon. Acrid political fights, uncertain and sometimes corrupt administration of the law, led to the commission empowered to draw up what afterward became the Twelve Tables and the foundation of the whole fabric of the Roman law. As the laws of the Twelve Tables represented the earliest fight against privilege, it would be too much to expect that they should contain any amelioration of the statute which gave the father the right to sell or kill his children. Even the language of the laws, in the fragments which have come down to us, shows in rugged, concise, and sternly imperative style that the law gained the respect in which it eventually came to be held, by no soft or easy methods.329 “If the complainant summon the defendant before the magistrate, he shall go; if he do not go, the plaintiff may call a bystander to witness, and take him by force;” this is the first section of the first paragraph of the laws of the Twelve Tables. Where there was so much sternness, and where every family was presided over by a parent who had the right to inflict death as a punishment for disobedience, the disciplinary attitude of the Roman mind naturally became such, no matter what it had been in the beginning, that tender or human emotions had but little place. It is not surprising therefore that the one extract of the laws of the Twelve Tables, relating to our subject,217 should deal curiously, abruptly, and sharply with the power of the father to sell his son, a power that was diminished only after the son’s spirit must have been entirely extinguished. Si pater filium ter venum duit, filius a patre liber esto—if a father sells his son three times, let the son then go free of the father. In other words, three times did the father have the right to dispose of his son as a slave; and, while a slave might purchase his freedom, by paying his master, the son of a Roman citizen did not become free until the father had abused his right and misused the potestas three times.330 One sees the Rome of the Republic in the plays of Terence and Plautus, and the attitude of the parents toward exposure is vividly shown in the Heautontimorumenos of the former. Nearly always the exposed child died. Occasionally some escaped through the tenderness or cupidity of some passer-by who would pick up an exposed child either out of pity or for the material profit that came with the possession. Sometimes mothers who were obliged to obey the orders of their husbands, arranged to have their children rescued. The comedy of Terence goes to show what the attitude of the father was under such circumstances. It is indeed, as De Gour says, “a chapter of the morals of the Greeks and Romans seen in action.” Chremes, departing on a long voyage, orders218 his wife, Sostrata, who is about to have a child, to expose the child if it should turn out to be a girl. In obeying this order, she hopefully places a ring with the child. Years later she meets the child at a bath and is given (by her own daughter) a ring to guard. Sostrata recognizes the ring and when she sees her husband the following dialogue ensues: Sos. (turning ’round). Ha! my husband! Chrem. Ha! my wife! Sos. I was looking for you. Chrem. Tell me what you want. Sos. In the first place, this I beg of you, not to believe that I have ventured to do anything contrary to your commands. Chrem. Would you have me believe you in this, although so incredible? Well, I will believe you. Sos. Do you remember my being pregnant, and yourself declaring to me, most peremptorily, that if I should bring forth a girl, you would not have it brought up? Chrem. I know what you have done, you have brought it up. Sos. Not at all; but there was here an elderly woman of Corinth, of no indifferent character; to her I gave it to be exposed. Chrem. O Jupiter! that there should be such extreme folly in a person’s mind. Sos. Alas! what have I done? Chrem. And do you ask the question? 219 Sos. If I have acted wrong, my dear Chremes, I have done so in ignorance. Chrem. This, indeed, I know for certain, even if you were to deny it, that in everything you both speak and act ignorantly and foolishly: how many blunders you disclose in this single affair! For, in the first place, then, if you had been disposed to obey my orders, the child ought to have been dispatched; you ought not in words to have feigned her death, and in reality to have left hopes of her surviving. But that I pass over; compassion, maternal affection, I allow it. But how finely you did provide for the future! What was your meaning? Do reflect. It’s clear, beyond a doubt, that your daughter was betrayed by you to this old woman, either that through you she might make a living by her, or that she might be sold in open market as a slave. I suppose you reasoned thus: “Anything is enough, if only her life is saved.” What are you to do with those who understand neither law, nor right and justice? Be it for better or for worse, be it for them or against them, they see nothing except just what they please. Sos. My dear Chremes, I have done wrong, I own; I am convinced. Now this I beg of you; inasmuch as you are more advanced in years than I, be so much the more ready to forgive; so that your justice may be some protection for my weakness. Chrem. I’ll readily forgive you doing this, of course; but Sostrata, my easy temper prompts you220 to do amiss. But, whatever this circumstance is, by reason of which this was begun upon, proceed to tell it. Sos. As we women are all foolishly and wretchedly superstitious, when I delivered the child to her to be exposed, I drew a ring from off my finger and ordered her to expose it, together with the child; that if she should die, she might not be without some portion of our possessions.331 Chrem. That was right; thereby you proved the saving of yourself and her.332 Sos. (holding out the ring). This is the ring. Chrem. Whence did you get it? Sos. From the young woman whom Bacchis brought with her. Chrem. What does she say? Sos. She gave it to me to keep for her, whilst she went to bathe. At first I paid no attention to221 it; but after I looked at it, I at once recognized it, and came running to you. Chrem. What do you suspect now, or have you discovered, relative to her? Sos. I don’t know; unless you enquire of herself whence she got it, if that can possibly be discovered. Chrem. Is this woman living to whom you delivered the child? Sos. I don’t know. Chrem. What account did she bring you at the time? Sos. That she had done as I had ordered her. Chrem. Tell me what is the woman’s name, that she may be inquired after. Sos. Philtere. Chrem. Sostrata follow me this way indoors. Sos. How much beyond my hopes has this matter turned out! How dreadfully afraid I was, Chremes, that you would now be of feelings as unrelenting as formerly you were on exposing the child. Chrem. Many a time a man cannot be such as he would be333 if circumstances do not admit of it. Time has now so brought it about, that I should be glad of a daughter; formerly I wished for nothing less. There is no evidence that the Romans as a people at any time approved of the sale of children,222 and while the suggestion is made by Gibbon that early in the days of the kings impoverishing conditions occasionally made it necessary to dispose of members of the family, from the time of the adoption of the Twelve Tables as the codified law of Rome there is not a single indication that the power of the father over grown-up children was used otherwise than sparingly, and with a view to strengthening the stern and military character of the Roman idea of family. The main use of the provision for the sale of children, in time of prosperity at least, was to put the boy out to business, this being in general more a form that took the place of what was later apprenticeship and, still later, the labour contract. As late as Constantine this was permitted, even of new-born children, but only in cases of extreme need (propter nimiam paupertatem),334 and then when it seemed the only way to prevent their parents from murdering them. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2792/77281.html","bookId":1291,"book":{"id":1291,"title":"The Child in Human Progress","description":"简介： THIS is a new sort of book, and unique. That is why I look upon the permission to write a brief preface for it as a rare privilege. Writings on children are frequent. When, in 1875, I contributed, for Karl Gerhardts immense Handbuch, my Hygiene of th...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2792","creation":"Aug 1, 2019 12:24:48 AM","modification":"Aug 1, 2019 12:24:48 AM"}}
