{"id":64874,"no":44,"title":"Page 44","content":"She’d come to the door. Late at night she might be on her guard, but in the middle of the afternoon, why, she’d open the door to see who it might be.\\n\\n And if she recognizes him?\\n\\n Kristin, he’ll say, it’s so good to see you! And by the time she reacts, by the time that it strikes her that she has no reason to be glad to see him, why, he’ll be inside, won’t he? And it will no longer matter what she thinks or feels or tries to do.\\n\\n When he’s through with her, the house will be his for as long as he wants it. The hermit crab will have a spendid new shell.\\n\\n The very moment he turns the corner onto her block, he senses an alien presence. His first impulse is to turn again and slip away, but the feeling that grips him is a little different this time, and he decides on a closer look. He’ll be careful, he’ll take pains to see without being seen, but he won’t turn tail and withdraw, not quite yet.\\n\\n At a Korean market around the corner on Columbus Avenue, he buys three loaves of white bread and two rolls of paper towels. The shopping bag they give him is full to overflowing, but weighs next to nothing. He’s out the door when it occurs to him to add a bouquet of flowers, all wrapped up in green paper. With one arm clutching the bag of groceries to his chest and his free hand brandishing the bouquet, he manages to look ordinary and harmless while screening his features from any eyes turned in his direction.\\n\\n He walks down her street, moving at the deliberate pace his burdens would seem to dictate. He’s able to glance into each parked vehicle, to check out stoops and doorways. And he sees no one the least bit suspicious, no one who might possibly be a watchful cop.\\n\\n Why the warning from his guardian angel?\\n\\n It was, he decided, an echo of the earlier warning. The mind would do that, summoning up the memory of a feeling when presented with a similar situation. And, while the alarm has turned out to be a false one, hasn’t it been useful all the same? Because now he can ring her bell with a bag and a bouquet to block any view of him she might gain through a peephole. That had been a flaw in his original plan, the possibility that there might be a peephole in her front door that would allow her to recognize him before she had the door open. But now she’ll have to open it to know who her visitor is, and what woman could leave the door closed on a man holding a bouquet of flowers?\\n\\n Perfect.\\n\\n He has passed her house and walked to the other end of the block, and now he turns to approach it again. He’s two doors away, just steps from the walkway leading to her front door, when something makes him stop right where he is. He takes a moment to visualize it all in his mind, ringing the bell, positioning the groceries and the flowers just so, waiting until the door opens, then pushing hard against the door, forcing his way in, dropping everything, and hitting her once, as hard as he can, in the chest or stomach, to keep her from reacting or crying out until he’s had a chance to draw the door shut behind him.\\n\\n And he stands there, seeing all of this as clearly as if it is actually happening, when a car drives up and pulls smoothly into a parking space at a fire hydrant directly across the street from her house.\\n\\n Two men, and he knows at once that they’re cops.\\n\\n The driver cuts the engine. His passenger gets out of the car, walks into the middle of the street, and raises a hand to shield his eyes for a look at the house number. Satisfied, he turns and gets back in the car, rolling down the window to give him a better view of Kristin Hollander’s house.\\n\\n And to think he’d been ready to write off a clear warning as vestigial, a mere echo! Whatever its source, he’d been alerted not to the physical presence of police (who hadn’t been there yet at the time) but to the reality of danger.\\n\\n He walks at his deliberate pace, his face shielded by the bouquet, his innocence guaranteed by the bulk of his burden, until he reaches the corner and disappears from their view. He walks another block, drops both his bundles in a trash can, and picks up his pace.\\n\\n If they are watching the Hollander house, they know who he is.\\n\\n Or suspect it, at the very least. That he did not die in the fire in Brooklyn, that the body in the basement was somebody else’s, that he who killed and ran away has lived to kill another day.\\n\\n The thought excites him. It is, he knows, a paradox that he who so relishes his anonymity at the same time hungers for recognition. It seems clear that he is a genius, although not in an area much esteemed by the Nobel committee. Still, he has a human desire to be acknowledged for what he is—and a core of good sense that keeps him well aware of the danger of such acknowledgment.\\n\\n He asks himself once again if it is not perhaps time to disappear. He has the clothes he is wearing, the money in his wallet, along with an ATM card that will give him access to a few thousand dollars in a bank account on the other side of the country. He no longer recalls the name he used to open the account, or the name and location of the bank, but what does it matter? He has the card and knows the PIN, and that’s all he needs to know.\\n\\n And what else does he have? The keenness of his mind, the strength of his will, and the promptings of his intuition.\\n\\n And, of course, the knife in his pocket.\\n\\n Enough to take him wherever he wants to go. Shall he leave, then?\\n\\n 34\\n\\n The phone call came a few minutes after five. I let the machine pick up, and after we’d listened to my own recorded message, there was a long enough silence for me to think the caller might have hung up.\\n\\n Then he said, “Well, hello, Matt S. This is Abie.”\\n\\n Elaine was in the room with me, and the color left her face as she recognized the voice. She would, of course; she’d heard it when he’d come to her shop to buy the bronze paper knife.\\n\\n I picked up the phone. I said, “Hello,” and wondered why I was saying anything.\\n\\n “I’ve been trying to reach my sponsor,” he said. “I was hoping for the benefit of his strength, hope, and experience. But he’s not answering his phone, so I thought I’d call you instead.”\\n\\n “Really.”\\n\\n “Maybe you could tell me not to drink, and to go to a meeting. That might be helpful in keeping me on the straight and narrow.”\\n\\n “What do you want?”\\n\\n “Why, I just wanted to talk. And you’ll probably want to keep me on the line so you can trace the call.”\\n\\n We hadn’t set up for that. It’s not that hard to do nowadays, but in this case there hadn’t seemed to be much point to it. We knew he’d called Bill several times, and a check of the LUDS on Bill’s phone had established that all the calls from Abie had been made on an untraceable cell phone. If he called me he’d use the same phone, so why bother setting up a trace?\\n\\n “I’ll save you the trouble,” he said. “I’m on a pay phone at Penn Station, and in approximately seven minutes I’ll be on a train. I’ve decided it’s time to disappear.”\\n\\n “I wish you’d stick around.”\\n\\n “Oh? Be careful what you pray for, my friend.”\\n\\n “Because I might get it?”\\n\\n “So they say. Or did you want to tell me that I can be helped, and that you’ll see to it that they help me if only I turn myself in?”\\n\\n “No,” I said, “I don’t want to tell you that.”\\n\\n “Oh?”\\n\\n “I don’t want you to be helped. I want you to be killed.”\\n\\n “Now that’s refreshing,” he said. “All the more reason for me to leave the stage, wouldn’t you say? I’m enjoying this conversation, but it’s time to catch my train. One thing, though. Will you give my sponsor a call? It’s Bill, the older fellow they call William the Silent. He’s even more silent than usual lately, and I’d feel better if you’d check on him.”\\n\\n He broke the connection. I put the phone down and looked at Elaine.\\n\\n She said, “I feel like throwing out the answering machine and getting a new one. Or at least spraying this one with Lysol.”\\n\\n “I know what you mean.”\\n\\n “Maybe I should spray the whole apartment. It needs disinfecting, after that voice has had a chance to bounce off the walls.”\\n\\n “The whole city needs disinfecting.”\\n\\n “The whole planet. Who are you calling?”\\n\\n “Bill,” I said. The phone rang and rang. I broke the connection and redialed and the same thing happened.\\n\\n “Oh, Jesus,” I said.\\n\\n They found Bill in his apartment, dead of multiple stab wounds to the chest. There were defensive wounds on his hands and forearms, suggesting he’d tried to fight off his killer.\\n\\n Sussman checked the phone records, and it turned out the call we’d received had in fact come from a pay phone in Penn Station. I didn’t know what to make of that.\\n\\n “One of the things we found on Fifty-third Street,” he said, “was a cell phone charger. I had to guess, I’d say his battery ran down. If he wanted to give you a call, he had to spend a quarter.”\\n\\n “He called from Penn Station,” I said, “and he said he was calling from Penn Station.”\\n\\n “So?”\\n\\n “So he wanted to make sure I knew it. Not only does he tell me, but he knows the LUDS will back him up.”\\n\\n “He wants us to think he’s leaving town.”\\n\\n “Maybe. Or he really is leaving town, and he wants us to think he’s not.”\\n\\n “By telling us he is.”\\n\\n “Right.”\\n\\n Elaine said, “ ‘How Could You Believe Me When I Said I Loved You When You Know I’ve Been A Liar All My Life?’ ”\\n\\n “They don’t write songs like that anymore,” Sussman said. “So let’s sum this up, okay? What we now know for sure is that either he’s leaving town or he’s not. Is that about it?”\\n\\n I wound up going to the meeting at St. Paul’s. I didn’t want to go anywhere, but someone had to tell them about Bill, and I decided it really ought to be me. I got there a little late, after the qualification but in time for the general discussion, and I got to be the bearer of bad tidings.\\n\\n Beyond the fact that we’d lost a long-time member, I had to let everybody know that they might be in danger, and that it was impossible to guess with any degree of certainty just how real that danger might be. Abie—I called him that in the meeting, because that’s how they knew him—was at once a coldly logical being and a homicidal maniac. Just as I couldn’t say if he’d left town or pretended to leave town, neither could I tell if he’d killed his sponsor as an opening skirmish in a one-man war on New York AA or simply to send me a personal message. I felt like the goddam government, raising the Alert level from Yellow to Orange. Stop being Careful, I was saying, and start being More Careful. And rest assured that we’ll let you know when it’s time to be Extra Careful.\\n\\n I didn’t stop in at the Flame afterward. I hadn’t left Elaine alone, TJ was with her, but all the same I was anxious to get home.\\n\\n Walking the couple of blocks, I kept having the feeling someone was watching me. I looked around, but nothing caught my eye.\\n\\n 35\\n\\n The bastard’s wary.\\n\\n You can see it in his walk, see it in the way he keeps looking this way and that way. Maybe he can sense that he’s being watched, followed. Maybe it’s just an indication of the level of his anxiety. \\n\\n","sourceLink":"https://allnovel.net/all-the-flowers-are-dying-matthew-scudder-16/page-44.html","bookId":2334,"book":{"id":2334,"title":"All the Flowers Are Dying (Matthew Scudder #16)","description":"Storyline: All the Flowers Are Dying (Matthew Scudder #16) \\n \"A man in a Virginia prison awaits execution for three hideous murders he swears, in the face of irrefutable evidence, he did not commit. A psychologist who claims to believe the convict spends hours with the man in his death row cell, and ultimately watches in the gallery as the lethal injection is administered. His work completed, the psychologist heads back to New York City to attend to unfinished business.\" \\n Meanwhile, Matthew Scudder has just agreed to investigate the ostensibly suspicious online lover of an acquaintance. It seems simple enough. At first. But when people start dying and the victims are increasingly closer to home, it becomes clear that a vicious killer is at work. And the final targets may be Matt and Elaine Scudder.\\n","cover":"https://allnovel.net/images/all-the-flowers-are-dying-matthew-scudder-16.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/all-the-flowers-are-dying-matthew-scudder-16.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:55:14 AM"}}
