{"id":64837,"no":7,"title":"Page 7","content":"She didn’t wait for an answer, which was just as well, as I didn’t have one handy. “I should get to the point, Matt. I met this guy on the Internet, and we had a lot of exchanges, first by e-mail and then with Instant Messaging. You know what that is, right? Sort of an online conversation?”\\n\\n I nodded. TJ and Elaine IM back and forth regularly, like a couple of kids with two cans and a wire. He lives right across the street from us, in the hotel room I occupied for years, and he comes over a couple of nights a week for dinner, and he and Elaine are both easy enough to reach by phone, but evidently there’s something irresistible about Instant Messaging. One of them will notice that the other’s online, and the next thing you know they’re chatting like magpies.\\n\\n “It can get very intimate, or at least it seems that way. People let their guard down in e-mails, or forget to put it up in the first place. I mean, it’s so easy. You type something out like you’re writing in a diary, and before you have time to think about it you hit the Send button, and it’s gone. You can’t even check the spelling, let alone give some thought to whether you really wanted to tell him you had an abortion your senior year in high school. So it seems intimate, because you’re finding out a lot about the person, but it’s only what he chooses to tell you, and you’re just reading it on the screen. It’s just words, there’s no tone of voice to go with it, no facial expressions, no body language. You fill in the rest in your mind, and you make it what you want it to be. But it may not be an accurate reflection of the real person. Sooner or later you trade jpegs, that’s online photographs—”\\n\\n “I know.”\\n\\n “—so you know what he looks like, but that’s just the visual equivalent of words on the screen. You still don’t know him.”\\n\\n “But you’ve met this man.”\\n\\n “Oh, of course. I wouldn’t be wasting your time if this was still just an online flirtation. I met him about a month ago and I’ve seen him seven or eight times since then. I didn’t see him this weekend because he was out of town.”\\n\\n “I gather the two of you hit it off.”\\n\\n “We liked each other. The attraction was there. He’s nice-looking but not handsome. Handsome puts me off. A therapist once told me it’s a self-esteem issue, that I don’t think I deserve a handsome boyfriend, but I don’t think that’s it. I just don’t trust men who are too good-looking. They always turn out to be narcissists.”\\n\\n “Been a real problem for me,” TJ said.\\n\\n She grinned. “But you’re dealing with it.”\\n\\n “Best I can.”\\n\\n “I like the guy,” she said. “He didn’t rush me into bed, but we both knew that’s where we were going, and it didn’t take us that long to get there. And it was nice. And he likes me, and I’d love to jump up and down and tell the world I’m in love, but something holds me back.”\\n\\n “What don’t you know about him?”\\n\\n “I don’t know where to start. Well, what do I know about him? He’s forty-one, he’s divorced, he lives alone in a fifth-floor walk-up in Kips Bay. He’s self-employed, he creates direct-mail advertising packages for corporate clients. Sometimes he has to work long hours and sometimes he has dry spells with no work at all. Feast or famine, he says.”\\n\\n “Does he have an office?”\\n\\n “A home office. That’s one reason we always go to my place. His is a mess, he says, with a sofa that he sleeps on. It’s not even a convertible because there’s no room to open it up, with his desk and filing cabinets taking up so much floor space. There’s a fax, there’s a copying machine, there’s his computer and printer and I don’t know what else.”\\n\\n “So you’ve never been there.”\\n\\n “No. I said I’d like to see it and he just said it was a mess, and a mess you have to climb four flights of stairs to get to. And it’s plausible enough, it could certainly be true.”\\n\\n “Or he could be married.”\\n\\n “Or he could be married and live anywhere at all. I thought I could go to his building and at least see if his name’s on the mailbox, but I don’t even know the address. I have a phone number for him, but it’s his cell. He could be married, he could be an ex-con, he could be a fucking axe murderer for all I know. I don’t honestly think he’s any of those things, but the problem is I don’t know for sure, and I can’t let go emotionally if I’ve got these worries in the back of my mind.”\\n\\n “And not that far back, from the sound of it.”\\n\\n “No, you’re right. It’s always there, and it gets in the way.” She frowned. “I get this spam, everybody does, links to these websites where they claim you can find out the truth about anybody, I’ve gone to the sites, and I’ve been tempted, but that’s as far as I’ve gone. I don’t know how reliable those things are, anyway.”\\n\\n “They probably vary,” I said. “What they do is access various publicly available data bases.”\\n\\n “You can find out anything on the Internet,” TJ put in, “but only part of it is true.”\\n\\n “His name’s David Thompson,” she said. “Or at least I think his name’s David Thompson. I did a Yahoo People search, and it’d be a lot easier if his name was Hiram Weatherwax. You wouldn’t believe how many David Thompsons there are.”\\n\\n “Common names make it tough. You must know his e-mail address.”\\n\\n “DThomps5465 at hotmail.com. Anybody can set up a free account at Hotmail, all you have to do is go to their site and register. I have a Yahoo account, FareLady315. That’s F-A-R-E, as in subway fare, because I ride it to and from work every day.” She glanced at her watch. “I’m all right. I live on Eighty-seventh Street, I rode down to Columbus Circle. Then I had a bagel and coffee, and then I came here, and my office is a five-minute walk from here. I’ll smoke a cigarette on the way over there, because it goes without saying we’re not allowed to smoke in the fucking office. I could keep a bottle in my desk and drink, that’d be fine, but God forbid I should smoke a cigarette. Did I mention that he smokes? David?”\\n\\n “No.”\\n\\n “I specified that in my ad. Not just that I smoked, but that I was looking to meet a smoker. People say they’re tolerant, but then they wind up waving their hand in the air, or run around opening windows. I don’t need that. I don’t drink a day at a time, and I don’t take drugs, I won’t even take fucking Midol for cramps, so I figure I can smoke all I want, and the hell with the mayor.” She let out a sudden yelp of laughter. “Jesus, listen to me, will you? ‘Hey, Louise, why don’t you tell us how you really feel?’ The thing is, I know one of these days I’m going to quit. I don’t even like to talk about it, but one of these days when I’m good and ready it’s gonna happen. And, just my luck, it’ll most likely happen in the middle of a terrific relationship with a guy who smokes like a chimney, and the last thing he’ll want to do is quit, and his cigarettes’ll wind up driving me crazy.”\\n\\n It’s a hard old world. “Does David know you’re in the program?”\\n\\n “Dave, he likes to be called. And yes, that was one of the first things I told him, when we were just DThomps and FareLady. He’d said something about it’d be nice to share a bottle of wine, and I wanted to let him know that wasn’t gonna happen. He’s a light social drinker. Or at least he is when he’s around me, but that’s another thing I don’t know about him, because he could be controlling it when we’re together and knocking back the silver bullets when we’re not.”\\n\\n She gave me a picture, one he’d sent her that she’d downloaded and printed. It was, she assured me, a pretty good likeness. It showed the head and shoulders of a man with the forced expression most people have when trying to smile for the camera. He looked pleasant enough, with a square jaw, a neatly trimmed mustache, and a full head of dark hair. He wasn’t movie-star handsome, certainly, but he looked okay to me.\\n\\n For a moment I thought she was going to ask for the photo back, but she made her decision and sat back. “I hate doing this,” she said, “but I’d hate myself more if I didn’t. I mean, you read things.”\\n\\n “Yes.”\\n\\n “And I’m no heiress, but I have some investments and a few dollars in the bank. I own my apartment. I’ve got something to lose, you know?”\\n\\n After she left I called the waiter over and got the check. She’d tried to leave a buck for her cup of coffee, but I figured I could afford to treat her. She’d given me five hundred dollars as a retainer, and all she got in return was a receipt, along with an explanation of the ground rules: I wouldn’t be giving her elaborate written reports, but would let her know what I found out, and would make my inquiries in a manner designed to keep him from getting wind of their source. I’d cover my own expenses, which didn’t figure to amount to much anyway, and if I wound up putting in more time than the five hundred bucks covered, I’d let her know, and she could decide whether or not to pay it. That’s a little unstructured for some people, but she didn’t have a problem with it. Or maybe she was just in a hurry to get outside where she could smoke.\\n\\n “Glad I never got the habit,” TJ said. “You a smoker, back in the day?”\\n\\n “Once or twice a year,” I said, “I would drink myself into the kind of mood that led me to buy a pack of cigarettes and smoke six or eight of them one right after the other. Then I’d throw the rest of the pack away, and I wouldn’t want another for months.”\\n\\n “Weird.”\\n\\n “I guess.”\\n\\n He laid a finger on the photo of the putative David Thompson. “You want me to see what shows up online?”\\n\\n “I was hoping you would.”\\n\\n “You know,” he said, “ain’t nothing I can do that you couldn’t do for yourself. Just get on Elaine’s Mac and let yourself go. You don’t even have to log on, ’cause now that she’s got the DSL line you’re logged on all the time. You just start with Google and poke around some and see where it takes you.”\\n\\n “I’m always afraid I’ll break something.”\\n\\n “Won’t even break a sweat, Chet. But it’s cool, I’ll take a shot at it. What say we go over what we know about the dude.”\\n\\n That didn’t take long because we didn’t know much. I suggested some lines of inquiry that might lead somewhere, and we both made some notes, and he pushed back his chair and stood up. “I’d best get back to my room,” he said. “Market opened ten minutes ago.”\\n\\n “You still doing okay?”\\n\\n “Some days be better than others. Some days the whole market goes up, and you look like a genius whatever you do. ’Less you went short, in which case you look like a fool.”\\n\\n I have two grown sons, Michael and Andrew. Michael and June live in Santa Cruz, California, and Andy was in Wyoming the last time I heard from him. I’m not sure of the city; he’d recently moved, but whether it was from Cheyenne to Laramie or the other way around I can’t be sure, and I don’t suppose it’s too important, because that was around Christmas and he’s probably moved again since then. I haven’t seen him in four or five years, when he flew east for his mother’s funeral. Michael’s been back once since then, on a quick business trip the summer before last, and then last year Elaine and I flew out there shortly after their second daughter was born. \\n\\n","sourceLink":"https://allnovel.net/all-the-flowers-are-dying-matthew-scudder-16/page-7.html","bookId":2334,"book":{"id":2334,"title":"All the Flowers Are Dying (Matthew Scudder #16)","description":"Storyline: All the Flowers Are Dying (Matthew Scudder #16) \\n \"A man in a Virginia prison awaits execution for three hideous murders he swears, in the face of irrefutable evidence, he did not commit. A psychologist who claims to believe the convict spends hours with the man in his death row cell, and ultimately watches in the gallery as the lethal injection is administered. His work completed, the psychologist heads back to New York City to attend to unfinished business.\" \\n Meanwhile, Matthew Scudder has just agreed to investigate the ostensibly suspicious online lover of an acquaintance. It seems simple enough. At first. But when people start dying and the victims are increasingly closer to home, it becomes clear that a vicious killer is at work. And the final targets may be Matt and Elaine Scudder.\\n","cover":"https://allnovel.net/images/all-the-flowers-are-dying-matthew-scudder-16.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/all-the-flowers-are-dying-matthew-scudder-16.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:55:14 AM"}}
