{"id":39952,"no":18,"title":"APPENDIX CAVALRY AT PEACE MAN UVRES","content":"If man?uvres are to be of real value to the cavalry, care must be taken to demand nothing of the troops but what would be required of them in war. This is most apparent in outpost duty, where demands are made on the outpost cavalry, especially in regard to reconnaissance, that in nowise correspond to the teachings of the \"Field Service Manual\"; and this is the more unfortunate, as the economy of strength demanded in the \"Manual\" is absolutely necessary if the divisional cavalry, in particular, is to be prevented from failing soon after the commencement of a war. The duties of outpost cavalry are limited to watching a strip of country to the front, and possibly on the flank, of the line of infantry outposts, and to carry messages between the different sections of the latter. Standing patrols are the most useful for observation work. In the case of an enemy close at hand, they should be in touch with him, and should, if there be no close reconnaissance patrols, watch his flanks as well; however, with proper dispositions this should be unnecessary. The standing patrols would, in any case, have to be in a position to detect and report any advance on the part of the enemy\u0027s outposts and any movement of the enemy denoting an advance or retirement. If the enemy, however, is so far away as to be out of touch with the cavalry cordon, reconnaissance work beyond this line should be carried out by those portions of the divisional cavalry that are not assigned to outpost duty. If, on the other hand, the outposts on either side are in close touch, reconnaissance to the front should be carried out by infantry patrols. It may, however, be advisable under certain conditions to let weak mounted pa[Pg 222]trols follow such infantry patrols to covered positions for carrying messages, or to employ them dismounted in the place of the infantry. If these arrangements are not strictly adhered to, it very easily happens, during man?uvres, that reconnaissance work is carried out by the reconnaissance patrols in the daytime, but at night by the outpost cavalry. In the morning the latter is then scattered in all directions and cannot be collected again. Such dispositions are also entirely opposed to the teachings of the \"Field Service Manual,\" and are unsuited to conditions of real warfare. In time of war the reconnaissance patrols naturally continue their work of observation during the night, and consequently they need not be relieved by patrols of the outpost cavalry. In peace time, on the other hand, it is still considered remarkable if the patrols remain in touch with the enemy at night, and those that do so have been dubbed \"sticky patrols.\" Those, also, which should really be in touch with the enemy throughout the night usually get under cover, and have been known to spend a comfortable night in excellent quarters. In making arrangements with regard to outpost cavalry, attention should be paid to reducing the distance which messages have to be carried. In this respect, horses are not always sufficiently considered. When outpost companies are pushed out far to the flank, it would usually be well to observe the instructions of the \"Field Service Manual,\" and to detail small detachments of cavalry to the companies for their independent use, as this will prevent considerable waste of strength. It will often be necessary, on the other hand, to protect unsupported flanks of a line of infantry outposts by special detachments of the divisional cavalry that do not form part of the outpost cavalry. Such detachments would, if possible, find housing for themselves and be self-protecting, though they might, under certain circumstances, be given a small force of infantry for local security. It is most important that the outpost cavalry should be concentrated in good time in the morning before the commencement of the march or of the engagement, and that they should retire in formed order on the divisional cavalry. This requires careful preparation and instructions; some practical method must be found which will overcome the[Pg 223] difficulties that now present themselves. The various squadron commanders must act in conjunction with the officers commanding the outposts. All the higher officers, and those directing the man?uvres, must, however, always keep this matter in mind, so that the present system, which offers such serious disadvantages, may not become so customary as to be carried on in time of war. Having examined the flaws still to be found in our outpost system, and which are likely to adversely affect the arm in war, we find, on turning to the sphere of reconnaissance, that such defects are even more prevalent. The arrangements that are usually made in this matter often draw on the strength of the cavalry in a manner quite out of proportion to the demands of actual war, and weaken the squadrons to such an extent as almost to destroy their fighting value. The weak point is, in the main, as follows: It is usual for every order given by a commanding officer to direct that a reconnaissance should be carried out, even though the previous order may have given instructions for one in the same direction. The cavalry obeys these orders, and sends out fresh patrols each time the order is repeated. As the patrols are always told to keep in touch with the enemy, and as, on account of peace conditions that obtain, nobody thinks of relieving them, they collect in one direction, whilst the squadron becomes weaker and weaker. I consider that every effort should be made to combat this bad habit. Care should be taken not to send out unnecessary patrols, and to call in, from time to time, those that have been sent out, or where necessary, to relieve them. I believe that this would be possible if the following rules were observed. If an order has been given which entails a reconnaissance in a certain direction, it is unnecessary that this should be repeated in a subsequent order. Other directions rather, which are indicated by reason of the altered conditions, should be brought to notice, and reference made to the reconnaissance already despatched. Under no circumstances, however, should a cavalry commander be induced, on receiving instructions to reconnoitre in a certain direction, to send a patrol to a point where he knows his patrols to be already in touch with the enemy. The necessary economy of strength can only be effected by leaving the command[Pg 224] of the patrol service entirely in the hands of the cavalry commander, who must be responsible to his superior officer for the carrying out of the reconnaissance work entrusted to him. The superior officer should only interfere if he discovers obvious mistakes, or if other circumstances render such a step absolutely necessary. He must, for his part, see that orderlies and reporting patrols that come in remain with his staff, and that they are sent back to the squadron when opportunity offers, so as to be available for fighting purposes. This should be made a standing order at man?uvres. All patrols that are sent out must receive definite orders as to how far they are to advance in any given direction, how long they are to reconnoitre in that direction, and when they are to return. If, at the expiration of such a period, renewed reconnaissance is found necessary in the same direction, relieving patrols should be despatched in good time, i.e. before the first patrols have returned; and these fresh patrols should, if possible, meet the returning ones, in order to exchange notes regarding the enemy. For this purpose the outward and homeward routes of the patrols should be prearranged as far as circumstances permit. In man?uvres, when one officer takes over command from another, he must inquire as to the arrangements made for reconnaissance work, and must take measures accordingly. When a fresh squadron is sent out on reconnaissance, due notice must be given to the squadron to be relieved. The two officers commanding must act in conjunction, so that the officer being relieved can draw in his patrols and the relieving patrols of the new squadron be sent out in good time. It should also be remembered that, in time of war, close reconnaissance would gradually develop from distant reconnaissance, and would not, as a rule, require any fresh dispositions such as are usually found necessary at man?uvres. During all exercises, especially when a long advance is being made and distant patrols are not actually sent out, the commanding officers should be furnished by the directing staff with such information as these patrols would in all probability have obtained. They should also be told which of the distant patrols may be assumed to be in touch with the enemy, and which have either returned or been cap[Pg 225]tured or wiped out. The distant patrols, which are to be in touch with the enemy, might with advantage be despatched by the directing staff, before the man?uvre commences, in time to procure quarters and receive instructions as to the situation. The troops should, of course, be informed of the despatch of these patrols, and all further reconnaissance will be furnished by the cavalry commander. Every cavalry detachment must also know exactly what area it is to reconnoitre, and what reconnaissances have been, or are assumed to have been, carried out by neighbouring detachments. It is a mistake to indicate the direction in which a near reconnaissance should be made, without limiting the distance of it. It is the duty of the distant reconnaissance to locate an opponent who is advancing from a distance. As long as the enemy is under the observation of the distant patrols, the close reconnaissance should not be pushed forward to meet him, but should be advanced from one position to the next, within definite limits. When these limits have been reached, the close patrols should be drawn in by the squadrons furnishing them, and fresh patrols be despatched to the next position. It would also be well if the directing staff were to lessen the work by stopping and sending back to their units such patrols as, by reason of their direction, cannot possibly come in contact with the enemy; or it may even suffice, for the purposes of the man?uvre, to assume the despatch of patrols in such directions. They might also be given sealed orders, only to be opened at a certain place, containing the data necessary for negative reports and instructions regarding their return to their unit. I believe that if such methods were adopted, and if the patrol leaders confined themselves to sending such reports as would be sent in real war, which would include a clear and concise statement regarding the configuration of the country, it would be possible to avoid the unwarrantable weakening of the squadrons now in vogue, which does not even produce a correspondingly efficient service of communication. It is, however, true that the art of sending a few, but good reports, and of sending them at the right time requires, in the leader of the patrol, sound tactical judgment, and a training that is nowadays but seldom obtained. [Pg 226] Senior officers also are often to blame for the frequency of reports. Appointed to a command at man?uvres, they want to know every detail about the enemy, and the exact minute in which an advance or a movement is made. Every little detachment must be reported, and the slightest movement watched. The result is that they encourage patrols, not only to send as many detailed reports as possible, but, if necessary, to obtain the information in a manner incompatible with service conditions. This is a deep-seated evil that is to be seen at all man?uvres, and one that commanders should consistently endeavour to eradicate. Such procedure reacts upon the commanding officers themselves by exercising a harmful influence on their individual training. If everything is known about the strength, the line of advance, and the distance of the enemy, generalship descends to the level of the solution of an arithmetical problem, decisions of the commanding officers being based on complete and established data. What a difference is there in actual warfare! But meagre information is available regarding the enemy, and decisions must, as a rule, be based on a certain knowledge of one\u0027s own plans and a rough idea of the numbers, intentions, and fighting strength of the enemy. In the former case, decisions of commanding officers are the result of calculation; in the latter—i.e. in actual warfare—they are a matter for military skill, or the intuition of genius, which is a very different thing. These are the decisions that officers should be encouraged and trained to make; but, unless the malpractices that have crept into the reconnaissance work are rooted out, this valuable training for actual warfare is likely to be lost. But all that is only by the way. We are now discussing the cavalry and not the generals, and I should like to point out the great importance of training units themselves to report in a manner suited to service conditions, i.e. to report only important matters, and these at the right time, so that the commanding officer may receive information regarding the enemy in time to make the necessary dispositions, while at the same time the reconnoitring detachments need not unduly weaken themselves by the too frequent despatch of messages. On the field of battle reports could be carried by individual horsemen instead of by patrols, but of these only a limited number should be drawn from the squadron,[Pg 227] as it is not possible to rely on their return. They must also be taught only to take reports to such places as they could actually reach in war. At man?uvres and other exercises they are often to be seen riding about behind the firing-line in the most exposed places, having apparently no idea of the dangers which they would run in real warfare. This habit, acquired in peace, may in time of war entail the loss of many riders, horses, and reports. The best means of counteracting these bad habits is to tell the despatch-riders exactly where to go, and to prevail on the officers concerned to remain in certain fixed places, as in real warfare, instead of moving about on the field of battle, even within the zone of the enemy\u0027s fire. It is true that, by moving about and exposing themselves, commanders can get a better idea of the engagement, and can make dispositions more rapidly and better than they could from the rear; but, at the same time, such procedure spoils their own training by removing difficulties that would exist in time of war. Making suitable dispositions from the rear, with hardly anything but reports to go by, is quite a different matter from conducting the fight from the front, where a clear view of the situation can be got. As regards reconnaissance and screening, the principles evolved in the chapter on these subjects hold good for the conduct of cavalry at man?uvres. First of all, we must see whether the cavalry attached to the different divisions should, according to its strength, be only classed as divisional cavalry, or whether its total strength is such as to entitle it to be considered as army cavalry. Units detailed to act as divisional cavalry should not move about independently in the man?uvre area, as this would be in opposition to the essence of their duties, nor should they, on the other hand, remain tied to the infantry, as they unfortunately so often do. They must learn to advance from point to point, to reconnoitre by areas, to observe from a distance with glasses, to judge correctly which flank is of most importance for reconnaissance, and, finally, to occupy during the engagement such ground that may be valuable or essential for successful reconnaissance. Regiments and squadrons detailed as army cavalry should, on the other hand, act according to the principles involved. [Pg 228] When army cavalry is taking part in man?uvres, the leaders should be recommended to include in the exercises reconnaissance and screening problems on a large scale. This can generally be done. Then the merging of the distant into the close and battle reconnaissance should be practised, the gradual withdrawal of reconnoitring squadrons on the approach of the enemy, the evacuation of the areas allotted to them, and the independent action necessitated by the fresh conditions. This stage is instructive, not only for the reconnoitring squadrons and patrols, but also for the cavalry division itself. They will have to decide on which flank of the troops in rear to concentrate, and in this matter must act in conjunction with any divisional cavalry there may be; at the same time, they must take into account the ground and the general strategical situation. The final decision will, as a rule, have to be made after duly weighing many varied and often conflicting considerations. If a general engagement of all arms should result, it is important, even though the ground should not be suitable for a charge, that the best use should, in any case, be made of the fighting value of the troops. Nothing is more incorrect and more opposed to the principles of warfare than an attitude of inactivity in anticipation of the possibility of an attack. If écheloned forward on the flank of the force, the cavalry should make every endeavour to develop an attack against the flank or rear of the enemy by fire or shock action, and to threaten and harass his artillery. The heavy artillery of the field army will often afford a suitable object of attack, more so, perhaps, in man?uvres than in actual warfare. It is undoubtedly wrong, whatever the conditions may be, to remain inactive and watch the other arms struggling for the palm of victory. \"Activité! activité! activité!\" cried Napoleon to his generals, and this, too, should be our first demand from our cavalry leaders. It would also be a useful exercise if pursuits could occasionally be arranged for at man?uvres, so that the cavalry may learn how to initiate them in good time, and to push them home with energy. The difficulties of pursuits, and the principles to be observed in their conduct, are dealt with elsewhere. If the cavalry endeavours to carry out the tasks I have sketched above, and at the same time effects the necessary[Pg 229] economy of strength, it will reap benefits from man?uvres that will materially assist its training for war, provided the antiquated ideas that still prevail are discarded.","sourceLink":"http://novel.tingroom.com/duanpian/2783/77128.html","bookId":1309,"book":{"id":1309,"title":"Cavalry - A Popular Edition of \"Cavalry in War and Peace\"","description":"简介： General von Bernhardi is best known in England as a writer of the Jingo School which has done so much to produce the war, but this is only one side of his literary activity. He is also a writer of recognised ability on the theory and practice of mode...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2783","creation":"Aug 1, 2019 12:24:50 AM","modification":"Aug 1, 2019 12:24:50 AM"}}
