{"id":39940,"no":6,"title":"A. RECONNAISSANCE, SCREENING, AND RAIDS","content":"I. RECONNAISSANCE BY THE ARMY CAVALRY The very essence of cavalry lies in the offensive. Mounted it is incapable of tactical defence, but, in order to defend itself, must surrender its real character as a mounted arm and seize the rifle on foot. The service of reconnaissance, therefore, must necessarily be carried out in an offensive sense. The idea of the offensive is not, however, meant here in a narrow sense, such as seeking a tactical battle, but rather that the reconnoitring army cavalry must under all circumstances maintain the initiative, use its activity against the enemy, and impose its will upon him. It is by no means its duty under all circumstances to seek out the enemy\u0027s cavalry in order to defeat it. By such conduct it would allow the enemy\u0027s cavalry to dictate its movements. It must rather subordinate all else to the particular objects of reconnaissance, and advance in those directions which promise the best fulfilment of the reconnaissance needs of the Army Head Quarters. Should it thus meet with the enemy\u0027s cavalry it must naturally attack and overthrow it. On the other hand, it can safely reckon that the more decisive the direction in which it moves for the purposes of reconnaissance, the more chance there will be of meeting the enemy. 1. The Main Body of the Army Cavalry The same principle holds good for the strategical disposition. The old Cavalry Drill Regulations laid[Pg 41] down that the strength of the cavalry division was to remain concentrated until the enemy\u0027s cavalry had been driven from the field. This considerably over-stepped the bounds of restriction usually imposed by regulation, and at the same time fettered the freedom of movement of the cavalry in a way that, under certain circumstances, might have become most harmful. The new Regulations have left out these directions and indeed lay down that, in the \"advance to the fight,\" efforts must be made to reunite columns that are advancing separated before collision with the enemy takes place (413).[6] Here is expressed a principle which, if rightly understood, is certainly justified, but which, on the other hand, might give rise to misunderstandings. It must first be pointed out that it is by no means always desirable to unite columns that are separate before the fight. It may, for example, very easily happen that a detachment in favourable country will be able to occupy a superior force of the enemy, and thus, by remaining dispersed, ensure superiority at the decisive point. If, however, by the \"concentration of columns\" a natural approach is understood, which ensures a concentric co-operation of divided groups against a common enemy whose direction of march is more or less known, then the principle is an excellent one. If, on the other hand, it is intended that single columns should be so closely concentrated that the division as a tactical whole can be thrown into the[Pg 42] fight, it appears to me that it goes too far, and might easily lead to harmful dogmatism. Thus read, the regulation appears to me to be the more dangerous, as exercises in a limited space encourage the concentrated employment of the larger cavalry bodies in the fight, and their approach and deployment from formations of assembly or intermediate formations, for which brigade columns are usually chosen. It must be remembered that it is always much more difficult and dangerous in the presence of the enemy to separate a cavalry mass for the fight than to concentrate it from a not too wide separation for common action against the enemy. In the first case the danger must be run of surrendering \"the proud rights of the initiative\" to the enemy, and of being obliged to attack eccentrically; while in the second case one is in possession of the exterior lines, and, with them, the most favourable directions for attack. The regulation quoted should therefore result only exceptionally in a complete tactical concentration. The wish, however, to fight concentrated must never lead to a concentrated advance unless circumstances dictate such an operation as practical. Leaders of the large reconnoitring bodies will have, rather, continually to consider how they may best fulfil the task of the moment in the most practical way without allowing themselves to be bound by preconceived theoretical views. This must be their course of action, and will often enough lead to the advance in separate columns. The breadth of reconnaissance-zones will often demand such procedure. Along the whole front, troops must be in a position to support the reconnoitring bodies which have been pushed forward. This will not always be possible from a single point on account of the distances in[Pg 43]volved. It will at times be necessary to break through the hostile screen when it is met by force of arms, without first being able to judge where this can most easily or most advantageously be accomplished. Again, complete information will not perhaps be to hand of the presence and the direction of march of the hostile cavalry, so that the concentration of force upon a single road will not appear at all desirable. It must also be borne in mind that the masses of cavalry have not only to act as fighting bodies, but at the same time to play an important part in the system of obtaining information. Communication must be maintained with the Head Quarters, as well as with the reconnoitring squadrons and certain independent patrols. In the latter case particularly, great difficulties will often arise. A cavalry leader must continually ask himself which is the shortest and safest means of communication with the reconnoitring organs on the one hand and with the army following him on the other, and how it can be maintained when hostile detachments pervade the intervening country. All these are circumstances which would lead to the adoption of an advance in separate columns. The universal principle must always hold good for cavalry, that when a decisive struggle is in prospect all possible strength must be concentrated for it. On the other hand, it must be perfectly clearly understood that in a future war many varied and often contradictory demands will be made upon the arm. It will not always be possible to meet them all from the one point of view—that of uniting all possible strength before the commencement of a fight; the less so as in reconnaissance the fight is only the means to an end, the knowledge of the enemy being the essential. It remains for the genius of the leader to make his[Pg 44] preparations in full freedom, and to solve the task confided to him in his own way. To hamper active operations by regulation is always a great evil. The danger which lies in separation of force is not so great for cavalry as might appear at first sight, on account of the mobility and adaptability of the arm. For, although the Regulations lay down that on account of the rapid conduct of a cavalry fight the concentration of separate columns upon the field of battle can but seldom be successfully accomplished, this view can only be admitted in the case of the mounted combat. I am of opinion that it cannot be so difficult under ordinarily favourable circumstances to bring about such a concentration. With reliable reconnaissance early intelligence of the presence of the hostile cavalry should be to hand. It should then be often still possible to concentrate the separate columns according to circumstances, either forwards, backwards, or to a flank, and finally to unite them for the fight with sufficient room and time, and in an effective direction for attack. If, however, a portion of the advancing cavalry mass should come into unforeseen collision with superior hostile cavalry, it must fall back in a direction which will lead to concentration of force. In order gradually to lead up to, and at the right time to achieve, such a concentration from a divided advance, without falling into the error of a too close tactical concentration, presupposes that the leader is an artist in the conduct of his arm. Such an undertaking is much easier where not only mounted combat, but fire action is taken into consideration. In such a case that detachment which comes first into collision with the enemy would be able to defend itself in some strong position or behind some naturally defensible locality until the rest of the main body came up. [Pg 45] Good communication between the several portions is in all such cases an important factor. If necessary it must be effected by the help of the guns. Generally speaking, it will facilitate and prepare communication if the separately advancing columns are kept informed as to the rate of march, so that each column can at any moment calculate where the others will be in a given time if nothing unforeseen occurs. This also enables information to be sent by the shortest route to points which can to a certain extent be previously determined. The arrangements for the advance form at the same time the foundation for the action of the actual reconnoitring organs and the complete establishment of the reconnaissance system. Directions for this will be found in the \"Field Service Manual.\" It is laid down that reconnoitring squadrons will be pushed forward from the various groups of the army cavalry, and will be allotted zones of reconnaissance in the direction of the enemy. The reconnaissance itself will be carried out by patrols. The breadth of these zones must continually alter according to circumstances. If it be necessary to reconnoitre on a broad front with a comparatively weak cavalry, very wide zones will often be necessary. On the other hand, the closer the system of reconnoitring squadrons can be established, the more reliable the manner in which reconnaissance will be carried out, and the easier will it be to hamper the enemy\u0027s efforts at gaining intelligence. If the \"Field Service Manual\" lays down a certain breadth as normal, this naturally only indicates that, under ordinary circumstances, squadrons on a wider front would no longer be in a position to carry out their duties to the full; nothing more. The frontages laid down should never lead either to the[Pg 46] perceptible weakening of the fighting value of a force by sending forward too many reconnoitring bodies, or, on the other hand, to the inability of the reconnoitring organs to cover the space demanded by the strategical situation. A well-considered allotment of areas is therefore of special importance, and a matter for the higher leader to decide. For the arrangements for reconnaissance inside the zone apportioned to him, the squadron leader is, on the other hand, correspondingly responsible. It is at the same time laid down that no squadron should interfere in a neighbouring zone. Although in these measures the principles for the reconnaissance may be sought, it must be clearly understood that the original allotment of zones cannot always hold good. This arrangement is only practicable and suitable so long as the opposing armies are frontally approaching each other. As soon as the directions of march form an angle with each other the conditions alter. When information has been obtained as to the enemy\u0027s position and that the direction of his advance is not directly at right angles to our front, or if the direction of march of our own army changes, it may be necessary to make repeated changes in the zones of reconnaissance. The manner in which this can best be done is a matter which experience alone can show us. The change of zones will often be possible in conjunction with the recall of detached squadrons and the sending forward of fresh ones in a new direction, or during the relief of reconnoitring squadrons. When the gradual advance of the hostile army takes place and the army cavalry endeavours to clear the front and to draw away to a flank, or when the columns of both armies group themselves for the tac[Pg 47]tical decision and concentrate more or less from their march formations, the allotment of zones must utterly fail. An allotment of zones, also, cannot always be recommended, that is to say, not where it can be foreseen that it cannot be carried into operation. Such a case might happen if an enemy moved across the front on a more or less distinct flank march. The reconnoitring squadrons would, perhaps, in such a case be better employed in keeping touch with the various groups of the hostile army than by tying themselves down to a systematic reconnaissance in zones. The conditions of war are everywhere so changing and full of movement that a single concrete scheme will never suffice, but each case must be judged upon its own merits. The allotment into zones, therefore, laid down in the \"Field Service Manual\" must be regarded as but a foundation for the methods to be adopted, and will perhaps only attain its full effect during the first concentration of opposing armies, when the hostile groups deploy along a land frontier on a wide front. During operations the original scheme must of necessity be subjected to continual alterations and transformations. Let us now further consider the relief of reconnoitring squadrons. It is out of the question that such squadrons should remain continually in touch with the enemy. Such a procedure would very soon paralyse the strength of men and horses. The relief, however, cannot, naturally, be arranged and carried out at any given moment. It requires preparation, as the whole patrol system must be drawn in and replaced by a fresh one. The relief will doubtless best take place after a great tactical crisis. At such times the reconnoitring squadrons will partly have been driven[Pg 48] back on to the cavalry mass, and partly will be in position with their patrols near them in flank and rear of the enemy, whence they can be comparatively easily brought in. A great tactical decision also which creates a new situation demands fresh measures for reconnaissance and a different arrangement of the reconnoitring organs. Whether it will then be possible to mathematically divide the ground into sections need not here be decided. Under certain circumstances it will be advisable to detail reconnoitring squadrons to watch the various groups of the hostile army. If we take the campaign of 1870 as an example of a concrete case, the battles of Spicheren, Mars la Tour, and Gravelotte afforded natural periods for the relief of reconnoitring squadrons and the fresh allotment of reconnoitring zones for the First and Second Armies, and later the battle of Sedan. For the Third Army, first of all, the battle of W?rth. Cases may of course occur when the reconnoitring period between the battles is too long, and a relief becomes necessary in the interim. The case of the Third Army is a good example of this. A reconnaissance from W?rth to Sedan could never have been carried out by the same reconnoitring squadron. A relief was absolutely necessary. According to my judgment, the best time for this would have been the days during which the great wheel of the Third Army towards the north was completed. During these days fresh reconnoitring squadrons would have had to be thrown forward in the new line of march, while those which had advanced in the original direction could, according to the situation, have been gradually drawn in. Strong patrols would have been sufficient in that direction. [Pg 49] In any case it is clear that the question of the relief of reconnoitring squadrons is extremely important and cannot be solved by routine. It is a matter for consideration whether it would not be of advantage for the \"Field Service Manual\" to touch on these questions as well as on the circumstances under which a departure from the system of allotment of zones might be desirable. I am inclined to think this desirable, as otherwise the extremely practical dispositions therein laid down are apt to lead to a lifeless formalism. The important service of transmission will naturally be deeply influenced by all these conditions. I have already expressed the opinion that the importance of this service with regard to the increased extent of the reconnoitring rayons may even lead the main body of a division, for example, to advance in separate columns, in order to shorten the routes of information and to afford a not too distant support for the reconnoitring organs. The Head Quarters will often be more quickly informed if the news comes direct from detachments themselves than if it had first to be collected at one point. If it has become so necessary to accelerate the service of communication, it is all the more so to ensure that the system of reports should be properly ordered. In the main body of the army cavalry it is a matter of keeping up communication on the one hand with the army following, on the other with the advanced squadrons. In both these respects the application of technical means of communication must be considered before all else. Communication to the rear is fundamentally the task of wireless telegraphy. But the system of information to the front must be otherwise arranged for. [Pg 50] Communication with the reconnoitring squadrons can practically never be carried out by wireless telegraphy. Here efforts must be made to work with the light-signal apparatus,[7] or to employ cyclists or relay lines to facilitate and accelerate the service of transmission. A combination of all these means, and the use of the cavalry telegraph, if need be, will be found advisable. In friendly country the population can often be used to keep up communication or to send messages. The employment of single cyclists or motor-cars is, on the other hand, not advisable. Without taking into account the fact that they are tied to the roads, and, having no fighting value, will often fall an easy prey to the enemy, technical defects occur so often in the machines that they cannot be classed as a reliable means of communication, particularly in hostile country. Should the distance between the reconnoitring squadrons and the main body become very great, or if circumstances arise which render direct communication between them too long a matter, or if it is desired to provide several avenues of communication, a collecting station can be formed for reports: this will keep up connection, and must be secured by a detachment of sufficient strength. It is erroneous to assume that such collecting stations must always be used. They often operate very unfavourably, especially when armies are on the move, as they are for the most part very local, and then do more harm than good. If there is a sufficient number of apparatus at disposal, and if the collecting stations are sufficiently secured, an effort should be made to establish wire[Pg 51]less communication from them to the rear—a cipher being of course used to prevent the enemy learning the contents of messages. Otherwise the various means available must be suited to the particular case, and used in combination. The system of communications thus forms a complicated machine, formed of technical and natural methods of transmission of great variety, that will be difficult to maintain in an efficient state, especially when an army is on the move. It is obvious that these difficulties must be augmented during the change of reconnoitring zones or the relief of reconnoitring squadrons. It will often be worth while to establish the system of intelligence in a new direction, while the available apparatus and telegraphs are still in part maintained on the old lines. Only some \"system of auxiliaries\" will meet these difficulties; only troops to whom this service has been entrusted down to the smallest detail will be able to discover these auxiliaries and properly employ them. Otherwise the service of information must miscarry. 2. Reconnoitring Squadrons From the above considerations it must be already clear that a great measure of resourcefulness, a comprehensive grasp of the situation, clearness of judgment, and a love of responsibility will be demanded from the leader of a reconnoitring squadron. Even in the simple advance in the allotted zone, clear understanding will be required as to all the measures for the proper conduct of the troops, and well-calculated boldness when the enemy is met with. There will, however, be difficulties to overcome when the main body of our own cavalry changes its[Pg 52] direction; when the concentration for battle begins from the line of march, the cavalry masses draw away to a flank, unexpected measures of the enemy come to light, which had not been counted upon when our reconnaissance was arranged; or when our own cavalry is beaten, and touch with it is completely lost. Under all these circumstances the allotment of zones completely loses its value, and the whole reconnaissance must be arranged and ordered on some other system. Squadron leaders will often in such cases act quite independently and according to their own judgment of the situation, and with an appreciation of the probable action of neighbouring squadrons, without, however, losing sight of the main objective. In such cases they will often report direct to Head Quarters, and may then have to fall back on the main army instead of on their own division. Every squadron commander can conclude from these reflections what an unusually high standard of military training, power of judgment, and initiative will be demanded of him if he is properly and successfully to carry out these duties. I hope that all officers will be stimulated to apply themselves to these matters, so that a future war may not find them unprepared. It is a matter of the greatest importance for the conduct of the squadron in general whether it is acting in a friendly or hostile country. While in the first case troops may ride through towns, feed in villages, and count upon considerable support from the inhabitants, in the service both of security and information, in the second they must always be prepared against treachery or surprise, and behave as if they were surrounded by a network of spies. Townships are to be[Pg 53] particularly avoided, and special precautions for safety must be taken, especially while at rest. In other respects the advance itself must in both cases be carried out according to the same principles. Squadrons will generally advance by successive stages, and upon those roads which appear to them to be the most important for reconnaissance. If they are provided with the light-signal apparatus, and can use it for communicating to the rear, they must keep in mind during the march itself the possibilities of being able to use it, try it on the ground, and make a mental note of points that are specially adapted for connection-stations. The whole plan of the day\u0027s march must then be made with an eye to the establishment of communication by this method. Halting-places for rest or feeding horses must be selected with regard either to good cover or to the view which may be had from them. In order to be independent of the hostile population, it is advisable for the squadron to have its ration and forage wagons with it. In case of an unsuccessful collision with the enemy these may indeed be lost. In any other case, however, they will always be at the disposal of the squadron. On the other hand, in hostile country, if they follow the squadron at too great a distance, they will often fall a prey to the enemy. Under such circumstances, if they are to be really protected, a sufficiently strong escort must be left with them, and this will react unfavourably upon the strength of the squadron. The efforts of reconnoitring squadrons to diminish the distance between themselves and the enemy as quickly as possible by undertaking excessive marches, such as are frequently seen in peace, are misdirected and unreal, and only tend to wear out the horses. In peace man?uvres, which only last two or three days,[Pg 54] and which have not to be sustained by a number of lame and over-tired horses, such proceedings are indeed possible, but in war they are pernicious. A squadron should be able to remain up to strength throughout a campaign, and it must be remembered that horses that go lame and are left behind will, at all events in hostile country, be lost to the reconnoitring squadrons for good. The patrols, too, must be able to keep something in hand. But, if the squadrons tax their capacity for marching to the utmost, the patrols, which are required to go still farther in advance, must be completely exhausted. If the squadrons can cover daily 25 miles and the distant patrols 35 to 40 miles, this will, I hold, be quite sufficient. More than this, on an average, cannot be expected of them. This does not of course preclude special efforts to meet particular circumstances. It will only be possible, however, to demand these efforts when we learn how to calculate the average length of march during which men and horses can be kept fresh and efficient. Although the choice of lines of advance and the combined action of the reconnoitring squadrons are often weighty factors of success, yet on the other hand, in order to obtain early and sufficient intelligence of the enemy, it is of the highest importance that the patrol system should be properly ordered according to the needs and probabilities of the situation. The \"Field Service Manual\" gives the necessary principles for their action. They must, it says, be sent forward along the roads that the enemy is most likely to use. By so doing, certain results must, under any circumstances, be obtained. On the other hand, it is a mistake to send forward single patrols against a wide front. Under such circumstances a patrol is always in doubt which way to go, will prob[Pg 55]ably divide, and cannot, at all events, be everywhere. From such procedure, which is unfortunately only too common, reliable results cannot be expected, and it is never certain if observation is being carried out in any given direction. Such a faulty course of action usually originates from a certain confusion of thought on the part of the leader as to his own intentions and his suppositions as to the enemy. A clear appreciation of the situation ensures at the same time a clearly defined course of action. If, however, no sort of idea can be formed as to what the enemy is likely to do, the patrol system must be extended, not only in those directions from which the enemy may be expected, but in others where it is possible that he may be met with. Any turning movement on the part of the hostile forces must, in this manner, be continually guarded against. The number of patrols sent out will, of course, depend on the importance of the task. If the strength of a squadron is insufficient to provide them, it must be supplemented by patrols detailed from other squadrons. The relief of such patrols, also, may have to be carried out by the same means. Cutting down the number of distant patrols is to be avoided as far as possible. Economy of force can be better obtained by careful husbanding of strength in the close reconnaissance and service of security. The strength of distant patrols should never be arbitrarily laid down, as in this respect also the circumstances must be taken into account. Patrols which are far distant from the road upon which the squadron is advancing, and which can only be reached with difficulty, require a greater degree of independence than those in the immediate neighbourhood, which can be rapidly supported or strengthened. The probability,[Pg 56] also, of meeting with superior hostile force demands a greater proportion of strength. Under certain circumstances a whole troop may be used as an independent patrol. At the same time a wise economy of force must be practised so that the fighting and marching efficiency of the squadron does not suffer too much. To this end, quite weak patrols must be made to suffice in directions of secondary importance. A second in command must be detailed to every patrol. There should also be a supply of trained lance-corporals ready to lead such patrols as may be required to carry information to the rear. The strength of patrols will depend largely on the number of messages that they are expected to send in. As a general rule, in large operations, not more than two messages will be required from each patrol during the day. It is only when the opposing armies approach each other, and the distant patrols gradually become close patrols, that it will be necessary to report frequently on tactical events. The distances, however, will then have so far diminished, that a reinforcement of the patrols from the squadrons would probably be possible if they have become over-weak through transmission duties. Like the reconnoitring squadrons, the patrols require relief from time to time, as the same patrol leader cannot be expected to remain in continuous touch with the enemy. The strength of patrols, therefore, will generally have to be calculated according to the number of messages and the number of days during which the same men are required to be in contact with the enemy. It is only when a special fighting strength appears necessary that these numbers should be exceeded. On the other hand, the patrols in friendly country may be[Pg 57] made weaker than when in the enemy\u0027s territory, as, in the latter case, it will scarcely be possible to send in messages by single orderlies. Careful preparation must be made for the relief of patrols. Every patrol that is sent out must know when, and approximately where, it can rejoin the squadron. The relieving patrol should arrive on the field of exploration before the original patrol returns. The two patrol leaders should meet where possible. All the patrols should never be relieved at one time, as such a procedure would tend to weaken the squadron too much. The reconnoitring squadron must continually endeavour to maintain communication with the distant patrols which send in reports to it. As the main body must always be careful to render communication with the reconnoitring squadron possible and to facilitate it, so is communication with the patrols one of the most important duties of the latter. It will often be necessary, when the distances become great or the ground difficult, to push forward relay posts to facilitate and accelerate the service of transmission. These posts must have a sufficiency of force assigned to them. The squadron leader, further, must most minutely instruct the patrols in anything that can serve to assist the carrying out of their task, and as to all arrangements for the transmission of reports. A patrol\u0027s instructions must be short and clear, and must leave no room for doubt in the patrol leader\u0027s mind as to what is expected of him. The instructions must contain: all that is known of the enemy; a statement of the general situation, and of the system of reconnaissance, as far as it may concern the patrol in question; an indication of the proposed march and the objective of the squadron;[Pg 58] points where messages as to the position of the squadron may be deposited, in case it should be found necessary to depart from the preconceived plan; exact data as to when and where the relieving patrol will be sent and also when the patrol is to rejoin the squadron. Although such arrangements may not always have the desired results, as all such dispositions are liable to be disturbed by the action of the enemy, they yet form a good groundwork on which to build further, according to circumstances, and which can be suited to any alteration of the situation. Such arrangements should therefore never be neglected. In man?uvres, the leaving of such information—for instance, under stones—in prearranged places or localities that are easy to find, and which must be determined by the map according to the expected situation, will be found a valuable exercise. Communication will, as a rule, be best secured if the reconnoitring squadron can succeed in beating the hostile organs of reconnaissance and security. We must not, of course, assume that a squadron that has been thrown back and pursued for a space will be rendered incapable of carrying out its r?le. It will still try to support its patrols as before. If, however, such successful combats become numerous, a superiority will at length be obtained, particularly on the main avenues of communication, that will considerably facilitate the task of obtaining and transmitting information. It must therefore be the ceaseless endeavour of the cavalry to attack the enemy wherever found. The reconnoitring squadrons in particular must undertake the duty, not only of driving the corresponding hostile squadrons from the field, but of endeavouring to in[Pg 59]tervene and assist wherever the hostile reconnoitring patrols offer an obstinate resistance. They must take every opportunity of fighting with the arme blanche, or of attacking the enemy in some unfavourable situation, perhaps by night. Dismounted action for single squadrons advancing in hostile country is generally dangerous, and, on account of the weakness of the force, usually leads to failure. It should never be forgotten that for a successful action on foot great numerical superiority is indispensable. Should the reconnoitring squadron come in contact with the enemy\u0027s cavalry in strength, it must be decided whether to fall back, or avoid it by a détour in order to maintain under all circumstances communication with the distant patrols. In the latter case, communication to the rear becomes naturally considerably more difficult, and it can only be hoped that the hostile cavalry will be beaten by our own. Whatever decision is made will depend upon the circumstances of the case: the terrain, the distance from our own cavalry and from the enemy\u0027s main body, as well as on what is already known of the enemy, and on what it is of particular importance to learn. It will generally be most important, as well as desirable, to maintain at all costs communication with the distant patrols, as news must first be procured before it can be sent back, and it will be possible under certain circumstances to communicate over the enemy\u0027s head with the light-signal. In order to maintain the necessary fighting strength of the squadrons under all circumstances, as few men as possible should be detached. This does not of course refer to the distant patrols. The melting away of the squadron\u0027s numbers, so often seen in peace, is generally a result of the man[Pg 60]ner in which the close reconnaissance is conducted. The close patrols are sent out 6 or 7 miles, often still farther, and, having general instructions to remain in touch with the enemy, seldom rejoin the squadron. Thus they become lost to the squadron, and as the squadron leader is not fully aware of their position he is soon under the obligation of having to send out a fresh patrol. This patrol is a less useful one than the first, and if it brings in news of the enemy the latter will often arrive simultaneously with the news. The report often enough goes first to the enemy about whom it is being made. No reproach can be attached to any one concerned. It lies in the nature of things and in the method of apportioning duties. In contradistinction to such procedure, it is, in my opinion, in most cases quite superfluous to arrange a close reconnaissance in addition to the distant patrols. Close patrols weaken the squadron, and can only, it appears, rejoin it with difficulty, nor do they effect the necessary reconnaissance. Every squadron must, on the other hand, be continually surrounded by local patrols for its own safety, closely connected with it, and which, being in constant communication with the squadron, secure it immediately from surprise and, as far as their strength allows, attack and break up hostile patrols. This measure will not have the effect of weakening the squadron too much. These patrols will require relief from time to time, and accompany the march of the squadron in its rayon in such a manner that a second patrol can be sent out before the first rejoins. They must, however, never be drawn so far away from the squadron that they cannot secure its immediate safety and beat off hostile patrols. If, in exceptional circumstances, patrols are sent out[Pg 61] in close reconnaissance, it is desirable that they should work from one locality to another a few miles in advance, so that it will always be possible to get them back. Especial attention must be given to this matter when operating in the enemy\u0027s country. Patrols to connect with neighbouring squadrons are quite superfluous. They have little prospect of carrying out their task in a practical way, and must therefore be regarded as a useless expenditure of force. The regulation of the movements of the various reconnoitring squadrons as a whole, and the dissemination of information regarding them to each other, is a matter for the Head Quarters of the main body. Economy in patrols should never go so far as to allow of cyclists, or indeed a single cyclist or motor-car, being used for reconnaissance, as unfortunately repeatedly happens in man?uvres. Cyclists may be used for the purpose of maintaining communication and bringing back reports. It will not be possible to use them singly for these duties, especially in the enemy\u0027s country, but several will have to be sent together. Bound as they are to the roads, they are quite unsuited to patrol work. It is also inadmissible, at all events in hostile country, to send bicycles or motor-cars with patrols. They only become a burden to the patrol as soon as it wishes to leave the road. For the motor cyclist the question of petrol is also an important one. Where will he replenish his supply in hostile country? Certainly not in villages with a hostile population, unless a sufficient show of force can be made. The accommodation of reconnoitring squadrons for the night also demands close attention. Such accommodation must be chosen from quite different con[Pg 62]siderations, according as the squadron is operating in a friendly or hostile country. In any case, endeavour must be made so to dispose the squadron that the chief avenues of communication, at least, will be under observation, and thus closed to the enemy\u0027s despatch-riders. The horses also must be rested, that they may be ready for the next day\u0027s work, for a tired squadron cannot reconnoitre properly. In order that the horses may really rest, they must be off-saddled, and, to do this, the squadron must be secure from surprise. This will not always be possible, but endeavours must be made towards that end. Should hostile detachments be in the neighbourhood, which is unavoidable during critical days, it will be necessary to be always ready for possible surprise, and to so arrange that the squadron can speedily withdraw from its bivouac on the approach of the enemy. The measures taken for safety must be directed to this end. It is also sometimes desirable, in order to deceive the enemy, to change the halting-place already occupied, after darkness sets in. In friendly country, if an attack is expected, it is often better to spend the night in larger villages, where the inhabitants themselves will co-operate in the service of security. In the enemy\u0027s country, on the other hand—where the hostility of the inhabitants is to be reckoned with—the larger villages must always be avoided, and accommodation must be sought in single isolated farms, which, by their position, are in a measure secure from surprise, where the fighting force can be kept together, where there is nothing to fear from the inhabitants, and which can be quickly abandoned, if possible, unobserved. The service of security in such situations must be carefully organised and must not consist merely of[Pg 63] guarding the immediate environs. It will rather be advisable to push forward posts on the chief lines of approach of the enemy, which will be able to bring in timely news of his advance. What degree of readiness for movement is maintained in such situations the circumstances of the moment must dictate. In this question of accommodation, attention must also be paid to the service of communication. It must be possible from the position selected for the night to pick up communication with our own troops and to receive the orders and instructions which will naturally be expected at the end of the day. If the squadron is provided with the light-signal apparatus it should remain in the neighbourhood of high ground, from which it is thought possible that communication may be picked up. If instructions have been received to establish communication by mounted orderlies or cyclists, care must be taken that there are roads easily found, even in the dark, by which they can reach the main body, the reporting centre, or the relay posts, as the case may be. The squadron\u0027s own reports, too, will often not be sent off before evening, in order that all the events of the day may be collated. This must be done in clear, concise form, more especially where the means of transmission is the telegraph or light-signal. The sifting and collating of information received is therefore an important and very responsible task, requiring continual practice. The squadron leader must be able properly to judge which of the reports received must be sent to the army Head Quarters or to the cavalry commander, and all superfluous matter must be eliminated. All reports received should by no means be transmitted. This would overburden the service of transmission to no useful purpose. [Pg 64] 3. Distant Patrols The duties of the distant patrols are just as difficult as those of the reconnoitring squadrons, as they are continually brought face to face with the necessity of forming independent decisions, and, in order to act and report efficiently, require a high degree of strategic insight. Apart from the personal capacity of the officer commanding the patrol, a thorough training emphasising the essential points in its conduct is necessary for the men. I have already shown the lines on which such instruction should be conducted. I would here, however, like to add that the patrol leader, if he is in any doubt, can clear up the situation in his mind by cross-questioning himself. It should never suffice to him that the authority who set him the task veiled his responsibility by general verbiage. The task must be definitely determined; whether negative reports are required or not, and when and where reports are to be sent, more especially when touch has been lost with the squadron. The complete instructions must of course be confided to the second in command of the patrol, and the general task to be fulfilled to each member of it. For the conduct of the patrol it is a matter of still greater importance than for the squadron, which has a certain fighting strength, whether it is acting in its own or in hostile country. It will have the same points to consider as in the case of a squadron, but in hostile country its conduct must be still more circumspect, while in friendly country, where concealment is more easy, its action can be correspondingly bolder. If long distances are to be covered, the patrol should remain on the road until it reaches country where an[Pg 65] encounter with the enemy is likely. The passage through large villages peopled by hostile inhabitants is to be avoided. Horses should not be fed, at least in hostile country, in the neighbourhood of villages or on the main road, but always in a safe place, and a proportion of them only at a time. In friendly country they may best be fed in the larger villages, which the hostile patrols will avoid, but should not halt on the main road. When the locality is reached where a meeting with hostile detachments may be expected, the patrol should advance in bonds successifs. It must, unfortunately, be admitted that such methods appear to be quite foreign to most patrol leaders; at all events, they are seldom applied in man?uvres. Most of them ride forward with praiseworthy speed along the road until they collide with the enemy; then, indeed, they begin to observe him, without asking themselves whether in war the result of such tactics would not have already compromised their chances of success. For if they are once discovered by the enemy they may count on being relentlessly hunted and pursued, so that there will no longer be, in most cases, any further possibility of deliberate observation. Very different indeed are the circumstances when, from a well-chosen point of view, a patrol is successful in detecting the enemy before coming into immediate collision with him. The patrol can then order the whole of its conduct according to its knowledge of the enemy before it is discovered, and has a very much greater prospect of attaining good results. We must lay down here, once and for all, that the distant observation with the glass is by far the most important; it affords the best survey over the general conditions, and a better possibility of sending back a[Pg 66] report safely and quickly. It is just in this method of observation that, in consequence of our peace conditions, patrols are generally so badly trained. Again and again they fall into the error of approaching too close to the enemy and, in order to see as much of him as possible, let him march past them. They are then compelled to send in their reports from places which lie behind the belt of the hostile service of security. The despatch-riders have then to ride from the rear through the hostile advance-guard, outposts, and patrol system. In peace, where there are no bullets, and prisoners may not be made, these methods lead to the best results, and to their being employed again and again, particularly if the superior commanders are inclined to praise such too complete information instead of condemning it. In truth, it is the worst system that could be conceived. Properly speaking, such protracted observation is only possible under certain circumstances; for instance, if the outer flank of the enemy\u0027s advance has been turned, then perhaps there might be a chance of sending reports round the flank of the hostile zone of security. It should, however, be quite inadmissible for a patrol to remain in this manner between the hostile columns of the enemy\u0027s army. Unless it were unusually lucky, it would quickly be detected and captured; more particularly if the inhabitants were hostile. It is quite another matter where a hostile screen has to be broken through. This can generally only be accomplished by fighting; and it is the first duty of the reconnoitring squadron to break through the enemy\u0027s screen. Patrols also, which in such a case have succeeded in getting behind the enemy\u0027s outpost-line, cannot count upon sending back messages as they please. It will only be a question of a rapid offensive through[Pg 67] the screen towards the main body of the enemy. The patrols will then be surrounded, and must at once proceed to effect their return, and only report what they have seen when they have successfully broken back again through the enemy\u0027s screen. Despatch-riders have, in such a case, small prospect of getting through. The less it is possible to observe and report, the more carefully must the points for breaking through be chosen, and attention must therefore be paid to reaching good points of vantage that command a view of places of probable importance. The time chosen for observation is also of great importance. The enemy can best be observed, and his strength and intentions appreciated, when he is on the move. Marches are generally undertaken in the morning, and towards the evening one may expect to find the enemy in quarters. Under such circumstances observation is difficult. The patrol leader must therefore arrange to reach in the morning those points from which he expects to be able to observe the enemy on the march. He will then be obliged in most cases to fall back before the advancing enemy, and will endeavour to ascertain his halting-place and the approximate line taken up by his outposts. If a distant patrol should be successful in obtaining such information it will generally have done as much as is expected of it. It is for the tactical close reconnaissance to send in information as to details. From the distant reconnaissance it is only required to form the foundations on which the Head Quarters can base its decisions. This fact should be borne in mind while reporting on the enemy. These duties can for the rest be only carried out under war conditions and against an enemy who is[Pg 68] working to the same end, if undertaken in a regular and systematic way and with great boldness. The patrol leader, therefore, should generally make his plan in the evening for the following day. It will be desirable for him to study the map very closely, and to impress on his memory the main roads and especially points which appear to be suitable for observation. He can thus obtain an impression of the succession of stages necessary for his advance, and judge how he can best spare his horses without prejudicing the success of the reconnaissance. For a patrol to move en masse without scouts, as unfortunately is often done in peace, is altogether out of the question. In war such conduct must often be paid for by the lives of the patrol and the complete failure of the enterprise. A point must always be sent so far ahead that the patrol will not come under fire at the same time with it. It should never happen that the point collides unexpectedly with the enemy. A rear-guard will also in most cases be found desirable. Circumstances must determine how the flanks can best be protected. Should the patrol be obliged to ride through country where it might be surprised, it will be advisable first to make a halt and to send on scouts. Man?uvres have repeatedly proved that the point is insufficient in such a case. It is in most cases quite inadmissible, especially in hostile country, to divide the patrol and to arrange a meeting-place farther to the front. As there will usually be at most but one map available, the detached party will find themselves in the enemy\u0027s country without means of locating themselves, probably unable to make themselves understood by the inhabitants, and in any case will run the danger of being betrayed by[Pg 69] them. It will not even be of much avail if they are given some kind of sketch if they meet with and are chased by the enemy. I should therefore like to utter a warning against the custom of such division of patrols in peace which could not be carried out in the enemy\u0027s country. In friendly country they are possible, but always dangerous. The various detachments having insufficient fighting strength, the possibility of sending back information will be reduced and a junction will always be doubtful, while any collision with the enemy may make it impossible. There is another error into which patrols frequently fall in peace man?uvres, and that is, of leaving the road assigned to them for observation without sufficient reason, and of using other roads upon which other patrols are working. Even when a patrol has sure indication that it will not meet with the enemy upon the road assigned to it, it should still remain upon this road, and send back definite negative information, even if no instructions to this effect have been received. On collision with the enemy\u0027s patrols, action must be taken in as offensive a spirit as possible, but after due reflection. Should a charge promise any kind of success, the opponent must be attacked in the most determined way. It will also often be possible to defeat an enemy of superior numbers by a carefully laid ambush. Every success of this kind will increase our own moral superiority, paralyse the enemy\u0027s reconnaissance, and facilitate the transmission of information. Before attacking, however, it should always be ascertained whether the enemy is followed by any close support which might turn an initial success into a worse defeat. Thus it does not, for example, promise[Pg 70] success to attack the point of an advancing squadron under the apprehension that it is a single patrol. Making prisoners and carrying them off, or sending them back under escort from the patrol, is to be deprecated. They can generally be rendered harmless by depriving them of their horses, arms, and boots. Good captured horses, however, should be always used, either to replace the tired cattle of the patrol, or lead with it in reserve. Should the patrol meet with a superior force of cavalry, it must endeavour to extricate itself and to get round the enemy\u0027s flank. Under such circumstances the ability to ride quickly and safely across country will be of great service. But it is important, as soon as the patrol is in safety, that it should again reach the road detailed to it, and also that the men should be instructed as to how to avoid the enemy, when carrying messages to the rear, without losing their way. When a patrol has been successful, by judicious riding, determined fighting, and clever avoidance of the enemy, in obtaining information as to the enemy, it is of the utmost importance what information is to be sent back, and when and how it should be sent. As I have already indicated above, the patrol must be perfectly clear as to what facts are most important from the Head Quarters\u0027 point of view. If the opposing armies are still so far apart that a collision cannot be expected, only those matters that are of strategic importance need be ascertained and transmitted: e.g. number of the hostile columns, objective of the day\u0027s march, any circumstances that lend themselves to a conclusion as to alterations in the enemy\u0027s direction of march or the combination of his forces. In such a case there is no need for information as to details. The[Pg 71] closer, however, the opposing armies approach one another, the more does information which is of tactical significance increase in importance. It is not always advisable to confine oneself to reporting the bare facts. It will often be desirable to indicate also the process of reasoning by which the reporting officer arrives at his impression, for this originates from a number of imponderabilia which cannot always be detailed in a report. When this is done, it must be thoroughly and carefully considered how far this personal impression is dependent upon facts, or if it does not rather rest upon certain feelings, as to the cause of which no clear account can be given. Should the latter be the case, the personal point of view is best left out. Preconceived opinions originate but too easily in war, and may lead to a biassed interpretation of reports, and, consequently, to faulty dispositions. The facts must always be weighed with sober impartiality. Only thus can a true and definite appreciation be arrived at. The same naturally holds good for those reports which are sent in from the reconnoitring squadrons or other reporting centres. The method in which such information is sifted for passing on brings into play, in a certain sense, personal conceptions. It is therefore all the more necessary to reflect seriously over their preparation. It is imperative that any important information should reach the Head Quarters of the army or the Great Head Quarters as early as possible, at all events, early enough to allow of the measures rendered necessary by the enemy\u0027s movements to be initiated and carried out. The patrol leader must therefore consider the time requisite for a wheel or other such movement of a modern army in order to calculate what is the latest time, under any circumstances, that[Pg 72] his information must be sent in. It is obvious, and has already been demonstrated, that he should be instructed as to the advance of his own army in order that he may be able to appreciate these matters. As already stated, it will, as a rule, be necessary for a distant patrol only to send in two messages daily. The first contact with the hostile infantry must always be reported. It will generally suffice if the direction of march of the enemy and the march-objective reached by him are reported. It will often be desirable to send back only a single report, setting forth the events of the day. On the other hand, the method of despatch of such messages must be most carefully prepared. During the advance of the patrol the leader must call the attention of his men, more especially from any good look-out points, to any prominent features passed. He must make marks at difficult places, and where the main roads have to be left, to assist them in finding their way back. Reports should only be sent from some point from which the despatch-riders have, at least to a certain degree, a safe route, where they will not have to pass through any hostile outposts, occupied localities, or defiles. It is highly desirable to continually instruct the patrol as to the route to the rear, and as to its conduct under special circumstances, and to give it a sketch of the road. The latter should contain not only names, which will not be of much use to the patrol, but characteristic marks which may be used as points of orientation—forked roads and the like—to assist the men in choosing the right road. Orderlies should be told the general contents of messages which they carry. It is quite out of the question that in war, and especially in hostile country, despatch-riders will be[Pg 73] allowed to ride about free from harm, as they are unfortunately allowed to do in peace. The endeavour to send many, and often superfluous, messages by a few men always eventually leads to the sending of single horsemen as despatch-riders. Such a custom, which in war must lead to disastrous consequences, cannot be too sharply reproved. Single orderlies, in hostile country, cannot be sent, except where they know the district, and where collision with the enemy\u0027s patrols is out of the question. When long distances have to be covered, there is also the danger that a horse may succumb, or that the inhabitants may stop the man. The fact that, in the Franco-Prussian War, the custom of sending single despatch-riders proved itself generally, if not entirely, sufficient must not be regarded as of great significance, as at that time there was no question of having to reckon with the opposition of hostile cavalry. In a modern war it will certainly be different, and we may be quite sure that the cavalry of each army will strive its utmost not only to reconnoitre, but also to prevent the enemy reconnoitring. The distances to be covered, also, will be very different from those of 1870-71. The single despatch-rider, therefore, especially in the case of the distant patrol, must be replaced by a reporting patrol. This can best be formed of three men, who can mutually support each other, and, should they meet with the enemy, have more chance of escape than a single horseman. For very important information, and against strong opposition, several such patrols must be sent by different routes. In friendly country, where the population will give all possible support, the single despatch-rider can, for short distances, be more often used, and the report[Pg 74]ing patrols can be made weaker according to circumstances. These circumstances must determine, as we have seen, the strength of patrols, and the time which they can stay out without relief. Patrols must choose their accommodation for the night with great care. It is obvious that for them, as for the reconnoitring squadrons, it is of great importance whether they are in their own or hostile country. In their own country it will often be safer to seek shelter for the night in the larger villages, because such places will, as a rule, be avoided by hostile troops. It is, however, not only a question of safety, but also of keeping the road confided to them in sight during the night, and of interrupting the transmission of the enemy\u0027s intelligence, which will, like our own, be most active after dark. His despatch-riders, however, will most probably endeavour to avoid villages. For the rest, patrols in their own country can choose their accommodation freely according to the situation, and can at least always get under cover, even when in the neighbourhood of the enemy. In hostile country, however, the conditions are different. Isolated and far distant from support, the patrols run great danger, even from the inhabitants themselves, and should never try to spend the night in enclosed villages or farms. If they wish to get cover for the night, they must look for single houses close to the road, and take measures that the inhabitants do not betray them to any of the enemy\u0027s troops or to partisans that may be in the neighbourhood. They must also be careful to keep a good look-out and be ready to get away at a moment\u0027s notice. They should not, however, as long as it is possible, lose sight of the[Pg 75] road detailed to them until absolutely forced to, but should watch it by an advanced post in order to interrupt the enemy\u0027s transmission service. When in the presence of the enemy, it will be advisable not to seek shelter, but to spend the night in woods, or at all events distant from localities where forage or food has been requisitioned. Horses may then be off-saddled and fed, singly or by groups, according to circumstances. Special measures of safety are also necessary under such circumstances. It is of great importance to establish communication with the reconnoitring squadron during the night halt and to adhere closely, when it is at all possible, to any arrangements made with it. It may very easily happen, as we have seen, that the task of the reconnoitring squadron may be changed, and that it may be required to operate in new directions. It is, therefore, important that the patrols do not get lost to the squadron, but are in a position to receive fresh instructions. The patrols can also utilise this opportunity for receiving reinforcements if necessary. The patrol may sometimes lose connection with the squadron; it will then be generally most advisable for it to remain in observation of that portion of the enemy which has been found upon the road allotted to it. If this should entail a change of direction, reports should be sent direct to that portion of the army which is assumed to be the nearest according to the general situation. This must not, however, be regarded as a hard-and-fast rule. It should rather be left to the independent decision of the officer how he will act in the particular case. Independence of judgment and of character is of the highest importance, especially when on patrol. These qualities can, however, only be effective if cavalry officers are instructed as to the[Pg 76] conditions of modern armies and are quite clear in theory as to the duties and methods of conducting patrols. It is to be hoped that they will in future realise the obligation of applying themselves most seriously to this branch of their important duties, that they may be thoroughly prepared and capable of the greatest effort when the call to arms resounds in bloody earnest through the land. 4. Close Reconnaissance and Reconnaissance during the Fight Within certain limits determined by the various crises of the fight the reconnoitring duties of the cavalry are continuous. As the hostile armies approach one another, distant exploration merges into close reconnaissance, and from the latter evolves the battle reconnaissance, when the heavily-charged thunder-clouds of war come into collision, and the brazen dice of battle are thrown. Within these limits the arrangements made for reconnaissance should not require fresh dispositions, but merely supplementing as they gradually develop from strategical into tactical measures. This is a matter for consideration when detailing close patrols, as the tendency is to be too prodigal of the scanty force at disposal. When the army cavalry concentrates towards the flank of the army, the detachments of it which have been carrying out the reconnaissance against the enemy\u0027s front must be gradually relieved by the divisional cavalry. The army cavalry will only be able to assist the divisional cavalry in the close reconnaissance by the action of those portions of it which may fall back behind the front of their own army. In such a case all should be placed under[Pg 77] a single command, to prevent useless expenditure of force and contradictory orders. Whether the divisional cavalry is to be reinforced by the army cavalry or vice versa, or whether a separate sphere of action is to be assigned to each, must depend on circumstances. It will, however, seldom happen that the army cavalry will fall back behind the front of its own army. It will nearly always be most advantageously placed on the flank of the army, and will therefore only have to carry out such reconnaissance as is possible from this position. Such reconnaissance, however, is generally the most important. As already indicated, the reconnoitring squadrons will gradually fall back upon the army cavalry itself, or upon the advancing columns of the main army which will now be approaching them. The reconnoitring squadrons on the outer flank will, however, be well advised not to join themselves at once to the main body of the cavalry. They must rather seek to operate against the rear of the enemy, who is already deployed, or against his lines of advance, in order to be able to report the presence of any approaching hostile reserves as early as possible. As a single example of this, had the French at Mars la Tour acted in this manner they would very soon have discovered the approach of Wedel\u0027s Brigade and its approximate strength. They would not then have been surprised by the attack of this brigade nor would they have mistaken it for the advance-guard of the Third Army. One may well assume that after dealing with Wedel\u0027s Brigade the French would, under such circumstances, have proceeded to undertake a general offensive, and that the fortunes of the day might have been with them. [Pg 78] The close reconnaissance before the decisive battle must seek, above all things, to obtain an idea of the grouping of the hostile forces. Herein lie the conditions of success or failure. To this end endeavours must be made to get far round the front of the enemy and to observe as many lines of approach as possible. Rapid and distant patrol riding and the straining of every nerve must be demanded in such cases. When the whole force is to be employed, the army cavalry must endeavour to pave the way for these patrols. If it has been possible to defeat the hostile cavalry before the decisive battle, this will be comparatively easy. Otherwise, every means must now be employed to bring about this decision and to carry it to a successful conclusion, as well as to deal with other troops which may seek to cover the enemy\u0027s flanks. That the position of the army cavalry for such duties should not be in rear of a flank of its own army need scarcely be emphasised. It should rather strive with all energy to échelon itself in advance of the wing of its own army and to maintain itself on the enemy\u0027s flank. It will thus be in a position during the period of close reconnaissance to support its own reconnoitring organs and either to join the battle, or operate against the flanks and rear of the enemy.[Pg 79][8] As to the close reconnaissance patrols and the combat patrols, as clear and definite orders must be given them as to the distant patrols to operate in certain particular directions or block certain roads. The arrangements for their return or relief must leave no room for doubt if it is desired to be independent of the discretion of the patrol leader, and to be convinced that the observation in all important directions is being carried out. It will often be necessary, especially during the period of close reconnaissance in flank or rear of the enemy, to make the patrols strong enough to be able to fight their own way, for it will generally be impossible to support them from the rear. Should it be found impossible otherwise to break through the thick screen of the hostile service of security, whole squadrons may operate as patrols, and must exert all their endurance and speed to attain their object. When a decision is impending, it is of the greatest importance that the service of transmission should be especially swift and sure, for there will be but little time available in which to make fresh arrangements to meet any newly ascertained movement on the part of the enemy. It will be necessary under such circumstances to supply even patrols with the light-signal apparatus, even though there is a danger that these may be lost. If they are able somewhere from the rear of the hostile army to flash back an important message in time for it to be of use they will fully have answered their purpose. It will of course be impossible under such circumstances to establish permanent stations. Before the departure of a patrol the men must be carefully instructed as to the point that will[Pg 80] most probably be chosen as a receiving centre, and must make a mental note of its position on the ground, and also of those places from which it is hoped to send back intelligence. They must endeavour to escape the enemy\u0027s notice and to avoid his pursuit. When necessary, they must be prepared to fight for possession of that point from which they expect to be able to transmit reports. That any intelligence transmitted by signal must also be sent to the rear by a reporting patrol, goes without saying. In such situations the activity of the cavalry must be increased to the utmost, and their action characterised by feverish energy. The last drop of blood and the latest breath of man and horse must be devoted to fulfilling the task of reconnaissance. It is obvious that in such periods of crisis cavalry cannot go into quarters for the night, whether in friendly or hostile country. It will be best for them to remain concealed in woods, where they will, as a rule, be discovered with difficulty. For the rest, the night is the time which will generally be used for transmitting reports. In friendly country the assistance of the inhabitants must be used for this purpose as much as possible. The enemy must continually find himself moving in the close meshes of a net of hostile enterprise. In hostile country it will be necessary to requisition supplies by force, but this should never be done in the area in which observation is required. Where requisitions have been made in the neighbourhood of the enemy, patrols should quickly move away, in order not to be surprised, as Count Zeppelin was in the Schirlenhof, before the battle of W?rth.[9] For the reconnaissance on the battlefield itself—in contradistinction to the energetic action in the flanks and rear of the enemy—officers provided with good glasses must be employed. The scissors telescope, which no higher cavalry leader should be without, should also be used for this purpose. Observation should be made, when possible, from some secure place, and endeavours made to recognise the moment for action and intervention in the battle. Observation carried out by patrols from the front during the battle of the measures taken by the enemy is unpractical and only possible in peace, and is a procedure that is the outcome of the requirements of leaders lacking in determination, who wish to be continually informed down to the smallest details about the enemy, instead of trusting with self-confidence to the compelling force of their own measures. Patrol service during the battle itself is a matter for the infantry, and can be carried out by no other troops. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2783/77116.html","bookId":1309,"book":{"id":1309,"title":"Cavalry - A Popular Edition of \"Cavalry in War and Peace\"","description":"简介： General von Bernhardi is best known in England as a writer of the Jingo School which has done so much to produce the war, but this is only one side of his literary activity. He is also a writer of recognised ability on the theory and practice of mode...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2783","creation":"Aug 1, 2019 12:24:50 AM","modification":"Aug 1, 2019 12:24:50 AM"}}
