{"id":39941,"no":7,"title":"II. RECONNAISSANCE BY THE DIVISIONAL CAVALRY","content":"Generally speaking, the conduct of the various reconnoitring organs of the divisional cavalry will be regulated according to the same principles as hold good for the army cavalry. As for the latter, so is it a matter of great importance for the divisional cavalry whether it is acting in friendly or in hostile country. Its methods, too, must be regulated according to its distance from the enemy. It will also endeavour to establish a material and moral superiority over the hostile cavalry. In its relative weakness, however, and its distribution to the columns of the army there must lie certain factors which will leave their stamp upon the conduct of the divisional cavalry. First of all it is important what part the division to which the cavalry belongs plays in the general scheme. Various cases can be conceived which may have no inconsiderable influence on the character of the reconnaissance which the divisional cavalry must carry out. It may belong to a column which is advancing between others, and where it has but a comparatively small front for reconnaissance allotted to it. The army cavalry may be in front of it. Or it may be given the task of carrying out the frontal reconnaissance independently. The latter case must be considered the most usual in a great army, when the concentration of the army cavalry in the decisive direction takes place. Or again, it may belong to the flank column of an advancing army, which may or may not be covered by the army cavalry. Finally, it may be part of an independently operating, more or less detached force, and have to perform all the cavalry duties for it. In the last case it will generally be advisable to strengthen it, if possible, from the army[Pg 83] cavalry; but in any case its methods will necessarily be of a different kind. The most simple case is where the front upon which the divisional cavalry finds itself is covered by the army cavalry. It is then most important to keep up communication with, and to be continually informed of the intentions of the army cavalry, in order that the duties of reconnaissance may be taken over whenever the army cavalry is compelled to clear the front by a flank movement or to uncover the flank. The reconnoitring organs of the divisional cavalry must then be sent forward early enough to effect a relief of the corresponding detachments of the army cavalry, so that the service of observation of the enemy in the first line will not be interrupted. Where the divisional cavalry cannot rely upon the army cavalry for assistance in reconnaissance the conditions are different. This leads to the question of the strategical exploration. These duties—in contradistinction to those of the army cavalry—will be distinguished by the fact that the divisional cavalry cannot advance as an independent unit separated from the mass of infantry, but must remain in continual conjunction with the detachments of the other arms to which it belongs. It is, on the one hand, too weak to be able to operate independently, and, on the other, is bound to the column of the other arms by ties of local service, which at any moment may make fresh demands upon it. It will therefore not be denied that the divisional cavalry, if it would reconnoitre, must cleave to the infantry. Its method of procedure will rather be to advance from point to point with those portions of its strength which can be spared from the local service of the division. In so doing, it must arrange for[Pg 84] support in case of necessity during the fight from the rear, and can rest at night covered by the infantry outposts without being compelled to march to the rear. To take its own measures for security would make too great demand upon its strength, and would quickly deplete it. Only when the distance from the enemy renders an attack out of the question can the divisional cavalry remain in advanced positions. This consideration, also, must have its due influence on the method of advance adopted. The advance by stages from one point of vantage to another, according to the map, or from one defensible locality to another, will be found advisable. The divisional cavalry, like the reconnoitring squadrons, should always be surrounded by a close screen of local patrols, which will ensure its immediate safety and concealment. In this lack of freedom in the conduct of the divisional cavalry two facts become apparent. Firstly, that only in very rare cases will the divisional cavalry be able to clear the way for its patrols, as the army cavalry will continually have to do. It is generally, indeed, too weak to fight independently with any prospect of success. It is also, as we have seen, locally dependent, and cannot advance with full freedom even where hindrances to the reconnaissance demand its intervention. Secondly, only in exceptional cases will it be feasible for the divisional cavalry to immediately support its patrols by reconnoitring squadrons. If the army corps is marching in two columns, the cavalry of each is obviously too weak to push forward squadrons of this kind perhaps several days\u0027 march ahead, and, when necessary, to provide for their relief. Somewhat different are the conditions of the[Pg 85] advance of a corps upon one road. If it is accompanied by columns on each side, it will generally be possible to mass the greater part of the cavalry of both divisions at the head of the corps, and it will then at times be possible to push forward a reconnoitring squadron. In the case of a flank column, however, the cavalry of the rear division will generally be occupied with securing the flank, and will therefore not usually be available for reinforcing the reconnoitring cavalry in front. The divisional cavalry will thus usually be able to detail only weak patrols for the distant reconnaissance, and these will often have to reckon with superior hostile cavalry. At least the conditions which obtain in the army of our probable opponents compel us to make these presumptions. The reconnoitring patrols of the divisional cavalry must therefore rely chiefly on cunning and speed in carrying out their duty, and will only be able to attack under especially favourable circumstances, where the enemy whom they meet has no support behind him, or can be attacked with obvious advantage. It is far more important for them than for the patrols of the army cavalry to gain contact with the enemy unsuspected, and not to betray their presence. They must always try first to get distant observation of the enemy, as they will have no fighting support behind them to help them to break through the hostile screen of patrols and win their way to the head of the enemy\u0027s columns. Their reports, also, will have to be brought back through the enemy\u0027s cavalry. The distant patrols of the divisional cavalry will therefore often be obliged, even in their advance, to avoid the main avenues of approach of the enemy, as upon them the enemy\u0027s cavalry is certain to be met[Pg 86] with. They must use secondary roads, and as secretly as possible, a matter of considerable difficulty in unknown hostile country. To avoid possible ambush they should retire by a different road from that by which they advanced. They will very rarely be able to get under cover for the night, especially when in the enemy\u0027s country. Such duties can only be successfully carried out, if at all, where the commander has at his disposal a number of efficient officers and under-officers, and horses trained to endurance and cross-country work. In order to be able to carry out their task properly, the men must be clever, determined horsemen, well trained in the use of their weapons and resourceful. They must also be absolutely reliable men, who will not shrink from encountering odds when necessary. In such patrols as these the cavalry spirit must be developed to its utmost. It is a somewhat easier matter if the divisional cavalry is not confined to a purely frontal and limited area, but can reconnoitre from the head of a flank column. It will then get opportunities of obtaining observation by moving round the enemy\u0027s outer flank. It will, however, only succeed in obtaining and transmitting intelligence by wide détours, and the demands on the endurance of man and horse will be great in proportion. It is obvious how necessary it will be, under such circumstances, that the intelligence so hardly won should at least be transmitted quickly and safely. Some detachment must therefore be detailed to perform the duties of the reporting or communicating station usually formed by a reconnoitring squadron. I see nothing for it but to devote bodies of cyclists to this purpose, which can be pushed forward as reporting centres on the main avenues, and[Pg 87] equipped, whenever possible, with the light-signal apparatus. A few mounted men must be sent with them for scouting purposes. Without these, they would be confined to the roads for the close reconnaissance of the surrounding country, a procedure which would not suffice in the face of a determined enemy, especially in difficult country. Besides the distant reconnaissance, the close reconnaissance along by far the greater part of the front of the army falls to the lot of the divisional cavalry. As we have seen, the army cavalry will only in exceptional cases be able to support it in this task as, on the near approach of the enemy, it will probably have occasion to draw off to a flank. But nowadays this close reconnaissance appears, by reason of the increased distances and the greater range of firearms, to have become considerably more difficult. Hostile armies move to battle nowadays on a front of 50 to 100 miles. That it has naturally become much more difficult under such circumstances to estimate the enemy\u0027s strength and to obtain the necessary knowledge of his dispositions and of the ground, no further proof is needed. It thus becomes possible for the cavalryman in general to get no closer to the enemy than his rifle will carry, and to be compelled to observe him from a distance. There should be no mistake about this. The importance of observation has grown in proportion to its difficulty. Troops nowadays have to be deployed for the fight at long ranges, where it is practically out of the question that a commander will be able to survey the enemy and the country with his own eyes, as was formerly almost invariably the case. Should, for example, the opponents be advancing to[Pg 88]wards each other and still 5 miles apart, another 1? miles will bring them into effective artillery range of each other. If they are going to wait to deploy until they reach this point, the deployment will have to be completed under the fire of the enemy\u0027s guns, a thing which, of all others, is to be avoided. It therefore follows that in a battle of encounter deployment should take place, at the latest, when still 5 miles distant from the enemy. It is better to begin to draw the forces apart even earlier, so that the army is already deployed when it moves into the range of the enemy\u0027s shrapnel. Under these circumstances it will usually be quite impossible for the leader to make his dispositions according to his personal observations. He is, rather, almost entirely dependent in his appreciation of the enemy on the reconnaissance of the cavalry, and may find himself at a great disadvantage if this should fail or lead him to erroneous conclusions. Reports as to the character of the country, suitable positions for artillery, decisive localities or points, thus increase greatly in importance, and it is obviously most necessary for cavalry officers to be able judiciously to appreciate such matters and to report them clearly and intelligibly. The tactical conduct, and at the same time tactical success, will often be as dependent on the tactical reconnaissance of the divisional cavalry as the strategical measures of the commander-in-chief are upon the results of the strategical exploration of the army cavalry. Tactically and strategically the service of the divisional cavalry is of equal importance if it belongs to a force operating independently. In such cases it will often be obliged to move with more freedom than when employed in purely frontal reconnaissance[Pg 89] with the main army. For rest, also, it will not always be able to seek the protection of the infantry, but will frequently have to be pushed out for the night on the flanks, in order to secure the main body while at rest from these directions, or the better to observe the enemy. It should, however, never lose its immediate connection with its force, and will therefore not always be in a position to measure its strength with any hostile cavalry that may be met during the period of reconnaissance. When the tactical decision is in prospect, or when contact has been gained between the opposing forces, the divisional cavalry must redouble its efforts in reconnaissance. It is then a matter for it to reconnoitre from the flanks, and such reconnaissance can only be successful, as in the case of the army cavalry, if those portions of the country are occupied from which it is possible to observe the movements and dispositions of the enemy. It is quite wrong to hang on the flank of the infantry, as is unfortunately often done in peace man?uvres, and to remain wherever possible under its protection, and to expect to force reconnaissance merely by sending out a number of patrols. In such a situation patrols have generally small prospect of success. They will most frequently come in contact with the hostile screen, which will prevent them gaining the decisive points of the terrain, and can hinder the despatch-riders but too easily from finding their way to the rear. It is more than questionable under such circumstances whether it will be possible to gain any observation at all, or to send back information in time to be of use. In these moments of crisis, which will be of comparatively short duration, rude force can alone avail, and recourse must be had[Pg 90] to the sword. The artillery patrols, too, will only find it possible to reconnoitre successfully under the wing of a victorious cavalry. Their efforts will otherwise have little prospect of success. Speaking generally, the reconnaissance must remain entirely in the hands of the cavalry leader who arranges it. Should the commander-in-chief interfere without due cause in his dispositions, he deprives him of responsibility and interrupts that systematic conduct of the reconnaissance which is absolutely essential if the strength of the divisional cavalry is to be equal to its task. Reports, too, should, as a general rule, be sent to that unit of the cavalry from which the patrol is found, and which forms the reporting centre of the patrol. On the other hand, it is the duty of the cavalry leader to remain in communication with the Supreme Command by using all means at his disposal, even relays when necessary, so that all reports may reach the latter by the shortest route. Only exceptionally should patrols report direct to the Supreme Command, that is to say, when to send their messages through their own cavalry means a useless détour or a danger. This particular method can, however, only be carried out in practice if the patrol is in continual communication with the cavalry from which it is found. This circumstance indicates also the necessity for detachments that are not limited in their zone of operation to advance during the fight against the enemy\u0027s flank, so that they may remain as close as possible behind their own patrols, continually prepared to support them and to hamper the hostile efforts at reconnaissance. It does not appear advisable under such circum[Pg 91]stances to unite all the available cavalry on one wing. It is certainly obvious that its main strength must be concentrated in what is considered the decisive direction, in order that it may be as strong as possible on the field of battle. This desire, however, should not go so far as to denude one flank wholly of cavalry. This flank would then be completely laid bare to the enemy\u0027s observation, and would itself be deprived of the possibility of ascertaining what was going on on the enemy\u0027s side. It is much more advisable to provide upon each flank a centre of reconnaissance, even if such consists of quite a weak detachment of cavalry, which will act as a reserve for patrols and a reporting centre. The offensive cannot, of course, be undertaken on the flank where the cavalry is weak, but reconnaissance must be carried out by patrols of scouts, and other action limited generally to keeping the enemy\u0027s patrols at a distance.","sourceLink":"http://novel.tingroom.com/duanpian/2783/77117.html","bookId":1309,"book":{"id":1309,"title":"Cavalry - A Popular Edition of \"Cavalry in War and Peace\"","description":"简介： General von Bernhardi is best known in England as a writer of the Jingo School which has done so much to produce the war, but this is only one side of his literary activity. He is also a writer of recognised ability on the theory and practice of mode...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2783","creation":"Aug 1, 2019 12:24:50 AM","modification":"Aug 1, 2019 12:24:50 AM"}}
