{"id":41584,"no":15,"title":"CHAPTER 16","content":"The apartment in the Flag Tower to which Carey Grey was conducted by Chancellor von Ritter was at the top of two flights of winding stone stairs, and the barred windows of its four rooms commanded a view of varied and picturesque loveliness. In the foreground were the Palace gardens, with their series of descending terraces, their fountains and statuary, their parterres of gay flowers, their gracefully curving driveways and gravelled walks, and their wonderful old trees of every shade of green leafage. Beyond the gardens were the red and grey roofs, the spires and steeples and domes and turrets of the city, divided by the sparkling silver-white waters of the rushing river, and beyond these stretched the fertile valley checkered with fields of ripening grain—yellow and orange and russet—and olive patches of woodland, and dotted with farm houses and cottages and barns and hayricks. \\n\\n \\n\\n 236 The rooms, themselves, were somewhat sombre. There was a small library, panelled and finished in black oak; a salon, long and high, with much tarnished gilt ornamentation and red upholstery; a tiny bare dressing-room, and a bedchamber with a great canopied bedstead, beside which stood a quaintly carved prie-dieu. \\n\\n \\n\\n “Your Royal Highness will, I trust, be comfortable here,” said the Chancellor, when he had walked with Grey from one room to another and the two were standing together in the long salon. \\n\\n \\n\\n The American hesitated a moment before replying. He was revolving mentally several alternatives of action. It was his duty, he knew, not to let this farce proceed further; and yet he had thus far learned absolutely nothing. \\n\\n \\n\\n “I shall,” he said, at length, “be quite comfortable.” \\n\\n \\n\\n “If there is anything your Royal Highness desires,” continued the Chancellor, “you have but to make it known.” \\n\\n \\n\\n The invitation arrested the whirl of indecision and settled the course of procedure. \\n\\n \\n\\n “If you will be so good as to answer me a few237 questions, Count,” Grey began, “I shall be indebted. Won’t you sit down?” \\n\\n \\n\\n Count von Ritter found a place for his angular length upon a settee beside a pedestalled bust of King Oswald the First, and Grey sank into a chair near by. \\n\\n \\n\\n “I am entirely at your Royal Highness’s disposal,” the Chancellor avowed, amiably; and the American, not without some trepidation, it must be confessed, began: \\n\\n \\n\\n “You understand, of course, that events in my career have followed one another in the most rapid succession during the past few months; and regarding some of the most important details I am entirely uninformed. You will be surprised, perhaps, to learn, for instance, that I do not know with any degree of definiteness how my identity was established. Herr Schlippenbach was my discoverer, of course, but with whom did he consult here and by what means was it made clear that I am really the abducted heir of the Budavian crown?” \\n\\n \\n\\n Count von Ritter listened to the question with growing suspicion. Here were, perhaps, the first238 indications of that insanity of which Lindenwald had spoken. \\n\\n \\n\\n “It does seem hardly possible, your Royal Highness,” he replied, “that on such a vital matter you should have been left in ignorance. It was, I think, nearly a year ago that the first communication from the Herr Doctor Schlippenbach was brought to me by Herr Professor Trent.” \\n\\n \\n\\n “And who is Herr Professor Trent?” Grey asked, quickly. \\n\\n \\n\\n “The Herr Professor,” answered the Chancellor, “is the head of the University of Kürschdorf.” \\n\\n \\n\\n “And his reputation is, of course, beyond reproach, eh?” \\n\\n \\n\\n “Quite beyond reproach, your Royal Highness.” \\n\\n \\n\\n “And what steps followed?” Grey pursued, inquisitorially, crossing his legs and leaning back in his chair. \\n\\n \\n\\n “I took up the matter personally,” the Count responded, with frankness. “I entered into correspondence with Schlippenbach at once, and after some months of writing back and forth he placed239 before me a very circumstantial story, which he afterward confirmed with documentary evidence—old letters, photographs, affidavits.” \\n\\n \\n\\n “And then?” \\n\\n \\n\\n “When I had thoroughly assured myself of the authenticity of all he claimed, I brought the subject to the attention of the Privy Council, and eventually it was laid before His Majesty. In the meantime the Budavian Minister at Washington had been investigating, and the Budavian Consul at New York as well. But all that, of course, you know.” \\n\\n \\n\\n Grey nodded, dissembling. He was studying Count von Ritter as he spoke; noting every accent, every inflection, every expression, in an endeavour to decide whether he were innocent or guilty. Thus far he had been inclined to regard him as honest. It hardly seemed possible that one occupying his position could stoop to such chicanery. And the head of the university appeared likewise as too impregnably placed to be open to suspicion. The Budavian Minister and the Budavian Consul, however, he concluded could not be guiltless. \\n\\n \\n\\n “And how did Captain Lindenwald chance to240 be chosen to meet me on my arrival in England?” he asked. \\n\\n \\n\\n “Captain Lindenwald,” answered the Chancellor, “is an officer of the Royal household—he was the late King’s equerry—and he is, moreover, the brother of our Minister to the United States.” \\n\\n \\n\\n Grey smiled in spite of himself. Of Lindenwald’s complicity he had had no doubt from the first. The fact that the Budavian Minister at Washington was his brother made it all the more probable that that dignitary was also criminally involved. \\n\\n \\n\\n “Now, just one more matter, Count,” the American continued. “Can you tell me anything of this Baron von Einhard?” \\n\\n \\n\\n The Chancellor shrugged his square shoulders. \\n\\n \\n\\n “The Baron is a supporter of Prince Hugo,” he answered. \\n\\n \\n\\n “That much I know,” Grey returned. “And in his loyalty to his leader he is apt to be unscrupulous to the Prince’s opponents?” \\n\\n \\n\\n Count von Ritter smiled a trifle cynically. \\n\\n \\n\\n “I have been led to understand so,” he answered. \\n\\n \\n\\n 241 “He would pay well, I suppose, to get Prince Max out of the way just at this juncture? Is it not so?” \\n\\n \\n\\n “The price asked would probably not deter him.” \\n\\n \\n\\n “And Captain Lindenwald—But no, of course not. It is silly of me to suggest such a possibility. You are satisfied of that officer’s fealty, I am sure?” \\n\\n \\n\\n The Chancellor straightened in his seat and leaned forward with an exhibition of concern that had hitherto been lacking. \\n\\n \\n\\n “You do not make yourself altogether clear, your Royal Highness,” he ventured. “Am I to understand that you have reason to suspect that Captain Lindenwald and the Baron von Einhard are——” \\n\\n \\n\\n “Pardon me,” interrupted Grey, pleased nevertheless at the awakened interest of the Chancellor, “I did not say so. I merely asked a question. You are satisfied of Captain Lindenwald’s entire honesty and loyalty, are you not?” \\n\\n \\n\\n “The Captain,” von Ritter replied, guardedly, “has not been as eager as I could have wished at times, but I have never regarded him as venal.” \\n\\n \\n\\n 242 “Then his explanation of why he left me in Paris, without so much as a word as to his going, and why that night an attempt was made to abduct me by persons in the employ of Baron von Einhard—I suppose he has made such an explanation—was entirely satisfactory to you?” \\n\\n \\n\\n Grey sprung the question suddenly and noted scrutinisingly the effect. \\n\\n \\n\\n The Chancellor’s usually immobile features gave perceptible token of his surprise. His bushy brows raised the merest trifle, and his keen black eyes widened. \\n\\n \\n\\n “His story was, I must confess, not altogether satisfactory, your Royal Highness,” he answered, quietly; “it was, I may say, lacking in detail.” \\n\\n \\n\\n “I would suggest,” continued Grey, in a tone equally repressed, “that you question him in the line I have indicated.” \\n\\n \\n\\n The Chancellor bowed. \\n\\n \\n\\n “I have to thank you,” he said, gravely. “I shall do so. That is very certain.” \\n\\n \\n\\n Grey arose and Count von Ritter got to his feet instantly. The American stood for a moment in indecision, very tall, very erect. There was no243 denying that he looked every inch the Prince. Whether to declare that he was not he hurriedly debated. Meanwhile the Chancellor was still striving to detect the madness of which Lindenwald had spoken. To each question he had given the most searching mental scrutiny; to each gesture, to each intonation he had paid the closest heed, but he had discovered practically no indication of the malady charged. With Grey’s next utterance, however, all the fabric of his assurance fell crumbling. \\n\\n \\n\\n “Count von Ritter,” he said—he had been for a moment gazing out through the window at the varied landscape now dimming with the dusk, but as he spoke he turned and faced the Chancellor—“Count von Ritter, I can delay no longer in confiding to you a matter so grave that I scarcely know how to frame it in words. May I ask you to again be seated?” And he waved his hand towards the settee from which the Count had risen. \\n\\n \\n\\n The Chancellor seated himself without speaking, and Grey resumed his place in the chair near him. \\n\\n \\n\\n 244 “The reason I have asked you what I have,” continued he, speaking slowly and with more than his usual deliberation, “is that I have been—I was about to say astounded, but that is too weak a word—I have been stunned and dumfounded by the proved credulity of a nation which has the reputation, next to Russia, of possessing the most astute diplomats in all Europe. That a government so fortified could be tricked into placing its sceptre in the hands of an American citizen, whose ancestry shows no trace of Budavian blood and whose antecedents are an open book, seems out of all reason; and yet it is precisely what you and your confrères, Count, have, as is now conclusively evidenced, been led into.” \\n\\n \\n\\n Upon the Chancellor’s face was an expression which Grey could not fathom. He was neither startled nor incensed. There was, indeed, just the faintest suspicion of amusement in his keen black eyes, mingled with a spirit of kindly indulgence. \\n\\n \\n\\n “You mean,” he said, quietly, “that you are not the heir?” \\n\\n \\n\\n “Most assuredly,” Grey answered, in amazement245 at his companion’s inscrutable manner, “I am no more the Prince of Kronfeld than I am the Prince of Wales. I am Carey Grey, of New York, an American born and bred, who was drugged, hypnotised, mesmerised or what you please; made unknowingly to commit a theft, made unknowingly to cross the Atlantic, to travel under a false name, to attempt to usurp a title and a throne.” \\n\\n \\n\\n Count von Ritter’s foot tapped the floor nervously. He laced his long, knotted fingers and unlaced them again. \\n\\n \\n\\n “This is a very grave matter,” he said, his voice low and steady, “and I shall lose no time in looking into it. As you say, such a thing would appear beyond the bounds of reason. Your Royal High—I beg your pardon! Mr. Grey, did I understand?” And there was a humouring leniency, not to say pity, in his tone—“you can imagine how much this statement of yours at this late hour will involve in the way of complications.” \\n\\n \\n\\n “That you were not enlightened earlier, Count,” Grey continued, “was due to my desire to learn just how far the conspiracy had been carried.246 As a matter of fact, until I reached Anslingen this afternoon I had no positive assurance that the affair had gone further than Herr Schlippenbach and Captain Lindenwald. Of their intentions I was well satisfied, but concerning the chances for the ultimate success of their plans I was in the dark.” \\n\\n \\n\\n Again the two men stood up. \\n\\n \\n\\n “And now,” said the Chancellor, “as to dinner. A state banquet has been prepared at which your—pardon me!—at which His Royal Highness was to have presided. Under the circumstances, however, I presume you would prefer not to attend. If I may be permitted,” he added, tactfully, “I will explain that His Royal Highness is indisposed.” \\n\\n \\n\\n “Thank you,” Grey acquiesced, cheerily; “that’s the better course—the only course, in fact. Unless you can yourself join me—and I suppose that is impossible—I’ll dine alone here. And afterward I should like a conveyance to the Hotel K?nigin Anna. I have some friends there that I must see this evening.” \\n\\n \\n\\n The Chancellor bowed. The next moment he247 was gone, and Grey crossed to the open window and stood for a long while lost in thought. Meanwhile the gloom deepened over the valley and the room behind him grew dark. \\n\\n \\n\\n He was awakened from his reverie by a rapping on the door, and in response to his permission to enter Johann came in, followed by porters with his luggage. Then the candles were lighted, and a little later his dinner was served. \\n\\n \\n\\n Afterward he got into his evening clothes, and when he was quite ready he sent Johann to see if the carriage he had ordered was in waiting. But the boy returned with dismay mantling his usually placid features. \\n\\n \\n\\n “The carriage is not coming, your Royal Highness,” he said, with an accent of apology, as though the fault was his. \\n\\n \\n\\n “Not coming?” Grey repeated in astonishment. “Why is it not coming?” \\n\\n \\n\\n “None has been ordered, your Royal Highness.” \\n\\n \\n\\n “Then order one at once.” \\n\\n \\n\\n “I tried to, your Royal Highness; but I was not permitted.” \\n\\n \\n\\n 248 Grey’s customary calmness gave way to palpable irritation. \\n\\n \\n\\n “What the devil do you mean?” he asked. “Am I a prisoner here?” \\n\\n \\n\\n Johann’s distress increased. \\n\\n \\n\\n “It is not I, your Royal Highness, on whom the blame lies. Outside this door is a guard. He will not let me pass. He will not let your Royal Highness pass. He has orders.” \\n\\n \\n\\n The American strode angrily towards the door. \\n\\n \\n\\n “We will see,” he said, determinedly. \\n\\n \\n\\n Outside a soldier was standing. \\n\\n \\n\\n “What does this mean?” he asked, in as repressed a tone as he could muster. “Why will you not let my man do as I bid him?” \\n\\n \\n\\n The sentry saluted respectfully. \\n\\n \\n\\n “I have been ordered by my commanding officer, your Royal Highness,” he answered. \\n\\n \\n\\n “Ordered to what?” cried Grey. \\n\\n \\n\\n “Ordered, your Royal Highness, to permit no one to leave the Flag Tower.” \\n\\n \\n\\n And he saluted again. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1820/52844.html","bookId":1037,"book":{"id":1037,"title":"A Prince to Order","description":"简介： Greys awakening was as gradual as a clouded dawn. For a time dreams and realities intermingled. Then slowly a partial consciousness of his physical being obtruded: his fingers were clutching a silken coverlet; he turned on his side and the linen pill...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1820","creation":"Aug 1, 2019 12:24:13 AM","modification":"Aug 1, 2019 12:24:13 AM"}}
