{"id":66305,"no":19,"title":"Page 19","content":"“I know, but the stars, so many stars, I can’t stop looking at the sky. I have not seen stars for three months! I forgot about stars.”\n “You are going to have to do better than that,” Sofya said. “‘I forgot about stars’! People will think you’ve been entombed for a season.”\n Sofya was a good traveling companion, in spite of her ill temper. Half the talking she had ever done had been on Esato’s behalf, or to explain Esato, or to make excuses for her, or to tell her off. With Esato gone, Sofya spoke only half as much. She was still congenitally sarcastic and insulting, but Telemakos thought most of this was habit; her heart was not in it. She watched him sharply, all the time. She would call the party to rest if she saw him flagging, but she never drew attention to his frailty. Telemakos thought he must have become a kind of substitute for Esato.\n He tired quickly. He tired so easily he could not understand how he had managed to drive himself through the last weeks of his captivity without collapsing. The journey up the switchback mountain roads to Aksum was slow because of him, and it frustrated him deeply. How many villages were left on the northern coast—how many soldiers could Gebre Meskal continue to employ in shielding them—how long before some stricken individual escaped and made his way to Adulis, while the disdainful baboon sat on his growing pile of tainted gold—\n “Don’t imagine you’re going to bring down the black market in salt all on your own,” Sofya remarked one day, “or by yourself enforce the emperor’s quarantine. Aksum’s fate does not rest entirely on your bony shoulders. Gebre Meskal does have other servants. Stop sulking.”\n “I’m not sulking,” Telemakos said.\n “You sit on your pony glowering like a vulture all day long.”\n “I don’t. I look at everything. I count the antelope. I saw twelve different kinds, yesterday. And the trees! That one late blooming kosso, did you see the beautiful red flowers this morning, among the deep green?”\n “You are more bearable as a holy innocent than as a sulking vulture, but only by an eyelash,” Sofya said. “What a task to set a child, cross the Salt Desert alone and break up a smugglers’ ring!”\n “I could have done it,” Telemakos said, and he was sulking. “It would have been easy if I’d had a decent water skin.”\n “Your aunt should be strung up by her toenails.”\n “Do you shut up, Woyzaro Sofya,” Telemakos said hotly.\n He never stayed angry with her. He could not argue with her hard, careless honesty. He liked it. It was much better than Helena’s pitying glances, or his father’s silent fury.\n They came at last to Grandfather’s villa in Aksum. Telemakos stood in the street outside the gate and said, “Will you come in? Stop and have your meal here before you go on.”\n “I think we should let you go alone,” Sofya said. “Your grandfather is not expecting visitors.”\n “Thank you, Sofya—thank you for all,” Telemakos said. He did not have the words to thank her adequately.\n “Gebre Meskal does have other servants,” she repeated loftily. “Now go and let your mother lick your wounds, you sorry little mountain jackal. Come and talk to me at the New Palace if they ever let you out again.”\n Telemakos went through the gate.\n Ferem was lighting the lamps in the forecourt. He set down his taper and kissed the boy on either cheek. “Telemakos! Welcome, dear child, welcome to your home. Turunesh said you were too gravely ill to travel—we did not expect you! What’s happened to your hair?”\n “They cut it off when I was in fever,” Telemakos said.\n “Come inside. Your mother will be overjoyed.”\n Telemakos ran up the steps two at a time.\n Turunesh was not noticeably bigger, but her eyes were shadowed with indigo rings, like bruises against her dark skin. Her face was thin. Telemakos wondered if these were the marks of illness or of worry or of carrying a child, and decided it was all three.\n “You’ve been lost! You’ve been lost!” he cried, and threw himself at her.\n “Peace to you, Telemakos Meder,” she breathed over the top of his head, and held him tight. After a little while she laughed softly, and said, “Go take a bath.”\n Telemakos woke in his mother’s bed, alone. He had slept late into the morning. He could not seem to sleep enough; it was as though his body were making amends for the hundreds of hours of sleep it had recently lost.\n Turunesh had left out clothes for him. Telemakos tried to fasten his kilt strings as usual, and gave up; he was too thin. He had to tie a knot in the fabric. He padded to the window and looked out at the sunny courtyard, at the empty niches in the white walls where the doves used to live. He could not believe he was home.\n Paradoxically, he could not believe he had ever been away. It seemed so natural, so ordinary to be here; Afar could not have been real. Telemakos crossed his mother’s bedroom to gaze at himself in one of her bronze mirrors, and the proof was before him: the gold bar at his neck, scratched and dented; his short hair haloing his face with light, as though he had wiped his scalp with sea foam; his lips still cracked and peeling; one eye still shot with blood, though no longer swollen. Telemakos knelt at the dressing table with his chin resting on his folded arms, staring at his strange reflection. He saw his mother come up behind him, and she ran her fingers lightly over his bristling head.\n “Your hair needs oiling.”\n “I told you I wouldn’t take care of it.”\n Turunesh laid her hands gently over the fading marks on his bare shoulders, where his skin had been chafed and cut by strap and whip.\n “What did you do in Afar?” she asked.\n “I was a water bearer.”\n “Do not the Afar women do such work?”\n “There weren’t any women at the salt mines.”\n She touched his collar and said quietly, “Come with me to the jeweler at the New Palace. It’s time you were freed of this shackle.”\n “Not yet,” Telemakos said. “I haven’t finished.”\n “Sweet heart, you’re home; it’s over.”\n “I haven’t finished,” Telemakos repeated.\n That afternoon he went to the New Palace on his own, in search of Gebre Meskal. Sofya must have told the emperor they were back, but Telemakos was still not sure how he would manage to get Gebre Meskal alone; he found, to his dismay, that the mere thought of hiding himself now exhausted him.\n Telemakos sat idly on the rim of one of the lily pools in the Grand Hall and messed about with the water. Like sleep, he could not get enough of it.\n Maybe I can just lie in wait here with the other courtiers until Gebre Meskal sees me, Telemakos thought. If he sees me, he will send for me.\n Another saw him first.\n “Telemakos Meder.”\n Telemakos looked up, then stood quickly. Of all men, of all men in the Aksumite imperial court, it was Karkara.\n “Where have you been these long seasons, Telemakos? Your lions have missed you.”\n The councilor had never treated Telemakos with anything but absentminded kindness. It had always seemed to surprise Karkara when Telemakos turned up in his office.\n But Esato had been afraid of him.\n Telemakos frantically shook the water from his hands. “Adulis,” he answered, ducking his head respectfully as Karkara wiped drops of water from his face. “I was in Adulis. I stayed with my grandfather’s brother, Abbas the archon. His wife, Helena, is very sweet to children.”\n “I visited Adulis myself not long ago,” said Karkara. “I did not see you there.”\n “I’ve been ill,” said Telemakos.\n “Are you better now?”\n “Much.”\n “Then you will have to take up your lessons in Noba again,” said Karkara.\n Telemakos, who had been gazing at the elder’s feet, dared to raise his eyes.\n “I do not think I shall need any more lessons with you,” Telemakos said, and lowered his eyes.\n “Insolent young scoundrel,” Karkara scolded mildly. He cuffed Telemakos lightly on the shoulder. “If the emperor wants you to speak Noba, so you shall.”\n “I beg your pardon.” Telemakos pulled his shamma back into place, and Karkara suddenly laid two careful fingers against the gold at Telemakos’s throat.\n “What is this?”\n “A present from my aunt,” Telemakos said. “It’s a Saxon necklet, like they wear in Britain. Goewin took great care of me when I was ill.”\n “You are lucky in her,” Karkara said. “I will speak to the emperor about your lessons.”\n “Will you see him soon?” Telemakos asked. “Will you tell him a thing from me?”\n Karkara gazed down at him with weary amusement. “All right, then, Telemakos Meder. What is your message?”\n “His tame sunbird has got into my grandfather’s garden,” said Telemakos, “and as the emperor knows, it will answer to him and none other.”\n “I did not know Gebre Meskal keeps a tame sunbird,” said Karkara.\n “You do now,” Telemakos replied coolly.\n Medraut was waiting in Grandfather’s garden court. Telemakos bore squarely his father’s shrewd, critical scrutiny. More than a month had passed since Telemakos had been freed, and though he was not fully himself again, he knew he no longer looked as if he had recently been buried alive. Medraut held an arm open to his son, and when Telemakos ran to sit by his side, Medraut put a small parcel in his hand.\n “What is this?” Telemakos asked. Oh, he thought, what a stupid thing to say, of course Ras Meder won’t tell me what it is!\n Telemakos unwrapped the leather bindings. It was a sheaf of unbound pages covered with dense, precise script. Telemakos glanced at the first page and turned the leaves over with growing delight. Medraut had given him a copy of the first four books of Homer’s Odyssey, but in Ethiopic, not in Greek.\n “The Telemakia! The voyage of Telemakos!”\n The script was unadorned, in flat black ink, but certain words among the text stood out in sudden violet in the middle of one page: “Telemakos,” and “a darling only son.”\n There was no inscription other than these few of Homer’s words picked out for emphasis. Telemakos stared down at the small, painstaking script.\n “You wrote this out yourself! You translated it yourself? For me!” His father had only ever given Telemakos a handful of words in his life, and here was an entire book of them.\n Telemakos began to cry again.\n I must stop this, he told himself sternly, sobbing into his father’s shoulder and clutching the priceless pages against his chest. I weep at everything. What did Sofya tell me: You are going to have to do better than that.\n He made his mother read the whole thing aloud to him over and over. He loved to hear his mother’s voice speaking the words his father had written, and he loved hearing his own name in a heroic fiction. Telemakos was listening at his mother’s feet, late in the afternoon, when Ferem came in to them and said, “The ambassador is here. She traveled partway with an official from Tekondo; Kidane has invited her guest to dine with him. Their party is unpacking in the stable yard. Shall I bring them in?” \n","sourceLink":"https://allnovel.net/the-sunbird-the-lion-hunters-3/page-19.html","bookId":2671,"book":{"id":2671,"title":"The Sunbird (The Lion Hunters #3)","description":"Storyline: \n The Sunbird (The Lion Hunters #3) \n Telemakos is the grandson of two noble men: Kidane, member of the parliament in the African kingdom of Aksum, and Artos, the fallen High King of Britain. Telemakos is also an exceptional listener and tracker, resolute and inventive in his ability to discover and retain information. Now his aunt Goewin, the British ambassador to Aksum, needs his skill. Plague has come to Britain, and threatens Aksum. Disguised, Telemakos must travel to the city of Afar where saltthe currency of sixth century Africais mined, and discover the traitor who has ignored the emperor\u0027s command, spreading plague with the salt from port to port. This challenge will take all of Telemakos\u0027s skill, strength, and couragebecause otherwise it will cost him his life. \n The Sunbird is the third in Elizabeth E. Wein\u0027s ongoing Arthurian/ Aksumite cycle. Its striking, spare language, riveting plot, and all-too-human characters are unforgettable. \n “The exotic culture and well-developed code of honor of the Aksumite court give this post-Arthurian/ancient Ethiopian fusion its striking flavor. . . . With her thorough command of historic characters, a grand scope, and a swift-paced, heroic plot, Wein has laid out an appealing and sumptuous literary banquet.” (The Horn Book)\n \n","cover":"https://allnovel.net/images/the-sunbird-the-lion-hunters-3.jpg","author":"Elizabeth Wein","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-sunbird-the-lion-hunters-3.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 10:00:23 AM"}}
