{"id":106885,"no":135,"title":"Page 135","content":"I had primed Soldier’s Boy to let me escape to her, and I had. Somehow I had brought shreds of his awareness with me. If he knew I was present, he did not struggle against me. Perhaps he thought he merely dreamed of his beloved. I know that the smell and taste and warmth of her drowned the question I had been so desperate to ask her. I was here with her, and now was the only time that mattered. We were both large people. This was no frantic and athletic coupling. Between two such as we, lovemaking was a stately and regal dance, a slow process of give-and-take. Neither of us was coy nor were we shy. The size of our bodies did not permit those types of hesitation. We accommodated each other without awkwardness, and if flesh was sometimes a barrier, it was erotic as well. It forced us to move slowly; every contact was well considered. Her thighs were thick and soft as I pressed myself against her. The bounty of her breasts was a soft cushion between us. Each guided the other to what was most pleasurable, and I enjoyed Lisana’s arousal as fully as my own. In those moments, I could recall in flashes that she had been his teacher in these matters, and he had delighted in learning his lessons well. As I held her and loved her, I could glory in the soft wealth of her skin. Her fingers walked the dappling on my skin, and in her touch, I rejoiced that I had marked myself as one of her own kind. All wonders must have an end. A drift of leaves had been our bed. Now we lay sprawled among them. Lisana’s eyes were closed but the smile on her face told me she was not even close to sleep. She was savoring our enjoyment of each other, and the touch of the weakened autumn sun and even the teasing wind that now chased a shiver across her. I laughed to see her shudder like a tickled cat and she opened her eyes. She sighed and lifted my hand to her lips, to kiss my palm again. With my hand still against her lips, she said softly, “I had a fancy the other day. Would you like to hear it?” “Of course.” “My trunk has fallen, you know. But I rise again as a sapling from the trunk.” “I know that. Oh, my love, I am so sorry that I—” “Hush. Enough of that. It has been said enough already. Listen. The tip of the tree that once was me thrust into the earth when I fell. And now I have felt a stirring there. A second tree will rise from the nursery that my trunk has become. I can feel it growing there, connected to me. Me and yet not me.” “Just as I am,” I said. I already knew the direction of her thought and liked it. “When you die,” she said carefully, without malice, for death did not mean to her or to Soldier’s Boy what it might have meant to a Gernian. I seized the words from her. “When I die, I will be brought to that tree. I will see that it is so, Lisana. That tree, and no other. And we shall always be together. Oh, would that it would happen soon.” “Oh, not too soon,” she chided me. “You have the task of your magic to complete. Now that you are one, surely you will succeed. But if you died before you complete it—” She paused and her smile faltered a little at the dread thought that followed it. “If you die before the intruders are driven away and the Vale of the Ancestor Trees secured against them, then I fear that our reunion will be short-lived.” She paused, and then sighed, knowing she was letting the concerns of the world intrude on our brief time together. “I have felt the changes,” she said. “Felt them, but no one has come to tell me what is happening. Kinrove’s power has faded, I think. When his dance stopped, it was like the sudden cessation of a great wind. I had almost forgotten what it was like when only peace filled our valley. For a time, a very short time, I drank it in as one drinks cool water after drought. I told myself it meant that you had solved the riddle of your magic and knew what you would do with your power. I dared to savor the peace that returned to the valley of our ancestors. But it was not for long.” “The dance started again,” I responded. “Did it?” She looked surprised. “I have not felt it here if it did. No. There were disturbances of another sort.” She looked down at the hand I still clasped and sighed again. “They are tough, those Jhernians, like plants that when chopped and mangled still send down roots and push up leaves again. Two days after Kinrove’s dance failed, I felt them at the edges of the forest. The next day, they were hunting there. Two days after that, they had mustered their slaves and put them to work, despite the snow on the ground. The poor creatures are near naked as frogs in the cold. I suppose their work warms them. Already, they have undone some of the barrier your magic raised against them.”","sourceLink":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3/page-135.html","bookId":2015,"book":{"id":2015,"title":"Renegade\u0027s Magic (The Soldier Son Trilogy #3)","description":"Storyline: Loyal, privileged, and brave—a soldier in the service of the King of Gernia—Nevare Burvelle survived a devastating plague of enemy sorcery, but at a terrible cost to his soul, body, and heart. Now he stands wrongly accused of unspeakable crimes, including murder, the most heinous of them all. Suddenly an outcast and a fugitive, he remains a hostage to the Speck magic that shackles him to a savage alter ego who would destroy everything Nevare holds dear. Perhaps, however, this curse that has long abused him can be used by him instead—a mighty weapon he can learn to wield for his own purposes. But down what perilous road will this desperate new quest lead him? And what will be the ultimate incarnation of Nevare Burvelle?","cover":"https://allnovel.net/images/renegade-s-magic-the-soldier-son-trilogy-3.jpg","author":"Robin Hobb","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:51:23 PM"}}
