{"id":106901,"no":151,"title":"Page 151","content":"It was late before the last of them slept. Soldier’s Boy went to his bed weary from both travel and talk, and anxious for the morrow. Olikea curled around his back. Weariness soon claimed her. He closed his eyes and composed himself but sleep would not come. He went to battle a virgin to war, and yet he felt that, of the Great Ones, he had the clearest idea of what they would face on the morrow. He agonized over it. Would he acquit himself well or would he take his warriors into useless deaths? Whatever would come, he wanted to face it and have it be over. I had seen their plans and recognized that much of what he had chosen to do was exactly what I would have selected, were I ruthlessly bent on annihilating an enemy that had not yielded to any other tactics. I watched him, a darker shade of myself, the product of my father’s and the Academy’s teachings, and yes, of the hatred that such teachings had roused in the Specks. I had to marvel in horror at what happened when such a system was turned back on itself.\\n\\n Then, deliberately, I began to consider every aspect of what might go bad for him tomorrow. I thought long and in detail of the men who had chilled their muscles, and of the strong drink that had been consumed. I thought of the depth of snow that awaited them, the trails that must be broken. Quick-walk was quick-walk; it could speed up how we traversed terrain but could not eliminate the challenges of it. I dwelt on his inexperienced horsemen and the poor quality of their tack. Dasie’s mount was a cart horse, chosen solely because he could carry her weight; her mount had little experience as a saddle horse and she had even less experience as a rider. I imagined for him all of the mishaps that could arise from that combination. Into this equation, I factored his ignorance of the command of the fort now. He was counting on the sentries to be slack and the night guard but half awake.\\n\\n I deliberately fed his fears and kept him from sleep long after the others had subsided into snoring. And then, when his frazzled mind had worn itself out with snapping at possible disasters, I withdrew. He sank swiftly toward sleep and I did all I could to make his rest as deep as possible. I soothed and calmed him from the edges of his thoughts, and as soon as I felt him sink deeper than the level of dreams, I acted.\\n\\n Tapping into his magic was the most delicate part. He and the other Great Ones had spent the last two days fortifying their reserves, eating only the foods most conducive to their tasks. Soldier’s Boy, I knew, was jealously aware that he had still not regained the size he had enjoyed before I had expended all his magic in my futile attack on the road, but in this last bout of eating, he had surpassed Jodoli. His height and bone structure gave him a clear advantage over Dasie at any time; her body simply could not carry the weight that his could. Kinrove had rapidly regained his size, the result of a dedicated team of experienced feeders. Nonetheless, Kinrove and Jodoli had insisted that their reserves would be taxed by the transporting of the army as well as its safe retrieval. They had warned Dasie and Soldier’s Boy to hoard strength lest part of that task fall on them as well.\\n\\n Like a tiny tick, I sucked off the magic until I felt my awareness was saturated, then bloated with the stuff. I withdrew from Soldier’s Boy’s awareness as far as I could and then sent a needle-sharp thought questing for Epiny.\\n\\n I could not find her.\\n\\n For a heart-stopping moment, I wondered if she were dead. She had not seemed in the best of health when last I saw her, dragged down by both her pregnancy and the sorrow and anxiety she felt over me. Gettys was a rough and primitive place for a genteelly raised woman to give birth to her first child. I had been glad to know that Amzil would be there at her side, but although Amzil had attended other births, she was not a doctor or a midwife. I tried to count back and decide where Epiny would be in her pregnancy, but time had slid about so much for me recently that I could not decide if she would still be pregnant or a new mother by now.\\n\\n I gave way to the impulse of my heart and reached for Amzil. I found her just as effortlessly as I had the first time I’d dream-walked to her. This time I was wiser. I approached her more slowly and gently. “Amzil. Amzil, can you hear me? It’s Nevare.”\\n\\n I knew she was there, but some sort of murkiness obscured her. I reached desperately through it. “Amzil? Amzil, please! Hear me. Hear my warning.” But beyond the fog that cloaked her mind, I encountered only the same wall she’d shown me last time. She’d shut me out of her dreams, resolved to go on living without me. I could not blame her; she’d learned too well to rely on her own strength. I could not get through the defenses that kept her strong. Epiny, then. I would have to find Epiny if they were to be warned.\\n\\n I mustered my stolen magic and reached out more strongly for my cousin. There was a long moment of doubt, of empty, endless reaching and then a startled, “Oh!” from somewhere in the other world. \\n\\n","sourceLink":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3/page-151.html","bookId":2015,"book":{"id":2015,"title":"Renegade\u0027s Magic (The Soldier Son Trilogy #3)","description":"Storyline: Loyal, privileged, and brave—a soldier in the service of the King of Gernia—Nevare Burvelle survived a devastating plague of enemy sorcery, but at a terrible cost to his soul, body, and heart. Now he stands wrongly accused of unspeakable crimes, including murder, the most heinous of them all. Suddenly an outcast and a fugitive, he remains a hostage to the Speck magic that shackles him to a savage alter ego who would destroy everything Nevare holds dear. Perhaps, however, this curse that has long abused him can be used by him instead—a mighty weapon he can learn to wield for his own purposes. But down what perilous road will this desperate new quest lead him? And what will be the ultimate incarnation of Nevare Burvelle?\\n","cover":"https://allnovel.net/images/renegade-s-magic-the-soldier-son-trilogy-3.jpg","author":"Robin Hobb","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:51:23 PM"}}
