{"id":106773,"no":17,"title":"Page 17","content":"My body diminished as I used the magic. My hated fat, the reservoir of my power, was dwindling away. It felt very strange. My trousers sagged on my hips. I could not hold them up; I needed my hands to do the summoning. Growling at the delay, I paused and tightened my belt. It pinched my loosened skin. I ignored it. I was nearly at the end of the road. I had to go on; I had to finish my barricade against the road builders. I summoned my will and my emotion once more, and threw wide the reserves I had stored. For a brief moment, the magic fought my will, and then the power came under my dominion again. The magic sang through my blood, intoxicating me with command. I brought the trees down more swiftly, laughed aloud as the road buckled in my wake. I spoke to the weeds and scrub brush that had survived in the ditches, and they burst into rampant growth, running up the banks and crawling across the road. My parade of destruction had become a charge. Nothing could stop me. The end of the King’s Road was a tangled darkness before me. I looked with the eyes of night and my heart sank at what I saw. The singing of the magic in my blood became a dirge. The loggers had brought down another kaembra tree. The massive trunk had been severed, and the fallen giant had crashed down onto the cleared apron that would eventually be part of the road. I stood for a moment, my nearly depleted magic simmering in me, and stared at the tragedy. Until I had come east to Gettys, I had never imagined such trees existed. I had been raised in the Midlands, on the plains and plateaus where it might take a tree a score of years to increase its girth by an inch. We had ancient trees, but they were twisted, battered things with trunks as hard as metal. The giants of the Speck forest still awed me. The fallen trunk that blocked my path was far too tall for me to climb over; I would have had better luck scaling the palisade that surrounded the fort at Gettys. I walked around its severed base, suddenly exhausted and staggering. While I had wielded the magic, I had not felt tired. Now my weariness hit me with full force. Beneath my loosened clothing, my emptied skin sagged around me. The excess skin on my arms, legs, belly, and buttocks all but flapped around me as I walked. I groped at my body, finding the jut of a hipbone and the ripple of my ribs as if greeting old friends. The warning of Jodoli, a Great Man of the Specks far more experienced with magic than I was, came back to me. “You can die from loss of magic, just as you can die from loss of blood. But it seldom happens to us without the mage knowing exactly what he is doing. It takes a great deal of will to burn every bit of magic out of yourself. A mage would have to push past pain and exhaustion to do it. Ordinarily, the mage would lose consciousness before he was completely dead. Then his feeder could revive him, if she were nearby. If not, the Great One might still perish.” I smiled grimly to myself as I tottered on toward the standing stump of the fallen tree. I had no feeder to come and tend me. Olikea, a woman of the Specks, had served for a time as my feeder. The last time I had seen Olikea we had quarreled because I had refused to turn against the Gernians and come live among the Specks. She had reviled me before she left; I’d been a great disappointment to her. She competed hard with her sister Firada, Jodoli’s feeder. I wondered, almost sadly, if I had ever been someone that she cared about, or only a powerful but ignorant mage whom she could manipulate? The question should have meant more to me, but I was too tired to care anymore. But I had done it. My blockade of the road builders would slow them for months. For a fleeting instant, pleasure warmed me as I thought how proud of me Epiny would be. But a chill thought followed it. Epiny would never know it was my work. She would hear of the dog’s death I had died, and mourn me fiercely. If she heard of what had transpired at the road’s end, she would put it down to Speck magic. I was dead to her. Dead to her, dead to Spink, dead to Amzil and her children. Dead to my sister, Yaril, as soon as word reached her. Dead to old Sergeant Duril, the mentor of my youth. My exuberance drained and darkness swirled around me. Dead to everyone I loved. Might as well really be dead. I fell to my knees in my weariness. That was a mistake. The instant I settled into stillness, hunger woke in me and clawed at my guts and throat. It was beyond hunger pangs; it felt as if my guts were devouring themselves and I groaned with it. If Olikea were here, I thought hazily, she would bring me the berries and roots and leaves that sustained my magic. And afterward, she would have roused my passions and then sated them. Some desperate sentry in my brain realized that my thoughts were circling uselessly. The sky was graying. I’d spent the night as recklessly as I’d spent my magic. Daylight was coming. Time to flee. It took me some little time to rise. I staggered on, my ears ringing. I felt as if I could hear a great crowd of people talking at a distance. There was that uneven rise and fall of vocalization, rather like water lapping against a shore. I lifted my eyes, but no one was there. Then my knees folded under me again. I had not gone even a dozen paces. I crumpled to the earth beside the massive stump of the fallen kaembra tree. I caught myself before I went facedown in the wood chips and sawdust that littered the forest floor. With a groan I twisted my body to lean my back against the stump. I had never felt such weariness and hunger, not even in my worst days of starvation in my father’s house. “Am I dying?” I asked the implacable night.","sourceLink":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3/page-17.html","bookId":2015,"book":{"id":2015,"title":"Renegade\u0027s Magic (The Soldier Son Trilogy #3)","description":"Storyline: Loyal, privileged, and brave—a soldier in the service of the King of Gernia—Nevare Burvelle survived a devastating plague of enemy sorcery, but at a terrible cost to his soul, body, and heart. Now he stands wrongly accused of unspeakable crimes, including murder, the most heinous of them all. Suddenly an outcast and a fugitive, he remains a hostage to the Speck magic that shackles him to a savage alter ego who would destroy everything Nevare holds dear. Perhaps, however, this curse that has long abused him can be used by him instead—a mighty weapon he can learn to wield for his own purposes. But down what perilous road will this desperate new quest lead him? And what will be the ultimate incarnation of Nevare Burvelle?","cover":"https://allnovel.net/images/renegade-s-magic-the-soldier-son-trilogy-3.jpg","author":"Robin Hobb","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:51:23 PM"}}
