{"id":106925,"no":177,"title":"Page 177","content":"“No worse than you, Nevare Burvelle. Or will you deny that you tried to kill, not just me but also Lisana? You even believed you had succeeded. But you had not. And now it is my time.” I waited, expecting a blow or some final words from him. Instead, I received nothing. Some time passed. He stirred in his bed and instantly his feeders surrounded him. No Gernian cavalla officer, no matter how high his rank, would have allowed underlings to tend him as assiduously as Soldier’s Boy’s feeders did. They flocked around him, offering him food, drink, clothing to wear, and slipping shoes on his feet. They tended him as if he were the King of Gernia, and he accepted it as his due. I wondered that he could stand being cosseted so. “Are you a man or a great doll?” I asked him snidely, but received no response. Often when he did not directly reply to me, I could sense his reaction to my barbs, but this time there was nothing. I realized I could not pick up any trace of what he was thinking. He ignored me absolutely as he resumed his morning routine. He washed, he ate, and Sempayli came in to report to him. The man had a low, soft voice. I had to strain to hear what he was saying. He seemed to be giving a solid military report of who had returned and in what condition and how the raid had unfolded for those not immediately under Soldier’s Boy’s commands. Soldier’s Boy took it all in, but I could sense nothing of his feelings let alone his responses. I felt as if my ears were packed full of wool. Soldier’s Boy rose and followed his lieutenant out of the lodge. Some of his troops had assembled for his review. Close to four hundred warriors had followed him on his raid. He had lost nearly a third of them, and only fifty or so now awaited him. These were the men who had been most loyal to him and were now most disillusioned. A dozen or so bore injuries of varying severity. They looked at him and their eyes were full of confusion. I watched him try to rally their spirits. I wondered why he bothered. “You will not lead those troops into battle again,” I sneered at him, but as before, I felt no response to my jibe. It became harder and harder to hear the words addressed to Soldier’s Boy and near impossible to hear anything of what he said in response. He was cutting me off from him, I now knew. It was strange to realize that he had been allowing me to break in on his thoughts. And now he was not. What did that bode for me? As the day passed, I became more and more isolated from him. I could look out through his eyes, and hear, in a muffled way, what he heard and even what he responded. I was aware of what he did with his body, how he ate and drank, what he did, but he had separated me from himself. My sense of taste and smell faded, just as my hearing had. Even touch seemed muted and distant. It was not the absolute emptiness that I’d once been marooned in, but an even stranger place where what I thought had no impact on my life at all. My life. I wondered if I could even call it that anymore. It was more like being trapped inside the body of a marionette, and unable to anticipate what string would next be pulled. With every passing day, the world outside his body became less accessible to me. Daily he spoke to people—Sempayli, his warriors, his feeders, and Olikea. I heard his words and could make out their responses, but sensed nothing of what he felt. My emotions were so often at odds with his. I was truly a man living in a stranger’s body. Where I would have wished to comfort Olikea when she silently wept at night, he made no move toward her. When I thought he should have rebuked a member of his household or praised one of his warriors, he just as often did something entirely different. My disconnection from his thoughts became a sort of madness for me, excruciating in a very different way from my time in the emptiness. It was like reading a book in which the words and sentences almost made sense, but not quite. I could not predict what he would do next. In the times when he slept and I did not, I thought often of Gettys and the raid. I tried not to imagine what must have followed; the warehouses of food had been put to the torch, as had many of the dwelling places. I tried not to think of families without adequate food or shelter in the deep cold of winter. Sometimes I thought about Spink and wondered if he had ignored my warning, or if he had reacted to it in a way I didn’t understand. Obviously, he’d been outside the walls of the fort that night. Had he heeded my warning and removed his family from the fort? I tried to imagine where I would have hidden Epiny and Amzil and the children if I knew a Speck attack was imminent. I was actually pleased when I could not decide; a secret a man does not know is one he cannot betray. The remaining days of winter trickled by. Soldier’s Boy regained his girth. Olikea remained a cipher to me, her movements listless and her face nearly expressionless. She still went about the tasks of being his feeder, but I saw little of her old spirit. She did not speak of Likari; had she given up all hope of recovering him? She seemed indifferent to everything in life; even when she accommodated Soldier’s Boy’s need for sex, she seemed uninterested in her own pleasure. I wondered what emotions and thoughts he had at such times, but those, too, were hidden from me. She was neither cruel nor contemptuous toward him. It seemed as if every intense emotion had vanished from her, leaving a woman gray as the overcast sky.","sourceLink":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3/page-177.html","bookId":2015,"book":{"id":2015,"title":"Renegade\u0027s Magic (The Soldier Son Trilogy #3)","description":"Storyline: Loyal, privileged, and brave—a soldier in the service of the King of Gernia—Nevare Burvelle survived a devastating plague of enemy sorcery, but at a terrible cost to his soul, body, and heart. Now he stands wrongly accused of unspeakable crimes, including murder, the most heinous of them all. Suddenly an outcast and a fugitive, he remains a hostage to the Speck magic that shackles him to a savage alter ego who would destroy everything Nevare holds dear. Perhaps, however, this curse that has long abused him can be used by him instead—a mighty weapon he can learn to wield for his own purposes. But down what perilous road will this desperate new quest lead him? And what will be the ultimate incarnation of Nevare Burvelle?","cover":"https://allnovel.net/images/renegade-s-magic-the-soldier-son-trilogy-3.jpg","author":"Robin Hobb","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:51:23 PM"}}
