{"id":106931,"no":183,"title":"Page 183","content":"She looked deep into my eyes. “I will stay here. To the end, whatever it may be, I will stay here. I ask only this of you, Nevare. Dream-walk to my father. Tell him of what has befallen us. Then come back to me, to tell me that he has said he will send help to us. Please, Nevare. Can you do that?”\\n\\n “I don’t know.” Her request staggered me. Did I know my uncle well enough to attempt such a thing? It had always been easy to dream-walk to Epiny. Her abilities as a medium left her sleeping mind open to my intrusions. My close bond with my sister Yaril had let me contact her, but I wasn’t sure how much she believed her “dreams” of me. My uncle? I respected him, yes, and loved him for all he had done for me. But to enter his sleeping mind and speak to him? “I’ll try,” I said, though my heart misgave me. I doubted that I had much time, and I had desperately wished to see Yaril, to know if she was all right. It was a hellish choice; to use my time trying to reach my uncle and then return to Epiny to give her some hope, or to find out how my younger sister was faring as she faced an arranged marriage in a household run by my deranged father. “I’ll try. I’ll try right now,” I told her, and let go of her hands.\\n\\n Find my uncle. Find Sefert Burvelle, Lord Burvelle of the West. He was the heir son of the old line of my family, the holder of the family mansion and the estates in and near Old Thares. My father had been the second son, his soldier-brother. When my father had served his king well in the wars with the Plainsmen, the King had elevated him to the status of a lord with a small grant of land, making him one of his “new nobles.” That had not suited my uncle’s wife. Lady Daraleen Burvelle felt that one Lord and one Lady Burvelle were quite enough, and that my father had moved above his proper position in life. That had prompted her starchy welcome of me when I came to attend the Cavalla Academy in Old Thares. She blamed me because her daughter Epiny had met and fallen in love with another “new noble” son and a poor one at that. When Epiny had scandalized her by running off with Spink, that had been the final straw. Although my uncle still thought warmly of me, my aunt regarded me as the one who had ruined her chances to engineer a well-placed match for Epiny at court.\\n\\n I tried to push my dislike of my aunt aside. It was clouding my memories of my uncle. I did not want to focus on her so much that I accidentally wandered into her dream. I tried to find quiet within my soul, to ignore the nagging sense that my time to dream-walk was ticking away, and to focus instead on my memories of my uncle. I summoned up the sensory memories that linked me to him: the smell of his tobacco, the taste of his brandy, the warmth and casual comfort of his study in Old Thares. I focused on the warm clasp of his hand on mine whenever he greeted me, and the sound of his voice as he said my name.\\n\\n “Well, there you are, Nevare. And how have you been? Will you join me in a game of Towsers?”\\n\\n I had to smile, knowing how much he detested the inane game that Epiny and his younger daughter Purissa so often trapped him into playing. In his dream, his daughters were in the room with him, cards in hand, but the moment I entered his dream, they faded into shadows in the background. They went on playing, slapping down their cards and leaping up to shout wildly when they’d made a point, but the actions and the sounds of their voices became distant and muffled.\\n\\n “Uncle, I’ve little time. I’m visiting your dreams to tell you that things are desperate in Gettys. The fort has been attacked by the Specks. Their food stores are nearly depleted and their morale is devastated. Epiny and Spink are doing their best; they have a baby now, a little girl, Solina. But hunger presses them, and the spring rains bring cold and hardship. I know the roads are bad. But Epiny has asked me to reach you this way. I want to tell her that you are sending help to her. Even if it will be weeks before it reaches her, to know that help is on the way will lend her strength. Truly, times are desperate in Gettys.”\\n\\n “Will you have a glass of wine with me, Nevare?” My uncle was smiling at me. Our contact was more tenuous than I’d thought. In the morning, he might remember he’d dreamed of me, or he might recall nothing at all. I suddenly recalled something Epiny had said to me.\\n\\n “Sir, my journal. My soldier-son journal. Epiny sent it to you. If you’ve read it, you’ll know about this kind of magic. Dream-walking. I’m really here, in your dream, talking to you of real things. Epiny needs your help. Please, Uncle Sefert!”\\n\\n “That damnable book! I am deeply disappointed in my wife, Nevare, deeply disappointed. Has she no idea how this could smear the Burvelle name? Epiny said not to read it, and I am a man of honor! But my wife made no such promise, and she has been full of folderol and foolish mysticism for too long. She will bare my nephew’s derangement, for such it must be! Poor Nevare! Keft was too hard on the boy, too hard, as he now admits to me in his letters. But what am I to do? He drove his son from under his roof, and only the good god knows what became of him. I do not think he should ally himself with the Stiet name, let alone engage his daughter to a boy who is himself a disowned soldier son of a soldier son who was never truly a soldier! What is the advantage in that? I’ve told him he should send little Yaril to me. I would see her safely into a good match. But I fear his mind is no longer sound; my brother’s handwriting looks more like a random trickling of ink, and his words wander more than his lines do! Curse the Specks and their dirty plague; I fear it has been the undoing of the Burvelles!” \\n\\n","sourceLink":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3/page-183.html","bookId":2015,"book":{"id":2015,"title":"Renegade\u0027s Magic (The Soldier Son Trilogy #3)","description":"Storyline: Loyal, privileged, and brave—a soldier in the service of the King of Gernia—Nevare Burvelle survived a devastating plague of enemy sorcery, but at a terrible cost to his soul, body, and heart. Now he stands wrongly accused of unspeakable crimes, including murder, the most heinous of them all. Suddenly an outcast and a fugitive, he remains a hostage to the Speck magic that shackles him to a savage alter ego who would destroy everything Nevare holds dear. Perhaps, however, this curse that has long abused him can be used by him instead—a mighty weapon he can learn to wield for his own purposes. But down what perilous road will this desperate new quest lead him? And what will be the ultimate incarnation of Nevare Burvelle?\\n","cover":"https://allnovel.net/images/renegade-s-magic-the-soldier-son-trilogy-3.jpg","author":"Robin Hobb","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:51:23 PM"}}
