{"id":106933,"no":185,"title":"Page 185","content":"“Yes, the snow was very deep. It has blocked the roads between Gettys and the west. That is why I need you to send a letter to our uncle Sefert in Old Thares. Or perhaps ask our father to intervene directly, if you think you can persuade him to do so. It has been a hard winter in Gettys, and both Epiny and Spink are in dire circumstances.” I took a deep, slow breath, willing calmness toward her. “The citadel at Gettys was attacked by the Specks, Yaril. They came by night, with fire and arrows and swords. Much of Gettys was burned, and many soldiers killed. Epiny and Spink and their infant came through unscathed, but in the days since then, the cold and the lack of food have been a great hardship.”\\n\\n She was staring at me. The fish slowly waved its tail. “Cannot they simply cut firewood and stay warm that way?”\\n\\n “It is difficult for them to go into the forest. A magic spell makes them fear to go there.”\\n\\n “Wait. You say they have a baby now?”\\n\\n “Yes. And that makes it even more difficult for them.”\\n\\n She nodded slowly, the fish in her hands forgotten. “What should I do?”\\n\\n Patience, I counseled myself. Patience. “Write to Uncle Sefert. Say that you’ve had word of the Speck attack and their harsh conditions. You don’t have to say how you know. Just tell him that he must urge that food and other supplies be immediately sent to Gettys. Even if he has to make such arrangements himself, it must be done. And if you think our father will act on it, recommend to him that he immediately send off whatever supplies he can.”\\n\\n “Father is not well.” The fish in her hands stopped wriggling. It became a rag doll and she held it to her cheek now, seeming to take comfort from it. “Things are strange here, Nevare. You should come home and help me. I don’t know what to do!”\\n\\n I sensed her rising emotion. In the dream, I opened my arms and she fled into them. I held her tightly. I was a tall, strong young cadet, golden-haired and fit. That was the Nevare she needed now, and she made me take that form; she wanted me to be the hero who would come to rescue her.\\n\\n “My dear, I will do what I can.” I did not say that it would be nothing. “What is your situation?”\\n\\n “Father is…changed. He is healthier in body, though still he walks with a stick. He…sometimes he seems to know that Mother and Rosse and Elisi are dead. But sometimes he asks questions about them, or speaks as if he has just seen them. I am a coward, Nevare. I don’t contradict him. I let him be. He speaks of you, too, with pride. He says you have gone for a soldier, and soon will come home covered in glory. That is what he always says of you, ‘covered in glory.’ It is comforting to hear him speak well of you. I don’t remind him that he sent you away in disgrace. It is easier, so.”\\n\\n “Covered in glory,” I repeated softly. My father’s dream for me. My dream for myself, not so long ago. For a moment, my mind wandered. The old dreams stung now but still I touched them and longed after them.\\n\\n “Nevare,” Yaril said, speaking against my chest. “You are really here, aren’t you?”\\n\\n “It’s magic, Yaril. I’m here in your dream, and as real as I can be in a dream. My body is far from you, but my heart is here.”\\n\\n “Oh, Nevare.” She held tighter to me. “Stay here. Stay here and help me, even if you must be a ghost who only comes into my dreams at night. I am so alone and adrift. And Caulder’s uncle frightens me.”\\n\\n My heart sank. Of all my betrayals of my own people, this was bitterest and most shameful to me. My little sister was threatened, and I could do nothing. Coward that I was, I wanted to know no more. I forced the words out woodenly. “What does he do, Yaril, that frightens you?”\\n\\n “He is so strange, Nevare. He and Caulder have stayed so long here, far past the length of a proper visit. I fear for my reputation among the neighbors, for all know that Father is not the man he used to be, and I can claim no proper chaperone in this household of men. Caulder feels it keenly and is humiliated. Over and over he has urged his uncle to leave. He has found some courage, he says, and wishes to go back to his father and demand that his father be the one to make an offer for my hand. He had a great quarrel with his uncle over this. His uncle was most cruel, reminding Caulder that his father had disowned him, and saying a great many things to put Caulder in his own debt. He says that he is as Caulder’s father now, and has made the offer, and he sees nothing improper in staying so long as guests in the home that Caulder will eventually inherit.”\\n\\n These were words that stuck in me like a knife. Caulder Stiet would inherit the estates of the Burvelles of the East. Their firstborn son would be Lord Burvelle of the East, if my father petitioned the King to make it so. But he would be a Stiet by his blood. For a moment, anger seethed in me. My father could have elevated me to be his heir son, if he had chosen to do so. Many desperate nobles had petitioned the priests to move a soldier son up to the status of heir. But before my anger could turn to greater bitterness, Yaril’s words caught me again. \\n\\n","sourceLink":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3/page-185.html","bookId":2015,"book":{"id":2015,"title":"Renegade\u0027s Magic (The Soldier Son Trilogy #3)","description":"Storyline: Loyal, privileged, and brave—a soldier in the service of the King of Gernia—Nevare Burvelle survived a devastating plague of enemy sorcery, but at a terrible cost to his soul, body, and heart. Now he stands wrongly accused of unspeakable crimes, including murder, the most heinous of them all. Suddenly an outcast and a fugitive, he remains a hostage to the Speck magic that shackles him to a savage alter ego who would destroy everything Nevare holds dear. Perhaps, however, this curse that has long abused him can be used by him instead—a mighty weapon he can learn to wield for his own purposes. But down what perilous road will this desperate new quest lead him? And what will be the ultimate incarnation of Nevare Burvelle?\\n","cover":"https://allnovel.net/images/renegade-s-magic-the-soldier-son-trilogy-3.jpg","author":"Robin Hobb","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:51:23 PM"}}
