{"id":106978,"no":230,"title":"Page 230","content":"I was using its rusty edge to saw a strip from the edge of my cloak, to make a crude sword belt, when I suddenly realized that I was holding and using iron with no ill effects on me at all. I shouldn’t have been surprised, but I was. I thought about it briefly, decided I had no idea what that meant, and went back to my crude tailoring. After I had a strip for the belt, I abandoned all caution and attacked my cloak, cutting the fabric into a smaller rectangle and making a hole for my head. I ended up with a sort of tunic, open at both sides but belted, and with a second sash to hold my rusty sword. My “new clothes” were more suitable for the warming spring day. I rolled up what was left of my cloak and took it with me as I left Lisana’s ridge. I made no farewell. I decided I was no longer the sort of man who talked to trees.\n It remained to be seen what type of man I was.\n Evening was falling by the time I neared the construction camp at the end of the road. Frogs were creaking in the dammed-up stream by the road’s edge, and mosquitoes hummed in my ears. As I scrambled up onto the partially completed roadbed, I squinted through the dimness at what I saw. It was all wrong.\n Long runners from ground-crawling blackcap berries had ventured up and onto the sun-warmed roadbed. No traffic had trampled them flat. Grass sprouted in the wagon ruts. It was short, new grass, but it should not have been growing there at all if work was continuing on the road. As I walked toward the darkened equipment sheds, everything rang wrong against my senses. I glimpsed no night watchman’s lantern. The smells were wrong; there was no scent of smoke from burning slash piles or cook fires. The manure I accidentally stepped in was old and hard. Everything spoke of a project abandoned weeks if not months ago.\n Yet when last I had looked down on that valley with Lisana, I had seen smoke and heard the sounds of men working. How much time had passed since I had “died”? And what had made the Gernians abandon work on the King’s Road? Had Kinrove discovered a new and potent dance to keep them at bay? But if he still poured discouragement and fear down from the mountains, why didn’t I feel it? I sensed there was no magic left in me; I should not have had any immunity to his danced magic.\n I turned and looked up toward the darkening mountains. I could recall breaking a Gettys Sweat. It took an act of will for me to open my senses and try to feel what might be flowing down toward me. But even after I had attempted to be aware of whatever magic Kinrove might be using, I felt nothing. It was a pleasant summer day in the forest. No fear and despair flowed, and yet the work on the King’s Road had ceased. So. The magic I had done had worked. But what sort of a magic had it been?\n I imagined a Gettys full of people killed in their sleep, and shuddered. No. Certainly I would have felt such a deadly magic if I had been part of it. Wouldn’t I? Had my dance driven them all away? Was I the last Gernian left in the foothills of the Barrier Mountains?\n Night had deepened around me. The frogs still peeped, and occasionally the deeper bellow of a bullfrog sounded. The mosquitoes and gnats had found me as well, and my open-sided attire left me very vulnerable to them. I slung what remained of my cloak around my head and shoulders and advanced cautiously on the buildings.\n Things had changed a great deal since the last time I had visited. The charred remains of the buildings that Epiny had blasted had been completely removed. In the fading light, I crept up on one of the replacement structures. The creaking of the frogs and the constant chirring of the insects abruptly ceased when I coughed. That was enough to finally convince me that no one was about. I entered the structure. There was no door to open; all the buildings here were temporary ones, thrown up to give the workers minimal comfort during construction and to protect the tools from the worst of the weather. Most were little more than two rough walls and a roof overhead. This one was empty. Even in the fading light, I could see that.\n There should have been harness racks and tools lining the walls, but they were bare, with only pegs and an occasional worn strap still tangled on a hook. There was a central hearth where men could get warm on a cold day or put water to boil for tea or coffee. The ashes in it had gone to cold damp clinkers; it hadn’t been used in a long time.\n It was the same in the next shed I visited. There were no wagons or scrapers, no working equipment of any kind. What had been abandoned was the broken stuff, tools so worn they weren’t worth hauling away. I was moving more boldly now, fearless of watchmen, looking only for what I might scavenge to give myself an easier night.\n Behind a broken lantern, I found a box with three sulfur matches still in it. There was a bit of oil and a few inches of wick left in the lantern. In a very short time, I had a small fire going. A brand from it offered me an unsteady light for my exploration. I saw no sign of recent human visits. Precious little that was of any use had been left behind. Yet even garbage and broken objects can seem like a treasure to a man who has absolutely no resources. Thus I found a water flask that would work if I didn’t fill it more than half full, and a pair of dirty trousers, torn out at both knees, but definitely better than no trousers at all. A scrap of leather harness made me a belt to hold them up. \n","sourceLink":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3/page-230.html","bookId":2015,"book":{"id":2015,"title":"Renegade\u0027s Magic (The Soldier Son Trilogy #3)","description":"Storyline: \n Loyal, privileged, and brave—a soldier in the service of the King of Gernia—Nevare Burvelle survived a devastating plague of enemy sorcery, but at a terrible cost to his soul, body, and heart. Now he stands wrongly accused of unspeakable crimes, including murder, the most heinous of them all. Suddenly an outcast and a fugitive, he remains a hostage to the Speck magic that shackles him to a savage alter ego who would destroy everything Nevare holds dear. Perhaps, however, this curse that has long abused him can be used by him instead—a mighty weapon he can learn to wield for his own purposes. But down what perilous road will this desperate new quest lead him? And what will be the ultimate incarnation of Nevare Burvelle?\n \n","cover":"https://allnovel.net/images/renegade-s-magic-the-soldier-son-trilogy-3.jpg","author":"Robin Hobb","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:51:23 PM"}}
