{"id":107013,"no":267,"title":"Page 267","content":"“It will all be all right,” Lisana’s voice said quietly. A soft lethargy had begun to creep through me. “The child will take the woman to where she must go. They’ll flee together. And you’ll come back to me. It will be an end to all that has divided you, an end to living a false life. You’ll be where you belong. Where you have always belonged.” I lifted my eyes to Amzil. She stood half a dozen steps from the door, Kara in her arms, the sword in her hand. “Run!” she shouted at me. “Pull your feet out of your boots and run!” “I can’t. It has me.” I found I could smile. “You go, Amzil. Find a better life. Kara knows where the horse and cart are. Epiny loaded it for you. Flee. Don’t stop in Dead Town. They’ll look for you there. Get well away from town and then hide in the forest. It’s not as dangerous now! Go!” “No!” she screamed at me. She slashed at the roots crawling toward her, and they fell back, but that was no help to me. Shrieking in frustration, she snatched up her child and ran. I watched them go, heard the slap of her feet down the stone-flagged hall and felt the little roots in my feet dig deeper. It was done. I’d salvaged what I could from my old life and now it was time to let it go. I resolved not to scream. But an instant later, scream I did as flames engulfed the room. Amzil sent a second lantern crashing to the floor to follow the first. That one broke, the oil splashing my boots and trouser legs. The hungry flames leapt up to follow the splattered oil. “Now run, you great idiot!” Amzil yelled at me. She came into the room, through the flames, whipping the saber’s blade against the floor. Roots scorched and writhed and I heard Soldier’s Boy shout angrily. Ignoring flames and wriggling roots, Amzil clashed the blade again and again on the floor, working in a circle around me and literally chopping me free of the roots that gripped me. As she worked, she kicked at roots that squirmed and crawled toward her own lightly shod feet. I lifted my feet and like a chained dog strained against the final tethers that held me. Soldier’s Boy’s angry roar in my mind was abruptly silenced as a wild slice of the blade severed the last root. The oil-fed flames were licking up the walls and leaping at Amzil’s skirts. The burning carpet of roots made a choking smoke. Kara had come back to the door. “Come out of there!” she shrieked at us, and hurled another lantern into the flames. As it shattered, the fire roared and leapt higher. I snatched Amzil up and held her above the flames. We fled. The hall before us was dark, lit only by the dancing flames behind us. As I passed Kara, I tried to grab her by the arm. The child was faster. She swarmed up me like a little monkey and clung to her mother. I scarcely felt her added weight as I ran down the hall. Fire fears no magic, I thought. I glanced back once. Smoke was roiling toward us. The timbers of the ceiling were starting to kindle. I opened the door, ducked through it with my burdens, and then closed it quickly behind me. We were outside now, but still mostly concealed in the stairwell that led to the lower cells. Amzil slid from my arms to stand on her own. Kara was weeping, her shoulders shaking in terror. “Hush now,” I had to tell her. “We must go quietly.” The streets of Gettys seemed unnaturally dark to our fire-dazzled eyes. The door to the headquarters building was ajar and light spilled from it. We crept from the stairwell. Amzil started to go down the alley. I seized her hand and led her in the other direction. I did not want to pass the tree. We walked quickly, quietly, and turned off the main street as soon as we could. “We’ll have to make our way to a gate from here,” I told them. “And we’ll have to go quietly and unseen.” Kara suddenly ceased her muffled sobbing. In a thick little voice, she said, “The east gate. That’s where I sneaked in. He goes behind his sentry box to drink. Everyone knows that. He smells like Gettys Tonic.” The child was right. Once we were outside the walls of the fort, we limped through the deserted streets of Gettys Town. My feet were in agony and Amzil’s little better. I wanted to carry Kara, but Amzil would not let go of her daughter. As we turned toward the cottage on the outskirts of town where the other children and the cart awaited us, I asked Amzil quietly, “When did you recognize me?” “Kara was calling you by name. But I think I knew it was you when you threw me across the room and then flung a sword at me.” “Why?” “It was the look in your eyes. I don’t know how you can be here, or even how you can be Nevare. But I’m glad.” I knew it would be a foolish time to try and kiss her, and wasn’t sure how she would react if I’d tried to embrace her in front of her daughter. So we walked a while in silence before she suddenly exclaimed in annoyance. “Must I do everything?” she demanded of the night, and then seized my hand so that I had to turn to face her. She pushed in close against my chest and I held them, mother and daughter. I kissed the top of Amzil’s bent head. She smelled of lamp oil and smoke. It was a heady fragrance. She turned her face up to mine. I bent to kiss her.","sourceLink":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3/page-267.html","bookId":2015,"book":{"id":2015,"title":"Renegade\u0027s Magic (The Soldier Son Trilogy #3)","description":"Storyline: Loyal, privileged, and brave—a soldier in the service of the King of Gernia—Nevare Burvelle survived a devastating plague of enemy sorcery, but at a terrible cost to his soul, body, and heart. Now he stands wrongly accused of unspeakable crimes, including murder, the most heinous of them all. Suddenly an outcast and a fugitive, he remains a hostage to the Speck magic that shackles him to a savage alter ego who would destroy everything Nevare holds dear. Perhaps, however, this curse that has long abused him can be used by him instead—a mighty weapon he can learn to wield for his own purposes. But down what perilous road will this desperate new quest lead him? And what will be the ultimate incarnation of Nevare Burvelle?","cover":"https://allnovel.net/images/renegade-s-magic-the-soldier-son-trilogy-3.jpg","author":"Robin Hobb","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:51:23 PM"}}
