{"id":107019,"no":273,"title":"Page 273","content":"I scarcely heard her. A mounted troop of cavalla came up the street behind us, returning to the citadel from some mission. I turned to watch them come. The men had weathered faces, and their uniforms were dusty, but they rode as cavalla should, and their proud horses, however weary they might be, held up their heads and trotted in ranks as they came. Their colors floated over them, a small banner held aloft only by the wind of their passage. I watched them pass, a boy’s imagined future come to life. A young lieutenant led them, and just behind him came his sergeant, a husky man with long drooping moustaches and a permanent squint. At the end of their line, with them and yet apart, came a scout. With a lurch of my heart, I recognized him. More than a decade of years had been added to his face since I’d seen him stand up for himself and his daughter at Franner’s Bend. As he passed, he glanced my way. I suppose I was staring, for he gave me a nod and touched his hat to Amzil before he rode past, following the troops. I felt as if hooks dragged at my heart as I watched them go by. There, but for strange luck and stranger fortune, went I.\n “Look at Sem,” Amzil said softly. I followed her gaze to the boy who stood, awestruck, by the side of the road. His face shone as he looked up at the passing troops and his mouth was ajar. I saw the last rank of horsemen grinning at the small boy’s worship. The trooper closest to him snapped him a salute as he passed and Sem gave a wiggle of joy. “He looks just like you,” Amzil added, startling me from my reverie.\n “Who? That trooper?”\n “No. Sem. Staring with his heart in his eyes.” She gave a small sigh. “You’ll have to temper the tales you tell him, Nevare. Or somehow make him understand that only a soldier’s son can become a soldier.”\n “That’s not always true,” I replied, thinking of Sergeant Duril. “One of the best soldiers I ever knew was really the son of a cobbler.”\n “You’re the son of a soldier,” Amzil said quietly.\n “And now I’m a hired hand for a cattleman,” I said without rancor.\n “But you shouldn’t be,” she said.\n I made a sound of dismissal and gave a shrug. Her grip tightened on my arm as we walked. “Do you think I never heard Epiny and Spink talk about you, and how much you dreamed of a career? They often spoke of what it would be like if you could come back, clear your name, and serve alongside Spink. I don’t think they could imagine you doing anything else except being a cavalla officer.”\n “That’s gone,” I said.\n “Why? Why couldn’t you enlist here? Use your real name; you’ve never signed up with it before. I don’t think you’d be a common soldier for long. You might not be an officer, at first, but even if you never rose to the rank you were born to, you’d still be what you’d dreamed of being.”\n “Amzil—”\n “Don’t you think I know how important that is?”\n “I’ll think about it,” I said quietly. And truthfully, for I knew I could not help but think about it. We collected Sem and headed back to Thicket. The ride home was quiet, the children asleep in the cart bed while I was caught in my own thoughts.\n Two nights later, at dinner, Amzil abruptly asked me, “What holds you back from doing it?”\n “Fear,” I said shortly.\n We both noticed the children listening to us, and let the conversation die. But later that night, as we nestled together, Amzil asked without preamble, “Fear of what?”\n I sighed. “When my father first disowned me, he was very angry. And very thorough. He sent out letters to the commanders of various forts, letting them know he had taken his name away from me.”\n “You still managed to enlist at Gettys.”\n “Oh, yes. He left me that, telling them that if they could give me any sort of a life as an enlisted soldier, he would countenance that. Even so, I had to use a different name. He’d forbidden me his.” I sighed again. “Amzil, I don’t want to go back to living under that shadow. I don’t want to enlist as someone’s failed, disowned son.”\n She was quiet for so long that I thought she had fallen asleep. Then she said, “You’re already living as someone’s failed, disowned son.” She softened the words by putting her arms around me. “You should stop doing that,” she said quietly. And then she kissed me, and for a time I failed at nothing.\n When the month had passed, I returned to Mendy to see if I had any replies to my letters. Amzil rode along, tight-lipped and fairly quivering with excitement. In her lap, she carried two paper-wrapped dresses she had sewn. She intended to show them to the dressmakers in Mendy, to see if one of them might take her into his shop as an assistant. Kara and Sem each clutched two precious pennies they might spend. Dia held hers in a tiny cloth bag Kara had sewn for her. I left them to their errands and went to the letter-writer’s shop. \n","sourceLink":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3/page-273.html","bookId":2015,"book":{"id":2015,"title":"Renegade\u0027s Magic (The Soldier Son Trilogy #3)","description":"Storyline: \n Loyal, privileged, and brave—a soldier in the service of the King of Gernia—Nevare Burvelle survived a devastating plague of enemy sorcery, but at a terrible cost to his soul, body, and heart. Now he stands wrongly accused of unspeakable crimes, including murder, the most heinous of them all. Suddenly an outcast and a fugitive, he remains a hostage to the Speck magic that shackles him to a savage alter ego who would destroy everything Nevare holds dear. Perhaps, however, this curse that has long abused him can be used by him instead—a mighty weapon he can learn to wield for his own purposes. But down what perilous road will this desperate new quest lead him? And what will be the ultimate incarnation of Nevare Burvelle?\n \n","cover":"https://allnovel.net/images/renegade-s-magic-the-soldier-son-trilogy-3.jpg","author":"Robin Hobb","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:51:23 PM"}}
