{"id":107022,"no":277,"title":"Page 277","content":"Enclosed you will find sufficient letters of credit and cash for you and your family to make the journey back to us. Epiny has insisted to me that it is only right that a commission be purchased for you, and has made a very strong case for you to join Spink’s regiment, pointing out that as it is currently stationed at Franner’s Bend, you could frequently be at home and near your father. Your father has expressed to me his fond hopes that you will, instead, wish to serve your king under the standard of his old regiment. And I have indulged myself by writing to Epiny a three-page sermon in which I have waxed eloquent about the right of a young man to choose the regiment that he wishes to join.\n As you can see, we have much to discuss. I will look forward to receiving your response via the courier I have dispatched to Mendy.\n With great fondness,\n Your uncle,\n Lord Sefert Burvelle of the West\n I sat for some time in stunned silence. I looked into the packet and found, as my uncle had promised, a letter of credit for a substantial amount, and beneath it, cash carefully packaged in an oilcloth bundle. I hefted it in my hand without opening it. I did not need to. I knew it contained more money than I’d ever held in my life. With shaking hands, I returned it to the calfskin folder. I put the letters back in as well, in the exact order they’d arrived, as if I were carefully restoring a grave I’d disturbed. My heart had begun to thunder in my ears. It was only when I tried to lace the packet shut again and could not that I realized how badly my hands were trembling.\n I checked my pockets to see if I had enough coins to buy a second cup of tea. Barely, and for a moment I chided myself for being a spendthrift. Then I laughed aloud, called the serving girl over and asked her to bring me another cup of tea. I glanced up to see Amzil and the children trudging down the street toward me. I hastily amended the order, telling her to bring a pot of tea and half a dozen of the brown rolls with raisins.\n Amzil swept up to me in a flurry of skirts and chattering children. Her smile was brimming with good news. She plopped Dia into my lap, and as she sat down, she said with satisfaction, “Our troubles are over. He was very impressed with my work, and said I could start as an assistant at his shop within the week! At twice the rate I’ve been making in Thicket! Now tell me, Nevare, could there be better news than that?”\n “Perhaps there could, my dear,” I told her. “Just perhaps.”\n","sourceLink":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3/page-277.html","bookId":2015,"book":{"id":2015,"title":"Renegade\u0027s Magic (The Soldier Son Trilogy #3)","description":"Storyline: \n Loyal, privileged, and brave—a soldier in the service of the King of Gernia—Nevare Burvelle survived a devastating plague of enemy sorcery, but at a terrible cost to his soul, body, and heart. Now he stands wrongly accused of unspeakable crimes, including murder, the most heinous of them all. Suddenly an outcast and a fugitive, he remains a hostage to the Speck magic that shackles him to a savage alter ego who would destroy everything Nevare holds dear. Perhaps, however, this curse that has long abused him can be used by him instead—a mighty weapon he can learn to wield for his own purposes. But down what perilous road will this desperate new quest lead him? And what will be the ultimate incarnation of Nevare Burvelle?\n \n","cover":"https://allnovel.net/images/renegade-s-magic-the-soldier-son-trilogy-3.jpg","author":"Robin Hobb","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:51:23 PM"}}
