{"id":106788,"no":32,"title":"Page 32","content":"“Which do I owe you?” I was suddenly moved to ask him. “My death? Or my life?” He yawned, his pointed tongue wagging in his mouth as he did so. “Whichever I please, of course. I am the god of balances, you know. I can choose from either end of the scales.” He cocked a head at me. “Tell me, Nevare. Which do you think an old god such as me would find most pleasing? To demand your death of you? Or insist that you pay me with your life?” I didn’t know the answer and I didn’t wish to give him any ideas. My fears toiled and rumbled inside me. Which did I most fear? What did he mean when he said those words? That he would kill me and I’d become nothing? Or that he’d take me in death and keep me as his plaything? What if he demanded my life from me, and I became a puppet of the old god? All paths seemed dark. I stared up at him hopelessly. He fluttered his feathers again, then suddenly opened his wings. He lifted from the branch as effortlessly as if he weighed nothing. Then he was gone. Literally gone. I didn’t see him fly away. Only the swaying of the relieved branch testified that he had been there. “Do not wake him!” Olikea’s warning hissed at Likari did precisely what she had told the boy not to do. Soldier’s Son stirred, grunted, and opened his eyes. He drew a deeper breath, and then rubbed his face. “Water,” he requested, and both his feeders reached for the water skin that lay beside him. Olikea was a shade faster and a bit stronger. She had her hands on it first, with the better grip, and snatched it from Likari. The boy’s eyes widened with disappointment and outrage. “But I was the one who went and refilled it!” he protested. “He needs help to drink from it. You don’t know how. You’ll get it all over him.” They sounded for the all the world like squabbling siblings rather than a mother and her son. Soldier’s Boy ignored both of them, but took the water skin away from Olikea to drink from it. He nearly drained it before he handed it back to the boy with a nod of thanks. He yawned and then carefully stretched, noting with displeasure how the limp skin dangled from his arms. He lowered them back to his side. “I feel better. But I need to eat more before we quick-walk tonight. I would like cooked food to warm me; the world will cool as night comes on.” He groaned as he sat up, but it was the groan of a man who has eaten well, slept heavily, and looked forward to doing the same again. How could he be so unaware of all that had befallen me while he slept? Did he even sense that I still existed within him? How could he have been so blithely unaware of Orandula’s visit to me and how it had terrified me? Yet so he seemed. How had it been for him, submerged within me for the better part of a year? I recalled the moments when he had broken through and into my awareness, and the times when he had forced me to take actions. What had it taken, there at the Dancing Spindle, for him to push me aside while he first stole and then destroyed the magic of the Plainspeople? Had it been a burst of passion, or had he simply gathered his strength and waited for a moment when he desired to use it? I needed to learn how he had manipulated me and to discover why he was now ascendant over me if I were to survive and ever recapture control of the life we shared. I was not certain that I wished to be the one in command of our life, but I did know that I was reluctant to cede full control to my Speck self. I refused the notion that I might never again control my own body. The strangeness of the situation suspended my judgment of it. The terror I should have felt hovered, unacknowledged. Likari had anticipated Soldier’s Boy’s appetite. In his basket, there were several fat roots from a water plant and two bright yellow fish that were just now gasping their last breaths. The boy presented the basket expectantly. Soldier’s Boy nodded at it, pleased, but Olikea scowled. “I will cook these things for you. The boy does not know how.” Likari opened his mouth to protest, and then shut it with a snap. Evidently his mother had spoken true. Nonetheless, his lower jaw and lip quivered with disappointment. Soldier’s Son looked at him dispassionately, but I felt for the boy. “Give him something!” I urged my other self. “At least acknowledge what he has done for you.” I could sense his awareness of me, just as I had once been the one to feel his hidden influences on my thoughts and actions. He scowled to himself and then looked at the boy again. His shoulders had fallen and he was withdrawing. Soldier’s Son lifted the water skin. “My young feeder will fill this again for me. The cool water was very good to have when I awoke.” The boy halted. My words transformed him. He lifted his head, squared his shoulders, and his eyes sparkled as he smiled up at me. “I am honored to serve you, Great One,” he replied, taking the water skin. The words were a standard courtesy among the Speck when they addressed a Great One, but the boy uttered them with absolute sincerity.","sourceLink":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3/page-32.html","bookId":2015,"book":{"id":2015,"title":"Renegade\u0027s Magic (The Soldier Son Trilogy #3)","description":"Storyline: Loyal, privileged, and brave—a soldier in the service of the King of Gernia—Nevare Burvelle survived a devastating plague of enemy sorcery, but at a terrible cost to his soul, body, and heart. Now he stands wrongly accused of unspeakable crimes, including murder, the most heinous of them all. Suddenly an outcast and a fugitive, he remains a hostage to the Speck magic that shackles him to a savage alter ego who would destroy everything Nevare holds dear. Perhaps, however, this curse that has long abused him can be used by him instead—a mighty weapon he can learn to wield for his own purposes. But down what perilous road will this desperate new quest lead him? And what will be the ultimate incarnation of Nevare Burvelle?","cover":"https://allnovel.net/images/renegade-s-magic-the-soldier-son-trilogy-3.jpg","author":"Robin Hobb","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:51:23 PM"}}
