{"id":106796,"no":40,"title":"Page 40","content":"Epiny had lifted her eyes to Lisana, and when her gaze fell on my ephemeral self, she gasped. She lifted a seeking hand toward me, as if she would strive to touch me. “Nevare?” she asked.\\n\\n Soldier’s Boy glared at her and then leaned close to the tree stump. “Lisana?” he pleaded. We all ignored him.\\n\\n I found my words. I suddenly knew that only the truth could satisfy her, and I gave it to her. “Epiny. Epiny, my dear. Yes, it’s me. I’m here. I’m sorry. I did what I had to do. I used the magic to make Spink and Amzil believe I was dead. I made the entire mob in the street there believe that they’d achieved their goal and beaten me to death. Then I left. It was the only way for me to escape cleanly, the only way to break my life off from yours.”\\n\\n “But—” Her eyes were wide with shock. She looked from me to Soldier’s Boy in my body and back again.\\n\\n I spoke hastily, talking through her attempted interruption. I knew Epiny well. Once she started talking, I’d never get a word in edgeways. “The magic wouldn’t let me stay. Don’t you see? It boxed me in and gave me no choice. If I’d tried to stay, the mob would have beaten me to death. Amzil might have survived being raped by them, but I doubt it. And we both know that Spink would have forced them to kill him, too, before he would submit to simply witnessing something like that. The magic wanted to make it impossible for me to go back to Gettys, to force me to flee to the forest and do its will. The magic won.”\\n\\n Epiny was panting, both from the warmth of the day and her exertions. Her shoulders rose and fell with it. As I’d spoken, fresh tears had begun to stream down her dirty face. I thought they were for me. They were not.\\n\\n “We both know that Spink would never have allowed them to beat you to death without throwing himself into the fray. It runs counter to all that he is. And yet, Nevare, you have left him believing that somehow he allowed it to happen and emerged from it with only a few bruises. Amzil must believe that as well; she insists that he sacrificed you to save her. They are both miserable. Last night, for the first time, Spink decided that he needed Gettys Tonic. Rum and laudanum. It let him sleep, but when he awoke, he looked no better. So he took a half dose and went off to his duties. He left in a haze. Amzil dosed both herself and the children into oblivion; they were still sleeping when I left. I do not know what is to become of any of them.\\n\\n “Spink resisted both the gloom and the terror of the magic for so long. Now that he has crumbled twice, I fear his walls are breached. I do not think—”\\n\\n Her words ran out as if her private fear were too terrible to utter aloud. She gave a half sob and, before I could speak, asked me angrily, “Do not you see, Nevare? What you have chosen for all of us saves none of us! The magic will still destroy us; it will just take longer to do it.” She swung her gaze to Lisana. “And so I will say it again. The ‘bargain’ you offered me was a cheat and a sham. I did as you asked, I did as the magic asked, and in return, all will be taken from me.”\\n\\n “I do not control the magic,” Lisana replied stiffly. “It does as befits the People.” Her words were cold but I suspected that she had been moved by what Epiny had said.\\n\\n “Can you see her? Can you speak to her?” Soldier’s Boy asked wildly.\\n\\n Epiny glared at him. “She’s right there. Cannot you see her?”\\n\\n Lisana answered her question. “As I told you. I cannot control the will of the magic. Soldier’s Boy does not see me, and I can speak only to the facet of him that is Nevare. Perhaps it is our punishment for failure. Perhaps it is simply the effect of dividing the soul. One half often acquires an ability at the expense of the other half.” She hesitated and added in a low voice, “I never foresaw that he would remain divided this long. Whole, I think he would succeed.”\\n\\n “I cannot see her. I cannot hear her. I cannot touch her.” The frustration in Soldier’s Boy’s voice was apparent. Olikea, behind him, looked affronted.\\n\\n I knew what it was, without understanding it. “I kept that part. I kept the part that lets me see and speak with Tree Woman in this world. Because—” I fumbled toward knowledge and guessed, “Because that part had always belonged mostly to me. When Soldier’s Boy was with you, he was in your world. I had to reach to speak to you from mine.”\\n\\n “Do you think so?” Lisana asked me, and it was a genuine question.\\n\\n Epiny sank down exhausted on the moss. She pushed her tumbled hair back from her sweaty face. “What does it matter? It’s all destroyed. There is nothing in this life left for any of us. It does not matter who you love, Nevare, in what world. Neither you nor the one who wears your body will have joy and peace. And I must go home to the slow destruction of mine.” \\n\\n","sourceLink":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3/page-40.html","bookId":2015,"book":{"id":2015,"title":"Renegade\u0027s Magic (The Soldier Son Trilogy #3)","description":"Storyline: Loyal, privileged, and brave—a soldier in the service of the King of Gernia—Nevare Burvelle survived a devastating plague of enemy sorcery, but at a terrible cost to his soul, body, and heart. Now he stands wrongly accused of unspeakable crimes, including murder, the most heinous of them all. Suddenly an outcast and a fugitive, he remains a hostage to the Speck magic that shackles him to a savage alter ego who would destroy everything Nevare holds dear. Perhaps, however, this curse that has long abused him can be used by him instead—a mighty weapon he can learn to wield for his own purposes. But down what perilous road will this desperate new quest lead him? And what will be the ultimate incarnation of Nevare Burvelle?\\n","cover":"https://allnovel.net/images/renegade-s-magic-the-soldier-son-trilogy-3.jpg","author":"Robin Hobb","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/renegade-s-magic-the-soldier-son-trilogy-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 10:51:23 PM"}}
