{"id":93689,"no":17,"title":"Page 17","content":"Rhoda’s constellations had vanished. She didn’t even know they were there until they were gone. There were the joggers in the morning that let her know she would be early to work, kids being walked to school by their parents or older siblings, trucks squeaking to a stop by curbs so burly men could unload boxes of food and cases of beer. There were the subways full of people hurrying for trains, the express packed so full that the last ones in had to laugh, their skirts flapping between the rubber seals as the conductor—after four or five tries to get the doors together—finally zipped them away from the station. thump. There were the nighttime stars that gave her the hour as well. The crush that spread from Times Square when the shows let out. The boys and girls in tight jeans flowing to and from Brooklyn in the wee hours, looking for somewhere hip to hang out. The city changed by the hour. It changed by the day. The flower district seemed to explode more lushly on Tuesdays and Thursdays. The streets fell quiet on the weekends, the cabs thinning to a yellow trickle for much of the morning. Time. Taken for granted. Everything changing until it didn’t, until the sameness stirred memories of the way things used to be. clackclack. clack. thwump. Rhoda enjoyed the walk through the park. The glass in her feet didn’t press so hard, and there was less of it to pick up. She watched a young girl chase a squirrel through the woods. The girl moved fast for one of the dead, was either recently turned or mad with hunger. Rhoda wanted to call out that it was no use, to leave the poor things alone, but she probably wouldn’t even if she could. It wasn’t as if the girl had a choice. The sun rose while she walked aimlessly. That distant star no longer lit the undersides of the tall trees, but began to dribble light down through them. Rhoda passed the wide streets where cars were not allowed, the separate paths for bikes and anything on wheels. The joggers were the only thing missing from the hour. There was just one man, a pathetic man on rollerblades, sitting on his ass with a haunting and bewildered look on his ashen face. One of his arms was broken and flopped with an extra elbow as he tried to push himself up. There would be something comical about his plight if Rhoda didn’t know that a man was still inside there. Still trapped. Locked in the hour. He was like a broken clock that only felt right once a day as the rising sun came to him. She watched him struggle and felt like weeping, imagining what it must be like to be locked in that head, strapped to those skates, pushing down with an arm that gave way where arms shouldn’t. A young girl chased a squirrel and ran face-first into a tree, and nothing about that was funny to Rhoda. The man in skates tried once more to get up, but the hour for skating had passed him by. What remained was sad and pathetic, an awful drumbeat beneath the singing birds, a sound that faded as Rhoda chased a scent of the living world she once knew and was starting to forget. clack. clack. thump. 35 • Margie Sikes Margie chased the living down the street, her old bones moving better than they had in decades. The survivors had squeezed through a gap between two buildings, another group of undead flushing them out. She moved as quickly as she could, her legs rotting and yet not falling apart as they once had. This was something different. Now, she could practically totter. It felt so fast. Dozens of others shuffled along behind, a few keeping up. The running meat, five survivors, were hurrying through an alley a block and a half away. Margie could picture them, even though they weren’t yet in sight. She’d seen enough survivors clutching their belongings and glancing over their shoulders with wide eyes. They were invariably thin and gaunt, looking like how Margie felt. Hunger drove them out. It stirred the living much as it moved the dead. For weeks, these survivors had taken to scurrying like roaches through the impressive towers of glass and steel, scrounging for crumbs, avoiding the slow horrors in the hallways and cubicles until the primal need for food or water forced them out into the streets. Margie remembered. She remembered her own time hiding out, scrounging, getting up from a bed she had long fibbed about not being able to leave. This group of five made a now familiar dash. They ran from one island tower to the next, the streets between like shark infested waters. Margie could smell each one of them like a distinct meal. Her hunger noted their hunger, this trotting meat marinating in a hormonal blend of fear and panic that she longed to taste. Another pack emerged from an alley; they stopped and turned what was left of their soft noses into the breeze, half circles of bone visible beneath their haunted eyes. Holes where noses once lay groped for the scent, for the smells that had become something like flavored ropes in the air. These holes in rotting heads grasped for scented threads that led back to their source, to the meat running and clutching their belongings. The world looked different and strange to Margie. She could see the odors in the air. This was how prey saw the world, she thought. This was how deer made scarce when man intruded. They knew long before they could see. A small pack of undead lumbered after the survivors. Larger and slower armies converged from all over. There was no escape. Just a matter of time. Who ate and who didn’t. Who went hungry and who got a nick and managed to get away to become something worse than starvation. The others, the slow, they were converging. The meal would be hemmed in. Margie went as fast as her body could, passing a few less fortunate, the longer-since dead, those with clumsy wounds. Her body was degrading as well. Only a matter of time. She caught sight of her arms and hands as she hurried along, the holes in the flesh only half the story. The soft parts of her were going to waste on the inside as well. Bone rubbed on bone where tendons and cartilage used to lie. At times, Margie squeaked. Her curse had taken hold a week ago, give or take. The senseless nights made it difficult to be sure. Others in her pack fared better or worse, rotted more swiftly or slowly. It was a puzzle, everything a puzzle. Something to keep her mind occupied. The group of five was going to emerge from the alley ahead. Margie could smell them coming. They had chosen to make their break in the predawn hours. Smart. The wind was at its most calm during the break of day. Scents were relatively feeble. But then, the living had no idea the traces they left, the odors they put out, how the molecules swam through the air. For them, it was all guessing. She remembered guessing like this, back before she knew. Two females and three males. Even out of sight, she could nose them. She followed. Not followed, moved to intercept. They were coming toward her, half a block away. There was a surge of panic and disappointment in the air as one of their number tried a door and couldn’t get in. The living made it hard on their fellow man—their barricades were everywhere. It was only the desperate starvation that drove them to this. The last of the candy from smashed vending machines, another water cooler bled dry, that secret stash in a nurse’s bottom drawer of Cheetos and diet cola, the cramps and headaches from meals of sugar and little else. Margie remembered. The hospital had descended into chaos. Food lying around everywhere, but not for the living. Food lying in beds, watching TVs. Her small pack broke out of the alley and across 6th, the Avenue of the Americas. Street signs seemed pointless with all the unmoving cars. No one was going anywhere. She moved to intercept five students of this lesson, five who were about to learn. The end of them was inevitable. She had seen it play out too often the past weeks and from both sides. Sometimes she rooted for the living when they made a break for it—but pity turned to contentment as the meat was corralled. The living made mistakes, simple ones from her vantage, the same mistakes she’d made and that the man in the ragged overcoat beside her must’ve made, that all of them in her pack had made. Dire mistakes that now made sense. Hidden secrets, which seemed suddenly clear. Give her a second chance with what she now knew, give back her youth and this knowledge, and Margie thought she’d make it. She’d be one of those she heard about in rumors who swam the Hudson or East River to safety. She’d be one of those. The small group of survivors spotted her pack as they emerged from the alley. Margie scurried after them. The living twitched in a way that made them stand out from their surroundings. Everything else swayed and lurched, lurched and swayed, the dragging of limbs, the pendulum swing of darkened stoplights, the dance of debris caught up in the wind. But meat alive had a raw panic in its joints. Heads turned this way and that, noses blind, eyes scanning the littered streets, wary of danger. Two of the men in the group wrestled with a door while a pair of women supported a third man, who seemed to be the one filling the air with blood smells. There were plenty of buildings wide open, plenty of gaping maws bashed in with glittering and ragged teeth. But these were both ransacked and infested. Margie remembered. A group of five didn’t last this long without learning a few things. She found herself rooting for them a little more as her pack closed in. They were smart, this group, but time was running out. Others were out sniffing for a meal. Margie spotted the rhythmic lumbering of their approach from a block north, a pack twice the size of her own. They would converge, she saw. The two men rattled the door, desperate to get inside. They knew better than to bash it down with a trashcan, to destroy the walls they would soon need. The smell of the bleeding one was intoxicating. Margie was near the front of her pack, joints squeaking, angling through the frozen traffic, piles of clean bones scattered across front seats, just half a block away. Margie could see the wide eyes on the girls, the whispering and urgent lips. Too skinny, these survivors. She wondered if these women had been too skinny to begin with. The men wrestled with the door and watched both packs grow nearer, the dead closing like a vise. They were being stupid, now. It was time to run. Time to grab one of those steel trashcans and bash a hole through perfect teeth. The time for smart was petering out. A hundred feet away. The bleeding man hopped on one foot, scanning the doom lumbering at his group from all sides. A third pack tumbled around the corner from 22nd. This would be a big feed, an ugly one. Five bodies and five hundred mouths. Margie felt a rush of dread even as she quickened her squealing and squeaking pace. Two of her fingers had disappeared in a feed like this, back in those first days. She still wasn’t sure if she’d done it herself or if it’d been a neighbor. Her brain had wandered into some kind of orgasmic state, the feed witnessed through a straw of awareness, pure pleasure squeezing down around her. She moved now as fast as she could, wishing she could turn and run the other way, confused by the stupidity of the men wrestling with that unyielding door. Paces away, now. Packs converging. The roar of pure hunger, of intense starvation, like waves crashing on a beach. Margie marveled for the millionth time at this city that could not feed itself, these towering islands reliant on daily deliveries, reefers idling along the curb, men with carts pushing boxes of food from open farmland over the rivers and a distant world away. No more than two or three days of food stockpiled on the island, isn’t that what someone had told her? And it had been run through quickly. And now these poor and ragged things were being swarmed by sharks as they hunted for a scrap or two. Margie nosed ahead of the others. A man wearing the remnants of a business suit at the head of the opposite pack would beat her to them, but there was enough meat for them all. Here was where rooting for the survivors ended, where her own needs took over. The world around her narrowed as she anticipated the orgasmic feast. The five survivors were surrounded, walking corpses staggering between all the parked and wrecked cars, every avenue of escape writhing with the undead, closing on the wide-eyed and the stupid, stupid meat. Movement inside the glass building was mistaken for a reflection at first. But it was the hurry and twitch of the living. One of the men by the door shouted to the heavens, a curse or a blessing or a command. Margie was near enough to taste them when the wires went taut. The bleeding man straightened, the women stepped away, angry fire replacing the fear in their eyes. Margie groped ahead of herself, pawing the air, as the group floated up, sneakers squeaking on a wall of glass, the shouts from concerted others a few stories up, their smells drifting down as the overpowering scent of the bleeding man faded. Three packs converged. Margie was hungry enough to eat the man in the tattered business suit, whose flesh had not been rotting for long, might still taste alive. They bumped and jostled while wires sang and sneakers squeaked. There was movement inside the building. Margie watched. She saw her own reflection, the hideous condition of herself, half naked and dilapidating, a hole in her skull where her nose had been, what flesh remained already old and wrinkled and revolting from a life much too long in the living. And beyond her reflection, a man with fire. A twinkling fuse, a rag like a candle. Legs that could still run, fading deep into her reflection, disappearing into the building’s hallway guts. The merging packs formed a crush of rot, the heady scent of blood and flesh replaced by the stench of the unburied dead, the blood and shit and half-digested flesh in their pants and under their skirts, the groans vibrating through the mass as they all pushed in toward an empty and confusing feed. Margie was pinned against the glass, the living scampering above to safety, a drop or two of sacrificial blood plummeting down from the heavens. The fuse shortened. The candle burned down to the red jug stenciled with the word “gas.” Margie tried to scream, her loose flesh coming off as she was smeared against the window, remembering how stupid she’d been. Remembering. Until, in a flash, she could remember no more. 36 • Carmen Ruiz There was a stabbing pain in Carmen’s gut like the twist of a knife. She felt her knees wobble and very nearly buckle as the thing in control of her responded to a hurt for once. Her body seemed startled by the sensation. A few steps more, and the jolt came again. Her chin dipped toward the source, eyes falling to her swollen belly protruding naked and taut between her sagging skirt and bunched-up blouse. It was dim on the back side of the cubicles near the copier room, but she could see her protruding bellybutton like a small thumb sticking from her belly.","sourceLink":"https://allnovel.net/i-zombie/page-17.html","bookId":2577,"book":{"id":2577,"title":"I, Zombie","description":"Storyline: ***WARNING: NOT FIT FOR HUMAN CONSUMPTION*** This book contains foul language and fouler descriptions of life as a zombie. It will offend most anyone, so proceed with caution or not at all. And be forewarned: This is not a zombie book. This is a different sort of tale. It is a story about the unfortunate, about those who did not get away. It is a human story at its rotten heart. It is the reason we can\u0027t stop obsessing about these creatures, in whom we see all too much of ourselves.","cover":"https://allnovel.net/images/i-zombie.jpg","author":"Hugh Howey","type":"Horror","source":"allnovel","link":"https://allnovel.net/i-zombie.html","creation":"Oct 5, 2019 8:58:53 AM","modification":"Oct 5, 2019 6:03:42 PM"}}
