{"id":93693,"no":21,"title":"Page 21","content":"There was a smell. Lewis fell to the ground, sniffing. Others joined him. They could go even closer to the stage, he realized. They could go under it. He crawled inside the compartment, over a cardboard box wrapped in tape and past a duffel bag. A few suitcases crowded a dark corner, the other side of the compartment shut tight. Lewis banged against it. Others pressed up behind him, knees ringing on steel, heads hitting the roof, dark and cramped and slamming against this other door, wondering if it might pop loose as well. 44 • Darnell Lippman They left Darnell alone on the gurney with her thoughts. When her head twisted to the side, she could see them working on one of the others in the adjoining room. They crowded around while the monster thrashed, back arching and knees kicking, men in rubber suits trying to hold it still while doctors went to work. She didn’t see it all. Her eyes roamed, following the smells coming through the loose joints and cracks of the place. It looked hastily put together. It reminded her of Lewis’s boat with its rough scars of metal where he used those bright torches to join plates together. The glass was glued in with something like that 5200 stuff. She knew from the clothes he ruined. “What’s this?” She would scratch at the hardened crust on his blue jeans. “Fifty-two-hundred,” he’d say. Always 5200. Funny the things she remembered. The barge didn’t sway much, not that she could tell. It was anchored by those taut cables and the stiff current. It had to be a good sign, this quarantine. They were trying. There were people out there trying something. The non-infected were doing more than running away or fighting back. And the bridges, that had to be good, too. Darnell thought so. There were so many others to think about. The kids, her parents, all her friends back home. They would be watching TV and calling the authorities, letting them know she and Lewis were in the city, that their cell phones were going straight to voice mail, that they needed help. Help is here, Darnell thought. Help is coming. They finished what they were doing to the monster in the next room, and then they came for her, five of them in yellow rubber suits, the same material as Lewis’s knee-high fishing boots. They had hoods built into the suits with plastic visors the size of lunchboxes. Two men with wrinkled brows stood over her and held her shoulders. Darnell felt herself lunge after them, teeth clacking, and she wanted to apologize for this behavior the way her sister was forever apologizing for her yipping dogs. “It isn’t their fault,” Gladys would say. “They’re just being dogs.” An older woman leaned over, wisps of gray hair framing a face of concentration or worry, hard to tell which. She had old eyes with crow’s feet at the corners and directed the others, her voice muffled by the plastic but her lips moving. She pointed with her thick gloves while machines were arranged, more tools laid out. Darnell’s body twisted and strained against the straps pinning her into place. It was as if the monster side of her knew better than she did what was about to happen. It was as if it were more afraid than she. They tightened the straps to keep her from yanking about. She could barely move. It felt wonderful to be pinned perfectly still like that—her limbs could no longer betray her. They would see, now that she was calm, they would see in her eyes that she was okay, that she was more terrified than they were. Her clothes were cut off, nasty scraps of fabric peeled away and preserved like they were unwrapping a gosh-darned mummy. Swabs on her skin, placed into baggies. A long stick shoved between her teeth and her gums, bagged up as well. Yes, take your samples, Darnell thought. Make me better. She was thinking this as the swabs and the wooden sticks were put away. A black bundle was placed on the steel table. Plastic canisters like Tupperware were arranged. Someone began to draw on her, began to probe her skin and tap on her chest with stiffened fingers. Darnell pleaded with her eyes—she tried to let them know she was in there. She tried to speak, all to no avail. The bundle was unrolled. It reminded her of her mother’s silverware. And then the implements were removed, one by one, and placed on the table. Curved things that gleamed in the overhead light. Tiny and sharp things. Something like pliers. Alien tools. Expensive tools. The old woman with the kind and wrinkled eyes held out a gloved hand. Her lips moved, and a tiny blade was placed handle-first into her palm. Darnell gurgled and tried to form the words. She wanted to cry, but felt nothing on her cheeks. In the next room, a monster rattled its chains behind the glass. Please, Darnell thought as the blade was brought to her stomach. Don’t. There was a dull ache as the woman went to work. Not the sharp sting of a little cut, but the deep bruise of something much worse. One of the men by the table of tools turned and looked away. The other reached forward with the little canister like something used for leftovers while the woman with the wrinkled eyes took her sample. A pinch. The smell of rotten blood. Another sample—Darnell in agony—but no closer to death, as they removed her flesh piece by gory piece. They aren’t here to save me, she realized. Dear God, they’re seeing what it takes to kill me. 45 • Lewis Lippman It was loud in the compartment. Not just the constant banging of knees and elbows, but the grunts and groans from those pressed in beside him. Lewis hit his head repeatedly on the metal arms that held the door shut from the inside. His hands slapped uselessly against the wall. But it was someone else that broke the door free. Just the right spasm with their hand, and suddenly a crack of light appeared at Lewis’s knees. The dark barrier in front of him hinged up, swung away, and vile humans swarmed out like dirty rats. There was a cry of alarm, someone screaming, gunshots. Bodies tumbled over Lewis and crawled forward. They stood and lurched toward the men and women scrambling everywhere. They fell down when shot or just spun around and kept going. Lewis tried to stand and kept getting knocked back down. So many. Like oil spilling through a funnel, coming and coming. The gunshots were like fireworks, pow pow pow. The smell of meat, human and something else. Something cooking. Dogs or birds, who knew? Chaos. An encampment of cars. The cars were like tents, people moving inside, more running from a clearing in the middle of the intersection to dive into open vehicles and slam the doors shut. Windows were cracked, barrels poking out. Their aim wasn’t good. Lewis saw one of his kind break out the back glass of a yellow cab and begin to worm her way inside. Her dress caught and tore on the bumper. She was shot in the head and fell limp, but there were more to follow. People were shouting about the bus, trying to organize, but it was every man for himself. The undead swarmed, spilling and spilling through. Lewis banged on the side of a car, trying to get at the meat inside. A pistol, a small black thing, waved in his face. The muzzle flashed like a camera, the taste of powder in his mouth, a punch to his teeth. Lewis spun around as another shot went off, the zing of a far ricochet. Another zombie reached her fingers in the window, a young girl, a teen. She broke the top half of the glass out just as a bullet went through her brain. Collapsing, her arms twitched against Lewis’s shins as he reached through the hole she’d made. A bullet slammed into his shoulder, a last gasp from the young man inside, and then Lewis had a hold of him, others had a hold of him, dragged him out into the streets. Gunfire grew heavy, and then lessened. There was a pause for reloading, a last round of patter, and then the relative quiet as a boisterous family finally sat down to eat. The feed became an orgy. Fights broke out over the scraps, a man still able to scream as his arms and legs went different directions, lungs bellowing even as ropes of purple intestines were pulled away like a magician’s scarf. Lewis spun in the middle of it all, eating and terrified, wounds throbbing, the muted pops of gunfire fading into the distance, the sudden appearance of a helicopter several blocks away, doing nothing, watching, drawn perhaps to the noise of this last stand, this party, the fireworks and celebration of no one’s independence. 46 • Darnell Lippman The woman in the suit was clinical and calm as she went about her sample-taking. It didn’t matter that Darnell felt alive, she was cut into like a cadaver, like a swollen thing washed up on the rocks. The straps kept her pinned to the table, muscles straining futilely. She tried to scream as the knife bit into her, but the cry for help stayed with the agony, locked up inside her head, hers alone to hear and endure. The doctor rarely looked Darnell in the face as she worked. Her exhalations fogged the plastic visor of her suit, and her voice remained a muted drone. But when her lips moved, the men behind her reacted. Some kind of radio, like on Lewis’s boat, like the handheld he kept by the recliner in case a fishing buddy got into trouble. Darnell imagined squeezing that radio and calling for help, calling for Lewis to come and get her. She was awash in misery, drowning, stranded, bit at by gleaming fish that carried away her flesh. And the worst part was that she couldn’t die. Her twitching muscles felt near enough like wracking sobs. Struggling on that table felt near enough like times she’d clutched her knees and sobbed quietly in the tub. Life and love. When the bad parts crept in, sometimes she wished it would end. Wished there was some quick way out for cowards. She loved her husband, wasn’t sure how not to, but sometimes she sat in the tub with the water running dangerously hot and wanted out. Like now, just wanting to die. The doctor took something from her abdomen without asking. Machines beeped and whirred as they measured the nothing. But there was still something there, something they couldn’t take. And the struggles against those straps felt near enough like uncontrolled sobs. Darnell opened her eyes, couldn’t remember closing them, wasn’t sure how. But the dry and burning in them that she had long grown used to was gone for a moment, something like a spider’s touch tickling her rotting cheeks. And above her, a fogged visor cleared as the old woman with wrinkled eyes held her breath, watching, squinting, staring through Darnell’s eyes and deep into whatever remained of her soul. Darnell lunged forward with her thoughts, her prayers, her begging wishes. She felt her arms and legs strain against the straps. She screamed and screamed as loud as she could, yelling “HEY!” and “HELP!” and “I’M ALIVE!” The woman in the puffy suit remained frozen. After a pause, her lips moved. The men by the tables stirred, hard to see what they were doing. The doctor held Darnell’s gaze a moment longer, then pulled away, the flash of a blade disappearing, the torment coming to an end. Darnell was left in motionless agony. All her new wounds sang to her. They were electric currents clipped to her naked flesh, the juice dialed up and down, up and down, sagging and spiking. She lay there for what felt like days. When her head lolled to the side, she could see the man in the next cage bucking against his straps, no one else around. The people in the puffy suits returned. A bright light stabbed Darnell in the eyes. The man holding her head wore metal gloves of a fine mesh that reminded Darnell of Lewis cleaning his fish. Lewis sometimes wore gloves like that. Her head was strapped still. She had the sense that things would soon get worse, not better. More probes were stuck to her flesh, itching. Equipment set up. Something by her head, a heavy box, scraping against the metal surface of the table. The doctor held a wire, a thin cord. She bent it into a gentle curve, tapped her finger on the end and there was a harsh pop from the box. She did this again: tap, tap. Pop, pop. Darnell could smell oil on the metal glove as the man forced her chin down, as he held her mouth open. The doctor’s lips were moving. She slid the cord into Darnell’s mouth, across her tongue, into her throat. The box, the speaker by her head, amplified the grunts and rattling groans. Darnell was horrified by the sound of what she’d become. It was like a mirror turned on a burn victim. She cried out, and the speaker hissed with her pointless breath. Darnell wondered how long it could go on, how many ways they could experiment on her, when her affliction would finally end. The woman with the kind eyes watched her, waiting, measuring something. Darnell had no idea. They all seemed to be waiting. Expecting. What had they seen? They were looking at her differently, now. Like they wondered if someone was peering back. “I’M HERE!” Darnell yelled. She screamed with that voice that appeared when she read, when she thought to herself, that silent voice that somehow could be heard, could have an accent, could be quiet or loud, but always silent. “HELP!” she cried. “HELP HELP HELP HELP.” She threw the words over and over, pounded them like her pulse forgotten, made that reading voice a wispy rattle in her neck, audible in her cheeks, deafening in her skull. “I’M ALIVE! I’M ALIVE! I’M IN HERE! HELP! HELP! HELP!” The speaker gurgled with wet sounds. Something was adjusted. The doctors leaned close as if they heard a whisper. Darnell could only hear her pleading screams in her head and the amplified, bodily noises her thrashing made. HELP HELP HELP. There came a trickle of tears from her exertion. Wrinkles faded as eyes widened. And Darnell felt the strangeness of a connection, of a person reacting to her thoughts, the thrill of communication. Her chest and neck felt sore from trying so hard to scream, it coming out no more than a hissing whisper. But it was enough. The cord was extracted. The doctor stood. Equipment was gathered, and once again, Darnell was left alone for what felt an eternity. •••• They returned with a roll of paper, a gently curving line etched down the middle, nearly flat, something from one of their useless machines. It was just paper, now, something to write on. That’s all it would ever be. With a fat black marker, the same kind they’d used to draw on her flesh before cutting it, something was written:","sourceLink":"https://allnovel.net/i-zombie/page-21.html","bookId":2577,"book":{"id":2577,"title":"I, Zombie","description":"Storyline: ***WARNING: NOT FIT FOR HUMAN CONSUMPTION*** This book contains foul language and fouler descriptions of life as a zombie. It will offend most anyone, so proceed with caution or not at all. And be forewarned: This is not a zombie book. This is a different sort of tale. It is a story about the unfortunate, about those who did not get away. It is a human story at its rotten heart. It is the reason we can\u0027t stop obsessing about these creatures, in whom we see all too much of ourselves.","cover":"https://allnovel.net/images/i-zombie.jpg","author":"Hugh Howey","type":"Horror","source":"allnovel","link":"https://allnovel.net/i-zombie.html","creation":"Oct 5, 2019 8:58:53 AM","modification":"Oct 5, 2019 6:03:42 PM"}}
