{"id":20146,"no":9,"title":"CHAPTER IX. THE ENEMY\u0027S COUNTRY.","content":"It must have been at least five minutes before those exhausted men moved again; when at last they managed to rise to their feet it was to find themselves in the midst of absolute darkness, with the wild sea on one side of them and on the other no one knew what. \\n\\n \\n\\n The faint point of light which they had seen had now disappeared: but they took it to mean that there were Spaniards in the neighborhood. \\n\\n \\n\\n And they did not fail to recognize the peril in which they were. The firing had probably been heard and the wreck of the merchantman seen. If so, the Americans could not be in a much worse place. \\n\\n \\n\\n \"We may be right in front of a battery,\" whispered Clif. \\n\\n \\n\\n The first thing the sailors did was to see to their revolvers and cutlasses. And after that they started silently down the shore. \\n\\n \\n\\n \"We won\u0027t try to go far,\" Clif said, \"but we must find a hiding-place.\" \\n\\n \\n\\n But in that darkness the hiding-places were themselves hidden; the best the Americans could do was to stumble down the shore for a hundred yards or so, being careful to walk where the waves would wash out their footprints. \\n\\n \\n\\n Then they were a short distance from the wreck and felt a trifle safer. \\n\\n \\n\\n \"We may as well strike back in the country now,\" said the leader, \"at least until we can find some bushes or something to conceal us.\" \\n\\n \\n\\n That was a rather more ticklish task, and the men crouched and stole along in silence. They had no idea what they might meet. \\n\\n \\n\\n It was fortunate for them that they were quiet. Otherwise they would have gotten into very serious trouble indeed. \\n\\n \\n\\n They stole up the sandy beach a short ways, feeling their way along and getting further and further away from the sea. They were struggling through soft dry sand. \\n\\n \\n\\n And suddenly Clif, who was in front, saw something loom up before him, a dark line. And he put out his hand to touch it. \\n\\n \\n\\n He found that the sand rose gradually into a sort of drift or bank. It was high, and seemed to reach for some distance. \\n\\n \\n\\n The sailors stopped abruptly, and Clif crept softly forward, feeling along with his hands; suddenly the men heard him mutter a startled exclamation under his breath. \\n\\n \\n\\n \"Men,\" he whispered, \"we\u0027re in a terrible fix; I ran into a gun!\" \\n\\n \\n\\n \"A gun!\" \\n\\n \\n\\n \"Yes—a big one. We\u0027ve struck a Spanish battery, and we must be near some town!\" \\n\\n \\n\\n The sailors stared at him aghast; and then suddenly came a startling interruption—one that fairly made their blood grow chill. \\n\\n \\n\\n \"Who goes there?\" \\n\\n \\n\\n It was a loud, stern hail in Spanish, and it seemed to come from almost beside them! \\n\\n \\n\\n Quick as a flash the Americans dropped, crouching close together in the darkness. They could hear the beating of each others\u0027 hearts. \\n\\n \\n\\n There were several moments of agonizing suspense; the Spaniard who had shouted out was evidently awaiting a reply. And then suddenly he repeated his challenge. \\n\\n \\n\\n \"Who goes there?\" \\n\\n \\n\\n And a moment later came a sound of hurrying footsteps. \\n\\n \\n\\n \"What\u0027s the matter?\" Clif heard a voice demand. \\n\\n \\n\\n He was the only one in the party who understood Spanish, and knew what was said. But it was plain to the rest that it was a conversation between a sentry and an officer. \\n\\n \\n\\n \"I heard a footstep, senor capitan!\" cried the man. \"Quidada! Take care! It\u0027s very near.\" \\n\\n \\n\\n There was a moment\u0027s pause. \\n\\n \\n\\n \"You must be mistaken,\" said the officer. \\n\\n \\n\\n \"I am not mistaken,\" repeated the man firmly. \"Santa Maria, my ears do not deceive me. You said to be watchful, for you have heard firing.\" \\n\\n \\n\\n To that the Americans had listened in trembling silence; but the next made them jump. \"I will light this lantern,\" said the officer. \\n\\n \\n\\n And the instant they heard it Clif rose silently to his feet; the men did likewise, and began to creep softly off to one side. \\n\\n \\n\\n But careful as they were they could not help the grinding sound of their footsteps in the sand, and it caught the quick ear of the Spaniard. \\n\\n \\n\\n \"Hear it!\" he cried. \"Por dios, again! Somebody is stealing upon us!\" \\n\\n \\n\\n And an instant later the air was rent by a sharp crack of a rifle—the sentry had fired! \\n\\n \\n\\n There was wild confusion at once, and the unfortunate castaways were aghast. For an instant Clif thought of charging the battery—with four men. But he realized the folly of that. \\n\\n \\n\\n \"Quick!\" he cried, \"let us hide. Forward!\" \\n\\n \\n\\n Lights were flashing and men shouting and running about behind the sand wall just in front of them, but the sailors were still unseen. They broke into a run and fairly flew down the shore. \\n\\n \\n\\n They fancied the whole Spanish company was at their heels; but after they had run for some distance they found that they had not been pursued. \\n\\n \\n\\n For the enemy were so taken by surprise at the sudden alarm that they were if possible more frightened than the Americans. \\n\\n \\n\\n And so the men stopped for breath. \\n\\n \\n\\n They stared at each other, as if hardly able to realize the peril into which they had so suddenly been plunged. \\n\\n \\n\\n \"I think that was the quickest adventure I ever had in my life,\" muttered Clif. \\n\\n \\n\\n The suddenness of it made him laugh; they had almost walked into a Spanish fort. \\n\\n \\n\\n But it was no laughing matter, certainly; it was a confounded piece of ill-luck. \\n\\n \\n\\n \"For they\u0027ll be watching for us now!\" muttered Clif. \"I\u0027m afraid that will settle us.\" \\n\\n \\n\\n \"They\u0027ll follow our footsteps!\" exclaimed one of the sailors. \\n\\n \\n\\n That was so, and it was an unpleasant prospect; it was plain that if the Americans wished to find any safety they must get some distance away from that battery. \\n\\n \\n\\n \"We\u0027ll make one more effort to get back into the country,\" muttered Clif. \\n\\n \\n\\n And amid silence and anxious suspense they once more started up the sloping seashore. \\n\\n \\n\\n They crept along as it seemed by inches. But fortunately they did not run across any more \"guns.\" When they came across an embankment it was of solid earth and marked the end of the beach. \\n\\n \\n\\n And there were some trees and bushes there, so the Americans began to feel more comfortable. For all they knew they might in the darkness have been strolling into a town. \\n\\n \\n\\n But they were apparently out in the open country, there seemed to be no people and no houses near. So they started boldly forward. \\n\\n \\n\\n It was then late at night, a dark and damp and windy night; so they were not likely to find many people wandering about. \\n\\n \\n\\n \"What we want to do,\" Clif said, \"is to get back in the country a while where we can hide until morning. Then if we can find some Cubans we\u0027ll be all right.\" \\n\\n \\n\\n Clif was about tired to death. He had done far more work that day than any of those sailors. But there was no time for resting then. \\n\\n \\n\\n He gritted his teeth and started; they took their bearings from the sea, and then went straight on, watching and listening carefully, but meeting with no trouble. \\n\\n \\n\\n At first their walk led through what had evidently once been a cultivated country, for it was level and had but few trees upon it. At present, however, it was overgrown with weeds. \\n\\n \\n\\n Once they almost ran into a house, which it may readily be believed gave them a start. It was creepy business, anyhow, this stumbling along through the enemy\u0027s country without being able to see ten yards in front. \\n\\n \\n\\n But the house seemed to be empty. In fact, it could hardly be called a house any more, for it was half burned down. \\n\\n \\n\\n The Americans thought that it was empty, for Clif had stumbled and fallen with a crash over a pile of dry sticks and rubbish. But when he rose to his feet to listen anxiously there was no movement or sign that anybody had heard him. \\n\\n \\n\\n \"It probably belonged to some of the reconcentrados,\" he muttered. \\n\\n \\n\\n He was about to turn and give the word to proceed. \\n\\n \\n\\n Then suddenly a new idea occurred to him, and he gave a pleased exclamation. \\n\\n \\n\\n \"This is lucky!\" he whispered. \"Men, what is the matter with hiding there?\" \\n\\n \\n\\n That was a rather startling proposition; for they could not be at all sure but some one lived there after all. \\n\\n \\n\\n But Clif had come several miles by that time, and he was disposed to be a trifle desperate. \\n\\n \\n\\n A person can get so tired that he will be anxious to enter even a Spanish dungeon in order to get a chance to rest. \\n\\n \\n\\n \"We will search the house,\" he said. \"If we find anybody we\u0027ll hold them up and make them prisoners; and if we don\u0027t, we\u0027ll spend the night there.\" \\n\\n \\n\\n And then without another word he started silently forward. The sailors were right behind him. \\n\\n \\n\\n What was evidently the front of the house was the part that had been burned. Clif picked his way over the ruins and into the rear, where there was a roof still remaining. \\n\\n \\n\\n There was a door there, half shut; one may readily believe that in pushing it open Clif was rather nervous. \\n\\n \\n\\n But nothing occurred to startle him, and so they went forward once more. The place about him seemed deserted. \\n\\n \\n\\n Then suddenly Clif did a startling thing. \\n\\n \\n\\n He took a deep breath and called aloud. \\n\\n \\n\\n \"Anybody here?\" \\n\\n \\n\\n And then for at least a minute or two the little party stood waiting in silence; but no answer was heard. \\n\\n \\n\\n \"I guess it\u0027s deserted,\" Clif said. \"Scatter and search it thoroughly.\" \\n\\n \\n\\n And that was quickly done. To their relief the Americans found that the place was not inhabited and that there was no one near. That once made sure it may be believed that they wasted no more time in delay. \\n\\n \\n\\n \"I don\u0027t think it will be necessary for us to keep watch,\" he said. \"Our safety lies in our hiding.\" \\n\\n \\n\\n They made their way into one of the smaller rooms of the little building, one which had a key to the door. And having secured themselves as best they could from danger of discovery, the wearied men sank down upon the floor. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3248/89005.html","bookId":606,"book":{"id":606,"title":"A Prisoner of Morro","description":"简介： Her commander was Lieutenant Raymond, and her junior officer Naval Cadet Clifford Faraday. The regular junior officer was absent on sick leave, and Cadet Faraday had been assigned to his place in recognition of gallant conduct....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3248","creation":"Aug 1, 2019 12:19:01 AM","modification":"Aug 1, 2019 12:19:01 AM"}}
