{"id":66918,"no":1,"title":"Page 1","content":"For Bob Gottlieb\n Introduction\n Only prejudice, and a trick of the Mercator projection, prevents us from recognizing the enormity of the African continent. Covering nearly twelve million square miles, Africa is almost as large as North America and Europe combined. It is nearly twice the size of South America. As we mistake its dimensions, we also mistake its essential nature: the Dark Continent is mostly hot desert and open grassy plains.\n In fact, Africa is called the Dark Continent for one reason only: the vast equatorial rain forests of its central region. This is the drainage basin of the Congo River, and one-tenth of the continent is given over to it - a million and a half square miles of silent, damp, dark forest, a single uniform geographical feature nearly half the size of the continental United States. This primeval forest has stood, unchanged and unchallenged, for more than sixty million years.\n Even today, only half a million people inhabit the Congo Basin, and they are mostly clustered in villages along the banks of the slow muddy rivers that flow through the jungle. The great expanse of the forest remains inviolate, and to this day thousands of square miles are still unexplored.\n This is true particularly of the northeastern corner of the Congo Basin, where the rain forest meets the Virunga volcanoes, at the edge of the Great Rift Valley. Lacking established trade routes or compelling features of interest, Virunga was never seen by Western eyes until less than a hundred years ago.\n The race to make \"the most important discovery of the 1980s\" in the Congo took place during six weeks of 1979. This book recounts the thirteen days of the last American expedition to the Congo, in June, 1979 - barely a hundred years after Henry Morton Stanley first explored the Congo in 1874 - 77. A comparison of the two expeditions reveals much about the changing - and unchanging - nature of African exploration in the intervening century.\n Stanley is usually remembered as the newsman who found Livingstone in 1871, but his real importance lay in later exploits. Moorehead calls him \"a new kind of man in Africa. . . a businessman-explorer.. . . Stanley was not in Africa to reform the people nor to build an empire, and he was not impelled by any real interest in such matters as anthropology, botany or geology. To put it bluntly, he was out to make a name for himself.\"\n When Stanley set out again from Zanzibar in 1874, he was again handsomely financed by newspapers. And when he emerged from the jungle at the\n Atlantic Ocean 999 days later, having suffered incredible hardships and the loss of more than two-thirds of his original party, both he and his newspapers had one of the great stories of the century: Stanley had traveled the entire length of the Congo River.\n But two years later, Stanley was back in Africa under very different circumstances. He traveled under an assumed name; he made diversionary excursions to throw spies off his trail; the few people who knew he was in Africa could only guess that he had in mind \"some grand commercial scheme.\"\n In fact, Stanley was financed by Leopold II of Belgium, who intended to acquire personally a large piece of Africa. \"It is not a question of Belgian colonies,\" Leopold wrote Stanley. \"It is a question of creating a new State, as big as possible. . . . The King, as a private person, wishes to possess properties in Africa. Belgium wants neither a colony nor territories. Mr. Stanley must therefore buy lands or get them conceded to him \n This incredible plan was carried out. By 1885, one American said that Leopold \"possesses the Congo just as Rockefeller possesses Standard Oil.\" The comparison was apt in more ways than one, for African exploration had become dominated by business.\n It has remained so to this day. Stanley would have approved the 1979 American expedition, which was conducted in secrecy, with an emphasis on speed. But the differences would have astonished him. When Stanley passed near Virunga in 1875, it had taken him almost a year to get there; the Americans got their expedition on-site in just over a week. And Stanley, who traveled with a small army of four hundred, would have been amazed at an expedition of only twelve - and one of them an ape. The territories through which the Americans moved a century later were autonomous political states; the Congo was now Zaire, and the Congo River the Zaire River. In fact, by 1979 the word \"Congo\" technically referred only to the drainage basin of the Zaire River, although Congo was still used in geological circles as a matter of familiarity, and for its romantic connotations.\n Despite these differences, the expeditions had remarkably similar outcomes. Like Stanley, the Americans lost two-thirds of their party, and emerged from the jungle as desperately as Stanley\u0027s men a century before. And like Stanley, they returned with incredible tales of cannibals and pygmies, ruined jungle civilizations, and fabulous lost treasures.\n I would like to thank R. B. Travis, of Earth Resources Technology Services in Houston, for permission to use videotaped debriefings; Dr. Karen Ross, of ERTS, for further background on the expedition; Dr. Peter Elliot, of the Department of Zoology, University of California at Berkeley, and the Project Amy staff, including Amy herself; Dr. William Wens, of Kasai Mining \u0026 Manufacturing, Zaire; Dr. Smith Jefferson, of the Department of Medical Pathology, University of Nairobi, Kenya; and Captain Charles Munro, of Tangier, Morocco.\n I am further indebted to Mark Warwick, of Nairobi, for his initial interest in\n this project; Alan Binb, of Nairobi, for graciously offering to take me Into the Virunga region of Zaire; Joyce Small for arranging my transport, usually at short notice, to obscure parts of the world; and finally my special thanks to my assistant, Judith Lovejoy, whose untiring efforts through very difficult times were crucial to the completion of this book.\n M.C. \n","sourceLink":"https://allnovel.net/congo/page-1.html","bookId":1712,"book":{"id":1712,"title":"Congo","description":"Storyline: \n Deep in the African rain forest, near the legendary ruins of the Lost City of Zinj, an expedition of eight American geologists is mysteriously and brutally killed in a matter of minutes. Ten thousand miles away, Karen Ross, the Congo Project Supervisor, watches a gruesome video transmission of the aftermath: a camp destroyed, tents crushed and torn, equipment scattered in the mud alongside dead bodies -- all motionless except for one moving image -- a grainy, dark, man-shaped blur. In San Francisco, primatologist Peter Elliot works with Amy, a gorilla with an extraordinary vocabulary of 620 signs, the most ever learned by a primate, and she likes to fingerpaint. But recently, her behavior has been erratic and her drawings match, with stunning accuracy, the brittle pages of a Portuguese print dating back to 1642 . . . a drawing of an ancient lost city. A new expedition -- along with Amy -- is sent into the Congo where they enter a secret world, and the only way out may be through a horrifying death . . .\n \n","cover":"https://allnovel.net/images/congo.jpg","author":"Michael Crichton","type":"Thriller","source":"allnovel","link":"https://allnovel.net/congo.html","creation":"Oct 5, 2019 8:57:53 AM","modification":"Oct 5, 2019 10:02:39 AM"}}
