{"id":84130,"no":18,"title":"Page 18","content":"I take a sip of the orange concoction. “The Bellagio.”\\n\\n “Nice.” She leans over a little—close enough that I can smell her cheap, too-sweet perfume—and drops the bomb. “I’m off the clock once we land in Nevada. I’m staying with friends. . . . Maybe we’ll stop by the Bellagio casino tonight? You look like you’d be in the high rollers’ section?”\\n\\n My friends and I aren’t flashy about our money—most people who have it aren’t. But the signs are there if you know what you’re looking for—quality luggage, Rolex watches, classic but expensive brand clothing.\\n\\n And yes—this chick just stepped over the line. Her words sounded like a proposition, because they were. Which is pretty f**king disrespectful, considering my fiancée is within earshot.\\n\\n But I’m not surprised. Even though men are supposed to be the bold pursuers? Women can be so much worse. They’re brazen. Shameless. They’ll stab each other in the back faster than Jason freaking Voorhees.\\n\\n Just ask Steven. When he and Alexandra were dating? Practically every one of her so-called friends offered to climb on his face and take it for a test ride. Because they were petty. Jealous. Because they wanted what Alexandra had.\\n\\n Some guys, such as Jack, would welcome crap like this with open arms, always wanting to keep their options open. But not me—not anymore. I play it gracious but firm. Reverently, I pick up Kate’s hand and kiss her knuckles, making sure the ring is in sight. “We’re going to be pretty busy tonight. Thanks anyway.”\\n\\n She backs off with an offended shrug. “Suit yourself.”\\n\\n It’s not the first time this has happened, and it probably won’t be the last. Kate handles it well, even though deep down I know it bugs the shit out of her.\\n\\n I’m not above using that to my advantage, of course. See that devil on my shoulder? Yeah—he’s ready to get busy. Watch.\\n\\n I lean toward Kate. “So . . . you’re just going to let her get away with that?”\\n\\n She continues to stare at her magazine, turning the pages harshly. “Get away with what?”\\n\\n “With that Hail Mary pass she just threw. Trying to eat off your plate. If a guy came on to you like that in front of me? He’d be eating sidewalk.”\\n\\n “I’m not a teenager, Drew. My days of fighting over a boy are over.”\\n\\n What I wouldn’t give to have seen those days. With Jell-O on top.\\n\\n “I’m not saying you should yank her hair out or rip each other’s clothes off”—I chuckle—“though that would be awesome. I just think you should teach her a lesson. Show her who I belong to.”\\n\\n Kate closes the magazine, shaking her head slightly. Her eyes are shiny with amusement. “I know what you’re doing.”\\n\\n “What am I doing?”\\n\\n “You’re just trying to get me to have sex with you in the bathroom.”\\n\\n Busted. “A b**w j*b will work too. You’re really good at those.”\\n\\n She reopens the magazine. “Flattery will get you nowhere, Evans. Least of all into my pants.”\\n\\n I whine, “Why not?”\\n\\n “Because all of our friends are here.”\\n\\n “So what?”\\n\\n “So they’ll hear us.”\\n\\n I lie, “No, they won’t.”\\n\\n “They might.”\\n\\n “I’ll stuff your panties in your mouth—they won’t hear a thing.”\\n\\n She snorts. And stays strong. “Sounds romantic. Still . . . not happening.”\\n\\n It’s so happening. But I admit—this banter? The sexual tension? Having to work for it once in a while? It’s still fun. Exciting. It keeps my skills razor sharp.\\n\\n Knowing I’ll eventually get my way? That helps too.\\n\\n I try a different tactic. Guilt. “It’s tradition, Kate. Like tapping the mascot symbol when you exit the locker room before a football game. It’s bad luck to break tradition—something terrible could happen. How will you feel if this plane crashes and burns, all because you didn’t want to give it up?”\\n\\n “I think I’ll take my chances.”\\n\\n I look forward and sigh. This is a five-hour flight. There’s no way Kate can hold out that long. Because, when you know how to strum a guitar the right way? That sucker plays.\\n\\n I give it a few minutes, until her guard is down. Then I turn sideways in my seat. And start off slow. Subtle. One hand on her thigh, drawing leisurely circles. Eventually my other hand joins in, stroking her arm, then her shoulder—relaxing her. Overwhelming her senses.\\n\\n Notice, she’s not pushing me away. Because even though one set of lips is saying no? The other set is always up for a good time.\\n\\n I lean over and my mouth lightly caresses her cheek, moving gently across her jawline to her neck. My hand creeps down and covers one breast—squeezing and rubbing. Sliding and teasing.\\n\\n Kate’s breathing picks up. The magazine falls from her hands. She half warns, “Drew . . .”\\n\\n I whisper in her ear, “Just kiss me. That’s all I want, baby. Just one kiss.”\\n\\n These are the famous last words spoken by teenage boys everywhere, in the backseat of their parents’ car. If there are any young females out there? Be warned—it’s never just one kiss. They don’t call it stealing bases for nothing. Before you know it, he’ll be rounding second, sliding into third, and a home run is just inches away.\\n\\n Kate presses her mouth to mine—lets me seduce her with my tongue. So warm. So wet.\\n\\n So nice.\\n\\n Hot, hard, real desire uncoils low in my gut, and my pants tighten predictably. I turn my attention to her earlobe—sucking and biting. Then I whisper tender, dirty, need-filled words that you don’t get to hear. About how much I want her, how beautiful she is, about all the things I want to do to her, and the detailed positions I want to do them in.\\n\\n Kate’s h*ps move upward, searching for friction against the fingers that are now firmly stationed between her legs. When she’s primed and panting—right where I want her—I retract my hands. And look into her eyes. “Let’s finish this in the other room.”\\n\\n Kate bites her bottom lip. Her slightly dazed eyes dart left to right, making sure there are no witnesses. She’s just about to cave . . .\\n\\n Until a foreign body plops down between us—half on both our laps. My eyes are covered with strawberry-blond hair. And the taste of hair spray fills my mouth.\\n\\n God damn it.\\n\\n “Hope you got a good night’s sleep last night, Katie. For what I have planned, you’re going to need lots of energy.” \\n\\n","sourceLink":"https://allnovel.net/tied-tangled-4/page-18.html","bookId":1810,"book":{"id":1810,"title":"Tied (Tangled #4)","description":"Storyline: In the fourth sexy romance by the New York Times bestselling author of Tangled and Twisted, Drew and Kate can’t wait to tie the knot—if they can survive the pre-wedding festivities. \\n For most of my life, I never imagined I’d get married. But Kate did the impossible: she changed me. I think we can all agree I was pretty frigging awesome before, but now I’m even better. \\n The road to this day wasn’t all rainbows and boners. There were mistakes and misunderstandings worthy of a Greek tragedy. But Kate and I made it through with our inexhaustible lust, boundless admiration, and everlasting love for one another intact. \\n That being said, there were some unexpected incidents in Vegas last weekend that could have been a problem. It was kind of... my final test. \\n I know what you’re thinking—what the hell did you do this time? Relax. Let’s not judge, or call for my castration, until you\u0027ve heard the whole story. \\n And hold on tight, because you’re in for a wild ride. Did you expect anything less?\\n","cover":"https://allnovel.net/images/tied-tangled-4.jpg","author":"Emma Chase","type":"Humorous","source":"allnovel","link":"https://allnovel.net/tied-tangled-4.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:56:01 PM"}}
