{"id":84131,"no":19,"title":"Page 19","content":"Delores. As if there were any doubt.\\n\\n She wiggles her ass off my thigh, forcing Kate and me to move over so she can squeeze in between us.\\n\\n Kate recovers quickly. “Yep . . . um . . . you know me. I’m all about being well rested.”\\n\\n My body crackles with unspent carnal energy. It makes me cranky. “Do you frigging mind? We were in the middle of something.”\\n\\n Dee-Dee turns toward me with knowing disdain clear on her face. “Nope, don’t mind at all.” She shoos me away with her hand. “You can amscray—Kate and I have some catching up to do.”\\n\\n “I don’t think so.”\\n\\n “Hello? This is a bachelorette party—and it starts now. You’re not invited. Go compare peckers with the boys, talk about the massive dump you took last night—or whatever it is you do when we’re not around.”\\n\\n I grind my teeth. Clench my jaw. To keep from calling her the crusty crotch crack she’s acting like. Too much? My bad. Blame the good Dr. Seuss—we’ve been reading him a lot in my house.\\n\\n I take a deep breath. Then I close my eyes and tilt my head back. I’ll wait Dolores out. She’ll have to leave at some point. Or I can use the cum-stained complimentary pillow to smother her.\\n\\n The thought makes me smile.\\n\\n Dee-Dee and Kate talk. And talk. After a few minutes, the sounds blend together in my male ears like those of Charlie Brown’s faceless teacher. “ . . . wa wa wah wah wanh . . . Matthew’s birthday present . . . wa wa wanh . . . wasn’t sure . . . wah wah wa wa . . . came through last minute . . . wa wa wah wanh . . . see his face . . . wa wa wah . . . so surprised . . . wa wanh . . .”\\n\\n Gifts are important to women. But what I’ve come to realize is—at least for some of them—it’s not the actual gift that matters. Or even how much cash you shelled out for it. It’s all about the effort. Symbolism. How much thought you put into getting it for them.\\n\\n For instance, if I were to hunt down a napkin from the bar where Kate and I first met? Then, if I had it matted and framed and gave it to her as an anniversary present? I’m pretty sure she’d f**k me into a coma to show her gratitude.\\n\\n It’s still just a napkin. But to Kate—it means so much more.\\n\\n Last year for my birthday, she got my initials waxed into her bush. I was touched. Talk about a great gift—creative and practical. Anyway, with mild curiosity I open my eyes and ask Delores, “What are you giving him?”\\n\\n She grins smugly. “Only the greatest gift a woman can give the man she loves.”\\n\\n I take my best guess. “Anal?”\\n\\n Kate covers her eyes.\\n\\n Dee-Dee’s smile turns into a scowl. “No—pig. I’m giving him the gift of health. My acupuncturist cleared her schedule. She’s going to work on Matthew the whole day.”\\n\\n I laugh. Because this explains so much.\\n\\n “That’s your gift? Really? It’s the guy’s birthday and you’re gonna make him get needles stuck in his face all day? What are you gonna get him for Christmas—a colonoscopy?”\\n\\n Kate clarifies, “Drew, the acupuncture is to get Matthew to stop smoking.”\\n\\n Yep, Matthew’s a smoker. Statistically, if you don’t start by the age of eighteen, you never will. But my buddy’s the exception to this rule. His habit began in college—during a particularly stressful game of Madden NFL football.\\n\\n Matthew’s kept it in the closet, however. His parents don’t know. Because Frank sucks back two packs a day—and like any smoker, he’d break every one of his kid’s fingers if he found out he was doing it too.\\n\\n I put my hands up in surrender. “I take it back, Dee—it’s a stupendous gift. Anything to help Matthew kick the cancer sticks is a good thing.”\\n\\n She practically pats herself on the back. “Thank you, Drew.”\\n\\n “You’re welcome. Now that we’ve gotten that settled, could you please—and I mean this in the nicest way possible—go the f**k away?”\\n\\n She’s not smiling anymore. “No. I told you—this is my time. My Kate time.”\\n\\n Fast Times at Ridgemont High appears in my head. “Whatever, Mr. Hand.”\\n\\n Kate reaches over and touches my leg. “Drew, maybe you should just go hang out with the guys for the rest of the flight.”\\n\\n I stamp my foot. And point at Dee-Dee. “How come she gets Kate time? Where’s my Kate time? I want Kate time too!”\\n\\n Dee-Dee answers, “You’ll be getting a whole bunch of Kate time next week. It’s called a honeymoon, dumbass.”\\n\\n I glare at her. “You suck.”\\n\\n She rubs a finger over her lips lasciviously. “That I do. Frequently. Matthew doesn’t complain.”\\n\\n I grimace. “Now I’m nauseous. Kate, will you rub my stomach?”\\n\\n Kate smiles. Her voice takes on that motherly, condescending tone she gets when she’s asking James to behave. “Yes, Drew—I’ll rub your stomach, and any other body part you want me to . . . when we get to the hotel.”\\n\\n I sigh and resign myself to not getting laid. Just as I start to sink into a deep depression, Jack’s voice echoes throughout the cabin.\\n\\n “Dude! Check it out! I’ve got p**n on my in-flight entertainment system!”\\n\\n Someone yelling “porn” in an enclosed space is akin to an alarm’s going off in a firehouse at midnight. Four pairs of feet scramble in Jack’s direction, including mine. Maybe guy time won’t be so bad, after all.\\n\\n I know what you’re thinking. Stop wasting my time. Can we skip the bullshit and get to the good stuff already?\\n\\n I’m working on it.\\n\\n Besides, I think you should enjoy the good times while they last. I did. I have a feeling things are going to get real crazy—real quick—from here on out. ’Cause our next stop? That’s Vegas, baby. And there’s a reason it’s called Sin City.\\n\\n Chapter 6\\n\\n When it comes to swanky hotel rooms, you might think the penthouse is top-of-the-line. In most cases, you’d be right. But the Bellagio has something better. The villa. It’s the kind of place only royalty, heads of state, and highly overrated actors get to stay. Five bedrooms, formal dining room, office, library, and a huge kitchen—all trimmed in elegant woods and marbles—decked out with the finest appliances, accessories, and Italian fabrics. It even comes with a full-service maid and butler staff.\\n\\n Money can’t buy happiness—but it makes it a hell of a lot easier to stay happy.\\n\\n Since we’re the guests of honor, Kate and I get the master suite. Our adjoining bathroom has a steam shower and huge Jacuzzi that I definitely plan on putting to good use later. Steven and Alexandra, Delores and Matthew, each pair gets a room too—complete with fireplace and king-size bed. Erin claims a slightly smaller room with a queen, while Jack and Warren bunk together in the last room. \\n\\n","sourceLink":"https://allnovel.net/tied-tangled-4/page-19.html","bookId":1810,"book":{"id":1810,"title":"Tied (Tangled #4)","description":"Storyline: In the fourth sexy romance by the New York Times bestselling author of Tangled and Twisted, Drew and Kate can’t wait to tie the knot—if they can survive the pre-wedding festivities. \\n For most of my life, I never imagined I’d get married. But Kate did the impossible: she changed me. I think we can all agree I was pretty frigging awesome before, but now I’m even better. \\n The road to this day wasn’t all rainbows and boners. There were mistakes and misunderstandings worthy of a Greek tragedy. But Kate and I made it through with our inexhaustible lust, boundless admiration, and everlasting love for one another intact. \\n That being said, there were some unexpected incidents in Vegas last weekend that could have been a problem. It was kind of... my final test. \\n I know what you’re thinking—what the hell did you do this time? Relax. Let’s not judge, or call for my castration, until you\u0027ve heard the whole story. \\n And hold on tight, because you’re in for a wild ride. Did you expect anything less?\\n","cover":"https://allnovel.net/images/tied-tangled-4.jpg","author":"Emma Chase","type":"Humorous","source":"allnovel","link":"https://allnovel.net/tied-tangled-4.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:56:01 PM"}}
