{"id":84136,"no":24,"title":"Page 24","content":"Jack’s praise is flattering. And a little disturbing. Still, Warren looks suspicious. “Why would you want to help me?” I shrug. “I’m a sucker for a lost cause—St. Jude always was my favorite saint. Plus, you’re Kate’s little buddy. If I help you out, I score points with her. And that’s always a good thing.” He seems satisfied with my answer, so I start with the basics. “What’s your game?” “My what?” “Your game plan. How do you approach these gorgeous LA women? What do you say?” He scratches his head, like the dumbfuck monkey he is. “Well, sometimes I’ll rush over, looking surprised, and I’ll say, ‘Are you all right? Did you hurt yourself? That fall from heaven was far.’ ” The guys and I start laughing straightaway. But Warren doesn’t. Then we stop. I ask, “I’m sorry—were you serious?” He looks away, slightly pissed. “Forget this.” I implore him, “No, we won’t laugh anymore. I want to help. What else?” He debates answering for a second. “Sometimes I tell a joke.” Matthew looks perplexed. “A joke?” “Yeah—you know—‘This guy walks into a bar . . .’ Shit like that.” I nod slowly. “Right. I can see why you think that would work . . . because every woman wants to screw Bozo the Clown.” Then we start laughing again. Warren growls, “Fuck you guys. I’m out of here.” He starts to get up. “Wait—don’t go. Come on, man, we’re just busting your balls.” Reluctantly Warren sits back down. I begin my tutorial. “First mistake—you’re trying too hard. Women can smell desperation like a dog smells fear. And to them, it reeks like shit. You have to be calm. Confident. Like . . . when we were kids, Matthew’s uncle used to take us camping. At the campground there was a lake with all these sunnies swimming around, that all the kids would try to catch. There was this one annoying little prick who wanted to catch the most fish—so he brought a net. He’d slam it into the water over and over, but he never caught any fish. He just scared them away. I, on the other hand, would bring a little bag of bread crumbs. I’d drop in just a few at a time—a small taste. Then I’d sit back and wait. After a minute or two, all the fish would come to me. You see what I’m saying?” Monkey-boy nods. “Yeah . . .” Then he stops. “No, actually. Not really.” This is going to be harder than I thought. And the really scary thing? If Kate and I die together in a fiery collision? This dumbass is third in line to raise my kid. Forget global warming—that’s the thought that keeps me up at night. “You’re thinking too much.” I take a drink of my beer. “Forget the lines. Forget the goddamn jokes. Women aren’t that complicated. You just have to figure out what they want to hear. Then, tell it to them. You do that, and even the hottest knees will part like the Red Sea.” He digests my words for a moment. “So I should tell a chick I’ll listen to her demo tape? Maybe get her a recording contract?” I shake my head. “No. Rule number one—don’t make promises you can’t or have no intention of keeping. Play it straight—anything else is just a scumbag move. And it’s the easiest way to turn a semi-normal chick into a stalker. After the deal gets sealed, if you’re in a jam and need an exit strategy, ask for her phone number—but don’t actually say you’re going to call. It’ll be assumed, but that’s not your problem.” I take another drink of beer. “It’s all about the moment—screw tomorrow. Decipher what she wants, right then and there. Some chicks actually want a dickhead—they get off on being treated like crap.” Don’t even think about telling me I’m wrong. Where do you think the whole “nice guys finish last” thing came from? Because deep down, some women live for drama. “Some just want a shoulder to cry on, or a good time. Listen to what they say, watch how they say it, and show them that, at least for the night, you’re exactly what they’re looking for.” Matthew says, “He looks confused, Drew. Maybe a little demonstration is in order?” “Good idea.” I scan the pool area and spot a waitress scurrying across the concrete. She’s got dark, curly hair, pale skin with a hint of freckles. She fills out her uniform nicely—a white blouse tied in a knot at the waist, high and tight, black shorts that look as if they were stolen from Hooters, and black heels. Bingo. I point her out. “What do you think of her?” Jack comments, “I’d bang her.” Warren agrees, “Yeah. She’s cute.” I wave my hand and call the waitress over. With pad and pen ready she asks, “Hey, guys, what can I do for you?” I’ll never understand why women set themselves up like that. Try to think like a man, for God’s sake. When a red-blooded guy hears this question? He immediately thinks of at least eight different things you could “do” for him, in about ten different positions. I give her my most charming smile. “Could you bring us a bottle of Jäger, honey? And five shot glasses please. Take your time, you look busy. We’re not in a rush.” “No problem. Coming right up.” She turns away and walks to the bar. Jack stares. “I hate it when they leave, but I love to watch them go.” Warren’s staring at her ass too. So I smack him. Slap. To get his attention . . . and . . . because it’s fun. “Focus. Look at her.” “I was looking at her!” “Not just at her ass—look at the whole package.” He glares at me, touching his cheek. Then he watches the waitress. “See how she’s rubbing her lower back? And wiping the sweat from her forehead? How she shifts her weight from one foot to the other? What do you think she needs right now?” His face scrunches up with concentration. After a minute, I can’t resist. “Don’t hurt yourself.” He sighs. “I don’t know—she looks like she could use a nap.” I smile. “There’s hope for you yet. A nap would be good, but you can’t give that to her. What you can do is make her feel important. Valued. Show her that you appreciate her as a woman, not just a server. Chicks eat that shit up.”","sourceLink":"https://allnovel.net/tied-tangled-4/page-24.html","bookId":1810,"book":{"id":1810,"title":"Tied (Tangled #4)","description":"Storyline: In the fourth sexy romance by the New York Times bestselling author of Tangled and Twisted, Drew and Kate can’t wait to tie the knot—if they can survive the pre-wedding festivities. For most of my life, I never imagined I’d get married. But Kate did the impossible: she changed me. I think we can all agree I was pretty frigging awesome before, but now I’m even better. The road to this day wasn’t all rainbows and boners. There were mistakes and misunderstandings worthy of a Greek tragedy. But Kate and I made it through with our inexhaustible lust, boundless admiration, and everlasting love for one another intact. That being said, there were some unexpected incidents in Vegas last weekend that could have been a problem. It was kind of... my final test. I know what you’re thinking—what the hell did you do this time? Relax. Let’s not judge, or call for my castration, until you\u0027ve heard the whole story. And hold on tight, because you’re in for a wild ride. Did you expect anything less?","cover":"https://allnovel.net/images/tied-tangled-4.jpg","author":"Emma Chase","type":"Humorous","source":"allnovel","link":"https://allnovel.net/tied-tangled-4.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:56:01 PM"}}
