{"id":84145,"no":33,"title":"Page 33","content":"Welcome, ladies and gentlemen, to another edition of Queer Eye for the Straight Guy.\\n\\n And Matthew makes it so much worse. He claps his fingertips together daintily and says in a high-pitched voice, “Makeover time!”\\n\\n My eyes narrow in his direction. “Don’t ever do that again.”\\n\\n “Too much?”\\n\\n “Definitely.”\\n\\n Twenty minutes later Warren is decked out in a slick navy suit, black shirt, and shiny Prada shoes. His hair has a neat wet look—short on top, combed back at the sides. He looks . . . passable. Extremely awkward and uncomfortable—but passable.\\n\\n I stand in front of him and brush off his shoulders, inspecting his clothes like a general at boot camp.\\n\\n While he whines like a bitch. “It itches.” He rolls his neck and steps from one foot to the other.\\n\\n “Stop f**king fidgeting.”\\n\\n He pulls at the collar. “It’s stiff.”\\n\\n “It’s new—it’s supposed to be. Stand up straight.” Jesus, do I sound like my father or what?\\n\\n I drape the blue tie around his neck, to demonstrate how to tie one. But then I think better of it.\\n\\n There’s an excellent chance I’ll end up strangling him with the damn thing. And a trip out to the desert to bury a body would be a major inconvenience right now.\\n\\n Steven, who has turned patience into an art form, takes my place. “Okay, Billy, the rabbit comes out of his burrow, goes around the tree . . .”\\n\\n You can tell a lot about a person by the game he or she plays at a casino. Adrenaline junkies, those willing to take big risks for an even bigger payoff, they orbit the craps tables. Craps is a game of skillful luck. It requires a certain finesse—quick thinking and decisive action. Then there’s blackjack. Unless you’re a freak-of-nature card counter, you have to stick to the rules. Assume each card’s a ten, stay at fifteen even if every fiber of your being is screaming to hit, and wait for the dealer to bust. If you don’t know how to play, stay the f**k away. Blackjackers tend to throw quite the hissy fit if you take “their” card. After blackjack, there’s roulette. Roulette is all about odds. Play black or red and you have a slightly less than 50 percent chance of winning. Statistically speaking, it’s your best shot at beating the house.\\n\\n At the low end of the gambling totem pole are the slot machines. A monkey could play them. Put your money in, pull the lever; money, lever; money, lever. They require no proficiency or knowledge and they’re programmed to favor the casino. The longer you play, the more likely you are to go broke.\\n\\n The only people who play slots are the aged, the mentally infirm, and suckers.\\n\\n “Cool—slot machines! That’s all I play. I’m so good at them,” Warren says.\\n\\n Saw that one coming a mile away, didn’t you?\\n\\n I slap him on the back and steer him toward the high-roller section. “Tonight you’re gonna play craps.”\\n\\n “I don’t know how to play craps.”\\n\\n “Then you’re going to watch and learn. Craps is a man’s game. All the hottest girls hang out at the craps table because that’s where the money is. If the mountain won’t come to Muhammad, than he has to go to the motherfucking mountain.”\\n\\n “What mountain?”\\n\\n For a second I forgot I was talking to a real, live sphincter. “Never mind. Just pay attention.”\\n\\n Matthew, Warren, and I get our chips while Jack heads over to blackjack. Steven gets comfortable at a $5,000-minimum roulette table. He’s all about statistics and odds. At the craps table, I’m rolling and Matthew handles the bets. Right out of the gate, I roll a seven, and the crowd goes wild.\\n\\n Matthew pounds my back excitedly. “Yes! Mickey f**king Mantle! Keep ’em coming!”\\n\\n Fifteen minutes later, we’ve tripled our money. The number of bystanders around the table has doubled. Warren still has no idea how to play the game, but he takes his cues from the crowd and responds accordingly. Everyone is laughing, drinking, elbowing in to place money on the table—trying to get a piece of the action. It’s wild. Fun. It feels like the old days—just me and the boys out for a good time. There are no worries about kids or weddings, no stress about work or any of the bullshit that real life abounds in.\\n\\n Then real life taps me on the shoulder.\\n\\n Dice in hand, I turn around. And come face-to-face with the dark-haired, blue-eyed flight attendant from the airplane. She’s wearing a black, strapless cocktail dress and heels high enough to put her at eye level with me. She’s not alone. In triangle formation behind her are two equally attractive women. One is blond and baby faced, shorter, with fuller curves. The other is a brunette with blond streaks, olive skin, and full, ripe lips.\\n\\n Blue-Eyes smiles wide. “Hello again.”\\n\\n I don’t want to be rude, but—screw it—I’ll go with rude. “What are you doing here?”\\n\\n “You said this was where you were staying.”\\n\\n “I also said we’d be busy.”\\n\\n She responds coyly, “But I saw the look you gave me. I knew you only said that so your girlfriend wouldn’t get upset. So she wouldn’t think you were interested.”\\n\\n Okay—I’m all for women who are assertive. You are sexual beings with needs. Own it. Relish it. But coming on strong to a guy who blatantly doesn’t want you isn’t going to change his mind.\\n\\n It just makes you look pathetic.\\n\\n Her hand reaches out to rub my chest, but I catch her wrist before she makes contact.\\n\\n “Except I’m really not interested.”\\n\\n Like a horny ghost, Jack appears at my side. “I, on the other hand, am very interested.” He takes her elbow and leads her away. “Don’t mind Drew—he’s a blind fool. How about we get you a drink?”\\n\\n The brunette friend fades into the crowd, but the baby face just stands there looking blank. She twirls her hair in that “dumb blonde” way that makes me suspect her IQ may actually be lower than Warren’s. But she’s hot—definitely a step above the trough he’s been feeding at lately. I nudge him with my arm and jerk my chin in the blonde’s direction.\\n\\n He wipes his hands on his pants nervously. Then he speaks to her. “Hey, wanna hear a joke?”\\n\\n And all my hard work goes down the f**king tubes.\\n\\n “Okay,” she answers.\\n\\n “What did the blanket say when it fell off the bed?”\\n\\n “What?”\\n\\n “Oh, sheet.”\\n\\n Blondie’s lips pout in confusion. “I don’t get it. Is the blanket, like, computerized?” \\n\\n","sourceLink":"https://allnovel.net/tied-tangled-4/page-33.html","bookId":1810,"book":{"id":1810,"title":"Tied (Tangled #4)","description":"Storyline: In the fourth sexy romance by the New York Times bestselling author of Tangled and Twisted, Drew and Kate can’t wait to tie the knot—if they can survive the pre-wedding festivities. \\n For most of my life, I never imagined I’d get married. But Kate did the impossible: she changed me. I think we can all agree I was pretty frigging awesome before, but now I’m even better. \\n The road to this day wasn’t all rainbows and boners. There were mistakes and misunderstandings worthy of a Greek tragedy. But Kate and I made it through with our inexhaustible lust, boundless admiration, and everlasting love for one another intact. \\n That being said, there were some unexpected incidents in Vegas last weekend that could have been a problem. It was kind of... my final test. \\n I know what you’re thinking—what the hell did you do this time? Relax. Let’s not judge, or call for my castration, until you\u0027ve heard the whole story. \\n And hold on tight, because you’re in for a wild ride. Did you expect anything less?\\n","cover":"https://allnovel.net/images/tied-tangled-4.jpg","author":"Emma Chase","type":"Humorous","source":"allnovel","link":"https://allnovel.net/tied-tangled-4.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:56:01 PM"}}
