{"id":84165,"no":53,"title":"Page 53","content":"The limo pulls up to the Four Seasons, where our reception is being held. Matthew climbs out first, then helps Dee, who brings her glass of champagne with her. James, recharged after his mommy-cuddle, bounds out next, followed by Mackenzie, Alexandra, and Steven. When the driver offers his hand to Kate, I tip him and say, “I got this, thanks.”\\n\\n Then I assist my wife out of the limousine.\\n\\n My wife.\\n\\n I don’t think I’ll ever get tired of thinking of her that way. I’m definitely gonna be looking for excuses to speak of her that way.\\n\\n I escort her under the twinkling lighted archway into the building where we’ll celebrate our marital bliss. Though you and I both know the real celebration happens in the honeymoon suite.\\n\\n Our group arrives at the well-appointed suite adjacent to the main ballroom, where the wedding party enjoys the cocktail hour away from the prying eyes of the guests—like rock stars in the greenroom. Lauren Laforet, our wedding planner, greets us, makes sure we’re good so far, then walks off dictating orders into a walkie-talkie to her minions. Delores and Alexandra have Kate stand to “bustle” the back of her dress, so she can dance without getting stepped on and falling on her face.\\n\\n I don’t know what the “bustle” entails, but by the look of concentration on their faces—I don’t want any part of it. I head over to the buffet and pile hors d’oeuvres onto a plate for Kate.\\n\\n Gotta keep her strength up for later.\\n\\n While she stands, I feed her piece by piece. I’m guessing she didn’t eat this morning because she moans and sighs with each mouthwatering bite. Or maybe she just likes sucking on my fingers—’cause she does that too.\\n\\n With a knowing smirk, Kate asks me, “You’re enjoying this, aren’t you?”\\n\\n My semistiff dick nods. “Immensely.” I slide a small, bacon-wrapped scallop between her lips, and her tongue swirls around my finger.\\n\\n “So am I.”\\n\\n Called it. “Suck it harder,” I tell her—only half joking.\\n\\n She obliges.\\n\\n When I reach for another piece, Kate says, “Now, where have I heard that before?”\\n\\n “Get used to hearing it more. There’s a good chance it’ll be my mantra for the next three weeks.”\\n\\n “Hello,” Alexandra calls from where she’s crouched behind Kate. “We can hear you. And . . . ewwww.”\\n\\n “Yet you’ll still never be as damaged as I was by what I heard from your f**king room in Vegas.”\\n\\n The peroxide didn’t work. Sometimes, late at night, I can still hear them.\\n\\n I’m considering therapy. Or hypnosis.\\n\\n She just grins slyly. “That was a great morning.”\\n\\n “What was a great morning?” Steven asks, as he brings my sister a cocktail.\\n\\n She looks at Steven the way a twelve-year-old looks at a Justin Bieber poster. “Every morning with you.”\\n\\n He kisses her lips.\\n\\n I catch Mackenzie’s eye from across the room, wink, and tilt my head toward her parents. She beams back at me, and I know things at home have been back on track with Lexi and Steven. Then Mackenzie mouths, So gross.\\n\\n I just nod.\\n\\n After the food, music is the second most important ingredient for a successful wedding reception. We hired a twelve-piece band, and a DJ for the songs that just sound stupid when someone other than the original artist covers them. The wedding singer—a voluptuous redhead with stellar pipes—introduces us as Mr. and Mrs. Drew Evans for the first time, and as our guests stand and applaud, I lead Kate to the dance floor for the customary first dance.\\n\\n It’s the wedding singer’s partner—a salt-and-pepper-haired guy with a smooth voice—who sings it. Kate, being more musically inclined than I’ll ever be, chose the song—but I got final approval.\\n\\n “I Cross My Heart” by George Strait.\\n\\n The lyrics, the tone, it’s perfect for us.\\n\\n And just like in the church, while we waltz around the dance floor and I hold her close against me, the thousand eyes watching us fade from our awareness. It’s just me and her—and this moment.\\n\\n I look into my wife’s shining brown eyes, and I sing the lyrics to her that mean the most:\\n\\n You will always be the miracle that makes my life complete.\\n\\n Kate sings the next line back to me:\\n\\n And as long as there’s a breath in me, I’ll make yours just as sweet.\\n\\n It’s a sickeningly tender, crazy-in-love, never-happens-in-real-life kind of moment that I would’ve made fun of if I saw it in a movie or on TV.\\n\\n But because it’s real—because it’s us—it’s f**king impeccable.\\n\\n Afterward, Kate dances with my father to “The Way You Look Tonight” by Frank Sinatra. The old man’s a great dancer, and he makes Kate smile and laugh. At one point she gets choked up from whatever words he’s whispering to her, and I make a mental note to ask her later on what he said.\\n\\n Then my mother and I take the floor—Kenny Rogers, “Through the Years.” Her eyes fill with tears as she looks at me.\\n\\n “Don’t cry, Mom.”\\n\\n She laughs self-depreciatingly. “I can’t help it. You’re my little boy and I’m so happy for you, Drew.”\\n\\n Mothers are the first woman a man will ever love—at least the good ones are. They show you how a lady should and shouldn’t be treated, and they set the standard for every woman that comes after them. I really lucked out in that department.\\n\\n My mother continues, “She’s your match in every way. You chose so well.”\\n\\n I glance at Kate, who stands beside her mother and George—so goddamn lovely, it makes my heart ache.\\n\\n “Yeah, I really did, didn’t I?” I kiss my mother’s cheek. “Thank you, Mom. If it wasn’t for you—I never would’ve been able to win over a woman like Kate.”\\n\\n My mother hugs me as we finish the dance. No more words are needed.\\n\\n After that, the party really gets started. The lights are turned down low, accenting the tall, candlelit centerpieces, overflowing with white blossoms. We drink, we laugh, we devour amazing culinary delights. Once Kate and I have managed to chat with every one of our guests and thank them for joining us on our “special day,” a couple approaches us.\\n\\n Billy Warren and his stripper-heeled, tiny-black-dress-wearing wife.\\n\\n Yep, they’re still married—six whole days now. That’s a hell of a lot longer than I was betting on. I shake Warren’s hand. “Good to see you.” I turn to his dark-haired companion. “And with clothes on. Even better.” \\n\\n","sourceLink":"https://allnovel.net/tied-tangled-4/page-53.html","bookId":1810,"book":{"id":1810,"title":"Tied (Tangled #4)","description":"Storyline: In the fourth sexy romance by the New York Times bestselling author of Tangled and Twisted, Drew and Kate can’t wait to tie the knot—if they can survive the pre-wedding festivities. \\n For most of my life, I never imagined I’d get married. But Kate did the impossible: she changed me. I think we can all agree I was pretty frigging awesome before, but now I’m even better. \\n The road to this day wasn’t all rainbows and boners. There were mistakes and misunderstandings worthy of a Greek tragedy. But Kate and I made it through with our inexhaustible lust, boundless admiration, and everlasting love for one another intact. \\n That being said, there were some unexpected incidents in Vegas last weekend that could have been a problem. It was kind of... my final test. \\n I know what you’re thinking—what the hell did you do this time? Relax. Let’s not judge, or call for my castration, until you\u0027ve heard the whole story. \\n And hold on tight, because you’re in for a wild ride. Did you expect anything less?\\n","cover":"https://allnovel.net/images/tied-tangled-4.jpg","author":"Emma Chase","type":"Humorous","source":"allnovel","link":"https://allnovel.net/tied-tangled-4.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:56:01 PM"}}
