{"id":84166,"no":54,"title":"Page 54","content":"I told Kate all about the hangover-shower meet-and-greet. She thought it was hysterical.\n Warren smiles. “You mind if I borrow your wife for a dance?”\n Because he called her my wife, I don’t mind at all. “As long as you give her back.”\n Kate kisses my cheek and heads off with Hopeless.\n His blushing bride goes to the bar. I stand alone, watching the swaying couples on the dance floor. Until Matthew comes up, arms crossed, standing next to me, taking it all in.\n He nods toward Kate and Warren. “You okay with that?”\n “Strangely enough, I really am.”\n We’re silent for a beat. Maybe it’s just the significance of the day, but I’m feeling pretty f**king sentimental. “Have I ever thanked you for being my best friend?”\n Matthew smiles. “No thanks are needed. It’s a mutually beneficial thing we’ve got going on.”\n “Yeah, but . . . thank you for pulling my ass out of the fire—and for kicking it when needed. Or at least . . . getting Alexandra to do your dirty work for you. I don’t know what I’d do without you, man.”\n “I feel the same way.” Then he spreads his arms wide. “Let’s hug it out, bitch.”\n I laugh, and we do just that, slapping each other on the back.\n Until Delores comes tearing up to us, holding the knife that we’re soon supposed to cut the cake with.\n “You son of a bitch!”\n Something tells me she’s not talking to Matthew.\n “I’m gonna stab you in your scrotum!”\n This sounds serious.\n As Matthew restrains his wife, I ask calmly, “Is there a reason you have the sudden urge to sexually mutilate me?”\n She tells her husband, “Helga just called. Documents were delivered to the house that she had to sign for. Legal documents—he changed our son’s name, Matthew!”\n Damn it. Those weren’t supposed to arrive until Kate and I were on our honeymoon—far away, in the middle of the Mediterranean for three wonderful, na**d weeks.\n Matthew looks over his shoulder at me. “Seriously?”\n I throw my arms up in the air. “You’ll thank me one day. And so will Michael.”\n Delores lifts the knife.\n “If I didn’t love you two and your son, I wouldn’t bother.” I let that sink in a minute. “And you’re one to talk—what about that text you sent Billy from the bachelorette party? If I wasn’t so evolved, that could’ve really f**ked things up for me and Kate. And . . . it hurt my feelings.”\n Did it really? No. But you play the cards you’re dealt.\n My admission calms Dee a little. I have a feeling she and Matthew have already discussed it. “That was a joke, Drew. If I really hated you . . . I wouldn’t put any effort into torturing you. I’d just ignore you completely.”\n Matthew interjects, “We’ll change his name back. It was a screwed-up attempt at a nice gesture, but we’ll change it back.”\n I doubt they will. And if they do . . . I’ll just have to be stealthier in my next attempt.\n Kate comes over, looking only half-concerned. But she still stands in front of me protectively.\n “Dee-Dee? Remember we said no bloodshed on the wedding day—it’s bad luck.”\n Dee sighs and tosses the knife on the table. “I need a drink.”\n Matthew nods. “I’ll join you.”\n After they’re gone, Kate turns around to me. “The papers arrived early, didn’t they?”\n “They did.”\n She shakes her head. “I told you it was a bad idea.”\n I wrap my arms around her because she’s gorgeous when she’s right. “I should’ve listened to you.”\n She smiles up at me. “Maybe we should have kept ‘obey’ in the vows.”\n She does have a point.\n We dance. Slow and sweet, dirty and sweaty. At one point, while I’m grinding against Kate’s ass, James barrels onto the dance floor with Sister Beatrice Dugan hot on his heels. I pick him up, and the first nun I ever lusted after smiles with appreciation.\n “Are you enjoying your celebration, Katherine?”\n “I am, Sister, very much.”\n “I’ll be praying for you both—for a long and fruitful union.”\n I bounce James and he squeals. “All our prayers have been answered, Sister B—save yours for someone who really needs them.”\n She clicks her tongue. “All newlyweds need the Lord’s grace, Andrew.”\n Disgruntled with not being the center of attention, James rectifies the situation. “Poosy!” he yells, laughing manically. “Poosy!”\n I freeze, and Kate’s eyes slide closed.\n Sister B smirks. “And this darling seems to have his father’s disposition.”\n Kate opens her eyes. “Very much so, yes.”\n Sister B pats Kate’s arm with sympathy. “Then I’ll be praying doubly hard.” She addresses our son. “Would you like a soda pop, young James?”\n His eyes widen and he nods quickly. I put him down, and, holding Sister B’s hand, he toddles off.\n The music changes to a slower song—“All of Me” by John Legend. Without a word, Kate raises her arms to my shoulders, I rest my hands on her lower back, and we sway in time to the beat.\n That’s when I notice another couple dancing off to my right—not anywhere as close as Kate and I are—but still, for a second I’m shocked.\n Because it’s Mackenzie and Johnny Fucking Fitzgerald.\n Her one hand is on his shoulder, his at her waist, while their other arms are bent at the elbow, hands clasped in the classic ballroom posture.\n I almost pity him. Because even though it’s not intentional? My girl was born to be a heartbreaker.\n As I watch them silently, Johnny makes his move. Catching Mackenzie off guard, the little bastard presses his lips to hers and snatches a kiss. Her first, I’m guessing. It’s chaste and over as quickly as it started.\n Johnny pulls back and looks hopeful. But Mackenzie . . . she seems confused . . . until she’s not. Then she rips her hand from his.\n And punches him right in the gut.\n “Ooof!” He folds at the waist, holding his stomach, and Mackenzie stomps off.\n I help the kid off the dance floor. “You need to work on reading a chick’s signals or you’re gonna be getting hit a lot, Casanova.”\n “Kenzie hits hard for a girl,” he rasps.\n “She kicks harder. You got off lucky.” Once he’s in a chair, I pat his shoulder. “Better luck next time.” \n","sourceLink":"https://allnovel.net/tied-tangled-4/page-54.html","bookId":1810,"book":{"id":1810,"title":"Tied (Tangled #4)","description":"Storyline: \n In the fourth sexy romance by the New York Times bestselling author of Tangled and Twisted, Drew and Kate can’t wait to tie the knot—if they can survive the pre-wedding festivities. \n For most of my life, I never imagined I’d get married. But Kate did the impossible: she changed me. I think we can all agree I was pretty frigging awesome before, but now I’m even better. \n The road to this day wasn’t all rainbows and boners. There were mistakes and misunderstandings worthy of a Greek tragedy. But Kate and I made it through with our inexhaustible lust, boundless admiration, and everlasting love for one another intact. \n That being said, there were some unexpected incidents in Vegas last weekend that could have been a problem. It was kind of... my final test. \n I know what you’re thinking—what the hell did you do this time? Relax. Let’s not judge, or call for my castration, until you\u0027ve heard the whole story. \n And hold on tight, because you’re in for a wild ride. Did you expect anything less?\n \n","cover":"https://allnovel.net/images/tied-tangled-4.jpg","author":"Emma Chase","type":"Humorous","source":"allnovel","link":"https://allnovel.net/tied-tangled-4.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:56:01 PM"}}
