{"id":96700,"no":11,"title":"Page 11","content":"The dream of the Roman appeared first. Wroth impatiently waited through the usual scene, seeking to see more. Did he truly want to? Could he ever turn back from this?\n Too late, it was done. He knew that he\u0027d unlocked the floodgates and that these dreams were going to play out, each spinning to their gruesome, perverted endings.\n Myst slowly lifted her skirt up. Yet then Wroth felt something new - chills crawling up her spine as she peered down at the Roman with his wet lips and furious stroking.\n She was ashamed at her disgust and closed her mind off it. She was the bait. She\u0027d be whatever it took to free her sister.\n \"I\u0027ll possess Myst the Coveted...\"\n No one possesses me but in their fantasies. I\u0027ll kill you as easily as kiss you... The Roman sought to make her his plaything just as he had Daniela for these past six months.\n Suddenly Myst glanced up and Wroth saw through her eyes. Lucia had Daniela in her covered arms, the girl\u0027s body limp and burned over most of her icy skin. Daniela had been tortured, Myst realized, by this animal at her feet, by his very touch. The familiar rage erupted within her. Control it... Just a moment longer... \"And I\u0027ll be yours, only yours,\" she somehow purred.\n When Lucia signaled, Myst nodded, extracting her foot, his lips producing a loud sucking sound that made her cringe. She tapped the man\u0027s bulbous nose with her big toe. In a tone dripping with sexuality, she said, \"You probably won\u0027t live through what I\u0027m about to do\" - her voice had gone to a breathy whisper belying the words and confusing the man - \"but if you survive, learn and tell others that you should never\" - a tap with the toe - \"ever\" - tap - \"harm a Valkyrie.\"\n Then she punted him across the room -\n Another scene began - the one with the raiding party, the one he\u0027d always dreaded seeing the most. The men were nearing; he could hear her feigning heavy breathing, a stumble. All a part of the game.\n One tackled her hard into the snow. The others pinned her arms. She was pretending fear, weakly struggling. While others cheered, a burly Viking knelt between her legs and told her, \"I hope you live longer than the last ones did.\"\n Lightning streaked behind the man\u0027s head and the wind seemed to follow it - a few looked around uneasily with nervous laughter.\n \"The last ones\u0027 names were Angritte and her daughter Carin,\" Myst informed him. Carin, so young, simple in the mind, had for some reason immediately recognized Myst for what she was. \"Swan maiden,\" the girl had whispered, uttering one of the Valkyries\u0027 more beautiful names.\n Both the careless mother and her innocent daughter had been killed, smothered under the weight of these men as they brutalized them. \"I will live longer than them - and you.\" A change came over her, like a bloodlust, thoughts turned feral, the rage...\n The frown on the attacker\u0027s face was the last expression he\u0027d ever make. She rose up, easily shaking off the powerful men. She had loved Carin for her very innocence and joy, and these beasts had stolen these things from Myst, from the world, which was poorer from the loss...\n As lightning painted the sky, she mindlessly slashed her way through them. When all but one were felled, she told the one she allowed to live, \"Any time you think to hunt down a woman or to force her, wonder if she\u0027s not like me. I\u0027ve spared you, but my sisters would unman you with a flick of their claws, their wrath unimaginable.\" She wiped her arm over her face, found it was wet.\n She crouched over the man and could see her reflection in his eyes. \"There are thousands of us out there. Lining these coasts, waiting.\" Her eyes were silver, and blood marked the side of her face. He was frozen in terror. \"And I\u0027m the gentle one.\"\n She turned from him, dusting off her hands and said to herself, \"This is how rumors get started.\" But her swagger disappeared at the site of the rough gravestones atop the hill by the sea - Carin\u0027s beside her mother\u0027s. \"You stupid human,\" she hissed at the mother\u0027s. \"I\u0027ve cursed you to your hell.\"\n \"Why did you disobey me? I told you to take Carin inland in the spring when they come down. Stay far from the coasts,\" she said, her voice breaking on a sob as she flew to the girl\u0027s tombstone. She curled up against it, her face resting against the crude inscription. Then she hit it, her blood trickling along the new jagged fracture.\n She stayed like that, unmoving for days, as villagers held a vigil at the base of the hill, offering up tributes fit for a goddess for her protection and benevolence. Wroth shuddered at the physical pain Myst didn\u0027t seem to feel - her hand frozen in blood to the stone, her muscles knotted, and skin raw from cold. On the third day, her sister N\u0026iuml;x found her and lifted her from the snow as easily as a pillow. Tears were ice on her face.\n \"Shhh, Myst,\" N\u0026iuml;x murmured. \"We\u0027ve already heard the tales of your revenge. They\u0027ll never harm another maid. In fact, I doubt that league of men will ever trouble this coast again.\"\n \"But...the girl,\" Myst whispered, awash in confusion, tears streaming anew, \"is simply gone.\" The last word was a sob.\n \"Yes, dearling,\" N\u0026iuml;x said. \"Never to return.\"\n Myst was weeping. \"But...but it hurts when they die.\"\n N\u0026iuml;x pressed her lips to Myst\u0027s forehead, murmuring, \"And they always do.\"\n Wroth\u0027s chest ached with Myst\u0027s sorrow as no physical wound had ever hurt him. She\u0027d run from the men because the ones who would chase a \"helpless\" maiden were the ones who would die. Wroth wanted to stay with that memory, to make sure she recovered from this hellish pain, but another familiar dream began. Snow outside, packed so high it covered half of the window. The meeting around the hearth. \"...teach her to be all that was good and honorable about the Valkyrie...\"\n Myst closed her eyes against a memory - the one he\u0027d struggled to see - that she could never erase, never alleviate. She remembered and she vowed again that she would be worthy.\n She was in the middle of her first field of battle, there as a chooser of the slain. She\u0027d been sent young, barely fifteen, because she\u0027d been born of a brave Pict who\u0027d plunged a dagger into her own heart. Myst was supposed to be like that.\n But she wasn\u0027t. Not yet. She was sick with terror.\n One hundred thousand men, cut to pieces, blood like a river up to her ankles. \"They were all brave,\" she said, peering around her, dizzily turning in circles as electricity rolled from her in waves. Sounding lost, she whispered, \"How am I to choose? A beggar handing out coins...\" She began trembling uncontrollably with fear.\n He wanted to be there to protect her, comfort her.\n Another memory. New to him. Could he withstand another?\n Myst ran to him when he returned to Blachmount from some errand, and as he\u0027d squeezed her up into his arms and kissed her, she\u0027d thought, \"I just ran to get in his arms. I just...Whoa. Whoa. Uhn-uh.\"\n Wroth remembered she\u0027d clambered down from him, looking flushed and panicky, joking about the Xbox, saying she felt \"a little like Bobby Brown\" for introducing him to the addictive game.\n Now he knew why she\u0027d panicked. Myst, along with all her sisters, had been taught that she would know her true partner when he opened his arms and she realized she\u0027d forever run to get within them.\n Wroth woke to his own yelling, thrashing over, clutching for her. Everything he\u0027d thought about her was wrong. His chest hurt with the loss and anguish she\u0027d experienced. \"You\u0027re free. Myst...\"\n The bed was empty.\n He shot to his feet, scanning the room, finding a bloody note on the table by the bed, under the cross. A heart for a heart...\n Dread settled over him, numbing his mind, even as panic was sharp, stabbing at his body like a blade. He half-staggered, half-traced into the study, eyes falling on the safe wall. To his horror, he saw no safe, but as he neared, growing more sickened, he found blood on the stone that had housed it, clawed away in a frenzy. She\u0027d dug through it to get to her chain, to her freedom.\n Wroth fell to his knees, head bowed as a guttural sound of pain erupted from his chest. At the first opportunity, he\u0027d offered her torture, only to follow it by stealing her freedom from her.\n And then...\n A heart for a heart. She\u0027d made his beat. Had he broken hers?\n He\u0027d lost her. And he\u0027d deserved to. \n","sourceLink":"https://allnovel.net/the-warlord-wants-forever-immortals-after-dark-1/page-11.html","bookId":2152,"book":{"id":2152,"title":"The Warlord Wants Forever (Immortals After Dark #1)","description":"Storyline: \n The Warlord Wants Forever (Immortals After Dark #1) \n EXCLUSIVE EBOOK NOVELLA with teaser chapters of the hugely anticipated LOTHAIRE \n Nikolai Wroth, once a ruthless human warlord in the 1700s and now a general in the rebel vampire army, needs to find his bride, the one woman who can render him truly alive. As a turned human, he doesn\u0027t enjoy a heartbeat or breathing and is consequently weaker than fully blooded vampires. He wants his bride for the power she will bring him and can hardly believe it when his heart beats for Myst the Coveted, a mad, fey, mythological creature. \n She eludes him for five years, but he has finally chased her to ground and stolen the jewel which commands her, giving him absolute power over her. While he possesses it, he can make her do anything, and he plans to in order for her to experience firsthand the agonizing, unending lust she\u0027d purposely subjected him to for half a decade. Yet when Wroth realizes he wants more from her and frees her, will she come.\n \n","cover":"https://allnovel.net/images/the-warlord-wants-forever-immortals-after-dark-1.jpg","author":"Kresley Cole","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-warlord-wants-forever-immortals-after-dark-1.html","creation":"Oct 5, 2019 8:58:23 AM","modification":"Oct 5, 2019 6:22:10 PM"}}
