{"id":19247,"no":13,"title":"XII WORK FOR THE SOLDIERS","content":"Knitting and Scraping Lint.—Sewing-circles.—Fairs for the Army and the Navy.—“The Boatswain’s Whistle.”—Mrs. Harrison Gray Otis.—Visiting the Camp at Readville.—Governor N. P. Banks.—Governor John A. Andrew.—Parade of the Ancient and Honorable Artillery.—Death of Little Sammy.—Assassination of Lincoln.—My Father Serves on the Freedmen’s Commission. WORK for the soldiers began promptly. In the general enthusiasm for knitting some one asked our minister, the Rev. James Freeman Clarke, whether it was right to do this work on Sunday. Any lingering doubts vanished when he returned home and found his wife, a woman of saintly character, lying down to rest, her needles still flying! Plain knitting I had mastered long before, but now I learned to make stockings. My first pair were by no means mates. As I learned to knit better, and so more loosely, the second stocking bloomed to a tremendous size! I could only survey it sadly in the fond hope that shrinking in hot water might reduce it to the size of its companion. We all scraped lint and there were sewing-circles in the afternoon and in the evening. The latter were the more festive, gentlemen coming in after our work was done. The Sanitary Commission then occupied much the same position that the Red Cross does to-day. Women showed the greatest zeal in working for it, though their efforts were not always wisely directed. The great patriotic fairs were a striking feature of war-days. The one held in New York for the benefit of the Sanitary Commission was the largest of all. The tremendous labor involved killed the noble woman who took a leading part in it. Boston also held a great bazaar for the benefit of the National Sailors’ Home, in which we assisted my mother. She was editor of the fair newspaper, The Boatswain’s Whistle. I remember the discussion of the title with William Morris Hunt, the artist, who imitated the action of the boatswain piping up aloft. He possessed the power to present, in this way, pictures which his striking head and figure made perfect. Doubtless he would have made a fine actor. At the head of the little newspaper stood the device of the boatswain designed by Mr. Hunt. My mother had the assistance of some of our best-known writers, but the responsibility and the heaviest share of labor she bore herself. Mr. James C. Davis helped in the work of arranging the paper, but it was necessary also to employ a professional person who understood the technicalities of the “make-up.” The Great Fair was held in the Boston Theater, and lasted some ten days. Every variety of object was sold there—many by means of raffles. It seemed fitting that there should be a table for the sale of our paper. We of the younger generation duly established ourselves in charge of it—selling also stationery and small articles. We thought it all great fun. I am ashamed to think how much we tormented Mrs. Hooper, the lady at the head of the fair management, for our various small needs. Mrs. Harrison Gray Otis, who occupied a unique position in the Boston society of that day, was prominent among the women who worked for the national cause. She had been beautiful in her youth, but retained no vestige of good looks that were perceptible to the clear, cruel eyes of youth. I could hardly believe my father when he told us of her former sylph-like slenderness. For many years she gave a reception on the morning of Washington’s Birthday, which the whole world of society attended. My mother took us once, when we found Mrs. Otis arrayed in a low-necked black dress, with a black velvet head-dress. Her black hair was arranged in puffs or bandeaux coming down over the ears, a style extremely unbecoming to the lined face of an elderly woman. Mrs. Otis was tall and dignified, standing to receive her guests. The entire house was thrown open to visitors, who wandered up and down-stairs at will. It already has been said that my father was too old for military service. Brother Harry was too young, being only thirteen when war broke out. The only near relatives who joined the army were two cousins of my mother, William Greene Ward and John Ward, and my father’s nephew, Thomas Beale Wales, Jr. Fortunately, none of the three was wounded. The two Wards were taken prisoner at Harper’s Ferry, but were paroled. Many of the young men of our acquaintance joined the army, some of them never to return. A sad case was that of Charlie Hickling, whose slight frame held a heroic spirit. In spite of his frail physique, he insisted on enlisting, only to return hopelessly broken in health. He died not long afterward. Tragedies were all around us. I was staying with my dear friend, Alice Weld, at Jamaica Plain, when news arrived of the capture of her brother, Stephen Minot Weld, Jr. The anxiety of his father may be imagined, yet he took the blow bravely. The horrors of the Southern prisons made confinement there a thing to be greatly dreaded. Libby was bad enough, but of Andersonville one cannot speak or think without deep indignation. I shall never forget the appearance of Arthur Sedgwick soon after his return from a Southern prison. With great black hollows under his eyes, he looked like a walking ghost. Another tragic picture comes to my mind. We were passing the day quietly at Lawton’s Valley when suddenly a distracted figure appeared among us. It was that of Mrs. McDonald—“D.D.,” as we affectionately called her—the matron of the School for Idiots. Her hair, always neatly arranged, was now blown by the wind and wet with the rain, but she was too deeply moved to think of that. She had braved the storm and come, in an open wagon, to seek help and comfort from the “Doctor”—a tower of strength to all who knew him. Her adored eldest son, serving on the Christian Commission, had been taken prisoner. After a time he came back to her, only to die a year or two later of tuberculosis. Like many other persons at that time, Mrs. McDonald found comfort in Elizabeth Stuart Phelps’s “Gates Ajar.” This was written, it will be remembered, after the author herself had passed through the bitterest sorrow. From the window of Miss Clapp’s school in Boston we saw the funeral cortege of Arthur Dehon Hill, who had been killed in the war. At the time we knew the family very slightly. A thoughtless school-girl, I little realized what death and sorrow meant. Six months later, when my own little brother died, I learned the sad lesson which all must learn for themselves. Visits to the camp at Readville, near Boston, were the order of the day, but, according to etiquette, these were made very sparingly. It was said of the Misses X—— that they went so often the officers could hardly find time to change their clothes! One of our friends arranged an expedition for us, our chaperon agreeing to join us in Readville. This young girl was terribly pestered by aunts, of whom she possessed eleven. She was wont to complain that wherever she went, an aunt was sure to appear on the scene! One of the eleven heard of the proposed expedition, and jumped to the conclusion that a chaperon in the hand was worth several in the bush. Accordingly, when our carriage started for Readville, another, containing the aunt and her fellow-conspirators, followed close behind. This greatly fretted our young companion, who, at the age of twenty, felt she was too old to need supervision. The expected chaperon failed to appear and the troublesome aunt serenely took charge of our expedition. Among the members of the Vigilance Committee mentioned earlier in this chapter was John Albion Andrew. One of the occasions when I remember seeing the man who was afterward the great war Governor of Massachusetts was at the parade of the Ancient and Honorable Artillery. In ante-bellum days this event elicited popular interest and was conducted with some formality. It was held on Boston Common, where the Governor reviewed the troop. The Ancient and Honorable Artillery Company has the unique distinction of consisting wholly of former officers of other militia companies. They wear a motley variety of uniforms, producing a picturesque but singular effect. Nathaniel P. Banks, a fine-looking man with thick, iron-gray hair, was at this time Governor of the state. His imposing and martial air enabled him to appear to advantage at a military festival. His deep voice and good delivery made him effective as a speaker in a day when oratory was still highly considered. As a warrior he was not a success. My mother used to tell us, with a mischievous air, a story of his experience in the army. On receiving a report that the enemy was attacking in force, he replied, laconically: “Let them be repulsed forthwith.” I remember how jolly and merry Mr. Andrew was as we stood, a party of plain citizens, in the throng that pressed as near as they could to the rope which divided us from the glory of uniforms blazing within the charmed circle. In those early days our beloved friend was the most delightful companion, brimful of fun, singing comic songs and telling funny stories, to the great delight of the Howe children. I remember hearing him repeat with gusto a ridiculous mock sermon from the text, “And they shall flee unto the mountains of Hepsidam, where the lion roareth and the whangdoodle mourneth for its first-born.” Although he amused us with the “flatboat” sermon, he was a truly religious man whose sympathies were by no means limited to his own sect. In figure he was short and stout. His round, smooth face, fair, close-curling hair, and blue eyes, reminded one of a benevolent cherub in spectacles. His mouth was like a woman’s, it was so pretty and sensitive, yet, when the occasion called for it, his face never lacked the dignity of expression springing from serious and noble purpose. We were present at his inauguration as Governor, and also on the occasion when he received, on behalf of the Commonwealth of Massachusetts, the gun that had belonged to Theodore Parker’s grandfather. This was one of the guns that fired, at the battle of Lexington, the shot heard around the world. Governor Andrew, filled with an emotion shared by the audience, kissed the weapon as he was about to give it up. Whereupon Vanity Fair, the comic newspaper of the period, published an absurd cartoon representing the audience weeping floods of tears and waving their handkerchiefs, the people in the pit holding up umbrellas to ward off the briny stream dropping from the galleries! In the days before he took office, Governor Andrew had been a familiar and delightful friend who came often to “Green Peace” and visited us also at Lawton’s Valley. Mrs. Andrew, who was a very pretty woman, usually accompanied him. His son, John Forrester, a pretty, fair-haired boy, later a member of Congress, we often saw, as well as the daughters. Elizabeth, or Bessie, looked very much like her father, and was said to be like him in character. Edith was a great friend of my sister Maud. After our friend became Governor and the Great Rebellion cast its dark shadow—the shadow of the cross—upon his path, we saw him less frequently. The cares of office weighed heavily upon him in those terrible days of the war. We began to miss him from his accustomed seat in the Church of the Disciples—he could not even go to church because so many people followed and waylaid him with their endless petitions. We heard with indignation of the box of copperhead snakes sent him by some wicked person. Toward the close of the war my mother and I had the pleasure of going, as members of the Governor’s party, to the Agricultural Fair and Ball at Barnstable. Usually the cadets accompanied him as escort, but this time the Ancient and Honorable Artillery Company were chosen for the honor. We were disappointed at the exchange, for the Independent Corps of Cadets contained a number of young men whom we knew. However, the “Ancients” undeniably furnished a sufficient number of partners. This affair has been described in my mother’s Reminiscences and in her Life. One verse in her humorous account of it records, the leniency of Governor Andrew: Governor A. won’t hang for homicide, That’s a point that bothers us all. He must banish ever from his side Such as murdered the Barnstable Ball. Our friend had received some criticism for refusing to sign the death warrant of a condemned murderer. He justified his action on the legal ground that, since the man had been judged only on his own confession, it was not right to hang him without a full and fair trial. When the war was over, Governor Andrew retired to private life, resuming the practice of his profession. The strain upon him had been tremendous. He laughingly said: “It’s nip and tuck. I may bust my boiler, or I may not.” Alas! A stroke of apoplexy carried him off while still under fifty years of age. He was as much a victim of the Civil War as if he had died on the field of battle. On the morning of Saturday, April 19, 1865, came the terrible news of the assassination of Abraham Lincoln and of the murderous attack on Secretary Seward and his son. Evidently there was a plot on foot to kill the chief officials of the national government. To the deep sorrow at the death of the beloved President was added the fear of the unknown evils threatening us and great indignation at the dastardly deed. How wide-spread the plot might be we did not know. Grief for the death of Lincoln was the predominant feeling. The sudden and tragic ending of his career showed his countrymen, as by a flash of light, the nobility of his character and the magnitude of what he had accomplished. Even the London Punch, which had jeered at the cause of the North during the Civil War, now made such atonement as was possible. I quote a verse of the poem by Douglas Jerrold: The Old World and the New, from sea to sea, Utter one voice of sympathy and shame! Sore heart, so stopped when it at last beat high; Sad life, cut short just as its triumph came. I do not believe our country has ever shown such universal signs of mourning. As my father and I rode on horseback about the suburbs of Boston, we saw house after house draped with black and white, some of the decorations being very elaborate. For a long time the countryside was swathed in mourning. The day after Lincoln’s death was Easter Sunday. In our own Church of the Disciples the pulpit was draped with purple cloth and adorned with flowers. In the afternoon I attended the services of the Church of the Advent, in which my friend, Louise Darling, was much interested, an Episcopal church of strongly ritualistic tendencies. There were no signs of mourning and no mention of the national sorrow! This seemed to me very heartless. Meanwhile the assassin was at large. It was a most dramatic as well as a most terrible time in our history. I read the newspapers—doubtless every one did—with the greatest interest. Here the story gradually unfolded itself, culminating in the trial and execution of Mrs. Surratt and the other conspirators. I remember wading through endless testimony, the question whether Edward Spingler did or did not wear a mustache being much discussed. In spite of his crime, I felt a pang of pity for Wilkes Booth when I read of his tragic death. It was necessary that he should be shot down, like a creature at bay, but the attendant circumstances, the firing through the cracks of the barn, lent additional ignominy to his fate. While we were still living at “Green Peace” our youngest brother, Samuel Gridley Howe, Jr., was born. He was a fine, large baby, weighing twelve pounds at birth. Soon after his arrival in this world (on Christmas Day, 1859), and while our mother was still confined to her room, several of us were attacked with scarlet fever. The great danger of contagion from this disease was not then clearly understood. My father inquired of Mr. Gardner, headmaster of the Boston Latin School, whether he wished brother Harry, who had not contracted the fever, to remain away. Mr. Gardner decided it would be safer for the boy to do so. The breaking out of smallpox at the Idiot School, of which my father retained the supervision, brought my mother a new anxiety. Would it come to her, and was it, as she had heard, fatal in confinement cases? Fortunately, our household escaped the disease and the scarlet fever left no bad effects behind. Little Sammy was a beautiful and healthy child, yet he fell a victim to diphtheritic croup in May, 1863, when he was three and a half years old. His death brought me the first realization of the meaning of sorrow. We had lost my father’s sister, our kind and devoted Aunt Lizzie, two years earlier, but the loss of little Sammy was a much greater bereavement. I could not understand then, nor do I now, the point of view which those persons take who declare that it is a beautiful thing for a little innocent child to leave this world and go to heaven. I felt, at seventeen, as I do at seventy, that it is contrary to the laws of nature for a child to die. It is the saddest death of all, for the little one has been cut off untimely from the life on this earth that his Creator meant him to enjoy. As this was my first experience of deep sorrow, it brought me the first knowledge of the beautiful human sympathy without which grief would be unendurable. Friends and relatives gathered about my stricken parents, helping them to bear the dull burden of grief. It made my father seriously ill; indeed, he grieved for the boy to the end of his life. My mother, like most women, was able to give more expression to her sorrow. After her death we found a little book of verses and a letter written to her lost darling, in which she poured out her grief. In her journal are many mentions of the little boy, showing how his memory dwelt in her heart throughout her life. Fortunately for my father, he had on hand a task of wide importance in connection with the recently freed slaves. From the beginning of the war he had labored to bring about the freeing of the negroes. It had not been five months in progress when he called a meeting of anti-slavery men at his office “to take into consideration measures tending to the emancipation of slaves as a war policy.” This resulted in the formation of the Emancipation League, the Commonwealth being once more brought to life as its organ. As my father’s duties on the Sanitary Commission took him frequently to Washington, in 1861–62, he was able to urge upon the President the necessity of emancipating the negroes. But he well understood that so tremendous a change involved the making of preparations beforehand. In September, 1862, the month when Lincoln issued the Emancipation Proclamation, we find him writing from Washington to a friend of his plan for the creation of a bureau to inquire into the actual condition of the freedmen, their wants and their capacities. In 1863 Stanton, then Secretary of War, appointed a Freedmen’s Inquiry Commission, the members of it being my father, Robert Dale Owen, and James McKay. So, when we came to New York for a change of air and scene, shortly after little Sammy’s death, we found my father busy in the office of the commission, in spite of his sufferings from the gout. It was always his policy to gather facts and knowledge before taking action. Hence the many reforms which he instituted were lasting. They were not built for a day, and as he took no thought of his own glorification, no personal element deflected them from the right track. Evidently it was important to ascertain what the negroes had done with their freedom in other English-speaking countries. So the commission thoroughly investigated conditions in the Province of Ontario (then Canada West), where twenty thousand colored people were living, and made an exhaustive report. The labors of the Freedmen’s Inquiry Commission were those of a pioneer body. They were carried on later by the Freedmen’s Bureau. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2982/82238.html","bookId":1072,"book":{"id":1072,"title":"Memories grave and gay","description":"简介： It has been a pleasure for me to recall, at the kind request of the Messrs. HarperBrothers, the memories of a lifetime, even though some sad thoughts have mingled with the happy ones. So many bright shapes have risen out of the past at my bidding tha...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2982","creation":"Aug 1, 2019 12:24:18 AM","modification":"Aug 1, 2019 12:24:18 AM"}}
