{"id":91205,"no":24,"title":"Page 24","content":"\n “Yes, there are the Candler Hospital tunnels—truly fascinating, and with very little written history, especially on how and when they were built. Most believe it was during the Civil War. There was once an underground morgue, and autopsies were done there. Some historians note that it was cooler underground, so perhaps it was an attempt to stop the yellow fever and malaria epidemics that used to strike. Oh, and there are the catacombs under an old abandoned church called Saint Sebastian’s.”\n He suddenly stopped walking. “We’re on X marks the spot,” he told them.\n “Do you know why anyone would have marked this spot on your map?” Malachi asked.\n “Well, we’re standing over a tunnel. Other than that? No. There’s nothing here but sidewalk. And some pretty moss-draped oaks next to us.”\n “The church is right there,” Abby murmured.\n “The church? Saint Sebastian’s? The church you were just talking about?” Malachi asked.\n “None other,” Roger told him, obviously gleeful that his knowledge of the city and its history was being fully appreciated. “The church and the tunnels will not be found on official tours. The city’s had a problem at various times with vagrants crawling in. In fact, you can find historic beer cans and cigarette butts at the entries to many of the tunnels,” he said, not hiding his sarcasm.\n Abby glanced at Malachi. “X equals underground,” she said. “It doesn’t sound like Helen. I mean, crawling around underneath the ground does not sound like Helen.”\n “Helen Long?” Roger looked a little ashen.\n “We think this was her map,” Malachi told him.\n Roger nodded, clearly perplexed. “Yeah, I gave it to her, but I never saw her mark the map,” he said. “She was just asking me about taking a good tour of the city. She was hoping to leave soon. She’s driven—really wants to act. But she was asking me about the old church. She said she’d talked to someone who was thinking of buying it, as it hasn’t been renovated since the nightclub or worked on by the private company that bought it for historical preservation. This guy she knows wanted to make something out of it like a year-round haunted house. Pirate-themed.”\n “How did she hear about it? As far as I knew, it was off the beaten tourist and business track,” Abby said.\n “This guy she met, I guess.” Roger shrugged. “Maybe someone who’d taken the tour out on the Black Swan. Helen’s a sweetheart. Kids love her on that ship. Adults, too. Especially guys.”\n Malachi nodded. “How about showing us the church?” he suggested.\n “I can show it to you—and the catacombs and tunnels, which are kind of one and the same. But it’s against the law since it’s private property. Oh, wait—you are the law, aren’t you?”\n “Sure,” Malachi said, looking at Abby. “Well, we really are the law, although I’m still a consultant. But you’re the real deal.”\n “So are you,” she said softly. Her voice, her sincerity, stirred something within him.\n “Okay,” Roger said, turning back to them. “Let’s go around to the side. Casually, of course. There’s an old, small iron door that was used for ice delivery. We can crawl through that and then through the hallway. Just be careful, okay. I’d rather not draw attention to us as we creep around private property.”\n “We shall creep with incredible agility, and quietly,” Malachi said.\n They crossed the street. It was actually easy to disappear into the many trees that surrounded the old church. Slipping around the side, Malachi realized that at one time there’d been a delivery path there; he could imagine the horse-drawn wagon that would have carried the ice blocks, could see where it must have parked for the few minutes it took the driver to make his delivery. The ice delivery “door” was about four feet off the ground and had a massive dark metal hatch that opened to allow for a space of about three feet by two.\n “You can get in?” Roger asked. He gripped the handle. It was old, hadn’t been oiled in forever and didn’t budge. Malachi stepped past him. “Let me give it a try,” he said.\n “I have opened it before,” Roger told him. “Seemed to be easier then.”\n Malachi gripped the handle, got it into the open position, then braced a foot against the building and pulled hard. When the door gave, he had to jump back quickly to keep from falling.\n “I’ll pop through first. Make sure there are no spiders or snakes!” Roger told Abby.\n “You’re afraid of spiders and snakes?” Malachi asked her.\n “I’m not particularly fond of either, but I don’t freak out.”\n “You used to scream like a girl when you saw a spider,” Roger said.\n “I am a girl, but I haven’t screamed at a spider in years,” Abby insisted. Roger merely smiled, then hiked himself up and eased his body through the opening. Abby glanced at Malachi and followed Roger, and then Malachi followed her.\n He had to crawl through the old, lined wooden icebox, and when he did, he stood in a room that was shadowed and empty. After a moment his eyes adjusted and he saw something that looked like a contemporary counter against the wall. There were cups covered in spiderwebs; the floor was gritty with dust.\n “Come this way,” Roger said. “There’s a hall that leads to the main church.”\n Malachi set a hand on the small of Abby’s back as they started through the shadows to a door. There were drapes on the few windows down the hallway, shredded and torn in places. Daylight glinted through the rips and tears.\n They came to a door that opened into the side of the main church. There were no longer pews that faced the altar, but the steps to the altar and the altar on its dais still stood. Here, there was light that seemed to spew into the interior in a number of colors. Stained-glass windows remained, none had been damaged or altered. Biblical scenes were represented in the glass, beautifully executed. Above the altar, Christ looked down at Mary Magdalene and his mother, Mary, surrounded by lambs. To one side was John the Baptist, to another, the archangel Gabriel.\n The glass windows marched down both sides of the church. The blues in the glass were rich and deep, as were the crimsons. The light they admitted was eerie.\n Tables had replaced the pews. When it was a nightclub, the owners had played on the religious symbols and added to them with an ironic and diabolical twist—bats dangled from the ceiling.\n “The tunnel entrance is up on the dais and behind the altar,” Roger said.\n They trailed after him.\n It wasn’t quite as odd an entry as the one by which they’d entered. A little wooden fence surrounded a grate; they opened the entrance and then Roger bent down to lift a hatch. A steep narrow stairway led to the darkness below.\n “Father Liam O’Leary is in the coffin directly beneath the altar,” Roger said. “The Irish Catholics liked to take their cues from Rome, I guess, and the Vatican. There are a number of coffins on biers just below here—glass encased. Sort of creepy. I’ve got a little penlight. Anyone else have anything?” he asked.\n “Yeah,” Abby said, producing her key chain and a small flashlight. Malachi drew the light he’d used that first night out of his pocket.\n “Prepared, huh?” Roger joked.\n “Me and the Boy Scouts,” Malachi said. He shined his light over the circular room, directly beneath the altar where they were standing. Not surprising, it was dank and musty, and there seemed to be a verdant smell of the earth around them. He walked over to one of the coffins. The lid was glass; beneath it lay the decaying body of a priest in his vestments. His skin was growing brown as it stretched over the bone. Malachi dusted the grit and grime off the bronze plaque before him. His name had, indeed, been Liam O’Leary and he’d been born in County Cork in 1744 and died in Savannah, Georgia, in March of 1793, beloved of his “lambs.”\n “First priest here,” Roger told him. “And around the room you have several more of the especially beloved fellows who served the faithful. I’m surprised they weren’t dug up—or carted out—when the church sold the property in the late 1890s and the building was deconsecrated. Could’ve been bureaucratic error, red tape, whatever. Seems strange and sad that these guys were down here while people were up above them drinking ‘Exceptionally Bloody Marys’ and watching vampire bats dance over their heads.”\n Malachi and Abby both nodded.\n “When I first started exploring down here, I was shocked,” Roger said. “And I didn’t even know there were catacombs or tunnels—until I leaned against the wall and it turned out someone had just boarded up the entry. I practically went through. But there are five tunnels leading out from here, with lots of corpses lining them. Again, kind of like the Christian catacombs in Ancient Rome. Savannah started off English, of course, but had a large Irish population from the beginning. Man, you should come for Saint Patrick’s Day! But that’s beside the point. These people were very Catholic. And when the church was established here, they emulated Rome.”\n “Five entries—by each of the five dead priests?” Malachi guessed.\n Roger nodded. “After I found the first, I tapped around the room and found the rest of them. Those three—” he pointed across from Father O’Leary “—must’ve caved in decades ago. The other trunks go on and on. It gets damper and damper as they head under the streets to the river. So...” He let the word hang as he lifted his flashlight to look at Malachi’s face. “You can pick door number one or door number two.”\n “I think we should head out from behind our good Father O’Leary—what say you, Ms. Anderson?”\n “I’m sure the good father would not lead us astray,” she said.\n He smiled and raised his own flashlight. The beam played over Roger, standing between two of the glass-domed coffins and their decaying priests, and then over Abby. She appeared to be pale, almost ethereal with her jet-black hair and deep eyes. She would’ve been a perfect image, he thought wryly, when the place was a vampire-themed nightclub. \n","sourceLink":"https://allnovel.net/the-night-is-alive-krewe-of-hunters-10/page-24.html","bookId":2284,"book":{"id":2284,"title":"The Night Is Alive (Krewe of Hunters #10)","description":"Storyline: \n The Night Is Alive (Krewe of Hunters #10) \n MIDNIGHT IN SAVANNAH \n It\u0027s a city of beauty, history... hauntings. And one of the most haunted places in Savannah is a tavern called The Dragonslayer, built in the 1750s. The current owner, Gus Anderson, is a descendant of the original innkeeper and his pirate brother, Blue. \n Gus summons his granddaughter, Abigail, home from Virginia, where she\u0027s studying at the FBI Academy. When she arrives, she\u0027s devastated to find him dead. Murdered. But Abby soon learns that Gus isn\u0027t the only one to meet a brutal and untimely end; there\u0027ve been at least two other victims. Then Captain Blue Anderson starts making ghostly appearances, and the FBI\u0027s paranormal investigation unit, the Krewe of Hunters, sends in Agent Malachi Gordon. \n Abby and Malachi have a similar ability to connect with the dead... and a similar stubbornness. Sparks immediately begin to fly — sparks of attraction and discord. But as the death toll rises, they have to trust each other or they, too, might find themselves among the dead haunting old Savannah!\n \n","cover":"https://allnovel.net/images/the-night-is-alive-krewe-of-hunters-10.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-night-is-alive-krewe-of-hunters-10.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:46:54 PM"}}
