{"id":88405,"no":25,"title":"Page 25","content":"“You’re saying Miller doesn’t have a single building here?” Lucy asked.\\n\\n “That’s what I’m saying.”\\n\\n Peyton and Lucy looked at each other and began to laugh. Then Peyton said, “I think it’s time to invite Mr. Miller to tour our little cove.”\\n\\n “How soon do you think word will get back to Cassady?” Lucy asked.\\n\\n Christopher grinned. “Before Miller gets out of his car.”\\n\\n Finn interrupted their discussion by jumping to his feet. “Stay here,” he ordered as he unsnapped his gun and headed to the bar. The panicked young bartender was trying to separate the two men who were now going at each other in a shoving match. Each man outweighed the bartender by at least a hundred pounds. One had a large beer gut, and the other had a pronounced double chin. Both were so out of shape, they were panting and sweating profusely. Finn suspected that, if they got into a fistfight, the exercise would kill them. Double Chin was accusing Beer Gut of stealing money from him. It was always money or women, Finn thought.\\n\\n Everyone in the bar fell silent and scattered to watch the brawl from a safe distance. The argument was getting out of hand, and Finn got there just in time. Beer Gut was reaching behind his back and pulling a handgun from under his shirt when Finn slammed his head down on the bar. “Hands where I can see them,” he ordered.\\n\\n Beer Gut struggled to lift his head. “Who are you to tell me—”\\n\\n Finn took his gun. “I’m FBI. Now put your hands on the bar.”\\n\\n He turned to Double Chin whose hand had disappeared behind him. “You too,” Finn barked. “Turn around and hands on the bar.”\\n\\n “What are you gonna do? Shoot me?” The smirk on his face disappeared and he froze when Finn pressed the barrel of a gun against his forehead.\\n\\n “Yes, that’s exactly what I’m gonna do,” Finn said.\\n\\n Double Chin turned slowly. Finn snatched his gun and pushed him toward the bar.\\n\\n “What were you planning?” Finn asked the two culprits. “To shoot each other in a bar full of people?”\\n\\n “He owes me money,” Beer Gut whined.\\n\\n “Oh, then that’s all right.” Finn wanted to coldcock both of them but he resisted the urge. He patted them down and removed a switchblade from Beer Gut’s pocket, then dragged both men to the back of the bar and made them sit on the floor to wait for the police. As he was making the call, he walked back to his table where Lucy and Christopher were watching the action with mouths open and eyes wide.\\n\\n “It will be a few minutes before we can leave,” he told them.\\n\\n He was worried Peyton would be freaked out, but she wasn’t. Smiling, she said, “Then I’ll have dessert.”\\n\\n Ten minutes and one scoop of vanilla ice cream later, Officers Trace Isles and Cody Pepperson arrived. Finn was waiting for them, standing next to the two men sitting on the floor.\\n\\n “Twice in one day,” Trace said. “We’re sure glad you’re here. You cut our crime wave down to zero.”\\n\\n “How are your ribs?” Finn asked.\\n\\n “Sore, but intact. No cracks from that bullet. You know, it could have been a bloodbath out there.”\\n\\n Finn nodded. “It could have.”\\n\\n “Sorry you had to spend so long at the station with reports.”\\n\\n Grinning, Finn said, “I spent more time on the phone with my boss.”\\n\\n “I didn’t think those reporters who showed up were going to let you get out of there,” Trace said.\\n\\n “I just let them know that the Port James Police Department would be handling any statements.” He changed the subject and nodded toward the two brawlers on the floor. “About these two . . .” He told what had happened and gave Trace the weapons.\\n\\n Across the room, Peyton was watching with interest and trying to figure out what was going on. It appeared that Finn was familiar with one of the police officers, and she couldn’t understand how they would know each other. When at last the police hauled the two men to their feet to take them away, Finn returned to their table.\\n\\n “We can leave now,” he announced.\\n\\n “Did you know that police officer?” she asked.\\n\\n “We’ve met,” he answered.\\n\\n Still curious, she asked, “Where?”\\n\\n “I’ll tell you later,” he answered as he took her hand and led the way toward the door with Lucy and Christopher close behind.\\n\\n They were halfway across the bar when Peyton noticed that everyone was staring at them and then glancing up at the television overhead. She pulled her hand away from Finn’s and stopped. On the screen was an image of a man being carried on a gurney to an ambulance. The picture that followed was Finn’s face. Microphones were being shoved at him as he was getting into his car. Across the bottom of the screen scrolled the story of a shooter at a bank and the brave FBI agent who saved the city from carnage.\\n\\n Peyton looked at the screen and then at Finn in total shock. “You saved a whole city?”\\n\\n “Come on. Let’s get out of here.” He put his arm around her shoulder.\\n\\n She started laughing.\\n\\n “Of course you did,” she said as she let him steer her toward the door.\\n\\n They made their exit just as the cheering and the clapping erupted. All of it for Finn. The hotshot.\\n\\n TWENTY\\n\\n Peyton’s idea of swimming was to sit on the side of the pool and dangle her feet in the water. If she were at the beach, she would sit in the sand and let the surf gently wash over her toes. For her, swimming was a leisurely, relaxing activity that didn’t involve work.\\n\\n She knew Finn wasn’t going to let her be a bystander tonight. When he said they were going to swim, he really meant swim.\\n\\n Maybe she could distract him, or at the very least torment him a little. She knew he liked her body—he’d told her so several times now—and if he was going to force her to do laps, she was going to wear one of her old and definitely obscene bikinis. She wanted to make it difficult for him to concentrate, and the suit just might do it. The top of the bikini, two triangles of fabric that plunged to a deep V, revealed the fullness of her breasts, and the bottom—what little there was—was fabric held together by a string tied into a bow at the top of each hip. This wasn’t the first time she’d worn the killer suit. She’d put it on several times in the past couple of years, but she had never had the nerve to actually wear it out of her bedroom. Tonight was different. She wanted to drive the man who had just saved a frickin’ city out of his ever-loving mind.\\n\\n She pulled on a University of Texas T-shirt and a pair of white tennis shorts. Just in case the air turned chilly she carried a thick white terry-cloth robe she’d borrowed from linens at the hotel. It would keep her warm on the walk back. She tucked her phone and a few other necessary items in the robe’s deep pockets, and she was all set.\\n\\n Finn was waiting for her by the door. He took her key to lock the deadbolt on their way out and slipped the key in the pocket of his jeans. As usual, his gun was attached to his belt. He noticed her staring at it. “We’ve been over this. While I’m here, I’m keeping the gun close.”\\n\\n “It came in handy at the bar.”\\n\\n He took hold of her hand. “You’re dragging your feet. Let’s get moving.”\\n\\n Reluctantly she picked up her pace, her flip-flops slapping against the concrete with each step. “It’s a good thing the man you threatened to shoot didn’t know you were bluffing.”\\n\\n “I was bluffing?”\\n\\n That devastating smile was back. He could get anything he wanted with that smile, she thought. She was ready to throw herself at him now, and she imagined every other woman he met felt the same way. Hmm . . . she didn’t know how she felt about that. Picturing him with any other woman didn’t sit well. That unpleasant thought led to another. Danielle. What was the story with her?\\n\\n “Why are you glaring at me?” he asked as they made their way across the back lot and headed to a side door of the hotel.\\n\\n She shook her head. “What did the technician have to say?”\\n\\n Finn explained what the findings were and ended with, “When I find the rifle that was used, the bullet will match it.”\\n\\n Peyton handed Finn the key to get inside the hotel. What little staff there was had gone home hours ago. It was eerily quiet inside. The soft lighting above the baseboards of the hallway led to the lobby and the elevators. Another key unlocked the door to the pool. The smell of chlorine was faint but noticeable. Finn flipped the lock so that no one else could enter, then turned on the underwater lights, and a shimmering iridescent glow filled the dome.\\n\\n Peyton watched him strip down to his swim trunks, the muscles across his shoulders rippling as he stretched his arms over his head, his skin dappled gold by the lights. He sat on the side of the pool and waited for her to join him, but she wasn’t in any hurry. She turned away from him and removed her shorts, carefully folding them and placing them on the chair next to her robe. Slowly she lifted her T-shirt over her head and tossed her hair back over her shoulder, hoping the action was provocative.\\n\\n Trying to be sexy took concentration, she decided. Unfortunately, it was a wasted effort because, when she turned around, Finn was in the water already swimming laps. Maybe she would get to sit on the side and dangle her feet after all. The thought cheered her. She dug through the pockets of the robe, found her hair tie, and pulled her hair up into a ponytail. She checked her phone messages next. By the time she was finished with that task, she was sure Finn would have done several laps.\\n\\n Finn pulled himself up and out of the pool and stood with his legs braced apart waiting for Peyton to turn around. He couldn’t take his eyes off her gorgeous backside. He wondered how she’d feel if he told her it aroused the hell out of him. When she finally turned to face him his knees nearly buckled. Her br**sts were full and round, and her h*ps gently flared above her perfect thighs and long amazing legs. She was slender and fit, and yet she was soft everywhere. Damn, he wanted her.\\n\\n Peyton slipped her phone into the pocket of the robe and looked over her shoulder to find Finn standing on the pool deck watching her. The intensity in his expression and the dark look in his eyes told her the bikini had done its job. She slowly walked over to him, stopped long enough to run her fingertips across his chest, and then continued on. He came up behind her, lifted her into his arms, and jumped into the water. When they came up, her arms were wrapped around his neck, holding tight, and her body was pressed against his.\\n\\n “Show me what you can do.” His order was gruff and sexy as hell.\\n\\n She kissed the side of his neck, then tugged on his earlobe with her teeth. Her tongue brushed against his skin.\\n\\n Finn tensed in reaction and instinctively increased his hold on her. “What the hell, Peyton?”\\n\\n “I’m showing you what I can do,” she whispered.\\n\\n “I meant swimming,” he said as he pulled on her ponytail to bring her face up so that his mouth could cover hers. His hands moved down her back to her h*ps and he lifted her up to wrap her legs around him. Her pelvis rubbed against his groin as he made love to her with his mouth. For that moment in time she belonged to him.\\n\\n Panting for breath, he finally lifted his head. “What else have you got?”\\n\\n The challenge was there in his eyes. “Plenty,” she whispered.\\n\\n Her hands moved down his chest, her fingers first circling his nipples, then gliding lower, stroking and caressing. He inhaled sharply when her fingers slid under the waistband of his trunks.\\n\\n Suddenly she pushed away from him. “But we’re here to swim.” Laughing, she took off across the pool.\\n\\n Finn stood there watching her. Long, even strokes, the right amount of kick, her head turning just enough to take in air. Her technique was every bit as good as it used to be. She’d come a long way since the summer all those years ago when he’d gotten stuck teaching her.\\n\\n He remembered the hell she’d put her parents through. They were desperate for their girls to learn how to swim—to this day, her mother cried whenever she talked about the near drowning. Lucy and Ivy were quick learners. Peyton, on the other hand, screamed bloody murder whenever she got close to the water. Her parents tried everything. Group lessons at the Y, individual lessons at the country club—Peyton, stubborn to the core and terrified of the water, was having none of it. She liked wearing her swimsuit. She just wasn’t going to get it wet.\\n\\n The two fathers—his and Peyton’s—came up with the brilliant idea that Finn should teach her. His reaction at the time was not positive. Just what a fourteen-year-old teenager wanted, a girl—what was she then? Five? Six?—screaming nonstop to keep from going into the pool. He had tried to get out of giving the lessons, but her father used Finn’s own words to get him to agree, reminding him that he had insisted that Peyton learn how to swim for her own safety. Reluctantly, Finn had acquiesced.\\n\\n Having been warned about her fear of the pool, Finn showed up for her first lesson prepared for battle, and the strangest thing happened. She didn’t scream at all. She put her arms around his neck and willingly let him take her into the water. She was too young to have such absolute trust, but she did, and it took only three or four weeks before he had her swimming like a fish.\\n\\n As he now stood beside the hotel pool watching her glide through the water, he was pleased to see that she hadn’t forgotten what he had taught her. She swam toward him, and when she flipped to begin another lap, he dove in and swam alongside her.\\n\\n Peyton didn’t have as much stamina as Finn. She wore out in ten minutes and got out of the pool, content to sit on the side while he continued.\\n\\n Her thoughts were scattered. There was so much to worry about she didn’t know where to start. Since she had arrived at Bishop’s Cove she’d done nothing but put out fires. She hadn’t had time to think about the restaurant she wanted to remodel. The building was inside the Cove but had been closed for over a year now. With the right chef, a killer menu, and beautiful decor, it could become the place to go. As soon as the other renovations were running smoothly, she could focus on it.\\n\\n The new bullet hole in her car was another worry. According to Finn, the shooter couldn’t be identified . . . at least, not yet. If Drew Albertson was behind it, she hoped he was now convinced she wasn’t a threat to him and had gone home prepared to forget about her.\\n\\n And that brought her to her biggest worry of all, the recording and getting it into the right hands. She needed to talk to Finn about Atlanta. As soon as Mimi texted Erik’s itinerary, Peyton would make her own flight reservation. Hopefully, it would be a one-day trip. The recording was a weight on her shoulders, and the sooner she gave it to Erik, the better. \\n\\n","sourceLink":"https://allnovel.net/hotshot-buchanan-renard-11/page-25.html","bookId":1826,"book":{"id":1826,"title":"Hotshot (Buchanan-Renard #11)","description":"Storyline: #1 New York Times bestselling author Julie Garwood returns with a novel of family drama, suspense, and—of course—romance. \\n Peyton Lockhart and her sisters have inherited Bishop’s Cove, a small, luxurious oceanfront resort, but it comes with a condition: The girls must run the resort for one year and show a profit—only then will they own it. \\n A graduate of a prestigious French culinary school, Peyton has just lost her job as a food critic. Out of work and in a bad place personally, a year doing something completely different sounds wonderful. \\n There are countless challenges and too many people who want to stop the sisters from succeeding. Among them are Peyton’s contentious cousins, who are outraged that they didn’t inherit the resort, as well as a powerful group of land developers who have been eyeing the coveted beachfront property. \\n It’s soon apparent to Peyton that their efforts are being sabotaged, but she refuses to let the threats scare her—until she’s nearly killed. She calls on her childhood friend and protector, Finn MacBain, now with the FBI, and asks for his help. He saved her life once; he can do it again.\\n","cover":"https://allnovel.net/images/hotshot-buchanan-renard-11.jpg","author":"Julie Garwood","type":"Romance","source":"allnovel","link":"https://allnovel.net/hotshot-buchanan-renard-11.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:27:14 PM"}}
