{"id":88410,"no":30,"title":"Page 30","content":"“Can’t we have both?” Peyton asked.\n A commotion coming from the outer office interrupted the discussion. Lucy and Peyton recognized the high-pitched screech. Debi had arrived. Since Braxton was the only other person out there, Peyton assumed he was getting the brunt of her anger.\n “Guess who’s here?” Peyton said dryly.\n “Wasn’t she supposed to start work this morning?” Lucy asked. “Peyton, why are you smiling?”\n “Because she isn’t our problem. Christopher is her boss.”\n Lucy smiled sweetly and, keeping her gaze on Christopher, said to Peyton, “Don’t worry. He’s used to working with difficult people.”\n “If you’ll excuse me,” Peyton said, “I’m going to go save Braxton from Satan’s little helper.”\n The second Debi spotted Peyton, she started in. Pointing at Braxton, she yelled, “This rude man won’t let me get past to go into Christopher’s office. I told him I work here, but he won’t budge. Who does he think he is?”\n “Shall we go?” Peyton asked Braxton as she walked past Debi without a response. She could hear her cousin sputtering with indignation as they exited the building, and she smiled with childish satisfaction. Braxton obviously approved. He winked at her.\n As Braxton escorted her home, he told her about the conversations he had been having with the agents in Dalton. “They’re reporting that everyone is calm, and all the people they’re watching are going about their normal routines. Erik Swift is cooperating with them fully and giving them daily updates. There had been some concern that Randolph Swift might be a hindrance, but after he heard the recording you gave Erik he realized how serious the situation is.”\n “So Randolph is going to take action?”\n “Yes,” he replied. “One of the agents said that Erik and his father went to an attorney in Minneapolis and changed Randolph’s trust. He said they sat there until it was done, signed it with witnesses, and filed it. Come Friday, Drew and his wife are in for a major surprise.”\n “Friday is the day Randolph was going to announce Drew’s promotion,” she said.\n “Evidently he’s so irate about Albertson’s behavior, he wants to fire him in front of the whole company. Randolph wants no misunderstanding that he’s out, and so is his wife.”\n “I wish I could be there,” she admitted.\n “I bet Finn would like to be there, too.”\n “About Finn,” she began, then hesitated while she thought about the right way to say what she wanted.\n “Yes?”\n “He’s a family friend, and I’ve asked a lot from him. He took time off his job to help, and I really appreciated it, but he’s back at work and I don’t want anyone to ask for his help again. He’s done enough,” she stressed. “And we’re set, aren’t we? If there’s trouble, you and Drake will handle it, and if anything should happen, I don’t want him notified. I’ve used up enough of his time.”\n Braxton didn’t seem to have a problem with her request. “Okay,” he said. Switching subjects he asked, “Are you in for the night, or do you want to go somewhere?”\n “I’m staying in.” She checked her phone to make sure she had his number programmed, Drake’s number, too. “Are you leaving for the night?”\n He smiled. “We’ll be around.”\n Peyton had done an adequate job of blocking thoughts of Finn during the day, but as soon as she got into bed, she couldn’t seem to stop thinking about him. Where was he? Still in Seattle? On his way to D.C.? What was he going to do there? Probably stop by the White House to pick up another award for doing something extraordinary, she imagined, and that thought made her smile. With Finn anything was possible.\n Or maybe he was reconnecting with Danielle, the woman who had ruined him. Closing her eyes in frustration, Peyton told herself she didn’t care. The man had walked away from her, and she would never forgive him for that.\n Sleep eluded her. Throwing off the covers she reached for her notebook and began to write down more lessons she had learned that would go into her cookies someday. Lessons such as: Never waste the expensive cheese in a frittata for a man who is just going to dump you—or—Never bring out your most seductive swimsuit for a man who is just going to dump you—or—Always lock the door before you shower so you won’t give in to temptation and have sex with a man who is just going to dump you. Okay, maybe her axioms were getting a little long and wordy, and maybe ending every one with “a man who is just going to dump you” was a little repetitive, but that didn’t make them any less true. She knew she wouldn’t actually insert any of these proverbial warnings in her baking, but writing them down and getting them off her chest made her feel better.\n Whenever she thought about Finn, she bounced back and forth between overwhelming sadness and ridiculous anger. By the time she finally fell asleep, she was wrung out.\n The rest of the work week was a god-awful mess . . . all because of Debi. On Tuesday the technology-challenged cousin accidentally deleted more than sixty files from the computer, and it took Peyton until midnight to retrieve them all. Wednesday, after printing one hundred too many copies of a file—again, by accident, Debi insisted—she broke the main printer while trying to jam a paper tray into the wrong slot. Thursday morning, Lucy gave Debi a list of tradesmen to call and schedule to work. By nine o’clock, she had alienated every one of them. One tradesman threatened to sue for defamation of character after he talked to Debi. At ten, Christopher gave her a list of errands. Simple errands. She was to drop off a set of plans to a landscaper, pick up paint decks from Dan Miller’s office, pick up two packages from the Port James post office, and bring back lunch from a local diner. It should have taken her no more than two hours to get the errands done. Three hours tops. Debi left at ten in the morning and strolled back into the office at four in the afternoon. She was sipping a Big Gulp drink and didn’t have any packages with her; however, there were several noticeable changes in her appearance. She was wearing new purple nail polish. Peyton spotted it immediately because it was such a horribly neon-bright shade. Debi’s blond hair was much lighter and not quite as brassy, and it had been cut and styled. Her clothes were different, too. She’d left the office in black slacks and a fuchsia blouse and returned wearing a floral skirt and a tight purple tank top. Her matching sandals were also new.\n Aside from giving each other an oh-my-God-can-you-believe-it look, Lucy and Peyton didn’t say a word. They both wondered if Christopher would notice when he came back. He and Braxton had been outside discussing security for the resort for more than an hour.\n Peyton was leaving a Post-it note on his desk when he walked in. He didn’t mention Debi or her tardiness but went straight to work, handing Peyton the notes he’d made on his security checklist. Peyton gave him an update on a couple of calls she’d taken and then leaned against the credenza while she went through his notes. The room was quiet as they each attended to the matters at hand. When Peyton finished reading the recommendations, she turned to Christopher to give her approval, but he stopped her. Raising his index finger, he said, “Could that wait just one second?” He then looked through the open door into the outer office and called, “Debi, could you step in here please?”\n The newly decked-out employee took her time responding. She finished reapplying her Pepto-pink lipstick, then put it and her compact mirror back in her handbag before sashaying into his office and taking a seat.\n Christopher wasted no time. “You’re fired,” he announced.\n Debi looked thunderstruck. “Why?” she asked.\n Peyton couldn’t believe she had to ask. Debi looked genuinely astonished. Didn’t she have a clue how incompetent she was? Of course she did, Peyton decided. It was all a game to her. Debi’s next statement proved it.\n “Okay. Then call Uncle Len and tell him you failed, and to buy me a house. He knows which one I want.”\n Christopher leaned back in his chair and studied Debi for a long minute without saying a word. She squirmed under his scrutiny.\n “Well? Call him,” she demanded.\n “There’s been a misunderstanding,” he began. “You agreed to work here for six months and do a good job at whatever task you were given, and then, based on your performance I would decide if you merited a house or not.”\n “You decide?”\n “I was your last chance with your uncle Len. He didn’t want to waste another minute dealing with you and your issues. He’s had enough, and so he asked me to take charge.”\n “Do I get my house or not?”\n “No, you do not.”\n She bolted to her feet, then sat again. She looked panicked. Peyton thought she was beginning to realize Christopher was serious and she couldn’t manipulate him.\n “Oh no, that’s not right. I know what the deal was. I promised Len I would work here for six months and then I’d get my house. I’m doing my part. I’m willing to stay six months. You’re the one breaking the agreement.”\n “You’re doing your part?”\n “Yes,” she stammered. “I’ve been working. I’ve done everything you’ve asked.”\n Christopher was remarkably calm when he asked, “Did you deliver the plans to the landscaper?”\n “Yes, I did,” she answered. “It was muddy, so I left them by the mailbox.”\n “What about the paint decks from Dan Miller?”\n “His secretary said he was out.”\n “You didn’t ask her for them?”\n “I wasn’t exactly there,” she admitted. “I called on the phone while I was . . . busy.”\n “Busy doing what?” Peyton asked. “Getting your hair or your nails done?”\n Debi didn’t answer.\n “And the packages from the post office?” Christopher asked.\n “There was a line, and I didn’t think you’d want me to spend company time standing in a long line,” she said indignantly.\n “But it was okay to spend company time at a spa?” Peyton wondered.\n Debi’s chin came up a notch, but again she refused to answer.\n Christopher shook his head. “I don’t suppose you remembered lunch, either.”\n “They weren’t serving lunch yet.”\n “So, you didn’t order anything,” Christopher concluded.\n “I had a scone and a latte,” she said.\n Christopher didn’t lose his patience, which Peyton thought was admirable. He remained composed as he said, “I’m sorry, but this just isn’t working out. I’ll let Len know. You may leave now.”\n Debi burst into tears. “You can’t fire me. You didn’t give me a chance. This is your fault, not mine. No one showed me how to do anything. I don’t know computers. That’s Peyton’s fault. She set me up to fail.”\n Peyton couldn’t keep quiet. “You said you knew how to use all the programs. Why didn’t you tell us the truth?”\n Tears were pouring down her face now. “I didn’t want you to make fun of me.”\n Peyton rolled her eyes. “We’re not in junior high,” she said.\n “Please, Christopher, give me another chance,” Debi begged. “I’ll really try this time. Just don’t give me stuff to do on a computer until Lucy teaches me how to use it.”\n “Why Lucy?” Christopher asked, curious.\n “Because she’s patient. She’s not a bitch,” she added, pausing to shoot a glare at Peyton. “Lucy can train me.”\n Christopher was swayed, but not by Debi. Lucy was standing in the doorway behind Debi frantically shaking her head at him. He simply couldn’t resist. He got an ornery look in his eyes. “Okay, you get one more chance, and Lucy will train you, but you still answer to me. One more screwup and you’re out.”\n Debi rushed to leave before Christopher changed his mind. She was happy and a bit smug, Peyton thought. Lucy, on the other hand, looked as though she wanted to do bodily harm. Peyton slipped out of the office as her sister stormed past her.\n “Christopher? A word,” Lucy said.\n The door slammed behind her.\n TWENTY-FIVE\n Special Agent John Caulfield was back in Finn’s nightmare. He was helping interview the suspect who had set the fire. Caulfield’s hands were charred, his face was all but gone, but his voice was the same, strong and decisive.\n The nightmare flashed to the scene of the crime, the two-story house. Caulfield was standing on the top step, one hand resting on the doorknob. He was talking to Finn on the phone, telling him he would wait for backup, that he was going to do this by the book, and to hurry and get to the scene so he could observe the arrest. He was certain the suspect was hiding inside.\n He was still talking to Finn when he slowly turned and opened the door. Flames instantly engulfed him, incinerating him, yet he continued to hold his cell phone to his ear and give Finn instructions.\n Until recently the nightmare had begun and ended in the interrogation room. Now, there was a different ending. Peyton was there. She stood just outside Finn’s door waiting for him, and right before he woke up, a sense of calm washed over him.\n Ronan and Finn were early for the lecture. They sat at a table in one of the larger ballrooms of the Adams Hotel on the outskirts of Seattle waiting for the first speaker. The seminar was mandatory, and neither one of them wanted to be there. From the looks on the faces of the other agents filing in, they didn’t want to be there, either.\n “What’s this first lecture about?” Ronan asked, yawning as he emptied a packet of sugar into his coffee cup.\n “New regulations,” Finn replied. “That’s what I heard anyway.”\n “I don’t get it,” Ronan said. “Why did we have to come all the way to Seattle for this? Aren’t they running the same seminars on the East Coast?”\n “Probably,” Finn said. “But we’re not just here for the seminar. We’re being interviewed for hostage rescue.”\n “Did you put in for that?”\n “No. Did you?”\n “No.”\n “Then what the . . . ,” Finn muttered.\n “It’s gotta be for something else. Maybe I’ll call Grayson,” Ronan added, referring to his old partner. “Now that he’s taken the promotion, he’s got some real clout. He could find out what’s going on.” \n","sourceLink":"https://allnovel.net/hotshot-buchanan-renard-11/page-30.html","bookId":1826,"book":{"id":1826,"title":"Hotshot (Buchanan-Renard #11)","description":"Storyline: \n #1 New York Times bestselling author Julie Garwood returns with a novel of family drama, suspense, and—of course—romance. \n Peyton Lockhart and her sisters have inherited Bishop’s Cove, a small, luxurious oceanfront resort, but it comes with a condition: The girls must run the resort for one year and show a profit—only then will they own it. \n A graduate of a prestigious French culinary school, Peyton has just lost her job as a food critic. Out of work and in a bad place personally, a year doing something completely different sounds wonderful. \n There are countless challenges and too many people who want to stop the sisters from succeeding. Among them are Peyton’s contentious cousins, who are outraged that they didn’t inherit the resort, as well as a powerful group of land developers who have been eyeing the coveted beachfront property. \n It’s soon apparent to Peyton that their efforts are being sabotaged, but she refuses to let the threats scare her—until she’s nearly killed. She calls on her childhood friend and protector, Finn MacBain, now with the FBI, and asks for his help. He saved her life once; he can do it again.\n \n","cover":"https://allnovel.net/images/hotshot-buchanan-renard-11.jpg","author":"Julie Garwood","type":"Romance","source":"allnovel","link":"https://allnovel.net/hotshot-buchanan-renard-11.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:27:14 PM"}}
