{"id":88386,"no":6,"title":"Page 6","content":"Thank heaven she’d listened to Mimi and hadn’t rushed to sign a lease. The thought popped into her head and helped her get rid of some of her anger. That was a positive. There was another positive, as well. She hadn’t given in to the urge to punch him when he was panting all over her, so she didn’t have to worry she’d be dragged off to jail for battery. There was no question she was going to quit; however, she found it galling that the reason for her departure wouldn’t be noted in her file or Drew’s. She wished there was a way to prove he was a predator.\n At least Drew was consistent. He stopped by her desk that afternoon to whisper, “I hope you’re thinking about our trip.”\n Peyton didn’t look up from her work.\n She was sitting there contemplating her options when Mimi walked toward her cubicle. Unlike Drew, Mimi could never sneak up on anyone. She was partial to J’adore perfume and doused herself with it at least twice a day. The fragrance announced her approach.\n “So the jackass is already at it again,” Mimi remarked. She was shaking her head and had both hands on her hips. “He just never learns. I should have warned you. I started to a couple of times, but I thought, since you were different, he might go easy on you.”\n “You heard him?” Peyton asked.\n “I was in the hallway just now and saw him come up behind you,” Mimi explained. “I couldn’t hear what he said, but I can guess. Your face looked like it was on fire. I wish I could tell you that it’s going to get better and that he’ll eventually give up and leave you alone, but I don’t think that’s going to happen. He was promoted to this job about a year ago, and he’s already gone through two other trainees. I had a long talk with Sandy this morning. She’s an assistant in Human Resources, and she was in an unusual mood to chat about Drew. Come to find out, like most of the employees she doesn’t much care for him, either,” she added. “Anyway, I found out how you were chosen for the job.”\n Before Peyton could respond, Mimi said, “According to Sandy, you fit all of his requirements and then some. Your photo gave you the edge over the others.”\n Peyton shook her head. “I didn’t send a photo.”\n “Oh, he got hold of one,” Mimi said. “Sandy told me that Drew had a stack of applications. He made her search the Internet for any photos or personal information she could find. All he wanted to look at were the photos of the women. She had to sort through the pile for him. He didn’t want anyone over the age of thirty, and she had to be single. He didn’t even glance at the applications from men. He told Sandy that, since the other food critics were male, he felt it was only fair to hire a female.”\n Mimi glanced around the cavernous office to make sure they were still alone, lowered her voice, and said, “You were the prettiest applicant, and that’s why you were hired. I don’t want to hurt your feelings, but think about it. You weren’t hired for your experience. You just graduated from college and then did some postgraduate work cooking in France for a while. Didn’t you wonder . . .”\n “I was told it was a training program, and I thought working for this magazine would be invaluable.” She didn’t go on. She felt so foolish. “I just jumped at the opportunity.” She thought about the long drive to Dalton and how excited she’d been to get started on her career. Now she felt crushing disappointment. “It’s so unfair.”\n Mimi nodded her agreement, and then as though her own frustration couldn’t be held in any longer, the floodgates opened and she blurted, “You want to talk unfair?” she asked. “I’ve got you beat there. I’m an accountant, a damned good one, too. I’ve been with this company for over seven years, and up until Drew came along, I’ve been happy here. Drew married Eileen three years ago. He was in charge of production then. I didn’t really know him, but I had heard talk that he was a real letch. Apparently, there was trouble with one of the girls working under him. Rumor had it, he blatantly pursued her. I heard he gave her a ride home one night, and she didn’t come back to work for a week afterward. When she finally returned, he treated her so bad, she was forced to quit. I don’t know what happened, but the stories were flying. Eileen made sure everything was hushed up. And then he was promoted.” She added with a nod toward Drew’s office, “He didn’t have the skills for the job, but I guess that wasn’t important to Eileen. She’s the one who pulled the strings to get him in.\n “I was going through a divorce back then. My ex had a girlfriend on the side and thought I should be okay with it. I wasn’t. Anyway,” she continued, sounding as though it was exhausting to talk about it, “since we didn’t have any children and he made more money than I did—even though he did the same job—neither one of us asked for anything from the other. It should have been a quick and easy divorce, right? But he worked here in accounting, too, and he was bitter—”\n “Wait. How could he be bitter? He’s the one who cheated,” she pointed out.\n “Yes, and he still has the girlfriend, but he didn’t want his life to change. He liked my cooking, and he was used to being pampered. Did I mention that he and Drew had become friends? I guess cheaters bond with other cheaters.”\n “What happened?”\n “Don, my ex, told me I was going to get fired. I swear he had a gleam in his eyes, the bastard. God only knows what reasons he and Drew came up with, but I was called into HR and they were both there. I said that was fine, go ahead and fire me—I was going to ask the judge for spousal support. I told Don he was going to support me financially for the rest of my life. I hadn’t signed the divorce papers yet.”\n Peyton laughed. “He must have loved hearing that.”\n “I’ll just say the gleam disappeared from his eyes.” She reached up and patted her short curls. “So I wasn’t fired. I was demoted to an assistant’s position, and my paycheck was cut more than half. Now I fetch coffee for the jackass and keep his calendar for him. I just turned fifty; I’m thirty pounds overweight, and around here accountants are a dime a dozen. No one’s going to look twice at my résumé.” She sighed. “Ready to concede?”\n “Okay, you win,” Peyton said.\n “What did you win, Mimi?” Lars asked as he walked into the cubicle and dropped a stack of files on his desk.\n “My life is more unfair than Peyton’s,” Mimi answered. She looked at her watch. “It’s already after five, and it’s taco night at the Cactus. How come you’re not there?”\n Lars sat down and began to sort the files into piles. “Everyone from the company goes there. It’s difficult to get away from all of them. I don’t feel like I can speak freely. You know?”\n “I know,” Mimi agreed. Turning back to Peyton, she added, “Don’t worry. No matter what you say, Lars and I will hold your confidence. I can’t say the same for anyone else in this office. They’ll all go to HR to tattletale.”\n “When you were demoted, why didn’t you go to Human Resources and lodge a complaint? At the very least, it would have gone on the record.”\n “I did complain, but nothing ever came of it. I’ve been sending my résumé out and so has Lars. Until I can get away from this town, I have to work here. There aren’t any other jobs. Trust me. I’ve looked. And even if there were—like I said—who’s going to consider me?”\n “What about applying for other positions in the company?”\n “No, I’m being punished. The hope is that, if Drew makes my life miserable enough, I’ll quit. I’m stuck.”\n Lars looked up from his task and nodded. “Since Drew took over, it’s been stressful.”\n Peyton leaned back in her chair and crossed one leg over the other. “Did Drew bother the other trainees? Is that why they left?” Even though she knew the answer, she still asked the question.\n “Of course he did. They were young and pretty, but you put them to shame.”\n Mimi’s compliment, given so matter-of-factly, embarrassed Peyton. Her looks shouldn’t have anything to do with her job performance.\n Lars turned in his swivel chair and said, “You’re a stunner. That’s what Mimi means by putting the others to shame.”\n Mimi laughed. “Look at her, Lars. She’s blushing.”\n “Tell her about the last two trainees,” Lars urged.\n Mimi pushed some papers aside and sat on the edge of Peyton’s desk. “I was just getting ready to.” She crossed her arms and began. “The first one was much older than you. Her name was Kayla, and she lasted a good six months.”\n “Eight months,” Lars corrected.\n “I didn’t like her,” Mimi admitted.\n “No one liked her,” Lars interjected.\n “She was full of herself. She didn’t seem to have a problem sleeping with the boss, did she, Lars?”\n “No, she didn’t.”\n “She didn’t try to keep the affair secret. She flaunted it. She was rude and obnoxious to other employees. I think she believed that ha**ng s*x with Drew made her more important in the company.”\n “Did it?” Peyton asked.\n “Not really.”\n “Why did she leave?”\n “She wanted more,” Mimi said. “There was a rumor that she actually fell in love with the jackass. Can you imagine?”\n The disgust in her voice made Peyton laugh. “No, I can’t imagine.”\n “Kayla wanted him to leave his wife and marry her, and of course, he would never do that.”\n Lars explained why. “Drew didn’t have any money when he married Eileen, and if he were to divorce her, he wouldn’t get a dime.”\n “It’s common knowledge he signed a prenup,” Mimi said. “I heard that when Drew told Kayla he wasn’t going to leave his wife, she threw a fit.”\n “That’s not all she threw. I was here. I saw it,” Lars said. “She picked up a computer monitor and threw it into the wall next to Drew’s office door. I think she was aiming for his head. I swear she threw it like it was a baseball.”\n “I wish I had seen it,” Mimi said. “Eileen heard about it and that’s when she got involved.”\n Peyton’s eyes widened. “His wife knew about Kayla?”\n “Of course she did,” Mimi said. “She cleans up all of Drew’s messes. Kayla was given a nice go-away package. I don’t know how much it was, but I do know she had to sign a release of some kind before she got the check.”\n “I’ll bet she had to promise not to talk about what happened,” Lars said. “And promise not to sue.”\n “You’re telling me Eileen is okay with his philandering?” Peyton was flabbergasted.\n “She must be okay with it or she would have kicked him to the curb by now.”\n “What a sick marriage,” Peyton said.\n “You’ve got that right,” Lars agreed.\n “Want to know what happened to the second trainee?” Mimi asked.\n Feeling completely disheartened, she replied, “Sure, why not.”\n “That would be April.”\n “I liked her,” Lars said.\n “Of course you did. She was especially friendly to all the men here,” Mimi said. “I’ve never met a more outrageous flirt, but I think underneath it all she was a nice girl. She put her purse in her desk drawer and—wham bam—Drew was hot on her tail. And I do mean tail. With her tight clothes and big boobs, she was exactly what he’d been looking for. I don’t think she had any idea what she was getting into because after a couple of weeks her attitude changed, and she was running from him. I think she got far more than she’d bargained for. All of a sudden she was hiding from him and doing everything she could think of not to be alone with him. I tried to talk to her once . . . you know . . . just to see if she was okay, but she was tight-lipped and wouldn’t say a word about Drew. The only thing I got out of her was how much she needed this job. I think she was scared.”\n Lars agreed. “That’s the truth of it. I once saw her walking down the hall as he was coming toward her. She did a one-eighty and ducked in the first office she could find. And I noticed she never went into the file room if he was in there. It’s dark and there aren’t any windows. She’d always wait until he left.”\n “Drew ended up firing her,” Mimi said. “She tried to make trouble, didn’t she, Lars?” She apparently didn’t expect an answer because she continued right along. “April went to HR to complain. She accused Drew of sexual harassment, but she was wasting her time,” she added with a nod. “Drew’s wife is best friends with Annette, the head of HR. April’s complaint didn’t go anywhere but the shredder.”\n “No wonder,” Peyton said.\n “Sorry?”\n “I went to HR to file a complaint. Annette wouldn’t let me. She said I had to wait at least three months before I could file any complaints.”\n “That’s nonsense,” Mimi said.\n “Didn’t April intend to sue?” Lars asked.\n “Eileen nipped that in the bud. I don’t know what she threatened, but she and Drew have a guy who will do their dirty work for them when they need it. April packed up and left town in a real hurry.”\n “This is crazy,” Peyton said. “In this day and age Drew shouldn’t be able to get away with his obscene behavior, and neither should his wife. By helping him, Eileen is just as culpable.”\n “We agree with you,” Lars said. “But most of the town depends on this company for their income, and they’ll protect it any way they can. No one wants bad publicity or—God forbid—a lawsuit. Randolph wants a big happy family.”\n “Eileen especially doesn’t want any trouble. She’s on thin ice with her father as it is, and if anyone were to sue Randolph Swift’s beloved magazine because of something his daughter or her randy husband did, Randolph would be mighty upset.”\n “What do you think he would do?” Peyton asked. She picked up a pencil and began to twirl it between her fingers.\n “It’s hard to tell. He hasn’t come to the office for ages, but I’d like to think he’d stay on as CEO until his son, Erik, is ready. I imagine Randolph would show him the ropes and let him run the company. Erik’s smart. He’d do a good job. I’m guessing Randolph would cut Eileen out altogether,” Lars suggested. “Randolph lost his wife a little over a year ago. He was devastated, and that’s when everyone thought he would retire.” \n","sourceLink":"https://allnovel.net/hotshot-buchanan-renard-11/page-6.html","bookId":1826,"book":{"id":1826,"title":"Hotshot (Buchanan-Renard #11)","description":"Storyline: \n #1 New York Times bestselling author Julie Garwood returns with a novel of family drama, suspense, and—of course—romance. \n Peyton Lockhart and her sisters have inherited Bishop’s Cove, a small, luxurious oceanfront resort, but it comes with a condition: The girls must run the resort for one year and show a profit—only then will they own it. \n A graduate of a prestigious French culinary school, Peyton has just lost her job as a food critic. Out of work and in a bad place personally, a year doing something completely different sounds wonderful. \n There are countless challenges and too many people who want to stop the sisters from succeeding. Among them are Peyton’s contentious cousins, who are outraged that they didn’t inherit the resort, as well as a powerful group of land developers who have been eyeing the coveted beachfront property. \n It’s soon apparent to Peyton that their efforts are being sabotaged, but she refuses to let the threats scare her—until she’s nearly killed. She calls on her childhood friend and protector, Finn MacBain, now with the FBI, and asks for his help. He saved her life once; he can do it again.\n \n","cover":"https://allnovel.net/images/hotshot-buchanan-renard-11.jpg","author":"Julie Garwood","type":"Romance","source":"allnovel","link":"https://allnovel.net/hotshot-buchanan-renard-11.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:27:14 PM"}}
