{"id":35371,"no":3,"title":"CHAPTER III. MY COUSIN WILLY.","content":"“Willy’s fair and Willy’s rare, And Willy’s wondrous bonny.” “To Miss Sarsfield, s.s. ‘Alaska,’ Queenstown. From W. Sarsfield. “Awfully sorry I will not be able to meet you. Drive to Foley’s Hotel. Will be waiting you there.” This despatch was put into my hand before I left the steamer at Queenstown. Its genial tone and eccentric grammar were quite in keeping with my ideas of an Irishman. These were at once simple and{28} definite. All Irishmen were genial; most of them were eccentric. In fact, had my uncle and cousin met me on the pier, clad in knee-breeches and tail-coats, and hailed me with what I believed to be the national salutation “Begorra!” I should scarcely have been taken aback. The outside car on which I drove from the Cork station to the hotel was also a realization of preconceived ideas. In response to the bewildering proffers of “Inside or outside?” I had selected an “outside,” and was quite satisfied with the genuineness of the difficulty I found in remaining on it, as we rattled through the muddy streets. The carman himself was perhaps a little disappointing. His replies to my questions were not only devoid of that repartee which I had understood to be the attribute of all Irish carmen, but were lacking in common intelligence; and on{29} his replying for the third time, “Faith, I dunno, miss,” I concluded I must have hit on an unlucky exception. The day had lost none of the brilliancy of the early morning. It seemed to me that the sun shone with a deliberate intention of welcome, and the unfamiliar softness of Irish air was almost intoxicating. Everything was conspiring to put me into the highest spirits, and I only laughed when my new dressing-bag was flung on to the pavement by the dislocating jerk with which the car pulled up in front of Foley’s Hotel. As I walked into the hotel, the porter who had taken in my boxes, went over to a tall young man who was leaning over the bar at the end of the narrow hall, and whispered something to him. He immediately started from his lounging position, and, furtively glancing at the mirror behind the bar, he came up to me.{30} “How do you do? I’m very glad to see you over here,” he said, with an evident effort to assume an easy cousinly manner. “I hope you didn’t mind not meeting me. I was awfully sorry I couldn’t get down to Queenstown, but I had important business in town.” It was perhaps a consciousness of the interested scrutiny of the young lady behind the bar that caused him to blush an ingenuous red as he spoke. “You’d better come on and have some luncheon,” he continued, without giving me time to answer him. “We’ve only got an hour before the train starts.” I followed him into the coffee-room, thinking as I did so how different this well-dressed, rather awkward young man was from the picturesque and vivacious creature I had somehow pictured my Irish cousin to be. His accent, however, was unmistakably that of his native country;{31} or, rather, as I afterwards found, that of his particular part of it. His quick, low way of speaking was at first a little unintelligible to me, and almost gave me the idea that what he said was intended to be of a confidential nature; but on the whole I thought his voice a singularly pleasant one, and listened with interest to its friendly modulations. By the time our luncheon was put on the table he was more at his ease, and had even, with a sheepish, half-deprecating glance from his light grey eyes, addressed me as “Theo.” The almost fraternal familiarity of the head waiter was, on Willy’s explanation that I was his cousin from America, extended in the fullest degree to me. “Indeed, when I seen her coming in the door, I remarked to Miss Foley how greatly the young lady favoured the{32} Sarsfield family,” he observed blandly; “and Miss Foley said she considered she had a great likeness to yourself, captain.” This was a little embarrassing. I did not quite know what I was expected to say, and devoted myself to my mutton-chop. “I did not know that you were a soldier,” I said, as soon as the waiter had gone. “Oh, well,” replied my cousin, giving a conscious twist to his yellow moustache, “I’m only a sort of one—what they call ‘a malicious man.’ I’m a captain in the West Cork Artillery Militia,” he explained; “but nobody calls me that but the buckeens hereabouts.” I wondered silently what a buckeen was, and why it should be so anxious to maintain the prestige of the militia, but did not like to betray too much ignorance of what{33} might be one of the interesting old courtesy titles peculiar to Ireland. Looking at my cousin as he rapidly devoured his luncheon, I noticed that, in spite of his disclaimer of military rank, he took some pains to cultivate a martial appearance. His straw-coloured hair was clipped with merciless precision, and on his sunburnt forehead, what was evidently a cherished triangle of white marked the limit of protection afforded by an artillery forage cap. “I think I’d better be looking after your luggage now,” he said, bolting what remained of his second chop, and getting up from the table with his mouth full. “I was quite frightened when I saw those two big mountains of trunks coming along on the car after you. And then when I saw you walk in”—he laughed a pleasant, {34}foolish laugh—“I didn’t think you’d be such a swell!” he ended, with confiding friendliness. The terminus of the Cork and Moycullen railway, the line by which we were to travel to Durrus, was crowded on that Saturday afternoon. We had ten minutes to spare, during which I sat at the window and watched with the utmost interest the concourse on the platform. It had all the appearance of a large social gathering or conversazione. Stragglers wandered from group to group, showing an equal acquaintance with all, and with apparently entire nonchalance as to the functions of the train, while the guard himself bustled about among them with an interest that was evidently quite unofficial. My carriage soon became thronged with people, between whom and their friends on the platform a constant traffic in brown-paper parcels was carried on; and I was beginning to think{35} there would be no room for Willy, who had disappeared in the crowd. But the ringing of the final bell set my mind at rest. Contrary to the usual usage, this sound had the effect of almost emptying the train, and, the party in my carriage being reduced to two, I realized that the travellers were left in a minority by those who had come to bid them good-bye. Willy returned at the last moment, emerging from the centre of a group of young ladies, with the well-pleased air of one whose conversation has been appreciated. “Did you see those girls I was talking to?” he said, as we moved out of the station. “They are cousins of the O’Neills, people in our part of the world. They came down to see me off. There was a great mob there to-day, but there always is on Saturday.{36}” “Who are the O’Neills?” I asked, feeling that some response was expected of me. “They’re neighbours of ours. They live at Clashmore—that’s four miles from us—and they’re very nice people. Nugent, the brother, used to be a great pal of mine—at least, he was till he went to Cambridge, and came back thinking no one fit to speak to but himself.” Not feeling particularly interested in the O’Neills, I did not pursue the subject; but Willy was full of conversation. “I’m just after buying a grand little mare in Cork. It was that kept me from going to meet you,” he observed confidentially. “I suppose you learnt to ride at your ranch, Theo? I tell you what! I bought her for the governor, but she’d carry you flying, and you shall hunt her this winter if you like.{37}” My cousinly feeling for Willy increased perceptibly at this suggestion. “But,” I said, “if your father buys her, he will want to ride her himself, won’t he?” “Is it the governor?”—with an intonation of contempt. “You never see him on a horse’s back. He’s always humbugging in the house over papers and books. I believe he used to be a great sportsman and fond of society, but he never goes anywhere now.” The two ladies who had started from Cork with us had got out a station or two afterwards, and we had the carriage to ourselves. But the extraordinary jolting and rattling of the train were not conducive to conversation, and, seeing that I was not inclined to talk, Willy relapsed into the collar of his ulster and the Cork newspaper, and ended by going unaffectedly to sleep.{38} It grew slowly darker. I sat watching the endless procession of small fields slipping past the window, until the grey monotony of colour made me dizzy. I leaned back, and, closing my eyes, tried to imagine the life I was going to, and to contrast its probabilities with my past experience. But a strange feeling of remoteness and unreality came upon me. I suppose that the mental exhaustion caused by so many new sights and impressions had dazed me, and I began to doubt that such a person as Theo Sarsfield had ever really existed. Willy, my Uncle Dominick, and my father flitted confusedly through my mind as inconsequently as people in a dream. I myself seemed to have lost touch with the world; my past life had slid away from me, and the future I had not yet grasped. I was a solitary and aimless unit in the dark whirl that{39} surrounded me, and the sleeping figure at the opposite end of the carriage was a trick of imagination, and as unreal as I. I became more and more remote from things actual, and finally fell from all consciousness into a sleep as sound as Willy’s. My slumbers were at length penetrated by a shriek from the engine. I sat up, and saw that Willy was taking down his parcels from the rack; and in another minute we were in the little station of Moycullen. A hat with a cockade appeared at the window. “Hullo, Mick. Is it the dog-cart they’ve sent?” “’Tis the shut carriage, Masther Willy,” said Mick; “and ’tis waiting without in the street.” With some difficulty I followed Mick{40} through the crowd of carts in the station yard, to where a landau and pair were standing in the road. The moonlight was bright enough for me to see the fine shapes of the big brown horses, who were evincing so lively an interest in the movements of the engine that the coachman had plenty to do to keep them quiet. “You’re welcome, miss,” said that functionary, touching his hat; and I got into the carriage, followed by Willy, with the usual number of impedimenta that appear necessary to male travelling youth. “It’s a good long drive,” he said, arranging rugs over our knees—“twelve Irish miles. But we won’t be very long getting there. You won’t have time to be tired of me—I hope not, anyhow.” This was more like my idea of the typical Irishman, but was, nevertheless, rather discomposing from a comparative{41} stranger. It was said, moreover, with a certain conquering air, which plainly showed that Willy was not accustomed to being found a bore. I could think of no very effective reply, so I laughed vaguely, and said I hoped I should not. We had been driving at a good pace for about an hour, when we left the high-road and began the ascent of a long steep hill. At the top the carriage turned a sharp corner, and I saw below me, on my right, a great sheet of water all alight with the misty splendour of a full moon. Black points of land cut their way into the expanse of mellow silver, and the small islands were scattered like blots upon it. “That’s Roaring Water Bay,” said Willy; “and that mountain over there’s called Croagh Keenan”—pointing to a shadowy mass that formed the western limit of the bay. “You haven’t anything{42} to beat that in America, I’ll bet!” An assertion which I refrained from combatting. Our road now lay for a mile or two along the top of a hill overlooking the bay, and though Willy had done his best to make himself agreeable, I was tired enough to be extremely glad when the carriage swung sharply between high gate-posts, and we entered the avenue of Durrus. As we passed the lodge, I caught, in the moonlight, a glimpse of the pretty face of a girl who opened the gates, and asked who she was. “She’s the lodgekeeper’s daughter,” said my cousin. “She looked very pretty.” “Yes, she’s not bad looking,” he said indifferently. “There are plenty of good-looking girls in these parts.” The drive sloped down through a park{43} to the level of a turf bog, which it skirted for some distance, and then entered a thick clump of trees, through which the moonlight only penetrated sufficiently to let me see that they were growing in a species of reedy swamp, from which, on this cold night, a low frosty mist was rising. We were soon out again into the moonlight, the horses quickening up as they came near their journey’s end. I saw a sudden gleam of sea in front, and on the left a long, low house, looking wan and ghostly in the moonlight.","sourceLink":"http://novel.tingroom.com/duanpian/2780/76963.html","bookId":1312,"book":{"id":1312,"title":"An Irish Cousin","description":"简介： There had been several days of thick, murky weatherdull, uncomplaining days that bore their burden of fog and rain in monotonous endurance. Six of such I had lived through; a passive existence, parcelled out to me by the uncomprehended clanging of be...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2780","creation":"Aug 1, 2019 12:24:50 AM","modification":"Aug 1, 2019 12:24:50 AM"}}
