{"id":35404,"no":36,"title":"CHAPTER X. LEX TALIONIS.","content":"“And now Love sang; but his was such a song, So meshed with half-remembrance hard to free.” The tears crept to my eyes, and, standing there unshed, blurred the closely written lines, as I read them, and heard in every sentence Willy’s voice telling me the miserable story. Nugent was still turning over the leaves of the book when I finished the letter. “I can’t make this out,” he said. “It is a diary of your father’s for the year 185—, and the curious thing is that it seems from it that he died at Durrus instead of in Cork.{296}” “Here,” I said helplessly, handing him the letter, “read this, and tell me what it all means.” He put the diary into my hand, but half drew it back again. “You ought not to look at it,” he said. “You’re not fit to stand all this trouble.” “I must see it,” I said agitatedly. “Don’t stop me, Nugent.” He still held my hand, with the book in it. “Listen!” I said in a whisper. “I have something to tell you.” I had been burdened longer than I could bear with the dread of the possible meaning of those strange things that my uncle had said in his delirium, and now by the light of Willy’s letter, all these broken sentences were beginning to shape and group themselves into something that could be understood. I did not wait to think, or to try{297} and arrange coherently what I was going to say, but with a feeling of feverish hurry driving me, I told Nugent everything that I could think of that bore in any way on my father’s death. It was not easy to tell, and towards the end of my story my voice began to fail me. “Never mind, my darling,” he said, putting his arm close round me, “don’t think of it any more.” “I can’t think of anything else,” I said, unclasping his hand from mine, and putting the letter into it. “Read this.” He read it, and, without speaking, took up the diary again. “I believe I understand it all now,” he said. “There is very little in the diary, but there is enough to make it pretty clear what happened. Do you see here; your father got to Cork on the 9th of January, and instead of dying on that day, as is{298} said on the brass in the church, he did not even start for Durrus till the 10th. I will read it to you, and you will understand it for yourself. “‘January 9.—Arrived in Cork. Felt very ill. Wrote to Helen, also to Dominick, telling him to expect me to-morrow. Weather very cold. “‘January 10.—Felt too ill to leave by early train. Came by the six o’clock instead. Got to Carrickbeg at nine p.m. Did not see any one I knew. Got outside car. Very cold night; snow. Arrived Durrus one a.m. Found that my father had died this afternoon. Feel very ill myself. Am in my old room over hall-door. “‘January 11.—Did not get up. Fear I have a touch of pleurisy. Wish Helen were here. D. has only once been in to see me, and there seems to be no one to{299} attend to me. Have asked the woman to light a fire in my room, but she has not done so. D. tells me she is the only servant in the house. He says the property has been nearly ruined in the famine. Must write to Helen to-morrow about coming here.’” This was the last entry in the book, and Nugent had some difficulty in reading it, as the writing was weak and the ink had faded. The pages were rubbed and soiled, and the leaves were dog’s-eared, but none had been torn out, and, considering its age and the ill-usage it had probably received, the book was in very good condition. “You see,” Nugent said, when he had finished reading, “your father certainly survived your grandfather, and it is very easy to see why your uncle was anxious for people to believe the contrary. He knew your mother was a long way off, and{300} that there was no one here to ask any inconvenient questions. The famine had made most people leave the country. I believe my father was the only person who made any trouble about it.” “Yes, yes,” I said excitedly, remembering my meeting with O’Neill on the way home from Rathbarry; “he said something to me about it once. Go on.” “Well,” went on Nugent, with, as I now think, some pride and pleasure in the office of elucidator, “as a matter of fact, your father probably died on the 11th or 12th, and I must say it looks as if there had been some foul play about it. Your uncle’s object was of course to settle things so as to be able to assert that your father had died before your grandfather, and had been buried in Cork. I haven’t a doubt that he and Moll managed to get his body out through that French window, and that{301} then they carried it between them to Poul-na-coppal, and put it in there, where they knew it would never be found or thought of.” “Oh, that explains——” I began; but Nugent was now too interested in what he was saying to stop. “Of course, he may have died naturally, but I am bound to say I don’t think he did. I should say that that old madwoman was quite capable, then, of putting a pillow over a sick man’s face, if she had any reason for doing so——” “Stop!” I cried, interrupting him. “I remember now that I thought she wanted to do that very thing to me, the night she came into my room.” Nugent’s clear exposition broke down. “My darling,” he said, catching me in his arms again, “I don’t know how you ever lived through that awful time, all{302} alone, with no one to stand by you; and to think that if I hadn’t been fool enough to believe that old blackguard——” “Don’t say anything against him,” I said, rather indistinctly, by reason of my face being hidden in the collar of his coat. “It’s all over now, and I shouldn’t mind anything—only for poor Willy. You must write to him. Tell him that nothing would ever induce me to have Durrus, if it was mine fifty times over; tell him that for my sake he must abide by his father’s will, and not waken up a thing that is over now and done with; tell him that I beg of him to come home again——” “I’ll do nothing of the sort,” said Nugent, lifting my face and looking suspiciously into it. “I believe you cared a great deal more about Willy than you ever did for me.” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2780/76996.html","bookId":1312,"book":{"id":1312,"title":"An Irish Cousin","description":"简介： There had been several days of thick, murky weatherdull, uncomplaining days that bore their burden of fog and rain in monotonous endurance. Six of such I had lived through; a passive existence, parcelled out to me by the uncomprehended clanging of be...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2780","creation":"Aug 1, 2019 12:24:50 AM","modification":"Aug 1, 2019 12:24:50 AM"}}
