{"id":96932,"no":25,"title":"Page 25","content":"25\\n\\n \"AUNT QUEEN AND JASMINE DIDN\u0027T LET me down. Whatever Aunt Queen\u0027s misgivings about Mona, she would not hurt Mona\u0027s feelings. When we arrived, Aunt Queen, with open arms, welcomed Mona to the house, and when I announced that this was my future bride Aunt Queen received this information with sublime equanimity.\\n\\n \"Jasmine showed Mona up to Pops\u0027 room, where all her new clothes were waiting for her, and then we went off to my room, where we would really be during this visit, and we had a scrumptious meal at this very table where you and I are sitting.\\n\\n \"I don\u0027t remember what we actually ate. What I remember is that watching Mona eat was a trip, because I was so infatuated with her, and seeing her handle her knife and fork with such quick gestures and talk in an animated way the whole time made me more truly abandoned to her.\\n\\n \"I know what I am saying is crazy. But I was so in love with her. I had never known such feelings before, and for the time being they utterly erased the habitual panic I suffered, and they even took away my reasonable fear of the mysterious stranger, though I should add here that there were still plenty of armed security men around our house, even inside of it, and this did also give me some feeling of safety.\\n\\n \"Of course Aunt Queen wanted to see me alone, but I graciously declined. And when the lunch things were cleared away and Jasmine had polished up the table (and by the way, Jasmine was a stunner in a light navy blue suit and crisp white blouse), I was ready to lock the whole world outside if I could do it.\\n\\n \" \u0027Now you understand,\u0027 Mona explained. \u0027This cousin Pierce whom I\u0027m probably going to marry is utterly boring, I mean this cousin is like a loaf of white bread, he has no paranormal powers whatsoever and he is a lawyer already in the firm of Mayfair and Mayfair, where his father, Ryan, is a partner, and Ryan, my beloved Ryan, he\u0027s a loaf of white bread too, and their life is just a direct line to conformity and security.¡¯\\n\\n \" \u0027Then why the hell do you keep saying you\u0027re going to marry him?\u0027 I asked.\\n\\n \" \u0027Because I love him,\u0027 she said. \u0027I\u0027m not in love, no, I could never feel that way with him, but I know him and he\u0027s beautiful to me -- oh, not beautiful like you, not even tall like you, but beautiful in a calm kind of way, and with Pierce, I hate to say it, but with Pierce I\u0027ll probably be able to do what I want to do. I mean Pierce himself is not intense, and I have enough intensity for three people.¡¯\\n\\n \" \u0027Exactly,\u0027 I said. \u0027So this is a safe marriage.¡¯\\n\\n \" \u0027It\u0027s a Mayfair marriage,\u0027 she returned. \u0027And Mayfairs like me always marry other Mayfairs. Now it\u0027s a cinch that with his background and my background some of our children will be witches --.¡¯\\n\\n \" \u0027There you go with that word again, Mona, what do you mean, \"witches\"? Does the whole family use that word? Does Fr. Kev use it?¡¯\\n\\n \"She laughed the sweetest laugh. \u0027Yeah, the whole family does use it but that\u0027s probably on account of the Talamasca, and Aaron Lightner, a member of the Talamasca whom we all loved. We lost him. He died in a terrible accident. But Stirling is our friend now, and Stirling uses the word. You see, the Talamasca is this organization that for centuries watched our family without us ever knowing it. Well, no, that\u0027s not entirely true. Sometimes our ancestors knew it. But anyway, the Talamasca made what they call the File on the Mayfair Witches, and after we all read that material we had a better understanding of our history, and yeah, we do refer to some of us as witches.¡¯\\n\\n \"I was too intrigued to put another question. She took a big gulp of her caf¨¦ au lait and went on talking.\\n\\n \"(Jasmine had left us a pot of coffee on a small candle warmer and the warm milk in a pitcher and plenty of sugar, and that was a good thing because we kept drinking it and the littleness of the china cups was annoying.)\\n\\n \" \u0027A witch to us is what a witch is to the Talamasca,\u0027 said Mona. \u0027It\u0027s a human being who can see and command spirits. You\u0027re born a witch and Stirling Oliver has the theory that it has its origins in the physical brain, rather like a person\u0027s ability to see fine gradations of color, for instance. But because we can\u0027t study those receptors in the brain, because they can\u0027t be isolated by science, it sounds mysterious.¡¯\\n\\n \" \u0027In other words,\u0027 I said, \u0027Stirling thinks that someday one will be able to diagnose a witch in someone like you or me?¡¯\\n\\n \" \u0027Exactly,\u0027 said Mona, \u0027and Rowan believes this too, and she is carrying out extensive research on this at Mayfair Medical. She has her own lab and she does pretty much what she pleases. I don\u0027t want to make her sound like Dr. Frankenstein. What I mean is the Mayfair legacy is so big that she doesn\u0027t need grant money, and so she doesn\u0027t have to answer to anyone. And she does secret and mysterious research. God only knows all Rowan\u0027s projects. I wish I knew what she was up to.¡¯\\n\\n \" \u0027But what can she do if she can\u0027t cut into actual brain tissue?\u0027 I asked.\\n\\n \"Mona explained all the routine brain tests that could be run, and I explained that I had been through these and no abnormality had been found.\\n\\n \" \u0027I get it,\u0027 she said, \u0027but Rowan is searching with us, she\u0027s searching in ways that aren\u0027t routine.\u0027 Her face suddenly went dark, and she shook her head. \u0027There are other tests, blood tests on those of us who have abnormal genes. Yeah, abnormal genes, that\u0027s how you\u0027d put it. Because you see, some of us do. That\u0027s why my marriage to Pierce will almost certainly happen. He doesn\u0027t have the abnormal genes but I do. So it\u0027s safe for me to marry Pierce. He\u0027s got the clean bill of health. But I wonder sometimes. . . maybe I shouldn\u0027t marry at all.¡¯\\n\\n \" \u0027But I have safe genes, don\u0027t I?\u0027 I insisted. \u0027Why not forget utterly and totally about Pierce and marry me?¡¯\\n\\n \"She stared at me for a long moment.\\n\\n \" \u0027What is it, Mona?\u0027 I asked.\\n\\n \" \u0027Nothing. I was just thinking of what it would be like to be married to you. It doesn\u0027t much matter about the clean bill of health. We\u0027d surely have witch children. But I\u0027m not too certain it would matter. But Quinn, you have to give up on that idea. It\u0027s just not going to happen. Besides, I\u0027m only fifteen years old, Quinn.¡¯\\n\\n \" \u0027Fifteen!\u0027 I was amazed. \u0027Well, I\u0027m eighteen,\u0027 I said. \u0027We\u0027re both precocious. Our children will be geniuses.¡¯\\n\\n \" \u0027Yeah, no doubt of that,\u0027 she said. \u0027And they\u0027d have private teachers like I do now, and they\u0027d travel the world.¡¯\\n\\n \" \u0027We could travel the world with my Aunt Queen,\u0027 I said, \u0027and with Nash, and he would tell us about all the countries we would be visiting.¡¯\\n\\n \"She had the most serene smile. \u0027It would be a dream,\u0027 she said. \u0027I\u0027ve been to Europe -- this last year I went all over with Ryan and Pierce -- Ryan is Pierce\u0027s father. Ryan is the big lawyer in our lives, though we have a whole family firm of them actually. But anyway, what was I saying? Europe. I could go again and again and again.¡¯\\n\\n \" \u0027Oh, think of it, Mona. You have your passport already, and I have mine. We could just steal you away. Aunt Queen\u0027s been pleading with me to go!¡¯\\n\\n \" \u0027Your Aunt Queen would never let you steal me,\u0027 she laughed. \u0027I can see she has a venturesome spirit, but she wouldn\u0027t agree to kidnapping. Besides, the family would just come after me.¡¯\\n\\n \" \u0027Would they really?\u0027 I asked. \u0027But why, Mona? You speak of your family as though it\u0027s a giant prison.¡¯\\n\\n \" \u0027No, Quinn,\u0027 she said, \u0027it\u0027s really like a giant garden, but there are garden walls that separate us from the rest of the world.\u0027 She was getting abysmally sad. \u0027I\u0027m going to cry again and I totally and egregiously hate it.¡¯\\n\\n \" \u0027No, don\u0027t cry,\u0027 I said. I got the box of tissue for her and set it down before her. \u0027I totally can\u0027t bear the thought of you shedding one tear and if you do I\u0027ll swallow it, or I\u0027ll dry your eyes with these. Now tell me why they wouldn\u0027t let you go to Europe. I mean we\u0027d have Aunt Queen as the perfect chaperone.¡¯\\n\\n \" \u0027Quinn, I\u0027m not just an ordinary Mayfair as I told you. I\u0027m not just an ordinary witch. I\u0027m what they call the Design¨¦e of the Legacy. And the Legacy is something that dates back hundreds of years. It\u0027s a great fortune that is inherited by a new woman in each generation.¡¯\\n\\n \" \u0027How big a fortune?¡¯\\n\\n \" \u0027It\u0027s in the billions,\u0027 she replied. \u0027That\u0027s why it could endow Mayfair Medical, and right now the Heiress is Rowan Mayfair. But Rowan can\u0027t have a child and I\u0027ve already been named to succeed Rowan.¡¯\\n\\n \" \u0027I see. They\u0027re grooming you and guarding you for the day when you have to take over.¡¯\\n\\n \" \u0027Precisely,\u0027 she answered. \u0027That\u0027s why they want me to stop acting wild and sleeping with all my cousins. Since we got back from Europe I\u0027ve listened pretty much. I don\u0027t know what it is with me and sex. I just love it. But you get the idea. I have to occupy a position of honor, if that doesn\u0027t sound too egregious. That\u0027s why they wanted me to go to Europe, to be educated and cultured and --.¡¯\\n\\n \"Again her face went dark, and this time the tears came up to stand in her eyes.\\n\\n \" \u0027Mona, tell me,\u0027 I pleaded.\\n\\n \"She shook her head. \u0027Something bad happened to me,\u0027 she said. Her voice was breaking.\\n\\n \"I got up and I led her away from the table. I shoved back the bedclothes and the two of us kicked off our shoes and we climbed in against the nest of down pillows. Never had I loved my fancy bed so much as when I was lying under that baldachin over there with her. And you have to picture that we were fully clothed, except for the fact that when I started kissing her I opened her blouse all the way down, feeling her breasts, but she didn\u0027t mind.\\n\\n \"But then we tapered off, principally because I was so tired, and then I brought her back to the subject.\\n\\n \" \u0027Something bad happened?\u0027 I asked her. \u0027Can you tell me what it was?¡¯\\n\\n \"For a long time she was silent and then she started to cry again.\\n\\n \" \u0027Mona, if anybody hurt you, I\u0027ll hurt them,\u0027 I said. \u0027I mean it. Goblin could even --. Tell me what happened.¡¯\\n\\n \" \u0027I had a child,\u0027 she said in a hoarse whisper.\\n\\n \"I said nothing but I could see that she wanted to go on.\\n\\n \" \u0027I had a child,\u0027 she said, \u0027and it wasn\u0027t what anyone would call a normal child. It was. . . it was different. Very precocious, yes, and perhaps what is best called a mutation. I loved it with my whole soul, it was a beautiful child. But. . . it was taken away.\u0027 She paused, then went on. \u0027It was taken far away, and I just can\u0027t come back from that. I can\u0027t stop thinking about that.¡¯\\n\\n \" \u0027You mean they made you give up your baby! A family that size with all that money.\u0027 I was appalled.\\n\\n \" \u0027No.\u0027 She shook her head. \u0027It wasn\u0027t like that. It wasn\u0027t the family. Let\u0027s just say that the child was taken away, and I don\u0027t know what happened to it. It wasn\u0027t the family\u0027s doing.¡¯\\n\\n \" \u0027The father\u0027s doing?\u0027 I asked.\\n\\n \" \u0027No. I told you this was something terrible. I can\u0027t tell you all of it. I can only say that at any time I might hear about that child.\u0027 She chose her words carefully. \u0027That child might be returned to me. Some news might come, good news or bad news. But for now there\u0027s nothing but silence.¡¯\\n\\n \" \u0027Do you know where the child is?\u0027 I asked. \u0027Mona, I\u0027ll go get the child! I\u0027ll bring it back.¡¯\\n\\n \" \u0027Quinn, you\u0027re so strong, so confident,\u0027 she said. \u0027It\u0027s really totally marvelous just being with you. But no, I don\u0027t know where the child is. I think the child is in England. But I don\u0027t know. And when we were in Europe I was sort of looking for it. There\u0027s no word from the man that took it.¡¯\\n\\n \" \u0027Mona, this is ghastly.¡¯\\n\\n \" \u0027No,\u0027 she said, shaking her head, the teardrops hanging in her lashes, \u0027it\u0027s not the way it sounds. The man was a loving man, and the child -- the child was exceptional.\u0027 Her voice broke. \u0027I didn\u0027t want to give it up, but I had to. It had to go with this loving man, this gentle man that could care for it.¡¯\\n\\n \"I was too perplexed to ask a sensible question.\\n\\n \" \u0027If you have an inkling where this man is, then I\u0027ll go to him.¡¯\\n\\n \"She shook her head. \u0027We used to know how to reach him. Rowan and Michael -- those are my cousins and foster parents now, they knew the man very well. But now we don\u0027t.¡¯\\n\\n \" \u0027Mona, let me protect you in this, let me go after this man and let me go after the baby.¡¯\\n\\n \" \u0027Quinn, my family has tried to do it. They\u0027ve used the resources of the Mayfair Legacy to try to find both the child and the man and they can\u0027t do it. I don\u0027t need your vow that you\u0027ll try. I don\u0027t want you even to think about trying. I only need you to listen to me. I only need your vow that you won\u0027t ever tell another human being what I told you.¡¯\\n\\n \"I kissed her.\\n\\n \" \u0027I understand,\u0027 I said. \u0027We\u0027ll have other children, you and I.¡¯\\n\\n \" \u0027Oh, that would be so lovely,\u0027 she said. \u0027So very lovely.¡¯\\n\\n \"We snuggled down into the covers, taking off each other\u0027s clothes, button by button and zipper by zipper, and then we were naked where I had always slept so chaste with Little Ida or Big Ramona. I felt the bed was being properly christened, and I was happy.\\n\\n \"Then I slept.\\n\\n \"In my dream Rebecca came knocking on the door. It was as if I was awake, but I knew that I wasn\u0027t. And in the dream I told her she had to go away. I told her I had done all that I could do for her. We fought, she and I. We fought at the head of the staircase. She went wild against me, and I forced her down the stairs, telling her she had to leave Blackwood Manor, that she was dead and gone and that she had to accept it.\\n\\n \"She sat down on the last step and began to cry piteously.\\n\\n \" \u0027You can\u0027t come anymore,\u0027 I told her. \u0027The Light\u0027s waiting for you. God\u0027s waiting for you. I believe in the Light.¡¯\\n\\n \"The living room was full of mourners again, and I could hear the cadence of the Rosary rising like a tide, the Hail Mary, Full of Grace, and then I saw Virginia Lee sit up from her coffin again, her hands clasped, and at once she made her graceful ballet step to the floor, her skirts billowing, and she came to snatch up Rebecca, and together they were hurtling through the front door of the house, the two ghosts, Virginia Lee and Rebecca, and I heard Virginia Lee cry out, \u0027You come again to trouble my house, do you? You bring me down from the Light!¡¯\\n\\n \"Rebecca screamed. A life for my life. A death for my death.\\n\\n \"All was silence. I sat on the steps in the dream, wishing I could wake up and be back upstairs in bed where I belonged, but I couldn\u0027t.\\n\\n \"A life for my life, she\u0027d said. Did she want mine? Nothing I\u0027d done had satisfied her. It wasn\u0027t enough.\\n\\n \"Someone tapped me on the shoulder. I looked up. It was Virginia Lee, very lively and pretty, though she wore her funeral blue dress.\\n\\n \" \u0027Get away from this place, Tarquin,\u0027 she said. Her voice had such tender resonance. \u0027Go on, Tarquin, leave this place. There is an evil here. That evil wants you.¡¯\\n\\n \"I woke, sitting up, covered with sweat, staring forward. I saw Goblin in the corner near the computer merely watching me.\\n\\n \"Mona slept soundly beside me.\\n\\n \"I got into the shower and when I saw Goblin\u0027s shadow outside the glass I finished up and dried off and dressed quickly. He stood behind me looking at me in the mirror over my shoulder. His expression was not as mean as it had been before, and I prayed he couldn\u0027t sense my apprehension. He didn\u0027t seem as solid here, even with the moisture in the air, as he had been in New Orleans. I was grateful for that.\\n\\n \" \u0027You love Mona, too?\u0027 I asked as if I meant it.\\n\\n \" \u0027Mona is good. Mona is strong,\u0027 he said. \u0027But Mona will hurt you.¡¯\\n\\n \" \u0027I know,\u0027 I said. \u0027You hurt me when you\u0027re unkind to me, when you say unkind things. We have to love each other.¡¯\\n\\n \" \u0027You want to be with Mona alone,\u0027 he said.\\n\\n \" \u0027Wouldn\u0027t you if you were me?\u0027 I asked. I turned around and faced him.\\n\\n \"I had never seen such a face of trouble on him as I saw then. I had stung him and I was sorry for it.\\n\\n \" \u0027I am you,\u0027 he answered.\" \\n\\n","sourceLink":"https://allnovel.net/blackwood-farm-the-vampire-chronicles-9/page-25.html","bookId":2595,"book":{"id":2595,"title":"Blackwood Farm (The Vampire Chronicles #9)","description":"Storyline: Blackwood Farm (The Vampire Chronicles #9) \\n Lestat is back, saviour and demon, presiding over a gothic story of family greed and hatred through generations, a terrifying drama of blood lust and betrayal, possession and matricide. Blackwood Farm with its grand Southern mansion, set among dark cypress swamps in Louisiana, harbours terrible blood-stained secrets and family ghosts. Heir to them all is Quinn Blackwood, young, rash and beautiful, himself a \u0027bloodhunter\u0027 whom Lestat takes under his wing. But Quinn is in thrall not only to the past and his own appetites but, even more dangerously, to a companion spirit, a \u0027goblin\u0027 succubus who could destroy him and others. Only the unearthly power of Lestat combined with the earthly powers of the Mayfair clan could hope to save Quinn from himself and his ghosts, or to rescue the doomed girl Quinn loves from her own mortality. Shocking, savage and richly erotic, this novel with the deceptively gentle title bring us Anne Rice at her most powerfully disturbing. Here are vampires and witches, men and women, demons and a doppelganger, caught up in a maelstrom of death and destruction, blood and fire, cruelty and fate.\\n","cover":"https://allnovel.net/images/blackwood-farm-the-vampire-chronicles-9.jpg","author":"Anne Rice","type":"Horror","source":"allnovel","link":"https://allnovel.net/blackwood-farm-the-vampire-chronicles-9.html","creation":"Oct 5, 2019 8:58:55 AM","modification":"Oct 5, 2019 6:22:50 PM"}}
