{"id":96946,"no":39,"title":"Page 39","content":"39 \"ALL MY LIFE I\u0027d believed in Heaven and Hell. Did Heaven look down upon this metamorphosis? \"I was a drunk man at the height of his folly, regretting nothing. I lay in the bath, naked, as the dark fluids poured out of me. At last the pain stopped and the streams of fresh water ran pure. The human death was over. \"I looked at the three servants -- the Adonis and the two sharp-featured young girls. They were either horrified or perfectly astonished. \"As I washed in the fresh water, as I scrubbed with the sponge, it was the young Adonis who brought the soap to me, and the towel, and helped me out of the bath and into fresh clothes -- the same fancy garments as the others wore -- black dinner jacket, trousers and white satin turtleneck, so that I would look like my new companions who I was now to join, or so I imagined. \"I felt a sharp unconscionable hunger for the blood of these young servants, born of the very sight of the blood moving under their flesh and the strong smell of it in the air around us. I wasn\u0027t one of them. I wasn\u0027t their brother. They couldn\u0027t feel what I felt. They couldn\u0027t know what I knew. \"Arion\u0027s admonitions came back to me. Evil Doers. I realized I was looking into the eyes of the roughest of the girls, who had most assuredly expected me to be murdered, and as I did so I could see into her mind: I could see her anger, see her bitterness, see her heated temper. And as I stared at her, with the tender Adonis adjusting my clothes, there came from her the nastiest voice. \" \u0027Why you?\u0027 she demanded. \u0027Why you instead of one of us? Who are you that it should be you?¡¯ \" \u0027Hush, no,\u0027 said the boy quickly. \u0027Don\u0027t be so foolish.¡¯ \"The other girl affected a cold, cynical air, but she felt the same sentiment. She felt cheated and angry. Hatred emanated from both women, and I realized it was angering me, and I detested them, detested them that they would have dumped my body this very night with no thought more than that it was a cumbersome task for them. \" \u0027We work, we wait,\u0027 said the brash one, \u0027and then you\u0027re brought here, and she chooses you. Why!¡¯ \" \u0027No, quiet,\u0027 said the boy again. He had finished adjusting my turtleneck and the lapels of my coat. He looked pleadingly into my eyes, wondering, adoring. He seemed to feel some mammoth sympathy for me that I hadn\u0027t died. He seemed to think it marvelous. \" \u0027How many others has she brought here?\u0027 I asked him. \"He had no time to answer. The two doors to the bath were shut with a snap. And before the two girls or the boy could turn around, another two doors were also shut. No exit now remained except the terrace, and I knew the drop that existed beneath it. \"I turned around. I found Petronia against the doors behind me. \" \u0027Very well then,\u0027 she said, \u0027so you\u0027ve finished dying, and you\u0027ll never know it again unless you choose to know it. Now you\u0027ll make another choice. You\u0027ll choose your first kill. And that will be one of these. Be swift about it. I don\u0027t care who it is. No. I do care. I\u0027m curious. Go on!¡¯ \" \u0027The girls gasped and screamed and, reaching for each other, backed up against the marble-tiled wall. The boy merely looked at Petronia and did nothing. He seemed to feel a profound disappointment but never made a sound. \" \u0027I can\u0027t do it,\u0027 I said. \" \u0027You can and you will,\u0027 said Petronia. \u0027Choose one of these or I\u0027ll choose for you. They\u0027re Evil Doers par excellence. They would have hauled you away tonight, a mere carcass to them, had you died.¡¯ \"She came up beside me. Her face softened and she put her arm up over my shoulder and she looked up at me tenderly. She spoke in a gentle voice as the girls still shivered and whimpered in panic and the boy stood his ground, frozen. \" \u0027Quinn, Quinn, my pupil,\u0027 she said in her loving voice, a voice I\u0027d heard before so seldom from her. \u0027I want you to go forth strong and on your own. So take my harsh lessons. Read their minds. Use the Spell Gift to charm. You\u0027re hungry for them. Yes, yes, there, my pupil. Use your gifts and take the scent of their blood as your guiding genius.¡¯ \"I found myself staring at the hard-speaking one. Into her mind I did look. I saw her evil, her casual and vicious disconnect from the human herd, her brittle, cheap egocentricity. And as I drew close to her, her face was smooth, her eyes large and empty, as if I had put out my hand to her and stilled her. Her partner in crime had slunk away and with the boy moved across the room. She was all mine, deserted, enthralled, unprotesting. There was nothing but peace in her now. \" \u0027Devour the evil,\u0027 said Petronia, near to me like my Bad Angel. \u0027Eat it and make it into your clean and everlasting blood.¡¯ \"The girl had gone limp. She tumbled, silky and hot into my arms. Her head went to one side. Her mind was broken like the stem of a thorny rose. I kissed her throat. And then I sank my teeth and I felt her rich delicious blood pour forth, saltier than that of my vampire teachers, somehow more pungent, and there came the wretched story of her life, putrid, common, indecent. I sought the lush taste of the blood only. I sought the rich thick flow of the blood alone. I repudiated the images. I turned my heart away from her heart. I turned my senses only to the thick seasoned blood, and then Petronia was pulling me back, and the girl was lying at my feet, a crumpled corpse with large empty black eyes, such lovely eyes, and blood all over her neck, and Petronia said, \" \u0027You\u0027ve spilt the blood, look at it. Bend down now and catch all of it on your tongue. Clean the wound until nothing remains.¡¯ \"I knelt down and lifted her. I did as I was told. \" \u0027Make a cut in your own tongue,\u0027 said Petronia, \u0027and with a drop of your own blood seal the wound until it disappears.¡¯ \"I was intent as I did this. I watched the tiny punctures vanish, and then the girl, pale-faced and purplish, fell limp to the tiles as I let her go. \"I rose groggily. Again, I was the drunk man. The most common object or surface seemed to pump with life. \"In a daze I reached out for Adonis. I said, \u0027I thank you for your kindnesses to me.\u0027 He was too afraid to answer. He paused, merely staring at me as though I\u0027d forced him to do it, and then I turned away. \"Was I walking out of the bath with Petronia? Were we going up a great staircase? The evening seemed a mist rather than a thing of light. The stars seemed to move in the night sky as we walked along a roofed terrace. I could hear and smell the sea. \"We came into the room where Manfred sat at his chessboard still with Arion, and both of them appeared magnificent to me, infinitely more glorious than the two girls and the boy. \" \u0027And so we have this charged vision,\u0027 I murmured. \u0027We see all things as though they were quietly on fire in all their parts.¡¯ \" \u0027I knew you would understand,\u0027 Petronia responded. \u0027I like your words. Don\u0027t ever be afraid to speak up to me. I watched you for years before I chose you -- you and your spirits. It was language that drew me as truly as beauty.¡¯ \" \u0027I love you,\u0027 I said. \u0027Isn\u0027t that what you wanted?¡¯ \"She laughed a mild helpless laugh. Her warm arm was around my waist, and for the moment her beauty could touch my heart. She even had about her a gentle majesty. I felt that I adored her. \"We went out on the terrace and looked down at the sea. It was a clear green and blue below. I could see this in the dark, see it subtracting its color from the moonlighted sky. And see the stars above moving as if they meant to embrace us. Far away, there came marching down the slope a town of white buildings, so perilously perched it seemed unreal, and beyond, the snowcapped mountain. \" \u0027Want you to love me?\u0027 she repeated my question. \u0027I don\u0027t know,\u0027 she said. \u0027Maybe I wanted you to love me for a while. Maybe I want it still. How do I know what I want? If ever I knew, I might have been content. But why do I tell such lies? Or more to the point, why do I believe them? I wanted you thus from the very first moment I saw you. I marked you for myself. And only for this night or a handful of nights after. And I resolved to leave you strong, I told you so, and so we go back to Arion, and he will leave you hungry again, won\u0027t you? Sweet Master?¡¯ \" \u0027Dare I talk of the things I saw in the blood?\u0027 I asked her. \" \u0027Try me,\u0027 she said in her new kindly manner, \u0027and if I detest what you say, who knows what I will do? Not even I know. What did you see in the blood?¡¯ \" \u0027When you fought in the arena, was it to the death?¡¯ \" \u0027Oh, always,\u0027 she said. \u0027Now weren\u0027t you a student of old Rome? There were countless women gladiators. I was only one of the finest, and always a favorite of the crowd. I was as you know me now, vicious. I stayed alive in those years by viciousness. It was natural. It was expected. And I took to it with a raging simplicity.¡¯ \"She beamed as she looked at me. \" \u0027It was Arion who tamed my heart,\u0027 she went on. \u0027It was Arion who turned me from vicious pursuits, from mockery and meanness into the making of cameos. Oh, you\u0027ve never seen the fine things I made for Arion. Arion gave me rubies and emeralds, and I made whole stories for Arion in shell -- the victories of emperors, the progress of legions. My work was famous throughout the empire. All day I bent over my workbench, dressed carelessly as a boy, my hair tied back with a rawhide string, nothing before me but that work, that all-important work, whatever it might be. Then night would come and so would Arion. Then I became the woman for him. I became something soft, something decent, something fine for Arion.¡¯ \" \u0027What is decent?\u0027 I asked. \" \u0027You know, you\u0027ve always known.¡¯ \" \u0027But what is it now?\u0027 I asked. \u0027I knew what it was before, yes, but now I don\u0027t know what it is. I killed that wretched girl, that murderous girl. That wasn\u0027t decent. Tell me.¡¯ \" \u0027Oh, come now, it\u0027s much too early for such questions. We have hunting to do. Your night\u0027s going to be long. As I told you, I\u0027ll make no mewling fledglings. You\u0027ll be very strong when I\u0027m finished with you.¡¯ \" \u0027Will I be decent?\u0027 I asked. \u0027Will I be honorable?¡¯ \" \u0027See that you are,\u0027 she said. Her face grew sad. \u0027Use your intellect for that,\u0027 she said quietly. \u0027Don\u0027t imitate me. Imitate those who are better than me. Imitate Arion.¡¯ \"We went into the big room again, where Manfred rose to meet us and to look at me and embrace me and to be separated from me only by the loving arms of Arion, whose fine black face utterly charmed me. How lean and caring he seemed, a creature of such miraculous contours and expressiveness. \" \u0027Drain him, Master,\u0027 said Petronia in the tone of a request, and now the Master took me into his arms, and, pressing his teeth to my throat, did as Petronia had requested. \"Again, I felt the images of my life passing with the blood. I felt the sorrow I knew, the untold sorrow of being lost forever from Mona, from my son, Jerome, from Aunt Queen, from Nash, from Jasmine, my beloved milk chocolate Jasmine, from my beloved little Tommy, I felt all of this passing from me with the blood, but not leaving me forever, only revealed, opened like a fierce and terrible wound in me -- You have died, Quinn -- and I felt Arion taking it into himself as if he would relieve me, and a swoon of weakness came over me. \"I awoke seated in a chair, and for a moment the pain was more than I could bear. It was so terrible that it seemed the thing to do was to go to the railing and throw myself down on the rocks there to be smashed and truly dead. But I wondered, and wisely so, would such a thing accomplish death for me? \"Then pure hunger consumed me. I had never hungered so much, and blood was my only desire. I wanted Arion\u0027s blood. I wanted Petronia\u0027s blood. I stared at Manfred, as he peered keenly back at me. \" \u0027And so for our lessons,\u0027 said Arion. He stretched out his arms to me. \u0027Now, come, and to my throat, and take from me the Little Drink, only one fraction of what you want, and spill nothing when you do it. You learn to do the Little Drink, and you can feed from the innocent. You can feed from them gently without biting off a soul. You can leave them only dazed after your kiss.¡¯ \"I went directly to obey. The blood was so thick! And there again, the flash of sunny Athens! It was an agony, but I drew back at the appropriate moment as he had directed me, and with my tongue I lapped the few drops that threatened the whiteness of his satin shirt. He held me until I was steady on my feet, and then, covering my lips with his, he kissed me. He slipped his tongue into my mouth. He forced it up against my fang teeth. The blood came again. I reeled. I danced backwards. \" \u0027What is my life to be now?\u0027 I whispered, after he\u0027d withdrawn. \u0027Ecstasy?¡¯ \" \u0027Ecstasy and control,\u0027 he said to me softly. \u0027Now drink from Manfred in the same way. Call your son to you, Manfred.¡¯ \"The Old Man stretched out his arms. \"I went to him. \" \u0027Come, child of my house, child of my legacy,\u0027 he said in his deep voice. \u0027Beloved child of my heritage. Drink from me the blood. It was Petronia in her wickedness who built Blackwood Manor with her gold, her miserable gold. I give you my love, luckless boy! I give you my blood. Take from me the image of the only pure thing I ever loved!¡¯ \" \u0027Short, and neat,\u0027 said Petronia near to me. \"I sank my teeth in his bull neck, as his large hand held my shoulder. But it was not Virginia Lee whom I saw, it was Rebecca, Rebecca hanging hideously on the rusted hook, and Manfred cursing Petronia as she howled with laughter, and Rebecca too tormented, the dark blood that means death pouring out of her naked torso, the hook deep in her body, deep, run through her very heart for all I knew. \"Suddenly, Rebecca laughed! She stood alone, pointing at me, sneering. Laughing. \" \u0027Good God!\u0027 I shouted. I was pulled back. I staggered. The Old Man had clapped a handkerchief to his neck, and how miserable he looked. Arion had ahold of my shoulders. \" \u0027Aw, such pain,\u0027 said the Old Man. \u0027And why did you reach for her, Quinn, why that shrew? Why reach for such a thing?¡¯ \" \u0027Control, my child,\u0027 said Arion. \u0027Control. So that you can move through a room crowded with mortals, picking the ones you want, giving the fatal kiss and leaving with no one any the wiser.¡¯ \" \u0027But why did I see Rebecca?\u0027 I gasped. \u0027What was the reason?\u0027 I demanded. \u0027You meant for me to see Virginia Lee.¡¯ \" \u0027Aye, but how can I hide the guilt inside my soul?\u0027 asked the Old Man. \u0027You reached for it, you found it, you possess it.¡¯ \"I heard her hissing whisper: And they howl and weep for you on your precious Blackwood Farm. When will they put your name on a gravestone? \" \u0027Get away from me, luckless ghost,\u0027 I said. \u0027So you have in me a life for your life. Leave me.¡¯ \"There came no answer. \"And so my learning went on for hours amongst them. \"They schooled me until I could take the Little Drink, but never was I filled, and they laughed at my hunger when I complained of the pain, and if Petronia became sullen or impatient, Arion shamed her with his kindness. \" \u0027Now we go to hunt, the four of us,\u0027 said Arion. \u0027And you will search out the Evil Doer, using the power to read minds, and we\u0027ll watch over you.¡¯ \" \u0027It\u0027s a wedding,\u0027 said the Old Man in his bass voice. \u0027A rich American come to Napoli for his daughter\u0027s nuptials. You\u0027ll find the Evil Doer everywhere you turn. You lure him, you take him in such a way that no one\u0027s the wiser and from your tongue the drops of your own blood will seal up the wound. Are you ready, son, to be one of us? Truly one of us?¡¯ \" \u0027Picture it before we leave here,\u0027 said Arion. \u0027They\u0027ve been drinking for hours. You want to move amongst them quietly. Anonymously. You want to leave your victims as if they\u0027re drunk. You want to take the Little Drink from the innocents as you desire it.¡¯ \"I nodded. \u0027Yes,\u0027 I declared. I was thirsting. And my heart was inflamed. I wanted with all my wretched soul to be one of them. I was one of them! \"Suddenly, Petronia lifted me and flung me out from her, out beyond the open terrace doors and into the night, and I fell down, down all the way to the beach below, and I landed quietly on the rocks, standing, just on the edge of the foaming green sea, still and quiet, gazing all around me. \"I looked up. How very far away she was, and from the terrace I could scarcely see as she beckoned me. I heard her whisper as though she was near my ear, \u0027Come up to me, Quinn.¡¯ \"I willed my body to rise, and I did rise, and faster and faster I moved until I drifted near her and over the railing of the terrace and then I stood beside her. \"She slipped her arm around me, her dark eyes flashing as she looked up at me, and whispered in my ear. \u0027And so you see,\u0027 she said, \u0027we move by speed, not magic. I have you in my grip. And don\u0027t you spill a drop when you drink. We expect perfection of you.¡¯ \" \u0027But do we kill?\u0027 I asked. \"Arion shrugged. \u0027If you wish,\u0027 he answered. \"If the evil is ripe for it and you are graceful and sly.\u0027 \"","sourceLink":"https://allnovel.net/blackwood-farm-the-vampire-chronicles-9/page-39.html","bookId":2595,"book":{"id":2595,"title":"Blackwood Farm (The Vampire Chronicles #9)","description":"Storyline: Blackwood Farm (The Vampire Chronicles #9) Lestat is back, saviour and demon, presiding over a gothic story of family greed and hatred through generations, a terrifying drama of blood lust and betrayal, possession and matricide. Blackwood Farm with its grand Southern mansion, set among dark cypress swamps in Louisiana, harbours terrible blood-stained secrets and family ghosts. Heir to them all is Quinn Blackwood, young, rash and beautiful, himself a \u0027bloodhunter\u0027 whom Lestat takes under his wing. But Quinn is in thrall not only to the past and his own appetites but, even more dangerously, to a companion spirit, a \u0027goblin\u0027 succubus who could destroy him and others. Only the unearthly power of Lestat combined with the earthly powers of the Mayfair clan could hope to save Quinn from himself and his ghosts, or to rescue the doomed girl Quinn loves from her own mortality. Shocking, savage and richly erotic, this novel with the deceptively gentle title bring us Anne Rice at her most powerfully disturbing. Here are vampires and witches, men and women, demons and a doppelganger, caught up in a maelstrom of death and destruction, blood and fire, cruelty and fate.","cover":"https://allnovel.net/images/blackwood-farm-the-vampire-chronicles-9.jpg","author":"Anne Rice","type":"Horror","source":"allnovel","link":"https://allnovel.net/blackwood-farm-the-vampire-chronicles-9.html","creation":"Oct 5, 2019 8:58:55 AM","modification":"Oct 5, 2019 6:22:50 PM"}}
