{"id":96958,"no":51,"title":"Page 51","content":"51 LESTAT WAS still covered in soot. He didn\u0027t much care about it. We rang the front doorbell of Oak Haven, and it was Stirling himself who answered, in his heavy quilted robe, and perfectly astonished to see the pair of us right there at the Retreat House of the Talamasca -- two wanderers in the night. Of course he invited us into the library and we accepted the invitation, and we settled into the big leather wing chairs that were so comfortably arranged everywhere, and Stirling told the agreeable little housekeeper that we didn\u0027t require anything, and then we were alone. Slowly, in a broken voice, Lestat told Stirling what had happened to Merrick. He described the ceremony and how Merrick had climbed onto the altar, and what he had seen -- the baby come alive, and Goblin descending into it. And then I told Stirling what I had seen -- the Light and the figures moving in the Light. Lestat had not seen this Light but he never doubted me. \"May I put this into our records?\" Stirling asked. He took out his handkerchief and wiped at his nose. He was crying inside for Merrick. And then the tears came and he let them flow for a moment and then he wiped them away. \"That\u0027s why I\u0027m telling you,\" said Lestat. \"So you can close your file on Merrick Mayfair, and know what became of her. So it doesn\u0027t end in silence and confusion, so you don\u0027t mourn for her forever without ever knowing where she wandered or what she became. She was a gentle soul. She preyed upon the Evil Doer only. No innocent blood ever stained her hands. And it was very deliberate what she did. And why she chose this moment I don\u0027t really know.\" \"I think I know,\" I said. \"But I don\u0027t want to be presumptuous. She chose this moment because she wasn\u0027t alone. She had Garwain.\" \"And how do you feel now that he\u0027s gone?\" asked Stirling. \"Free of him,\" I responded, \"and rather shocked by all that\u0027s happened. Shocked that Garwain killed Aunt Queen. You knew he did that, didn\u0027t you? He frightened her and made her fall. Everyone knew it.\" \"Yes,\" Stirling said, \"there was much talk about it at the wake. What will you do now?\" \"I\u0027m shocked that Merrick died,\" I said. \"Merrick freed me of Garwain. Lestat loved Merrick. I loved Merrick. I don\u0027t know what I will do or where I will go. There are people who need me. There have always been people who need me, people who matter to me. I\u0027m enmeshed in human life.\" I thought in silence of the murder of Patsy. I wanted desperately to confess it, but I loathed myself so much for it that I didn\u0027t speak of it at all. \"That\u0027s a good way to put it,\" Lestat said bitterly, \" \u0027enmeshed in human life.\u0027 \" Stirling nodded to this. \"Why don\u0027t you ask me what I\u0027ll do?\" asked Lestat archly, with a raised eyebrow and a wink. \"Would you tell me?\" asked Stirling with a little laugh. \"Of course not,\" said Lestat. \"But I\u0027m in love with Tarquin, you can put that in your file, if you like. That doesn\u0027t mean you can entrap me at Blackwood Manor, and you do remember your promise to me to leave Tarquin alone, don\u0027t you?\" \"Absolutely,\" said Stirling. \"I\u0027m a man who keeps his promises.\" \"I have a question for you,\" I said shyly. \"I\u0027ve talked to Michael Curry and Rowan Mayfair several times in the last few months, but they only put me off with vague answers. They won\u0027t really tell me much about Mona except that she can\u0027t see me, that she\u0027s undergoing a special therapy, that she\u0027s in intensive care. They say she can die from any kind of infection. I can\u0027t even talk to her on the phone --.\" \"She\u0027s dying,\" Stirling said. He sat staring at me. Silence. Then Lestat spoke: \"Why are you telling him this?\" Stirling was still looking at me. \"Because he wants to know,\" Stirling responded. \"Very well,\" said Lestat. \"Come on, Little Brother, let\u0027s hunt. I know of two Evil Doers in Boca Raton who are alone in a magnificent waterfront mansion. It will be such fun, you wouldn\u0027t believe. Good night, Stirling. Good night to the Talamasca. Let\u0027s go.\"","sourceLink":"https://allnovel.net/blackwood-farm-the-vampire-chronicles-9/page-51.html","bookId":2595,"book":{"id":2595,"title":"Blackwood Farm (The Vampire Chronicles #9)","description":"Storyline: Blackwood Farm (The Vampire Chronicles #9) Lestat is back, saviour and demon, presiding over a gothic story of family greed and hatred through generations, a terrifying drama of blood lust and betrayal, possession and matricide. Blackwood Farm with its grand Southern mansion, set among dark cypress swamps in Louisiana, harbours terrible blood-stained secrets and family ghosts. Heir to them all is Quinn Blackwood, young, rash and beautiful, himself a \u0027bloodhunter\u0027 whom Lestat takes under his wing. But Quinn is in thrall not only to the past and his own appetites but, even more dangerously, to a companion spirit, a \u0027goblin\u0027 succubus who could destroy him and others. Only the unearthly power of Lestat combined with the earthly powers of the Mayfair clan could hope to save Quinn from himself and his ghosts, or to rescue the doomed girl Quinn loves from her own mortality. Shocking, savage and richly erotic, this novel with the deceptively gentle title bring us Anne Rice at her most powerfully disturbing. Here are vampires and witches, men and women, demons and a doppelganger, caught up in a maelstrom of death and destruction, blood and fire, cruelty and fate.","cover":"https://allnovel.net/images/blackwood-farm-the-vampire-chronicles-9.jpg","author":"Anne Rice","type":"Horror","source":"allnovel","link":"https://allnovel.net/blackwood-farm-the-vampire-chronicles-9.html","creation":"Oct 5, 2019 8:58:55 AM","modification":"Oct 5, 2019 6:22:50 PM"}}
