{"id":108436,"no":16,"title":"Page 16","content":"When I came to, there was no disorientation. I knew exactly where I was, roughly speaking, and I kept my eyes closed and my breathing even. I tried to learn as much as I could about my exact situation without giving away the fact that I was conscious again.\n I was hungry. My stomach knotted and clenched and made angry noises. I doubted these noises would betray me-I was sure it had gurgled and complained as I slept.\n My head ached fiercely. It was impossible to know how much of this was from fatigue and how much was from the knocks I\u0027d taken.\n I was lying on a hard surface. It was rough and... pocked. It was not flat, but oddly curved, as though I was lying in a shallow bowl. It was not comfortable. My back and hips throbbed from being curled into this position. That pain was probably what had woken me; I felt far from rested.\n It was dark-I could tell that without opening my eyes. Not pitch-black, but very dark.\n The air was even mustier than before-humid and corroded, with a peculiar acrid bite that seemed to cling to the back of my throat. The temperature was cooler than it had been in the desert, but the incongruous moisture made it almost as uncomfortable. I was sweating again, the water Jeb had given me finding its way out through my pores.\n I could hear my breathing echo back to me from a few feet away. It could be that I was only close to one wall, but I guessed that I was in a very small space. I listened as hard as I could, and it sounded like my breathing echoed back from the other side as well.\n Knowing that I was probably still somewhere in the cavern system Jeb had brought me to, I was fairly sure what I would see when I opened my eyes. I must be in some small hole in the rock, dark purple brown and riddled with holes like cheese.\n It was silent except for the sounds my body made. Afraid to open my eyes, I relied on my ears, straining harder and harder against the silence. I couldn\u0027t hear anyone else, and this made no sense. They wouldn\u0027t have left me without a warden, would they? Uncle Jeb and his omnipresent rifle, or someone less sympathetic. To leave me alone... that wouldn\u0027t be in character with their brutality, their natural fear and hatred of what I was.\n Unless...\n I tried to swallow, but terror closed my throat. They wouldn\u0027t leave me alone. Not unless they thought I was dead, or had made sure that I would be. Not unless there were places in these caves that no one came back from.\n The picture I\u0027d been forming of my surroundings shifted dizzyingly in my head. I saw myself now at the bottom of a deep shaft or walled into a cramped tomb. My breathing sped up, tasting the air for staleness, for some sign that my oxygen was running low. The muscles around my lungs pulled outward, filling with air for the scream that was on the way. I clenched my teeth to keep it from escaping.\n Sharp and close, something grated across the ground beside my head.\n I shrieked, and the sound of it was piercing in the small space. My eyes flew open. I jerked away from the sinister noise, throwing myself against a jagged rock wall. My hands swung up to protect my face as my head thunked painfully against the low ceiling.\n A dim light illuminated the perfectly round exit to the tiny bubble of a cave I was curled in. Jared\u0027s face was half lit as he leaned into the opening, one arm reaching toward me. His lips were tight with anger. A vein in his forehead pulsed as he watched my panicked reaction.\n He didn\u0027t move; he just stared furiously while my heart restarted and my breathing evened out. I met his glare, remembering how quiet he had always been-like a wraith when he wanted. No wonder I hadn\u0027t heard him sitting guard outside my cell.\n But I had heard something. As I remembered that, Jared shoved his extended arm closer, and the grating noise repeated. I looked down. At my feet was a broken sheet of plastic serving as a tray. And on it...\n I lunged for the open bottle of water. I was barely aware that Jared\u0027s mouth twisted with disgust as I jerked the bottle to my lips. I was sure that would bother me later, but all I cared about now was the water. I wondered if ever in my life I would take the liquid for granted again. Given that my life was not likely to be prolonged here, the answer was probably no.\n Jared had disappeared, back through the circular entry. I could see a piece of his sleeve and nothing more. The dull light came from somewhere beside him. It was an artificial bluish color.\n I\u0027d gulped half the water down when a new scent caught my attention, informing me that water was not the only gift. I looked down at the tray again.\n Food. They were feeding me?\n It was the bread-a dark, unevenly shaped roll-that I smelled first, but there was also a bowl of some clear liquid with the tang of onions. As I leaned closer, I could see darker chunks on the bottom. Beside this were three stubby white tubes. I guessed they were vegetables, but I didn\u0027t recognize the variety.\n It took only seconds for me to make these discoveries, but even in that short time, my stomach nearly jumped through my mouth trying to reach the food.\n I ripped into the bread. It was very dense, studded with whole-grain kernels that caught in my teeth. The texture was gritty, but the flavor was wonderfully rich. I couldn\u0027t remember anything tasting more delicious to me, not even my mushed-up Twinkies. My jaw worked as fast as it could, but I swallowed most of the mouthfuls of tough bread half-chewed. I could hear each mouthful hit my stomach with a gurgle. It didn\u0027t feel as good as I thought it would. Too long empty, my stomach reacted to the food with discomfort.\n I ignored that and moved on to the liquid-it was soup. This went down easier. Aside from the onions I\u0027d smelled, the taste was mild. The green chunks were soft and spongy. I drank it straight from the bowl and wished the bowl were deeper. I tipped it back to make sure I\u0027d gotten every drop.\n The white vegetables were crunchy in texture, woody in taste. Some kind of root. They weren\u0027t as satisfying as the soup or as tasty as the bread, but I was grateful for their bulk. I wasn\u0027t full-not close-and I probably would have started on the tray next if I thought I\u0027d be able to chew through it.\n It didn\u0027t occur to me until I was finished that they shouldn\u0027t be feeding me. Not unless Jared had lost the confrontation with the doctor. Though why would Jared be my guard if that were the case?\n I slid the tray away when it was empty, cringing at the noise it made. I stayed pressed against the back wall of my bubble as Jared reached in to retrieve it. This time he didn\u0027t look at me.\n \"Thank you,\" I whispered as he disappeared again. He said nothing; there was no change in his face. Even the bit of his sleeve did not show this time, but I was sure he was there.\n I can\u0027t believe he hit me, Melanie mused, her thought incredulous rather than resentful. She was not over the surprise of it yet. I hadn\u0027t been surprised in the first place. Of course he had hit me.\n I wondered where you were, I answered. It would be poor manners to get me into this mess and then abandon me.\n She ignored my sour tone. I wouldn\u0027t have thought he\u0027d be able to do it, no matter what. I don\u0027t think I could hit him.\n Sure you could. If he\u0027d come at you with reflective eyes, you\u0027d have done the same. You\u0027re naturally violent. I remembered her daydreams of strangling the Seeker. That seemed like months ago, though I knew it was only days. It would make sense if it had been longer. It ought to take time to get oneself stuck in such a disastrous mire as the one I was in now.\n Melanie tried to consider it impartially. I don\u0027t think so. Not Jared... and Jamie, there\u0027s no way I could hurt Jamie, even if he was... She trailed off, hating that line of thought.\n I considered this and found it true. Even if the child had become something or someone else, neither she nor I could ever raise a hand to him.\n That\u0027s different. You\u0027re like... a mother. Mothers are irrational here. Too many emotions involved.\n Motherhood is always emotional-even for you souls.\n I didn\u0027t answer that.\n What do you think is going to happen now?\n You\u0027re the expert on humans, I reminded her. It\u0027s probably not a good thing that they\u0027re giving me food. I can think of only one reason they\u0027d want me strong.\n The few specifics I remembered of historical human brutalities tangled in my head with the stories in the old newspaper we\u0027d read the other day. Fire-that was a bad one. Melanie had burned all the fingerprints off her right hand once in a stupid accident, grabbing a pan she hadn\u0027t realized was hot. I remembered how the pain had shocked her-it was so unexpectedly sharp and demanding.\n It was just an accident, though. Quickly treated with ice, salves, medicine. No one had done it on purpose, continued on from the first sickening pain, drawing it out longer and longer...\n I\u0027d never lived on a planet where such atrocities could happen, even before the souls came. This place was truly the highest and the lowest of all worlds-the most beautiful senses, the most exquisite emotions... the most malevolent desires, the darkest deeds. Perhaps it was meant to be so. Perhaps without the lows, the highs could not be reached. Were the souls the exception to that rule? Could they have the light without the darkness of this world?\n I... felt something when he hit you, Melanie interrupted. The words came slowly, one by one, as if she didn\u0027t want to think them.\n I felt something, too. It was amazing how natural it was to use sarcasm now, after spending so much time with Melanie. He\u0027s got quite a backhand, doesn\u0027t he?\n That\u0027s not what I meant. I mean... She hesitated for a long moment, and then the rest of the words came in a rush. I thought it was all me-the way we feel about him. I thought I was... in control of that.\n The thoughts behind her words were clearer than the words themselves.\n You thought you were able to bring me here because you wanted it so much. That you were controlling me instead of the other way around. I tried not to be annoyed. You thought you were manipulating me.\n Yes. The chagrin in her tone was not because I was upset, but because she did not like being wrong. But...\n I waited.\n It came in a rush once more. You\u0027re in love with him, too, separately from me. It feels different from the way I feel. Other. I didn\u0027t see that until he was there with us, until you saw him for the first time. How did that happen? How does a three-inch-long worm fall in love with a human being?\n Worm?\n Sorry. I guess you sort of have... limbs.\n Not really. They\u0027re more like antennae. And I\u0027m quite a bit longer than three inches when they\u0027re extended.\n My point is, he\u0027s not your species.\n My body is human, I told her. While I\u0027m attached to it, I\u0027m human, too. And the way you see Jared in your memories... Well, it\u0027s all your fault.\n She considered that for a moment. She didn\u0027t like it much.\n So if you had gone to Tucson and gotten a new body, you wouldn\u0027t love him anymore now?\n I really, really hope that\u0027s true.\n Neither of us was happy with my answer. I leaned my head against the top of my knees. Melanie changed the subject.\n At least Jamie is safe. I knew Jared would take care of him. If I had to leave him, I couldn\u0027t have left him in better hands... I wish I could see him.\n I\u0027m not asking that! I cringed at the thought of the response that request would receive.\n At the same time, I yearned to see the boy\u0027s face for myself. I wanted to be sure that he was really here, really safe-that they were feeding him and caring for him the way Melanie never could again. The way I, mother to no one, wanted to care for him. Did he have someone to sing to him at night? To tell him stories? Would this new, angry Jared think of little things like that? Did he have someone to curl up against when he was frightened?\n Do you think they will tell him that I\u0027m here? Melanie asked.\n Would that help or hurt him? I asked back.\n Her thought was a whisper. I don\u0027t know... I wish I could tell him that I kept my promise.\n You certainly did. I shook my head, amazed. No one can say that you didn\u0027t come back, just like always.\n Thanks for that. Her voice was faint. I couldn\u0027t tell if she meant for my words now, or if she meant the bigger picture, bringing her here.\n I was suddenly exhausted, and I could feel that she was, too. Now that my stomach had settled a bit and felt almost halfway full, the rest of my pains were not sharp enough to keep me awake. I hesitated before moving, afraid to make any noise, but my body wanted to uncurl and stretch out. I did so as silently as I could, trying to find a piece of the bubble long enough for me. Finally, I had to stick my feet almost out the round opening. I didn\u0027t like doing it, worried that Jared would hear the movement close to him and think I was trying to escape, but he didn\u0027t react in any way. I pillowed the good side of my face against my arm, tried to ignore the way the curve of the floor cramped my spine, and closed my eyes.\n I think I slept, but if I did, it wasn\u0027t deeply. The sound of footsteps was still very far away when I came fully awake.\n This time I opened my eyes at once. Nothing had changed-I still could see the dull blue light through the round hole; I still could not see if Jared was outside it. Someone was coming this way-it was easy to hear that the footsteps were coming closer. I pulled my legs away from the opening, moving as quietly as I could, and curled up against the back wall again. I would have liked to be able to stand; it would have made me feel less vulnerable, more prepared to face whatever was coming. The low ceiling of the cave bubble would barely have allowed me to kneel.\n There was a flash of movement outside my prison. I saw part of Jared\u0027s foot as he rose silently to his feet.\n \"Ah. Here you are,\" a man said. The words were so loud after all the empty silence that I jumped. I recognized the voice. One of the brothers I\u0027d seen in the desert-the one with the machete, Kyle.\n Jared didn\u0027t speak.\n \"We\u0027re not going to allow this, Jared.\" It was a different speaker, a more reasonable voice. Probably the younger brother, Ian. The brothers\u0027 voices were very similar-or they would have been, if Kyle weren\u0027t always half shouting, his tone always twisted with anger. \"We\u0027ve all lost somebody-hell, we\u0027ve all lost everybody. But this is ridiculous.\"\n \"If you won\u0027t let Doc have it, then it\u0027s got to die,\" Kyle added, his voice a growl.\n \"You can\u0027t keep it prisoner here,\" Ian continued. \"Eventually, it will escape and we\u0027ll all be exposed.\"\n Jared didn\u0027t speak, but he took one side step that put him directly in front of the opening to my cell.\n My heart pumped hard and fast as I understood what the brothers were saying. Jared had won. I was not to be tortured. I was not to be killed-not immediately, anyway. Jared was keeping me prisoner.\n It seemed a beautiful word under the circumstances.\n I told you he would protect us.\n \"Don\u0027t make this difficult, Jared,\" said a new male voice I didn\u0027t recognize. \"It has to be done.\"\n Jared said nothing.\n \"We don\u0027t want to hurt you, Jared. We\u0027re all brothers here. But we will if you make us.\" There was no bluff in Kyle\u0027s tone. \"Move aside.\"\n Jared stood rock still.\n My heart started thumping faster than before, jerking against my ribs so hard that the hammering disrupted the rhythm of my lungs, made it difficult to breathe. Melanie was incapacitated with fear, unable to think in coherent words.\n They were going to hurt him. Those lunatic humans were going to attack one of their own.\n \"Jared... please,\" Ian said.\n Jared didn\u0027t answer.\n A heavy footfall-a lunge-and the sound of something heavy hitting something solid. A gasp, a choking gurgle -\n \"No!\" I cried, and launched myself through the round hole. \n","sourceLink":"https://allnovel.net/the-host-the-host-1/page-16.html","bookId":2029,"book":{"id":2029,"title":"The Host (The Host #1)","description":"Storyline: \n The Host is a science fiction/romance novel by Stephenie Meyer. The novel introduces an alien race, called Souls, which takes over the Earth and its inhabitants. The book describes one Soul\u0027s predicament when the mind of its human host refuses to cooperate with her takeover. The Host was released on May 6, 2008 with an initial print run of 750,000 copies. An international version of the novel was released on April 2, 2008 in the United Kingdom, Ireland, Indonesia, the Philippines, Australia, and Hong Kong by the UK publishing division. It was translated into Chinese, Dutch, Swedish, German, Portuguese, Italian, Spanish, Hungarian, Romanian, Serbian, Hebrew and Danish among others. The prologue and the fourth chapter of the book can be found on Meyer\u0027s official website.\n \n","cover":"https://allnovel.net/images/the-host-the-host-1.jpg","author":"Stephenie Meyer","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-host-the-host-1.html","creation":"Oct 5, 2019 8:58:16 AM","modification":"Oct 5, 2019 11:18:50 PM"}}
