{"id":108447,"no":27,"title":"Page 27","content":"Without ever actually agreeing to do it, I became the teacher Jeb wanted.\\n\\n My \"class\" was informal. I answered questions every night after dinner. I found that as long as I was willing to do this, Ian and Doc and Jeb would leave me alone during the day so that I could concentrate on my chores. We always convened in the kitchen; I liked to help with the baking while I spoke. It gave me an excuse to pause before answering a difficult question, and somewhere to look when I didn\u0027t want to meet anyone\u0027s eyes. In my head, it seemed fitting; my words were sometimes upsetting, but my actions were always for their good.\\n\\n I didn\u0027t want to admit that Jamie was right. Obviously, people didn\u0027t like me. They couldn\u0027t; I wasn\u0027t one of them. Jamie liked me, but that was just some strange chemical reaction that was far from rational. Jeb liked me, but Jeb was crazy. The rest of them didn\u0027t have either excuse.\\n\\n No, they didn\u0027t like me. But things changed when I started talking.\\n\\n The first time I noticed it was the morning after I answered Doc\u0027s questions at dinner; I was in the black bathing room, washing clothes with Trudy, Lily, and Jamie.\\n\\n \"Could you hand me the soap, please, Wanda?\" Trudy asked from my left.\\n\\n An electric current ran through my body at the sound of my name spoken by a female voice. Numbly, I passed her the soap and then rinsed the sting off my hand.\\n\\n \"Thank you,\" she added.\\n\\n \"You\u0027re welcome,\" I murmured. My voice cracked on the last syllable.\\n\\n I passed Lily in the hall a day later on my way to find Jamie before dinner.\\n\\n \"Wanda,\" she said, nodding.\\n\\n \"Lily,\" I answered, my throat dry.\\n\\n Soon it wasn\u0027t just Doc and Ian who asked questions at night. It surprised me who the most vocal were: exhausted Walter, his face a worrisome shade of gray, was endlessly interested in the Bats of the Singing World. Heath, usually silent, letting Trudy and Geoffrey talk for him, was outspoken during these evenings. He had some fascination with Fire World, and though it was one of my least favorite stories to tell, he peppered me with questions until he\u0027d heard every detail I knew. Lily was concerned with the mechanics of things-she wanted to know about the ships that carried us from planet to planet, their pilots, their fuel. It was to Lily that I explained the cryotanks-something they had all seen but few understood the purpose of. Shy Wes, usually sitting close to Lily, asked not about other planets but about this one. How did it work? No money, no recompense for work-why did our souls\u0027 society not fall apart? I tried to explain that it was not so different from life in the caves. Did we not all work without money and share in the products of our labor equally?\\n\\n \"Yes,\" he interrupted me, shaking his head. \"But it\u0027s different here-Jeb has a gun for the slackers.\"\\n\\n Everyone looked at Jeb, who winked, and then they all laughed.\\n\\n Jeb was in attendance about every other night. He didn\u0027t participate; he just sat thoughtfully in the back of the room, occasionally grinning.\\n\\n He was right about the entertainment factor; oddly, for we all had legs, the situation reminded me of the See Weeds. There had been a special title for entertainers there, like Comforter or Healer or Seeker. I was one of the Storytellers, so the transition to a teacher here on Earth had not been such a change, profession-wise, at least. It was much the same in the kitchen after dark, with the smell of smoke and baking bread filling the room. Everyone was stuck here, as good as planted. My stories were something new, something to think about besides the usual-the same endlessly repeated sweaty chores, the same thirty-five faces, the same memories of other faces that brought the same grief with them, the same fear and the same despair that had long been familiar companions. And so the kitchen was always full for my casual lessons. Only Sharon and Maggie were conspicuously and consistently absent.\\n\\n I was in about my fourth week as an informal teacher when life in the caves changed again.\\n\\n The kitchen was crowded, as was usual. Jeb and Doc were the only ones missing besides the normal two. On the counter next to me was a metal tray of dark, doughy rolls, swollen to twice the size they\u0027d started at. They were ready for the oven, as soon as the current tray was done. Trudy checked every few minutes to make sure nothing was burning.\\n\\n Often, I tried to get Jamie to talk for me when he knew the story well. I liked to watch the enthusiasm light up his face, and the way he used his hands to draw pictures in the air. Tonight, Heidi wanted to know more about the Dolphins, so I asked Jamie to answer her questions as well as he could.\\n\\n The humans always spoke with sadness when they asked about our newest acquisition. They saw the Dolphins as mirrors of themselves in the first years of the occupation. Heidi\u0027s dark eyes, disconcerting underneath her fringe of white-blond hair, were tight with sympathy as she asked her questions.\\n\\n \"They look more like huge dragonflies than fish, right, Wanda?\" Jamie almost always asked for corroboration, though he never waited for my answer. \"They\u0027re all leathery, though, with three, four, or five sets of wings, depending on how old they are, right? So they kind of fly through the water-it\u0027s lighter than water here, less dense. They have five, seven, or nine legs, depending on which gender they are, right, Wanda? They have three different genders. They have really long hands with tough, strong fingers that can build all kinds of things. They make cities under the water out of hard plants that grow there, kind of like trees but not really. They aren\u0027t as far along as we are, right, Wanda? Because they\u0027ve never made a spaceship or, like, telephones for communication. Humans were more advanced.\"\\n\\n Trudy pulled out the tray of baked rolls, and I bent to shove the next tray of risen dough into the hot, smoking hole. It took a little jostling and balancing to get it in just right.\\n\\n As I sweated in front of the fire, I heard some kind of commotion outside the kitchen, echoing down the hall from somewhere else in the caves. It was hard, with all the random sound reverberations and strange acoustics, to judge distances here.\\n\\n \"Hey!\" Jamie shouted behind me, and I turned just in time to see the back of his head as he sprinted out the door.\\n\\n I straightened out of my crouch and took a step after him, my instinct to follow.\\n\\n \"Wait,\" Ian said. \"He\u0027ll be back. Tell us more about the Dolphins.\"\\n\\n Ian was sitting on the counter beside the oven-a hot seat that I wouldn\u0027t have chosen-which made him close enough to reach out and touch my wrist. My arm flinched away from the unexpected contact, but I stayed where I was.\\n\\n \"What\u0027s going on out there?\" I asked. I could still hear some kind of jabbering-I thought I could hear Jamie\u0027s excited voice in the mix.\\n\\n Ian shrugged. \"Who knows? Maybe Jeb...\" He shrugged again, as if he wasn\u0027t interested enough to bother with figuring it out. Nonchalant, but there was a tension in his eyes I didn\u0027t understand.\\n\\n I was sure I would find out soon enough, so I shrugged, too, and started explaining the incredibly complex familial relationships of the Dolphins while I helped Trudy stack the warm bread in plastic containers.\\n\\n \"Six of the nine... grandparents, so to speak, traditionally stay with the larvae through their first stage of development while the three parents work with their six grandparents on a new wing of the family dwelling for the young to inhabit when they are mobile,\" I was explaining, my eyes on the rolls in my hands rather than my audience, as usual, when I heard the gasp from the back of the room. I continued with my next sentence automatically as I scanned the crowd to see who I\u0027d upset. \"The remaining three grandparents are customarily involved...\"\\n\\n No one was upset with me. Every head was turned in the same direction I was looking. My eyes skipped across the backs of their heads to the dark exit.\\n\\n The first thing I saw was Jamie\u0027s slight figure, clinging to someone\u0027s arm. Someone so dirty, head to toe, that he almost blended right in with the cave wall. Someone too tall to be Jeb, and anyway, there was Jeb just behind Jamie\u0027s shoulder. Even from this distance, I could see that Jeb\u0027s eyes were narrowed and his nose wrinkled, as if he were anxious-a rare emotion for Jeb. Just as I could see that Jamie\u0027s face was bright with sheer joy.\\n\\n \"Here we go,\" Ian muttered beside me, his voice barely audible above the crackle of the flames.\\n\\n The dirty man Jamie was still clinging to took a step forward. One of his hands rose slowly, like an involuntary reflex, and curled into a fist.\\n\\n From the dirty figure came Jared\u0027s voice-flat, perfectly devoid of any inflection. \"What is the meaning of this, Jeb?\"\\n\\n My throat closed. I tried to swallow and found the way blocked. I tried to breathe and was not successful. My heart drummed unevenly.\\n\\n Jared! Melanie\u0027s exultant voice was loud, a silent shriek of elation. She burst into radiant life inside my head. Jared is home!\\n\\n \"Wanda is teaching us all about the universe,\" Jamie babbled eagerly, somehow not catching on to Jared\u0027s fury-he was too excited to pay attention, maybe.\\n\\n \"Wanda?\" Jared repeated in a low voice that was almost a snarl.\\n\\n There were more dirty figures in the hall behind him. I only noticed them when they echoed his snarl with an outraged muttering.\\n\\n A blond head rose from the frozen audience. Paige lurched to her feet. \"Andy!\" she cried, and stumbled through the figures seated around her. One of the dirty men stepped around Jared and caught her as she nearly fell over Wes. \"Oh, Andy!\" she sobbed, the tone of her voice reminding me of Melanie\u0027s.\\n\\n Paige\u0027s outburst changed the atmosphere momentarily. The silent crowd began to murmur, most of them rising to their feet. The sound was one of welcome now, as the majority went to greet the returned travelers. I tried to read the strange expressions on their faces as they forced grins onto their lips and peeked furtively back at me. I realized after a long, slow second-time seemed to be congealing around me, freezing me into place-that the expression I wondered at was guilt.\\n\\n \"It\u0027s going to be okay, Wanda,\" Ian murmured under his breath.\\n\\n I glanced at him wildly, searching for that same guilt on his face. I didn\u0027t find it, only a defensive tightening around his vivid eyes as he stared at the newcomers.\\n\\n \"What the hell, people?\" a new voice boomed.\\n\\n Kyle-easily identifiable by his size despite the grime-was shoving his way around Jared and heading toward... me.\\n\\n \"You\u0027re letting it tell you its lies? Have you all gone crazy? Or did it lead the Seekers here? Are you all parasites now?\"\\n\\n Many heads fell forward, ashamed. Only a few kept their chins stiffly in the air, their shoulders squared: Lily, Trudy, Heath, Wes... and frail Walter, of all people.\\n\\n \"Easy, Kyle,\" Walter said in his feeble voice.\\n\\n Kyle ignored him. He walked with deliberate steps toward me, his eyes, the same vibrant cobalt as his brother\u0027s, glowing with rage. I couldn\u0027t keep my eyes on him, though-they kept returning to Jared\u0027s dark shape, trying to read his camouflaged face.\\n\\n Melanie\u0027s love flowed through me like a lake bursting through a dam, distracting me even more from the enraged barbarian closing the distance quickly.\\n\\n Ian slid into my view, moving to place himself in front of me. I strained my neck to the side to keep my view of Jared clear.\\n\\n \"Things changed while you were gone, brother.\"\\n\\n Kyle halted, face slack with disbelief. \"Did the Seekers come, then, Ian?\"\\n\\n \"She\u0027s not a danger to us.\"\\n\\n Kyle ground his teeth together, and from the corner of my eye, I saw him reach for something in his pocket.\\n\\n This captured my attention at last. I cringed, expecting a weapon. The words stumbled off my tongue in a choked whisper. \"Don\u0027t get in his way, Ian.\"\\n\\n Ian didn\u0027t respond to my plea. I was surprised at the amount of anxiety this caused me, at how much I didn\u0027t want him hurt. It wasn\u0027t the instinctive protection, the bone-deep need to protect, that I felt for Jamie or even Jared. I just knew that Ian should not be harmed trying to protect me.\\n\\n Kyle\u0027s hand came back up, and a light shone out of it. He pointed it at Ian\u0027s face, held it there for a moment. Ian didn\u0027t flinch from the light.\\n\\n \"So, what, then?\" Kyle demanded, putting the flashlight back in his pocket. \"You\u0027re not a parasite. How did it get to you?\"\\n\\n \"Calm down, and we\u0027ll tell you all about it.\"\\n\\n \"No.\"\\n\\n The contradiction did not come from Kyle but from behind him. I watched Jared walk slowly toward us through the silent spectators. As he got closer, Jamie still clinging to his hand with a bewildered expression, I could read his face better under the mask of dirt. Even Melanie, all but delirious with happiness at his safe return, could not misunderstand the expression of loathing there.\\n\\n Jeb had wasted his efforts on the wrong people. It didn\u0027t matter that Trudy or Lily was speaking to me, that Ian would put himself between his brother and me, that Sharon and Maggie made no hostile move toward me. The only one who had to be convinced had now, finally, decided.\\n\\n \"I don\u0027t think anyone needs to calm down,\" Jared said through his teeth. \"Jeb,\" he continued, not looking to see if the old man had followed him forward, \"give me the gun.\"\\n\\n The silence that followed his words was so tense I could feel the pressure inside my ears.\\n\\n From the instant I could clearly see his face, I\u0027d known it was over. I knew what I had to do now; Melanie was in agreement. As quietly as I could, I took a step to the side and slightly back, so that I would be clear of Ian. Then I closed my eyes.\\n\\n \"Don\u0027t happen to have it on me,\" Jeb drawled.\\n\\n I peeked through narrowed eyes as Jared whirled to assess the truth of Jeb\u0027s claim.\\n\\n Jared\u0027s breath whistled angrily through his nostrils. \"Fine,\" he muttered. He took another step toward me. \"It will be slower this way, though. It would be more humane if you were to find that gun fast.\"\\n\\n \"Please, Jared, let\u0027s talk,\" Ian said, planting his feet firmly as he spoke, already knowing the answer.\\n\\n \"I think there\u0027s been too much talk,\" Jared growled. \"Jeb left this up to me, and I\u0027ve made my decision.\"\\n\\n Jeb cleared his throat noisily. Jared spun halfway around to look at him again.\\n\\n \"What?\" he demanded. \"You made the rule, Jeb.\"\\n\\n \"Well, now, that\u0027s true.\"\\n\\n Jared turned back toward me. \"Ian, get out of my way.\"\\n\\n \"Well, well, hold on a sec,\" Jeb went on. \"If you recall, the rule was that whoever the body belonged to got to make the decision.\"\\n\\n A vein in Jared\u0027s forehead pulsed visibly. \"And?\"\\n\\n \"Seems to me like there\u0027s someone here with a claim just as strong as yours. Mebbe stronger.\"\\n\\n Jared stared straight ahead, processing this. After a slow moment, understanding furrowed his brow. He looked down at the boy still hanging on his arm.\\n\\n All the joy had drained from Jamie\u0027s face, leaving it pale and horrorstruck.\\n\\n \"You can\u0027t, Jared,\" he choked. \"You wouldn\u0027t. Wanda\u0027s good. She\u0027s my friend! And Mel! What about Mel? You can\u0027t kill Mel! Please! You have to -\" He broke off, his expression agonized.\\n\\n I closed my eyes again, trying to block the picture of the suffering boy from my mind. It was already almost impossible not to go to him. I locked my muscles in place, promising myself that it wouldn\u0027t help him if I moved now.\\n\\n \"So,\" Jeb said, his tone far too conversational for the moment, \"you can see that Jamie\u0027s not in agreement. I figure he\u0027s got as much say as you do.\"\\n\\n There was no answer for so long that I had to open my eyes again.\\n\\n Jared was staring at Jamie\u0027s anguished, fearful face with his own kind of horror.\\n\\n \"How could you let this happen, Jeb?\" he whispered.\\n\\n \"There is a need for some talk,\" Jeb answered. \"Why don\u0027t you take a breather first, though? Maybe you\u0027ll feel more up to conversation after a bath.\"\\n\\n Jared glared balefully at the old man, his eyes full of the shock and pain of the betrayed. I had only human comparisons for such a look. Caesar and Brutus, Jesus and Judas.\\n\\n The unbearable tension lasted through another long minute, and then Jared shook Jamie\u0027s fingers off his arm.\\n\\n \"Kyle,\" Jared barked, turning and stalking out of the room.\\n\\n Kyle gave his brother a parting grimace and followed.\\n\\n The other dirty members of the expedition went after them silently, Paige tucked securely under Andy\u0027s arm.\\n\\n Most of the other humans, all those who had hung their heads in shame for admitting me into their society, shuffled out behind them. Only Jamie, Jeb, and Ian beside me, and Trudy, Geoffrey, Heath, Lily, Wes, and Walter stayed.\\n\\n No one spoke until the echoes of their footsteps faded away into silence.\\n\\n \"Whew!\" Ian breathed. \"That was close. Nice thinking, Jeb.\"\\n\\n \"Inspiration in desperation. But we\u0027re not out of the woods yet,\" Jeb answered.\\n\\n \"Don\u0027t I know it! You didn\u0027t leave the gun anywhere obvious, did you?\"\\n\\n \"Nope. I figured this might be comin\u0027 on soon.\"\\n\\n \"That\u0027s something, at least.\"\\n\\n Jamie was trembling, alone in the space left by the exodus. Surrounded by those I had to count as friends, I felt able to walk to his side. He threw his arms around my waist, and I patted his back with shaky hands.\\n\\n \"It\u0027s okay,\" I lied in a whisper. \"It\u0027s okay.\" I knew even a fool would hear the false note in my voice, and Jamie was not a fool.\\n\\n \"He won\u0027t hurt you,\" Jamie said thickly, struggling against the tears I could see in his eyes. \"I won\u0027t let him.\"\\n\\n \"Shh,\" I murmured.\\n\\n I was appalled-I could feel that my face was fixed in lines of horror. Jared was right-how could Jeb have let this happen? If they\u0027d killed me the first day here, before Jamie had ever seen me... Or that first week, while Jared kept me isolated from everyone, before Jamie and I had become friends... Or if I had just kept my mouth shut about Melanie... It was too late for all that. My arms tightened around the child.\\n\\n Melanie was just as aghast. My poor baby.\\n\\n I told you it was a bad idea to tell him everything, I reminded her.\\n\\n What will it do to him now, when we die?\\n\\n It\u0027s going to be terrible. He\u0027ll be traumatized and scarred and devastated -\\n\\n Melanie interrupted me. Enough. I know, I know. But what can we do?\\n\\n Not die, I suppose.\\n\\n Melanie and I thought about the likelihood of our survival and felt despair.\\n\\n Ian thumped Jamie on the back-I could feel the motion reverberate through both our bodies.\\n\\n \"Don\u0027t agonize over it, kid,\" he said. \"You\u0027re not in this alone.\"\\n\\n \"They\u0027re just shocked, that\u0027s all.\" I recognized Trudy\u0027s alto voice behind me. \"Once we get a chance to explain, they\u0027ll see reason.\"\\n\\n \"See reason? Kyle?\" someone hissed almost unintelligibly.\\n\\n \"We knew this was coming,\" Jeb muttered. \"Just got to weather it. Storms pass.\"\\n\\n \"Maybe you ought to find that gun,\" Lily suggested calmly. \"Tonight might be a long one. Wanda can stay with Heidi and me -\"\\n\\n \"I think it might be better to keep her somewhere else,\" Ian disagreed. \"Maybe in the southern tunnels? I\u0027ll keep an eye on her. Jeb, wanna lend me a hand?\"\\n\\n \"They wouldn\u0027t look for her with me.\" Walter\u0027s offer was just a whisper.\\n\\n Wes spoke over the last of Walter\u0027s words. \"I\u0027ll tag along with you, Ian. There\u0027re six of them.\"\\n\\n \"No,\" I finally managed to choke out. \"No. That\u0027s not right. You shouldn\u0027t fight with each other. You all belong here. You belong together. Not fighting, not because of me.\"\\n\\n I pulled Jamie\u0027s arms from around my waist, holding his wrists when he tried to stop me.\\n\\n \"I just need a minute to myself,\" I told him, ignoring all the stares I could feel on my face. \"I need to be alone.\" I turned my head to find Jeb. \"And you should have a chance to discuss this without me listening. It\u0027s not fair-having to discuss strategy in front of the enemy.\"\\n\\n \"Now, don\u0027t be like that,\" Jeb said.\\n\\n \"Let me have some time to think, Jeb.\"\\n\\n I stepped away from Jamie, dropping his hands. A hand fell on my shoulder, and I cringed.\\n\\n It was just Ian. \"It\u0027s not a good idea for you to be wandering around by yourself.\"\\n\\n I leaned toward him and tried to pitch my voice so low that Jamie wouldn\u0027t hear me clearly. \"Why prolong the inevitable? Will it get easier or harder for him?\"\\n\\n I thought I knew the answer to my last question. I ducked under Ian\u0027s hand and broke into a run, sprinting for the exit.\\n\\n \"Wanda!\" Jamie called after me.\\n\\n Someone quickly shushed him. There were no footsteps behind me. They must have seen the wisdom of letting me go.\\n\\n The hall was dark and deserted. If I was lucky, I\u0027d be able to cut around the edge of the big garden plaza in the dark with no one the wiser.\\n\\n In all my time here, the one thing I\u0027d never found was the way out. It seemed as if I\u0027d been down every tunnel time and again, and I\u0027d never seen an opening I hadn\u0027t eventually explored in search of one thing or another. I thought about it now as I crept through the deepest shadowed corners of the big cave. Where could the exit be? And I thought about this: if I could figure that puzzle out, would I be able to leave?\\n\\n I couldn\u0027t think of anything worth leaving for-certainly not the desert waiting outside, but also not the Seeker, not the Healer, not my Comforter, not my life before, which had left such a shallow impression on me. Everything that really mattered was with me here. Jamie. Though he would kill me, Jared. I couldn\u0027t imagine walking away from either of them.\\n\\n And Jeb. Ian. I had friends now. Doc, Trudy, Lily, Wes, Walter, Heath. Strange humans who could overlook what I was and see something they didn\u0027t have to kill. Maybe it was just curiosity, but regardless of that, they were willing to side with me against the rest of their tight-knit family of survivors. I shook my head in wonder as I traced the rough rock with my hands.\\n\\n I could hear others in the cavern, on the far side from me. I didn\u0027t pause; they could not see me here, and I\u0027d just found the crevice I was looking for.\\n\\n After all, there was really only one place for me to go. Even if I could somehow have guessed the way to escape, I would still have gone this way. I crept into the blackest darkness imaginable and hurried along my way. \\n\\n","sourceLink":"https://allnovel.net/the-host-the-host-1/page-27.html","bookId":2029,"book":{"id":2029,"title":"The Host (The Host #1)","description":"Storyline: The Host is a science fiction/romance novel by Stephenie Meyer. The novel introduces an alien race, called Souls, which takes over the Earth and its inhabitants. The book describes one Soul\u0027s predicament when the mind of its human host refuses to cooperate with her takeover. The Host was released on May 6, 2008 with an initial print run of 750,000 copies. An international version of the novel was released on April 2, 2008 in the United Kingdom, Ireland, Indonesia, the Philippines, Australia, and Hong Kong by the UK publishing division. It was translated into Chinese, Dutch, Swedish, German, Portuguese, Italian, Spanish, Hungarian, Romanian, Serbian, Hebrew and Danish among others. The prologue and the fourth chapter of the book can be found on Meyer\u0027s official website.\\n","cover":"https://allnovel.net/images/the-host-the-host-1.jpg","author":"Stephenie Meyer","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-host-the-host-1.html","creation":"Oct 5, 2019 8:58:16 AM","modification":"Oct 5, 2019 11:18:50 PM"}}
