{"id":108465,"no":45,"title":"Page 45","content":"\"Wanda...\"\\n\\n \"We don\u0027t have time. I\u0027d do it myself, but I can\u0027t get the angle right. There\u0027s no other way.\"\\n\\n \"I don\u0027t think I can... do it.\"\\n\\n \"For Jamie, even?\" I pushed the good side of my face as hard as I could against the headrest of the passenger seat and closed my eyes.\\n\\n Jared was holding the rough fist-sized stone I\u0027d found. He\u0027d been weighing it in his hand for five minutes.\\n\\n \"You just have to get the first few layers of skin off. Just hide the scar, that\u0027s all. C\u0027mon, Jared, we have to hurry. Jamie...\"\\n\\n Tell him I said to do it now. And make it a good one.\\n\\n \"Mel says do it now. And make sure you do it hard enough. Get it all the first time.\"\\n\\n Silence.\\n\\n \"Do it, Jared!\"\\n\\n He took a deep breath, a gasp. I felt the air move and squeezed my eyes tighter.\\n\\n It made a squishing sound and a thud-that was the first thing I noticed-and then the shock of the blow wore off, and I felt it, too.\\n\\n \"Ungh,\" I groaned. I hadn\u0027t meant to make any sound. I knew that would make it worse for him. But so much was involuntary with this body. Tears sprang up in my eyes, and I coughed to hide a sob. My head rang, vibrated in aftershock.\\n\\n \"Wanda? Mel? I\u0027m sorry!\"\\n\\n His arms wrapped around us, pulled us into his chest.\\n\\n \"\u0027S okay,\" I whimpered. \"We\u0027re okay. Did you get it all?\"\\n\\n His hand touched my chin, turned my head.\\n\\n \"Ahh,\" he gasped, sickened. \"I took half your face off. I\u0027m so sorry.\"\\n\\n \"No, that\u0027s good. That\u0027s good. Let\u0027s go.\"\\n\\n \"Right.\" His voice was still weak, but he leaned me back into my seat, settling me carefully, and then the car rumbled beneath us.\\n\\n Ice-cold air blew in my face, shocking me, stinging my raw cheek. I\u0027d forgotten what air-conditioning felt like.\\n\\n I opened my eyes. We were driving down a smooth wash-smoother than it should have been, carefully altered to be this way. It snaked away from us, coiling around the brush. I couldn\u0027t see very far ahead.\\n\\n I pulled the visor down and flipped open the mirror. In the shadowy moonlight, my face was black and white. Black all across the right side, oozing down my chin, dripping across my neck, and seeping into the collar of my new, clean shirt.\\n\\n My stomach heaved.\\n\\n \"Good job,\" I whispered.\\n\\n \"How much pain are you in?\"\\n\\n \"Not much,\" I lied. \"Anyway, it won\u0027t hurt much longer. How far are we from Tucson?\"\\n\\n Just then, we reached pavement. Funny how the sight of it made my heart race in panic. Jared stopped, keeping the car hidden in the brush. He got out and removed the tarps and chains from the bumper, putting them in the trunk. He got back in and eased the car forward, checking carefully to make sure the highway was empty. He reached for the headlights.\\n\\n \"Wait,\" I whispered. I couldn\u0027t speak louder. I felt so exposed here. \"Let me drive.\"\\n\\n He looked at me.\\n\\n \"It can\u0027t look like I walked to the hospital like this. Too many questions. I have to drive. You hide in the back and tell me where to go. Is there something you can hide under?\"\\n\\n \"Okay,\" he said slowly. He put the car into reverse and pulled it back into the deeper brush. \"Okay. I\u0027ll hide. But if you take us somewhere I don\u0027t tell you to go...\"\\n\\n Oh! Melanie was stung by his doubt, as was I.\\n\\n My voice was flat. \"Shoot me.\"\\n\\n He didn\u0027t answer. He got out, leaving the engine running. I slid across the cup holders into his seat. I heard the trunk slam.\\n\\n Jared climbed into the backseat, a thick plaid blanket under his arm.\\n\\n \"Turn right at the road,\" he said.\\n\\n The car was an automatic, but it had been a long time and I was unsure behind the wheel. I moved ahead carefully, pleased to find that I remembered how to drive. The highway was still empty. I pulled out onto the road, my heart reacting to the open space again.\\n\\n \"Lights,\" Jared said. His voice came from low on the bench.\\n\\n I searched till I found the switch, then flicked them on. They seemed horribly bright.\\n\\n We weren\u0027t far from Tucson -I could see a yellowish glow of color against the sky. The lights of the city ahead.\\n\\n \"You could drive a little faster.\"\\n\\n \"I\u0027m right at the limit,\" I protested.\\n\\n He paused for a second. \"Souls don\u0027t speed?\"\\n\\n I laughed. The sound was only a tad hysterical. \"We obey all laws, traffic laws included.\"\\n\\n The lights became more than a glow-they turned into individual points of brightness. Green signs informed me of my exit options.\\n\\n \" Take Ina Road.\"\\n\\n I followed his instructions. He kept his voice low, though, enclosed as we were, we could both have shouted.\\n\\n It was hard to be in this unfamiliar city. To see houses and apartments and stores with signs lit up. To know I was surrounded, outnumbered. I imagined what it must feel like for Jared. His voice was remarkably calm. But he\u0027d done this before, many times.\\n\\n Other cars were on the road now. When their lights washed my windshield, I cringed in terror.\\n\\n Don\u0027t fall apart now, Wanda. You have to be strong for Jamie. This won\u0027t work if you can\u0027t do that.\\n\\n I can. I can do it.\\n\\n I concentrated on Jamie, and my hands were steadier on the wheel.\\n\\n Jared directed me through the mostly sleeping city. The Healing facility was just a small place. It must have been a medical building once-doctors\u0027 offices, rather than an actual hospital. The lights were bright through most of the windows, through the glass front. I could see a woman behind a greeting desk. She didn\u0027t look up at my headlights. I drove to the darkest corner of the parking lot.\\n\\n I slid my arms through the straps of the backpack. It wasn\u0027t new, but it was in good shape. Perfect. There was just one more thing to do.\\n\\n \"Quick, give me the knife.\"\\n\\n \"Wanda... I know you love Jamie, but I really don\u0027t think you could use it. You\u0027re not a fighter.\"\\n\\n \"Not for them, Jared. I need a wound.\"\\n\\n He gasped. \"You have a wound. That\u0027s enough!\"\\n\\n \"I need one like Jamie\u0027s. I don\u0027t know enough about Healing. I have to see exactly what to do. I would have done it before, but I wasn\u0027t sure I\u0027d be able to drive.\"\\n\\n \"No. Not again.\"\\n\\n \"Give it to me now. Someone will notice if I don\u0027t go inside soon.\"\\n\\n Jared thought it through quickly. He was the best, as Jeb had said, because he could see what had to be done and do it fast. I heard the steely sound of the knife coming out of the sheath.\\n\\n \"Be very careful. Not too deep.\"\\n\\n \"You want to do it?\"\\n\\n He inhaled sharply. \"No.\"\\n\\n \"Okay.\"\\n\\n I took the ugly knife. It had a heavy handle and was very sharp; it came to a tapered point at the tip.\\n\\n I didn\u0027t let myself think about it. I didn\u0027t want to give myself a chance to be a coward. The arm, not the leg-that\u0027s all I paused to decide. My knees were scarred. I didn\u0027t want to have to hide that, too.\\n\\n I held my left arm out; my hand was shaking. I braced it against the door and then twisted my head so that I could bite down on the headrest. I held the knife\u0027s handle awkwardly but tightly in my right hand. I pressed the point against the skin of my forearm so I wouldn\u0027t miss. Then I closed my eyes.\\n\\n Jared was breathing too hard. I had to be fast or he would stop me.\\n\\n Just pretend it\u0027s a shovel opening the ground, I told myself.\\n\\n I jammed the knife into my arm.\\n\\n The headrest muffled my scream, but it was still too loud. The knife fell from my hand-jerking sickeningly out from the muscle-and then clunked against the floor.\\n\\n \"Wanda!\" Jared rasped.\\n\\n I couldn\u0027t answer yet. I tried to choke back the other screams I felt coming. I\u0027d been right not to do this before driving.\\n\\n \"Let me see!\"\\n\\n \"Stay there,\" I gasped. \"Don\u0027t move.\"\\n\\n I heard the blanket rustling behind me despite my warning. I pulled my left arm against my body and yanked the door open with my right hand. Jared\u0027s hand brushed my back as I half fell out the door. It wasn\u0027t a restraint. It was comfort.\\n\\n \"I\u0027ll be right back,\" I coughed out, and then I kicked the door shut behind me.\\n\\n I stumbled across the lot, fighting nausea and panic. They seemed to balance each other out-one keeping the other from taking control of my body. The pain wasn\u0027t too bad-or rather, I couldn\u0027t feel it as much anymore. I was going into shock. Too many kinds of pain, too close together. Hot liquid rolled down my fingers and dripped to the pavement. I wondered if I could move those fingers. I was afraid to try.\\n\\n The woman behind the reception desk-middle-aged, with dark chocolate skin and a few silver threads in her black hair-jumped to her feet when I lurched through the automatic doors.\\n\\n \"Oh, no! Oh, dear!\" She grabbed a microphone, and her next words echoed from the ceiling, magnified. \"Healer Knits! I need you in reception! This is an emergency!\"\\n\\n \"No.\" I tried to speak calmly, but I swayed in place. \"I\u0027m okay. Just an accident.\"\\n\\n She put the microphone down and hurried around to where I stood swaying. Her arm went around my waist.\\n\\n \"Oh, honey, what happened to you?\"\\n\\n \"So careless,\" I muttered. \"I was hiking... I fell down the rocks. I was... cleaning up after dinner. A knife was in my hand...\"\\n\\n My hesitations seemed like part of the shock to her. She didn\u0027t look at me with suspicion-or humor, the way Ian sometimes did when I lied. Only concern.\\n\\n \"You poor dear! What\u0027s your name?\"\\n\\n \"Glass Spires,\" I told her, using the rather generic name of a herd member from my time with the Bears.\\n\\n \"Okay, Glass Spires. Here comes the Healer. You\u0027ll be fine in just a moment.\"\\n\\n I didn\u0027t feel panicked at all anymore. The kindly woman patted my back. So gentle, so caring. She would never harm me.\\n\\n The Healer was a young woman. Her hair, skin, and eyes were all a similar shade of light brown. It made her unusual looking-monochromatic. She wore tan scrubs that only added to that impression.\\n\\n \"Wow,\" she said. \"I\u0027m Healer Knits Fire. I\u0027ll get you fixed up directly. What happened?\"\\n\\n I told my story again as the two women led me down a hallway and then through the very first door. They had me lie down on the paper-covered bed.\\n\\n The room was familiar. I\u0027d been in only one place like this, but Melanie\u0027s childhood was full of such memories. The short row of double cabinets, the sink where the Healer was washing her hands, the bright, clean white walls...\\n\\n \"First things first,\" Knits Fire said cheerfully. She pulled a cabinet open. I tried to focus my eyes, knowing this was important. The cabinet was full of rows and rows of stacked white cylinders. She took one down, reaching for it without searching; she knew what she wanted. The small container had a label, but I couldn\u0027t read it. \"A little no pain should help, don\u0027t you think?\"\\n\\n I saw the label again as she twisted the lid off. Two short words. No Pain? Was that what it said?\\n\\n \"Open your mouth, Glass Spires.\"\\n\\n I obeyed. She took a small, thin square-it looked like tissue paper-and laid it on my tongue. It dissolved at once. There was no flavor. I swallowed automatically.\\n\\n \"Better?\" the Healer asked.\\n\\n And it was. Already. My my head was clear-I could concentrate without difficulty. The pain had melted away with the tiny square. Disappeared. I blinked, shocked.\\n\\n \"Yes.\"\\n\\n \"I know you feel fine now, but please don\u0027t move. Your injuries are not treated yet.\"\\n\\n \"Of course.\"\\n\\n \"Cerulean, could you get us some water? Her mouth seems dry.\"\\n\\n \"At once, Healer Knits.\"\\n\\n The older woman left the room.\\n\\n The Healer turned back to her cabinets, opening a different one this time. This, too, was filled with white containers. \"Here we are.\" She pulled one from the top of a stack, then took another from the other side.\\n\\n Almost as if she were trying to help me fulfill my mission, she listed the names as she reached for them.\\n\\n \"Clean-inside and out... Heal... Seal... And where is... ah, Smooth. Don\u0027t want a scar on that pretty face, do we?\"\\n\\n \"Ah... no.\"\\n\\n \"Don\u0027t worry. You\u0027ll be perfect again.\"\\n\\n \"Thank you.\"\\n\\n \"You\u0027re very welcome.\"\\n\\n She leaned over me with another white cylinder. The top of this one came off with a pop, and there was an aerosol spray nozzle underneath. She sprayed my forearm first, coating the wound with clear, odorless mist.\\n\\n \"Healing must be a fulfilling profession.\" My voice sounded just right. Interested, but not unduly so. \"I haven\u0027t been in a Healing facility since insertion. This is very interesting.\"\\n\\n \"Yes, I like it.\" She started spraying my face.\\n\\n \"What are you doing now?\"\\n\\n She smiled. I guessed that I was not the first curious soul. \"This is Clean. It will make sure nothing foreign stays in the wound. It kills off any of the microbes that might infect the wound.\"\\n\\n \"Clean,\" I repeated to myself.\\n\\n \"And the Inside Clean, just in case anything has snuck into your system. Inhale this, please.\"\\n\\n She had a different white cylinder in her hand, a thinner bottle with a pump rather than an aerosol top. She puffed a cloud of mist into the air above my face. I sucked in a breath. The mist tasted like mint.\\n\\n \"And this is Heal,\" Knits Fire continued, twisting the cap off the next canister, revealing a small pouring spout. \"It encourages your tissues to rejoin, to grow the way they should.\"\\n\\n She dribbled a tiny bit of the clear liquid into the wide cut on my arm, then she pushed the edges of the wound together. I could feel her touch, but there was no pain.\\n\\n \"I\u0027ll seal this up before I move on.\" She opened another container, this one a pliable tube, and then squeezed out a line of thick, clear jelly onto her finger. \"Like glue,\" she told me. \"It holds everything together and lets the Heal do its job.\" She wiped it over my arm in one swift pass. \"Okay, you can move that now. Your arm is fine.\"\\n\\n I held it up to look. A faint pink line was visible under the shiny gel. The blood was still wet on my arm, but there was no source anymore. As I watched, the Healer cleaned my skin with one quick pass of a damp towel.\\n\\n \"Turn your face this way, please. Hmm, you must have hit those rocks just exactly wrong. What a mess.\"\\n\\n \"Yes. It was a bad fall.\"\\n\\n \"Well, thank goodness you were able to drive yourself here.\"\\n\\n She was lightly dripping Heal onto my cheek, smearing it with the tips of her fingers. \"Ah, I love to watch it work. Looks much better already. Okay... around the edges.\" She smiled to herself. \"Maybe one more coat. I want this to be erased.\" She worked for a minute longer. \"Very nice.\"\\n\\n \"Here\u0027s some water,\" the older woman said as she came through the door.\\n\\n \"Thank you, Cerulean.\"\\n\\n \"Let me know if you need anything more. I\u0027ll be up front.\"\\n\\n \"Thanks.\"\\n\\n Cerulean left. I wondered if she was from the Flower Planet. Blue flowers were rare-one might take a name from that.\\n\\n \"You can sit now. How do you feel?\"\\n\\n I pulled myself up. \"Perfect.\" It was true. I hadn\u0027t felt so healthy in a long time. The sharp shift from pain to ease made the sensation more powerful.\\n\\n \"That\u0027s just how it should be. Okay, let\u0027s dust on a little Smooth.\"\\n\\n She twisted the last cylinder\u0027s top and shook an iridescent powder into her hand. She patted it into my cheek, then patted another handful onto my arm.\\n\\n \"You\u0027ll always have a small line on your arm,\" she said apologetically. \"Like your neck. A deep wound...\" She shrugged. Absentmindedly, she brushed the hair back from my neck and examined the scar. \"This was nicely done. Who was your Healer?\"\\n\\n \"Um... Faces Sunward,\" I said, pulling the name from one of my old students. \"I was in... Eureka, Montana. I didn\u0027t like the cold. I moved south.\"\\n\\n So many lies. I felt a twist of anxiety in my stomach.\\n\\n \"I started out in Maine,\" she said, not noticing anything amiss in my voice. As she spoke, she cleaned the blood from my neck. \"It was too cold for me, too. What\u0027s your Calling?\"\\n\\n \"Um... I serve food. In a Mexican restaurant in... Phoenix. I like spicy food.\"\\n\\n \"Me, too.\" She wasn\u0027t looking at me funny. She was wiping my cheek now.\\n\\n \"Very nice. No worries, Glass Spires. Your face looks great.\"\\n\\n \"Thank you, Healer.\"\\n\\n \"Of course. Would you like some water?\"\\n\\n \"Yes, please.\" I kept a grip on myself. It wouldn\u0027t do to bolt the glass down the way I wanted to. I wasn\u0027t able to stop myself from finishing it all, though. It tasted too good.\\n\\n \"Would you like more?\"\\n\\n \"I... yes, that would be nice. Thank you.\"\\n\\n \"I\u0027ll be right back.\"\\n\\n The second she was out the door, I slid off the mattress. The paper crackled, freezing me in place. She didn\u0027t dart back in. I had only seconds. It had taken Cerulean a few minutes to get the water. Maybe it would take the Healer just as long. Maybe the cool, pure water was far away from this room. Maybe.\\n\\n I ripped the pack off my shoulders and wrenched the drawstrings open. I started with the second cabinet. There was the stacked column of Heal. I grabbed the whole column and let it clatter quietly into the bottom of my pack.\\n\\n What would I say if she caught me? What lie could I tell?\\n\\n I took the two kinds of Clean next, from the first cabinet. There was a second stack behind the first of each, and I took half of those, too. Then the No Pain, both stacks of that. I was about to turn back for the Seal, when the label of the next row of cylinders caught my attention.\\n\\n Cool. For fevers? There were no instructions, just the label. I took the stack. Nothing here would hurt a human body. I was sure of that.\\n\\n I grabbed all the Seal and two cans of Smooth. I couldn\u0027t press my luck any further. I closed the cabinets quietly and threw my arms through the straps of the pack. I leaned against the mattress, making another crackle. I tried to look relaxed.\\n\\n She didn\u0027t come back.\\n\\n I checked the clock. It had been one minute. How far away was the water?\\n\\n Two minutes.\\n\\n Three minutes.\\n\\n Had my lies been as obvious to her as they were to me?\\n\\n Sweat started to dew up on my forehead. I wiped it away quickly.\\n\\n What if she brought back a Seeker?\\n\\n I thought of the small pill in my pocket, and my hands shook. I could do it, though. For Jamie.\\n\\n I heard quiet footsteps then, two sets, coming down the hall. \\n\\n","sourceLink":"https://allnovel.net/the-host-the-host-1/page-45.html","bookId":2029,"book":{"id":2029,"title":"The Host (The Host #1)","description":"Storyline: The Host is a science fiction/romance novel by Stephenie Meyer. The novel introduces an alien race, called Souls, which takes over the Earth and its inhabitants. The book describes one Soul\u0027s predicament when the mind of its human host refuses to cooperate with her takeover. The Host was released on May 6, 2008 with an initial print run of 750,000 copies. An international version of the novel was released on April 2, 2008 in the United Kingdom, Ireland, Indonesia, the Philippines, Australia, and Hong Kong by the UK publishing division. It was translated into Chinese, Dutch, Swedish, German, Portuguese, Italian, Spanish, Hungarian, Romanian, Serbian, Hebrew and Danish among others. The prologue and the fourth chapter of the book can be found on Meyer\u0027s official website.\\n","cover":"https://allnovel.net/images/the-host-the-host-1.jpg","author":"Stephenie Meyer","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-host-the-host-1.html","creation":"Oct 5, 2019 8:58:16 AM","modification":"Oct 5, 2019 11:18:50 PM"}}
