{"id":108480,"no":61,"title":"Page 61","content":"I was not the same.\n This was my first rebirth into a body of the same species. I found the transfer much more difficult than changing planets because I had so many expectations about being human already in place. Also, I\u0027d inherited a lot of things from Petals Open to the Moon, and not all of them were pleasant.\n I\u0027d inherited a great deal of grief for Cloud Spinner. I missed the mother I\u0027d never known and mourned for her suffering now. Perhaps there could be no joy on this planet without an equal weight of pain to balance it out on some unknown scale.\n I\u0027d inherited unexpected limitations. I was used to a body that was strong and fast and tall-a body that could run for miles, go without food and water, lift heavy weights, and reach high shelves. This body was weak-and not just physically. This body seized up with crippling shyness every time I was unsure of myself, which seemed to be often these days.\n I\u0027d inherited a different role in the human community. People carried things for me now and let me pass first into a room. They gave me the easiest chores and then, half the time, took the work right out of my hands anyway. Worse than that, I needed the help. My muscles were soft and not used to labor. I tired easily, and my attempts to hide that fooled no one. I probably couldn\u0027t have run a mile without stopping.\n There was more to this easy treatment than just my physical weakness, though. I was used to a pretty face, but one that people were able to look at with fear, mistrust, even hatred. My new face defied such emotions.\n People touched my cheeks often, or put their fingers under my chin, holding my face up to see it better. I was frequently patted on my head (which was in easy reach, since I was shorter than everyone but the children), and my hair was stroked so regularly that I stopped noticing when it happened. Those who had never accepted me before did this as often as my friends. Even Lucina put up only a token resistance when her children began following me like two adoring puppies. Freedom, in particular, crawled onto my lap at every opportunity, burrowing his face in my hair. Isaiah was too big for such displays of affection, but he liked to hold my hand-just the same size as his-while chattering excitedly with me about Spiders and Dragons, soccer and raids. The children still wouldn\u0027t go anywhere near Melanie; their mother had frightened them too thoroughly before for her reassurances to change things now.\n Even Maggie and Sharon, though they still tried not to look at me, could not maintain their former rigidity in my presence.\n My body was not the only change. The monsoons came late to the desert, and I was glad.\n For one thing, I\u0027d never smelled the rain on the creosotes before-I could only vaguely remember it from my memories of Melanie\u0027s memories, a very dim trail of recall indeed-and now the scent washed out the musty caves, left them smelling fresh and almost spicy. The scent clung to my hair and followed me everywhere. I smelled it in my dreams.\n Also, Petals Open to the Moon had lived in Seattle all her life, and the unbroken streak of blue skies and blistering heat was as bewildering-almost numbing-to my system as the dark press of heavy overcast skies would have been to any of these desert dwellers. The clouds were exciting, a change from the bland, featureless pale blue. They had depth and movement. They made pictures in the sky.\n There was a great deal of reshuffling to be done in Jeb\u0027s caves, and the move to the big game room-now the communal sleeping quarters-was good preparation for more permanent arrangements to follow.\n Every space was needed, so rooms could not remain vacant. Still, only the newcomers, Candy-who had remembered her correct name at last-and Lacey, could bear to take Wes\u0027s old space. I pitied Candy for her future roommate, but the Healer never betrayed any discontent at the prospect.\n When the rains ended, Jamie would move into a free corner in Brandt and Aaron\u0027s cave. Melanie and Jared had kicked Jamie out of their room and into Ian\u0027s before I\u0027d been reborn in Pet\u0027s body; Jamie wasn\u0027t so young that they\u0027d needed to give him any excuse.\n Kyle was working on widening the small crevice that had been Walter\u0027s sleeping space so that it would be ready when the desert was dry again. It really wasn\u0027t big enough for more than one, and Kyle would not be staying there alone.\n At night in the game room, Sunny slept curled into a ball against Kyle\u0027s chest, like a kitten who was friends with a big dog-a rottweiler whom she trusted implicitly. Sunny was always with Kyle. I couldn\u0027t remember ever seeing them unattached since I\u0027d opened these silver gray eyes for the first time.\n Kyle seemed constantly bemused, too distracted by this impossible relationship he couldn\u0027t quite wrap his head around to pay attention to much else. He wasn\u0027t giving up on Jodi, but as Sunny clung to him, he held her to his side with gentle hands.\n Before the rain, every space was taken, so I stayed with Doc in the hospital that no longer frightened me. The cots were not comfortable, but it was a very interesting place to be. Candy remembered the details of Summer Song\u0027s life better than her own; the hospital was a place of miracles now.\n After the rain, Doc would not be sleeping in the hospital anymore. The first night in the game room, Sharon had dragged her mattress right next to Doc\u0027s without a word of explanation. Perhaps it was Doc\u0027s fascination with the Healer that motivated Sharon, though I doubted Doc had even noticed how pretty the older woman was; his fascination was with her phenomenal knowledge. Or maybe it was just that Sharon was ready to forgive and forget. I hoped that was the case. It would be nice to think that even Sharon and Maggie might be softened over time.\n I would not stay in the hospital anymore, either.\n The crucial conversation with Ian might never have taken place if not for Jamie. My mouth would go all dry and my palms would sweat whenever I so much as thought of bringing it up. What if those feelings in the hospital, those few perfect moments of certainty right after I\u0027d awoken in this body, had been illusion? What if I remembered them wrong? I knew that nothing had changed for me, but how could I be certain Ian felt the same? The body he\u0027d fallen in love with was still right here!\n I expected him to be unsettled-we all were. If it was difficult for me, a soul used to such changes, how hard must it be for the humans?\n I was working to put the last of the jealousy and the perplexing echoes of the love I still felt for Jared behind me. I didn\u0027t need or want them. Ian was the right partner for me. But sometimes I would catch myself staring at Jared and feel confused. I\u0027d seen Melanie touch Ian\u0027s arm or hand and then jerk away as if she\u0027d suddenly remembered who she was. Even Jared, who had the least reason for uncertainty, would occasionally meet my confused gaze with a searching one of his own. And Ian... Of course it must have been hardest for him. I understood that.\n We were together nearly as much as Kyle and Sunny. Ian constantly touched my face and hair, was always holding my hands. But who did not respond to this body that way? And wasn\u0027t it platonic for everyone else? Why didn\u0027t he kiss me again, the way he had that first day?\n Maybe he could never love me inside this body, as appealing as it seemed to be to all the other humans here.\n That worry was heavy in my heart the night Ian had carried my cot-because it was too heavy for me-to the big, dark game room.\n It was raining for the first time in more than six months. There were both laughter and complaints as people shook out their damp bedding and arranged their places. I saw Sharon with Doc and smiled.\n \"Over here, Wanda,\" Jamie called, waving me toward where he\u0027d just set his mattress next to Ian\u0027s. \"There\u0027s room for all three of us now.\"\n Jamie was the one person who treated me almost exactly the same as before. He did make allowances for my puny physique, but he never seemed surprised to see me enter a room or shocked when Wanderer\u0027s words came through these lips.\n \"You don\u0027t really want that cot, do you, Wanda? I\u0027ll bet we could all fit okay on the mattresses if we shoved them together.\" Jamie grinned at me while he kicked one mattress into the other without waiting for agreement. \"You don\u0027t take up much space.\"\n He took the cot from Ian and set it on its side, out of the way. Then Jamie stretched out on the very edge of the far mattress and turned his back to us.\n \"Oh, hey, Ian,\" he added without turning. \"I talked to Brandt and Aaron, and I think I\u0027m going to move in with them. Well, I\u0027m beat. Night, guys.\"\n I stared at Jamie\u0027s unmoving form for a long moment. Ian was just as motionless. He couldn\u0027t have been having a panic attack, too, though. Was he thinking of some way to extricate himself from the situation?\n \"Lights out,\" Jeb bellowed from across the room. \"Everybody shut yer trap so I can get some shut-eye.\"\n People laughed, but took him seriously as always. One by one, the four lamps were dimmed until the room was black.\n Ian\u0027s hand found mine; it was warm. Did he notice how cold and sweaty my skin was?\n He sank to his knees on the mattress, tugging me gently along. I followed and lay down on the seam between the beds. He kept my hand.\n \"Is this okay?\" Ian whispered. There were other hushed conversations going on around us, made indistinct by the rush of the sulfur spring.\n \"Yes, thank you,\" I answered.\n Jamie rolled over, shaking the mattress and knocking into me. \"Oops, sorry, Wanda,\" he murmured, and then I heard him yawn.\n Automatically, I shifted out of his way. Ian was closer than I\u0027d thought. I gasped quietly when I ran into him, then tried to give him some room. His arm was suddenly around me, holding me to his body.\n It was the strangest feeling; having Ian\u0027s arm around me in this very nonplatonic way reminded me oddly of my first experience with No Pain. Like I\u0027d been in agony without realizing it, and his touch had taken all the hurt away.\n That feeling erased my shyness. I rolled so that I was facing him, and he tightened his arm around me.\n \"Is this okay?\" I whispered, repeating his question.\n He kissed my forehead. \"Better than okay.\"\n We were silent for a few minutes. Most of the other conversations had died out.\n He bent down so that his lips were at my ear and whispered, quieter than before, \"Wanda, do you think...?\" He fell silent.\n \"Yes?\"\n \"Well, it looks like I have a room all to myself now. That\u0027s not right.\"\n \"No. There\u0027s not enough space for you to be alone.\"\n \"I don\u0027t want to be alone. But...\"\n Why wouldn\u0027t he ask? \"But what?\"\n \"Have you had enough time to sort things out yet? I don\u0027t want to rush you. I know it\u0027s confusing... with Jared...\"\n It took me a moment to process what he was saying, but then I giggled quietly. Melanie wasn\u0027t much given to giggling, but Pet had been, and her body betrayed me at this most inopportune moment.\n \"What?\" he demanded.\n \"I was giving you time to sort things out,\" I explained in a whisper. \"I didn\u0027t want to rush you-because I know it\u0027s confusing. With Melanie.\"\n He jumped just a little in surprise. \"You thought...? But Melanie isn\u0027t you. I was never confused.\"\n I was smiling in the dark now. \"And Jared isn\u0027t you.\"\n His voice was tighter when he answered. \"But he\u0027s still Jared. And you love him.\"\n Ian was jealous again? I shouldn\u0027t have been pleased by negative emotions, but I had to admit this was encouraging.\n \"Jared is my past, another life. You are my present.\"\n He was quiet for a moment. When he spoke again, his voice was rough with emotion. \"And your future, if you want that.\"\n \"Yes, please.\"\n And then he kissed me in the most unplatonic way possible under the crowded circumstances, and I was thrilled to remember that I\u0027d been smart enough to lie about my age.\n The rains would end, and when they did, Ian and I would be together, partners in the truest sense. This was a promise and an obligation I had never had in all my lives. Thinking of it made me feel joyful and anxious and shy and desperately impatient all at the same time-made me feel human.\n After all this had been settled, Ian and I were more inseparable than ever. So when it came time for me to test my new face on the other souls, of course he went with me.\n This raid was a relief for me after long weeks of frustration. It was bad enough that my new body was weak and nearly useless in the caves; I couldn\u0027t believe it when the others didn\u0027t want to let me use my body for the one thing it was perfect for.\n Jared had specifically approved of Jamie\u0027s choice because of this guileless, vulnerable face that no one could ever doubt, this delicate build that anyone would be motivated to protect, but even he had a hard time putting his theory into practice. I was sure raiding would be every bit as easy for me now as it had been before, but Jared, Jeb, Ian, and the others-everyone but Jamie and Mel-debated for days, trying to find a way around using me for that. It was ridiculous.\n I saw them eyeing Sunny, but she was still unproven, not trusted. On top of that, Sunny had absolutely no intention of setting one foot outside. The very word raid had her cowering in terror. Kyle would not go out with us; Sunny had gone hysterical the one time he\u0027d mentioned it.\n In the end, practicality had won out. I was needed.\n It was good to be needed.\n Supplies had been dwindling; this would be a long, thorough trip. Jared was leading the raid, as usual, so it went without saying that Melanie was included. Aaron and Brandt volunteered, not that we really needed the muscle; they were tired of being cooped up.\n We were going far to the north, and I was excited to see the new places-to feel the cold again.\n Excitement got a bit out of hand in this body. I was bouncy and hyper the night we drove to the rock slide where the van and the big moving truck were hidden. Ian was laughing at me because I could hardly hold still as we loaded the clothes and sundries we would need into the van. He held my hand, he said, to tether me to the surface of the planet.\n Was I too loud? Too oblivious to my surroundings? No, of course that was not it. There was nothing I could have done. This was a trap, and it was too late for us the minute we arrived.\n We froze when the thin beams of light shot out of the darkness into Jared\u0027s and Melanie\u0027s faces. My face, my eyes, the ones that might have helped us, stayed obscured, hidden in the shadow made by Ian\u0027s wide back.\n My eyes were not blinded by the glare, and the moon was bright enough for me to clearly see the Seekers that outnumbered us, eight to our six. Bright enough for me to see the way they held their hands, to see the weapons that glinted in them, raised and pointed at us. Pointed at Jared and Mel, at Brandt and Aaron-our only gun still undrawn-and one centered dead on Ian\u0027s chest.\n Why had I let him come with me? Why did he have to die, too? Lily\u0027s bewildered questions echoed in my head: Why did life and love go on? What was the point?\n My fragile little heart shattered into a million pieces, and I fumbled for the pill in my pocket.\n \"Steady, now, everybody just keep calm,\" the man in the center of the group of Seekers called out. \"Wait, wait, don\u0027t be swallowing anything! Jeez, get a grip! No, look!\"\n The man turned the flashlight on his own face.\n His face was sun browned and craggy, like a rock that had been eroded by the wind. His hair was dark, with white at the temples, and it curled in a bushy mess around his ears. And his eyes-his eyes were dark brown. Just dark brown, nothing more.\n \"See?\" he said. \"Okay, now, you don\u0027t shoot us, and we won\u0027t shoot you. See?\" And he laid the gun he was carrying to the ground. \"C\u0027mon, guys,\" he said, and the others slid their guns back into holsters-on their hips, their ankles, their backs... so many weapons.\n \"We found your cache here-clever, that; we were lucky to find it-and decided we\u0027d hang out and make your acquaintance. It\u0027s not every day you find another rebel cell.\" He laughed a delighted laugh that came from deep in his belly. \"Look at your faces! What? Did you think you all were the only ones still kickin\u0027?\" He laughed again.\n None of us had moved an inch.\n \"Think they\u0027re in shock, Nate,\" another man said.\n \"We scared them half to death,\" a woman said. \"What do you expect?\"\n They waited, shuffling from foot to foot, while we stood frozen.\n Jared was the first to recover. \"Who are you?\" he whispered.\n The leader laughed again. \"I\u0027m Nate-nice to meet you, though you might not feel the same way just yet. This here\u0027s Rob, Evan, Blake, Tom, Kim, and Rachel along with me.\" He gestured around the group as he spoke, and the humans nodded at their names. I noticed one man, a little to the back, whom Nate did not introduce. He had bright, crinkly ginger hair that stood out-especially because he was the tallest in the group. He alone seemed to be unarmed. He was also staring intently at me, so I looked away. \"There\u0027s twenty-two of us altogether, though,\" Nate continued.\n Nate held out his hand.\n Jared took a deep breath and then a step forward. When he moved, the rest of our little group silently exhaled all at once.\n \"I\u0027m Jared.\" He shook Nate\u0027s hand, then started to smile. \"This is Melanie, Aaron, Brandt, Ian, and Wanda. There are thirty-seven of us altogether.\"\n When Jared spoke my name, Ian shifted his weight, trying to obscure me completely from the other humans\u0027 view. It was only then that I realized I was still in just as much danger as the others would have been in if these had been Seekers. Just like in the beginning. I tried to hold perfectly still.\n Nate blinked at Jared\u0027s revelation, and then his eyes widened. \"Wow. That\u0027s the first time I\u0027ve ever been one-upped on that one.\"\n Now Jared blinked. \"You\u0027ve found others?\"\n \"There are three other cells separate from ours that we know of. Eleven with Gail, seven with Russell, and eighteen with Max. We keep in touch. Even trade now and then.\" Again, the belly laugh. \"Gail\u0027s little Ellen decided she wanted to keep company with my Evan here, and Carlos took up with Russell\u0027s Cindy. And, of course, everyone needs Burns now and then -\" He stopped talking abruptly, glancing uneasily around him, as if he\u0027d said something he shouldn\u0027t have. His eyes rested briefly on the tall redhead in the back, who was still staring at me.\n \"Might as well get that out of the way,\" the small dark man at Nate\u0027s elbow said.\n Nate shot a suspicious glance across our little line. \"Okay. Rob\u0027s right. Let\u0027s get this out there.\" He took a deep breath. \"Now, you all just take it easy and hear us out. Calmly, please. This upsets people sometimes.\"\n \"Every time,\" the one named Rob muttered. His hand drifted to the holster on his thigh.\n \"What?\" Jared asked in a flat voice.\n Nate sighed and then gestured to the tall man with the ginger red hair. The man stepped forward, a wry smile on his face. He had freckles, like me, only thousands more. They were scattered so thick across his face that he looked dark skinned, though he was fair. His eyes were dark-navy blue, maybe.\n \"This here is Burns. Now, he\u0027s with us, so don\u0027t go crazy. He\u0027s my best friend-saved my life a hundred times. He\u0027s one of our family, and we don\u0027t take kindly to it when people try to kill him.\"\n One of the women slowly pulled her gun out and held it pointed at the ground.\n The redhead spoke for the first time in a distinctly gentle tenor voice. \"No, it\u0027s okay, Nate. See? They\u0027ve got one of their own.\" He pointed straight at me, and Ian tensed. \"Looks like I\u0027m not the only one who\u0027s gone native.\"\n Burns grinned at me, then crossed the empty space, the no-man\u0027s-land between the two tribes, with his hand stretched out toward me.\n I stepped out from around Ian, ignoring his muttered warning, abruptly comfortable and sure.\n I liked the way Burns had phrased it. Gone native.\n Burns stopped in front of me, lowering his hand a bit to compensate for the considerable difference in our heights. I took his hand-it was hard and callused next to my delicate skin-and shook it.\n \"Burns Living Flowers,\" he introduced himself.\n My eyes widened at his name. Fire World-how unexpected.\n \"Wanderer,\" I told him.\n \"It\u0027s... extraordinary to meet you, Wanderer. And here I thought I was one of a kind.\"\n \"Not even close,\" I said, thinking of Sunny back in the caves. Perhaps we were none of us as rare as we thought.\n He raised an eyebrow at my answer, intrigued.\n \"Is that so?\" he said. \"Well, maybe there\u0027s some hope for this planet, after all.\"\n \"It\u0027s a strange world,\" I murmured, more to myself than to the other native soul.\n \"The strangest,\" he agreed.\n \n","sourceLink":"https://allnovel.net/the-host-the-host-1/page-61.html","bookId":2029,"book":{"id":2029,"title":"The Host (The Host #1)","description":"Storyline: \n The Host is a science fiction/romance novel by Stephenie Meyer. The novel introduces an alien race, called Souls, which takes over the Earth and its inhabitants. The book describes one Soul\u0027s predicament when the mind of its human host refuses to cooperate with her takeover. The Host was released on May 6, 2008 with an initial print run of 750,000 copies. An international version of the novel was released on April 2, 2008 in the United Kingdom, Ireland, Indonesia, the Philippines, Australia, and Hong Kong by the UK publishing division. It was translated into Chinese, Dutch, Swedish, German, Portuguese, Italian, Spanish, Hungarian, Romanian, Serbian, Hebrew and Danish among others. The prologue and the fourth chapter of the book can be found on Meyer\u0027s official website.\n \n","cover":"https://allnovel.net/images/the-host-the-host-1.jpg","author":"Stephenie Meyer","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-host-the-host-1.html","creation":"Oct 5, 2019 8:58:16 AM","modification":"Oct 5, 2019 11:18:50 PM"}}
