{"id":108429,"no":8,"title":"Page 8","content":"Yes, Faces Sunward?\" I asked, grateful to the raised hand for interrupting my lecture. I did not feel as comfortable behind the lectern as I usually did. My biggest strength, my only real credential-for my host body had had little in the way of a formal education, on the run since her early adolescence-was the personal experience I usually taught from. This was the first world\u0027s history I\u0027d presented this semester for which I had no memories to draw upon. I was sure my students were suffering the difference.\n \"I\u0027m sorry to interrupt, but...\" The white-haired man paused, struggling to word his question. \"I\u0027m not sure I understand. The Fire-Tasters actually... ingest the smoke from burning the Walking Flowers? Like food?\" He tried to suppress the horror in his tone. It was not a soul\u0027s place to judge another soul. But I was not surprised, given his background on the Planet of the Flowers, at his strong reaction to the fate of a similar life-form on another world.\n It was always amazing to me how some souls buried themselves in the affairs of whichever world they inhabited and ignored the rest of the universe. But, to be fair, perhaps Faces Sunward had been in hibernation when Fire World became notorious.\n \"Yes, they receive essential nutrients from this smoke. And therein lies the fundamental dilemma and the controversy of Fire World-and the reason the planet has not been closed, though there has certainly been adequate time to populate it fully. There is also a high relocation percentage.\n \"When Fire World was discovered, it was at first thought that the dominant species, the Fire-Tasters, were the only intelligent life-forms present. The Fire-Tasters did not consider the Walking Flowers to be their equals-a cultural prejudice-so it was a while, even after the first wave of settling, before the souls realized they were murdering intelligent creatures. Since then, Fire World scientists have focused their efforts on finding a replacement for the dietary needs of the Fire-Tasters. Spiders are being transported there to help, but the planets are hundreds of light-years apart. When this obstacle is overcome, as it will be soon, I\u0027m sure, there is hope that the Walking Flowers might also be assimilated. In the meantime, much of the brutality has been removed from the equation. The, ah, burning-alive portion, of course, and other aspects as well.\"\n \"How can they...\" Faces Sunward trailed off, unable to finish.\n Another voice completed Faces Sunward\u0027s thought. \"It seems like a very cruel ecosystem. Why was the planet not abandoned?\"\n \"That has been debated, naturally, Robert. But we do not abandon planets lightly. There are many souls for whom Fire World is home. They will not be uprooted against their will.\" I looked away, back at my notes, in an attempt to end the side discussion.\n \"But it\u0027s barbaric!\"\n Robert was physically younger than most of the other students-closer to my age, in fact, than any other. And truly a child in a more important way. Earth was his first world-the Mother in this case had actually been an Earth-dweller, too, before she\u0027d given herself-and he didn\u0027t seem to have as much perspective as older, better-traveled souls. I wondered what it would be like to be born into the overwhelming sensation and emotion of these hosts with no prior experience for balance. It would be difficult to find objectivity. I tried to remember that and be especially patient as I answered him.\n \"Every world is a unique experience. Unless one has lived on that world, it\u0027s impossible to truly understand the -\"\n \"But you never lived on Fire World,\" he interrupted me. \"You must have felt the same way... Unless you had some other reason for skipping that planet? You\u0027ve been almost everywhere else.\"\n \"Choosing a planet is a very personal and private decision, Robert, as you may someday experience.\" My tone closed the subject absolutely.\n Why not tell them? You do think it\u0027s barbaric-and cruel and wrong. Which is pretty ironic if you ask me-not that you ever do. What\u0027s the problem? Are you ashamed that you agree with Robert? Because he\u0027s more human than the others?\n Melanie, having found her voice, was becoming downright unbearable. How was I supposed to concentrate on my work with her opinions sounding off in my head all the time?\n In the seat behind Robert, a dark shadow moved.\n The Seeker, clad in her usual black, leaned forward, intent for the first time on the subject of discussion.\n I resisted the urge to scowl at her. I didn\u0027t want Robert, already looking embarrassed, to mistake the expression as meant for him. Melanie grumbled. She wished I wouldn\u0027t resist. Having the Seeker stalk our every footstep had been educational for Melanie; she used to think she couldn\u0027t hate anything or anyone more than she hated me.\n \"Our time is almost up,\" I announced with relief. \"I\u0027m pleased to inform you that we will have a guest speaker next Tuesday who will be able to make up for my ignorance on this topic. Flame Tender, a recent addition to our planet, will be here to give us a more personal account of the settling of Fire World. I know that you will give him all the courtesy you accord me, and be respectful of the very young age of his host. Thank you for your time.\"\n The class filed out slowly, many of the students taking a minute to chat with one another as they gathered their things. What Kathy had said about friendships ran through my head, but I felt no desire to join any of them. They were strangers.\n Was that the way I felt? Or the way Melanie felt? It was hard to tell. Maybe I was naturally antisocial. My personal history supported that theory, I supposed. I\u0027d never formed an attachment strong enough to keep me on any planet for more than one life.\n I noticed Robert and Faces Sunward lingering at the classroom door, locked in a discussion that seemed intense. I could guess the subject.\n \"Fire World stories ruffle feathers.\"\n I started slightly.\n The Seeker was standing at my elbow. The woman usually announced her approach with the quick tap of her hard shoes. I looked down now to see that she was wearing sneakers for once-black, of course. She was even tinier without the extra inches.\n \"It\u0027s not my favorite subject,\" I said in a bland voice. \"I prefer to have firsthand experience to share.\"\n \"Strong reactions from the class.\"\n \"Yes.\"\n She looked at me expectantly, as if waiting for more. I gathered my notes and turned to put them in my bag.\n \"You seemed to react as well.\"\n I placed my papers in the bag carefully, not turning.\n \"I wondered why you didn\u0027t answer the question.\"\n There was a pause while she waited for me to respond. I didn\u0027t.\n \"So... why didn\u0027t you answer the question?\"\n I turned around, not concealing the impatience on my face. \"Because it wasn\u0027t pertinent to the lesson, because Robert needs to learn some manners, and because it\u0027s no one else\u0027s business.\"\n I swung my bag to my shoulder and headed for the door. She stayed right beside me, rushing to keep up with my longer legs. We walked down the hallway in silence. It wasn\u0027t until we were outside, where the afternoon sun lit the dust motes in the salty air, that she spoke again.\n \"Do you think you\u0027ll ever settle, Wanderer? On this planet, maybe? You seem to have an affinity for their... feelings.\"\n I bridled at the implied insult in her tone. I wasn\u0027t even sure how she meant to insult me, but it was clear that she did. Melanie stirred resentfully.\n \"I\u0027m not sure what you mean.\"\n \"Tell me something, Wanderer. Do you pity them?\"\n \"Who?\" I asked blankly. \"The Walking Flowers?\"\n \"No, the humans.\"\n I stopped walking, and she skidded to a halt beside me. We were only a few blocks from my apartment, and I\u0027d been hurrying in hopes of getting away from her, though likely as not, she\u0027d invite herself in. But her question caught me off guard.\n \"The humans?\"\n \"Yes. Do you pity them?\"\n \"Don\u0027t you?\"\n \"No. They were quite the brutal race. They were lucky to survive each other as long as they did.\"\n \"Not every one of them was bad.\"\n \"It was a predilection of their genetics. Brutality was part of their species. But you pity them, it seems.\"\n \"It\u0027s a lot to lose, don\u0027t you think?\" I gestured around us. We stood in a parklike space between two ivy-covered dormitories. The deep green of the ivy was pleasing to the eye, especially in contrast to the faded red of the old bricks. The air was golden and soft, and the smell of the ocean gave a briny edge to the honey sweet fragrance of the flowers in the bushes. The breeze caressed the bare skin of my arms. \"In your other lives, you can\u0027t have felt anything so vivid. Wouldn\u0027t you pity anyone who had this taken from them?\" Her expression stayed flat, unmoved. I made an attempt to draw her in, to make her consider another viewpoint. \"Which other worlds have you lived on?\"\n She hesitated, then squared her shoulders. \"None. I\u0027ve only lived on Earth.\"\n That surprised me. She was as much a child as Robert. \"Only one planet? And you chose to be a Seeker in your first life?\"\n She nodded once, her chin set.\n \"Well. Well, that\u0027s your business.\" I started walking again. Maybe if I respected her privacy, she would return the favor.\n \"I spoke to your Comforter.\"\n And maybe not, Melanie thought sourly.\n \"What?\" I gasped.\n \"I gather you\u0027ve been having more trouble than just accessing the information I need. Have you considered trying another, more pliable host? She suggested that, did she not?\"\n \"Kathy wouldn\u0027t tell you anything!\"\n The Seeker\u0027s face was smug. \"She didn\u0027t have to answer. I\u0027m very good at reading human expressions. I could tell when my questions struck a nerve.\"\n \"How dare you? The relationship between a soul and her Comforter -\"\n \"Is sacrosanct, yes; I know the theory. But the acceptable means of investigation don\u0027t seem to be working with your case. I have to get creative.\"\n \"You think I\u0027m keeping something from you?\" I demanded, too angry to control the disgust in my voice. \"You think I confided that to my Comforter?\"\n My anger didn\u0027t faze her. Perhaps, given her strange personality, she was used to such reactions.\n \"No. I think you\u0027re telling me what you know... But I don\u0027t think you\u0027re looking as hard as you could. I\u0027ve seen it before. You\u0027re growing sympathetic to your host. You\u0027re letting her memories unconsciously direct your own desires. It\u0027s probably too late at this point. I think you\u0027d be more comfortable moving on, and maybe someone else will have better luck with her.\"\n \"Hah!\" I shouted. \"Melanie would eat them alive!\"\n Her expression froze in place.\n She\u0027d had no idea, no matter what she thought she\u0027d discerned from Kathy. She\u0027d thought Melanie\u0027s influence was from memories, that it was unconscious.\n \"I find it very interesting that you speak of her in the present tense.\"\n I ignored that, trying to pretend I hadn\u0027t made a slip. \"If you think someone else would have better luck breaking into her secrets, you\u0027re wrong.\"\n \"Only one way to find out.\"\n \"Did you have someone in mind?\" I asked, my voice frigid with aversion.\n She grinned. \"I\u0027ve gotten permission to give it a try. Shouldn\u0027t take long. They\u0027re going to hold my host for me.\"\n I had to breathe deeply. I was shaking, and Melanie was so full of hate that she was past words. The idea of having the Seeker inside me, even though I knew that I would not be here, was so repugnant that I felt a return of last week\u0027s nausea.\n \"It\u0027s too bad for your investigation that I\u0027m not a skipper.\"\n The Seeker\u0027s eyes narrowed. \"Well, it does certainly make this assignment drag on. History was never of much interest to me, but it looks like I\u0027m in for a full course now.\"\n \"You just said that it was probably too late to get any more from her memories,\" I reminded her, struggling to make my voice calm. \"Why don\u0027t you go back to wherever you belong?\"\n She shrugged and smiled a tight smile. \"I\u0027m sure it is too late... for voluntary information. But if you don\u0027t cooperate, she might just lead me to them yet.\"\n \"Lead you?\"\n \"When she takes full control, and you\u0027re no better than that weakling, once Racing Song, now Kevin. Remember him? The one who attacked the Healer?\"\n I stared at her, eyes wide, nostrils flared.\n \"Yes, it\u0027s probably just a matter of time. Your Comforter didn\u0027t tell you the statistics, did she? Well, even if she did, she wouldn\u0027t have the latest information that we have access to. The long-term success rate for situations such as yours-once a human host begins to resist-is under twenty percent. Did you have any idea it was so bad? They\u0027re changing the information they give potential settlers. There will be no more adult hosts offered. The risks are too great. We\u0027re losing souls. It won\u0027t be long before she\u0027s talking to you, talking through you, controlling your decisions.\"\n I hadn\u0027t moved an inch or relaxed a muscle. The Seeker leaned in, stretched up on her toes to put her face closer to mine. Her voice turned low and smooth in an attempt to sound persuasive.\n \"Is that what you want, Wanderer? To lose? To fade away, erased by another awareness? To be no better than a host body?\"\n I couldn\u0027t breathe.\n \"It only gets worse. You won\u0027t be you anymore. She\u0027ll beat you, and you\u0027ll disappear. Maybe someone will intervene... Maybe they\u0027ll move you like they did Kevin. And you\u0027ll become some child named Melanie who likes to tinker with cars rather than compose music. Or whatever it is she does.\"\n \"The success rate is under twenty percent?\" I whispered.\n She nodded, trying to suppress a smile. \"You\u0027re losing yourself, Wanderer. All the worlds you\u0027ve seen, all the experiences you\u0027ve collected-they\u0027ll be for nothing. I saw in your file that you have the potential for Motherhood. If you gave yourself to be a Mother, at least all that would not be entirely wasted. Why throw yourself away? Have you considered Motherhood?\"\n I jerked away from her, my face flushing.\n \"I\u0027m sorry,\" she muttered, her face darkening, too. \"That was impolite. Forget I said that.\"\n \"I\u0027m going home. Don\u0027t follow.\"\n \"I have to, Wanderer. It\u0027s my job.\"\n \"Why do you care so much about a few spare humans? Why? How do you justify your job anymore? We\u0027ve won! It\u0027s time for you to join society and do something productive!\"\n My questions, my implied accusations, did not ruffle her.\n \"Wherever the fringes of their world touch ours there is death.\" She spoke the words peacefully, and for a moment I glimpsed a different person in her face. It surprised me to realize that she deeply believed in what she did. Part of me had supposed that she only chose to seek because she illicitly craved the violence. \"If even one soul is lost to your Jared or your Jamie, that is one soul too many. Until there is total peace on this planet, my job will be justified. As long as there are Jareds surviving, I am needed to protect our kind. As long as there are Melanies leading souls around by the nose...\"\n I turned my back on her and headed for my apartment with long strides that would force her to run if she wanted to keep up.\n \"Don\u0027t lose yourself, Wanderer!\" she called after me. \"Time is running out for you!\" She paused, then shouted more loudly. \"Inform me when I\u0027m to start calling you Melanie!\"\n Her voice faded as the space between us grew. I knew she would follow at her own pace. This last uncomfortable week-seeing her face in the back of every class, hearing her footsteps behind me on the sidewalk every day-was nothing compared to what was coming. She was going to make my life a misery.\n It felt as if Melanie were bouncing violently against the inner walls of my skull.\n Let\u0027s get her canned. Tell her higher-ups that she did something unacceptable. Assaulted us. It\u0027s our word against hers -\n In a human world, I reminded her, almost sad that I didn\u0027t have access to that sort of recourse. There are no higher-ups, in that sense. Everyone works together as equals. There are those whom many report to, in order to keep the information organized, and councils who make decisions about that information, but they won\u0027t remove her from an assignment she wants. You see, it works like -\n Who cares how it works if it doesn\u0027t help us? I know-let\u0027s kill her! A gratuitous image of my hands tightening around the Seeker\u0027s neck filled my head.\n That sort of thing is exactly why my kind is better left in charge of this place.\n Get off your high horse. You\u0027d enjoy it as much as I would. The image returned, the Seeker\u0027s face turning blue in our imagination, but this time it was accompanied by a fierce wave of pleasure.\n That\u0027s you, not me. My statement was true; the image sickened me. But it was also perilously close to false-in that I would very much enjoy never seeing the Seeker again.\n What do we do now? I\u0027m not giving up. You\u0027re not giving up. And that wretched Seeker is sure as hell not giving up!\n I didn\u0027t answer her. I didn\u0027t have a ready answer.\n It was quiet in my head for a brief moment. That was nice. I wished the silence could last. But there was only one way to buy my peace. Was I willing to pay the price? Did I have a choice anymore?\n Melanie slowly calmed. By the time I was through the front door, locking behind me the bolts that I had never before turned-human artifacts that had no place in a peaceful world-her thoughts were contemplative.\n I\u0027d never thought about how you all carry on your species. I didn\u0027t know it was like that.\n We take it very seriously, as you can imagine. Thanks for your concern. She wasn\u0027t bothered by the thick edge of irony in the thought.\n She was still musing over this discovery while I turned on my computer and began to look for shuttle flights. It was a moment before she was aware of what I was doing.\n Where are we going? The thought held a flicker of panic. I felt her awareness begin to rifle through my head, her touch like the soft brush of feathers, searching for anything I might be keeping from her.\n I decided to save her the search. I\u0027m going to Chicago.\n The panic was more than a flicker now. Why?\n I\u0027m going to see the Healer. I don\u0027t trust her. I want to talk to him before I make my decision.\n There was a brief silence before she spoke again.\n The decision to kill me?\n Yes, that one. \n","sourceLink":"https://allnovel.net/the-host-the-host-1/page-8.html","bookId":2029,"book":{"id":2029,"title":"The Host (The Host #1)","description":"Storyline: \n The Host is a science fiction/romance novel by Stephenie Meyer. The novel introduces an alien race, called Souls, which takes over the Earth and its inhabitants. The book describes one Soul\u0027s predicament when the mind of its human host refuses to cooperate with her takeover. The Host was released on May 6, 2008 with an initial print run of 750,000 copies. An international version of the novel was released on April 2, 2008 in the United Kingdom, Ireland, Indonesia, the Philippines, Australia, and Hong Kong by the UK publishing division. It was translated into Chinese, Dutch, Swedish, German, Portuguese, Italian, Spanish, Hungarian, Romanian, Serbian, Hebrew and Danish among others. The prologue and the fourth chapter of the book can be found on Meyer\u0027s official website.\n \n","cover":"https://allnovel.net/images/the-host-the-host-1.jpg","author":"Stephenie Meyer","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-host-the-host-1.html","creation":"Oct 5, 2019 8:58:16 AM","modification":"Oct 5, 2019 11:18:50 PM"}}
