{"id":108341,"no":16,"title":"Page 16","content":"When I reach the clear pool of water that same evening, Dante is not there. His absence hits me like a wall. It was too much to hope, I know. But as I sit exhausted beside the pond and stare at the reflection of the vanishing sunlight and the slow emergence of the stars, I ponder the unfairness of life. Here was Dante, a simple man who would give his life for a just cause, killed out of love for me. And here am I, a monster, who will easily kill, and I am still alive. God had granted me a miracle that very morning, yet I feel I would trade all of his grace just to see my friend for a few minutes.\n But the night grows darker and still Dante does not come.\n He is dead, I know. Death is all I know.\n There is blood on my left hand.\n The hand that stole the girl\u0027s life.\n Funny I hadn\u0027t noticed it before. Leaning over the pond, I place my hand in the water and try to wash off the dark red stain.\n But it does not come off. I wonder why.\n \"Good. You have passed the first step of initiation. The second step will come later, and then the final and third step.\"\n Killing the girl had been the second step.\n Or so he said. That Prince of Lies.\n He is dead now. He will say no more.\n Not to me. There will be no third initiation.\n I scrub my hand fiercely. To no avail.\n I have never seen a stain like this before.\n \"But I am sorry for what I did,\" I tell the starry pond. \"You know I had to do it. I had no choice.\"\n If I am explaining to God, he does not answer me.\n But once more my memory of the future is clear. Perhaps the pond acts as a catalyst. It is every bit as clear and round as the one Alanda led me to. And as I could at that watery oasis, I imagine that I can see more reflected stars than I can in the sky itself. My sudden grip on reality makes me marvel at how much my memory faltered while I was embarked on my dark adventure. Maybe Landulf had been blocking me. Maybe my deep-seated fears distorted my memo?ry. I could have tricked myself into not knowing the horrors that awaited me. Or perhaps it was all a function of coming back in time.\n I feel as if all my powers, the ones I left behind in the twentieth century, have returned to me. Come back just when I no longer need them. I am surprised, now that my mission is complete, that my staring at the stars does not bring me back to Alanda and Gaia and their spaceship. Bat maybe I don\u0027t want to leave yet. I promised Dante I would wait for him and I am determined to wait. I don\u0027t care how long it takes, long past hope I will sit here. Or, indeed, I even consider the possibility of returning to the castle to see if he has been taken captive once more. I could free him, save him.\n But the latter is all bravado.\n I will not go back to that castle.\n I swore it once before and I swear it again.\n The stars, as they are reflected in the pond, move lazily on the faint motion of the water. They are beautiful and I feel as if I can stare at them forever. Yet my mood is not peaceful. There is music in my head and it will not go away. I hear a strident refrain from Richard Wagner\u0027s Parsival. It is almost as if, staring at the heavens, I look upon a vast stage where Wolfram von Eschenbach\u0027s Parsival is still being played out. I see the knights striving to fulfill their quest for the Grail, and then, Klingsor, in the back?ground, always out of sight, obstructing their every move with his magic wand, the Spear of Longinus. I wonder if I should have left it in Landulf s body. The sacred stabbed through the sinful. But I had feared to approach the center of the pentagram to retrieve it.\n Even when he was dead, I was still afraid of him.\n It is a truth I have trouble accepting.\n I am afraid even now. The stain bothers me.\n How was Klingsor stained? What was his mark?\n The play explained it all. If only I could remember.\n Something about a certain kind of smoothness.\n But I cannot remember. No.\n Nor can I understand why Dante was so insistent that I understand the meaning of the Medusa story. He was such a simple fellow, full of phobias and goodness, but when he spoke of mythology, he spoke with great authority. Almost as if another personality used his mouth and lips. I keep feeling as if Dante had been trying to warn me of a deeper threat. One that could not be seen because the true power of the wizard was that he was able to control one\u0027s will. Capable of turning whomever he wished to stone, so that he or she did not move unless the wizard wished it.\n Could that be the real meaning of the Medusa tale?\n The Gorgon did not merely kill her enemies.\n She placed them under complete mind control.\n Doubts continue to assail me. Questions that are more like ancient riddles. What about the snakes in the hair of Medusa? What about her fair face? Dante had emphasized that the latter was crucial. And I had laughed and told him it was time to concentrate on what was real. But I of all people should have known that reality was not always what it seemed.\n A profound certainty sweeps over me.\n Dante had been trying to warn me of something unseen.\n Then I see him. And it is a miracle.\n He is struggling up the path to the pond, limping badly, gasping for breath. In a moment I am by his side, helping him to sit down on a large rock not far from the water. He is in worse shape than when I saw him last and is already babbling about how sorry he is that he is late, and why he is late. I can\u0027t get a word in, but I am so happy to see him that I weep. Really, it is one of the most wonderful moments of my life. God has heard all of my prayers.\n \"The passageway was blocked,\" he says rapidly, with hardly any air in his lungs. \"There was a large stone. I had never seen this stone before. Never! My lady, I didn\u0027t know what to do. I tried walking back in your direction, but I couldn\u0027t find you, and I kept slipping in the water. My brace kept falling off, and once it almost floated away. I would have been crippled! Then I took another path that I know but no one else knows and I went back into the castle and by all the saints in heaven I knew I was going to be put back in the prison. But everyone ignored me! The knights were running all over the place and the servants were crying and it sounded as if something horrible had befallen Lord Landulf.\" He pauses to breathe and his eyes shine with hope. \"What befell him, my lady?\" he asks.\n I have to smile. Yet there is no joy in it and I wonder why. My happiness is tempered with regrets I can hardly explain to myself.\n \"He died,\" I say. \"I killed him.\"\n Dante bursts out with laughter. But then he catches himself and quickly does the sign of the cross. But his relief is not to be contained and a moment later he is howling in pleasure again. He jumps up from his rock and hugs me and shakes like a child. Yet the news is too good for him. He is having trouble believing it.\n \"Is he is really dead?\" he keeps asking. \"Are you sure it was him? Did you see his body? Are you sure it was his body?\"\n I strive to calm him. \"It was him, I swear it. I put the Spear of Longinus through his evil heart. He died like any other man.\"\n Dante is smiling. \"Did you burn his body? Did the smoke stink?\"\n I shake my head. \"No. I didn\u0027t burn him. There wasn\u0027t time.\"\n His smile falters slightly. \"But what did you do with his body, my lady?\"\n I shrug. \"Nothing. I left it. Don\u0027t worry, he will not return to haunt us. I am sure of it.\"\n Dante seems reassured. \"Then we can go to Messi?na now and tell everyone that the world is safe?\"\n I force a laugh. \"Yes. We can tell everyone that there is nothing left to worry about.\" But my laughter soon dies because that is not the way I feel. I add softly, \"We will tell the whole world.\"\n Dante is uncertain. \"Is something wrong, my lady?\"\n I turn away. \"No. I am just worried about you. You need to eat, to rest and regain your strength.\"\n He stands and steps to my back. \"Something weighs on your heart. Share it with me, my lady. Perhaps I can lighten your burden.\"\n My eyes are suddenly damp. I am ashamed to look at his face.\n But I feel I can tell him. He will understand. \"When I found Lord Landulf,\" I say, \"he was in the stone circle as you said he would be. But I did not do what you suggested. I did not wait for him to leave the circle to attack him. I was too impatient. He was simply sitting there--I thought I could just kill him and then it would be all over with.\"\n Dante speaks sympathetically. \"But you could not penetrate the circle.\"\n My hands clasp each other uneasily. I cannot stop moving them. \"Yes. There was an invisible shield around it. Landulf had created it, I believe, by employing a sacrifice that required him to cut out the heart of his own wife.\"\n Dante gasps. \"Lady Cia!\"\n \"Yes. She was dead when I arrived. But there was a young woman chained nearby who was very much alive. Landulf told me if I wanted to get to him, I would have to rip out the girl\u0027s heart. At first I refused, but then this pounding started in my head, and it wouldn\u0027t stop, and I didn\u0027t know what to do. In a moment of pain and anger I reached for her ...\" I have trouble finishing. \"I reached for her and I--I killed her, Dante. I killed her with my own hands, and she had never done anything to me.\"\n Dante is silent for a long time. Finally I feel his good hand touch my shoulder. \"You did what you had to do, my lady.\"\n I clasp his hand but shake my head. \"I don\u0027t know. Sometimes I think I just did what I have always done in the past--kill. That has always been my ultimate solution to every problem.\" I gesture weakly. \"But this girl--she was praying for me to save her.\"\n \"But you saved the rest of us.\"\n I am emotional. \"Did I? Did I do what I was supposed to do? If I did then can you explain to me why the stain of this girl\u0027s blood refuses to wash off my hand?\"\n Dante grabs my left hand and stares at it anxiously. \"Perhaps we only need to wash it in clean water. Come, my lady, a quick wash in the pond and everything will be all right.\"\n I take back my hand. \"No, Dante. I have tried washing it a dozen times. The stain will not come off.\"\n He is confused. \"But why?\"\n I lower my head. \"I think it is because I listened to Landulf, in the end.\"\n \"No!\"\n \"Yes. I performed the ritual murder of an innocent. That\u0027s all that was needed to be initiated by him.\" I pause and stare at my left hand. There is only the stars for light, but I see the stain well. It is almost as if I see my whole life expressed in the red of the mark. \"I have become one of them,\" I whisper.\n Dante is adamant. \"No! You are the opposite of them! You are an angel! You bring light where there is darkness! Hope where there is despair! A dozen times you have come to my rescue! A dozen times I would have died without your courage!\"\n I turn and force a smile. \"Oh, Dante. I had to keep saving you because I kept putting you in danger.\" I raise my hand as he tries to protest. \"Please don\u0027t look upon me as an angel. When you get to heaven, you\u0027ll see real angels and they\u0027ll look nothing like me.\"\n He pauses and seems to think hard for a moment, but his eyes never leave my face. \"You have too much love in you to be hated by God,\" he says finally, \"When we get to heaven, you\u0027ll see that.\"\n I have to laugh and hug him again. \"My friend! What would I do without you? No, wait, don\u0027t answer that question. There is something I want to do for you. Something I have been planning to do for the last few days. But before I do it I want you to know that it is entirely safe. That no harm will come to your body or soul by the change I am going to bring.\"\n He is curious. \"What is this wonderful thing you are going to do?\"\n I hold his shoulders and stare into his eyes, trying to bring calm and understanding into his excited mind.\n \"You saw how Landulf was anxious to get my blood? There was a reason for that. Long ago a mysterious man gave me some of his blood, and that blood changed me in a way that made me both strong and resistant to disease. It is impossible for me to get sick. And just a few drops of my blood is able to heal others.\" I pause. \"Do you understand what I am saying, Dante?\"\n He shakes his head. \"I am not sure, my lady.\"\n \"I want to cut myself and sprinkle a few drops of my blood over your sores. I know they hurt you terribly, but when a little of my blood touches them they will close and heal. It will be almost be like you never had leprosy. No one will be able to tell by looking at you.\"\n He frowns. \"But it is God\u0027s will that I am sick. My disease is a punishment for my sins. We cannot change the will of God.\"\n \"Your disease is not a punishment. It is not from God. It is something you caught from another person who had the same disease.\"\n He blinks. \"From the other lepers in Persida?\"\n \"Exactly. They gave you the leprosy.\"\n He protests. \"But I never did anything to them. I only tried to help them.\"\n \"But you were around them. You touched them. That is how you got sick.\"\n His confusion deepens. \"But Landulf wanted to use your blood, my lady. I should not use it. I should not do anything he wanted to do.\"\n \"There is a difference, Dante. Landulf wanted to use my blood to hurt people. I want to use it to heal you.\"\n His superstitions are deep. His disquiet remains.\n \"But blood should not be shared,\" he says. \"That is what heathens do. When the Holy Father accused my duke, he said that he had been sharing blood with children. I thought at the time that it was lies but it came to pass that it was true. And it was a great evil that Landulf did that. With blood he invoked the demons from hell. The pope saw clearly.\"\n \"The pope did not see clearly. Good God, Dante, the pope had you castrated.\"\n His face twitches and his lower lip trembles. I have wounded him with my words and feel ashamed. He drops his head in humiliation.\n \"I wanted only to do God\u0027s will,\" he moans. \"That is all I want to do right now. But I do not know how your blood can make my disease disappear.\"\n I feel I have no recourse. We can argue all night, and get nowhere, and I believe it is possible that he could die this very night. From the burning and the other abuse, his sores are even more inflamed. Half his body is infected tissue, and I feel without even touching him the fever that cooks his blood. The effort it took him to reach me has drained what reserves he had left. His breathing is a perpetual wheeze. If I do not give him my blood soon, I will not be able to return to the future with a clear conscience.\n \"Dante,\" I say, meeting his gaze again. \"Look at me.\"\n He blinks rapidly. \"My lady?\"\n \"Look only at me, my friend. Listen only to me. You do not need to be afraid of my blood. It is a gift from God. Just a few drops of it will make you feel better, and God wants you to feel better after all that you have struggled do in his name.\"\n He is suddenly dreamy. \"Yes, my lady.\"\n \"Now close your eyes and imagine how nice it will to have your sores healed. How good it will be not to have people run away when they see you because they see you only as a leper. Dante, my dear, I promise you the leprosy will be gone in a few minutes.\"\n \"It will be gone,\" he whispers to himself with his eyes closed.\n \"Good.\" I stretch out my hand. \"Now keep your eyes closed but give me your hand. I will lead you to the pond and we will first wash your sores and then I will sprinkle something on them and they will be all better.\"\n \"All better,\" he mumbles. But he stiffens when I try to lead him toward the pond even though his eyes remain closed. He is still under my spell, at least I think he is. \"No,\" he says.\n I have to speak carefully. \"What is the matter?\"\n \"I cannot go in the pond.\"\n \"You will not go in the pond, only beside it. I need to wash you off.\"\n \"I can drown in the pond,\" he says.\n Now that I think of it, I have never seen Dante wash beside a pond. It is probably one of the reasons he smells.\n \"I will not let you drown. There is no way you can fall in.\"\n \"No,\" he says.\n He appears to be under my spell, but he is resisting me as well. I am reminded of an earlier time when I pressed him for information he knew and yet he managed to evade me--even while in the midst of a powerful hypnotic trance. There is still something in his mind, a psychic aberration of some type, that makes it impossible for me to read him clearly. Even with all my powers now at my disposal, I cannot read what he is thinking exactly.\n And I should be able to read his mind completely.\n \"What if you rest on the rock you were sitting on a moment ago,\" I suggest. \"And I bring you water to clean you. Would that be all right?\"\n He nods with his eyes closed. \"I\u0027ll rest on the rock and be all right.\"\n I lead him back to the stone where he initially rested. As he sits, I stroke his head. \"I will moisten my shirt,\" I say. \"Then I will touch your sores gently, to clean them. There will be no pain. You will feel nothing but relief. You understand, Dante?\"\n \"I understand,\" he whispers.\n I let go of him. \"I will be gone a few seconds. Remain at peace.\"\n He sighs. \"Peace.\"\n At the pond the water is very still, more so than ever. Like the pond in the desert, it is a perfect mirror of the heavens. There are so many stars on its delicate surface, so many constellations that it seems almost a sin to disturb the cool liquid. Yet I have stood here before. Last time I also gave Dante my blood and sent him on his way healed of his horrible disease. Like now, and then, I felt moved by love to give him what I could. Certainly he has earned my blood and my trust.\n I bend to dampen my shirt and then pause.\n I cannot stop staring in the water at the sky. There is the familiar constellation, Andromeda, and I can\u0027t remember it ever looking so clear. Why, I can almost imagine that I see Perseus\u0027 wife, chained to the rocks as the Titan slowly approaches, bound as a human sacrifice to appease an evil monster. Much as Landulf chained and sacrificed young women to appease his own wickedness. It is incredible, as I look closer, to see Perseus creeping closer to her side, to rescue her, with the Medusa\u0027s head hidden in his bag, out of sight. He will only show it at the last moment, when the Titan has exposed himself. Perseus was wise to keep his weapon hidden. It was Dante who suggested that Perseus would have been a fool to part with such power.\n Medusa. Perseus. Dante.\n \"My lady,\" Dante whispers at my back.\n \"Coming,\" I say.\n I kneel to wet my shirt.\n But once again I pause.\n Richard Wagner\u0027s opera returns to me on the si?lence of the night air. The music echoes in my mind with rhythms older than man. Again it is as if I am watching the opera, Parsival, being staged against the majestic background of the constellations. Each of the principal characters could be a mythological being. King Arthur could be King Polydectes, who sent Perseus after the Gorgon. Parsival could be Perseus, who slew the Medusa. But who would Klingsor be? Why, of course, the Medusa itself. The one who appears fair from the outside, but whose hair--whose aura--is filled with hissing snakes. I understand in that moment that the serpents are symbolically placed above the Medusa\u0027s head. They are there so her true identity cannot be mistaken.\n \"Hurry, my lady,\" Dante whispers.\n I will,\" I say. But I cannot move, or breathe.\n Klingsor and the Medusa. Klingsor and Landulf.\n They had so much in common.\n Except for one little thing. The play spoke of this \"thing.\"\n Wolfram von Eschenbach\u0027s Parsival told of this \"thing.\"\n Klingsor had a special mark.\n He was smooth--in a delicate spot.\n I remember now. Everything.\n And I am sick because the truth is horrible beyond belief.\n I am turned to stone. Tears cannot help me. They will not come. Not before a pain beyond all measure comes. Because even though I know the truth, I refuse to accept it. My faith may be stronger than stone, but in time all stones are worn away by water. Or tears-- it doesn\u0027t matter. All I can do now is force my stone body to face what waits behind me.\n Wetting my shirt, I stand and spy a lizard that slithers near the side of the pond. In a moment he is in my hand, in my pocket, and I casually walk back to Dante, who sits expectantly on the rock where I left him. A smile springs to his face as I approach even though his eyes remain closed. Leaning over, I begin to gently wipe at his burnt and diseased hand and arm. My touch pleases him.\n \"Oh, my lady,\" he says.\n \"Just relax, Dante,\" I say softly, \"I have to clean you and then I can cure you. You want me to cure you, don\u0027t you?\"\n \"Oh, yes.\"\n \"Good.\" I momentarily close my own eyes and bite my lower lip. \"That\u0027s good.\"\n Seconds later his hand and arm are clean. I stand and reach for the lizard in my pocket. \"Now don\u0027t be afraid,\" I say.\n \"I am not afraid,\" he whispers.\n Placing the lizard behind my back, I pulverize it in my hands. I crush it so hard all the blood squirts into my palms. Then my hands are over Dante\u0027s leper sores, dropping the reptile\u0027s blood over his wounds. The lizard was cold-blooded; its blood is not so warm as mine would have been. But Dante doesn\u0027t seem to notice and for that small favor I am glad. I cannot take my eyes off his face. I am looking for something there, a faint change of expression as his system soaks up my blood. An expression I have not seen before. An expression of triumph, perhaps, or maybe even arrogance. I need to see such a thing to dispel all my questions.\n But what I see is much worse.\n As the blood sprinkles over him, his lower lip curls ever so slightly. Curls in an unpleasant manner, and I believe deep in my heart that he is reacting to my great sacrifice with all but disguised contempt. I pull my hands away.\n \"Open your eyes, Dante,\" I say.\n He opens his eyes and beams. \"Am I cured, my lady?\"\n I grin with false pleasure. \"Almost, my friend.\"\n Then I grab him by the collar of his filthy shirt and, before he can react, I drag him to the edge of the pond. The water has not completely settled since I touched it, but it is flat enough to show his reflection. No wonder he did not want to stand next to the pond with me by his side. For in the water, Dante\u0027s suppos?edly ruined and pained expression is extraordinary.\n Literally, he is more beautiful than a man should be.\n He could almost be a goddess.\n I leap back from him and tremble.\n \"Landulf,\" I gasp. \"It was you. All along, it was you.\"\n The other Landulf was just a puppet. Just a disciple of the real master, Dante. The duke in the castle was just a minion.\n Dante was the real power behind the throne.\n Dante was Landulf.\n He stares down at his face for a long time before responding. Perhaps he has not seen his reflection in a while--I don\u0027t know. When he finally does speak, his voice is remarkably gentle, not unlike it was before, yet with more power, the confidence of a being that has for a long time been master of his own destiny. He straightens as he speaks, as if his physical disease has no real hold over him. But I am not sure if that is the case. He speaks with authority but there is disap?pointment in his tone.\n \"I should have guessed you would return with greater wisdom,\" he says. \"Last time you were easily tricked. But now I am the one who has been fooled.\" He sighs. \"You have grown, Sita, in the last thousand years.\"\n \"Because I chose wisdom over compassion?\" I ask.\n He glances at me. \"In a sense. It is easier for humans to pass a test of love than a test that requires wisdom. Because even love often obscures wisdom.\"\n I am bitter. \"You do not have the right to speak to me of love.\"\n He has been tricked but he still has the ability to smile. \"But I do admire you even if I don\u0027t love you,\" he says. \"Admiration is the closest my kind gets to love. It serves us well. I never feel the lack of this love you constantly crave.\"\n \"You imply that I need something from you. You\u0027re wrong.\"\n \"Yet you cherished Dante\u0027s love,\" he says.\n \"I was merely bewildered on the path. You are lost here at the end.\"\n \"Perhaps.\" He pauses. \"How did you guess?\"\n \"Parsival. I saw it in Vienna before World War Two. The character of Klingsor was Landulf. He had been castrated by the pope.\" I mock him. \"In the play, they said he was smooth between the legs.\"\n A wave of anger rolls over his face but he quickly masters himself. \"You have an excellent memory. No doubt I made other mistakes with you as well.\"\n \"Yes. But I am puzzled. Why did you give me the clue of the Medusa\u0027s head?\"\n \"It was necessary. For you to be totally mine, you had to be warned by me in advance. Free will operates on both paths, the right and the left. When you intentionally killed that girl, then and only then were you made ready to meet me here.\"\n \"It was all just a set up? The whole thing?\"\n \"Yes.\"\n \"And had I willingly given you my blood, I would have completed the third step?\"\n \"Precisely. Then your blood would have been of the most use to me.\"\n I sigh. \"Well, I guess now you\u0027re not going to have it.\"\n He stares at me. I see him clearly now, his supernat?ural beauty, even the faint tendrils of black that crawl around the field above his head. Yet I realize he still has leprosy.\n \"You are wrong on that point,\" he says softly.\n I take a step back. \"You are still about to die. You need my blood to live even a few more days. Your evil invocations really did give you leprosy.\n He takes a step in my direction. \"That is correct. The work has its price. But I need your blood to sustain this physical body, and continue my work in this third density. But unlike last time, I will now be unable to pass my blood onto others. You can no longer be convinced to be my initiate and undergo a shift toward negative polarization. Still, your blood will be useful to me for a long time.\" He removes a dagger from under his dirty shirt. It is the same one that the maid stabbed me with. It is stained with my blood. \"There is no point in trying to run from me, Sita, or in trying to harm me. My psychic powers are beyond yours.\"\n I find it impossible to turn away from him.\n Indeed, I cannot even move my arms or legs\n The Medusa. My body has turned to stone.\n \"It doesn\u0027t matter what you do to me now,\" I say, thankful to be able to use my tongue. \"I have defeated you and the rest of your kind. In the future there will be no army of invincible negative beings to confuse humanity. Your cancer has been cut from society. The harvest will go forward the way it was intended. You have lost, Landulf, admit it.\"\n He steps to within two feet of me. He brushes my long hair with his knife. Then he licks the tip of the blade, the dried blood, and smiles sadly.\n \"It is not my nature to admit anything,\" he says. \"But I will say that I would have enjoyed your continuing adoration almost as much as your body, and the immortal blood that pumps through it.\" He scratches the skin below my right eye and a red drop runs over my cheek. The sight fills him with pleasure. \"A vampiric tear, Sita. Cried for me? I must still be your hero.\"\n I am defiant, and no longer afraid.\n The stain on my left hand has vanished.\n \"My only regret is the tears I cried for you,\" I say. \"Other than that I have none. I am at peace. And you are still a monster. One day you will be forced to look in Perseus\u0027 mirror, and you will see your own reflec?tion, and see just how foul you are to behold. And on that day you will turn to stone, Landulf. You will die and rot, and the world will be relieved of a great burden.\" I stop. \"Kill me now and get it over with. If you have the nerve, you disgusting creature!\"\n I spit in his face. He does not like that.\n He wipes the saliva away and raises his knife.\n \"I was going to kill you quick,\" he says. \"But now, Sita, it may take all night.\"\n He moves to slit open my side and then pauses, puzzled.\n I am confused as well, for a moment. My body has begun to glow. The pond shines as well, with the light of the heavens. It is as if the constellations in the sky have been awakened, and been inspired to send down their light to Earth. The white light that fills my body comes from the direction of the pond as well as the sky. Landulf seems to recognize the transformation I am undergoing and is filled with dismay. But this stellar current fills me with euphoria. I have experi?enced it before, just before I rescued the child from the Setians. Landulf is like one of those creatures, I see, only worse. He struggles to cut into my flesh as I grow brighter. His frustration makes me laugh.\n \"I guess you\u0027re going to have to remain a leper,\" I say in a voice that grows faint. \"But don\u0027t take it too hard. You\u0027re not going to be around much longer. Yaksha is still somewhere on this planet and you might try to find him, but I don\u0027t think that you\u0027ll get to him in time. As far as you\u0027re concerned, I am the last vampire. Your last chance, Landulf. How does that feel?\"\n His rage is incredible to behold. The fair face of the god is transformed into a demon. The all but invisible serpents above his head hiss poisonous vapors. They surround him in a noxious cloud. It is as if his whole body has been swallowed by his leper\u0027s sores. He tries to grab me but his fingers pass through me. Seeing his efforts are useless, he strains to regain his pleasant demeanor, to make one last stab at my soul. But he still has the knife in his hand and in either case I will never be fooled by him again.\n \"Sita,\" he says. \"Our offer is still good. We can grant you powers unimaginable. You have only to join us, and we will rule this world together.\"\n I am practically a ghost but I can still laugh.\n \"You shouldn\u0027t have mentioned the togetherness part,\" I reply. \"I can\u0027t think of anything more dull.\" \n","sourceLink":"https://allnovel.net/creatures-of-forever-the-last-vampire-6/page-16.html","bookId":2515,"book":{"id":2515,"title":"Creatures of Forever (The Last Vampire #6)","description":"Storyline: \n Creatures of Forever (The Last Vampire #6) \n Alisa has fought every battle, against evil, against hate, and even against death itself. Now she nears the end of her incredibly long life and another unexpected force emerges to destroy her, or perhaps save her. But this force... is unlike anything she has experienced before. It seems to emerge form another place, another world, where demons are potential saviors and the future of mankind is already wrapped in the ash of a forsaken hell. This force, these strange beings, present Alisa with hard choices. To save herself, or to save others and risk losing even her own soul. These beings push alias into a place where even the perfect feat to tread.\n \n","cover":"https://allnovel.net/images/creatures-of-forever-the-last-vampire-6.jpg","author":"Christopher Pike","type":"Horror","source":"allnovel","link":"https://allnovel.net/creatures-of-forever-the-last-vampire-6.html","creation":"Oct 5, 2019 8:58:48 AM","modification":"Oct 5, 2019 11:18:17 PM"}}
