{"id":108328,"no":2,"title":"Page 2","content":"The following morning I sit beside Paula Ramirez on the edge of Emerald Bay in the area of Lake Tahoe. The sun is brilliant in a clear cerulean sky. Inside Paula\u0027s house, Seymour sleeps, a young vampire still allergic to the sun. Now the sun doesn\u0027t affect me in the slightest, and again I must credit this to my daughter\u0027s blood. Even the burning Surya, the sun god, could not intimidate the Dark Mother, Kali. Kalika\u0027s ashes rest in a vase that sits beside me in the sand. I have brought the vase with me from the house. I don\u0027t know why. Except I still miss her so, my beautiful, mysterious daughter, killed by a Setian.\\n\\n Paula holds her three-month-old son, John, and listens as I describe what happened in Los Angeles. I have driven all night to reach Paula. The infant kicks his bare feet in the cold water. He looks and sounds happy. I am happy just to see him. He always has that effect on me. It was this child\u0027s blood that brought Seymour back from the dead. Yet I did not take John\u0027s blood--once I had saved him from the Setians--to save my daughter. I knew it was not what she wanted. But I ask myself over and over how I could not have wanted it.\\n\\n Unfathomable Kalika, Kali Ma, where are you now?\\n\\n I finish my tale and Paula sits quietly staring at me with her warm eyes.\\n\\n \"She said she saw you before,\" she finally says. \"Do you think she was lying?\"\\n\\n \"It was impossible for me to tell if she was telling the truth or not,\" I explain. \"She seemed to operate under a psychic shield. It was very strong--even I could not penetrate it. Certainly I could not bend her will to mine.\"\\n\\n \"But there wouldn\u0027t be any reason for her to lie about such a detail.\"\\n\\n \"Perhaps. But still, I don\u0027t remember her.\"\\n\\n Paula stares out over the sparkling water at the small island in the center of the bay where Kalika met her end. \"You know I have begun to remember many things, Sita,\" she says softly.\\n\\n I nod. I\u0027ve suspected for a while that certain memo?ries were returning to her, but I have waited until she felt ready to talk about them.\\n\\n \"Suzama?\" I say.\\n\\n \"Yes. I remember Suzama.\"\\n\\n I suspected this, but still the statement is stunning to me. Paula remembers Suzama, my mentor from my time in ancient Egypt, because she is the reincarnation of Suzama. It is the only logical explanation, and I ask her to confirm the truth for me. Paula shakes her head.\\n\\n \"We may be the same from life to life,\" she says. \"But we are also different. Do not expect Suzama to answer when you speak to me. Her time was long ago.\"\\n\\n I probe deep into Paula\u0027s brown eyes and feel a rush of joy, and of sorrow. \"But she is in you,\" I protest. \"A part of me must have known that from the beginning. When I met you at the bookstore, I knew I could not leave you. You are Suzama, the great oracle. Can\u0027t you just admit it?\"\\n\\n She is flattered by my praise, and yet unmoved as well. \"Perhaps I can\u0027t because I\u0027m not able to see what happens next.\" She pauses. \"Yet I knew, when you were down in Los Angeles, that you would confront something very old.\"\\n\\n I lower my voice. \"Then you know who she was?\"\\n\\n She shakes her head. \"I have a feel for her, that is all.\" Reaching down, she touches the clear water, then feels John\u0027s feet to see if they are getting cold. She adds in a serious voice. \"Interesting how she men?tioned the harvest.\"\\n\\n \"Yes. I didn\u0027t understand that. What harvest was she talking about?\"\\n\\n Paula is thoughtful, her eyes focused far away, as Suzama often was.\\n\\n \"There is a time coming soon,\" she says, \"when everything will change. I have seen this in what people call visions, but which aren\u0027t visions at all. People will either move forward or else repeat what they have already done.\\n\\n I have to think about this.\\n\\n Suzama never made casual prophecies.\\n\\n \"What will people move forward to?\" I ask.\\n\\n \"An entirely different type of life. One we cannot even imagine as we sit here. Those who do go forward will live in light and bliss.\"\\n\\n \"But Heidi was wicked. Why would she want to increase such a harvest?\"\\n\\n Paula wipes the water off John\u0027s feet and warms them in her lap. \"There are two kinds of harvests,\" she says. \"There are two kinds of people. Those who serve others and those who serve themselves. You know this--it is nothing new. Of course, no one is one hundred percent one way or the other. No one is a perfect sinner or a perfect saint. But where there is a dominance of self-interest, a negative harvest will come about for that person. Where there is a domi?nance of love, a positive harvest will happen.\"\\n\\n \"You know these things for fact?\"\\n\\n \"Yes.\"\\n\\n \"Suzama ...\" I begin.\\n\\n She smiles. \"Paula. Please?\"\\n\\n \"Paula. When will the harvest occur?\"\\n\\n \"The date is not set. But some time in the next twenty-five years the change will occur.\"\\n\\n \"Will everyone be harvested?\"\\n\\n \"Not at all.\"\\n\\n \"What is the criteria?\"\\n\\n \"I knew you would ask that. The criteria, I believe, is the same for both sides, positive and negative. Yet it has nothing to do with religious persuasion, higher learning, physical health or beauty, relative impor?tance in society. None of these qualities will matter.\"\\n\\n \"Then what will the criteria be?\" I repeat.\\n\\n \"It is difficult to describe.\"\\n\\n I am frustrated. \"Try.\"\\n\\n Paula laughs, and so does her child. John is for the most part a happy baby, but he can cry in the middle of the night with the best of them. Many times I have changed his diapers to allow Paula to sleep. Since drinking my daughter\u0027s blood, I seldom need to rest. \"Life is the criteria,\" she says finally. \"Who is alive, who is not. Remember, those who are negative can be more full of life than the most positive of people.\" She punches me in the arm. \"Take you for example.\"\\n\\n I am her naive student, from long ago, and her remark wounds. It strikes me then how much our relationship has changed since we met. Then I was the sole knower of profound secrets. Now I truly feel I am her student and study at her knee. Mystery surrounds her like a halo. I love her so much, but she scares me.\\n\\n \"Am I only fit for the negative side?\" I ask quietly.\\n\\n She laughs more. \"Silly vampire. No, don\u0027t be ridiculous. Who more than you is ready to give her life for others?\"\\n\\n I gesture helplessly. \"But I have killed so many over the years.\"\\n\\n She is compassionate. \"It doesn\u0027t matter, Sita. Really, I know this for a fact.\"\\n\\n I have to smile. \"I suppose you would since you have such a special child.\"\\n\\n \"You understand what I am saying. The issue of harvest is separate from the type of harvest. Whether a person will go forward is dependent on his or her life vibration. Whether he or she will enter a positive realm or a negative one depends on the quality of his or her heart.\"\\n\\n \"Tell me more about this next realm?\"\\n\\n \"I cannot.\"\\n\\n \"But you see it?\"\\n\\n \"Yes. But words do not describe it. The next dimension is even beyond the realms souls encounter when they die.\" She pauses to run her hand through John\u0027s silky brown hair. How will the world react, I wonder, to a brown messiah? Of course, no race would satisfy everyone. Paula adds, \"The coming harvest will affect heaven and earth.\"\\n\\n \"Is that why John was born? To increase the posi?tive harvest?\"\\n\\n \"Yes. But. . .\" She does not finish.\\n\\n \"What?\"\\n\\n Paula frowns and then sighs. \"Something is wrong. The plan is off.\"\\n\\n \"What are you talking about? What plan?\"\\n\\n \"God\u0027s plan.\"\\n\\n \"He makes plans? Are you sure about that? I always thought he just rolled the dice when it came to us.\"\\n\\n Paula smiles again, but the expression is short-lived. She continues in a serious tone, hugging her baby to her chest. John yawns and closes his eyes, ready for a nap.\\n\\n \"Every individual affects the world, but it is diffi?cult for so many to go forward, the way we would wish them to, when there is so much evil in the world.\" She pauses. \"Yet this evil is there for a reason. It plays its part. You remember Ory?\"\\n\\n \"Yes. How could I forget? I just killed him last month. Why do you ask?\"\\n\\n But Paula is evasive, as Suzama often was. \"He played his part\" is all she says.\\n\\n \"Paula,\" I say. \"I described to you what happened to me that night in the desert, when I confronted Ory. It seemed as if for a time I was not physical, that the very matter of my body had changed into light. Is that related to this harvest you describe?\"\\n\\n \"Yes.\"\\n\\n \"But when I changed, it seemed that I entered a spaceship from another world. But it wasn\u0027t a space?ship. I don\u0027t think anyone could see it but me, in my changed condition. There were beings aboard. Beings like demons, and I entered the mind of one. At least I think I did. But as time goes by, I begin to doubt that any of this happened, that I didn\u0027t just dream it all. Does that make sense?\"\\n\\n Paula nods. \"That is why I can\u0027t describe what is to come next. It would just be a dream to us, the way we are now.\"\\n\\n \"But were these beings from a negative harvest?\"\\n\\n She touches my knee. \"Sita. You want to under?stand everything with your head. You ask me to describe what you call my visions with words. But neither thing is possible. Even your brilliant mind cannot reach beyond concepts. Even your vampire eyes cannot see beyond this world. I don\u0027t know who they were, these friends of Ory. I don\u0027t know who this Heidi was. I only know that she did not lie to you when she said she met you long ago.\" Paula pauses and she raises her eyes to the water, to Lake Tahoe beyond the sheltered bay. \"And that it was long ago things went wrong.\"\\n\\n \"Went wrong? For whom?\"\\n\\n \"For all of us.\"\\n\\n \"I don\u0027t understand,\" I complain.\\n\\n \"Did Suzama ever just explain things to you?\"\\n\\n \"Sometimes.\"\\n\\n \"No. She would take a lesson only so far because she was not omniscient. She saw a portion of the mind of God, but no mortal can see all of it. Suzama was not infallible.\"\\n\\n \"Is John?\"\\n\\n The boy sleeps soundly. Paula speaks with love. \"John\u0027s a baby.\"\\n\\n \"But who was he in the past?\"\\n\\n Paula pauses. \"I don\u0027t know.\"\\n\\n \"Suzama said this child would be the same as the others: Jesus; Shankara, Krishna. She wrote that--I saw her words with my own eyes.\"\\n\\n \"Then why are you asking me?\"\\n\\n \"To know if it\u0027s true.\"\\n\\n \"Ah. That is the question, isn\u0027t it? What is true? But didn\u0027t Suzama also write that faith is stronger than stone?\"\\n\\n \"But I ask you these things so I will know what to have faith in.\"\\n\\n \"Have faith in yourself, Sita. These strangers have come for you for a purpose. It does not sound as if they have the welfare of mankind at heart. You must seek them out, learn what they want and how they hope to accomplish it.\"\\n\\n \"You have seen this in a vision?\"\\n\\n Paula turns her head away. \"I have seen too many things.\"\\n\\n I have to wonder if she has seen my death.\\n\\n \"You can tell me,\" I say carefully.\\n\\n \"No.\"\\n\\n \"I am not afraid to hear what is to be.\"\\n\\n Paula lowers her head. A tear runs over her cheek.\\n\\n \"I am afraid,\" she whispers.\\n\\n \"Suzama,\" I say, and stop myself. But Paula is already looking at me and shaking her head.\\n\\n \"I didn\u0027t call you as I promised I would after I fled from Kalika,\" she says. \"Do you know why?\"\\n\\n \"I meant to ask you. I assume you had a vision that it would be better to keep your distance. At least for a time.\"\\n\\n \"No. I didn\u0027t talk to you because I began to understand your destiny--destiny itself. It can only be lived, it cannot be explained. It is like a mystery, which ceases to exist the moment you explain it. The same with a magic trick. When you are told how it works, it loses all its charm.\"\\n\\n \"What you\u0027re saying is that you\u0027ll tell me no more of what you\u0027ve seen?\"\\n\\n \"I have seen no more, and for that I am glad.\"\\n\\n \"You look more sad than happy.\"\\n\\n Paula smiles sadly. \"Because I know you\u0027ll be going away soon.\"\\n\\n I thought the same thing. I am anxious to return to Los Angeles to trace Heidi\u0027s background. \"But I will keep in touch,\" I say. \"I will see you soon.\"\\n\\n Paula doesn\u0027t say anything more. She glances at the vase containing Kalika\u0027s ashes.\\n\\n \"Why did you bring that here?\" she asks.\\n\\n \"To put the ashes in the water.\"\\n\\n She nods. \"It is time to move on.\"\\n\\n Sorrow washes over me. \"I still think of her all the time.\"\\n\\n \"She lived the life she was born to live.\" She pauses. \"I never told you what she said to me when she burst into my house and grabbed hold of John. She said, \u0027Hello, Paula. I have no friends but I am a friend of your son\u0027s. Tonight everything will come together in a wave of blood. But don\u0027t worry, he is stronger than this night.\u0027\"\\n\\n Now I am close to tears. \"Her life was so short.\"\\n\\n Paula comforts me, rubs my arm. \"She couldn\u0027t stay too long. She was a star that burned too bright. The strength of her soul would have made us all go blind.\" Paula gestures to the vase and stands, John still asleep in her arms. \"Say your goodbyes. I will wait for you at the house.\"\\n\\n I ask weakly. \"To say goodbye?\"\\n\\n \"Yes.\"\\n\\n My voice cracks with emotion. I need her to under?stand why. \"I loved Suzama. I loved her with all my heart. When she died, I almost died.\"\\n\\n Her voice is soothing. \"You were younger then. You are stronger now.\"\\n\\n I look up at her. \"Will I see you again? After today?\"\\n\\n Suzama stares at me for a long time. It is Suzama, yes, and she stares with the eyes of humanity\u0027s great?est clairvoyant. Her eyes are dry now; she has no tears, as she slowly shakes her head.\\n\\n \"I don\u0027t think so, Sita,\" she says.\\n\\n She turns and walks away.\\n\\n I am left alone with my daughter\u0027s ashes, and soon these are gone, too, on the gentle ripples of the bay. I poured them from the vase without words, but with great nostalgia and love. True, she was an avatar, a creature of the divine, yet even Kalika\u0027s ashes dissolve in water. My memories are strong then, my pain nailed to a bloody past. But strong also is my vision of the future. It is true what Suzama says. I will leave this place, leave my few friends, and confront an enemy I know will kill me. Kill me because I crave love instead of power. But this I have lived five thousand years to learn. Power is as cold as forgotten ashes. Only my love can keep alive the memory of my daughter, the stories of Ray, Arturo, Yaksha, and most of all the grace of Krishna.\\n\\n My blessed Lord--how he must laugh at me when I sing him to sleep in the middle of the night. Sing him songs from the holy Vedas that he himself wrote when he walked under the trees of ancient India. It is the divine child I will miss the most. Not to see him grow old, to hear him speak wisdom. I fear I will be ash before he even utters his first words. And I have to wonder who will remember me when I am gone. I worry that even Suzama and Seymour will forget me. Me--Alisa, Sita, or a thousand other names that I have been called by strangers who became friends or lovers. I fear it will be as if I never was. Never a vampire. The last vampire, whose long life now comes to a close.\\n\\n Death does not scare me, but oblivion does. There is a difference. In my daughter\u0027s ashes I see my own bright star sink beneath the surface and go out. My end will erase my beginning. I don\u0027t know how but I know it is true. And I must choose that end because it is my destiny. \\n\\n","sourceLink":"https://allnovel.net/creatures-of-forever-the-last-vampire-6/page-2.html","bookId":2515,"book":{"id":2515,"title":"Creatures of Forever (The Last Vampire #6)","description":"Storyline: Creatures of Forever (The Last Vampire #6) \\n Alisa has fought every battle, against evil, against hate, and even against death itself. Now she nears the end of her incredibly long life and another unexpected force emerges to destroy her, or perhaps save her. But this force... is unlike anything she has experienced before. It seems to emerge form another place, another world, where demons are potential saviors and the future of mankind is already wrapped in the ash of a forsaken hell. This force, these strange beings, present Alisa with hard choices. To save herself, or to save others and risk losing even her own soul. These beings push alias into a place where even the perfect feat to tread.\\n","cover":"https://allnovel.net/images/creatures-of-forever-the-last-vampire-6.jpg","author":"Christopher Pike","type":"Horror","source":"allnovel","link":"https://allnovel.net/creatures-of-forever-the-last-vampire-6.html","creation":"Oct 5, 2019 8:58:48 AM","modification":"Oct 5, 2019 11:18:17 PM"}}
