{"id":108332,"no":6,"title":"Page 6","content":"The funny thing is, I don\u0027t see anything. Alanda explains that the ship will land deep in the desert, beside a clear pond. She offers to drive me there, but I prefer to take the Jeep, so she goes with me instead. We cut directly across the sand, murdering more than a few tumbleweeds in the process. Yet the ground is not excessively bumpy, and we soon reach the pond. After parking, I climb out and stare at it in amaze?ment.\\n\\n The pond appears to be natural--Alanda assures me it is even though it is a perfect circle. A hundred feet across, the water lies so still that it could be a polished mirror set to reflect the stars. Indeed, as I approach the edge of the pond, I see more stars in the water than I do above. I see the approach of the saucer in the water before I see it in the sky, quite a few seconds before. It makes me wonder, yet I say nothing.\\n\\n The saucer is blue-white, and the light from it slowly begins to flood the area and my eyes, wiping out any chance of my making out the details. If I weren\u0027t dreading seeing Landulf, I would be thrilled by this moment. But I can only think of Landulf s devilishly handsome face, his deep laugh, and the way he would make an incision in an abdomen with his long sharp nails and slowly pull out the victim\u0027s entrails while the victim watched. I feel I must resist Landulf with every fiber of my being. Yet Alanda says that is the way of failure.\\n\\n I have no idea what I\u0027ll do that is different from what I did the last time.\\n\\n I stare up at the saucer.\\n\\n \"This is incredible,\" I whisper.\\n\\n \"This is but a beam ship,\" she says. \"Our mother ships are a thousand times this size.\"\\n\\n \"And I have been on these before?\"\\n\\n \"Yes.\"\\n\\n \"When?\"\\n\\n \"Another time.\"\\n\\n \"Are you sure the brakes work? The ship looks as if it\u0027s going to land on us.\"\\n\\n \"It will land over this pool.\"\\n\\n \"Then we should move?\"\\n\\n \"No. We\u0027re fine. It will move right over us.\"\\n\\n The light grows dazzling, and I have to shield my eyes.\\n\\n \"This must be visible from a hundred miles away,\" I gasp.\\n\\n \"No one sees it but us,\" Alanda replies.\\n\\n I glance at her. \"Is it physical?\"\\n\\n \"What is physical in one density is not physical in another.\"\\n\\n I have to laugh. \"One of these days, Alanda, I am going to ask you a question and understand your answer.\"\\n\\n The water of the pond seems to glow as the space?ship settles over us. One moment it is above us, the next we are inside it. The translucent floor, I assume, now covers the pond. During the move to the interior, we have had our clothes changed. We now wear long white robes. I don\u0027t even bother asking--the night is so weird already.\\n\\n A gentleman waits for us inside. He is tall and bearded--like a child\u0027s drawing of a Biblical charac?ter. His robe is the color of the outside of the ship, blue-white. The interior of the vessel is in various shades of gold, and the ceiling is a clear dome, that opens to the sky. There appear to be no controls. Alanda introduces her friend as Gaia. He smiles and bows his head but doesn\u0027t say anything. His eyes are liquid green and very lovely.\\n\\n \"Gaia is from a race that doesn\u0027t speak,\" Alanda explains. \"But he understands your thoughts.\"\\n\\n I nod in his direction. \"I appreciate your coming for us, Gaia. I hope it was not too long a journey.\"\\n\\n He smiles and shakes his head. No, not too long.\\n\\n There is a faint humming.\\n\\n \"What is that?\" I ask.\\n\\n \"Our engines,\" Alanda says.\\n\\n \"Will we leave soon?\"\\n\\n \"We have already left.\" Alanda motions with her arm. \"See, we are in orbit.\"\\n\\n The floor of the craft turns clear as glass, and I jump slightly, momentarily afraid I am going to fall. Below our feet is the black-blue Pacific, and the glittering coast of California. I spot Lake Tahoe, and think of my friends. We seem to be moving westward, at considerable speed. Yet the hum has stopped, and all is quiet. The view takes my breath away, it is so beautiful, and yet it also makes me sad. To see the Earth from such a vantage point, to realize it is all I have known. Never before did I realize how much I thought of the Earth as my mother.\\n\\n \"She is a strong woman,\" Alanda says softly, read?ing my mind. \"But delicate as well.\"\\n\\n \"Can a planet be alive?\" I ask.\\n\\n \"Can a sun?\" she replies. \"I told you that it was the god within your sun that decided that humanity should live with the veil--until this time.\"\\n\\n \"Are you from a world that experienced such a veil?\"\\n\\n \"Originally, yes.\"\\n\\n \"Can you tell me about that world?\" I ask.\\n\\n \"Not at this time.\"\\n\\n \"But I lived there before I came to Earth?\"\\n\\n \"Not precisely. Before you came here, you existed in a realm of great glory.\"\\n\\n \"You\u0027re saying that I was in a higher dimension?\"\\n\\n \"Yes,\" Alanda says. \"A higher density.\"\\n\\n \"Why did I decide to come to Earth?\"\\n\\n \"To serve, to grow. The two are the same in the creator\u0027s eyes.\"\\n\\n \"Why did I chose to be a vampire?\"\\n\\n Alanda hesitates. \"When you came here, you were not a vampire.\"\\n\\n \"I had a life before this one?\"\\n\\n Her voice is abruptly filled with melancholy. \"Yes. Very long ago.\"\\n\\n She is trying to tell me something without saying it.\\n\\n \"I made a mistake when I returned?\" I say. \"Is that why I had to be reborn as a vampire?\"\\n\\n Alanda reaches over and touches my face. \"You returned to this third density out of love. If you made a mistake, Sita, it was only out of love. You mustn\u0027t blame yourself.\"\\n\\n Already we are over India. I nod to Rajastan, desert meeting green.\\n\\n \"I was born there five thousand years ago,\" I say. \"I am sure you know that. But what you might not know is that I feel I never left that tiny village. I am still that young girl spying on the Aghora sacrifice that invoked Yaksha into Amba\u0027s dead womb.\" I pause. \"I held him as an unborn infant in my hand. He was just a trace of movement beneath the hard skin of a corpse. I had a knife in my hand, and my father gave me the choice of ending his life before it could begin.\" A wave of weariness sweeps over me and I lower my head. \"But I couldn\u0027t kill Yaksha.\"\\n\\n Alanda hugs me. \"Because of love, you see. You must let go of the past.\"\\n\\n \"But you are sending me into a past I want to let go of.\"\\n\\n \"But this is the only way you will be able to be finished with it. Trust us, Sita. We do this for you as much as for ourselves. Our futures are entwined,\"\\n\\n I look up and smile. \"Just because I almost killed you doesn\u0027t mean I believe you would lie to me.\" I pause. \"You risked your life meeting me like that.\"\\n\\n \"It was the only way to meet you.\"\\n\\n \"It was a test?\" I ask.\\n\\n \"In a manner of speaking.\"\\n\\n \"You could have defended yourself from me.\"\\n\\n Alanda turns back to the view. \"I counted on your compassion.\"\\n\\n \"The compassion of a murderer?\"\\n\\n \"Of an angel.\"\\n\\n I have to laugh. \"You are as bad as Seymour. He sees me that way, no matter what I do.\"\\n\\n \"He is wise.\"\\n\\n I sigh. \"I would love it if he were with us now.\"\\n\\n Alanda is thoughtful. \"In a sense, he is. He is always with you.\"\\n\\n Her remark strikes deeply into me. \"Why is that so true?\"\\n\\n Alanda stares at the Earth, India. \"You will see.\"\\n\\n A short time later the Earth begins to shrink as we pull away from it at a tremendous velocity. Soon it is only a blue ball, falling into a well of blackness. The floor turns solid as the sides become clear. The rays of the sun stab through the saucer\u0027s view screens and I feel their warmth. There is no sense of acceleration, however. I see the moon, but only for a few seconds, and then it is lost in the glare of the Earth. But then that planet, the only home I can remember, is also lost in the rays of the sun. The sun begins to diminish in size and brilliance. Alanda turns away and strolls to the center of the craft. But my eyes are gripped by the stars ahead of us.\\n\\n \"I\u0027ve had these dreams,\" I say to Alanda and Gaia both. Gaia stands at a respectful distance, silent, peaceful, absorbed in a contemplation I cannot imag?ine. Yet I know he watches me and listens to my thoughts. I continue, \"In them I would be in a spaceship flying through the galaxy toward the Pleia?des. Ray would usually be with me, but sometimes it would be my husband, Rama. Never were both with me, but I think that\u0027s because--in my dreams--they were always the same person. Anyway, we would be excited and filled with a sense of adventure. We would know, when we reached the Pleiades, that all our friends would be waiting for us. We even knew that Krishna would be there, to welcome us and to heal the many injuries we had received living on Earth. Most of all, in these dreams, I would be happy, and it would be hard to wake from them.\" I pause. \"Were they just dreams, Alanda?\"\\n\\n \"Or were they real?\" she asks. \"Maybe they were a little of both.\"\\n\\n I look at her. \"Are you from the Pleiades?\"\\n\\n \"It is a place I know.\" She shrugs. \"We are each from God.\"\\n\\n I listen to the silence. \"It\u0027s time, isn\u0027t it?\"\\n\\n \"Yes. In a few minutes, we will make what you might call a hyperjump. At that time, as I explained before, it is important that you focus your entire being to a time just before you traveled to Landulf s castle.\"\\n\\n \"It was Dante who led me to the castle,\" I say, stepping toward her. \"Should I think of him?\"\\n\\n Alanda pauses. \"The moment you reappear is en?tirely up to you.\"\\n\\n I force a smile, although the dread weighs on me like a stone in my heart.\\n\\n \"It will be good to see Dante again,\" I say. \"A little comic relief before I descend into hell.\" I gesture to the center of the floor. \"Should I sit down and close my eyes?\"\\n\\n Alanda takes my hand. \"Lie down and close them, Sita.\"\\n\\n I do as she says, but she continues to hold my hand. I open my eyes and smile at her. \"Don\u0027t worry,\" I say. \"It is just my mind that is going back in time.\"\\n\\n She shakes her head slightly. \"But if you die back then.\"\\n\\n I understand. \"I won\u0027t exist today?\"\\n\\n She sighs. \"There is something else. These fifth density negative beings--they can imprison you.\"\\n\\n \"I\u0027m pretty good at breaking out of most prisons.\"\\n\\n \"They can imprison your soul, in their realm. Make you one of them.\"\\n\\n Somehow that doesn\u0027t sound fair. \"For long?\"\\n\\n \"Billions of years. You would only be set free when they are set free.\"\\n\\n \"Negative beings attain freedom?\" I ask.\\n\\n \"Yes. Far up the ladder of evolution, the negative path meets the positive. In the end, all find God.\" She squeezes my hand. \"But you could be lost for the life of this universe.\"\\n\\n I cannot conceive of anything worse.\\n\\n \"How can he trap me?\" I ask.\\n\\n \"He is subtle, and we cannot penetrate his mind. But he acts much as a mirror does. He stands before you. He shows you what you are. But only the parts of you that can be used to destroy you.\"\\n\\n \"He can cause me to destroy myself?\"\\n\\n \"Exactly. Be wary. He can kill you without your permission. But he can only pervert you to his cause if you enter into an agreement with him out of free will.\"\\n\\n \"But I would never do that.\"\\n\\n Alanda seems unsure. Her expression is anxious.\\n\\n She leans over and kisses my cheek. There is a tear on her face and I reach up to wipe it away but she grabs my other hand.\\n\\n \"You are loved,\" she whispers. \"Don\u0027t forget that.\"\\n\\n \"I know. I know you.\" I close my eyes. \"Goodbye, Alanda.\"\\n\\n \"Sita. My Sita.\"\\n\\n She lets go of me. The ship darkens.\\n\\n I hear the strange hum again, a shift inside.\\n\\n But inside, outside--they have lost their meaning.\\n\\n We are beyond space and time, and I am falling.\\n\\n Into horror unspeakable, yes, and maybe hope unimagined. \\n\\n","sourceLink":"https://allnovel.net/creatures-of-forever-the-last-vampire-6/page-6.html","bookId":2515,"book":{"id":2515,"title":"Creatures of Forever (The Last Vampire #6)","description":"Storyline: Creatures of Forever (The Last Vampire #6) \\n Alisa has fought every battle, against evil, against hate, and even against death itself. Now she nears the end of her incredibly long life and another unexpected force emerges to destroy her, or perhaps save her. But this force... is unlike anything she has experienced before. It seems to emerge form another place, another world, where demons are potential saviors and the future of mankind is already wrapped in the ash of a forsaken hell. This force, these strange beings, present Alisa with hard choices. To save herself, or to save others and risk losing even her own soul. These beings push alias into a place where even the perfect feat to tread.\\n","cover":"https://allnovel.net/images/creatures-of-forever-the-last-vampire-6.jpg","author":"Christopher Pike","type":"Horror","source":"allnovel","link":"https://allnovel.net/creatures-of-forever-the-last-vampire-6.html","creation":"Oct 5, 2019 8:58:48 AM","modification":"Oct 5, 2019 11:18:17 PM"}}
