{"id":62458,"no":21,"title":"Page 21","content":"Chapter Twenty-One\n Lord Asriel\u0027s Welcome\n Lyra rode a strong young bear, and Roger rode another, while lorek paced tirelessly ahead and a squad armed with a fire hurler followed guarding the rear.\n The way was long and hard. The interior of Svalbard was mountainous, with jumbled peaks and sharp ridges deeply cut by ravines and steep-sided valleys, and the cold was intense. Lyra thought back to the smooth-running sledges of the gyp-tians on the way to Bolvangar; how swift and comfortable that progress now seemed to have been! The air here was more penetratingly chill than any she had experienced before; or it might have been that the bear she was riding wasn\u0027t as lightfooted as lorek; or it might have been that she was tired to her very soul. At all events, it was desperately hard going.\n She knew little of where they were bound, or how far it was. All she knew was what the older bear S0ren Eisarson had told her while they were preparing the fire hurler. He had been involved in negotiating with Lord Asriel about the terms of his imprisonment, and he remembered it well.\n At first, he\u0027d said, the Svalbard bears regarded Lord Asriel as being no different from any of the other politicians, kings, or troublemakers who had been exiled to their bleak island. The prisoners were important, or they would have been killed outright by their own people; they might be valuable to the bears one day, if their political fortunes changed and they returned to rule in their own countries; so it might pay the bears not to treat them with cruelty or disrespect.\n So Lord Asriel had found conditions on Svalbard no better and no worse than hundreds of other exiles had done. But certain things had made his jailers more wary of him than of other prisoners they\u0027d had. There was the air of mystery and spiritual peril surrounding anything that had to do with Dust; there was the clear panic on the part of those who\u0027d brought him there; and there were Mrs. Coulter\u0027s private communications with lofur Raknison.\n Besides, the bears had never met anything quite like Lord Asriel\u0027s own haughty and imperious nature. He dominated even lofur Raknison, arguing forcefully and eloquently, and persuaded the bear-king to let him choose his own dwelling place.\n The first one he was allotted was too low down, he said. He needed a high spot, above the smoke and stir of the fire mines and the smithies. He gave the bears a design of the accommodation he wanted, and told them where it should be; and he bribed them with gold, and he flattered and bullied lofur Raknison, and with a bemused willingness the bears set to work. Before long a house had arisen on a headland facing north: a wide and solid place with fireplaces that burned great blocks of coal mined and hauled by bears, and with large windows of real glass. There he dwelt, a prisoner acting like a king.\n And then he set about assembling the materials for a laboratory.\n With furious concentration he sent for books, instruments, chemicals, all manner of tools and equipment. And somehow it had come, from this source or that; some openly, some smuggled in by the visitors he insisted he was entitled to have. By land, sea, and air, Lord Asriel assembled his materials, and within six months of his committal, he had all the equipment he wanted.\n And so he worked, thinking and planning and calculating, waiting for the one thing he needed to complete the task that so terrified the Oblation Board. It was drawing closer every minute.\n Lyra\u0027s first glimpse of her father\u0027s prison came when lorek Byrnison stopped at the foot of a ridge for the children to move and stretch themselves, because they had been getting dangerously cold and stiff.\n \"Look up there,\" he said.\n A wide broken slope of tumbled rocks and ice, where a track had been laboriously cleared, led up to a crag outlined against the sky. There was no Aurora, but the stars were brilliant. The crag stood black and gaunt, but at its summit was a spacious building from which light spilled lavishly in all directions: not the smoky inconstant gleam of blubber lamps, nor the harsh white of anbaric spotlights, but the warm creamy glow of naphtha.\n The windows from which the light emerged also showed Lord Asriel\u0027s formidable power. Glass was expensive, and large sheets of it were prodigal of heat in these fierce latitudes; so to see them here was evidence of wealth and influence far greater than lofur Raknison\u0027s vulgar palace.\n Lyra and Roger mounted their bears for the last time, and lorek led the way up the slope toward the house. There was a courtyard that lay deep under snow, surrounded by a low wall, and as lorek pushed open the gate they heard a bell ring somewhere in the building.\n Lyra got down. She could hardly stand. She helped Roger down too, and, supporting each other, the children stumbled through the thigh-deep snow toward the steps up to the door.\n Oh, the warmth there would be inside that house! Oh, the peaceful rest!\n She reached for the handle of the bell, but before she could reach it, the door opened. There was a small dimly lit vestibule to keep the warm air in, and standing under the lamp was a figure she recognized: Lord Asriel\u0027s manservant Thorold, with his pinscher daemon Anfang.\n Lyra wearily pushed back her hood.\n \"Who...\" Thorold began, and then saw who it was, and went on: \"Not Lyra? Little Lyra? Am I dreaming?\"\n He reached behind him to open the inner door.\n A hall, with a coal fire blazing in a stone grate; warm naphtha light glowing on carpets, leather chairs, polished wood... It was like nothing Lyra had seen since leaving Jordan College, and it brought a choking gasp to her throat.\n Lord Asriel\u0027s snow-leopard daemon growled.\n Lyra\u0027s father stood there, his powerful dark-eyed face at first fierce, triumphant, and eager; and then the color faded from it; his eyes widened, in horror, as he recognized his daughter.\n \"No! No!\"\n He staggered back and clutched at the mantelpiece. Lyra couldn\u0027t move.\n \"Get out!\" Lord Asriel cried. \"Turn around, get out, go! I did not send for you!\"\n She couldn\u0027t speak. She opened her mouth twice, three times, and then managed to say:\n \"No, no, I came because - \"\n He seemed appalled; he kept shaking his head, he held up his hands as if to ward her off; she couldn\u0027t believe his distress.\n She moved a step closer to reassure him, and Roger came to stand with her, anxious. Their daemons fluttered out into the warmth, and after a moment Lord Asriel passed a hand across his brow and recovered slightly. The color began to return to his cheeks as he looked down at the two.\n \"Lyra,\" he said. \"That is Lyra?\"\n \"Yes, Uncle Asriel,\" she said, thinking that this wasn\u0027t the time to go into their true relationship. \"I came to bring you the alethiometer from the Master of Jordan.\"\n \"Yes, of course you did,\" he said. \"Who is this?\"\n \"It\u0027s Roger Parslow,\" she said. \"He\u0027s the kitchen boy from Jordan College. But - \"\n \"How did you get here?\"\n \"I was just going to say, there\u0027s lorek Byrnison outside, he\u0027s brought us here. He came with me all the way from Trollesund, and we tricked lofur - \"\n \"Who\u0027s lorek Byrnison?\"\n \"An armored bear. He brought us here.\"\n \"Thorold,\" he called, \"run a hot bath for these children, and prepare them some food. Then they will need to sleep. Their clothes are filthy; find them something to wear. Do it now, while I talk to this bear.\"\n Lyra felt her head swim. Perhaps it was the heat, or perhaps it was relief. She watched the servant bow and leave the hall, and Lord Asriel go into the vestibule and close the door behind, and then she half-fell into the nearest chair.\n Only a moment later, it seemed, Thorold was speaking to her.\n \"Follow me, miss,\" he was saying, and she hauled herself up and went with Roger to a warm bathroom, where soft towels hung on a heated rail, and where a tub of water steamed in the naphtha light.\n \"You go first,\" said Lyra. \"I\u0027ll sit outside and we\u0027ll talk.\"\n So Roger, wincing and gasping at the heat, got in and washed. They had swum naked together often enough, frolicking in the Isis or the Cherwell with other children, but this was different.\n \"I\u0027m afraid of your uncle,\" said Roger through the open door. \"I mean your father.\"\n \"Better keep calling him my uncle. I\u0027m afraid of him too, sometimes.\"\n \"When we first come in, he never saw me at all. He only saw you. And he was horrified, till he saw me. Then he calmed down all at once.\"\n \"He was just shocked,\" said Lyra. \"Anyone would be, to see someone they didn\u0027t expect. He last saw me after that time in the Retiring Room. It\u0027s bound to be a shock.\"\n \"No,\" said Roger, \"it\u0027s more than that. He was looking at me like a wolf, or summing.\"\n \"You\u0027re imagining it.\"\n \"I en\u0027t. I\u0027m more scared of him than I was of Mrs. Coulter, and that\u0027s the truth.\"\n He splashed himself. Lyra took out the alethiometer.\n \"D\u0027you want me to ask the symbol reader about it?\" Lyra said.\n \"Well, I dunno. There\u0027s things I\u0027d rather not know. Seems to me everything I heard of since the Gobblers come to Oxford, everything\u0027s been bad. There en\u0027t been nothing good more than about five minutes ahead. Like I can see now, this bath\u0027s nice, and there\u0027s a nice warm towel there, about five minutes away. And once I\u0027m dry, maybe I\u0027ll think of summing nice to eat, but no further ahead than that. And when I\u0027ve eaten, maybe I\u0027ll look forward to a kip in a comfortable bed. But after that, I dunno, Lyra. There\u0027s been terrible things we seen, en\u0027t there? And more a coming, more\u0027n likely. So I think I\u0027d rather not know what\u0027s in the future. I\u0027ll stick to the present.\"\n \"Yeah,\" said Lyra wearily. \"There\u0027s times I feel like that too.\"\n So although she held the alethiometer in her hands for a little longer, it was only for comfort; she didn\u0027t turn the wheels, and the swinging of the needle passed her by. Pantalaimon watched it in silence.\n After they\u0027d both washed, and eaten some bread and cheese and drunk some wine and hot water, the servant Thorold said, \"The boy is to go to bed. I\u0027ll show him where to go. His Lordship asks if you\u0027d join him in the library, Miss Lyra.\"\n Lyra found Lord Asriel in a room whose wide windows overlooked the frozen sea far below. There was a coal fire under a wide chimneypiece, and a naphtha lamp turned down low, so there was little in the way of distracting reflections between the occupants of the room and the bleak starlit panorama outside. Lord Asriel, reclining in a large armchair on one side of the fire, beckoned her to come and sit in the other chair facing him.\n \"Your friend lorek Byrnison is resting outside,\" he said. \"He prefers the cold.\"\n \"Did he tell you about his fight with lofur Raknison?\"\n \"Not in detail. But I understand that he is now the king of Svalbard. Is that true?\"\n \"Of course it\u0027s true. lorek never lies.\"\n \"He seems to have appointed himself your guardian.\"\n \"No. John Faa told him to look after me, and he\u0027s doing it because of that. He\u0027s following John Faa\u0027s orders.\"\n \"How does John Faa come into this?\"\n \"I\u0027ll tell you if you tell me something,\" she said. \"You\u0027re my father, en\u0027t you?\"\n \"Yes. So what?\"\n \"So you should have told me before, that\u0027s what. You shouldn\u0027t hide things like that from people, because they feel stupid when they find out, and that\u0027s cruel. What difference would it make if I knew I was your daughter? You could have said it years ago. You could\u0027ve told me and asked me to keep it secret, and I would, no matter how young I was, I\u0027d have done that if you asked me. I\u0027d have been so proud nothing would\u0027ve torn it out of me, if you asked me to keep it secret. But you never. You let other people know, but you never told me.\"\n \"Who did tell you?\"\n \"John Faa.\"\n \"Did he tell you about your mother?\"\n \"Yes.\"\n \"Then there\u0027s not much left for me to tell. I don\u0027t think I want to be interrogated and condemned by an insolent child. I want to hear what you\u0027ve seen and done on the way here.\"\n \"I brought you the bloody alethiometer, didn\u0027t I?\" Lyra burst out. She was very near to tears. \"I looked after it all the way from Jordan, I hid it and I treasured it, all through what\u0027s happened to us, and I learned about using it, and I carried it all this bloody way when I could\u0027ve just given up and been safe, and you en\u0027t even said thank you, nor showed any sign that you\u0027re glad to see me. I don\u0027t know why I ever done it. But I did, and I kept on going, even in lofur Raknison\u0027s stinking palace with all them bears around me I kept on going, all on me own, and I tricked him into fighting with lorek so\u0027s I could come on here for your sake....And when you did see me, you like to fainted, as if I was some horrible thing you never wanted to see again. You en\u0027t human, Lord Asriel. You en\u0027t my father. My father wouldn\u0027t treat me like that. Fathers are supposed to love their daughters, en\u0027t they? You don\u0027t love me, and I don\u0027t love you, and that\u0027s a fact. I love Farder Coram, and I love lorek Byrnison; I love an armored bear more\u0027n I love my father. And I bet lorek Byrnison loves me more\u0027n you do.\"\n \"You told me yourself he\u0027s only following John Faa\u0027s orders.\n If you\u0027re going to be sentimental, I shan\u0027t waste time talking to you.\"\n \"Take your bloody alethiometer, then, and I\u0027m going back with lorek.\"\n \"Where?\"\n \"Back to the palace. He can fight with Mrs. Coulter and the Oblation Board, when they turn up. If he loses, then I\u0027ll die too, I don\u0027t care. If he wins, we\u0027ll send for Lee Scoresby and I\u0027ll sail away in his balloon and - \"\n \"Who\u0027s Lee Scoresby?\"\n \"An aeronaut. He brought us here and then we crashed. Here you are, here\u0027s the alethiometer. It\u0027s all in good order.\"\n He made no move to take it, and she laid it on the brass fender around the hearth.\n \"And I suppose I ought to tell you that Mrs. Coulter\u0027s on her way to Svalbard, and as soon as she hears what\u0027s happened to lofur Raknison, she\u0027ll be on her way here. In a zeppelin, with a whole lot of soldiers, and they\u0027re going to kill us all, by order of the Magisterium.\"\n \"They\u0027ll never reach us,\" he said calmly.\n He was so quiet and relaxed that some of her ferocity dwindled.\n \"You don\u0027t know,\" she said uncertainly.\n \"Yes I do.\"\n \"Have you got another alethiometer, then?\"\n \"I don\u0027t need an alethiometer for that. Now I want to hear about your journey here, Lyra. Start from the beginning. Tell me everything.\"\n So she did. She began with her hiding in the Retiring Room, and went on to the Gobblers\u0027 taking Roger, and her time with Mrs. Coulter, and everything else that had happened.\n It was a long tale, and when she finished it she said, \"So there\u0027s one thing I want to know, and I reckon I\u0027ve got the right to know it, like I had the right to know who I really was. And if you didn\u0027t tell me that, you\u0027ve got to tell me this, in recompense. So: what\u0027s Dust? And why\u0027s everyone so afraid of it?\"\n He looked at her as if trying to guess whether she would understand what he was about to say. He had never looked at her seriously before, she thought; until now he had always been like an adult indulging a child in a pretty trick. But he seemed to think she was ready.\n \"Dust is what makes the alethiometer work,\" he said. \"Ah...I thought it might! But what else? How did they find out about it?\"\n \"In one way, the Church has always been aware of it. They\u0027ve been preaching about Dust for centuries, only they didn\u0027t call it by that name.\n \"But some years ago a Muscovite called Boris Mikhailovitch Rusakov discovered a new kind of elementary particle. You\u0027ve heard of electrons, photons, neutrinos, and the rest? They\u0027re called elementary particles because you can\u0027t break them down any further: there\u0027s nothing inside them but themselves. Well, this new kind of particle was elementary all right, but it was very hard to measure because it didn\u0027t react in any of the usual ways. The hardest thing for Rusakov to understand was why the new particle seemed to cluster where human beings were, as if it were attracted to us. And especially to adults. Children too, but not nearly so much until their daemons have taken a fixed form. During the years of puberty they begin to attract Dust more strongly, and it settles on them as it settles on adults.\n \"Now all discoveries of this sort, because they have a bearing on the doctrines of the Church, have to be announced through the Magisterium in Geneva. And this discovery of Rusakov\u0027s was so unlikely and strange that the inspector from the Consistorial Court of Discipline suspected Rusakov of diabolic possession. He performed an exorcism in the laboratory, he interrogated Rusakov under the rules of the Inquisition, but finally they had to accept the fact that Rusakov wasn\u0027t lying or deceiving them: Dust really existed.\n \"That left them with the problem of deciding what it was. And given the Church\u0027s nature, there was only one thing they could have chosen. The Magisterium decided that Dust was the physical evidence for original sin. Do you know what original sin is?\"\n She twisted her lips. It was like being back at Jordan, being quizzed on something she\u0027d been half-taught. \"Sort of,\" she said.\n \"No, you don\u0027t. Go to the shelf beside the desk and bring me the Bible.\"\n Lyra did so, and handed the big black book to her father.\n \"You do remember the story of Adam and Eve?\"\n \u0027\"Course,\" she said. \"She wasn\u0027t supposed to eat the fruit and the serpent tempted her, and she did.\"\n \"And what happened then?\"\n \"Umm...They were thrown out. God threw them out of the garden.\"\n \"God had told them not to eat the fruit, because they would die. Remember, they were naked in the garden, they were like children, their daemons took on any form they desired. But this is what happened.\"\n He turned to Chapter Three of Genesis, and read:\n \"And the woman said unto the serpent, We may eat of the fruit of the trees of the garden:\n \"But of the fruit of the tree which is in the midst of the garden, God hath said, Ye shall not eat of it, neither shall ye touch it, lest ye die.\n \"And the serpent said unto the woman, Ye shall not surely die:\n \"For God doth know that in the day ye eat thereof, then your eyes shall be opened, and your daemons shall assume their true forms, and ye shall be as gods, knowing good and evil.\n \"And when the woman saw that the tree was good for food, and that it was pleasant to the eyes, and a tree to be desired to reveal the true form of one\u0027s daemon, she took of the fruit thereof, and did eat, and gave also unto her husband with her; and he did eat.\n \"And the eyes of them both were opened, and they saw the true form of their daemons, and spoke with them.\n \"But when the man and the woman knew their own daemons, they knew that a great change had come upon them, for until that moment it had seemed that they were at one with all the creatures of the earth and the air, and there was no difference between them:\n \"And they saw the difference, and they knew good and evil; and they were ashamed, and they sewed fig leaves together to cover their nakedness....\"\n He closed the book.\n \"And that was how sin came into the world,\" he said, \"sin and shame and death. It came the moment their daemons became fixed.\"\n \"But...\" Lyra struggled to find the words she wanted: \"but it en\u0027t true, is it? Not true like chemistry or engineering, not that kind of true? There wasn\u0027t really an Adam and Eve? The Cassington Scholar told me it was just a kind of fairy tale.\"\n \"The Cassington Scholarship is traditionally given to a freethinker; it\u0027s his function to challenge the faith of the Scholars. Naturally he\u0027d say that. But think of Adam and Eve like an imaginary number, like the square root of minus one: you can never see any concrete proof that it exists, but if you include it in your equations, you can calculate all manner of things that couldn\u0027t be imagined without it.\n \"Anyway, it\u0027s what the Church has taught for thousands of years. And when Rusakov discovered Dust, at last there was a physical proof that something happened when innocence changed into experience.\n \"Incidentally, the Bible gave us the name Dust as well. At first they were called Rusakov Particles, but soon someone pointed out a curious verse toward the end of the Third Chapter of Genesis, where God\u0027s cursing Adam for eating the fruit.\"\n He opened the Bible again and pointed it out to Lyra. She read:\n \"In the sweat of thy face shalt thou eat bread, till thou return unto the ground; for out of it wast thou taken: for dust thou art, and unto dust shalt thou return....\"\n Lord Asriel said, \"Church scholars have always puzzled over the translation of that verse. Some say it should read not \u0027unto dust shalt thou return\u0027 but \u0027thou shalt be subject to dust,\u0027 and others say the whole verse is a kind of pun on the words \u0027ground\u0027 and \u0027dust,\u0027 and it really means that God\u0027s admitting his own nature to be partly sinful. No one agrees. No one can, because the text is corrupt. But it was too good a word to waste, and that\u0027s why the particles became known as Dust.\"\n \"And what about the Gobblers?\" Lyra said.\n \"The General Oblation Board...Your mother\u0027s gang. Clever of her to spot the chance of setting up her own power base, but she\u0027s a clever woman, as I dare say you\u0027ve noticed. It suits the Magisterium to allow all kinds of different agencies to flourish. They can play them off against one another; if one succeeds, they can pretend to have been supporting it all along, and if it fails, they can pretend it was a renegade outfit which had never been properly licensed.\n \"You see, your mother\u0027s always been ambitious for power. At first she tried to get it in the normal way, through marriage, but that didn\u0027t work, as I think you\u0027ve heard. So she had to turn to the Church. Naturally she couldn\u0027t take the route a man could have taken - priesthood and so on - it had to be unorthodox; she had to set up her own order, her own channels of influence, and work through that. It was a good move to specialize in Dust. Everyone was frightened of it; no one knew what to do; and when she offered to direct an investigation, the Magisterium was so relieved that they backed her with money and resources of all kinds.\"\n \"But they were cutting - \" Lyra couldn\u0027t bring herself to say it; the words choked in her mouth. \"You know what they were doing! Why did the Church let them do anything like that?\"\n \"There was a precedent. Something like it had happened before. Do you know what the word castration means? It means removing the sexual organs of a boy so that he never develops the characteristics of a man. A castrate keeps his high treble voice all his life, which is why the Church allowed it: so useful in Church music. Some castrati became great singers, wonderful artists. Many just became fat spoiled half-men. Some died from the effects of the operation. But the Church wouldn\u0027t flinch at the idea of a little cut, you see. There was a precedent. And this would be so much more hygienic than the old methods, when they didn\u0027t have anesthetics or sterile bandages or proper nursing care. It would be gentle by comparison.\"\n \"It isn\u0027t!\" Lyra said fiercely. \"It isn\u0027t!\"\n \"No. Of course not. That\u0027s why they had to hide away in the far North, in darkness and obscurity. And why the Church was glad to have someone like your mother in charge. Who could doubt someone so charming, so well-connected, so sweet and reasonable? But because it was an obscure and unofficial kind of operation, she was someone the Magisterium could deny if they needed to, as well.\"\n \"But whose idea was it to do that cutting in the first place?\"\n \"It was hers. She guessed that the two things that happen at adolescence might be connected: the change in one\u0027s daemon and the fact that Dust began to settle. Perhaps if the daemon were separated from the body, we might never be subject to Dust - to original sin. The question was whether it was possible to separate daemon and body without killing the person. But she\u0027s traveled in many places, and seen all kinds of things. She\u0027s traveled in Africa, for instance.The Africans have a way of making a slave called a zombi. It has no will of its own; it will work day and night without ever running away or complaining. It looks like a corpse....\"\n \"It\u0027s a person without their daemon!\"\n \"Exactly. So she found out that it was possible to separate them.\"\n \"And...Tony Costa told me about the horrible phantoms they have in the northern forests. I suppose they might be the same kind of thing.\"\n \"That\u0027s right. Anyway, the General Oblation Board grew out of ideas like that, and out of the Church\u0027s obsession with original sin.\"\n Lord Asriel\u0027s daemon twitched her ears, and he laid his hand on her beautiful head.\n \"There was something else that happened when they made the cut,\" he went on. \"And they didn\u0027t see it. The energy that links body and daemon is immensely powerful. When the cut is made, all that energy dissipates in a fraction of a second. They didn\u0027t notice, because they mistook it for shock, or disgust, or moral outrage, and they trained themselves to feel numb towards it. So they missed what it could do, and they never thought of harnessing it....\"\n Lyra couldn\u0027t sit still. She got up and walked to the window, and stared over the wide bleak darkness with unseeing eyes. They were too cruel. No matter how important it was to find out about original sin, it was too cruel to do what they\u0027d done to Tony Makarios and all the others. Nothing justified that.\n \"And what were you doing?\" she said. \"Did you do any of that cutting?\"\n \"I\u0027m interested in something quite different. I don\u0027t think the Oblation Board goes far enough. I want to go to the source of Dust itself.\"\n \"The source? Where\u0027s it come from, then?\"\n \"From the other universe we can see through the Aurora.\"\n Lyra turned around again. Her father was lying back in his chair, lazy and powerful, his eyes as fierce as his daemon\u0027s. She didn\u0027t love him, she couldn\u0027t trust him, but she had to admire him, and the extravagant luxury he\u0027d assembled in this desolate wasteland, and the power of his ambition.\n \"What is that other universe?\" she said.\n \"One of uncountable billions of parallel worlds. The witches have known about them for centuries, but the first theologians to prove their existence mathematically were excommunicated fifty or more years ago. However, it\u0027s true; there\u0027s no possible way of denying it.\n \"But no one thought it would ever be possible to cross from one universe to another. That would violate fundamental laws, we thought. Well, we were wrong; we learned to see the world up there. If light can cross, so can we. And we had to learn to see it, Lyra, just as you learned to use the alethiometer.\n \"Now that world, and every other universe, came about as a result of possibility. Take the example of tossing a coin: it can come down heads or tails, and we don\u0027t know before it lands which way it\u0027s going to fall. If it comes down heads, that means that the possibility of its coming down tails has collapsed. Until that moment the two possibilities were equal.\n \"But on another world, it does come down tails. And when that happens, the two worlds split apart. I\u0027m using the example of tossing a coin to make it clearer. In fact, these possibility collapses happen at the level of elementary particles, but they happen in just the same way: one moment several things are possible, the next moment only one happens, and the rest don\u0027t exist. Except that other worlds have sprung into being, on which they did happen.\n \"And I\u0027m going to that world beyond the Aurora,\" he said, \"because I think that\u0027s where all the Dust in this universe comes from. You saw those slides I showed the Scholars in the retiring room. You saw Dust pouring into this world from the Aurora. You\u0027ve seen that city yourself. If light can cross the barrier between the universes, if Dust can, if we can see that city, then we can build a bridge and cross. It needs a phenomenal burst of energy. But I can do it. Somewhere out there is the origin of all the Dust, all the death, the sin, the misery, the destructiveness in the world. Human beings can\u0027t see anything without wanting to destroy it, Lyra. That\u0027s original sin. And I\u0027m going to destroy it. Death is going to die.\"\n \"Is that why they put you here?\"\n \"Yes. They are terrified. And with good reason.\"\n He stood up, and so did his daemon, proud and beautiful and deadly. Lyra sat still. She was afraid of her father, and she admired him profoundly, and she thought he was stark mad; but who was she to judge?\n \"Go to bed,\" he said. \"Thorold will show you where to sleep.\"\n He turned to go.\n \"You\u0027ve left the alethiometer,\" she said.\n \"Ah, yes; I don\u0027t actually need that now,\" he said. \"It would be no use to me without the books anyway. D\u0027you know, I think the Master of Jordan was giving it to you. Did he actually ask you to bring it to me?\"\n \"Well, yes!\" she said. But then she thought again, and realized that in fact the Master never had asked her to do that; she had assumed it all the time, because why else would he have given it to her? \"No,\" she said. \"I don\u0027t know. I thought - \"\n \"Well, I don\u0027t want it. It\u0027s yours, Lyra.\"\n \"But - \"\n \"Goodnight, child.\"\n Speechless, too bewildered by this to voice any of the dozen urgent questions that pressed at her mind, she sat by the fire and watched him leave the room. \n","sourceLink":"https://allnovel.net/the-golden-compass-his-dark-materials-1/page-21.html","bookId":1516,"book":{"id":1516,"title":"The Golden Compass (His Dark Materials #1)","description":"Storyline: \n The Golden Compass(His Dark Materials 1) \n Northern Lights, known as The Golden Compass in North America, is the first novel in English novelist Philip Pullman\u0027s His Dark Materials trilogy. Published in 1995, the fantasy novel is set in a universe parallel to our own and tells of Lyra Belacqua\u0027s journey north in search of her missing friend, Roger Parslow, and her imprisoned father/uncle, Lord Asriel, who has been conducting experiments with a mysterious substance known as Dust. Winner of the Carnegie Medal in 1996, the novel has been adapted into a Hollywood feature film, released in 2007 as The Golden Compass along with an accompanying video game. Both the trilogy and the film adaptation have faced controversy, as some critics assert that the story presents a negative portrayal of organized religion and religion in general.\n \n","cover":"https://allnovel.net/images/the-golden-compass-his-dark-materials-1.jpg","author":"Philip Pullman","type":"Adventure","source":"allnovel","link":"https://allnovel.net/the-golden-compass-his-dark-materials-1.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 9:38:42 AM"}}
