{"id":29543,"no":13,"title":"XIII. HAVE I A VOCATION?","content":"One day when my father came home from fishing he went into the kitchen, where my mother was making some cakes, and remained there talking earnestly with her for some time. While this conversation was going on I appeared upon the scene dressed up in my surplice, for I was just in the middle of one of my grandest processions. As I was about to enter the kitchen I was rooted to the spot by these words, which I heard proceeding from my father’s lips. \n \n “You say, my dear, that he talks of becoming a priest: the fact is he knows neither what he is talking about nor what he wishes. You must not suppose that because a child arranges little chapels in the corners of rooms, pretends he is joining in a religious procession, and wears his mother’s apron as a surplice, that he is therefore fitted to be a priest when he grows up. You might just as well say that a boy must become a soldier because he puts a feather in his cap and plays the drum all day; and then,” he went on in a melancholy tone of voice, “Paul would certainly be a worthy priest to offer to God’s service! Priest, do you say?” Then exclaimed my father bitterly, “No; a priest, like a soldier, must ever be ready to sacrifice his own life. A priest must think nothing of danger or suffering, if he incurs either for the good of others! A priest must be ready at any hour of the day or night to visit and solace those dying from pestilence. However contagious an illness may be, no priest may shrink from visiting those stricken down with it, at the risk of his own life. Do you think Paul has a vocation for this?” \n \n My mother hung her head and said nothing. Alas! what could she have said? My father’s words were wise indeed. As for me, I stood motionless in the shadow of the dark corridor, with my little bell in my hand. I listened to all that was said, standing there too distressed to remember that I ought not to listen to my father and mother’s conversation when they were unconscious of my presence. \n \n “You see, my dear,” my father continued in a more gentle voice, “a man requires courage in whatever position he may be placed and in whatever profession he may choose. But the duty of a priest is to give others courage when they fail in it, and how can he do that if he is wanting in it himself? He must set others the example. No, our boy is less fitted to be a priest than anything else; for a priest must be courageous, and his courage must be of the highest order. But mind, I would not, for anything in the world, prevent our unfortunate son from following his vocation, if he really had one. I will not deny that I had hoped he might become a soldier, because I was one myself; but alas! I have had to give up that hope.” And he repeated slowly, in a sad tone of voice, “Yes, I have given it up!” \n \n The bell fell from my hand: at the noise it made, both my father and mother turned round and discovered me. “Ah! you are there,” said my father, looking sadly at me. “It is as well, perhaps, that you heard what I said. At all events it is said, and you have heard it. However, I did not intend you should do so, my poor boy!” he exclaimed as he kissed my forehead. “But you will understand some day why I have at times seemed severe with you.” \n \n “Kiss papa,” said my mother, “and try to remember what you have heard. You are very young, you have time to profit by his words. You may yet do better. I am pleased with his progress in his lessons,” she went on, addressing my father in a conciliatory tone, “I have taught him all I can, he knows, as much as I do.” \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1958/56160.html","bookId":746,"book":{"id":746,"title":"Coward or Hero?","description":"简介： Now then! What is the matter? asked my father in a sharp tone, impatiently throwing down the newspaper....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1958","creation":"Aug 1, 2019 12:19:15 AM","modification":"Aug 1, 2019 12:19:15 AM"}}
