{"id":29561,"no":31,"title":"XXXI. SAD NEWS FOR ME.","content":"The next day Marc came to see me, and told me that his father was going to Orleans. This news distressed me, I scarcely knew why. I had a presentiment that something terrible would follow. I had seen at Bois-Clair a large letter with a red seal, which laid beside Mr. Sublaine’s plate at luncheon. No doubt this had been brought by the gendarme in his little yellow bag. It was owing to that letter, with the red seal, that we had returned to Loches, sooner than was intended. This I felt quite sure of: and also that the same letter caused Mr. Sublaine to hurry off to Orleans. What would come next? Alas! my fears were but too well founded. The day but one following, when I went to play with Marc, he told me that his father was appointed to a higher post under government at Orleans. As Marc told me this, he looked very sad. When he told me, I could scarcely speak. I remember I only answered, “Ah!” It must have seemed very stupid, but I am sure he saw how grieved I was, for he did all he could to comfort me. Marc’s parents were only to go at the beginning of October, so there was still a little time for us to be together, but I only seemed to suffer more in consequence. Each time I saw Marc, my heart seemed to swell with pain at the thought of our parting. I was miserable! how I loved him! he had been so good to me! how handsome he was! alas! should I lose sight of that good, kind face, perhaps for ever! He tried his best to console me, he promised that he would often write to me, and talked of holidays yet to come that we would pass together at Bois-Clair: and then the blow was struck.","sourceLink":"http://novel.tingroom.com/jingdian/1958/56178.html","bookId":746,"book":{"id":746,"title":"Coward or Hero?","description":"简介： Now then! What is the matter? asked my father in a sharp tone, impatiently throwing down the newspaper....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1958","creation":"Aug 1, 2019 12:19:15 AM","modification":"Aug 1, 2019 12:19:15 AM"}}
