{"id":29563,"no":33,"title":"XXXIII. MY NOSE STILL TROUBLES ME.","content":"A curly headed little boy, with eyes sparkling with malice, and a tiny turned-up nose, came close up to me and said: “Don’t you intend to give it back to me?” \\n\\n \\n\\n “What do you mean?” I asked in surprise. \\n\\n \\n\\n “You know very well,” he answered, looking more impertinent than ever. \\n\\n \\n\\n “But I assure you I do not,” replied I. \\n\\n \\n\\n “My nose; you know you have taken my share as well as your own, and it’s very nasty of you,” said this disagreeable child. \\n\\n \\n\\n I reddened and turned away from him. The boy on the other side of me seized the opportunity of my turning towards him, to say: “My little Borniquet.” \\n\\n \\n\\n “Not Borniquet but Bicquerot!” I corrected. \\n\\n \\n\\n “Ah, that’s true,” he went on. “But, my little Borniquet, tell me, what is it made of?” \\n\\n \\n\\n I guessed that he alluded to my nose, and I shrugged my shoulders. \\n\\n \\n\\n “He has a false nose,” said my interlocutor in a voice loud enough for nearly everyone to hear, “and he won’t tell me if it is made of paste-board!” \\n\\n \\n\\n All the boys near us began to laugh, and presently the whole class joined in the hilarity: never had an unfortunate nose become so popular so quickly. \\n\\n \\n\\n All sorts of jokes were made about my luckless nose. Little pieces of paper were sent round with witty and unpleasant allusions to my prominent feature. A future caricaturist gained great applause by making a sketch representing the pupil Borniquet dressed as an acrobat beating a drum, and suspended from the trapeze by his monstrous nose. \\n\\n \\n\\n The least reference made to any nose instantly attracted every eye to mine, and sent the class off into roars of laughter. \\n\\n \\n\\n What a beginning to my college life! I said to myself over and over again, If Marc had but not left me, all this would never have happened. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1958/56180.html","bookId":746,"book":{"id":746,"title":"Coward or Hero?","description":"简介： Now then! What is the matter? asked my father in a sharp tone, impatiently throwing down the newspaper....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1958","creation":"Aug 1, 2019 12:19:15 AM","modification":"Aug 1, 2019 12:19:15 AM"}}
