{"id":29570,"no":40,"title":"XL. THE EFFECT OF MY NEW COAT ON MY CHARACTER.","content":"My mother first carefully unpicked my father’s hunting coat, and then measuring me she cut out sundry patterns in grey paper, and then cut out the pieces of velvet from these patterns. With what anxiety, mingled with joy, did I watch her operations; it was delightful. The scissors went crac, crac, crac! as they cut through the velvet. What should I have done if they had cut too far? But no, there was no fear of that, my mother was too clever for that. All that she undertook was well done. \n \n Every day when I returned from the college, I walked up softly behind my mother’s chair as she sat working, to look over her shoulder and see “how we were getting on” with the wonderful coat. I remember one day a gentleman called and remained talking to my mother for a long time. I was indeed wanting in charity towards that visitor! what angry looks I gave him as I sat in a corner studying my Latin grammar! What angry words I managed to think, without speaking! All my thoughts were taken up by that splendid coat. I was longing to wear it, and this tiresome visitor prevented my mother from working at it for hours. \n \n With that coat a new era in my life began, with it I seemed somehow to gain courage and address. The thought of it seemed to make me think better of myself. At all events I determined to try to be worthy of it. When I went to bed that night, I did all I could to keep awake, in order to watch my mother working through the door which stood a little way open: I said nothing, I lay quiet as a mouse. The bed clothes were pulled up to my nose and I was perfectly happy; happy to feel myself so warm and comfortable, happy at seeing the bright lamp in the next room, which seemed to keep me company, happy at having such kind good parents, and above all was I not happy at possessing that beautiful velvet coat with those grand buttons! That night I was indeed a happy boy. Little by little my eyelids closed, and in spite of my efforts to keep awake, I was soon fast asleep. \n \n The next morning when I awoke, the first thing I saw was the beautiful coat hanging on the back of one of the chairs. I sprang out of bed and soon had it on. Never had I been so delighted with anything before. It was a little too long and a little too wide; but it was all the better for that surely? I grew very fast, and this coat must last a long, long time. Just over the shoulders the velvet was rather loose and puckered, and appeared somewhat like the wings of a swallow in shape. But that really made me look broader, and was therefore an improvement to my figure. The coat had been made considerably smaller, although it was still rather large for me; but the buttons of course could not be made smaller in proportion, and they therefore covered far more space than formerly in proportion to the velvet. I was however only the more delighted at this: they were so beautiful! \n \n My curiosity satisfied about the fit of my coat, I now thought of my dear mother, who I feared must have sat up half the night working, in order to give me pleasure. My heart was touched beyond measure at this thought, and I was filled with gratitude towards her. I took the coat in my arms and kissed it. I then went to find my mother that I might thank her. How happy she was at seeing my delight! and when I started off to college, she stood at the window that she might watch me walking down the street dressed in my gorgeous new jacket. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1958/56187.html","bookId":746,"book":{"id":746,"title":"Coward or Hero?","description":"简介： Now then! What is the matter? asked my father in a sharp tone, impatiently throwing down the newspaper....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1958","creation":"Aug 1, 2019 12:19:15 AM","modification":"Aug 1, 2019 12:19:15 AM"}}
