{"id":72681,"no":1,"title":"Page 1","content":"One\\n\\n “Norah? Is that you?” Valerie Bloomfield’s voice rose expectantly. She’d been trying to reach her sister for the past hour with no success.\\n\\n “Valerie, where are you?”\\n\\n “I’m on a layover in Chicago.” She glanced around the departure lounge and surveyed the other passengers. “How’s Dad?”\\n\\n Norah hesitated, and that slight pause sent Valerie’s worry escalating into panic. “Norah…” she began.\\n\\n “He’s doing as well as can be expected.”\\n\\n “Did you tell him I’m on my way?” Valerie had been in the middle of a business meeting in New York when she received the message. Her youngest sister had called the Houston office, and they’d passed on the news of her father’s heart attack. Valerie had left immediately, catching the first available flight. Unfortunately that meant going to Oregon via Chicago.\\n\\n “Dad knows you’re coming.”\\n\\n “Were you able to get hold of Steff?”\\n\\n Norah’s sigh signaled her frustration. “Yes, but it took forever and my Italian is nonexistent. She’s planning to catch whatever she can out of Rome, but she has to get there first—she’s in some little village right now. It might take her a couple of days. The connection was bad and I couldn’t understand everything she said. Apparently there’s some sort of transportation strike. But she’s doing her best….”\\n\\n Valerie’s sympathies went out to Stephanie, the middle Bloomfield sister. She must be frantic, stuck halfway across the world and desperate to find a way home.\\n\\n “When will you get here?” Norah asked anxiously.\\n\\n “The plane’s scheduled to land at six-ten.”\\n\\n “Do you want me to meet you? I could—”\\n\\n “No,” Valerie interrupted. She didn’t think it was a good idea for Norah to leave their father. “I’ve already ordered a car. It shouldn’t take me more than forty minutes once I land, so don’t worry about me.”\\n\\n “But the hospital’s an hour’s drive from the airport. You shouldn’t even try to make it in less.”\\n\\n It generally did take an hour, but Valerie had every intention of getting there a lot sooner. “I should be at the hospital somewhere around seven,” she said evasively.\\n\\n “I’ll see you then.” Norah sounded resigned.\\n\\n “Don’t worry, kid, everything’s going to be all right.”\\n\\n “Just be careful, will you?” Norah pleaded. “You being in an accident won’t help Dad any.”\\n\\n “I’ll be careful,” Valerie promised, smiling at her sister’s words. Trust Norah to take the practical approach. After a brief farewell, Valerie closed her cell phone and slipped it into her purse.\\n\\n Half an hour later, she boarded her plane. She’d only brought a carry-on bag, unwilling to waste precious time waiting for luggage to be unloaded. Shutting her eyes, she leaned back in her seat as the plane taxied down the runway.\\n\\n Her father was dying. Her dear father… His hold on life was precarious, and the burning need to get to him as quickly as possible drove her like nothing she’d ever experienced.\\n\\n She was exhausted but sleep was out of the question. Valerie bent down for her purse, rummaging through it until she found the antacid tablets. She popped one in her mouth and chewed it with a vengeance.\\n\\n No sooner had she swallowed the chalky tablet than she reached for a roll of the hard candies she always had with her. Four years earlier she’d quit smoking, and sucking on hard candy had helped her through the worst of the nicotine withdrawal. If she’d ever needed a cigarette, it was now. Her nerves were stretched to the breaking point.\\n\\n Please, she prayed, not her father, too. Valerie was only beginning to come to grips with her mother’s death. Grace Bloomfield had died of cancer almost four years ago, and the grief had shaken Valerie’s well-ordered life. She’d buried her anguish in work; the biggest strides in her career with CHIPS, a Texas-based computer software company, had come in the past few years. She’d quickly climbed up the corporate ladder, until she was the youngest executive on the management team.\\n\\n Her father had reacted similarly to Grace’s death. Working too many hours, driving himself too hard. Norah had tried to tell her, but Valerie hadn’t paid attention. She should’ve done something, anything, to get their father to slow down, to relax and enjoy life. He should have retired years before; he could be traveling, seeing exotic places, meeting with old friends and making new ones. In the years since her mother’s death, Valerie had convinced her father to leave Orchard Valley only once and that had been a two-week trip to Italy to visit Steffie.\\n\\n And now he was fighting for his life in a hospital.\\n\\n Valerie hadn’t said anything to him because…well, because they were so much alike. David Bloomfield was working out his grief the same way she was. Valerie couldn’t very well criticize him for something she was doing herself.\\n\\n Before she knew it, she’d chomped her way through two rolls of candy and another of antacid tablets.\\n\\n When the plane landed, Valerie was the first one off, scurrying with her bag down the concourse to the rental car agency. Within fifteen minutes, she was on the freeway heading east toward Orchard Valley.\\n\\n Heading toward home.\\n\\n Norah was right; it took Valerie longer than forty minutes to reach Orchard Valley Hospital. She got there in forty-five. She took the first available parking space, unconcerned about whether the rental car would be towed. What did concern her was seeing her father.\\n\\n Norah was standing in the hospital lobby when Valerie walked through the double glass doors. Her sister, looking drawn and pale, was visibly relieved by her presence. “Oh, Valerie,” she said, covering her mouth with one hand. “Oh, Valerie… I’m so glad you’re here.”\\n\\n “Dad?” Valerie’s throat closed up. If her cantankerous father had had the audacity to die before she arrived, she’d never forgive him. The thought made her realize how much this ordeal had drained her.\\n\\n “He’s resting comfortably…for now.”\\n\\n Valerie hugged her sister. Norah looked dreadful, her stylish shoulder-length blond hair brushed away from her face as if her hands had swept it behind her ears countless times. Her blue eyes, normally so clear and bright, were red-rimmed from tears and lack of sleep.\\n\\n Valerie hadn’t had much rest herself, but she was still running on adrenaline. She wouldn’t collapse until after she’d had a chance to see her father.\\n\\n “What exactly happened?” she asked as they hurried to the elevator. Their shoes made a sharp, clicking sound against the polished linoleum floor, a sound that reminded Valerie of similar visits a few years ago, when her mother was dying. She remembered similar nighttime walks down these silent corridors. She hadn’t been to this hospital since. The memories overwhelmed her now, tearing at the facade of her poise.\\n\\n “After dinner last night, Dad went out onto the porch,” Norah began, her voice quavering.\\n\\n As far back as Valerie could remember, after the evening meal her parents had adjourned for coffee to the sweeping front porch of their large colonial home. They’d sat together on the old wicker chairs, sometimes holding hands and whispering like teenagers. Valerie was never sure what they discussed, but she’d learned early on not to interrupt them. In the winters, they’d sat in front of the basalt fireplace in her father’s den, but during spring, summer and the early part of autumn, it was the porch.\\n\\n “I should’ve known something was wrong,” Norah continued. “Dad hasn’t sat on the porch much since Mom’s been gone. After dinner he goes right into his office and does his bookkeeping.”\\n\\n The guilt Valerie experienced was crushing. Norah had repeatedly told her how hard their father was working. She should have listened, should have demanded he hire an assistant, take a vacation, something. As the oldest, she felt responsible.\\n\\n His heart was weak and had been since a bout of rheumatic fever in his thirties. By all accounts he should’ve died then, but a young nurse’s devotion had pulled him through. The nurse was Grace Johnson, who became David’s wife, and Valerie, Stephanie and Norah’s mother.\\n\\n “I brought him a cup of coffee,” Norah went on, “and he looked up at me and smiled. He…he seemed to think I was Mom.”\\n\\n “Was he in terrible pain?”\\n\\n Norah bit her lower lip. “Yes, he must have been. He was so pale… Only he was too proud to admit it. I asked him what was wrong, but he wouldn’t answer. He just kept saying he was ready.”\\n\\n “Ready for what?”\\n\\n Norah glanced away. “Ready to die.”\\n\\n “Die!” Valerie cried. “That’s ridiculous! If there was ever a man who had something to live for, it’s Dad. Good grief, he’s worked hard all his life! Now, it’s time to reap the fruits of his labors, to enjoy his family, to travel, to—”\\n\\n “You don’t need to convince me,” Norah said quietly as they reached the third floor and stepped out of the elevator. The Coronary Care nurses’ station was directly in front of them. Norah walked to the counter.\\n\\n “Betty, would you tell Dr. Winston my sister’s arrived?”\\n\\n “Right away,” the other woman replied. She appeared to be gentle, compassionate—and practical. No-nonsense. Valerie recognized those traits because Betty shared them with Norah. And with their mother…\\n\\n Valerie had to suppress a sudden smile at the memory of her youngest sister lining up dolls in her bed and sticking thermometers in their mouths. She’d fussed over them like an anxious mother, bandaging their limbs and offering comfort and reassurance.\\n\\n Norah came by this temperament naturally, Valerie supposed, since their mother had been the same. Although she’d given up her hospital job when she married David Bloomfield, Grace continued to nurture those around her. It had been her gift. It was Norah’s gift, too.\\n\\n “Who’s Dr. Winston?” Valerie asked. She’d never heard of him before; he must be a recent addition to the hospital staff. But the last thing their father needed at a time like this was some hayseed family practitioner. He should be in a major hospital with the best heart surgeon available!\\n\\n “Dr. Winston’s been wonderful,” Norah returned, her eyes lighting up briefly. “If it hadn’t been for Colby, we would’ve lost Dad in the first twelve hours.”\\n\\n “Colby?” The doctor was named after a cheese? This didn’t sound promising.\\n\\n “I don’t know what I would’ve done without him,” Norah said. “I wasn’t sure what to do at first. I could tell Dad was in a lot of pain, but I knew he’d object if I called for an aid car. He’d argue with me and that would’ve made matters even worse if it was his heart like I suspected.”\\n\\n “So you phoned Dr. Winston?”\\n\\n “Yes. Luckily I was able to get hold of him, and he drove out, pretending to drop in out of the blue. He knew the minute he saw Dad that it was a heart attack. He immediately gave him a couple of aspirin. Then he sat down on the porch and had a cup of coffee with him.” \\n\\n","sourceLink":"https://allnovel.net/orchard-valley-grooms-orchard-valley-0/page-1.html","bookId":1979,"book":{"id":1979,"title":"Orchard Valley Grooms (Orchard Valley #0)","description":"Storyline: Orchard Valley Grooms: Valerie\\Stephanie (Orchard Valley #1-2) \\n Valerie rushes home to Orchard Valley, Oregon, when her father, David, suffers a heart attack. She and her two younger sisters, Stephanie and Norah, are gathering at his side, praying he\u0027ll live, fearing he\u0027ll die\u0026hellip;. \\n At a time like this, falling in love is the last thing on Valerie\u0027s mind. And with Dr. Colby Winston, of all people! He\u0027s David\u0027s heart surgeon, a renowned specialist who enjoys small-town living, while Valerie is a high-powered businesswoman who prefers city life. They\u0027re complete opposites in every way. Yet David keeps insisting she and Colby are a perfect couple. \\n Meanwhile Stephanie has other worries besides her father\u0027s health. She\u0027d fled Orchard Valley three years earlier after her humiliating rejection by local journalist Charles Tomaselli. Now she\u0027s home, and it\u0027s not long before they begin reliving past battles\u0026mdash;and renewing old feelings. He was the reason she left. This time, will he give her a reason to stay? David seems to think so\u0026hellip;.\\n","cover":"https://allnovel.net/images/orchard-valley-grooms-orchard-valley-0.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/orchard-valley-grooms-orchard-valley-0.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:24:24 AM"}}
