{"id":72694,"no":14,"title":"Page 14","content":"“So I heard,” her father answered. “I saw Colby earlier.”\n Valerie watched his expression, hoping for—what?—some sign, some indication of her father’s thoughts. And of Colby’s…\n There was none.\n “Well? What did the good doctor have to say?”\n “Nothing much.”\n “Did he mention me?” she couldn’t prevent herself from asking.\n “Nope, can’t say he did. Does that disappoint you?”\n “Of course not.”\n “Is there any reason he should mention you?”\n Valerie was sorry she’d brought up the subject. “Not that I know of.”\n Her answers seemed to make him smile. “So you like my doctor?”\n “He’s been wonderful to you,” Valerie said.\n “I wasn’t talking about me,” David told her gruffly. “I’m referring to you. You’re attracted to him, aren’t you, Valerie? You were never very good at hiding your feelings.”\n “I’ve never met a man who appeals to me more,” Valerie said truthfully. There was no point in trying to deceive her father. He knew her all too well, and he understood her better than anyone, sometimes better than she understood herself.\n “He feels the same way?” The question was calm, as though he were speaking to a child.\n Valerie lowered her eyes before shaking her head. “It’d never work, and we both know it.”\n She expected an argument from her father, was even looking for one. She wanted him to tell her she was wrong, that love could work when two people were committed to each other. That it wouldn’t matter how dissimilar they were, how differently they viewed life. That nothing mattered but the love they shared…\n Her father, however, didn’t respond.\n Discouraged, Valerie said goodbye and returned to the waiting room. On her way, she saw that Norah sat talking to another doctor at the end of the hallway. She was grateful her sister had left, because she needed time alone to think.\n If she wanted evidence that people with very different personalities could fall in love and make the relationship work, she need look no further than her own parents. The story of how they’d met and fallen in love was like a fairy tale, one that, as a child, she’d never tired of hearing.\n Her father had gone to university and obtained his degree in business administration. Armed with his dreams, he’d built a financial empire and became a millionaire within a few years. Then he’d collapsed with rheumatic fever, nearly losing his life. While he was in the hospital recuperating, he’d met a young nurse. David knew the moment he met Grace Johnson that he was going to love her. It never occurred to him that she’d refuse his marriage proposal.\n Several months of relentless pursuit later, he’d convinced Grace to marry him. Despite the fact that she was deeply in love with David, Grace had been afraid. She was a preacher’s daughter who’d lived a simple life. David was a business tycoon who’d taken automation technology to new industry heights. Grace’s fears about a marriage to David Bloomfield were warranted. But over the years, love had proven even the most hardened skeptics wrong, and the two had lived and loved together until her mother’s death a few years before.\n Her own romance wasn’t going to have a fairy-tale ending, the way her parents’ had. Her father knew it, too, otherwise he would’ve been the first to encourage her.\n Her father, however, had said nothing.\n Valerie was working in the den on her laptop, putting files in order, when she saw the red car hurtle down the driveway. She thought, for one hopeful moment, that it might be Colby, but then remembered he drove a maroon Buick. Still, she hastened to answer the door.\n It was Charles Tomaselli, looking tired and frustrated.\n “Have you heard from Stephanie?” he demanded without so much as a greeting.\n Her sister’s absence had been weighing on Valerie’s mind, too. She’d done everything she could think of; she’d even placed a call to the American Embassy in Rome, with no results.\n “I haven’t heard a word. I don’t know what could’ve happened to her.”\n “How late is she?”\n Valerie had to think for a moment. In the past week, she’d lost all track of time. “Norah was the last person to speak to Steffie,” she explained. “Let me see—that was just before Dad’s surgery. Steffie thought she’d be home within twenty-four hours.”\n “That was forty-eight hours ago.”\n He didn’t need to remind her, Valerie thought irritably. “She’s coming by way of Tokyo.”\n “Tokyo? She’s flying to Oregon via Japan?” Charles snapped.\n “I gather she didn’t have much choice.”\n “Don’t you think you should be making some inquiries?” he asked gruffly.\n “I already have. Tell me who else I should call and I’ll be happy to do so.”\n Charles settled down on the top porch step, resting both elbows on his knees. “I have to tell you, Valerie, I’m worried. She should’ve been here before now.”\n “I know.”\n “I have some friends, some connections,” Charles said absently, “and I’ve checked with them. But they can’t find any trace of her on the flights scheduled out of Rome. If she isn’t here by tomorrow afternoon, I don’t think you have any alternative but to contact the authorities.”\n Valerie swallowed tightly, then nodded. She could slap Steff silly for putting them through all this worry.\n “She’s okay, Charles,” Valerie said after a moment.\n “What makes you so sure?” He turned to look up at her.\n “I…don’t know, I just am.”\n Charles stood agilely, his gaze leveled on the long narrow driveway that led in from the road. “I hope you’re right, Valerie. I hope you’re right.”\n Valerie hoped so, too. And she wondered if his concern for Stephanie meant as much as she thought it did.\n Norah came back from the hospital a half hour later, talkative and lively. “I can’t get over how much Dad’s improved in such a short time.”\n Valerie took the shrimp salad she’d prepared for their dinner from the refrigerator. Salads were her specialty. That, and folding napkins. She could do both without a hitch.\n For the first time since her arrival, Valerie had spent most of the day away from the hospital. When her father had suggested she leave, she’d initially felt a bit annoyed. But as she revisited the life that had once been hers in this quiet community, she accepted the wisdom of his advice. She had needed to get out, to breathe in the serenity she found in Orchard Valley and exhale the fear that had choked her from the moment she’d received Norah’s frantic message. Then, after her walk, she’d come back to the house, and because she’d never been idle in her life, she’d set up a communications center in her father’s den.\n “I’m going back to work, starting tomorrow,” Norah announced between bites of lettuce, shrimp and slices of hard-boiled egg. “The hospital’s understaffed, but then when isn’t it? I’ll still be able to see Dad, maybe even more often than before. You don’t mind, do you?”\n “Of course I don’t mind. You do whatever you think best.”\n “You’re not going to leave, are you?” Norah asked, rushing the words. “I wouldn’t do this if the hospital didn’t need me so badly.”\n “I realize that.”\n Norah took another forkful of salad. “You’re quiet tonight. Is anything wrong?”\n “Not really.” She didn’t want to worry Norah about Steffie’s disappearance.\n “Colby asked about you.”\n She felt her stomach churn with contradictory emotions. Part of her was thrilled that he’d even mentioned her, yet she experienced a growing sense of apprehension.\n “He wanted to know where you were.”\n “Did you tell him?”\n “Of course,” Norah answered blithely. “He said he thought it was a good idea for you to get out of the hospital more. You’ve practically been living there ever since you arrived.” She slowly chewed another bite of her salad. “He asked me what I knew about Rowdy Cassidy,” she said.\n Valerie put down her fork, her appetite having fled. “What did you tell him?”\n “The truth. That I’ve never met the man, but Dad seems to think he’s wonderful. You probably weren’t aware of this, but Dad’s been following CHIPS ever since you started working there. He thinks Rowdy’s a genius. Funny, though—I got the impression that wasn’t what Colby wanted to hear.”\n “The shrimp was on sale at Vern’s Market,” Valerie said, changing the subject abruptly, not wanting to talk about Colby. Not now when she felt so vulnerable, so conscious of the attraction between them. “Vern said he cooked it himself this morning.”\n “You don’t want to talk about Colby?”\n Valerie grinned. Her sister hadn’t graduated magna cum laude for nothing.\n “You’re not going anyplace tonight, are you?” Norah asked next.\n “I thought I’d drive in to the hospital and visit Dad, but other than that, no. Do you need me to do something?”\n Norah shrugged. “I may be wrong, but I think Colby wanted to talk to you. I have a feeling he might call.”\n Norah was right.\n When Valerie returned from her trip to the hospital, her sister had left a note taped to her bedroom door.\n COLBY PHONED. SAID HE’D TALK TO YOU IN THE MORNING.\n Valerie read the message with mixed feelings. Thrill and dread went at it for round two, again evenly matched. She determined to forget everything—love, Colby, the future—for tonight. The morning would be soon enough to resume her worries. She craved the forgetfulness of sleep, the escape from thought and feeling.\n Valerie had assumed she’d fall asleep with the same ease she had the previous night. For a solid hour she beat her pillow, tossed and turned in an effort to find a comfortable position. Finally giving up, she reached for the light on the bedside table and read until her eyes closed and the business journal slipped from her fingers.\n But Valerie’s exhausted sleep wasn’t the restful oblivion she’d longed for. Colby wandered into her dreams like an uninvited guest.\n He looked handsome, dressed in the suit he’d worn the night he’d taken her to the Italian restaurant.\n “You’re not going to be able to forget me, are you?”\n In her dream, Valerie said nothing, but only because she had no argument. She merely stared at him, adoring every feature, every movement.\n A noise disturbed her, distracting her from Colby. Irritated, she looked over her shoulder to see what it was and when she looked back, he was gone. She cried out in frustration, the sound of her own voice jerking her awake. She was sitting upright in the bed, heart pounding furiously.\n It took her another moment to realize there was some sort of commotion going on downstairs. She climbed out of bed and grabbed her robe.\n From the top of the stairs, she saw Norah, laughing and crying at once. A battered suitcase stood on the floor, along with a leather coat and an umbrella. \n","sourceLink":"https://allnovel.net/orchard-valley-grooms-orchard-valley-0/page-14.html","bookId":1979,"book":{"id":1979,"title":"Orchard Valley Grooms (Orchard Valley #0)","description":"Storyline: \n Orchard Valley Grooms: Valerie\\Stephanie (Orchard Valley #1-2) \n Valerie rushes home to Orchard Valley, Oregon, when her father, David, suffers a heart attack. She and her two younger sisters, Stephanie and Norah, are gathering at his side, praying he\u0027ll live, fearing he\u0027ll die\u0026hellip;. \n At a time like this, falling in love is the last thing on Valerie\u0027s mind. And with Dr. Colby Winston, of all people! He\u0027s David\u0027s heart surgeon, a renowned specialist who enjoys small-town living, while Valerie is a high-powered businesswoman who prefers city life. They\u0027re complete opposites in every way. Yet David keeps insisting she and Colby are a perfect couple. \n Meanwhile Stephanie has other worries besides her father\u0027s health. She\u0027d fled Orchard Valley three years earlier after her humiliating rejection by local journalist Charles Tomaselli. Now she\u0027s home, and it\u0027s not long before they begin reliving past battles\u0026mdash;and renewing old feelings. He was the reason she left. This time, will he give her a reason to stay? David seems to think so\u0026hellip;.\n \n","cover":"https://allnovel.net/images/orchard-valley-grooms-orchard-valley-0.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/orchard-valley-grooms-orchard-valley-0.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:24:24 AM"}}
