{"id":72705,"no":25,"title":"Page 25","content":"“But he…” Valerie began when Norah hesitated.\\n\\n “He what?” Steffie prompted. Although she was thrilled with the news that her father had survived the crisis, she couldn’t help wondering why both her sisters seemed reluctant to continue. “Tell me,” she insisted. She didn’t want to be protected from the truth.\\n\\n “Apparently Dad had a near-death experience,” Norah finally said.\\n\\n “Isn’t that fairly common? Especially during that kind of surgery? I’ve been reading for years about people who believe they traveled through a dark tunnel into the light.”\\n\\n “I wouldn’t know how common it is to talk to someone in the spirit world, would you?” Valerie snapped.\\n\\n “Dad claims he talked to Mom.” Once again it was Norah who supplied the information.\\n\\n “To Mom?” Steffie felt numb, unsure of how to react.\\n\\n “Which we all know is impossible.” Valerie hurried barefoot across the kitchen floor to pour boiling water into the teapot. She placed three mugs, three spoons and the sugar bowl on a tray; when the tea had steeped, she filled the cups, obviously preoccupied with her task. Carrying the tray to the table, she served her sisters, then leaped up to get a plate of Norah’s home-baked cookies. “I think Dad needs to talk to a counselor,” she said abruptly.\\n\\n “Valerie.” Norah sighed as though this was a well-worn argument. “You’re overreacting.”\\n\\n “You would, too, if Dad was saying to you the things he says to me.” Valerie stirred her tea without looking up.\\n\\n Norah sighed again. “Dad honestly believes he spoke to Mom and if it makes him feel better, then I don’t think we should try to discount his experience.”\\n\\n “What was Mom supposed to have said to him?” Steffie asked, intrigued by the interplay between her two sisters. She helped herself to a couple of oatmeal cookies as she spoke.\\n\\n “That’s what worries me the most.” Valerie raised her voice, clearly unsettled. “He’s got some ridiculous notion that we’re all going to marry.”\\n\\n “Now, that’s profound.” Steffie couldn’t hide her amusement. The three of them were of marriageable age; it made sense that they’d eventually find husbands.\\n\\n “But he claims to know who we’re going to marry,” Norah said, grinning sheepishly, as though she found the whole thing amusing.\\n\\n “He’s been wearing this silly smile for two days.” Valerie groaned, dropping her forehead onto her arms. “He’s been talking about a houseful of grandchildren, too. The ones we’re supposed to present him with—and all in the next few years. If it wasn’t so ludicrous, I’d cry.”\\n\\n “Has he said who I’m supposed to marry?” Steffie asked, curiosity getting the better of her.\\n\\n Valerie lifted her head to glare at Stephanie, and Norah chuckled. “That’s something else that irritates Valerie,” she explained. “Dad hasn’t told any of us, at least not directly. Not yet.”\\n\\n “He’s acting like he knows this wonderful secret and he’s keeping it all to himself, dropping hints every now and then. I swear it’s driving me crazy.”\\n\\n “I don’t mind it,” Norah said. To someone else, she might have sounded self-righteous, but Steffie recognized her younger sister’s compassion and knew that it edged out any hint of righteousness. “Dad’s smiling again. He’s excited about the future and even if he’s becoming a bit…presumptuous about the three of us, I honestly can’t say I mind. I’m just so glad to have him alive.”\\n\\n Valerie nodded, her argument apparently gone. “I guess I can put up with a few remarks, too.”\\n\\n “This is the first time one of us hasn’t stayed all night at the hospital,” Norah said, her mouth curving into a gentle smile. “Dr. Winston insisted there wasn’t any need. Not anymore.”\\n\\n “Don’t be fooled by that guy,” Valerie muttered under her breath. “He may look like your average, laid-back country doctor, but he’s got a backbone of steel.”\\n\\n He must have, if Valerie was reacting like this, Stephanie thought with sudden interest. It seemed that her sister had finally encountered a will as strong as her own. So, either Valerie had changed her ways or she had—could it be?—a soft spot for this Dr. Winston.\\n\\n “In other words,” Steffie said quickly, “I missed the worst of it. Dad’s out of danger now and will eventually recover?”\\n\\n “Yes,” Norah said cheerfully. “Everything’ll be back to normal.”\\n\\n “Not exactly.” Valerie shook her head. “In a few weeks Dad will be the picture of health, but the three of us will be pulling out our hair after listening to all his talk about marriage, husbands and grandchildren!”\\n\\n Bright sunlight poured through the open window of Steffie’s bedroom when she woke. The house was quiet, but the sounds of the day drifted in from outside. Birds chirped merrily in the distance and a spring breeze set the chimes on the back porch tinkling and rustled the curtains lightly. She could hear work crews in the orchard—spraying the apple trees, Steffie guessed.\\n\\n After those long days of struggling to get home, she exulted in the sensation of familiarity, wrapping the feel of it around her like a warm quilt. The crisis had passed. Her father would survive, and all the world seemed brighter, sweeter, happier.\\n\\n Reluctantly she slid out of bed and dressed, pulling a pair of slacks and a light sweater from her suitcase.\\n\\n She found a note on the kitchen table explaining that both Valerie and Norah were at the hospital. They were going to leave her arrival a surprise, so she could come anytime she was ready. No need to rush. Not anymore.\\n\\n Selecting a banana from the fruit bowl on the kitchen counter, she ate that while reheating a cup of coffee in the microwave. As the timer was counting down the seconds, she walked into her father’s den and reached for the newspaper, intending to take it with her to the hospital.\\n\\n She would read it, Steffie decided, to catch up on the local news. But even as she formed this thought, she knew she was lying to herself.\\n\\n There was only one reason she was taking the local newspaper with her. Only one reason she’d even picked it up. Charles Tomaselli. She turned to the front page. The Orchard Valley Clarion. She allowed her eyes to skim the headlines for a moment.\\n\\n Emotion came at her in waves. First apprehension. She’d give anything to avoid seeing Charles again. Then anger. He’d humiliated her. Laughed at her. She’d never forgive him for that. Never. The agony of his humiliation smoldered even now, years later. Yet, much as she wanted to hate Charles, she couldn’t. She didn’t love him anymore. That was over, finished. He’d cured her of love in the most effective way possible. No, she reassured herself, she didn’t love him—but she couldn’t make herself hate him, either.\\n\\n She could handle this. She had to. Besides, he was probably as eager to avoid any encounters between them as she was.\\n\\n She gulped down half the steaming coffee. Then she tucked the paper under her arm and grabbed the car keys Norah had thoughtfully left on the kitchen table and headed out the door.\\n\\n When she got to Orchard Valley General, Steffie paused, taken aback by a sudden rush of grief. The last time she’d gone through those doors had been the day her mother died. Steffie’s heart stilled at the nearly overwhelming sadness she felt. She hadn’t expected that. It took her a couple of minutes to compose herself. Then she continued toward the elevator.\\n\\n When she arrived at the waiting room, she found Norah speaking to one of the nurses, while Valerie sat reading. It was so unusual to see her older sister doing anything sedentary that Stephanie nearly did a double take.\\n\\n “Steffie!” Norah said, her face lighting when she saw her sister. “Did you get enough sleep?”\\n\\n “I’m fine.” That was true, although it would take more than one night’s rest to recuperate from the past week.\\n\\n “Did you fix yourself some breakfast?”\\n\\n “Yes, little mother, I did. Can I see Dad now or is there anything else you’d like to ask me?” She slipped an arm around her sister’s trim waist, feeling elated. It was wonderful to be home, wonderful to be with her family.\\n\\n “You’re here,” Valerie said, joining them. “Dad asked me earlier when we’d last heard from you. I told him this morning.”\\n\\n “He’s going to be moved out of the Surgical Intensive Care Unit tomorrow,” Norah said happily. “Then we’ll all be able to see him at once. As it is now, only one of us can visit at a time.”\\n\\n “Norah, would you like me to take your sister in to see your father?” Another nurse had bustled up to them.\\n\\n “Please,” Steffie answered eagerly before Norah could speak. The nurse led her through a hallway with glass-walled cubicles. Every imaginable sort of medical equipment seemed to be in use here, but Steffie barely noticed. She was far too excited about seeing her father. The nurse stopped at one of the cubicles and gestured Stephanie inside.\\n\\n He was sitting up in bed. He smiled and held out his arms to her. “Steffie,” he said faintly, “come here, Princess.” She saw that he was connected to several monitoring devices.\\n\\n She walked into his hold, careful to stay clear of the wires and tubes, astonished at his weak embrace after the bone-crushing hugs she was accustomed to receiving. Her sisters had said the spark was back in his eyes. They’d talked about how well he looked.\\n\\n Stephanie disagreed.\\n\\n She was shocked by his paleness, by the gauntness of his appearance. If he was so much better now, she hated to think what he must have looked like a week ago.\\n\\n “It’s so good to see you,” her father said, his voice cracking with emotion. “I’ve missed you, Princess.”\\n\\n “I’ve missed you, too,” Steffie said, wiping a tear from the corner of her eye as she straightened.\\n\\n “You’re home to stay?”\\n\\n Steffie wasn’t sure how to answer. Home represented so much to her, much more than she’d realized, but she loved Italy, too. Still, just gazing out on the orchards this morning had reminded her how much she’d missed her life in Orchard Valley.\\n\\n She’d left bruised and vulnerable; she’d returned strong and sure of herself. Being in Italy had helped her heal. But there was no longer any reason to stay away. She was ready to come home.\\n\\n She’d been trying to decide what to do next when she’d received word of her father’s heart attack. Her courses were completed, but remaining in Italy had a strong appeal. She could travel for a while, continue her studies, perhaps do some teaching herself. She could move to some place like Boston or New York. Or she could return to Orchard Valley. Steffie hadn’t known what she wanted.\\n\\n “I’m home for as long as you need me.”\\n\\n “You’ll stay,” her father insisted with unshakable confidence.\\n\\n “What makes you so sure?”\\n\\n He smiled mysteriously and his voice dropped to a whisper. “Your mother told me.”\\n\\n “Mom?” Steffie was beginning to appreciate Valerie’s concerns. \\n\\n","sourceLink":"https://allnovel.net/orchard-valley-grooms-orchard-valley-0/page-25.html","bookId":1979,"book":{"id":1979,"title":"Orchard Valley Grooms (Orchard Valley #0)","description":"Storyline: Orchard Valley Grooms: Valerie\\Stephanie (Orchard Valley #1-2) \\n Valerie rushes home to Orchard Valley, Oregon, when her father, David, suffers a heart attack. She and her two younger sisters, Stephanie and Norah, are gathering at his side, praying he\u0027ll live, fearing he\u0027ll die\u0026hellip;. \\n At a time like this, falling in love is the last thing on Valerie\u0027s mind. And with Dr. Colby Winston, of all people! He\u0027s David\u0027s heart surgeon, a renowned specialist who enjoys small-town living, while Valerie is a high-powered businesswoman who prefers city life. They\u0027re complete opposites in every way. Yet David keeps insisting she and Colby are a perfect couple. \\n Meanwhile Stephanie has other worries besides her father\u0027s health. She\u0027d fled Orchard Valley three years earlier after her humiliating rejection by local journalist Charles Tomaselli. Now she\u0027s home, and it\u0027s not long before they begin reliving past battles\u0026mdash;and renewing old feelings. He was the reason she left. This time, will he give her a reason to stay? David seems to think so\u0026hellip;.\\n","cover":"https://allnovel.net/images/orchard-valley-grooms-orchard-valley-0.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/orchard-valley-grooms-orchard-valley-0.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:24:24 AM"}}
