{"id":72719,"no":39,"title":"Page 39","content":"A husband. Her mind stumbled over the word. There’d only ever been one man she could imagine as her husband, and that was Charles. Even though Steffie knew it was unwise, she’d started dreaming again. She found herself fantasizing what her life would be like if she was married…to Charles. She wanted to blame her sisters for putting such thoughts in her head, but she couldn’t. Those dreams and fantasies had been there for years. The problem was that she couldn’t suppress them anymore. An hour later, at the same moment as Steffie and Valerie were leaving the flower shop, Charles happened to step out of the Clarion office. Steffie instinctively looked across the street, where he was walking with Wendy, deep in conversation. Something must have told him she was there because he glanced in her direction. He grinned warmly. Steffie relaxed and waved. He returned the gesture, then spoke to Wendy before jogging across the street to join Steffie and her sister. “Hello,” he said, but his eyes lingered on Steffie. He barely seemed to notice Valerie’s presence. “Hi.” It was ridiculous to feel so shy with him. “I’d have stopped in to say hello, but I knew you’d be busy.” “I’m never too busy for you.” His eyes were affectionate and welcoming. “See,” Valerie hissed close to Steffie’s ear. Then, more loudly, “I’ve got a couple of errands to run, if you two would like a chance to talk.” Charles checked his watch. “Come back to the office with me?” “Sure.” If he’d suggested they stand on their heads in the middle of Main Street, Steffie would have willingly agreed. Valerie cast a quick glance at the clock tower. “How about if I meet you back at the car in—” “Half an hour,” Charles supplied, reaching for Steffie’s hand. “There’s something I’d like to show you,” he told her. “Fine, I’ll see you then, Steff,” Valerie said cheerfully. She set off at a brisk walk, without looking back. Their fingers entwined, Charles led Steffie across the street to the newspaper office. “I was going to save this for later, but now’s as good a time as any.” He ushered her in and guided her down the center aisle, past the obviously busy staff, to his desk. Steffie wasn’t sure what to expect, but a mock-up of the Clarion’s second page wasn’t it. As far as she could see, it was the same as any other inside page she’d read over the years. “Clearly I’m missing something,” she said after a moment. “Is the type different?” “Nope, we’ve used the same fonts as always.” He crossed his arms and leaned against the desk, looking exceptionally pleased with himself. “How about a hint?” she asked, a bit puzzled. “I might suggest you read the masthead,” he said next, his dark eyes gleaming. “The masthead,” she repeated as she scanned the listings of the newspaper’s personnel and the duties they performed. “All right, I will. Charles Tomaselli, editor and publisher. Roger Simons—” “Stop right there,” he said, holding up his hand. “Publisher,” she said again. “That’s new. What exactly does it mean?” His smile could have lit up a Christmas tree. “It means, my beautiful Stephanie, that I now own the Orchard Valley Clarion.” “Charles, that’s wonderful!” She resisted the urge to throw her arms around him, but it was difficult. “My dream’s got a mortgage attached,” he told her wryly. “A lot of folks think I’m an idiot to risk so much of my future on a medium that’s said to be dying. Newspapers are folding all over the country.” “The Clarion won’t.” “Not if I can help it.” Her heart seemed to spill over with joy. She knew how much Charles loved his work, how committed he was to the community. “I’m so excited about this.” “Me, too,” he said, his smile boyishly proud. “I’d say this calls for a celebration, wouldn’t you?” “Most definitely.” “Dinner?” She nodded eagerly and they set the date for Thursday evening, deciding on a restaurant that overlooked the Columbia River Gorge, about an hour’s drive north. Steffie felt as if her feet didn’t touch the pavement as she hurried across the street thirty minutes later to meet her sister. Never, in all the time she’d known Charles, had she seen him happier. And she was happy with him, and for him. That was what loving someone meant. It was a truth she hadn’t really understood before, not until today. This intense new feeling had taught her that real love wasn’t prideful or selfish. Real love meant sharing the happiness—and the sorrows—of the person you loved. Yes, she understood that now. She realized that her past obsession with Charles had focused more on her own desires than on his. Her love had matured. Charles had wakened within her emotions she hadn’t known it was possible to experience. Emotions—and sensations. When she was with him, especially when he kissed her, she felt vibrant and alive. “You look like you’re about to cry, you’re so happy,” Valerie said when Steffie joined her in the car. “I don’t suppose Charles popped the question.” “No,” she said with a sigh. “But he asked me to dinner to help him celebrate. Guess what? Charles is the new owner of the Clarion.” Valerie didn’t seem nearly as excited as Steffie. “He’s going to be working a lot of extra hours then, isn’t he?” “He didn’t say.” If he spent as much time at the newspaper as he had three years earlier, there wouldn’t be any extra hours left. “I suppose his eating habits are atrocious.” Steffie suspected they were, but she shrugged. “I wouldn’t know.” “I bet he’d enjoy a home-cooked meal every now and then, don’t you?” Steffie eyed her sister suspiciously. “Is there a point to this conversation?” “Of course,” she answered with a sly grin. “I think you should heat up some of that fabulous spaghetti sauce and take it to him later. You know what they say about the way to a man’s heart, don’t you?” “Funny, that sounds exactly like a suggestion of Dad’s. What’s your interest in this?” “Well,” Valerie said coyly, “that way I wouldn’t feel guilty about asking you if I could take some to Colby’s. If he tasted your spaghetti sauce and happened to assume, through no error of mine, that I’d cooked this fabulous dinner—” she paused to inhale deeply “—he’d be so overcome by the idea of marrying such a fabulous cook that he’d go over the wedding list with me and not put it off for the third time.” “There’s method in your madness, Valerie Bloomfield.” “Naturally. Colby doesn’t know that I can’t tell one side of a cookie sheet from the other. I don’t want to disillusion him quite so soon. He suggested I make dinner tonight and, well, you get the picture.” “I do indeed. I’ll be happy to share the spaghetti sauce with you.” “I’ll hang around the kitchen to be sure some of the aroma sticks to me.” “I’ll give you the recipe if you want.” “I want, but if I have trouble cooking with a microwave, heaven only knows what I’ll do once I’m around a stove. One with burners and a real oven.” Steffie chuckled. She certainly had no objection to helping her sister prepare dinner for Colby, but she wasn’t sure taking a plate over to Charles’s house was such a good plan. Valerie and Norah convinced her otherwise. “Charles never did get to sample your cooking,” Norah reminded her. “He stopped by and you offered him dinner, but he’d already eaten. Remember?” “How’d you know that?” Norah looked mildly surprised, as though everyone must be aware of what went on between Steffie and Charles. “Dad told me.” Her dear, matchmaking father. Steffie should have known. “It isn’t going to hurt anything,” Valerie reminded her. “If you want, you can ride into town with me. I’ll go over to Charles’s house with you and we can drop off the meal, then I’ll drive you home.” Steffie still wasn’t sure, but Norah and Valerie believed it was a romantic thing to do. They both seemed to think Charles was serious about their relationship. As for Steffie, she didn’t know what to think anymore. In fact, she preferred not to think about their relationship at all. And yet… She remained hesitant about this project of delivering him a surprise dinner but Valerie and Norah were so certain it would be a success that she went ahead with it. They were apparently right. She’d found his door open—that hadn’t changed, she thought with a twinge of embarrassment—and had left a container of the sauce, some noodles with instructions and a couple of last-minute extras on his kitchen table. Steffie was propped up in her bed reading a new mystery novel at ten-thirty that night. Her bedroom window was open and a breeze whispered through the orchard. The house was quiet; her father had gone to bed an hour earlier, and her sisters were both out for the evening. When the phone chimed, she answered on the first ring, not wanting it to wake her father. “How’d you do it?” Charles asked, sounding thoroughly delighted. “I came home exhausted and hungry, thinking I was going to have to throw something in the microwave for dinner. The minute I walked into the house, I smelled this heavenly scent of basil and garlic. I followed my nose to the table and found your note.” “You should thank Valerie and Norah. The whole thing was their idea.” Had he been furious, Steffie would gladly have shifted the blame, so she figured it was only right to share the credit. “I haven’t tasted spaghetti that good since my grandmother died. I’d forgotten how delicious homemade sauce can be.” Steffie was warmed by the compliment. “I’m glad you enjoyed it.” “Enjoyed it! You have no idea. It was like stepping back into my childhood to spend the evening with my grandmother. She was a fabulous cook, and so are you.” Steffie leaned against the heap of pillows and closed her eyes, savoring these precious moments. “The bottle of red wine and the small loaf of French bread were a nice touch,” he told her. “I’m glad,” she said again. A dozen unnamed emotions whirled inside her. “I wish you didn’t live so far out of town,” Charles said next. “Otherwise I’d come over right now—to thank you.” “I wish I didn’t live so far out, too.” “Since we’re both making wishes, there are a few other things I’d like, as well,” he added in tones as smooth as velvet. “You’re limited to three.” How raspy her own voice sounded. Charles chuckled. “Only three? What happens if I want four?”","sourceLink":"https://allnovel.net/orchard-valley-grooms-orchard-valley-0/page-39.html","bookId":1979,"book":{"id":1979,"title":"Orchard Valley Grooms (Orchard Valley #0)","description":"Storyline: Orchard Valley Grooms: Valerie\\Stephanie (Orchard Valley #1-2) Valerie rushes home to Orchard Valley, Oregon, when her father, David, suffers a heart attack. She and her two younger sisters, Stephanie and Norah, are gathering at his side, praying he\u0027ll live, fearing he\u0027ll die\u0026hellip;. At a time like this, falling in love is the last thing on Valerie\u0027s mind. And with Dr. Colby Winston, of all people! He\u0027s David\u0027s heart surgeon, a renowned specialist who enjoys small-town living, while Valerie is a high-powered businesswoman who prefers city life. They\u0027re complete opposites in every way. Yet David keeps insisting she and Colby are a perfect couple. Meanwhile Stephanie has other worries besides her father\u0027s health. She\u0027d fled Orchard Valley three years earlier after her humiliating rejection by local journalist Charles Tomaselli. Now she\u0027s home, and it\u0027s not long before they begin reliving past battles\u0026mdash;and renewing old feelings. He was the reason she left. This time, will he give her a reason to stay? David seems to think so\u0026hellip;.","cover":"https://allnovel.net/images/orchard-valley-grooms-orchard-valley-0.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/orchard-valley-grooms-orchard-valley-0.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:24:24 AM"}}
