{"id":96981,"no":22,"title":"Page 22","content":"\"Don\u0027t you understand?\" she demanded. \"My vision\u0027s incomplete, just fragments. It flickers and jumps. I have to remember the future. Can\u0027t you see that?\"\\n\\n \"What is the future if you die?\" he asked, forcing her gently into the Family chambers.\\n\\n \"Words... words,\" she muttered. \"I can\u0027t explain it. One thing is the occasion of another thing, but there\u0027s no cause... no effect. We can\u0027t leave the universe as it was. Try as we may, there\u0027s a gap.\"\\n\\n \"Stretch out here,\" he commanded.\\n\\n He is so dense! she thought.\\n\\n Cool shadows enveloped her. She felt her own muscles crawling like worms - a firm bed that she knew to be insubstantial. Only space was permanent. Nothing else had substance. The bed flowed with many bodies, all of them her own. Time became a multiple sensation, overloaded. It presented no single reaction for her to abstract. It was Time. It moved. The whole universe slipped backward, forward, sideways.\\n\\n \"It has no thing-aspect,\" she explained. \"You can\u0027t get under it or around it. There\u0027s no place to get leverage.\"\\n\\n There came a fluttering of people all around her. Many someones held her left hand. She looked at her own moving flesh, followed a twining arm out to a fluid mask of face: Duncan Idaho! His eyes were... wrong, but it was Duncan - child-man-adolescent-child-man-adolescent... Every line of his features betrayed concern for her.\\n\\n \"Duncan, don\u0027t be afraid,\" she whispered.\\n\\n He squeezed her hand, nodded. \"Be still,\" he said.\\n\\n And he thought: She must not die! She must not! No Atreides woman can die! He shook his head sharply. Such thoughts defied mentat logic. Death was a necessity that life might continue.\\n\\n The ghola loves me, Alia thought.\\n\\n The thought became bedrock to which she might cling. He was a familiar face with a solid room behind him. She recognized one of the bedrooms in Paul\u0027s suite.\\n\\n A fixed, immutable person did something with a tube in her throat. She fought against retching.\\n\\n \"We got her in time,\" a voice said, and she recognized the tones of a Family medic. \"You should\u0027ve called me sooner.\" There was suspicion in the medic\u0027s voice. She felt the tube slide out of her throat - a snake, a shimmering cord.\\n\\n \"The slapshot will make her sleep,\" the medic said. \"I\u0027ll send one of her attendants to -\"\\n\\n \"I will stay with her,\" the ghola said.\\n\\n \"That is not seemly!\" the medic snapped.\\n\\n \"Stay... Duncan,\" Alia whispered.\\n\\n He stroked her hand to tell her he\u0027d heard.\\n\\n \"M\u0027Lady,\" the medic said, \"it\u0027d be better if...\"\\n\\n \"You do not tell me what is best,\" she rasped. Her throat ached with each syllable.\\n\\n \"M\u0027Lady,\" the medic said, voice accusing, \"you know the dangers of consuming too much melange. I can only assume someone gave it to you without -\"\\n\\n \"You are a fool,\" she rasped. \"Would you deny me my visions? I knew what I took and why.\" She put a hand to her throat. \"Leave us. At once!\"\\n\\n The medic pulled out of her field of vision, said: \"I will send word to your brother.\"\\n\\n She felt him leave, turned her attention to the ghola. The vision lay clearly in her awareness now, a culture medium in which the present grew outward. She sensed the ghola move in that play of Time, no longer cryptic, fixed now against a recognizable background.\\n\\n He is the crucible, she thought. He is danger and salvation.\\n\\n And she shuddered, knowing she saw the vision of her brother had seen. Unwanted tears burned her eyes. She shook her head sharply. No tears! They wasted moisture and, worse, distracted the harsh flow of vision. Paul must be stopped! Once, just once, she had bridged Time to place her voice where he would pass. But stress and mutability would not permit that here. The web of Time passed through her brother now like rays of light through a lens. He stood at the focus and he knew it. He had gathered all the lines to himself and would not permit them to escape or change.\\n\\n \"Why?\" she muttered. \"Is it hate? Does he strike out at Time itself because it hurt him? Is that it... hate?\"\\n\\n Thinking he heard her speak his name, the ghola said: \"M\u0027Lady?\"\\n\\n \"If I could only burn this thing out of me!\" she cried. \"I didn\u0027t want to be different.\"\\n\\n \"Please, Alia,\" he murmured. \"Let yourself sleep.\"\\n\\n \"I wanted to be able to laugh,\" she whispered. Tears slid down her cheeks. \"But I\u0027m sister to an Emperor who\u0027s worshipped as a god. People fear me. I never wanted to be feared.\"\\n\\n He wiped the tears from her face.\\n\\n \"I don\u0027t want to be part of history,\" she whispered. \"I just want to be loved... and to love.\"\\n\\n \"You are loved,\" he said.\\n\\n \"Ahhh, loyal, loyal Duncan,\" she said.\\n\\n \"Please, don\u0027t call me that,\" he pleaded.\\n\\n \"But you are,\" she said. \"And loyalty is a valued commodity. It can be sold... not bought, but sold.\"\\n\\n \"I don\u0027t like your cynicism,\" he said.\\n\\n \"Damn your logic! It\u0027s true!\"\\n\\n \"Sleep,\" he said.\\n\\n \"Do you love me, Duncan?\" she asked.\\n\\n \"Yes.\"\\n\\n \"Is that one of those lies,\" she asked, \"one of the lies that are easier to believe than the truth? Why am I afraid to believe you?\"\\n\\n \"You fear my differences as you fear your own.\"\\n\\n \"Be a man, not a mentat!\" she snarled.\\n\\n \"I am a mentat and a man.\"\\n\\n \"Will you make me your woman, then?\"\\n\\n \"I will do what love demands.\"\\n\\n \"And loyalty?\"\\n\\n \"And loyalty.\"\\n\\n \"That\u0027s where you\u0027re dangerous,\" she said.\\n\\n Her words disturbed him. No sign of the disturbance arose to his face, no muscle trembled - but she knew it. Vision-memory exposed the disturbance. She felt she had missed part of the vision, though, that she should remember something else from the future. There existed another perception which did not go precisely by the senses, a thing which fell into her head from nowhere the way prescience did. It lay in the Time shadows - infinitely painful.\\n\\n Emotion! That was it - emotion! It had appeared in the vision, not directly, but as a product from which she could infer what lay behind. She had been possessed by emotion - a single constriction made up of fear, grief and love. They lay there in the vision, all collected into a single epidemic body, overpowering and primordial.\\n\\n \"Duncan, don\u0027t let me go,\" she whispered.\\n\\n \"Sleep,\" he said. \"Don\u0027t fight it.\"\\n\\n \"I must... I must. He\u0027s the bait in his own trap. He\u0027s the servant of power and terror. Violence... deification is a prison enclosing him. He\u0027ll lose... everything. It\u0027ll tear him apart.\"\\n\\n \"You speak of Paul?\"\\n\\n \"They drive him to destroy himself,\" she gasped, arching her back. \"Too much weight, too much grief. They seduce him away from love.\" She sank back to the bed. \"They\u0027re creating a universe where he won\u0027t permit himself to live.\"\\n\\n \"Who is doing this?\"\\n\\n \"He is! Ohhh, you\u0027re so dense. He\u0027s part of the pattern. And it\u0027s too late... too late... too late...\"\\n\\n As she spoke, she felt her awareness descend, layer by layer. It came to rest directly behind her navel. Body and mind separated and merged in a storehouse of relic visions - moving, moving... She heard a fetal heartbeat, a child of the future. The melange still possessed her, then, setting her adrift in Time. She knew she had tasted the life of a child not yet conceived. One thing certain about this child - it would suffer the same awakening she had suffered. It would be an aware, thinking entity before birth.\\n\\n There exists a limit to the force even the most powerful may apply without destroying themselves. Judging this limit is the true artistry of government. Misuse of power is the fatal sin. The law cannot be a tool of vengeance, never a hostage, nor a fortification against the martyrs it has created. You cannot threaten any individual and escape the consequences. -Muad\u0027dib on Law, The Stilgar Commentary\\n\\n Chani stared out at the morning desert framed in the fault cleft below Sietch Tabr. She wore no stillsuit, and this made her feel unprotected here in the desert. The sietch grotto\u0027s entrance lay hidden in the buttressed cliff above and behind her.\\n\\n The desert... the desert... She felt that the desert had followed her wherever she had gone. Coming back to the desert was not so much a homecoming as a turning around to see what had always been there.\\n\\n A painful constriction surged through her abdomen. The birth would be soon. She fought down the pain, wanting this moment alone with her desert.\\n\\n Dawn stillness gripped the land. Shadows fled among the dunes and terraces of the Shield Wall all around. Daylight lunged over the high scarp and plunged her up to her eyes in a bleak landscape stretching beneath a washed blue sky. The scene matched the feeling of dreadful cynicism which had tormented her since the moment she\u0027d learned of Paul\u0027s blindness.\\n\\n Why are we here? she wondered.\\n\\n It was not a hajra, a journey of seeking. Paul sought nothing here except, perhaps, a place for her to give birth. He had summoned odd companions for this journey, she thought - Bijaz, the Tleilaxu dwarf; the ghola, Hayt, who might be Duncan Idaho\u0027s revenant; Edric, the Guild Steersman-Ambassador; Gaius Helen Mohiam, the Bene Gesserit Reverend Mother he so obviously hated; Lichna, Otheym\u0027s strange daughter, who seemed unable to move beyond the watchful eyes of guards; Stilgar, her uncle of the Naibs, and his favorite wife, Harah... and Irulan... Alia...\\n\\n The sound of wind through the rocks accompanied her thoughts. The desert day had become yellow on yellow, tan on tan, gray on gray.\\n\\n Why such a strange mixture of companions?\\n\\n \"We have forgotten,\" Paul had said in response to her question, \"that the word \u0027company\u0027 originally meant traveling companions. We are a company.\"\\n\\n \"But what value are they?\"\\n\\n \"There!\" he\u0027d said, turning his frightful sockets toward her. \"We\u0027ve lost that clear, single-note of living. If it cannot be bottled, beaten, pointed or hoarded, we give it no value.\"\\n\\n Hurt, she\u0027d said: \"That\u0027s not what I meant.\"\\n\\n \"Ahhh, dearest one,\" he\u0027d said, soothing, \"we are so money-rich and so life-poor. I am evil, obstinate, stupid... \"\\n\\n \"You are not!\"\\n\\n \"That, too, is true. But my hands are blue with time. I think... I think I tried to invent life, not realizing it\u0027d already been invented.\"\\n\\n And he\u0027d touched her abdomen to feel the new life there.\\n\\n Remembering, she placed both hands over her abdomen and trembled, sorry that she\u0027d asked Paul to bring her here.\\n\\n The desert wind had stirred up evil odors from the fringe plantings which anchored the dunes at the cliff base. Fremen superstition gripped her: evil odors, evil times. She faced into the wind, saw a worm appear outside the plantings. It arose like the prow of a demon ship out of the dunes, threshed sand, smelled the water deadly to its kind, and fled beneath a long, burrowing mound.\\n\\n She hated the water then, inspired by the worm\u0027s fear. Water, once the spirit-soul of Arrakis, had become a poison. Water brought pestilence. Only the desert was clean.\\n\\n Below her, a Fremen work gang appeared. They climbed to the sietch\u0027s middle entrance, and she saw that they had muddy feet.\\n\\n Fremen with muddy feet!\\n\\n The children of the sietch began singing to the morning above her, their voices piping from the upper entrance. The voices made her feel time fleeing from her like hawks before the wind. She shuddered.\\n\\n What storms did Paul see with his eyeless vision?\\n\\n She sensed a vicious madman in him, someone weary of songs and polemics.\\n\\n The sky, she noted, had become crystal gray filled with alabaster rays, bizarre designs etched across the heavens by windborne sand. A line of gleaming white in the south caught her attention. Eves suddenly alerted, she interpreted the sign: White sky in the south: Shai-hulud\u0027s mouth. A storm came, big wind. She felt the warning breeze, a crystal blowing of sand against her cheeks. The incense of death came on the wind: odors of water flowing in qanats, sweating sand, flint. The water - that was why Shai-hulud sent his coriolis wind.\\n\\n Hawks appeared in the cleft where she stood, seeking safety from the wind. They were brown as the rocks and with scarlet in their wings. She felt her spirit go out to them: they had a place to hide; she had none.\\n\\n \"M\u0027Lady, the wind comes!\"\\n\\n She turned, saw the ghola calling to her outside the upper entrance to the sietch. Fremen fears gripped her. Clean death and the body\u0027s water claimed for the tribe, these she understood. But... something brought back from death...\\n\\n Windblown sand whipped at her, reddened her cheeks. She glanced over her shoulder at the frightful band of dust across the sky. The desert beneath the storm had taken on a tawny, restless appearance as though dune waves beat on a tempest shore the way Paul had once described a sea. She hesitated, caught by a feeling of the desert\u0027s transience. Measured against eternity, this was no more than a caldron. Dune surf thundered against cliffs.\\n\\n The storm out there had become a universal thing for her - all the animals hiding from it... nothing left of the desert but its own private sounds: blown sand scraping along rock, a wind-surge whistling, the gallop of a boulder tumbled suddenly from its hill - then! somewhere out of sight, a capsized worm thumping its idiot way aright and slithering off to its dry depths.\\n\\n It was only a moment as her life measured time, but in that moment she felt this planet being swept away - cosmic dust, part of other waves.\\n\\n \"We must hurry,\" the ghola said from right beside her.\\n\\n She sensed fear in him then, concern for her safety. \\n\\n","sourceLink":"https://allnovel.net/dune-messiah-dune-chronicles-2/page-22.html","bookId":2154,"book":{"id":2154,"title":"Dune Messiah (Dune Chronicles #2)","description":"Storyline: Dune Messiah (Dune Chronicles #2) \\n Dune Messiah is a science fiction novel by Frank Herbert, the second in a series of six novels. It was originally serialized in Galaxy magazine in 1969. The American and British editions have different prologues summarizing events in the previous novel. The novels Dune Messiah and Children of Dune were adapted by the Sci-Fi Channel in 2003 into a mini-series entitled Frank Herbert\u0027s Children of Dune. In 2002, the Science Fiction Book Club also published the two novels in one volume.\\n","cover":"https://allnovel.net/images/dune-messiah-dune-chronicles-2.jpg","author":"Frank Herbert","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/dune-messiah-dune-chronicles-2.html","creation":"Oct 5, 2019 8:58:23 AM","modification":"Oct 5, 2019 6:23:42 PM"}}
