{"id":109840,"no":7,"title":"Page 7","content":"CHAPTER SIX Okay, so now, let me get this straight,Hubert,\" Rider said, walking back and forth, raking his hair as the motley group stood on the beach eyeing each other. \"There\u0027s more of you guys over there in Nod try\u0026#65533;ing to get asylum from Cain, and you want to hang with us?\" He glanced at the Guardians that flanked him. \"Did I hear right, or am I still shell-shocked and deaf from the blasts?\" The heavily armed Guardian team had given the entities wide berth, training their weapons on the strange creatures before them and taking aim at any human appendage that they thought they could wound. \"The bigger question is, what do y\u0027all eat Stateside?\" Shabazz said, gaining a fist pound from Mike. The large entity that had identified himself as Hubert lifted his chin and seemed offended. \"It is true that my father was a flesh eater, but he was from the royal legions of guard demons at the Incan palaces. However, my mother was a sacrificial virgin,\" he added with pride in his voice. \"My soul is anchored on my mother\u0027s side of the family tree. Thus I do not pursue my baser nature and I am well educated in all the human culinary arts,and spent my time in Nod learning world cultures and foreign languages. I hope that alleviates your concerns.\" \"Hissoul ?\"Jose said in a sideline whisper to Marlene. \"And you should be the one to cast aspersions, brother,\" Hubert said in a huff, his tail beginning to twitch. \"I thought Guardian teams of Neteru rank were not besotted by prejudices?\" Jose chuckled nervously and simply stared at the being that looked perfectly human from the nose up. He scratched his head as he peered at something that had mellow brown eyes, but whose skin turned green and black in splotches from the fangs down, bore huge leathery wings, and had a spaded tail that hung out beneath black military fa\u0026#65533;tigues. \"Okay, my bad, but the packaging, man...\" Jose finally said. \"I cannot help that.\" Hubert looked away as the nymph petted his huge shoulders. \"You\u0027ve hurt his feelings,\" she said, her voice a soft, angry murmur of chastises. \"Hubert is one of the nicest entities I know.\" She turned to Hubert when he looked away. \"They didn\u0027t mean it; I\u0027m sure once you\u0027re here a while you\u0027ll be able to cover up like we did in Nod so thatignorant people won\u0027t jump to conclusions.\" Hubert rolled his shoulder. \"The explosion the witch hit me with still hurts, that\u0027s all. I am used to humans like him by now.\" \"I\u0027m nota witch\" Marjorie said, her voice tense. \"I am a Guardian with earth element powers,mother power, mister. And I don\u0027t care what refinement and culture you claim to have-touch my son again, and you\u0027ll see just how unrefined I can be!\" \"I was only trying to get you to cease fire before one of us got hurt,\" Hubert said, rubbing his shoulder that still had a char mark from Marjorie\u0027s blast. \"I wouldn\u0027t have hurt him.\" The team stared slack-jawed as the nymph stood on tiptoes and kissed the huge, muscle-bulked green shoulder, and smiled. \"I can heal it later, all right?\" the small, lovely creature said, her skin and wings glittering with pastel opalescent hues under the sun. \"Thank you, angel,\" Hubert murmured and kissed the top of her baby-blue hair. He looked up at Marjorie. \"I am not a monster.\" \"I\u0027m having an out-of-body experience,\" Marjorie said, pressing the heel of her palm to her forehead. \"Thatmust be it.\" \"Those are wonderful,\" the nymph remarked, and then looked at Marlene. \"Thank you for making me feel better. It was the ash and soot in my lungs from all the bombs.\" \"Don\u0027t mention it,\" Marlene muttered. The nymph gazed at Marlene with shimmering turquoise eyes. \"Why would I not mention it? What you did was divine.\" Marlene briefly closed her eyes. \"Help us understand, because weare truly ignorant of what\u0027s going on right now.\" \"Well,\" the nymph said with a sigh, glancing around the weary group. \"Some of us believed Cain when he said he wanted peace. A lot of hybrid angels are trapped over in Nod, too afraid or not quite strong enough, energy-wise, to get out on their own. A lot of demon hybrids feel the same way, but think it is safer to just hide with the masses and seem like they are going along with Cain. If they get slaughtered, their fate is much worse than those with angelic parent\u0026#65533;age, I\u0027m afraid to say. So, do not judge them harshly because of their paralyzing fear; they have more to lose in the long run.\" \"I can only imagine,\" Marlene said in a weary voice. \"I guess we never thought about it that way.\" She glanced around the team. \"Is a lot of what we\u0027ve been through in the past starting to make sense to anybody else on the team but me?\" \"Mar, my brain is so tired that it feels like it\u0027s leaking out of my ears,\" Shabazz muttered. \"But Hubert is strong, as you have seen, and I wanted to be the first to talk to the one named Carlos Rivera that still has silver burning brightly within him. He can call out those more like me. So can Damali. So we gathered a small band of rebels and drew straws to make an escape. Some of us had to get word to the Neteru before it was too late and any of us coming over the barrier would be extermi\u0026#65533;nated on sight by both the Neteru and Cain. We\u0027re refugees, caught in the middle of the war. We\u0027ve always been caught in the middle with nowhere to turn. It was risky, but Hubert held me in his arms the whole time,\" she said, beginning to glow. \"He isamazing. He\u0027s been our mentor of languages and philosophy for years.\" \"How come every time our boy Carlos goes somewhere, he comes back with a lot of drama?\" Shabazz said, beginning to rake his locks and pace. \"This family is beginning to get real strange looking, Mar. I\u0027m serious.\" \"I\u0027m thinking strategic advantage, though,\" Dan said calmly, look\u0026#65533;ing at the bizarre but potential allies before them. \"They know Cain,\" he added, locking gazes with Shabazz. \"That\u0027s a serious advantage. They also know what\u0027s over there coming for us; we pretty much know what\u0027s gonna spew up from Hell and have been battling that for years... but if they hadn\u0027t come here like they did, we would have been caught blind-sided by Cain\u0027s hybrids\u0027 abilities.\" \"True dat,\" Jose said. \"They didn\u0027t drop like they was supposed to, and a daylight firefight is a whole new ball game, holmes.\" \"Word,\" Big Mike agreed. \"Better to know now than later.\" \"Aw\u0027ight. Dan has a good point,\" Shabazz conceded, glancing at the hopeful nymph that hugged Hubert tighter. \"See, it was all in divine order,\" the nymph said with a swoon. \"We meant no harm.\" \"Two questions, then,\" Jose said. \"How do we know which ones among their group that look like Hubert, are cool? We don\u0027t wanna smoke \u0027em by accident. But I also wanna know how come the basic antidemon stuff didn\u0027t work.\" \"Excellent observation,\" Hubert rumbled, giving Dan and Jose a nod of respect. \"Those of us that have not gone dark and still have a human soul will have the same reaction to things like sacred waters and salts as you would. But the answer to your first question is not so easy.\" \"Cain lied to us,\" another smaller Hubert-looking entity said. He was a fawn from the waist down and a winged gargoyle on top, but his eyes were that of a gentle doe\u0027s. \"Once he escaped, he descended into Hell. Initially, we were excited, because we thought he was so bold, so courageous that he\u0027d gone down there on his own on a suicide mis\u0026#65533;sion to start the big war and to clean out the bowels of the pit. We felt his exit from Nod and rushed to his cliffside lair to stand watch at his pool.\" The entity\u0027s voice fractured with emotion. \"It\u0027s all right,\" the nymph said, going to the half-fawn and rubbing his small horns. \"Tell them.\" \"When we got there, his own sphinxes were slaughtered... beau\u0026#65533;tiful animals.\" The entity shook his head. \"We all stood around his sensation pool thinking that perhaps there had been an abduction of our king, and we held the silver thought thread of his Neteru energy until it snapped... then burned away black.\" Tears now streamed down the entity\u0027s cheeks. \"We thought he was dead,\" he said and then nodded toward the other more menacing-looking creatures around him. \"So we called in for those that could follow a black line. Hubert and the other rebels bold enough to try followed it as far as they could, and got a life pulse below.\" Hubert nodded. \"Many of us were holding out hope that he would be what he claimed, a full living Neteru-and we would have followed him into battle against evil demon legions. But he deceived us. If we die in battle fighting for him, all of us are going straight to Hell with no hearing or pardon. That was not the deal. We\u0027d served our time in Nod, and were supposed to fight on the side of righ\u0026#65533;teousness in the final days, and if we died, ascend to the realms of Light.\" Tears filled the entity\u0027s eyes. \"He lied to us... and we all loved him so. Respected him.\" \"Yessss,\" another entity hissed with a strange sibilance to its voice. It had the eyes and scaled skin of a serpent but underneath was hu\u0026#65533;man flesh, the body of a man, with wings, and yet it moved in a very fluid manner as it spoke. \"The ssssensation tank in Cain\u0027s lair revealed much. I was an old friend of Zehiradangra... loved her with all my heart. We dragons are loyal and stick together, and Itold her for yearssss that Cain had an incredibly dark ssssside, but sssshe wouldn\u0027t listen. He had thoroughly captured her curious mind, and his prowesssss... well, even I had to defer. But he is sssso ruthlesssss that after he caused her death he even gave her body over to his troopssss to feed on as a ssssacrificial offering. I vowed to sssservice whomever his greatest enemy was, and I do believe that would be Carlossss Rivera.\" \"Nowthat\u0027s deep,\" Mike said, shaking his head. \"Cold-blooded.\" \"While we share your sentiments, we would appreciate it if you would refrain from the gross ethnic slurs and stereotypes,\" Hubert said, looking at Big Mike hard. \"Hey, my bad,\" Mike said, raising both hands in front of his chest. \"But we been fighting y\u0027all for years, so it\u0027s gonna take a minute to get politically correct with the vocabulary.\" \"You have not been fightingus for years,\" the nymph said in a snit. \"You have been, and should continue to fight demons. We,\" she said, waving her arms before the other interesting members of her group, \"arenot demons. We arehybrids with human parents, and we were made before the banish edicts regarding intermingling with pure hu\u0026#65533;mans.\" She folded her arms and lifted her chin. \"Some of those who look like me are more deadly than these gentlemen here.\" \"They\u0027ve got angels that have turned?\" Berkfield just stared at the nymph. \"Yes,\" the nymph said flatly. \"Their wings are often-but not always-gray, or falcon brown, and some are black like a raven\u0027s. Just because they are feathered doesn\u0027t mean a thing. And why should that surprise you, anyway? The most revered, most handsome, the one with the most beautiful voice fell, went pitch black in his spirit, and is now the owner of a silver tongue of lies.\" \"Touche, sister!\" Rider said. \"Damn.\" \"Correct,\" the nymph said, seeming vindicated as she walked back toward Hubert and hugged him. \"See, I like her because she\u0027s smart,\" Hubert said, stroking the nymph\u0027s hair. \"My friends and I might have been tricked to go with Cain, except for one of us that had known Zehiradangra well.\" Silence fell between the two groups on the beach as the house be\u0026#65533;hind them burned out of control. Rider looked at the small stash of remaining ammo on the ground and then back at the blaze. \"Why does it always come to this, I ask myself time and again?\" Rider sighed and checked his magazine and then put his weapon in its holster. \"So now what?\" \"We must eat,\" the nymph said carefully, \"and hide until sunrise. Those not hybrid will hunt us down, unless we have a Neteru protec\u0026#65533;tor.\" She glanced around. \"Did the female Neteru go with Cain?\" The team passed nervous glances. \"Not to my knowledge,\" Marlene hedged. \"Why?\" \"He brought her to his lair, twice, I believe,\" the nymph said, her gaze lowered, \"and he had her blood scent on him... The gossip in the alleys was rife about that. This is why we did not seek her. We had to be sure we had true amnesty.\" She looked up with fear. \"That is why we fought-they fought. They could smell her here, even though Carlos also left his blood beacon in Nod... during uhmmm... an encounter with Zehiradangra, which also led us to this beach. We were frightened and thought that this could be the female Neteru\u0027s lair with Cain, perhaps. It is all so disorienting. His troops are preparing for a full-scale assault, and he will behead anyone suspected of treason.\" \"Carlos dida female dragon?\" Shabazz muttered, looking at Berk\u0026#65533;field. \"Damali and Carlosgot married,\" Marlene said, cutting a glare at Shabazz and then returning her line of vision to the foreign entities. \"All that mess is history. If you guys will help us, we\u0027ll help you.\" \"Fair exchange is no robbery,\" Hubert said, valiantly sticking out his chest. \"Do all you guys from down there say that?\" Rider slapped his forehead. \"It is a very old saying and a revered one amongst our kind. I do not understand your tone.\" \"Everybody just be cool,\" Marlene said, becoming exasperated. \"Look, our Neteru team is doubly strong because we have two work\u0026#65533;ing in tandem. A male and female with perfect-pitch, balanced en\u0026#65533;ergy. We need a way to identify you guys.\" \"If Carlos is like Cain, with our shared DNA from the realms, we could send him images of each face that we know to be a friend,\" Hubert suggested. \"Well, ya better think of something, because in a serious firefight, it\u0027s easy enough to clip your own men, let alone somebody that\u0027s got on a uniform, so to speak, from the enemy side.\" Berkfield glanced around the group. \"You just saw what happened. Your noses were off, our eyesight told us what to point and shoot at, so we need an identi\u0026#65533;fier.\" \"Not to throw water on the ID process, but didn\u0027t you say you had a choice?\" Rider looked at the assembled hybrids. \"Yes,\" the nymph said slowly. \"We all do.\" \"Then, permit my skepticism just this one time, team,\" Rider said, spitting on the sand. \"The human heart is fickle. I\u0027ve been living proof topside that decision-purgatory exists when it comes to that- long story. But what if while we\u0027re in the middle of a firefight behind enemy lines, and you suddenly decide that, since Cain is kicking our asses with his Hell troops, then maybe you made a wrong decision so you\u0027d like to make amends... Do you see where I\u0027m going and how this could become a very fucked-up situation fast with you at our back or flanks?\" \"I ain\u0027t trying to be funny,\" Mike said, nodding in agreement with Rider. \"My vote,\" Jose said, \"is for y\u0027all to leave a calling card, and when our generals get back, let them put an eye on you. If their senses say it\u0027s cool, then we\u0027ll work with you. But if not... I don\u0027t know.\" \"Then your lead mother-seer can come forward and I can give her my image for Carlos-\" \"I ain\u0027t comfortable with that, Hubert,\" Shabazz said, stepping in front of Marlene. \"Until one of our Neterus checks you out, you ain\u0027t sending a demon transmission up into my woman\u0027s head.\" \"He\u0027s right,\" Marlene said with a shrug. \"I don\u0027t roll like that with an unknown entity.\" Hubert stooped down and tore off a piece of the T-shirt Rider had tossed earlier for the nymph to lie on, slit his arm with a fang, swapped it with the fabric, and flung the bloodied rag to Shabazz. \"I understand,\" he said flatly \"Give that to Rivera as my calling card. This way he can track us, hone in, and send a signal. But our hope is that he has mercy.\" \"It is getting late and it will be a long and periloussss flight back to the ruinssss,\" the snakelike entity said. \"We must hide there, where we have family lines, old energy bands that can strengthen us,\" the nymph said. \"We have distant relatives in Tulum that might take us in. Your young initiates can help with div\u0026#65533;inations of where Cain\u0027s troops might attack. Be safe.\" \"Hold up,\" Dan said, looking at the nymph and then at Heather. \"You do not see the energy field about her?\" The nymph tilted her head. \"It is magnetic,\" she said, pointing to Heather, then to Jasmine, and finally to Krissy and Marjorie. She tilted her tiny head and a bright smile came out on her small, pixielike face. She wiggled her fingers at Inez and then Juanita. \"They all have it. Six of them, plus the one who healed me, makes divine seven-how wonderful!\" She lowered her arm and smiled brightly at Heather. \"Your specialty is standing stones, isn\u0027t it? I have a lot of family that is carved in the stones. Why don\u0027t you use your gift more?\" \"Whoa...\" Marlene said, looking at Heather and Jasmine. \"If ever there was a time to step up, ladies.\" Hubert nodded. \"Place the three elder seers in the center of a standing stones formation-they need the power of female three. That one,\" he said pointing at Marjorie, \"is strong and is your druid stone centerpiece.\" He then looked at Marlene, Juanita, and Inez. \"Make the inner circle around the one with one green eye and one blue eye, a true cat clan derivative. Her genetics bear out.\" He imme\u0026#65533;diately brought his attention away from Marjorie and looked at Heather. \"That one...\" He shook his head and glanced at Dan. \"Is she yours? A permanent bond?\" Dan bristled and so did the nymph as Heather smiled and shyly looked away. \"Where are you from?\" Hubert rumbled, his voice dipping seduc\u0026#65533;tively. \"Scot mother, Ghanaian father... both keepers of standing stones,\" Heather said with a half-smile. \"I am what I am, and DNA being what it is,\" Hubert chuckled, \"but she\u0027sone hell of a witch.\" He tucked away a smile as the nymph stomped on his instep. \"My apologies. But, er, if you put the very pretty fragile one... that delicate lotus flower beside her, andwhew... that one,\" he said motioning to Krissy, releasing a whistle. \"They did not dress them like this in my day.\" \"Hey, the closer it gets to late afternoon and feeding time for you fellas,\" J.L. said, unholstering a weapon in a lightning move, \"the more inclined I am to be extremely prejudiced.\" \"Ya got that right,\" Berkfield said. The serpentine-looking entity smiled. \"It is just that it hasss been a while ssssince we have been out of Nod, and to fall upon a Neteru team with ssssuch an embarassssment of richessss is exssssceptional. He meanssss no harm.\" \"Truly I do not,\" Hubert said with a toothy grin, ignoring the bee-sting like swats the nymph pummeled against his massive torso. \"Nonetheless. The three, on natural rock formations, around the cen\u0026#65533;ter seer who also has Wicca in her line, with the outer magnetic ring of young Wicca initiates, should be able to accomplish a divination regarding which direction Cain\u0027s troops will advance from. The rocks are important, because all the stones on the planet were created at the same time, and old ruins are where Cain will form base camps to energy-strengthen his men.\" \"Like a human lighthouse, almost?\" Rider said, wiping his palms down his face. \"Now that\u0027s wild.\" Hubert chuckled and looked out toward the sea. \"She needs a con\u0026#65533;sistent energy source though. Use the one with red hair, who is most gifted. Right now, what is within her is latent, until it is charged. This would be a polar opposite of her energy. Dark covens go deep within the caverns to pull this from any number of entities, but I am sure your team would abhor such methods.\" \"We don\u0027t go dark, forany reason,\" Marlene said firmly. \"Not even for vital information or extra powers. No black masses, dark rituals, whatsoever.\" She scanned the group and then looked at Heather and Jasmine hard. \"The only reason we allowed them into the Guardian fold was because they came clean, had no blood on their hands, and hadn\u0027t done any sacrifices. So, you boys had better come up with an\u0026#65533;other option.\" \"There is another option,\" Hubert smiled. \"One that has always been preferable for releasing unified energy, but I will defer to my friend\u0027s sensibilities,\" he said sheepishly when the nymph tried to push his bulky form and then punched his arm. \"So you\u0027re saying that if we could all stand around like on those beach breakers,\" Heather said, pointing out to a ridge of black rocks in the distance, \"I could warn the team... but the problem is, right now I\u0027m as good as a dead car battery?\" \"I don\u0027t know this \u0027car battery,\u0027 \" Hubert said, dropping his voice to an even lower, seductive tone, and receiving another nymph stomp that he ignored, \"but you do need a male blast from something that can hold a charge, baby.\" \"Okay, that\u0027s fucking it!\" Dan shouted, gripping his Glock side\u0026#65533;ways and pushing past Shabazz and Rider. Blue-white energy rippled over his skin and static electricity made sections of his blond hair stand up on his head. Hubert chuckled. \"A tactical Guardian,\" he said with a bow. \"My apologizes, Miss. I see you have a worthybattery already.\" \"If Carlos and Damali don\u0027t hurry up and get back here...\" Mar\u0026#65533;lene muttered, watching sections of the hacienda collapse as smoke continued to spiral. \"Why don\u0027t you allow the cute one to draw the dragonsss?\" the serpentine hybrid asked. \"You sssshould have had flagssss all around your fortressss that could come to life. Are you not from the Old World, my lovely, lovely artissssst? Tell me Tibet or India...\" \"The Philippines,\" Jasmine said with a shy curtsy, making Bobby spit. \"Closssse enough,\" the serpent hybrid murmured in a low sexy tone, beginning to seductively sway. \"I could ssshow you what Zehi-radangra looked like if-\" \"I don\u0027t think so,\" Bobby said, stepping in front of Jasmine. \"Just tell us what she\u0027s gotta do to protect base camp.\" \"Paint on white fabric for purity,\" the nymph said, folding her arms and scowling at the leering male entities around her. \"Forgive them. Anyway. If you have a tactical Guardian with charged blood that is in harmony with her energies, you may use that. No horrible blood sac\u0026#65533;rifices and dark spells,\" she added in a tight voice that made Hubert smile and look away. The nymph shivered. \"Eeew... disgusting!\" \"Like... uh,\" Bobby said, glimpsing Jasmine, \"somebody who, uh, is close to her?\" \"A wizard would be perfect, especially if he has a magnetic attrac\u0026#65533;tion to her.\" The nymph\u0027s voice softened as she glimpsed Marjorie. \"It wouldn\u0027t take much.\" \"How close, Bobby?\" Marjorie said, her eyes narrowing. \"Friends, Mom,\" Bobby said, opening his arms. \"That\u0027s all, for the good of the team.\" \"Stand down, Marj,\" Berkfield muttered. \"It\u0027s a lost cause and a done deal... like you told me.\" He cut a glare toward J.L. \"Remem\u0026#65533;ber that conversation about having to accept the unacceptable?\" Marjorie walked away and stood by Marlene, fuming. \"Fine.\" \"Just let her draw with his blood onto the fabric and with the right energy jolt...\" the nymph said, lowering her gaze with a smile, \"whatever she draws will come to life to always fight on your side. It might get you through the night, if your Neterus do not return before dark.\" \"I can sketch anything crazy she wants,\" Jose said, his tone open and no longer defensive. \"Then Jasmine could trace over it with a brush or knife, whatever we can salvage here on the beach. Just dot along the lines I draw so you don\u0027t have to take more than a pint from Bobby.\" Jose looked at Marjorie and spoke in a conciliatory tone. \"For the team.\" \"But she will need her polarities adjusted by a warlock or a wiz\u0026#65533;ard,\" the nymph said, swallowing a shy smile. \"It is usually done in a private exchange, but you all probably would not sanction that.\" Bobby smiled and looked away as his mother cringed. \"Uh, yeah, no problem.\" J.L. bit his lip and tried to keep from laughing as Berkfield cast a dirty look in his direction. \"My daughter ain\u0027t participating in no freaky luau on the beach, got that J.L.? I don\u0027t care what her gift is from her mother\u0027s side. As it is, with all this hocus-pocus, the Covenant is probably flatlining! Wait until Father Pat hears about this shit... This is waaay outside the boundaries of organized-\" \"You heard that?\" Inez said, glancing at Mike and then out toward the sea. Everyone fell quiet as Big Mike neared Inez. \"No, suga. What is it?\" he said, tilting his head like a giant hunting dog. Inez\u0027s gaze became distant and glassy. \"It\u0027s like drums,\" she mur\u0026#65533;mured, holding the group hostage with her words. \"I can see stuff moving in the stones, like serpents coming alive. I heard it first, and then felt it, before I finally saw it.\" She shivered hard and wrapped her arms around herself. \"It\u0027s in some kinda old ruins.\" Hubert nodded. \"Aztec.\" \"My baby done seen and heard some shit like in a real vision?\"Mike smiled wide and hugged Inez off her feet. \"You did it! You heard some mess that evenI couldn\u0027t hear?\" \"I\u0027m finally coming into my own, ya think?\" Inez said, laughing as Mike swung her up higher in his hold. \"I can\u0027t believe it-you actually heard something creeping before me, suga, dang!\" He laughed hard and set Inez down with a sloppy kiss, making her giggle. \"Plus, you got visions... shoooot... we can talk about this later, one-on-one. But, uh, I really don\u0027t want you messin\u0027 with the unknown until we can thoroughly check it out, though.\" \"Yeah, well, I don\u0027t care who sees what, my daughter ain\u0027t doing no ceremony on the beach,\" Berkfield said, folding his arms. \"Nor is my son,\" Marjorie said, fussing as she glimpsed Jasmine. \"No matter what he might have done before, all this sounds too dan\u0026#65533;gerous. Spiritually speaking.\" \"Yeah, and Heather isn\u0027t participating in anything until we know who you guys really are,\" Dan argued. \"Word,\" Jose said, glancing at Juanita, then Hubert. \"Shit, you ain\u0027t gotta worry about me,\" Juanita said, holding Jose\u0027s gaze. \"I don\u0027t mess with no spiritual nothin\u0027 I don\u0027t understand. Been there. Didn\u0027t like where it took me.\" \"All right, y\u0027all,\" Marlene said in a tight voice designed to reinsert order back into the situation that was dissolving into sure mutiny. \"A lot of what we\u0027ve had to do recently is outside of normal sanctions- dealing with Carlos being one of them, but you see how the Light worked that crazy scenario out. And I can name a hundred other ex\u0026#65533;amples. But all of it worked out because we did it under prayer, with guidance, good intent, and...\" Marlene threw up her hands. \"Lawdy, I don\u0027t know. All I\u0027m sure of is we\u0027ve gotta do something, and these, uh, beings, are giving us some\u0026#65533;thing to work with right now. Plus, after that brand-new vision of Inez\u0027s kicked in, we oughta try and locate the source of the distur\u0026#65533;bance. The Aztecs ruled in Mexico, and if you haven\u0027t noticed, people, that\u0027s where we are-so sticking our heads in the sand and acting like nothing is coming for us isn\u0027t an option. Good job, \u0027Nez. We needed to know that.\" Marlene glanced back at the flaming hacienda. \"Any\u0026#65533;body else got any suggestions about how to hunker down, create a fortress on the beach while we wait for Hell\u0027s gates to open?\" When no one spoke and the grumbles of discontent subsided, Marlene pressed on. \"Okay then. First off, we\u0027re gonna have to move waaay down the beach, maybe go find Carlos and Damali\u0027s honey\u0026#65533;moon villa to hole up in until they get back, because we can\u0027t stay here. That place was covered in nothing but white Light from the marriage. If these guys honed in on the hacienda, then anything else will come here as a first stop. Plus, if Carlos and Damali see this de\u0026#65533;struction, I\u0027m pretty sure they\u0027ll instantly scan for us and lock in where only they can see in-their last protected hold up-the villa. We can pretty much guarantee that they\u0027ll head toward it and I\u0027ll keep a sweeping telepathy channel open for them. We might be remote from the town, and things in Mexico move slow, but sooner or later investigators and a fire company will come snooping around. I just hope we got all the ammo out so nothing blows.\" \"Then the newbies can, uh, do their protection thing and we\u0027ll set up a perimeter,\" Shabazz said, his tone weary. Rider nodded and held up the T-shirt rag. \"We\u0027ll pass on your call\u0026#65533;ing card. Thanks for the info.\" \"That was some deep science that our team has been trying to crack for days,\" Jose admitted. \"We have all these new team members and gotta get \u0027em up to speed with the quickness. We owe you on that.\" \"Much obliged,\" Hubert said. \"You gave us possible amnesty and a potential meeting with, your generals. Therefore-\" \"We know, we know,\" Rider said, shaking his head. \"Fair exchange is no robbery. Sheesh!\" \"How come what starts out as a fairly normal day,\" Rider said, jump\u0026#65533;ing down out of one of the Jeeps that had been salvaged before the hacienda blew, \"never works out that way?\" No one responded to Rider\u0027s sarcasm as the team cased the perimeter of the villa, groups of Guardians piling out of Hummers, Jeeps, and Land Rovers on full alert. Once satisfied that the coast was clear, senior team members went in first, all senses keened, and en\u0026#65533;sured the house was vacant. \"All clear!\" Berkfield shouted out the front door. Immediately hands and arms began moving supplies into the villa in a fast-moving assembly line of bodies. Shabazz\u0027s locks crackled and arced a charge, and Rider smiled a half-smile. \"Don\u0027t say it, brother,\" Shabazz muttered with a chuckle. Rider raised an eyebrow and gave Shabazz a sheepish grin, and then inhaled deeply. \"You think our young tacticals are gonna be able to hang in here?\" Rider motioned with his chin toward J.L., Bobby, and Dan as he unpacked ammo to spread on the counter with Shabazz, moving away the refuse of half-eaten dinners and dishes. Shabazz chuckled. \"The charge coming up off this joint ain\u0027t no joke,\" he said in a private mutter. \"I\u0027m more worried about Jose, though. Brotherman looks like he\u0027s about to drop fang up in this piece.\" \"Well,\" Rider said in a philosophical tone, sighing hard. \"At least there\u0027s no sulfur trail in here.\" He stopped and looked at Shabazz. \"Did you notice that about the hybrids? They don\u0027t trail warning sig\u0026#65533;nals like general, regulation demons.\" \"I know,\" Shabazz said, glancing up at Rider. \"They\u0027ve got a more human vibe to them, almost. In the hacienda, I could sense motion but wasn\u0027t registering blue-arc from their presence.\" Rider nodded and shoved the half-eaten meal Damali and Carlos had left into the trash. \"I gotta get to Gabby.\" Shabazz nodded. \"You call her?\" \"Yeah. Since her initiates came, I\u0027ve been calling every number I had for her. Everything\u0027s been disconnected. Last I heard, she was heading toward Vegas to set up shop there, since New Orleans was gone, L.A. was hot... I\u0027m worried, man.\" \"We\u0027ll get Mar on the case, as soon as we get Damali and Carlos home. She can\u0027t do a double sweep like that.\" Shabazz laid a hand on Rider\u0027s shoulder. \"I know... but maybe since Marjorie is her sister...\" The two older Guardians stared at each other. \"Worth a try, but Mar\u0027s gotta teach her quick how to open a chan\u0026#65533;nel without having it tracked,\" Shabazz said cautiously. \"Feel me?\" \"Yeah, I do,\" Rider said, his shoulders slumping. \"You wouldn\u0027t wanna make a run with me, though... to, uh, maybe go by a lair?\" Shabazz closed his eyes and let his hand drop away from Rider\u0027s shoulder. \"Aw... man... I forgot. Tara.\" Rider nodded and looked away. \"I don\u0027t wanna open it to possibly injure her to daylight, but if I can get a word to her somehow...\" \"Man, listen,\" Shabazz said. \"Me, you, and Mike, we\u0027ll ride at sun\u0026#65533;down. You go to Yonnie\u0027s spot during the day, armed, and surprise him, some real fucked-up shit could happen. But the minute the sun sets, we can holla at him with a little distance between him and us. I\u0027m with you. Cool?\" Rider leaned against the counter, his line of vision roving the group that had fanned out and was securing entry points to the villa. \"Yeah. That makes sense.\" Rider dropped his head back and closed his eyes. \"I\u0027m between a fucking rock and a hard place on this one, \u0027Bazz... just like old times.\" Dan walked beside Heather along the beach, and then slowly slipped his hand into hers. Hot current ran from his palm into her soft fingers and he watched her breath hitch as the blue-white static charge eased up her arm and covered her breast. She flinched and briefly closed her eyes as the static charge circled a pouting nipple, licked it, and then encompassed the other one. Tempering himself, Dan released her hand and clasped his hands behind his back, humiliation scalding his face. \"I\u0027m sorry,\" he said quietly, watching the sun glisten in her hair. He laughed self-consciously as she fought a smile. \"The villa had a seri\u0026#65533;ous charge in it, and we were all pumped after what went down back at the hacienda. Didn\u0027t mean to get fresh with you. It sorta slipped out.\" She glimpsed him from the corner of her eye and kept walking. \"I like you, too, Daniel,\" she murmured, and then looked off toward the rocks. \"I know we just met under very insane circumstances ten days ago... but it\u0027s like I\u0027ve known you forever.\" \"I know what you mean,\" he said quietly as she stood looking up at a long natural pier of huge, jagged rocks that jutted out into the crash\u0026#65533;ing waves. If she only knew how it also felt like it had been forever waiting for her. Just like Christine had promised, the moment he\u0027d seen her, the ache for Krissy had dulled and then vanished. Heather\u0027s eyes and voice literally drank him in during their field exercises, the laughter in the hacienda, and the long, wonderful nights just sitting with her on post talking, learning her moods under the stars. The one kiss she\u0027d al\u0026#65533;lowed had almost brought him to his knees, but there hadn\u0027t been enough time or privacy for more. \"You think you can do it... I mean, create a human lighthouse up there?\" She chuckled softly and began climbing up to find a flat enough sur\u0026#65533;face for the number of bodies the formation would require. \"I don\u0027t know,\" she said merrily, pulling herself up and sensing on her hands and knees. \"These are sooo old and so virginal... they\u0027ve never been tapped.\" Heather looked at him with an expression that devastated him, but he remained cool on the outside. \"Dan, you have to feel these,\" she murmured, then looked back down and caressed the stones. His body lurched and his mouth went dry as he watched her grace\u0026#65533;ful hands hover above the jagged rocks, her lithe body clad in jeans and a jewel-green tank top, her spine dipping into a gentle sway while she balanced on all fours. \"Okay,\" he breathed out, and touched the rocks, not daring to climb up there with her just yet. But the moment his palms splayed against the rocks, to his chagrin, a blue-static charge fanned out from his fingers and rushed over the rocks, leapt a quarter inch to her hands, and spread over her. She just looked at him. \"Wow,\" she whispered. He immediately pulled his hands away and walked into the sea up to his boots, needing distance and to cool down. The throb in the erection she\u0027d given him was pounding in his groin with the same in\u0026#65533;tensity of the surf. \"Uh, listen, about that... that was an accident,\" he said, embar\u0026#65533;rassed, unable to deny that he wanted to climb all over her like his charge. \"But I think it was the jolt those guys were talking about,\" he added, beginning to breathe hard while keeping his back to her so she couldn\u0027t see just how affected he really was. \"That\u0027s it!\" she said, laughing. \"Dan, take off your boots, and walk into the water, and then lean over and touch the rocks while I\u0027m on them.\" He glimpsed her over his shoulder, then became mesmerized by her brilliant smile. For a moment he couldn\u0027t move. The afternoon sun was behind her, framing her in light, her auburn hair glistened with red, copper, brown, and gold... and her small heart-shaped mouth drew him, but her gray eyes practically smoldered with excite\u0026#65533;ment as her new powers began to unfold. His gaze traveled down her body in pure reflex, following her pretty toffee-hued skin down to her tank top, over the swell of her unrestrained breasts to linger on the tight, tiny pebbles that her nipples had become and then raked across her flat belly down her pelvis to then take in the full length of her shapely legs. \"I can\u0027t,\" he admitted in a quiet, gravelly tone, knowing full well what sea-salt-infused water would do to the hard current that was pulsing through him. If he did what she\u0027d asked, and then touched the rocks, she would definitely be offended. Her smile widened, \"But you heard what that green guy told us,\" she said, laughing. \"I have to start my dead car battery. Oh, Dan, I\u0027ve never felt anything like this in my life!\" She sat down on a flat area cross-legged, closed her eyes, and turned her face up to the sun. \"All my life I\u0027ve known I was different, and I was so afraid that I would have to one day make a pact that could steal me away from the sun forever. Then I find you guys, and now I\u0027m learning what I can do for the good...\" She opened her eyes. \"I know it has a hot charge... but, I don\u0027t mind. If I was going to feel something so magical, I\u0027m blessed it would be with you.\" He turned slowly and ran his palm over his hair. \"You\u0027re not mad that I\u0027m sorta thinking like that about you this soon?\" She smiled and began picking at the nap in her jeans. \"It\u0027s sorta natural, you know... for two people who really like each other and share a lot in common to feel a wee bit of chemistry Doesn\u0027t mean it has to wind up going too far,\" she said, glancing up at him and then down the beach to the villa that was a half-mile away. \"I wouldn\u0027t want your family to think that\u0027s the kinda girl I am, or lose their re\u0026#65533;spect... or yours, given where I came from.\" \"You definitely wouldn\u0027t lose my respect,\" he said, coining closer to the stones and beginning to unlace his Timberlands. \"We all came from some pretty wild places and nobody thinks like that,\" he said, talking faster as he yanked off each boot and hurled them to the dry sand. \"I just wanted to be sure you liked me like that, too-before I sent that kinda charge your way. I mean, if you didn\u0027t feel like that, I don\u0027t want a weird vibe between us on the team, and uh,God you\u0027re beautiful, so I don\u0027t know how steady the charge would be, because, Heather, seriously, it\u0027s been a long time since I\u0027ve felt a charge like this running through me. If you\u0027re not really into me, then I want us to still be cool, after. You know?\" Dan clamped his lips shut and could feel the muscles in his jaw working. The woman had him babbling and he knew he needed to shut up. He\u0027d been down this road before with Krissy and didn\u0027t want to get burned again. \"I like you alot, Daniel,\" she said softly and then leaned forward and placed her hands on the rocks. \"You are so precious... and the fact that you would even worry about such a thing like that has stolen me away.\" She shook her head. \"Do you know what kind of dark en\u0026#65533;ergies I\u0027ve seen and that I\u0027ve had to fend off while in Gabrielle\u0027s care? I never thought in a million years I\u0027d be able to find a nice guy like you.\" He waded into the water up to his calves and kept his gaze on her. \"I never thought in a million years I\u0027d find a woman as nice and as beautiful as you to care about me as a friend.\" \"Then the other ones that passed up on such a deal were crazy,\" she said, her voice dipping a bit. \"You make a great friend.\" \"This isn\u0027t friendship energy that\u0027s arcing,\" he said, honestly warn\u0026#65533;ing her. \"Even though we\u0027re friends.\" She didn\u0027t move. \"I didn\u0027t suspect that it would be,\" she said after a moment. \"Sexual energy is the oldest and most natural energy be\u0026#65533;tween the opposite polarities of male and female,\" she said, shyly looking down at her hands. \"It\u0027s as old as these stones.\" Heather glanced up, and before she could draw a breath Dan had placed his hands against the rocks with a hard slap. The blue arc in\u0026#65533;stantly sizzled up the boulders in a blue-tinged coating, crawling over it with a thick charge and then hit Heather so hard she fell backward. Dan yanked his hands away, the current rippling over him, charging his hair, and making him shudder as he began to walk around in a dis\u0026#65533;oriented circle. When he looked up, Heather was leaning back on her elbows, breathing through her mouth. \"I... uh... didn\u0027t know it could-\" \"I tried to warn you,\" he said, panting. \"I shouldn\u0027t have stood in the water. It was stored up for a long time.\" She dropped her head back and moaned as an aftershock of current rippled over her skin again. \"Daniel... it won\u0027t stop... .\" His better judgment in shreds, he climbed up on the rocks to try to help her down. But as soon as his entire body slid onto the solid sur\u0026#65533;face, she closed her eyes and moaned. \"Oh, God... Dan.\" \"Okay, okay, I\u0027ma get you off of this charged surface,\" he said, put\u0026#65533;ting one arm under her back and gently guiding her over the edge of the formation on the opposite side from the villa. \"Take some deep breaths, and get out of sight of the house so you can pull it together and won\u0027t be embarrassed. I\u0027m sorry, Heather. I... oh, shit... you feel so good.\" They half-fell, half-slid into a sandy crag that was filled with water in a little tide pool between the massive boulders. The blue charge was all over the rocks, all over them, and Dan\u0027s bare feet were in the ankle-deep sea. Her palms swept up the sides of his flushed face and tangled in his static-ridden hair as she kissed him hard, her tongue seeking his. His fingers cradled her head, allowing her thicket of auburn ringlets to glide between them as his arm protected her back. Joined at the pelvis, he couldn\u0027t have stopped moving against her if a war broke out on the beach. The long-awaited sensation of her touch dampened his lashes and smothered him as he tore his mouth away from hers to kiss her neck. \"You want to?\" he asked in a ragged whisper, kissing her chin, her eyelids and the bridge of her nose quickly. \"If not, I understand.\" She nodded, her words choking out. \"I do. Don\u0027t stop touching me. I never felt anything like this.\" It was as though something within him had instantly snapped. He tugged at her tank top and her breasts bounced free. His mouth im\u0026#65533;mediately sought the warmth of her cleavage and he closed his eyes and shuddered with a groan. She was gonna do it.Actually let him. He covered her breasts with his mouth and his hands, pulling her dis\u0026#65533;tended, rose-colored nipples between his lips, feeling the shiver go up her spine as she leaned in harder and sought his mouth. Afternoon sun and her pulsing body produced instant sweat. His hair was wet now, adding to the charge as they grappled with jeans fastenings, kisses, entwined legs, creating friction sounds against the rocks between gasps. Her snug jeans and underwear were down around her knees and so were his, the feel of her silky, moist mound causing delirium. \"I can\u0027t get my pants all the way down,\" she said on a breathless chuckle. It was true; her tight jeans didn\u0027t leave room enough for him to enter her. She touched his face and looked at his pained expression and slipped from under him, but not far enough to totally break their physical connection. However, when the charge dipped from her slight movement away, he shuddered hard and groaned deep inside his throat. \"Please don\u0027t move,\" he said between his teeth with his eyes shut. \"Don\u0027t break the charge,\" he said into her hair as she turned around and faced the rocks. \"Oh, God...\" he whispered hard into the crook of her neck as he slid against her creamy, smooth buttocks and let his hands trace her hips. His face was burning and she threw back her head and flattened her palms against the hard surface before her, pushing away from the stones. \"Don\u0027t break my jaw on the rocks,\" she said with a gasp, laughing a little as he flattened her hard against them. \"I\u0027m sorry,\" he said between deep breaths, and then placed a hand above her head to brace himself and protect her face. He stood that way for a moment, his forehead on her shoulders, remembering that she had never been entered... also remembering that she didn\u0027t have birth control. \"I\u0027ll be gentle,\" he said, kissing her shoulders and back. \"Just for a little bit, and then I\u0027ll pull out, okay?\" She glanced over her shoulder with a question in her eyes. \"I can\u0027t get pregnant right now... I-\" \"I know, I know. I won\u0027t let that happen.\" He sounded insane to his own ears, knew he was on the border of a promise and a lie. But the charge had him, she had him, the agonized wait for the cosmos to send her had him. \"I just want to feel you,\" he whispered, sweeping his lips against her fevered skin. \"Just once,\" he said, his voice urgent and at the point of begging. \"Iswear I\u0027ll pull out.\" She closed her eyes and nodded, as his hand slipped between her legs. His gentle caress made her bend over and dip her supple spine into a deep sway the moment his finger slid between her swollen folds and flicked her bud. \"I trust you,\" she breathed out and then leaned back against him and climaxed hard. Trembling and almost unable to breathe, he held her close and slid against her gently, opening her to be so tightly sheathed that he nearly wept. She might have trusted him, but he could hardly trust himself as he eased himself inside her, sensing, checking, feeling her reaction to be sure he wasn\u0027t hurting her. Holding on to the rocks and her waist he moved slowly, her slickness maddening. \"Tell me if I\u0027m hurting you,\" he said in a ragged whisper into her hair. \"I\u0027ll stop if I am.\" She violently shook her head and moved back against him hard to take him in deeper. That\u0027s when he lost it, totally forgot everything he was entrusted with. Blue-arc current sent a bolt of energy down his spine, increased his thrusts, and linked his pending orgasm with hers. Suddenly he pulled out of her, the humid air knifing him, but in\u0026#65533;stinct and raw desire made her clamp her thighs tightly around him. A slicing contraction caused him to pelt her back with her name, mak\u0026#65533;ing him move in ragged, jerking thrusts against her wet inner thighs, and then stop breathing as a climax seizure claimed him. Her voice rent the beach with his name, temporarily drowning out the surf, and she wriggled against him, trying to recapture him inside of her. But rather than risk catastrophe, he held her close and simply gulped air. \"We can\u0027t,\" he murmured against her ear, allowing his hand to pet her gently between her legs until she convulsed against him again. \"Next time I\u0027ll be prepared.\" \"Okay,\" she gasped, leaning back against him. A slow giggle bub\u0026#65533;bled inside her. \"Ya think we\u0027ve charged the rocks?\" Daniel hugged her from behind and dropped his head against her shoulder, laughing softly, breathing into her hair. \"I think they\u0027re good to go.\" Bobby sat on the bedroom floor of the villa pressing a wet towel to the inside of his elbow, watching Jasmine as she lay on her belly. Her intense focus had knitted her lovely brows into a stern frown as she dabbed a toothbrush into a cup and spread crimson on a clean sheet along the lines Jose had drawn for her with a Sharpie. He swallowed hard as he watched her small, lithe form stretch and work against the fabric. The charge left in the room by the honey-mooners was almost enough to make him levitate. \"You know... they said it needed a jolt of energy to go with it,\" he murmured quietly, stretching out on the floor beside her and star\u0026#65533;ing at her until her huge brown eyes stared back into his. \"I know,\" she whispered, glancing around the room like a thief. \"I haven\u0027t seen you in a year... and then when you came to the house in Arizona, things were pure chaos. Then, once we got here, I thought maybe we could sorta pick up where we left off?\" He smiled, glanced up at the bed, and then down at the floor. \"It\u0027s real quiet down here,\" he said, pressing on the floorboards under the Oriental carpet. She lowered her gaze, a rosy blush forming on her cheeks. \"Butyour mother is here, right in the next room. I wanted to in the worst way, but...\" \"We could have died today,\" he said, coming closer and kissing her bare shoulder. \"I almost did when that creature grabbed you.\" Jasmine gazed up at him and kissed him slowly. \"But your mother is here.\" Bobby rolled over and stood without using his hands, kept his eyes on her, and strode over to the door. \"Yeah, I know,\" he said, locking the bedroom door with a sexy smile. \"She\u0027ll get over it.\" Marjorie and Inez looked up at the same time, their lines of vision meeting Juanita\u0027s and then going to the hallway that led to the bed\u0026#65533;room. \"Marj, let\u0027s you and I go see of we can find some driftwood to, uh-mmm, make stakes?\" Marlene said cheerfully, grabbing Marjorie\u0027s sleeve and hustling her out of the villa. Juanita shot Jose a glance that saidDon\u0027t even try it. Dejected, he went back to sorting ammo. Inez went to the cabinets to rummage for grub to feed the team, while trying to ignore the intense sidelong glances Mike sent in her direction. \"Puhlease,\" Inez muttered under her breath. \"After this morning, you must be crazy.\" \"I\u0027m a Guardian, not a saint,\" Mike said under his breath, annoyed. \"Just like old times in Arizona,\" Shabazz muttered, shaking his head while reloading spent artillery. \"Gives me the hives,\" Rider said, scouring the cabinets with Inez. \"Don\u0027t these kids know that at times like these, wine is like fruit punch? Damn, where is my old buddy Jack Daniel\u0027s when I need him?\" J.L. casually glimpsed Krissy from the corner of his eye. She smiled at him, and then redoubled her efforts to get a signal on the wireless laptop. \"Might get a better signal outside,\" he said in a slow, sexy tone. \"Wanna take \u0027em outside and go take a walk... to uh, see if we can get a signal going?\" She giggled and then glimpsed her father, who was staring at them both, stone-faced. \"Maybe later. Besides, we can\u0027t open up a wireless signal without a seal to be sure there\u0027ll be no demon interception.\" She kept her eyes on her father and offered him a broad grin. \"I\u0027d better stay here and get some regional maps of Central Mexico right now.\" \"Okay,\" J.L. said in a defeated voice, blue current suddenly run\u0026#65533;ning down his hands to black out the laptop system he\u0027d been touch\u0026#65533;ing. He set the system aside and muttered a curse. \"Why don\u0027t you go walk it off,\" Mike said over his shoulder, chuckling, \"before you fry another motherboard and get yourself smoked by Berkfield?\"","sourceLink":"https://allnovel.net/the-wicked-vampire-huntress-legend-8/page-7.html","bookId":2532,"book":{"id":2532,"title":"The Wicked (Vampire Huntress Legend #8)","description":"Storyline: The Wicked (Vampire Huntress Legend #8) Damali and Carlos have finally tied the knot, but there is no happily ever after on the horizon. Cain, the son of Eve and the new chairman of the Vampire Council is amassing an army of creatures like no one has ever seen before. But while a band of human scientists are conducting secret experiments they open the dimension that holds Cain and he is released into the human world, bigger and badder than ever. Her family slaughtered, Damali heads for hell to serve justice and faces off with a nemisis the likes of which she has never encountered. Carlos doesn\u0027t take his wife\u0027s disappearance lightly and races against time to get Damali back... only to learn that his wife might be pregnant. The question: is the child his or the Chairman\u0027s?","cover":"https://allnovel.net/images/the-wicked-vampire-huntress-legend-8.jpg","author":"L.A. Banks","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-wicked-vampire-huntress-legend-8.html","creation":"Oct 5, 2019 8:58:50 AM","modification":"Oct 5, 2019 11:43:16 PM"}}
