{"id":102000,"no":26,"title":"Page 26","content":"Mercy tilted her head and stared at Roy Fletcher. “He’s deep in thought.”\\n\\n “He’s wondering how long it’ll take to hear from Julie,” Shirley suggested. “He’s growing impatient.”\\n\\n Goodness had noticed that, but she also knew he’d made no effort to get in touch with Julie. She suspected this was a ploy on his part—his way of telling Julie that if she chose to reject his offer, she wouldn’t be hearing from him again. That was just plain wrong! Goodness intended to do everything within her power to make sure Roy’s head was filled with thoughts of Julie every minute of every day. The man would be sorry he’d messed with the angels’ plans to answer his mother’s prayer.\\n\\n “You know how cold he can be,” Shirley commented, studying Roy intently. She shivered and wrapped her arms around herself.\\n\\n “That’s all an act,” Goodness told them. “He loves his mother and Julie, only he’s too stubborn to admit it.”\\n\\n “I say we get in there and do something,” Mercy proclaimed.\\n\\n “Like what?” Goodness was almost afraid to ask.\\n\\n “What we always do.” Mercy folded her hands prayerfully and fluttered her long, curly eyelashes.\\n\\n “Heaven help us,” Goodness muttered.\\n\\n “No, you’ve got it all wrong,” Mercy said. “We’re the ones helping Heaven. Gabriel needs us. Otherwise, we’d be long gone by now. I for one feel that drastic times call for drastic measures.”\\n\\n “Drastic measures,” Goodness repeated. “What—”\\n\\n “Stand back everyone.” Mercy threw open her wings.\\n\\n “What’s she going to do?” Goodness asked Shirley. “Toss a fish at him?”\\n\\n Shirley giggled.\\n\\n Just when Mercy was getting ready to make her move, Ms. Johnson entered Roy’s office. The three angels glided out of the way as his assistant handed him a sheaf of papers that required his signature.\\n\\n “Ms. Johnson,” he said as the woman was about to leave, “would you mind if I asked you a couple of questions?”\\n\\n “Are they personal questions?”\\n\\n “Not exactly personal. Didn’t you tell me you have a daughter in her twenties?”\\n\\n “I do. Janice. She recently turned twenty-three. What makes you ask?”\\n\\n “I was just wondering if—” He was interrupted by someone knocking on the partially opened door.\\n\\n Shirley gasped.\\n\\n “Who’s that?” Goodness wanted to know.\\n\\n “I think it might be Aimee,” Mercy told her in a hushed whisper.\\n\\n Indeed it was. The woman who’d dumped Roy for his father. She stepped into the office wearing a full-length mink coat and high-heel shoes. She was sleek, petite and very blond. They didn’t call it platinum blond for nothing, Goodness thought spitefully.\\n\\n “What’s she doing here?” No one answered, and Goodness suspected her friends were as surprised as Roy obviously was.\\n\\n He slowly stood. “That will be all, Ms. Johnson.”\\n\\n “Yes, sir.” His assistant hurried out of the room.\\n\\n “Hello, Roy.” Aimee smiled seductively and walked up to his desk. “It’s good to see you.”\\n\\n “How did you get into the building?”\\n\\n “Oh, I have my ways.”\\n\\n Roy snickered. “I’ll just bet you do.” He made a mental note to talk to Dean Wilcoff about this.\\n\\n “I think it’s time we talked, don’t you?” Without waiting for an invitation, she sat down and crossed her shapely legs.\\n\\n Roy remained standing. “Actually, I think it’s time you left.”\\n\\n Aimee sighed. “There’s no need to be nasty.”\\n\\n “I mean it, Aimee.”\\n\\n She shook her head, her long, blond hair swinging softly from side to side. “Roy, this is ridiculous! You refuse to have anything to do with your father—”\\n\\n “I have nothing to say to him or to you.”\\n\\n “That’s sad, because we both want to reconcile with you.”\\n\\n His gaze narrowed. “I don’t think I can bring myself to call you Mother.”\\n\\n She laughed, shrugging off his sarcasm. “I don’t think you should. Tell me, how are you?”\\n\\n “Fine. Now leave.”\\n\\n “I’ve come all this way, and I’m not going until you talk to me.”\\n\\n Roy lowered himself stiffly into his chair. “What do you want?”\\n\\n Aimee’s expression became petulant. “I always hated it when you used that tone of voice with me.” As if she suddenly felt hot, she unfastened the buttons of her coat and slipped her arms free.\\n\\n Roy stared at the mink and at the silk suit beneath, set off by a stunning emerald brooch. “I see Daddy’s buying you lots of gifts.”\\n\\n Aimee raised one elegant shoulder. “You might not believe this, but I happen to love your father.”\\n\\n Roy raised his eyes to the ceiling. “Yeah, and I’ll bet you love his bank balance even more.” He’d understood long ago that Aimee had set her sights on his father from the beginning of their so-called relationship. He’d been used, and it wasn’t going to happen again.\\n\\n Her lips thinned. “You can insult me all you want, but I will not take offense. I came because I want to build a bridge between you and your father.”\\n\\n Roy laughed outright. “The woman who blew up the bridge now wants to build one? I find that interesting.”\\n\\n “It’s true, Roy. It’s been five years. Your father and I have a very good life, but he misses you.” She pouted ever so slightly.\\n\\n “Why am I having trouble believing that?”\\n\\n “It’s true,” Aimee said a second time, even more insistently. “Talk to your father, okay? It’s what he wants. Me, too. I’d like us all to be friends.”\\n\\n “I’d like world peace myself.”\\n\\n “Burton’s your father!”\\n\\n “He made his choice and I’ve made mine.”\\n\\n Aimee reached for her purse and removed a gold cigarette case. “Do you mind if I smoke?”\\n\\n “I thought you quit.”\\n\\n “I am quitting.”\\n\\n “You were quitting five years ago.”\\n\\n She tapped the cigarette against the case, then inserted it between her lips. “It isn’t easy,” she muttered.\\n\\n “Sorry, there’s a no-smoking law.”\\n\\n “Whatever.” She returned the cigarette to the case, which she thrust back in her purse.\\n\\n “Just finish saying what you came to say and get out.”\\n\\n She looked hurt. “Burton wants to see you.”\\n\\n Roy didn’t consider the request. “What for?” he asked scornfully.\\n\\n “You’re his son. He loves you.”\\n\\n Roy frowned. “He has a unique way of showing his love. Let me see…I love my son. I wonder how I can best show him that love? I know! I’ll divorce my wife, destroy my family and steal his fiancée. That should do the trick. Well, guess what, it didn’t work.”\\n\\n “Roy, don’t you understand that what happened between me and your father just happened? Neither of us asked to fall in love with the other.”\\n\\n Roy’s hand shot up. “Spare me. I don’t buy that for a second. You no more love my father than you loved me. When I think of what a fool I was, I get sick to my stomach. It was never me you wanted. I see that now. You were always interested in my father and you used me to get to him.”\\n\\n Aimee flew to her feet. “That’s where you’re wrong. I do love Burton and he loves me. I love him enough to swallow my pride and approach you. Just talk to him, that’s all I ask.”\\n\\n “Sorry, but I’m not interested.”\\n\\n “I’d hoped your mother—”\\n\\n “Leave my mother out of this!”\\n\\n “I sent her a Christmas card,” Aimee said. “I thought the best way to reach you was through her.”\\n\\n Roy stood up and leaned against his desk. “You sent my mother a Christmas card? Why would you do such a thing? How was she supposed to take that?”\\n\\n “I didn’t write anything in it. I just wanted her to know I don’t bear her any ill will.”\\n\\n Roy stared at Aimee, completely stupefied. “Did it ever occur to you that she might be the one who bears ill will?”\\n\\n Aimee bit her pouting lower lip. Collagen injections? he wondered indifferently. “Not really.”\\n\\n “Thank God you never wanted to be her friend. I’d hate to think what you might have done if you’d actually liked her.”\\n\\n Aimee gave a little cry of dismay. “I didn’t do anything to her!”\\n\\n Despite his effort not to reveal his emotions, Roy felt himself clenching his jaw. “You stole her husband.”\\n\\n “I didn’t,” Aimee insisted. “Burton hadn’t been happy in years.”\\n\\n Roy ignored that. “Then my father cheated my mother in the divorce settlement. He took what should’ve been hers by hiding the money in offshore accounts.”\\n\\n “Burton would never do that,” Aimee said, shaking her head. The shimmering pale blond hair swung gently. Roy figured she was well aware of the effect.\\n\\n “Stay married to him,” he advised. “Now you know what he’ll do if a younger, sexier replacement comes along.”\\n\\n “Burton and I are deeply in love,” Aimee said. “Do you think it was easy coming here today? Well, it wasn’t. I thought—I hoped you’d at least listen to me, but I can see I was wrong.”\\n\\n “You can tell my father one thing,” Roy said angrily. “Tell him to—”\\n\\n “I don’t want to listen,” Shirley cried, and covered both her ears.\\n\\n “Me, neither.” Goodness followed suit. She hummed a special hymn to blot out the terse, angry words. When she felt it was safe, she lifted her hands from her ears.\\n\\n Mercy’s eyes were wide. “That boy has quite the vocabulary.”\\n\\n “You listened?”\\n\\n “Sure, why not? Aimee had it coming. That woman has some nerve, arriving out of the blue like that.”\\n\\n Shirley walked over to the door and peered out. “She’s gone now.”\\n\\n “Good riddance.”\\n\\n “What a mess,” Goodness said with a sigh. “I think she must genuinely love Roy’s father, otherwise she’d never have shown up at the office.”\\n\\n “She lacks discretion,” Shirley said sadly. “How could she possibly think that mailing Anne a Christmas card would help her cause?”\\n\\n “She’s feeling guilty.”\\n\\n “As well she should.”\\n\\n “We weren’t sent here to deal with Aimee,” Goodness reminded her friends. “That woman is going to require an entire legion of angels. Our concern is Roy.”\\n\\n “Oh, brother!” Mercy threw herself against the wall. “You won’t believe this.”\\n\\n “What?” Shirley tried to peek but Mercy stopped her. “Oh, look at Roy.”\\n\\n Goodness studied him. Roy was in an agitated state, pacing back and forth across the room. Although she was unable to read his thoughts, one glance told her that those thoughts were dark and angry. \\n\\n","sourceLink":"https://allnovel.net/those-christmas-angels-angels-everywhere-5/page-26.html","bookId":2629,"book":{"id":2629,"title":"Those Christmas Angels (Angels Everywhere #5)","description":"Storyline: Those Christmas Angels (Angels Everywhere #5) \\n New York Times bestselling author Debbie Macomber brings readers a much-awaited NEW angel story this month! This tale brings back reader favorites Shirley, Goodness and Mercy, who are matchmaking angels playing havoc on an unsuspecting couple. Combining elements of comedy and fantasy with the added joy of the Christmas season, THOSE CHRISTMAS ANGELS will make the perfect holiday gift! This new angel book follows Debbie\u0027s three HarperCollins novels and one MIRA book, SHIRLEY, GOODNESS AND MERCY (10/99), and will be in great demand.\\n","cover":"https://allnovel.net/images/those-christmas-angels-angels-everywhere-5.jpg","author":"Debbie Macomber","type":"Christian","source":"allnovel","link":"https://allnovel.net/those-christmas-angels-angels-everywhere-5.html","creation":"Oct 5, 2019 8:58:57 AM","modification":"Oct 5, 2019 10:08:33 PM"}}
