{"id":102008,"no":34,"title":"Page 34","content":"“Did you see Roy and Julie?” Goodness pointed. The proof of their success was sitting directly below.\\n\\n “I did,” Gabriel said, and nodded approvingly. “I must say you three used some unconventional methods to fulfill your mission. Tell me, what did Roy learn from all this?”\\n\\n A prayer couldn’t be answered unless there was a lesson learned.\\n\\n “His lesson was about love,” Shirley answered. “His mother’s love touched him. Her prayers for her son were heard by all of Heaven, and God sent us to show Roy that he could find love.”\\n\\n “Very good,” Gabriel said. “But then, you always knew that, didn’t you, Shirley?”\\n\\n The former Guardian Angel nodded. “I did. Anne was such a special child. I knew she’d grow up to be a special woman, and I was right.”\\n\\n “Can you give us a peek into the future?” Mercy asked, crowding between Goodness and Shirley in an effort to gain Gabriel’s attention.\\n\\n “Yes, please.” Goodness added her request.\\n\\n Only a few were granted the privilege of gazing into the future, and Gabriel was one.\\n\\n “Tell me about Anne,” Shirley pleaded.\\n\\n “Your Anne will continue to paint for a number of productive years.”\\n\\n “Angels?”\\n\\n “Yes, and landscapes. The fees she earns from the angel paintings will support her far and above what she ever imagined. She’ll become well-known for her work. In the years ahead, she’ll be recognized as a fine and talented artist. People will pay high prices to own one of Mary Fleming’s paintings.”\\n\\n “I’m so pleased,” Shirley said happily.\\n\\n “And to think it all started with you,” Goodness said to her. The instant the words were out, she realized what she’d done—alerted Gabriel to the fact that Shirley had appeared to Anne. She clapped both hands over her mouth.\\n\\n Gabriel, fortunately, didn’t seem to notice her slip.\\n\\n “What about Burton and Aimee?” Mercy asked.\\n\\n Gabriel’s sigh was heavy. “They’ll divorce in two years when she leaves him for another man. Burton will be stunned and hurt. He’ll become something of a recluse after that. Over time, Roy and his father will reconcile and the greatest joy of his life will be his grandchildren.”\\n\\n “I’m so sorry to hear his marriage to Aimee didn’t turn out the way he expected.”\\n\\n “Burton was a man who brokered misery,” Gabriel reminded them. “He brought about his own unhappiness.”\\n\\n “He never gave Anne the credit she deserved,” Shirley said. “How ironic that because of him, she’ll become a famous artist.”\\n\\n “What about Roy and Julie? Will they be happy?” Goodness asked.\\n\\n “Very much so,” Gabriel said, brightening. “Their marriage will be a good one. In the next five years, Julie will give birth to three children, two boys and a girl. All three will be athletic and intelligent. Their daughter, named Anne Darlene after her two grandmothers, will go on to be an Olympic swimmer. The boys will take after their father and eventually assume leadership of Fletcher Enterprises.”\\n\\n “What about Dean?”\\n\\n “He’ll retire soon, and then, at the age of eighty, he’ll die peacefully in his sleep.”\\n\\n “So he’ll be joining his wife in Heaven twenty Earth-years from now?”\\n\\n “Yes,” Gabriel replied. “Are you satisfied now?”\\n\\n Shirley, Goodness and Mercy nodded.\\n\\n “Ready?” he asked. In the distance, Goodness heard the strains of the heavenly choir as the angels gathered together to sing praise to the newborn King. But before she left Earth, Goodness had to know about Anne’s mother. She just had to know.\\n\\n Shirley stepped close to her side. “She was an artist, too, and a wonderful mother. I always had a soft spot in my heart for Anne and wanted to work with her after her mother’s death. God had other purposes for me, but He allowed me back into Anne’s life for just this short time. I’m very grateful.”\\n\\n So was Goodness.\\n\\n The strains of the heavenly choir were richer and more distinct as the four of them drew closer. Ah, but this was a special night on Earth, one filled with glory and goodwill toward mankind. A night that came only once a year when God smiled down on those He loved and sent His angels to shout out the glad news.\\n\\n WHERE ANGELS GO\\n\\n One\\n\\n The sights and sounds of Christmas were all around him. At home, the scent of evergreen mingled with ginger and spice, and multicolored lights glittered throughout the house. This was Harry Alderwood’s favorite time of year. He’d settled in Leavenworth, Washington, more than five decades ago, and he loved the way this town celebrated Christmas. Despite his eighty-six years and failing health, nothing could dampen his love of the season. Even sitting in Dr. Snellgrove’s office, with its spindly artificial Christmas tree, waiting for what he was sure would be bad news, Harry didn’t feel depressed. This appointment would probably drain him for the rest of the day, and yet it seemed pointless. He doubted there was anything left for Dr. Snellgrove to do. His heart was giving out; it was as simple as that.\\n\\n Harry wasn’t afraid of death. He often thought about it, especially with so many of his friends dying. He’d seen death, witnessed it countless times on the beaches of Normandy and the battlefields of Europe in World War II. He’d grieved when his own parents and his older brother, Ted, had passed away. He wasn’t afraid, though. Maybe he should be, but why worry about the inevitable?\\n\\n An exhausted young mother sat across the room, keeping her little girl entertained by reading to her. Looking at them, he found it hard to tell who needed the doctor most, mother or child. Both seemed to be suffering from bad colds. Harry was grateful for the distance between them, since his own immune system was so weak.\\n\\n Harry knew this would almost certainly be his last Christmas, and that saddened him. He’d always been a man of faith, and that faith had grown stronger as he grew older. Which was a natural progression, he supposed. He wondered if the angels celebrated Christmas in Heaven; he suspected they did. Harry figured he’d find out soon enough. Meanwhile, he was determined to make his last Christmas on Earth as special as he could for Rosalie. Already he was thinking of what he might do to show his wife of sixty-five years how much he loved her. Leaving Rosalie. That was his one regret….\\n\\n “Harry Alderwood.”\\n\\n He was caught up in his thoughts, and the nurse had to repeat his name before he heard her. She was a young woman named Kelly Shannon—or was it Shannon Kelly?—but he affectionately called her Nurse Ratched. She didn’t seem to mind.\\n\\n “Harry?”\\n\\n “Coming.” He needed a moment to clamber to his feet. Sometimes he forgot that his legs weren’t as steady as they used to be. Not long ago, he didn’t have a problem getting out of a chair, but these days he got so winded just standing, he could barely walk. Growing old wasn’t for sissies, that was for sure.\\n\\n Using his cane for leverage, he slowly pulled himself upright, smiled at the young mother across from him and carefully placed one foot in front of the other. More and more, walking even a few yards was a chore. Still, he waved off Nurse Ratched’s offer of assistance. He took several deep breaths and winked as he walked past her. She smiled, adjusting the holly brooch she wore on her crisp white uniform.\\n\\n He liked her attention to Christmas. And he was grateful that she didn’t rush him. That was the problem with people these days. They all seemed to be in a hurry, stepping around him, practically pushing him aside, in an effort to get ahead in the grocery store or the parking lot. Didn’t these folks realize he was moving as fast as he could? A few years ago, he used to be just like them, trying to get someplace quickly and then, once he arrived, wondering why he’d been in such a hurry.\\n\\n “Your color’s good this morning,” Nurse Ratched said as she held open the door of the examining room and waited for Harry to move inside. “You must be feeling better.”\\n\\n Harry never did understand why other people made assumptions about how he felt. No one really wanted the truth. Well, okay…maybe doctors and nurses did. But when it came to friends and acquaintances, he wasn’t interested in discussing his health. He accepted the likelihood of illness and the certainty of death, although he didn’t want to get there any sooner than necessary.\\n\\n “Have a chair.” Dr. Snellgrove’s nurse pointed to the one against the wall.\\n\\n It took Harry a long time to reach that chair and sit down again.\\n\\n The nurse, chattering in a friendly manner, checked his blood pressure, which was normal, took his temperature, which was also normal, and then after asking the usual questions, left the room, closing the door behind her.\\n\\n Five minutes later, Dr. Snellgrove appeared. Harry still found it a bit disconcerting to have such a young doctor; Paul Snellgrove barely looked old enough to shave, let alone make life-and-death decisions. Harry had met a number of young physicians lately, both men and women. That was a good thing, in his opinion—even though their youth reminded Harry of his own age. But these newly minted doctors tended to be idealistic, which he approved of, and they were up on all the latest technology, treatments and medications. The only problem was that they could be a bit unrealistic, seeing death as the enemy when sometimes, at the end of a long life or debilitating illness, it was a friend. Dr. Snellgrove wasn’t like that, though. Three or four years ago, he’d bought out Harry’s longtime physician’s practice. Harry admired the kid.\\n\\n “What can I do for you?” Dr. Snellgrove asked, sitting on a stool and sliding it over so he was eye to eye with Harry.\\n\\n Harry rested both hands on his cane, one on top of the other. “I’m having trouble breathing again.” This wasn’t a new complaint. It’d gotten worse, though. Twice in the past week, he’d woken in the middle of the night, unable to catch his breath. Both times he’d thought he was dying. He hoped to go gentle and easy, in his sleep or something like that, not sitting up in bed gasping for air and frightening poor Rosalie into a panic.\\n\\n The young doctor asked him a few more questions. Harry already knew the problem. His heart was tired, which might not be medical terminology but seemed pretty accurate, and sometimes it just took a brief pause. The pacemaker was supposed to help and it’d worked fine for the most part…until recently.\\n\\n “There’s not much I can do for you, Mr. Alderwood, much as I hate to admit it,” the physician told him. His eyes were serious as they met Harry’s.\\n\\n Harry appreciated that the other man didn’t look away and was willing to tell him the truth. He was ready to release his hold on life. Almost ready. There was one thing he still had to accomplish, one arrangement he still had to make, and he needed enough time to do it. “No new pill?” He’d swallowed an entire pharmacy full now. Twenty-six prescriptions at last count—not all at once, of course. Thankfully, due to his years of military service, the government helped pay the cost of those many expensive drugs.\\n\\n “No, Harry, I’m sorry. No miracle pills this week.” \\n\\n","sourceLink":"https://allnovel.net/those-christmas-angels-angels-everywhere-5/page-34.html","bookId":2629,"book":{"id":2629,"title":"Those Christmas Angels (Angels Everywhere #5)","description":"Storyline: Those Christmas Angels (Angels Everywhere #5) \\n New York Times bestselling author Debbie Macomber brings readers a much-awaited NEW angel story this month! This tale brings back reader favorites Shirley, Goodness and Mercy, who are matchmaking angels playing havoc on an unsuspecting couple. Combining elements of comedy and fantasy with the added joy of the Christmas season, THOSE CHRISTMAS ANGELS will make the perfect holiday gift! This new angel book follows Debbie\u0027s three HarperCollins novels and one MIRA book, SHIRLEY, GOODNESS AND MERCY (10/99), and will be in great demand.\\n","cover":"https://allnovel.net/images/those-christmas-angels-angels-everywhere-5.jpg","author":"Debbie Macomber","type":"Christian","source":"allnovel","link":"https://allnovel.net/those-christmas-angels-angels-everywhere-5.html","creation":"Oct 5, 2019 8:58:57 AM","modification":"Oct 5, 2019 10:08:33 PM"}}
