{"id":102024,"no":52,"title":"Page 52","content":"She hadn’t mentioned the appearance of the angel. Not since he’d told her about it. Afterward, Harry had done quite a bit of thinking. That angel had been real. As real as Rosalie. Most important, she’d been there, at his side. Harry would never have made it back to bed without her.\n That led him to remember again what the young doctor had told him. Anytime, Dr. Snellgrove had said. Death was getting close. Harry could feel it. Every day he seemed to grow weaker. Every day it became more difficult to accomplish even the simplest and most mundane tasks, such as dressing and shaving. When he’d finished brushing his teeth, he was nearly too weak to stand.\n “I thought I’d bake cinnamon rolls for breakfast Christmas morning,” Rosalie was saying as she stalked through the family room, a feather duster in one hand. She swiped the thing every which way, swirling up dust left and right.\n “Rosalie,” Harry protested.\n “Sorry, sweetheart, but I want the house to look its best for the girls.”\n In a blur, his wife dashed past him and into the next room. Where she found the energy, Harry couldn’t even imagine. Next he caught sight of her fluffing up the sofa pillow, squeezing it hard, then pounding it into place. Harry couldn’t help smiling.\n “Rosalie,” he called out. “Sit down a minute, would you? I’m getting tired just watching you.”\n “I don’t have time to sit.”\n “I need to talk to you.”\n “All right, all right.” The way she breezed into the room reminded him of Loretta Young’s entrance on her television show in the fifties. He’d seen that moment hundreds of times, and it lingered in his mind to this day. Rosalie had been every bit as beautiful as Loretta Young back then. Still was, in his opinion.\n “Sit.” Harry pointed to her chair, which stood next to his own. They shared an end table and a lamp.\n “Yes, sweetheart?” She sat on the very edge of her seat, signaling her impatience to get on with her work.\n “I was thinking we should talk about Liberty Orchard.”\n “Harry Alderwood, I told you—I don’t have time to talk about this now.”\n “Please?” he asked quietly. It had been weighing on him all day.\n Rosalie released a gusty sigh that the neighbors could probably have heard if they’d been listening. “Must we?”\n “It would put my mind at rest,” he told her.\n She sighed again, accepting that he wasn’t going to let this drop. “Fine. If you feel it’s that important, then let’s talk.”\n Harry was grateful. If possible, he’d like Rosalie’s future settled before the girls arrived. He knew it was necessary to set things in motion, which meant they had to secure the unit. Harry felt an urgency that his recent heavenly visitation had only heightened. He might have mere days to live. Mere days to arrange all of this.\n “You said you didn’t want to think about moving until after the holidays,” he began, “but—”\n “I don’t,” Rosalie broke in. “I’ve got enough to do with the girls and their husbands coming here for Christmas.”\n “I agree.”\n She seemed surprised by that.\n “But,” he added before she could crow at her apparent victory, “I’d be more comfortable if we told the administrator we’ve decided to take the unit.”\n Rosalie hesitated. “Do you really think a few more days will make that much difference?”\n “Yes,” Harry said firmly. “It’d give me peace of mind.”\n Rosalie folded her hands in her lap. “I don’t know, Harry…”\n “What’s to know?” Dear heaven, Rosalie couldn’t have changed her mind already, could she?\n “Harry, we’ve been in this house for so many years. To give it up like this…I don’t think I’m ready.”\n “You said—”\n She held up her hand. “I know what I said. Yes, we had a good time at Liberty Orchard. Lucy’s always been a persuasive person. And at first I was excited to see my friends again, but now…” She let the words fade and refused to meet his eyes.\n “But now?” Harry prodded.\n “Now I’m not sure we should be in such a rush. Let’s talk to the girls about it some more.”\n “They’ll agree with me.”\n “I agree with you, too, Harry. But why do we have to do it right this minute? It’s going to be hard on me to leave this house, you know.”\n “I know. For me, too.” It would be even harder for him to leave Rosalie and his family.\n “I’m going to call the administrator,” he said.\n “Harry!” Rosalie gasped.\n “If we change our minds, we’ll only be out a few hundred dollars.” Despite what Rosalie thought, Harry was convinced Mrs. Goldsmith hadn’t been lying. He believed someone else was interested in that unit. So he wanted to make the deposit immediately.\n “A few hundred dollars?” Rosalie repeated in a stunned voice. “Since when have we ever had money to burn, Harry Alderwood?”\n As children of the Depression, Harry and Rosalie had lived frugally. They’d budgeted their entire lives and saved ten percent of every dollar earned. Neither one wasted anything. Rosalie even kept those plastic bags from the grocery store. Young people these days didn’t know the value of a dollar. And credit cards! He’d seen more people get into financial trouble because of those cards.\n “This will be money well invested,” Harry assured his wife.\n Rosalie continued to look uncertain. “If you’re positive this is what you want—”\n “It is,” Harry said, cutting her off. “You know, Rosalie, that angel was real.”\n She frowned.\n “I needed help. I collapsed and I couldn’t get up. I wouldn’t have managed without her.”\n Her frown deepened. “You’re on a lot of medication.”\n He realized this was the rationale Donna must have offered her mother when he’d heard the two of them discussing the incident. In fact, that conversation was what had prompted his youngest daughter to visit a day early. “All I know is that I was in trouble and I didn’t have my walker and then…I was back in bed.”\n “Why didn’t you call me? If you needed help, I would’ve come right away.”\n “I would have if I’d had the strength.” As he recalled, Harry had made an effort to rouse his wife, to no avail. Not that she could’ve helped him up or supported him on the walk into the bedroom.\n Rosalie got to her feet. “I can see you’re determined, so go ahead and make that phone call,” she said. “We’ll both adjust. You’re right, Harry. If it was up to me, I’d put off the move indefinitely. We need to start making plans.”\n Relief washed over him. As soon as his wife went back to her fussing and cleaning, Harry removed his wallet from his hip pocket—a procedure that left him short of breath—and took out the business card the administrator had given him.\n Elizabeth Goldsmith.\n He reached for the portable phone. They had three phones in the house, thanks to Lorraine. One in the bedroom, another in the kitchen and the third next to his recliner on the small end table.\n Although it was a Saturday, the administrator had promised him she’d be available.\n A woman with a pleasant voice answered the phone. “Liberty Orchard,” she said brightly. “How might I direct your call?”\n “I’d like to speak with Elizabeth Goldsmith.”\n “One moment, please.”\n “Thank you.” Harry closed his eyes, afraid that if Rosalie looked his way, she might try to talk him into waiting, despite the fact that he’d made the best decision. The only decision.\n “Elizabeth Goldsmith,” he heard half a minute later.\n “Harry Alderwood,” he returned. He didn’t understand why people felt they had to announce their names when they answered the phone. He knew whom he’d called and presumably Elizabeth knew who she was. He’d noticed that it had become a common business practice in the last few years.\n “Ah, yes, we spoke recently, didn’t we?” Elizabeth said.\n “My wife, Rosalie, and I were by to see the facility a few days ago.”\n “Ah, yes. You’re friends of Lucy Menard’s, aren’t you?”\n “Yes.”\n Harry got right to the point. “When we spoke, you confirmed that you had one unit open.”\n “Yes.” Elizabeth paused. “But—”\n He continued to speak, eager to get this done. “We discussed my giving you a check to secure that unit,” he said.\n “Yes, I do recall that I urged you to make the deposit right away.”\n He was well aware of that and had thought of little else since their meeting.\n “I mentioned that there was only one unit open, didn’t I?” she went on.\n “Yes.” Harry was beginning to worry just a bit.\n “And I did mention that someone else had shown an interest?”\n “Yes, you did.”\n “Well, I’m afraid, Mr. Alderwood, that the first party came back the following day with a check.”\n “You mean…the unit’s already been taken?” He could hear the stunned disbelief in his own voice.\n “I’m afraid so. And unfortunately there was only the one.”\n He wished she’d quit reminding him of that.\n “How soon will you have another unit available?” Harry asked, still in shock.\n Elizabeth considered her answer. “That’s difficult to say. It could be three months but it might be as long as six.”\n “Oh.”\n “I’m sorry, Mr. Alderwood.”\n “No…no, I’m the one who’s sorry. You suggested we decide quickly and I thought we had.”\n “If there’s anything else I can do for you, please let me know. Oh, and in the meantime, Merry Christmas.”\n “Thank you. Merry Christmas to you.” He put back the phone and released a deep sigh of regret, knowing he should have taken action that very day.\n Now it was too late.\n Too late for him.\n In three months’ time he wouldn’t be here. In three months’ time Rosalie would be a widow.\n Sixteen\n Beth slept fitfully all night. She couldn’t escape the thoughts tumbling crazily through her mind, but every once in a while exhaustion overtook her, and she’d slip into a light sleep. Then she’d dream—dreams filled with John. And the shock of what she’d discovered would jerk her awake. Before long, the whole process would start all over again.\n In the morning, she was blurry-eyed and her temples were throbbing with the beginnings of a headache. Despite how she felt, she had no choice but to attend Mass. James and Bella, her nephew and niece, were participating in a special Christmas program. Not to show up would disappoint them. Besides, her entire family would be there; it was easier to make the effort and go now than to offer excuses later.\n Before she left, Beth swallowed two aspirin with a glass of orange juice. Her mother had planned a large brunch afterward. \n","sourceLink":"https://allnovel.net/those-christmas-angels-angels-everywhere-5/page-52.html","bookId":2629,"book":{"id":2629,"title":"Those Christmas Angels (Angels Everywhere #5)","description":"Storyline: \n Those Christmas Angels (Angels Everywhere #5) \n New York Times bestselling author Debbie Macomber brings readers a much-awaited NEW angel story this month! This tale brings back reader favorites Shirley, Goodness and Mercy, who are matchmaking angels playing havoc on an unsuspecting couple. Combining elements of comedy and fantasy with the added joy of the Christmas season, THOSE CHRISTMAS ANGELS will make the perfect holiday gift! This new angel book follows Debbie\u0027s three HarperCollins novels and one MIRA book, SHIRLEY, GOODNESS AND MERCY (10/99), and will be in great demand.\n \n","cover":"https://allnovel.net/images/those-christmas-angels-angels-everywhere-5.jpg","author":"Debbie Macomber","type":"Christian","source":"allnovel","link":"https://allnovel.net/those-christmas-angels-angels-everywhere-5.html","creation":"Oct 5, 2019 8:58:57 AM","modification":"Oct 5, 2019 10:08:33 PM"}}
