{"id":86347,"no":14,"title":"Page 14","content":"\\n\\n “Is that a yes?”\\n\\n “Yes,” Nicky said, trying to appear composed and calm.\\n\\n “I’m going to tie your hands to the bedposts. After I tie you to the bed, I’m going to suck your beautiful cock.”\\n\\n Nicky’s attention was drawn to Marco’s sensuous mouth, those full, soft lips. They felt so wonderful on his cock. His cock certainly liked the idea, sitting up and paying immediate attention.\\n\\n “Now, let’s get you tied to the bed.” Marco pulled a length of leather strap from the drawer beside the bed. The mattress dipped down as Marco put his weight on it, rolling Nicky toward him slightly. Nicky held himself back from taking tastes and licks while Marco tied each wrist to a bedpost. With Nicky bound, Marco bent, and softly kissed Nicky’s lips. He straddled Nicky’s legs and moved down to his where his cock anxiously waited. Soft lips slid up and down, the heavy wet suction teasing an orgasm from Nicky’s balls. Marco spent a long time moving up and down, taking Nicky far back in his throat, and using his tongue to lick the underside as he made his upward slide. When Nicky thought he was about to come, Marco pulled free with an abrupt sucking sound. Cool air brushed across Nicky’s aching erection.\\n\\n “No, Marco, more.”\\n\\n “No, baby.” His gaze was heavy-lidded, dark with desire. “Legs up.”\\n\\n Nicky drew up his knees toward his chest. Marco pulled out a longer piece of leather. He looped it under Nicky’s knees and tied both ends to the head board behind him. Nicky had never felt so vulnerable before, his hands tethered securely and his legs tied so his ass was up in the air. He whimpered in uneasiness, but Marco soothed him, caressing his legs and whispering sweet love words to him. He put some oil on his fingertips and eased one digit inside Nicky. Nicky bore down hard on the finger, remembering the fullness of Marco’s cock buried inside him, desperate to be filled again.\\n\\n Marco reached into the drawer one more time and pulled out a hard, rubber dildo. He slicked it with oil and pressed it gently against Nicky’s hole.\\n\\n Nicky shifted uneasily. “No, Marco. I don’t think…”\\n\\n “Hush baby, I’m going to be gentle with you. Relax and let it in. It’ll feel good, sweetheart. You’ll enjoy it. We both will.”\\n\\n Nicky tried to relax and Marco gently eased the hard rubber inside him. “Push out against it, honey. That’s right.” Finally, the tight ring of muscles relaxed, and the dildo slipped all the way in. The width of it was much like Marco’s, filling and stretching him. Nicky drew in a deep breath. “Oh!” The tip pressed against his prostate.\\n\\n Marco waggled the end of it just a bit at the same time he bent over to enclose Nicky’s shaft with his hot mouth, working the dildo in his ass and his mouth over Nicky’s cock in unison. Nicky’s climax was nearly at the breaking point. Bucking his hips to push himself over the edge, he yelled out his pleasure. Immediately, Marco put his hand in a tight ring around the base of Nicky’s cock, effectively stopping his orgasm before it barely began, causing him to groan and plead, shudders still racking his body. Marco held the dildo very still, his thumb and forefinger tightly around Nicky’s cock until he began to settle down. Then he slowly drew it out, causing Nicky to cry out. “No, no. I need…”\\n\\n “Shh…I know what you need.”\\n\\n He untied the strap around Nicky’s knees and pulled his legs around his own hips, fitting his cock neatly up into Nicky’s aching opening. The blessed warmth filled and soothed him as Marco bent to kiss his lips and took hold of his cock. Moving his hand quickly up and down, at the same time Marco pumped his hips, ramming his cock deep into Nicky. In moments, Nicky came explosively, so hard it was painful, completely draining and depleting him. Marco came a moment afterward and fell down beside him, panting. He untied Nicky’s hands and pulled him into his arms, holding and soothing him as the shudders still occasionally swept over his body.\\n\\n Marco held him in his arms for over a quarter of an hour, soothing and loving him. “Now do you understand what it means to submit? You’re allowing me to pleasure you and pleasure myself at the same time. It’s difficult to give yourself over to another man and let him completely own you. It takes a special kind of strong will and a great deal of trust. It’s the most intimate type of relationship, I think, requiring complete commitment on both sides. You give me the control, and I commit to taking care of your every need and dedicate myself to you totally. Do you want that for us, Nicky?”\\n\\n Nicky thought about it for a moment. Yes, he wanted that kind of commitment, it was the whole submissive thing when they weren’t in bed that he had trouble with. Wanting to totally own and be owned by Marco won out against his qualms. “Yes, I do.”\\n\\n Marco smiled and pulled him close again. They lay in each other’s arms and slept until it was time to go to supper.\\n\\n When they woke and got dressed to go downstairs, Nicky broached the subject again of going outside. “Can I talk you into letting me go outside with you? I see how beautiful it is here from the window, and I’d love to be outside for a while. Maybe it would be okay if you take me?”\\n\\n “You didn’t get enough yesterday?” He sighed. “Well, I guess that can be arranged. We can go for a walk now, if you want to, before supper. Will an hour or so be enough?”\\n\\n “Perfect.”\\n\\n Marco smiled down at him, his head cocked to the side as if listening. Nicky tried to make his mind as blank as possible not knowing if it worked or not. Marco moved away without any comment to give him a clue.\\n\\n Changed for walking in the woods, he said, “I’m taking you to a meal tonight, baby. I think you need some real food for a change and not just my blood. You’ve been very good today, haven’t you?”\\n\\n “Yes, sir.”\\n\\n “Okay, let’s go for our walk. You’re right, you do need some exercise. Then we’ll come back here and have dinner. Sound good?”\\n\\n “Very good.”\\n\\n Marco turned to regard him while he changed his shoes. “Are you sure you’re okay, baby? You seem kind of subdued.”\\n\\n “Isn’t that what you want, sir?”\\n\\n Marco looked surprised. “Uh, yeah, of course. It’s just that it doesn’t seem like you, honey. I kind of miss the little brat.”\\n\\n “Do I displease you, sir?”\\n\\n “No, no, of course not. I’m sorry, baby. I don’t mean to confuse you.”\\n\\n Nicky dropped his eyes, saying nothing, trying to keep his mind blank.\\n\\n “Okay, well, are you ready? Put on your shoes and a light jacket. It’s getting cooler outside.”\\n\\n “Yes, sir.” Nicky got up dutifully and went to the closet to get ready, then crossed back over to Marco’s side, waiting for the leash to be snapped on.\\n\\n Marco put his arm around him instead, and they walked out into the waning sunlight and the cool mountain air. Taking Nicky by the hand, he led him down a winding path through the woods to a small lake. The afternoon sunlight shimmered across the surface like a scattering of diamonds. The mountains of the Blue Ridge rose just beyond, the haze in the air causing them to take on their characteristic hue. Wispy clouds rose up from the hollows, looking like smoke.\\n\\n The sweet-smelling air was cool after being inside for so long, and Nicky shivered a bit in the breeze. Marco slipped his arm around him again. “Cold, baby? We can go back if you like.”\\n\\n “I’m fine, sir.”\\n\\n “Okay, you’re beginning to sound like a Stepford Wife, and it’s creeping me out.”\\n\\n “Don’t you want me to be docile and good?”\\n\\n “Yeah, but not like this. I want my Nicky back.” He turned and put his arms around his waist, bending his head to take Nicky’s lips. He swept his tongue inside Nicky’s mouth and nibbled on his bottom lip. Moving his hand down inside the waistband of his pants, he took hold of Nicky’s willing cock and rubbed his thumb gently over the tip. “This is mine, isn’t it, baby?”\\n\\n “Yes, sir!” Nicky sighed.\\n\\n Marco moved his other hand around to the cleft in Nicky’s ass and moved his hand slowly up and down it. “And this? This is mine too, right?”\\n\\n “Uh-huh.”\\n\\n Marco looked around and saw a secluded area nearby behind some bushes. He drew Nicky over toward it. “Then come and tell me all about it.”\\n\\n When he reached the spot, Marco tugged down his jeans and sat down on the soft carpet of pine needles, guiding Nicky in front of him. He quickly dispensed with Nicky’s pants and spit onto his hands and then turned Nicky around to spread the moisture on his hole. Pulling him onto his lap, he impaled him on his dick. Nicky gasped at the sudden burning pain, but soon the pain turned to pleasure as Marco bounced him up and down on his cock.\\n\\n “Tell me how much you love me, baby.”\\n\\n “So much…”\\n\\n “Say it!”\\n\\n “Oh, I love you, I love you.”\\n\\n “I love you too, darling.”\\n\\n “Marco,” Nicky breathed. Then for several minutes, it was impossible for him to do more than moan as Marco’s hips flexed, drawing in and out at the same time he moved Nicky up and down on his shaft. Each breath Nicky took made him tremble harder, and his heart raced so fast he thought he might pass out.\\n\\n “Look at me, baby.”\\n\\n Nicky turned his eyes toward him over his shoulder and met his beautiful gaze. Marco stilled his hands so Nicky settled down on his cock, leaning back against his shoulder, his hole rubbing up against the large gland on the base. His butt twitched and contracted around Marco’s large cock as he tried to control his breathing.\\n\\n “When we’re alone, I want you, only you, my Nicky. Do you understand?”\\n\\n “Yes, yes, darling.”\\n\\n “Good. I’ll be very cross with you if you don’t call me that when we’re intimate, understand?”\\n\\n “Yes, darling.” Nicky smiled.\\n\\n He moved him up and down again, and the pleasure doubled and redoubled inside Nicky until he thought he might explode. “Need, need it faster, please, Marco,” he cried, moving himself, bouncing his body and jerking his hips, ramming the stiff cock in deeper and harder. \\n\\n","sourceLink":"https://allnovel.net/the-alpha-s-pet-dark-hollow-wolf-pack-1/page-14.html","bookId":2253,"book":{"id":2253,"title":"The Alpha\u0027s Pet (Dark Hollow Wolf Pack #1)","description":"Storyline: The Alpha\u0027s Pet (Dark Hollow Wolf Pack #1) \\n Nicky Anderson is living a normal, if hectic life as an artist and part time waiter in a large city, when he’s attacked by a mugger who slashes his throat. When he awakens, he’s naked, and surrounded by large, muscular men. Nicky feels an immediate attraction to Marco, the most handsome man Nicky has ever seen, which is strange, since Nicky is straight. His attraction is overwhelming and downright embarrassing as he licks the man and tries to climb all over him. He soon discovers he’s the newest “pet” of the Mountain Wolf Pack, and Marco is his new master. Saved from certain death, has he exchanged one horrible fate for another? All he knows is that he’s in heat for this beautiful man. When he learns his new master is a wolf shapeshifter who demands his love and obedience, he begins to wonder just what he’s gotten himself into.\\n","cover":"https://allnovel.net/images/the-alpha-s-pet-dark-hollow-wolf-pack-1.jpg","author":"Shannon West","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-alpha-s-pet-dark-hollow-wolf-pack-1.html","creation":"Oct 5, 2019 8:58:31 AM","modification":"Oct 5, 2019 5:13:18 PM"}}
