{"id":38078,"no":4,"title":"III. — CHICKENS","content":"For the benefit of the bewildered reader it should be said that there are two distinct species of chickens. There is the chicken which you find in the barnyard, in the incubator, or on a hat. And there is the type indigenous to State Street, Chicago. Each is known by its feathers. The barnyard variety may puzzle the amateur fancier, but there is no mistaking the State Street chicken. It is known by its soiled, high, white canvas boots; by its tight, short black skirt; by its slug pearl earrings; by its bewildering coiffure. By every line of its slim young body, by every curve of its cheek and throat you know it is adorably, pitifully young. By its carmined lip, its near-smart hat, its babbling of “him,” and by the knowledge which looks boldly out of its eyes you know it is tragically old. Seated in the Pullman car, with a friendly newspaper protecting her bright hair from the doubtful gray-white of the chair cover, Emma McChesney, traveling saleswoman for T. A. Buck\u0027s Featherloom Petticoats, was watching the telegraph poles chase each other back to Duluth, Minnesota, and thinking fondly of Mary Cutting, who is the mother-confessor and comforter of the State Street chicken. Now, Duluth, Minnesota, is trying to be a city. In watching its struggles a hunger for a taste of the real city had come upon Emma McChesney. She had been out with her late Fall line from May until September. Every Middle-Western town of five thousand inhabitants or over had received its share of Emma McChesney\u0027s attention and petticoats. It had been a mystifyingly good season in a bad business year. Even old T. A. himself was almost satisfied. Commissions piled up with gratifying regularity for Emma McChesney. Then, quite suddenly, the lonely evenings, the lack of woman companionship, and the longing for a sight of her seventeen-year-old son had got on Emma McChesney\u0027s nerves. She was two days ahead of her schedule, whereupon she wired her son, thus: “Dear Kid: “Meet me Chicago usual place Friday large time my treat. MOTHER.” Then she had packed her bag, wired Mary Cutting that she would see her Thursday, and had taken the first train out for Chicago. You might have found the car close, stuffy, and uninteresting. Ten years on the road had taught Emma McChesney to extract a maximum of enjoyment out of a minimum of material. Emma McChesney\u0027s favorite occupation was selling T. A. Buck\u0027s Featherloom Petticoats, and her favorite pastime was studying men and women. The two things went well together. When the train stopped for a minute or two you could hear a faint rattle and click from the direction of the smoking compartment where three jewelry salesmen from Providence, Rhode Island, were indulging in their beloved, but dangerous diversion of dice throwing. Just across the aisle was a woman, with her daughter, Chicago-bound to buy a trousseau. They were typical, wealthy small-town women smartly garbed in a fashion not more than twenty minutes late. In the quieter moments of the trip Emma McChesney could hear the mother\u0027s high-pitched, East End Ladies\u0027 Reading Club voice saying: “I\u0027d have the velvet suit made fussy, with a real fancy waist to for afternoons. You can go anywhere in a handsome velvet three-piece suit.” The girl had smiled, dreamily, and gazed out of the car window. “I wonder,” she said, “if there\u0027ll be a letter from George. He said he would sit right down and write.” In the safe seclusion of her high-backed chair Emma McChesney smiled approvingly. Seventeen years ago, when her son had been born, and ten years ago, when she had got her divorce, Emma McChesney had thanked her God that her boy had not been a girl. Sometimes, now, she was not so sure about it. It must be fascinating work—selecting velvet suits, made “fussy,” for a daughter\u0027s trousseau. Just how fully those five months of small-town existence had got on her nerves Emma McChesney did not realize until the train snorted into the shed and she sniffed the mingled smell of smoke and stockyards and found it sweet in her nostrils. An unholy joy seized her. She entered the Biggest Store and made for the millinery department, yielding to an uncontrollable desire to buy a hat. It was a pert, trim, smart little hat. It made her thirty-six years seem less possible than ever, and her seventeen-year-old son an absurdity. It was four-thirty when she took the elevator up to Mary Cutting\u0027s office on the tenth floor. She knew she would find Mary Cutting there—Mary Cutting, friend, counselor, adviser to every young girl in the great store and to all Chicago\u0027s silly, helpless “chickens.” A dragon sat before Mary Cutting\u0027s door and wrote names on slips. But at sight of Emma McChesney she laid down her pencil. “Well,” smiled the dragon, “you\u0027re a sight for sore eyes. There\u0027s nobody in there with her. Just walk in and surprise her.” At a rosewood desk in a tiny cozy office sat a pink-cheeked, white-haired woman. You associated her in your mind with black velvet and real lace. She did not look up as Emma McChesney entered. Emma McChesney waited for one small moment. Then: “Cut out the bank president stuff, Mary Cutting, and make a fuss over me,” she commanded. The pink-cheeked, white-haired woman looked up. You saw that her eyes were wonderfully young. She made three marks on a piece of paper, pushed a call-button at her desk, rose, and hugged Emma McChesney thoroughly and satisfactorily, then held her off a moment and demanded to know where she had bought her hat. “Got it ten minutes ago, in the millinery department downstairs. Had to. If I\u0027d have come into New York after five months\u0027 exile like this I\u0027d probably have bought a brocade and fur-edged evening wrap, to relieve this feeling of wild joy. For five months I\u0027ve spent my evenings in my hotel room, or watching the Maude Byrnes Stock Company playing “Lena Rivers,” with the ingenue coming out between the acts in a calico apron and a pink sunbonnet and doing a thing they bill as vaudeville. I\u0027m dying to see a real show—a smart one that hasn\u0027t run two hundred nights on Broadway—one with pretty girls, and pink tights, and a lot of moonrises, and sunsets and things, and a prima donna in a dress so stunning that all the women in the audience are busy copying it so they can describe it to their home-dressmaker next day.” “Poor, poor child,” said Mary Cutting, “I don\u0027t seem to recall any such show.” “Well, it will look that way to me, anyway,” said Emma McChesney. “I\u0027ve wired Jock to meet me to-morrow, and I\u0027m going to give the child a really sizzling little vacation. But to-night you and I will have an old-girl frolic. We\u0027ll have dinner together somewhere downtown, and then we\u0027ll go to the theater, and after that I\u0027m coming out to that blessed flat of yours and sleep between real sheets. We\u0027ll have some sandwiches and beer and other things out of the ice-box, and then we\u0027ll have a bathroom bee. We\u0027ll let down our back hair, and slap cold cream around, and tell our hearts\u0027 secrets and use up all the hot water. Lordy! It will be a luxury to have a bath in a tub that doesn\u0027t make you feel as though you wanted to scrub it out with lye and carbolic. Come on, Mary Cutting.” Mary Cutting\u0027s pink cheeks dimpled like a girl\u0027s. {Illustration: “\u0027You\u0027ll never grow up, Emma McChesney\u0027”} “You\u0027ll never grow up, Emma McChesney—at least, I hope you never will. Sit there in the corner and be a good child, and I\u0027ll be ready for you in ten minutes.” Peace settled down on the tiny office. Emma McChesney, there in her corner, surveyed the little room with entire approval. It breathed of things restful, wholesome, comforting. There was a bowl of sweet peas on the desk; there was an Indian sweet grass basket filled with autumn leaves in the corner; there was an air of orderliness and good taste; and there was the pink-cheeked, white-haired woman at the desk. “There!” said Mary Cutting, at last. She removed her glasses, snapped them up on a little spring-chain near her shoulder, sat back, and smiled upon Emma McChesney. Emma McChesney smiled back at her. Theirs was not a talking friendship. It was a thing of depth and understanding, like the friendship between two men. They sat looking into each other\u0027s eyes, and down beyond, where the soul holds forth. And because what each saw there was beautiful and sightly they were seized with a shyness such as two men feel when they love each other, and so they awkwardly endeavored to cover up their shyness with words. “You could stand a facial and a decent scalp massage, Emma,” observed Mary Cutting in a tone pregnant with love and devotion. “Your hair looks a little dry. Those small-town manicures don\u0027t know how to give a real treatment.” “I\u0027ll have it to-morrow morning, before the Kid gets in at eleven. As the Lily Russell of the traveling profession I can\u0027t afford to let my beauty wane. That complexion of yours makes me mad, Mary. It goes through a course of hard water and Chicago dirt and comes up looking like a rose leaf with the morning dew on it. Where\u0027ll we have supper?” “I know a new place,” replied Mary Cutting. “German, but not greasy.” She was sorting, marking, and pigeonholing various papers and envelopes. When her desk was quite tidy she shut and locked it, and came over to Emma McChesney. “Something nice happened to me to-day,” she said, softly. “Something that made me realize how worth while life is. You know we have five thousand women working here—almost double that during the holidays. A lot of them are under twenty and, Emma, a working girl, under twenty, in a city like this—Well, a brand new girl was looking for me today. She didn\u0027t know the way to my office, and she didn\u0027t know my name. So she stopped one of the older clerks, blushed a little, and said, \u0027Can you tell me the way to the office of the Comfort Lady?\u0027 That\u0027s worth working for, isn\u0027t it, Emma McChesney?” “It\u0027s worth living for,” answered Emma McChesney, gravely. “It—it\u0027s worth dying for. To think that those girls come to you with their little sacred things, their troubles, and misfortunes, and unhappinesses and—” “And their disgraces—sometimes,” Mary Cutting finished for her. “Oh, Emma McChesney, sometimes I wonder why there isn\u0027t a national school for the education of mothers. I marvel at their ignorance more and more every day. Remember, Emma, when we were kids our mothers used to send us flying to the grocery on baking day? All the way from our house to Hine\u0027s grocery I\u0027d have to keep on saying, over and over: \u0027Sugar, butter, molasses; sugar, butter, molasses; sugar, butter, molasses.\u0027 If I stopped for a minute I\u0027d forget the whole thing. It isn\u0027t so different now. Sometimes at night, going home in the car after a day so bad that the whole world seems rotten, I make myself say, over and over, as I used to repeat my \u0027Sugar, butter, and molasses.\u0027 \u0027It\u0027s a glorious, good old world; it\u0027s a glorious, good old world; it\u0027s a glorious, good old world.\u0027 And I daren\u0027t stop for a minute for fear of forgetting my lesson.” For the third time in that short half-hour a silence fell between the two—a silence of perfect sympathy and understanding. Five little strokes, tripping over each other in their haste, came from the tiny clock on Mary Cutting\u0027s desk. It roused them both. “Come on, old girl,” said Mary Cutting. “I\u0027ve a chore or two still to do before my day is finished. Come along, if you like. There\u0027s a new girl at the perfumes who wears too many braids, and puffs, and curls, and in the basement misses\u0027 ready-to-wear there\u0027s another who likes to break store rules about short-sleeved, lace-yoked lingerie waists. And one of the floor managers tells me that a young chap of that callow, semi-objectionable, high-school fraternity, flat-heeled shoe type has been persistently hanging around the desk of the pretty little bundle inspector at the veilings. We\u0027re trying to clear the store of that type. They call girls of that description chickens. I wonder why some one hasn\u0027t found a name for the masculine chicken.” {Illustration: “\u0027Well, s\u0027long, then, Shrimp. See you at eight\u0027”} “I\u0027ll give \u0027em one,” said Emma McChesney as they swung down a broad, bright aisle of the store. “Call \u0027em weasels. That covers their style, occupation, and character.” They swung around the corner to the veilings, and there they saw the very pretty, very blond, very young “chicken” deep in conversation with her weasel. The weasel\u0027s trousers were very tight and English, and his hat was properly woolly and Alpine and dented very much on one side and his heels were fashionably flat, and his hair was slickly pompadour. Mary Cutting and Emma McChesney approached them very quietly just in time to hear the weasel say: “Well, s\u0027 long then, Shrimp. See you at eight.” And he swung around and faced them. That sick horror of uncertainty which had clutched at Emma McChesney when first she saw the weasel\u0027s back held her with awful certainty now. But ten years on the road had taught her self-control, among other things. So she looked steadily and calmly into her son\u0027s scarlet face. Jock\u0027s father had been a liar. She put her hand on the boy\u0027s arm. “You\u0027re a day ahead of schedule, Jock,” she said evenly. “So are you,” retorted Jock, sullenly, his hands jammed into his pockets. “All the better for both of us, Kid. I was just going over to the hotel to clean up, Jock. Come along, boy.” The boy\u0027s jaw set. His eyes sought any haven but that of Emma McChesney\u0027s eyes. “I can\u0027t,” he said, his voice very low. “I\u0027ve an engagement to take dinner with a bunch of the fellows. We\u0027re going down to the Inn. Sorry.” A certain cold rigidity settled over Emma McChesney\u0027s face. She eyed her son in silence until his miserable eyes, perforce, looked up into hers. “I\u0027m afraid you\u0027ll have to break your engagement,” she said. She turned to face Mary Cutting\u0027s regretful, understanding gaze. Her eyebrows lifted slightly. Her head inclined ever so little in the direction of the half-scared, half-defiant “chicken.” “You attend to your chicken, Mary,” she said. “I\u0027ll see to my weasel.” So Emma McChesney and her son Jock, looking remarkably like brother and sister, walked down the broad store aisles and out into the street. There was little conversation between them. When the pillared entrance of the hotel came into sight Jock broke the silence, sullenly: “Why do you stop at that old barracks? It\u0027s a rotten place for a woman. No one stops there but clothing salesmen and boobs who still think it\u0027s Chicago\u0027s leading hotel. No place for a lady.” “Any place in the world is the place for a lady, Jock,” said Emma McChesney quietly. Automatically she started toward the clerk\u0027s desk. Then she remembered, and stopped. “I\u0027ll wait here,” she said. “Get the key for five-eighteen, will you please? And tell the clerk that I\u0027ll want the room adjoining beginning to-night, instead of to-morrow, as I first intended. Tell him you\u0027re Mrs. McChesney\u0027s son.” He turned away. Emma McChesney brought her handkerchief up to her mouth and held it there a moment, and the skin showed white over the knuckles of her hand. In that moment every one of her thirty-six years were on the table, face up. “We\u0027ll wash up,” said Emma McChesney, when he returned, “and then we\u0027ll have dinner here.” “I don\u0027t want to eat here,” objected Jock McChesney. “Besides, there\u0027s no reason why I can\u0027t keep my evening\u0027s engagements.” “And after dinner,” went on his mother, as though she had not heard, “we\u0027ll get acquainted, Kid.” It was a cheerless, rather tragic meal, though Emma McChesney saw it through from soup to finger-bowls. When it was over she led the way down the old-fashioned, red-carpeted corridors to her room. It was the sort of room to get on its occupant\u0027s nerves at any time, with its red plush arm-chairs, its black walnut bed, and its walnut center table inlaid with an apoplectic slab of purplish marble. {Illustration: “\u0027I\u0027m still in position to enforce that ordinance against pouting\u0027”} Emma McChesney took off her hat before the dim old mirror, and stood there, fluffing out her hair here, patting it there. Jock had thrown his hat and coat on the bed. He stood now, leaning against the footboard, his legs crossed, his chin on his breast, his whole attitude breathing sullen defiance. “Jock,” said his mother, still patting her hair, “perhaps you don\u0027t know it, but you\u0027re pouting just as you used to when you wore pinafores. I always hated pouting children. I\u0027d rather hear them howl. I used to spank you for it. I have prided myself on being a modern mother, but I want to mention, in passing, that I\u0027m still in a position to enforce that ordinance against pouting.” She turned around abruptly. “Jock, tell me, how did you happen to come here a day ahead of me, and how do you happen to be so chummy with that pretty, weak-faced little thing at the veiling counter, and how, in the name of all that\u0027s unbelievable, have you managed to become a grown-up in the last few months?” Jock regarded the mercifully faded roses in the carpet. His lower lip came forward again. “Oh, a fellow can\u0027t always be tied to his mother\u0027s apron strings. I like to have a little fling myself. I know a lot of fellows here. They are frat brothers. And anyway, I needed some new clothes.” For one long moment Emma McChesney stared, in silence. Then: “Of course,” she began, slowly, “I knew you were seventeen years old. I\u0027ve even bragged about it. I\u0027ve done more than that—I\u0027ve gloried in it. But somehow, whenever I thought of you in my heart—and that was a great deal of the time it was as though you still were a little tyke in knee-pants, with your cap on the back of your head, and a chunk of apple bulging your cheek. Jock, I\u0027ve been earning close to six thousand a year since I put in that side line of garters. Just how much spending money have I been providing you with?” Jock twirled a coat button uncomfortably “Well, quite a lot. But a fellow\u0027s got to have money to keep up appearances. A lot of the fellows in my crowd have more than I. There are clothes, and tobacco, and then flowers and cabs for the skirts—girls, I mean, and—” “Kid,” impressively, “I want you to sit down over there in that plush chair—the red one, with the lumps in the back. I want you to be uncomfortable. From where I am sitting I can see that in you there is the making of a first-class cad. That\u0027s no pleasant thing for a mother to realize. Now don\u0027t interrupt me. I\u0027m going to be chairman, speaker, program, and ways-and-means committee of this meeting. Jock, I got my divorce from your father ten years ago. Now, I\u0027m not going to say anything about him. Just this one thing. You\u0027re not going to follow in his footsteps, Kid. Not if I have to take you to pieces like a nickel watch and put you all together again. You\u0027re Emma McChesney\u0027s son, and ten years from now I intend to be able to brag about it, or I\u0027ll want to know the reason why—and it\u0027ll have to be a blamed good reason.” “I\u0027d like to know what I\u0027ve done!” blurted the boy. “Just because I happened to come here a few hours before you expected me, and just because you saw me talking to a girl! Why—” “It isn\u0027t what you\u0027ve done. It\u0027s what those things stand for. I\u0027ve been at fault. But I\u0027m willing to admit it. Your mother is a working woman, Jock. You don\u0027t like that idea, do you? But you don\u0027t mind spending the money that the working woman provides you with, do you? I\u0027m earning a man\u0027s salary. But Jock, you oughtn\u0027t to be willing to live on it. “What do you want me to do?” demanded Jock. “I\u0027m not out of high school yet. Other fellows whose fathers aren\u0027t earning as much—” “Fathers,” interrupted Emma McChesney. “There you are. Jock, I don\u0027t have to make the distinction for you. You\u0027re sufficiently my son to know it, in your heart. I had planned to give you a college education, if you showed yourself deserving. I don\u0027t believe in sending a boy in your position to college unless he shows some special leaning toward a profession.” “Mother, you know how wild I am about machines, and motors, and engineering, and all that goes with it. Why I\u0027d work—” “You\u0027ll have to, Jock. That\u0027s the only thing that will make a man of you. I\u0027ve started you wrong, but it isn\u0027t too late yet. It\u0027s all very well for boys with rich fathers to run to clothes, and city jaunts, and \u0027chickens,\u0027 and cabs and flowers. Your mother is working tooth and nail to earn her six thousand, and when you realize just what it means for a woman to battle against men in a man\u0027s game, you\u0027ll stop being a spender, and become an earner—because you\u0027ll want to. I\u0027ll tell you what I\u0027m going to do, Kid. I\u0027m going to take you on the road with me for two weeks. You\u0027ll learn so many things that at the end of that time the sides of your head will be bulging.” “I\u0027d like it!” exclaimed the boy, sitting up. “It will be regular fun.” “No, it won\u0027t,” said Emma McChesney; “not after the first three or four days. But it will be worth more to you than a foreign tour and a private tutor.” She came over to him and put her hand on his shoulder. “Your room\u0027s just next to mine,” she said. “You and I are going to sleep on this. To-morrow we\u0027ll have a real day of it, as I promised. If you want to spend it with the fellows, say so. I\u0027m not going to spoil this little lark that I promised you.” “I think,” said the boy, looking up into his mother\u0027s face, “I think that I\u0027ll spend it with you.” The door slammed after him. Emma McChesney remained standing there, in the center of the room. She raised her arms and passed a hand over her forehead and across her hair until it rested on the glossy knot at the back of her head. It was the weary little gesture of a weary, heart-sick woman. There came a ring at the \u0027phone. Emma McChesney crossed the room and picked up the receiver. “Hello, Mary Cutting,” she said, without waiting for the voice at the other end. “What? Oh, I just knew. No, it\u0027s all right. I\u0027ve had some high-class little theatricals of my own, right here, with me in the roles of leading lady, ingenue, villainess, star, and heavy mother. I\u0027ve got Mrs. Fiske looking like a First Reader Room kid that\u0027s forgotten her Friday piece. What\u0027s that?” There was no sound in the room but the hollow cackle of the voice at the other end of the wire, many miles away. Then: “Oh, that\u0027s all right, Mary Cutting. I owe you a great big debt of gratitude, bless your pink cheeks and white hair! And, Mary,” she lowered her voice and glanced in the direction of the room next door, “I don\u0027t know how a hard, dry sob would go through the \u0027phone, so I won\u0027t try to get it over. But, Mary, it\u0027s been \u0027sugar, butter, and molasses\u0027 for me for the last ten minutes, and I\u0027m dead scared to stop for fear I\u0027ll forget it. I guess it\u0027s \u0027sugar, butter, and molasses\u0027 for me for the rest of the night, Mary Cutting; just as hard and fast as I can say it, \u0027sugar, butter, molasses.\u0027”","sourceLink":"http://novel.tingroom.com/duanpian/2694/74071.html","bookId":1464,"book":{"id":1464,"title":"Roast Beef, Medium","description":"简介： Seated at Life\u0027s Dining Table, with the Menu of Morals before you, your eye wanders a bit over the entrees, the hors d\u0027oeuvres, and the things a la, though you know that Roast Beef, Medium, is safe, and sane, and sure. It agrees with you. As you hesi...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2694","creation":"Aug 1, 2019 12:25:09 AM","modification":"Aug 1, 2019 12:25:09 AM"}}
