{"id":41079,"no":104,"title":"Book 6 Chapter 2","content":"PRINCE ANDREY\u0027S DUTIES as trustee of his son\u0027s Ryazan estates necessitated an interview with the marshal of the district. This marshal was Count Ilya Andreivitch Rostov, and in the middle of May Prince Andrey went to see him.\n It was by now the hot period of spring. The forest was already in full leaf. It was dusty, and so hot that at the sight of water one longed to bathe.\n Prince Andrey drove along the avenue leading to the Rostovs\u0027 house at Otradnoe, depressed and absorbed in considering what questions he must ask the marshal about his business. Behind some trees on the right he heard merry girlish cries, and caught sight of a party of girls running across the avenue along which his coach was driving. In front of all the rest there ran towards the coach a black-haired, very slender, strangely slender, black-eyed girl in a yellow cotton gown. On her head was a white pocket-handkerchief, from under which strayed locks of her loose hair. The girl was shouting something, but perceiving a stranger, she ran back laughing, without glancing at him.\n Prince Andrey for some reason felt a sudden pang. The day was so lovely, the sun so bright, everything around him so gay, and that slim and pretty girl knew nothing of his existence, and cared to know nothing, and was content and happy in her own life—foolish doubtless—but gay and happy and remote from him. What was she so glad about? What was she thinking of? Not of army regulations; not of the organisation of the Ryazan rent-paying peasants. “What is she thinking about, and why is she so happy?” Prince Andrey could not help wondering with interest.\n Count Ilya Andreivitch was living in the year 1809 at Otradnoe, exactly as he had always done in previous years; that is to say, entertaining almost the whole province with hunts, theatricals, dinner parties and concerts. He was delighted to see Prince Andrey, as he always was to see any new guest, and quite forced him to stay the night.\n Prince Andrey spent a tedious day, entertained by his elderly host and hostess and the more honoured among the guests, of whom the count\u0027s house was full in honour of an approaching name-day. Several times in the course of it, Bolkonsky glanced at Natasha, continually laughing and full of gaiety among the younger members of the company, and asked himself each time, “What is she thinking of? What is she so glad about?”\n In the evening, alone in a new place, he was for a long while unable to sleep. He read for a time, then put out his candle, and afterwards lighted it again. It was hot in the bedroom with the shutters closed on the inside. He felt irritated with this foolish old gentleman (so he mentally called Count Rostov) who had detained him, declaring that the necessary deeds had not yet come from the town, and he was vexed with himself for staying.\n Prince Andrey got up and went to the window to open it. As soon as he opened the shutter, the moonlight broke into the room as though it had been waiting a long while outside on the watch for this chance. He opened the window. The night was fresh and bright and still. Just in front of the window stood a row of pollard-trees, black on one side, silvery bright on the other. Under the trees were rank, moist, bushy, growing plants of some kind, with leaves and stems touched here and there with silver. Further away, beyond the black trees, was the roof of something glistening with dew; to the right was a great, leafy tree, with its trunk and branches brilliantly white, and above it the moon, almost full, in a clear, almost starless, spring sky. Prince Andrey leaned his elbow on the window, and his eyes rested on that sky.\n His room was on the second story; there were people in the room over his head, and awake too. He heard girls\u0027 chatter overhead.\n “Only this once more,” said a girlish voice, which Prince Andrey recognised at once.\n “But when are you coming to bed?” answered another voice.\n “I\u0027m not coming! I can\u0027t sleep; what\u0027s the use? Come, for the last time.…”\n Two feminine voices sang a musical phrase, the finale of some song.\n “Oh, it\u0027s exquisite! Well, now go to sleep, and there\u0027s an end of it.”\n “You go to sleep, but I can\u0027t,” responded the first voice, coming nearer to the window. She was evidently leaning right out of the window, for he could hear the rustle of her garments and even her breathing. All was hushed and stonily still, like the moon and its lights and shadows. Prince Andrey dared not stir for fear of betraying his unintentional presence.\n “Sonya! Sonya!” he heard the first voice again. “Oh, how can you sleep! Do look how exquisite! Oh, how exquisite! Do wake up, Sonya!” she said, almost with tears in her voice. “Do you know such an exquisite night has never, never been before.”\n Sonya made some reluctant reply.\n “No, do look what a moon!…Oh, how lovely it is! Do come here. Darling, precious, do come here. There, do you see? One has only to squat on one\u0027s heels like this—see—and to hold one\u0027s knees—as tight, as tight as one can—give a great spring and one would fly away.… Like this—see!”\n “Mind, you\u0027ll fall.”\n He heard sounds of a scuffle and Sonya\u0027s voice in a tone of vexation: “Why, it\u0027s past one o\u0027clock.”\n “Oh, you only spoil it all for me. Well, go to bed then, go along.”\n All was hushed again; but Prince Andrey knew she was still sitting there. He heard at times a soft rustle, and at times a sigh.\n “O my God! my God! what does it mean?” she cried suddenly. “To bed then, if it must be so!” and she closed the window with a slam.\n 已经是春季里的炎热的时节。林中的树木长满了叶子，路上的灰尘四扬，热气逼人，经过有水的地方，禁不住想沐浴一番。\n 安德烈公爵在沿着花园的林荫道驶近奥特拉德诺耶村罗斯托夫家的寓所时，觉得不高兴，忧心忡忡，想到他应该向首席贵族问清一些事情。他从右边树林中听见妇人愉快的喊声，看见挡住他的马车的一群飞奔而来的姑娘。一个苗条的、苗条得出奇的、黑头发、黑眼睛、穿着一身黄色印花布连衣裙的姑娘领头向四轮马车近旁跑来，她头上裹着一条白手绢，手绢下面露出一绺绺梳平的头发。这个姑娘大声说了什么话，但是当她认出那个陌生人的时候，她没有仔细打量，就哈哈大笑地跑回去了。\n 安德烈公爵不知因为什么忽然觉得心里很难受。日子是如此美妙，太阳是如此灿烂，四周的一切是如此欢腾；而这个苗条的漂亮的姑娘却不知道，也不想知道他的存在，他的单独的，想必是愚昧的、然而是快活的幸福的生活，使她感到心满意足，无比幸福。“她因为什么如此地心欢？她在想什么？她没有想到军事条令，没有想到梁赞的代役租制。她究竟在想什么？她为什么感到幸福？”安德烈公爵情不自禁地怀着好奇的心情问自己。\n 一八○九年，伊利亚·安德烈伊奇伯爵像从前一样，还住在奥特拉德诺耶，差不多接待了全省的客人，请他们打猎，看戏，出席宴会，听乐师演奏。安德烈公爵像每个新客一样，使他觉得很高兴，他几乎很费劲地才把他留下来住宿。\n 在那寂寞无聊的白昼，二位年长的主人和一些城里的贵宾接待安德烈公爵，适逢临近命名日，老伯爵的住宅中挤满了城里的贵宾。博尔孔斯基一连有几回盯住娜塔莎，不知为什么她开心地笑，在另一半青年之间娱乐消遣，他一直在询问自己：“她思忖什么？为什么她如此心欢？”\n 晚上他独自一人留在新住处，久久地不能入睡。他阅读书籍，读了一阵子以后吹熄蜡烛，又把它点亮。房里的百叶窗从里面关上了，十分闷热。他埋怨这个愚蠢的老头（他这样称呼罗斯托夫），因为这个老头把他耽搁了，要他相信，城里所必需的公文还没有送到，他也埋怨自己不该留下来。\n 安德烈公爵站起来，走到窗前，打开窗子，他一打开百叶窗，月光就闯到房里来，好像它老早呆在窗边等待一般。他打开窗子。夜里很冷，静谧而明亮。紧靠着窗前有一排已经修剪的树木，一边呈露暗黑色，另一边闪耀着银光。这些树木下面生长着一种多汁的、潮湿的、蓊郁的、有的叶子和细枝呈现银白色的植物。在距离更远的黑色的树木后面，有一个被露水映照得闪闪发亮的屋顶，右面有一棵枝叶繁茂的、树干和树枝白得耀眼的大树，一轮将近浑圆的皓月悬挂在大树的上方，悬挂在明朗的、几乎看不见星星的春日的天空中。安德烈公爵用臂肘支撑着窗台，他的目光盯住天空。\n 安德烈公爵的房间在中层，也有人住在他的上层，他们还没有睡觉。他从上方听见妇人的说话声。\n “只要再来一回。”从上方传来一个妇人的语声，安德烈公爵即刻识出了这个人的嗓音。\n “你究竟什么时候才睡觉？”可以听见另一个人回答的声音。\n “我不睡，没法睡着，我该怎么办！喂，最后一次……”\n 两个妇人拉开嗓门唱了一个乐句——一首歌的尾声。\n “啊，真是妙极了！得啦，现在睡觉吧，完了。”\n “你睡吧，我可睡不着。”可以听见靠近窗口的头一个人回答的声音。显然她把身子完全探出窗口了，因为可以听见她的连衣裙的窸窣声，甚至可以听见她呼吸的声音。一切都寂然无声，滞然不动，就像月亮、月光和它的阴影一样。安德烈公爵也不敢微微动弹，想不暴露他的偶然的出现。\n “索尼娅！索尼娅！”又听见头一个人的说话声，“喂，怎么可以睡呀！你看看，多么迷人啊！嗬，多么迷人啊！索尼娅，让你醒过来吧。”她几乎带着哭泣的嗓音说，“要晓得，从来从来都没有这样迷人的夜晚。”\n 索尼娅不乐意地回答了什么话。\n “不过，你瞧瞧，多么迷人的月光！……嗬，多么迷人啊！你到这儿来吧。亲爱的，心肝，你到这儿来，喂，你看见吗？你最好这样蹲下来，你最好这样托住自己的膝盖，托紧一点儿，尽量托紧一点儿，要鼓足力气，才会飞起来。瞧，就这样吧！”\n “够啦，你会摔倒的。”\n 可以听见挣扎的响声和索尼娅的不满意的话语声：\n “瞧，已经一点多了。”\n “唉，你只会伤害我。得啦，你走吧，你走吧。”\n 四周的一切又寂静下来，可是安德烈公爵知道，她还坐在这儿不动，他有时听见微微动弹的声音，有时听见一声声叹息。\n “啊，我的天呀！我的天呀！这到底是怎么回事啊！”她突然喊叫一声，“睡就睡吧！”她于是砰然一声关上了窗户。\n “不关心我的存在呀！”安德烈公爵细听她说话时想了想，不知为什么他期待然而又害怕她提到有关他的什么事情。“又是她！仿佛故意似的！”他思忖着。他的心灵中忽然涌现出年青人的意料不到的乱七八糟的思想和希望，这和他的全部生活是相抵触的，他觉得不能向自己阐明他这种心态，于是立刻睡着了。\n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/53/3402.html","bookId":585,"book":{"id":585,"title":"War And Peace战争与和平","description":"简介： War and Peace , a Russian novel by Leo Tolstoy, is considered one of the most celebrated works of fiction.It is regarded, along with Anna Karenina (1873–1877), as Tolstoy\u0027s finest literary achievement.Epic in scale, War and Peace deline...","cover":"http://novel.tingroom.com/uploads/allimg/101230/12858150784da3b.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/53","creation":"Aug 1, 2019 12:18:59 AM","modification":"Aug 1, 2019 12:18:59 AM"}}
