{"id":41209,"no":234,"title":"Book 11 Chapter 9","content":"PIERRE had hardly put his head on the pillow when he felt that he was dropping asleep. But all of a sudden he heard, almost with the distinctness of reality, the sound of the boom, boom, boom of the cannon, the groans and shrieks and dull thud of the falling shell, smelt the blood and powder; and the feeling of horror, of the dread of death came over him. He opened his eyes in a panic, and put his head out from the cloak. All was quiet in the yard. The only sound came from a servant of some sort talking with the porter at the gate, and splashing through the mud. Over Pierre\u0027s head, under the dark, wooden eaves, he heard pigeons fluttering, startled by the movement he had made in sitting up. The whole yard was pervaded by the strong smell of a tavern—full of peaceful suggestion and soothing relief to Pierre—the smell of hay, of dung, and of tar. Between two dark sheds he caught a glimpse of the pure, starlit sky.\n “Thank God, that is all over!” thought Pierre, covering his head up again. “Oh, how awful terror is, and how shamefully I gave way to it! But they…they were firm and calm all the while up to the end …” he thought. They, in Pierre\u0027s mind, meant the soldiers, those who had been on the battery, and those who had given him food, and those who had prayed to the holy picture. They—those strange people, of whom he had known nothing hitherto—they stood out clearly and sharply in his mind apart from all other people.\n “To be a soldier, simply a soldier!” thought Pierre as he fell asleep. “To enter with one\u0027s whole nature into that common life, to be filled with what makes them what they are. But how is one to cast off all that is superfluous, devilish in one\u0027s self, all the burden of the outer man? At one time I might have been the same. I might have run away from my father as I wanted to. After the duel with Dolohov too I might have been sent for a soldier.”\n And into Pierre\u0027s imagination flashed a picture of the dinner at the club, at which he had challenged Dolohov, then the image of his benefactor at Torzhok. And there rose before his mind a solemn meeting of the lodge. It was taking place at the English Club. And some one he knew, some one near and dear to him, was sitting at the end of the table. “Why, it is he! It is my benefactor. But surely he died?” thought Pierre. “Yes, he did die, but I didn\u0027t know he was alive. And how sorry I was when he died, and how glad I am he is alive again!” On one side of the table were sitting Anatole, Dolohov, Nesvitsky, Denisov, and others like them (in Pierre\u0027s dream these people formed as distinct a class apart as those other men whom he had called them to himself), and those people, Anatole and Dolohov, were loudly shouting and singing. But through their clamour the voice of his benefactor could be heard speaking all the while, and the sound of his voice was as weighty and as uninterrupted as the din of the battlefield, but it was pleasant and comforting. Pierre did not understand what his benefactor was saying, but he knew (the category of his ideas, too, was distinct in his dream) that he was talking of goodness, of the possibility of being like them. And they with their simple, good, plucky faces were surrounding his benefactor on all sides. But though they were kindly, they did not look at Pierre; they did not know him. Pierre wanted to attract their notice, and to speak to them. He got up, but at the same instant became aware that his legs were bare and chill.\n He felt ashamed, and put his arm over his legs, from which his cloak had in fact slipped off. For an instant Pierre opened his eyes as he pulled up the cloak, and saw the same roofs, and posts, and yard, but it was now full of bluish light, and glistening with dew or frost.\n “It\u0027s getting light,” thought Pierre. “But that\u0027s not the point. I want to hear and understand the benefactor\u0027s words.”\n He muffled himself in the cloak again, but the masonic dinner and his benefactor would not come back. All that remained were thoughts, clearly expressed in words, ideas; some voice was speaking, or Pierre was thinking.\n When he recalled those thoughts later, although they had been evoked by the impressions of that day, Pierre was convinced that they were uttered by some one outside himself. It seemed to him that he had never been capable of thinking those thoughts and expressing them in that form in his waking moments.\n “The most difficult thing is the subjection of man\u0027s will to the law of God,” said the voice. “Simplicity is the submission to God; there is no escaping from Him. And they are simple. They do not talk, but act. A word uttered is silver, but unuttered is golden. No one can be master of anything while he fears death. And all things belong to him who fears it not. If it were not for suffering, a man would know not his limits, would know not himself. The hardest thing” (Pierre thought or heard in his dream) “is to know how to unite in one\u0027s soul the significance of the whole. To unite the whole?” Pierre said to himself. “No, not to unite. One cannot unite one\u0027s thoughts, but to harness together all those ideas, that\u0027s what\u0027s wanted. Yes, one must harness together, harness together,” Pierre repeated to himself with a thrill of ecstasy, feeling that those words, and only those words, expressed what he wanted to express, and solved the whole problem fretting him.\n “Yes, one must harness together; it\u0027s time to harness…”\n “We want to harness the horses; it\u0027s time to harness the horses, your excellency! Your excellency,” some voice was repeating, “we want to harness the horses; it\u0027s time…”\n It was the groom waking Pierre. The sun was shining full in Pierre\u0027s face. He glanced at the dirty tavern yard; at the well in the middle of it soldiers were watering their thin horses; and waggons were moving out of the gate.\n He turned away with repugnance, and shutting his eyes, made haste to huddle up again on the seat of the carriage. “No, I don\u0027t want that; I don\u0027t want to see and understand that; I want to understand what was revealed to me in my sleep. Another second and I should have understood it all. But what am I to do? To harness, but how to harness all together?” And Pierre felt with horror that the whole meaning of what he had seen and thought in his dream had slipped away.\n The groom, the coachman, and the porter told Pierre that an officer had come with the news that the French were advancing on Mozhaisk and our troops were retreating.\n Pierre got up, and ordering the carriage to be got out and to drive after him, crossed the town on foot.\n The troops were marching out, leaving tens of thousands of wounded behind. The wounded could be seen at the windows of the houses, and were crowding the yards and streets. Screams, oaths, and blows could be heard in the streets about the carts which were to carry away the wounded. Pierre put his carriage at the service of a wounded general of his acquaintance, and drove with him to Moscow. On the way he was told of the death of his brother-in-law, Anatole, and of the death of Prince Andrey.\n “感谢上帝，这下再听不到了。”皮埃尔想，同时又把头蒙了起来。“呵，恐怖的感觉多吓人，我屈服于它是多难为情！可他们……·他·们始终坚定沉着……“他又想。·他·们照皮埃尔所指，就是士兵，就是驻守炮垒，给他饭吃，对着圣像祷告的士兵。·他·们——就是陌生的，他在这之前毫无所知的人们，他们在他脑子里明显而尖锐地不同于其余的人。\n “当兵去，就当一名士兵！”皮埃尔想着，渐渐要入睡了。\n “全身心地投入这种共同的生活中去，深刻体验使他们变成那样的人的一切。但如何摆脱人的外表这付多余的恶魔般的累赘呢？有个时候我是能够做到这一点的。我本来可以逃离父亲，像我所想的那样。我还本来可以在同多洛霍夫决斗后被送去当兵。”于是，在皮埃尔想象中闪现出那次他向多洛霍夫挑起决斗的午餐会，和托尔若克的慈善家。皮埃尔还想起了那次有气派的共济会分会的聚餐，那次宴会是在英国俱乐部举办的。一位熟识而又和蔼可亲的人坐在餐桌的末端。对，就是他！是慈善家。“是的，可他已死啦？”皮埃尔想。“是的，死了；但我不知道他活着。他死了是多么遗憾啊，而他又活过来了，我真高兴！”餐桌的一边坐着阿纳托利、多洛霍夫，涅斯维茨基、杰尼索夫和类似他们的其他人（睡梦中皮埃尔在心里把他们明白地归为一类，就像他把他刚才称之为他们的人归为一类一样），而这此人，阿纳托利、多洛霍夫等，大声地喊呀，唱呀；而在他们的喊叫声中，听见了慈善家不停地说话声，他的声音像战场上的轰鸣一样的有力，一样地持续不断，但听来悦耳，使人感到安慰。皮埃尔不明白慈善家在讲什么，但他知道（睡梦中，他对思想的分类也同样清楚），慈善家在讲善，在讲如何成为他们那样的人。而他们正团团围在慈善家身边，他们的容貌单纯善良而坚定。然而，他们虽然善良，但并不注意皮埃尔，也不认识他。皮埃尔想引起他们的注意，他想说话。他欠起身来，就在这一刹那，他觉得腿很冷，原来腿已露了出来。\n 他感到难为情，便用手去捂着腿，大衣果然从腿上滑下去了。皮埃尔在拉上大衣时，一下子睁开了眼睛，仍然看见那两间木板披屋，廊柱、院子，但这一切现在都泛出蓝色，发亮，蒙着一层露珠或水霜的光泽。\n “天亮了，”皮埃尔想。“但先别管它。我得把慈善家的话听完，弄个明白。”他又用大衣蒙住了头，可是分会的雅座和慈善家全没啦。只剩下那些话的涵意，那些别人对他讲过的，或皮埃尔本人反复思考过的意思。\n 皮埃尔后来回想起这些意思时，坚信有人从他身外告诉他的，尽管这些意思是由这一天的印象引发而来。他觉得，他从未在清醒的时候能够那样思考和表达自己的想法。\n “战争，是人的自由最艰难地去服从上帝的条律，”有一个声音说道。“纯朴，是对上帝的忠顺；你离不开上帝。·他·们就是纯朴的。他们不说，而是实干。说出来的话是银，没说出来的是金。人一怕死，便什么也主宰不了。而谁不怕死，他便拥有一切。假如没有苦难，人就不会知道自己的极限，不会认识自己。最难于做到的（皮埃尔继续在睡梦中想，或倾听）是要善于把这一切的意义在自己的心中统一起来。一切都统一吗？”皮埃尔自问。“不，不是统一。不可能统一各种想法，而是把所有这些想法结合起来，这才是该做的！对，应该结合，应该结合！”怀着内心的喜悦，皮埃尔对自己重复说，觉得正是这句话，也唯有这句话足以表达他想表达的意思，整个拆磨他的问题便解决了。\n “对，应该是结合，是结合的时候了。”\n “应该套车了，是套车的时候了，爵爷！爵爷，”一个声音在重复说，“应该套车了，是套车的时候了……”① \n ①俄语中“套车”与“结合”词根相同，声韵一样。\n 驯马夫、车夫和店老板告诉皮埃尔，有位军官带来了消息说，法国兵已临近莫扎伊斯克，我们的人正在撤退。\n 皮埃尔起身，吩咐把东西收拾好后去赶上他们，然后就徒步穿城走了。\n 部队已开拔，留下约一万名伤员。这些伤员在各家院子里和窗口都看得见，也拥挤在大街小巷。在街头待运伤兵的车辆周围，传来喊叫、咒骂和殴斗的声音。皮埃尔把赶上他的一辆马车拨给他熟悉的一位受伤的将军用，用他一道赶往莫斯科。在路上，皮埃尔得知他的内兄和安德烈公爵的死讯。\n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/53/3532.html","bookId":585,"book":{"id":585,"title":"War And Peace战争与和平","description":"简介： War and Peace , a Russian novel by Leo Tolstoy, is considered one of the most celebrated works of fiction.It is regarded, along with Anna Karenina (1873–1877), as Tolstoy\u0027s finest literary achievement.Epic in scale, War and Peace deline...","cover":"http://novel.tingroom.com/uploads/allimg/101230/12858150784da3b.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/53","creation":"Aug 1, 2019 12:18:59 AM","modification":"Aug 1, 2019 12:18:59 AM"}}
