{"id":41235,"no":260,"title":"Book 12 Chapter 2","content":"ANNA PAVLOVNA\u0027S PRESENTIMENT was in fact fulfilled. Next day, during the special service at court in honour of the Tsar\u0027s birthday, Prince Volkonsky was called out of church and received a despatch from Prince Kutuzov. This was the despatch Kutuzov had sent off on the day of the battle from Tatarinovo. Kutuzov wrote that the Russians had not retreated a single step, that the French had lost far more than our troops, that he was writing off in haste from the field of battle before he had time to collect the latest intelligence. So it had been a victory, it appeared. And at once, without leaving church, the assembled court offered up thanks to the Creator for His succour, and for the victory.\n Anna Pavlovna\u0027s presentiment had been fulfilled, and the whole morning a mood of joyous festivity prevailed in the town. Every one accepted the victory as a conclusive one, and some people were already beginning to talk of Napoleon\u0027s having been taken prisoner, of his disposition, and the selection of a new sovereign for France\n At a distance from the scene of action and amid the conditions of court life, it is very difficult for events to be reflected in their true force and dimensions. Public events are involuntarily grouped about some private incident. So in this case, the courtiers\u0027 rejoicing was as much due to the fact of the news of this victory having arrived precisely on the Tsar\u0027s birthday as to the fact of the victory itself. It was like a successfully arranged surprise. Kutuzov\u0027s despatches had spoken, too, of the Russian losses, and among them had mentioned the names of Tutchkov, Bagration, and Kutaissov. The melancholy side, too, of the event was unconsciously in this Petersburg world concentrated about a single incident—the death of Kutaissov. Every one knew him, the Tsar liked him, he was young and interesting. All met that day with the words:\n “How wonderful it should have happened so! Just in the Te Deum. But what a loss—Kutaissov! Ah, what a pity!”\n “What did I tell you about Kutuzov?” Prince Vassily said now with the pride of a prophet. “I always said he was the only man capable of conquering Napoleon.”\n But next day no news came from the army, and the public voice began to waver. The courtiers suffered agonies over the agonies of suspense which the Tsar was suffering.\n “Think of the Emperor\u0027s position!” the courtiers said; and they no longer sang the praises of Kutuzov as two days before, but upbraided him as the cause of the Tsar\u0027s uneasiness that day. Prince Vassily no longer boasted of his protégé Kutuzov, but was mute when the commander-in-chief was the subject of conversation. Moreover, on the evening of that day everything seemed to conspire to throw the Peters-burg world into agitation and uneasiness: a terrible piece of news came to add to their alarms. Countess Elena Bezuhov died quite suddenly of the terrible illness which had been so amusing to talk about. At larger gatherings every one repeated the official story that Countess Bezuhov had died of a terrible attack of angina pectoris, but in intimate circles people told in detail how the Queen of Spain\u0027s own medical attendant had prescribed to Ellen small doses of a certain drug to bring about certain desired results; but that Ellen, tortured by the old count\u0027s suspecting her, and by her husband\u0027s not having answered her letter (that unfortunate, dissipated Pierre), had suddenly taken an enormous dose of the drug prescribed, and had died in agonies before assistance could be given. The story ran that Prince Vassily and the old count had been going to take proceedings against the Italian; but the latter had produced notes in his possession from the unhappy deceased of such a character that they had promptly let him go.\n Conversation centred round three melancholy facts—the Tsar\u0027s state of suspense, the loss of Kutaissov, and the death of Ellen.\n On the third day after Kutuzov\u0027s despatch, a country gentleman arrived in Petersburg from Moscow, and the news of the surrender of Moscow to the French was all over the town. This was awful! Think of the position of the Emperor! Kutuzov was a traitor, and during the “visits of condolence” paid to Prince Vassily on the occasion of his daughter\u0027s death, when he spoke of Kutuzov, whose praises he had once sung so loudly—it was pardonable in his grief to forget what he had said before—he said that nothing else was to be expected from a blind and dissolute old man.\n “I only wonder how such a man could possibly be trusted with the fate of Russia.”\n So long as the news was not official, it was still possible to doubt its truth; but next day the following communication arrived from Count Rastoptchin:\n “Prince Kutuzov\u0027s adjutant has brought me a letter in which he asks me to furnish police-officers to escort the army to the Ryazan road. He says that he is regretfully abandoning Moscow. Sire! Kutuzov\u0027s action decides the fate of that capital and of your empire. Russia will shudder to learn of the abandonment of the city, where the greatness of Russia is centred, where are the ashes of our forefathers. I am following the army. I have had everything carried away; all that is left me is to weep over the fate of my country.”\n On receiving this communication, the Tsar sent Prince Volkonsky with the following rescript to Kutuzov:\n “Prince Mihail Ilarionovitch! I have received no communication from you since the 29th of August. Meanwhile I have received, by way of Yaroslavl, from the governor of Moscow the melancholy intelligence that you have decided with the army to abandon Moscow. You can imagine the effect this news has had upon me, and your silence redoubles my astonishment. I am sending herewith Staff-General Prince Volkonsky, to ascertain from you the position of the army and of the causes that have led you to so melancholy a decision.”\n 安娜·帕夫洛夫娜的预感证实了，因而，城里边整个上午都流露着欢乐的节日的情绪。大家都认为这是一次胜利，一些人已在议论俘获拿破仑本人，谈话废黜他和为法军择立新主之事。\n 远离战场，而且又在宫廷生活的环境中，是很难作到使事件的全部真相和影响力都反映出来的。一般事件围绕某一个别情事不知不觉地相继发生，现在正是这样，大快朝臣之心的事，既在于我们赢得胜利，亦在于胜利的消息正与皇上寿辰巧合。这是绝妙的一桩意外喜事。库图佐夫的报告也谈了俄军的损失，其中列举出图奇科夫、巴格拉季翁、库泰索夫等人。这种悲惨的事件围绕着库泰索夫阵亡一事，在彼得堡这个地区也不知不觉地发生了。大家都认识他，陛下宠爱他，他又年轻又有趣。这一天，大家见面时都说：\n “多么叫人吃惊。正碰上祈祷。库泰索夫的损失太大了！\n 唉，多么遗憾！”\n “我对你们说过库图佐夫吗？”瓦西里公爵现在以预言家的骄傲神情说。“我从来都说，只有他才能战胜拿破仑。”\n 但是，第二天没得到军队的消息，大家的语声都显得不安起来。朝臣们苦恼的是皇上得不到消息，因而感到难受。\n “皇上的情况会怎样啊！”朝臣们说，而且不再像两天前那样赞扬库图佐夫，他们谴责他成了皇上不安之源。瓦西里公爵在这天已不再称赞他所protège（赏识的）库图佐夫，而当人们谈起总司令时，只保持沉默。不仅如此，当天傍晚，仿佛有意要使彼得堡居民惊慌不安似的，事情都凑到一块儿了：又有一条可怕的消息来赶热闹。海伦·别祖霍娃伯爵夫人突然死于人们曾经那么饶有兴趣地谈论过的可怕的病症。在稠人广众的交际场所，大家都一本正经地说别祖霍娃伯爵夫人死于anginepectorole（可怕的心绞痛）发作，但在亲密的圈子里，人们却详尽地谈到lemédecinintimedelareined\u0027EsBpagne（那个西班牙皇后的私人医生），说他给海伦开了剂量不大作用不详的某种药物；但是海伦受到老伯爵猜疑，她丈夫（那个倒霉的浪荡的皮埃尔）不给她回信，因此十分痛苦，她忽然大剂量地服用了开给她的那种药，在人们起来抢救之前便痛苦地死去了。他们说，瓦西里公爵和老伯爵本想追究那个意大利人，但是意大利人拿出几封不幸的死者的手札，他们当即放过了他。\n 众人的谈话集中在三大令人悲哀的事情上：皇上不明战况，库泰索夫阵亡和海伦之死。\n “我只有感到吃惊，怎么可以把俄国的命运交给这样一个人。”\n 当这消息仍属非官方正式消息时，还可以对它存疑，但在下一天，送来了拉斯托普钦伯爵的如下报告：\n “库图佐夫公爵的副官给我带来一封信，他在信中要求我派警官把军队引领到梁赞大路。他声称他遗憾地放弃了莫斯科。陛下！库图佐夫的行动决定了古都和您的帝国的命运。一旦听到俄国伟大事物集中之地、您的先人遗骨埋葬之地——那座城市失守，俄国定将为之战栗。我去追随军队。我已运走一切，我唯有恸哭我祖国的命运。”\n 收到这封急报，皇上派沃尔孔斯基公爵将下列诏书带交库图佐夫：\n “米哈伊尔·伊拉里奥诺维奇公爵！从八月二十九日起，我就不曾接到您的任何报告。但在九月一日，我收到莫斯科总督自雅罗斯拉夫尔送来一则可悲的讯息，说您已决定率领军队放弃莫斯科。您自己可以想象这一消息对我产生怎样的影响，而您的沉默加深了我们惊愕。我派侍从将军沃尔孔斯基公爵送去此份诏书，向您听取军队的情况和促使您采取如此可悲决定的理由。”\n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/53/3558.html","bookId":585,"book":{"id":585,"title":"War And Peace战争与和平","description":"简介： War and Peace , a Russian novel by Leo Tolstoy, is considered one of the most celebrated works of fiction.It is regarded, along with Anna Karenina (1873–1877), as Tolstoy\u0027s finest literary achievement.Epic in scale, War and Peace deline...","cover":"http://novel.tingroom.com/uploads/allimg/101230/12858150784da3b.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/53","creation":"Aug 1, 2019 12:18:59 AM","modification":"Aug 1, 2019 12:18:59 AM"}}
