{"id":41268,"no":293,"title":"Book 13 Chapter 19","content":"WHEN A MAN finds himself in movement, he always invents a goal of that movement. In order to walk a thousand versts, a man must believe that there is some good beyond those thousand versts. He needs a vision of a promised land to have the strength to go on moving. The promised land for the French on their march into Russia was Moscow; on their retreat it was their own country. But their country was too far; and a man walking a thousand versts must inevitably put aside his final goal and say to himself every day that he is going to walk forty versts to a resting-place where he can sleep; and before the first halt that resting-place has eclipsed the image of the final goal, and all his hopes and desires are concentrated on it. All impulses manifest in the individual are always greatly exaggerated in a crowd.\\n\\n For the French, marching back along the old Smolensk road, the final goal, their own country, was too remote, and the nearer goal on which all hopes and desires, enormously intensified by the influence of the crowd, were concentrated was Smolensk.\\n\\n It was not because the soldiers knew that there were plentiful supplies in Smolensk and reinforcements, nor because they were told so (on the contrary, the generals and Napoleon himself knew that the supplies there were scanty), but because this was the only thing that could give them the strength to move and to bear their present hardships, that they—those that knew better and those that did not alike—deceived themselves, and rushed to Smolensk as to a land of promise.\\n\\n When they got out on the high road, the French fled to their imagined goal with extraordinary energy and unheard-of rapidity. Apart from the common impulse that bound the crowds of Frenchmen together into one whole and gave them a certain momentum, there was another cause that held them together, that cause was their immense number. As in the physical law of gravitation, the immense mass of them drew the separate atoms to itself. They moved in their mass of hundreds of thousands like a whole state.\\n\\n Every man among them longed for one thing only—to surrender and be taken prisoner, to escape from all the horrors and miseries of his actual position. But on one hand the momentum of the common impulse toward Smolensk drew each individual in the same direction. On the other hand, it was out of the question for a corps to surrender to a squadron; and although the French took advantage of every convenient opportunity to straggle away from one another, and on the smallest decent pretext to be taken prisoners, those opportunities did not always occur. Their very number, and their rapid movement in such a closely-packed mass, deprived them of such possibilities, and made it not only difficult but impossible for the Russians to stop that movement into which the whole energy of that great mass was thrown. No mechanical splitting up of the body could accelerate beyond certain limits the process of dissolution that was going on within it.\\n\\n A snowball cannot be melted instantaneously. There is a certain limit of time within which no application of heat can thaw the snow. On the contrary, the greater the heat, the harder the snow that is left.\\n\\n Of the Russian generals no one but Kutuzov understood this. When the flight of the French army took its final direction along the Smolensk road, then what Kutuzov had foreseen on the night of the 11th of October began to come to pass. All the generals and officers of the Russian army were eager to distinguish themselves, to cut off the enemy\u0027s retreat, to overtake, to capture, to fall upon the French, and all clamoured for action.\\n\\n Kutuzov alone used all his powers (and the powers of any commander-in-chief are far from great) to resist this clamour for attack.\\n\\n He could not tell them what we can say now: he could not ask them what was the object of fighting and obstructing the road and losing our men, and inhumanly persecuting the poor wretches, when one-third of that army melted away of itself without a battle between Moscow and Vyazma. But drawing from the stores of his aged wisdom what they could understand, he told them of the golden bridge, and they laughed at him, slandered him, pushed on and dashed forward, exulting over the wounded beast.\\n\\n Near Vyazma, Yermolov, Miloradovitch, Platov, and others, finding themselves in the neighbourhood of the French, could not resist the desire to cut them off and to fall upon two French corps. In sending to inform Kutuzov of their project, they slipped a blank sheet of paper into the envelope instead of the despatch.\\n\\n And in spite of Kutuzov\u0027s efforts to restrain the army, our soldiers attacked the French and tried to bar their way. The infantry regiments, we are told, marched to attack them with music and beating of drums and slew and were slain by thousands.\\n\\n But as for cutting off their retreat—none were cut off nor turned aside. And the French army, brought into closer cohesion by danger, and slowly melting as it went, kept still on its fatal way to Smolensk.\\n\\n 法国人在进攻时，乐土是莫斯科，在退却时，乐土是祖国。但是祖国太远。一个千里之行的人要忘掉最终目的，他要对自己说，今天走四十里，在那里休息、过夜，于是这第一行程的宿营地遮掩了最终目的，把一切愿望和希望集中起来了。个别人的意图，往往在人群中扩散开来。\\n\\n 对于沿斯摩棱斯克旧道撤退的法国人，作为最终目的的祖国，太遥远了。最近的目的是斯摩棱斯克，去那里的心愿和希望，在人群中大大加强了。这并非是他们知道在那里有丰富给养和生力军，也不是因为他们说过这种话（相反，军队的高级官员和拿破仑都知道，那儿粮草并不多），而是因为唯此才能赋予行动以力量和忍受现时的煎熬。他们，不论是知道或不知道，都同样欺骗自己，把斯摩棱斯克当作乐土，向那儿疾奔。\\n\\n 法国人上了大路，以惊人的毅力和空前的速度，向假想目标奔逃。除了共同的意愿把他们结成一个整体和赋以力量之外，另一种原因是他们的数量。如同物理学的引力定律一样，他们那巨大体积本身就吸引着一个个原子似的人。他们以千百万个集体有如一个整体的国家向前移动着。\\n\\n 他们每个人都只有一个愿望——当俘虏，摆脱一切恐怖和不幸。但是，一方面奔赴目的地斯摩棱斯克的共同愿望把每个人吸引到同一方向；另一方面，总不能一个兵团向一个连投降，虽然法国人利用一切机会离队，找借口投降，但这种借口并不常有。人数的密集和运动的迅速使他们失去这种可能，同时使俄国人难以阻止法国人全力以赴的运动。不到一定限度，物体的任何机械断裂都不能加速腐败的过程。\\n\\n 一堆雪不能一下融化。有一定时限，早于时限任何热力都不能使之融化。相反，气温越高，残雪越坚固。\\n\\n 俄军将领中除了库图佐夫，没有人懂这个道理。在已判明法军沿斯摩棱斯克大路逃跑，科诺夫尼岑在十月十一日的预见实现了。将领们想立功，想切断、截击、俘虏、歼灭法国人，都要求进攻。\\n\\n 只有库图佐夫一人全力（每个总司令的力量都很小）反对进攻。\\n\\n 他不能对他们说我们现在所说的话：“何必去打呢？何必封锁大路呢？损伤我们自己的人，残忍地屠杀那些不幸的可怜的人？既然从莫斯科到维亚济马未经战斗就损失了三分之一的军队，现在又何必多此一举呢？他从他那老年人的智慧中阐述能使他们懂得的道理，他对他们讲“金桥”①，可是他们讥笑他，中伤他，他们大发脾气，在那头已被打死的野兽面前威风凛凛。 \\n\\n ①金桥：意为给败军留一条逃路。\\n\\n 尽管库图佐夫尽可能约束军队，我们的人还是出击了，努力进行堵截。据说，一些步兵团队奏着乐，擂着战鼓，向前冲锋，杀死了好几千人，自己也损失了好几千人。\\n\\n 但是，切断——并没有切断和歼灭任何人。法国军队在危险面前抱得更紧，法国军队一面继续沿着注定灭亡的通往斯摩棱斯克的道路奔逃，一路上不断地被融解掉。\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/53/3591.html","bookId":585,"book":{"id":585,"title":"War And Peace战争与和平","description":"简介： War and Peace , a Russian novel by Leo Tolstoy, is considered one of the most celebrated works of fiction.It is regarded, along with Anna Karenina (1873–1877), as Tolstoy\u0027s finest literary achievement.Epic in scale, War and Peace deline...","cover":"http://novel.tingroom.com/uploads/allimg/101230/12858150784da3b.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/53","creation":"Aug 1, 2019 12:18:59 AM","modification":"Aug 1, 2019 12:18:59 AM"}}
