{"id":41288,"no":313,"title":"Book 15 Chapter 1","content":"WHEN A MAN sees an animal dying, a horror comes over him. What he is himself—his essence, visibly before his eyes, perishes—ceases to exist. But when the dying creature is a man and a man dearly loved, then, besides the horror at the extinction of life, what is felt is a rending of the soul, a spiritual wound, which, like a physical wound, is sometimes mortal, sometimes healed, but always aches and shrinks from contact with the outer world, that sets it smarting. After Prince Andrey\u0027s death, Natasha and Princess Marya both alike felt this. Crushed in spirit, they closed their eyes under the menacing cloud of death that hovered about them, and dared not look life in the face. Carefully they guarded their open wounds from every rough and painful touch. Everything—the carriage driving along the street, the summons to dinner, the maid asking which dress to get out; worse still—words of faint, feigned sympathy—set the wound smarting, seemed an insult to it, and jarred on that needful silence in which both were trying to listen to the stern, terrible litany that had not yet died away in their ears, and to gaze into the mysterious, endless vistas that seemed for a moment to have been unveiled before them. Only alone together were they safe from such outrage and pain. They said little to one another. When they did speak, it was about the most trivial subjects. And both equally avoided all mention of anything connected with the future. To admit the possibility of a future seemed to them an insult to his memory. Still more circumspectly did they avoid in their talk all that could be connected with the dead man. It seemed to them that what they had felt and gone through could not be expressed in words. It seemed to them that every allusion in words to the details of his life was an outrage on the grandeur and holiness of the mystery that had been accomplished before their eyes. The constant restraint of speech and studious avoidance of everything that might lead to words about him, these barriers, fencing off on all sides what could not be spoken of, brought what they were feeling even more clearly and vividly before their minds. But pure and perfect sorrow is as impossible as pure and perfect joy. From the isolation of her position, as the guardian and foster-mother of her nephew, and independent mistress of her own destinies, Princess Marya was the first to be called back to life from that world of mourning in which she lived for the first fortnight. She received letters from her relations which had to be answered; the room in which Nikolushka had been put was damp, and he had begun to cough. Alpatitch came to Yaroslavl with accounts. He had suggestions to make, and advised Princess Marya to move to Moscow to the house in Vozdvizhenka, which was uninjured, and only needed some trifling repairs. Life would not stand still, and she had to live. Painful as it was for Princess Marya to come out of that world of solitary contemplation, in which she had been living till then, and sorry, and, as it were, conscience-stricken, as she felt at leaving Natasha alone, the duties of daily life claimed her attention, and against her own will she had to give herself up to them. She went through the accounts with Alpatitch, consulted Dessalle about her little nephew, and began to make preparations for moving to Moscow. Natasha was left alone, and from the time that Princess Marya began to busy herself with preparations for her journey, she held aloof from her too. Princess Marya asked the countess to let Natasha come to stay with her in Moscow; and both mother and father eagerly agreed to her suggestion, for they saw their daughter\u0027s physical strength failing every day, and they hoped that change of scene and the advice of Moscow doctors might do her good. “I am not going anywhere,” answered Natasha, when the suggestion was made to her; “all I ask is, please let me alone,” she said, and she ran out of the room, hardly able to restrain tears more of vexation and anger than of sorrow. Since she felt herself deserted by Princess Marya, and alone in her grief, Natasha had spent most of her time alone in her room, huddled up in a corner of her sofa. While her slender, nervous fingers were busy twisting or tearing something, she kept her eyes fixed in a set stare on the first object that met them. This solitude exhausted and tortured her; but it was what she needed. As soon as any one went in to her, she got up quickly, changed her attitude and expression, and picked up a book or some needlework, obviously waiting with impatience for the intruder to leave her. It seemed to her continually that she was on the very verge of understanding, of penetrating to the mystery on which her spiritual vision was fastened with a question too terrible for her to bear. One day towards the end of December, Natasha, thin and pale in a black woollen gown, with her hair fastened up in a careless coil, sat perched up in the corner of her sofa, her fingers nervously crumpling and smoothing out the ends of her sash, while she gazed at the corner of the door. She was inwardly gazing whither he had gone, to that further shore. And that shore, of which she had never thought in old days, which had seemed to her so far away, so incredible, was now closer to her, and more her own, more comprehensible than this side of life, in which all was emptiness and desolation or suffering and humiliation. She was gazing into that world where she knew he was. But she could not see him, except as he had been here on earth. She was seeing him again as he had been at Mytishtchy, at Troitsa, at Yaroslavl. She was seeing his face, hearing his voice, and repeating his words, and words of her own that she had put into his mouth; and sometimes imagining fresh phrases for herself and him which could only have been uttered in the past. Now she saw him as he had once been, lying on a low chair in his velvet, fur-lined cloak, his head propped on his thin, pale hand. His chest looked fearfully hollow, and his shoulders high. His lips were firmly closed, his eyes shining, and there was a line on his white brow that came and vanished again. There was a rapid tremor just perceptible in one foot. Natasha knew he was struggling to bear horrible pain. “What was that pain like? Why was it there? What was he feeling? How did it hurt?” Natasha had wondered. He had noticed her attention, raised his eyes, and, without smiling, began to speak. “One thing would be awful,” he said: “to bind oneself for ever to a suffering invalid. It would be an everlasting torture.” And he had looked with searching eyes at her. Natasha, as she always did, had answered without giving herself time to think; she had said: “It can\u0027t go on like this, it won\u0027t be so, you will get well—quite well.” She was seeing him now as though it were the first time, and going through all she had felt at that time. She recalled the long, mournful, stern gaze he had given her at those words, and she understood all the reproach and the despair in that prolonged gaze. “I agreed,” Natasha said to herself now, “that it would be awful if he were to remain always suffering. I said that then only because it would be so awful for him, but he did not understand it so. He thought that it would be awful for me. Then he still wanted to live, and was afraid of death. And I said it so clumsily, so stupidly. I was not thinking that. I was thinking something quite different. If I had said what I was thinking, I should have said: ‘Let him be dying, dying all the time before my eyes, and I should be happy in comparison with what I am now.\u0027 Now … there is nothing, no one. Did he know that? No. He did not know, and never will know it. And now it can never, never be made up for.” And again he was saying the same words; but this time Natasha in her imagination made him a different answer. She stopped him, and said: “Awful for you, but not for me. You know that I have nothing in life but you, and to suffer with you is the greatest happiness possible for me.” And he took her hand and pressed it, just as he had pressed it on that terrible evening four days before his death. And in her imagination she said to him other words of tenderness and love, which she might have said then, which she only said now … “I love thee! … thee … I love, love thee …” she said, wringing her hands convulsively, and setting her teeth with bitter violence. And a sweeter mood of sorrow was coming over her, and tears were starting into her eyes; but all at once she asked herself: “To whom was she saying that? Where is he, and what is he now?” And again everything was shrouded in chill, cruel doubt, and again, frowning nervously, she tried to gaze into that world where he was. And now, now, she thought, she was just penetrating the mystery … But at that instant, when the incomprehensible, it seemed, was being unveiled before her eyes, a loud rattle at the door handle broke with a painful shock on her hearing. Her maid, Dunyasha, rushed quickly and abruptly into the room with frightened eyes, that took no heed of her. “Come to your papa, make haste,” Dunyasha said, with a strange excited expression. “A misfortune … Pyotr Ilyitch … a letter,” she gasped out, sobbing. 安德烈公爵死后，娜塔莎和玛丽亚公爵小姐都同样感觉到这一点，由于高悬在她们头顶上的可怕的死亡阴影，吓得她们不敢睁开眼睛，精神上处于崩溃状态，不敢正视人生。他们小心翼翼地保护着尚未愈合的伤口，以免遭到污辱性的、会引起疼痛的刺激。所有的事情：大街上急速驰过的一辆马车，请用午餐，使女们请示准备什么布拉吉，更坏的是，虚情假意的关怀，所有这一切，都刺伤着痛处，都好像是一种侮辱，破坏了她们所必须的宁静。她俩在这种宁静中，极力倾听在她们的想象中仍然没有停息的可怕而又严肃的大合唱，也妨碍了她们注视那在她们眼前一晃而过的、神秘的、遥远的、遥远的远方。 只有她们俩在一块时，才不觉得遭受侮辱和痛苦。她们之间很少交谈。即便谈话，也只说些最无关紧要的事情。两个人同样都避免谈到有关未来的任何一件事情。 她们觉得，承认有一个未来，就是对他的纪念的侮辱。她们在谈话中，一切与死者可能有关的事情，都尽量地、更加小心地回避。她们觉得，她们所经历过的和所体验过的事情，都是难以用语言来表达的。她们觉得，凡是提及他的生活细节，都是破坏在她们眼前完成的神秘的尊严和圣洁。 她们沉默寡言，时时刻刻都努力回避着有可能涉及他的话题。这样，她们就从各个方面都设下了，绝不谈及他的警戒线。这就使她们觉得，一切都在她们的想象中更加纯洁、更加鲜明了。 然而，单纯的和无限的悲哀和单纯的和无限的欢乐一样，都是不可能的。玛丽亚公爵小姐，以其所处的地位，她能独立主宰自己的命运，同时她又是她侄子的监护人和教师，首先被现实生活从她头两个星期所陷入的悲伤世界所唤醒。她收到了家中来信，应该回信；尼古卢什卡住的房间潮湿，害得他咳嗽了。阿尔帕特奇来雅罗斯拉夫尔报告了一些事情并建议和劝告搬回莫斯科弗兹德维仁卡的住宅，那所住宅完整，只须稍加修理就行了。生命不停息，就应当活下去。对于玛丽亚公爵小姐来说，要离开她一直生活到现在的冥想世界，心情十分沉重；要丢下孤单单的娜塔莎，不论她多么怜惜，甚至于觉得问心有愧，但是，生活中的许多问题急待她去处理，她也只有服从这种要求了。她和阿尔帕特奇清理了帐目，和德萨尔商量了侄儿的事情，作了妥善安排，作好了迁往莫斯科的准备。 自从玛丽亚公爵小姐在做启程准备时，娜塔莎总是躲着她，独自一人在一边。 玛丽亚公爵小姐向伯爵夫人提出，准许娜塔莎和她一道去莫斯科，娜塔莎的父母欣然应允，他们看到女儿的体力日渐衰弱，以为更换一下环境，还可以请莫斯科的医生给她诊治，这对她是有益的。 在向娜塔莎提出这个建议时，她回答说：“我什么地方都不去。求求你们不要管我，”她说完后强忍住眼泪，从房间里跑了出去，与其说是悲哀，不如说是气恼和忿恨。 自从娜塔莎感到她被玛丽亚公爵小姐抛弃，她要独自承受哀伤之后，她大部分时间就一个人躲在房间里，缩着双腿，坐在沙发的角落里，她用纤细的紧张的手指撕碎或揉搓某一件东西并用执着的目光死死地盯住它。这种孤独的生活使她疲倦、使她痛苦，然而，这对于她又是必不可少的。只要一有人进来，她就立刻站起来，改变她的姿势和眼神的表情，或者是顺手拿一本书看或者是顺手做点针线活，很明显，她急切地等待那个打扰她的人走开。 她总觉得，她马上就要彻底弄清楚那个问题了，而这个问题是她深藏于内心的观点所想探讨出究竟的一个可怕的、又无力解答的问题。 十二月底，娜塔莎穿一件黑色的毛呢布拉吉，辫发上随便绾起一个结，她瘦削、苍白，踡着腿坐在沙发角上，心烦意乱地把衣带的末端揉来揉去，眼睛注视着房门的一角。 她在看他去了的那个方向——人生的彼岸。这一人生彼岸她原先从未想到过，总觉得还相当遥远，也未必就真有。现在她觉得，人生彼岸较此岸更接近，更亲切，更可理解了。而人生此岸所有的一切不是空虚和荒凉，就是痛苦和屈辱。 她向所知的他到过的地方望去，一切依然如旧，她想象不出别的什么样子。她又看见了他在梅季希、在特罗伊茨、在雅罗斯拉夫尔时的样子。 她看见他的脸，听到了他的声音，重述他的话和自己的话和对她说过的话，时而又想到在当时为他和为自己可能说过的其余的一些话。 他穿着丝绒皮衣躺在安乐椅里，头支靠在瘦削、苍白的手上。他的胸脯可怕地凹陷下去，双肩耸立着。双唇紧闭，眼睛闪着亮光，苍白的额头上的皱纹不时地皱紧，隐约可见，他一条腿不停地颤抖。娜塔莎知道，他正在和难以忍受的疼痛作斗争。“这是一种什么痛苦呢？为什么会有这种痛苦？他有什么感觉呢？他是多疼痛啊！”娜塔莎想。他发觉她在注视他，于是抬起眼睛，不露笑容，开始说道。 “有一件事最可怕，”他说，“这就是把我和一个受苦受难的人永远捆绑在一起，这是永无止境的痛苦。”于是，他以试探的目光望着她。娜塔莎像往常一样，不等想好要说什么，就立即回答道：“不会这样下去的，这不会的，您一定会恢复健康，完全恢复。” 她这时又看见了他，并且在体会她在当时所感受的一切。她回想起他在说这番话时的长时间的、忧愁的、严峻的目光。 她明白，这种长时间注视的目光带有责备和绝望的意思。“我承认，”娜塔莎这时自言自语道，“假如他永远受苦，那一定是可怕的。我当时这样说，仅仅是因为这对他是可怕的，可是他却想到一边去了。他当时想，这对于我才是可怕的。他当时还想活，害怕死去。我是对他说了粗暴、愚蠢的话。我不曾想到这一点。我的想法则完全不同。假如我要把我想的说出来，那我就会说：让他死去吧，在我的眼前慢慢地死去，我就会比现在幸福。可现在……什么东西都没有了，什么人也没有了。他知道这一切吗？不。他不知道，他永远都不会知道。而现在，已经永远、永远无法挽回了。”他又对她说同样的话，可是现在，娜塔莎在想象中给他作了完全不同的回答。她打断了他的话，说道：“您要知道，这在您觉得可怕，可在我并不可怕。在我的生活中，没有了你，我便没有了一切，和您一道受苦，对我来说，更幸福。”于是他握住她的手，紧紧地握着，就像他在临终前四天，在那个可怕的夜晚那样握着。于是她在想象中，对他说出另外一些她在当时可能说出的温存、爱抚的话。“我爱你……你……我爱……我爱……”，她说这话时，紧握着双手，拼命地咬紧牙关。 她沉浸在一种甜蜜的悲哀之中，泪水夺眶而出。但是她突然问自己：她是在对谁说这番话？他在哪里？他现在是什么样子？然而一切又被冷酷无情的困惑所遮掩，她又紧锁双眉，她又向着他所在的地点望去，她似乎觉得，她马上就要识破那奥秘……就在她觉得已经解开那难以理解的事物时，门环被敲打得哗哗直响，她十分惊讶，女仆杜尼亚莎慌慌张张地，不顾女主人的面部表情，闯入了房间。 “请您快点到爸爸那儿去。”杜尼亚莎的表情异常紧张地说。“彼得·伊利伊奇不幸的消息……有信来。”她一边抽泣，一边说。","sourceLink":"http://novel.tingroom.com/jingdian/53/3611.html","bookId":585,"book":{"id":585,"title":"War And Peace战争与和平","description":"简介： War and Peace , a Russian novel by Leo Tolstoy, is considered one of the most celebrated works of fiction.It is regarded, along with Anna Karenina (1873–1877), as Tolstoy\u0027s finest literary achievement.Epic in scale, War and Peace deline...","cover":"http://novel.tingroom.com/uploads/allimg/101230/12858150784da3b.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/53","creation":"Aug 1, 2019 12:18:59 AM","modification":"Aug 1, 2019 12:18:59 AM"}}
