{"id":41314,"no":339,"title":"Epilogue 1 Chapter 7","content":"IN THE AUTUMN of 1813, Nikolay married Princess Marya, and with his wife, and mother, and Sonya, took up his abode at Bleak Hills.\\n\\n Within four years he had paid off the remainder of his debts without selling his wife\u0027s estates, and coming into a small legacy on the death of a cousin, he repaid the loan he had borrowed from Pierre also.\\n\\n In another three years, by 1820, Nikolay had so well managed his pecuniary affairs that he was able to buy a small estate adjoining Bleak Hills, and was opening negotiations for the repurchase of his ancestral estate of Otradnoe, which was his cherished dream.\\n\\n Though he took up the management of the land at first from necessity, he soon acquired such a passion for agriculture, that it became his favourite and almost his exclusive interest. Nikolay was a plain farmer, who did not like innovations, especially English ones, just then coming into vogue, laughed at all theoretical treatises on agriculture, did not care for factories, for raising expensive produce, or for expensive imported seed. He did not, in fact, make a hobby of any one part of the work, but kept the welfare of the estate as a whole always before his eyes. The object most prominent to his mind in the estate was not the azote nor the oxygen in the soil or the atmosphere, not a particular plough nor manure, but the principal agent by means of which the azote and the oxygen and the plough and the manure were all made effectual—that is, the labourer, the peasant. When Nikolay took up the management of the land, and began to go into its different branches, the peasant attracted his chief attention. He looked on the peasant, not merely as a tool, but also as an end in himself, and as his critic. At first he studied the peasant attentively, trying to understand what he wanted, what he thought good and bad; and he only made a pretence of making arrangements and giving orders, while he was in reality learning from the peasants their methods and their language and their views of what was good and bad. And it was only when he understood the tastes and impulses of the peasant, when he had learned to speak his speech and to grasp the hidden meaning behind his words, when he felt himself in alliance with him, that he began boldly to direct him—to perform, that is, towards him the office expected of him. And Nikolay\u0027s management produced the most brilliant results.\\n\\n On taking over the control of the property, Nikolay had at once by some unerring gift of insight appointed as bailiff, as village elder, and as delegate the very men whom the peasants would have elected themselves had the choice been in their hands, and the authority once given them was never withdrawn. Before investigating the chemical constituents of manure, or going into “debit and credit” (as he liked sarcastically to call book-keeping), he found out the number of cattle the peasants possessed, and did his utmost to increase the number. He kept the peasants\u0027 families together on a large scale, and would not allow them to split up into separate households. The indolent, the dissolute, and the feeble he was equally hard upon and tried to expel them from the community. At the sowing and the carrying of the hay and corn, he watched over his own and the peasants\u0027 fields with absolutely equal care. And few landowners had fields so early and so well sown and cut, and few had such crops as Nikolay.\\n\\n He did not like to have anything to do with the house-serfs, he called them parasites, and everybody said that he demoralised and spoiled them. When any order had to be given in regard to a house-serf, especially when one had to be punished, he was always in a state of indecision and asked advice of every one in the house. But whenever it was possible to send a house-serf for a soldier in place of a peasant, he did so without the smallest compunction. In all his dealings with the peasants, he never experienced the slightest hesitation. Every order he gave would, he knew, be approved by the greater majority of them.\\n\\n He never allowed himself either to punish a man by adding to his burdens, or to reward him by lightening his tasks simply at the prompting of his own wishes. He could not have said what his standard was of what he ought and ought not to do; but there was a standard firm and rigid in his soul.\\n\\n Often talking of some failure or irregularity, he would complain of “our Russian peasantry,” and he imagined that he could not bear the peasants.\\n\\n But with his whole soul he did really love “our Russian peasantry,” and their ways; and it was through that he had perceived and adopted the only method of managing the land which could be productive of good results.\\n\\n Countess Marya was jealous of this passion of her husband\u0027s for agriculture, and regretted she could not share it. But she was unable to comprehend the joys and disappointments he met with in that world apart that was so alien to her. She could not understand why he used to be so particularly eager and happy when after getting up at dawn and spending the whole morning in the fields or the threshing-floor he came back to tea with her from the sowing, the mowing, or the harvest. She could not understand why he was so delighted when he told her with enthusiasm of the well-to-do, thrifty peasant Matvey Ermishin, who had been up all night with his family, carting his sheaves, and had all harvested when no one else had begun carrying. She could not understand why, stepping out of the window on to the balcony, he smiled under his moustaches and winked so gleefully when a warm, fine rain began to fall on his young oats that were suffering from the drought, or why, when a menacing cloud blew over in mowing or harvest time, he would come in from the barn red, sunburnt, and perspiring, with the smell of wormwood in his hair, and rubbing his hands joyfully would say: “Come, another day of this and my lot, and the peasants\u0027 too, will all be in the barn.”\\n\\n Still less could she understand how it was that with his good heart and everlasting readiness to anticipate her wishes, he would be thrown almost into despair when she brought him petitions from peasants or their wives who had appealed to her to be let off tasks, why it was that he, her good-natured Nikolay, obstinately refused her, angrily begging her not to meddle in his business. She felt that he had a world apart, that was intensely dear to him, governed by laws of its own which she did not understand.\\n\\n Sometimes trying to understand him she would talk to him of the good work he was doing in striving for the good of his serfs; but at this he was angry and answered: “Not in the least; it never even entered my head; and for their good I would not lift my little finger. That\u0027s all romantic nonsense and old wives\u0027 cackle—all that doing good to one\u0027s neighbour. I don\u0027t want our children to be beggars; I want to build up our fortunes in my lifetime; that is all. And to do that one must have discipline, one must have strictness … So there!” he would declare, clenching his sanguine fist. “And justice too—of course,” he would add, “because if the peasant is naked and hungry, and has but one poor horse, he can do no good for himself or me.”\\n\\n And doubtless because Nikolay did not allow himself to entertain the idea that he was doing anything for the sake of others, or for the sake of virtue, everything he did was fruitful. His fortune rapidly increased; the neighbouring serfs came to beg him to purchase them, and long after his death the peasantry preserved a reverent memory of his rule. “He was a master … The peasants\u0027 welfare first and then his own. And to be sure he would make no abatements. A real good master—that\u0027s what he was!”\\n\\n 三年内，他没有变卖妻子的田产就还清了其余的债务。一个表姐去世后，他继承了一笔不大的遗产，把欠皮埃尔的债也还清了。\\n\\n 又过了三年，到一八二○年，尼古拉已把他的财务整顿得有条不紊，更进一步在童山附近买了一处不大的庄园；此时他还在谈判买回父亲在奥特拉德诺耶的住宅——这可是他梦寐以求的一桩大事啊！\\n\\n 起初，他管理家业是出于需要，但不久就对经营庄园入了迷，几乎成为他独一无二的爱好了。尼古拉是个普通地主，不喜欢新办法，特别不喜欢当时流行的那套英国办法，他嘲笑经济理论著作，不喜欢办工厂，不喜欢价格高昂的产品，不喜欢种植其他贵重的农作物，也不单独经营农业的某一部门。他的目光总是盯着整个庄园，而不是庄园的某一部门，在庄园里，主要的东西不是存在于土壤和空气中的氮和氧，不是特别的犁和粪肥，而是使氮、氧、粪肥和犁发生作用的主要手段，也就是农业劳动者。当尼古拉着手管理庄园，深入了解它的各个方面的时候，尤其注重农民。他认为农民不仅是农业生产中的主要手段，而且是农业生产的最终目标和判断农业生产最后效益的主要裁判员。他先是观察农民，竭力了解他们的需要，了解他们对好坏的看法，他只是在表面上发号施令，而实际上是向农民学习他们的工作方法、语言，以及对好坏是非的判断。只有当他了解农民的爱好和愿望，学会用他们的语言说话，懂得他们话里潜在的意思，感到自己同他们已打成一片；只有在这个时候他才大胆地管理他们，也就是对农民尽他应尽的责任。尼古拉就是这样来经营他的农庄，于是在农业上他取得了最辉煌的成就。\\n\\n 尼古拉着手管理庄园的时候，凭着他那天赋的洞察力，立刻指定了合适的村长和工长（如果农民有权选举的话，也会选上这两个人的），而且再也不更换。他首先做的不是研究粪肥的化学成分，不是钻研借方和贷方（他爱说这种嘲笑的话），而是弄清农民牲口的头数，并千方百计使牲口增加。他支持农民维持大家庭，不赞成分家。他对懒汉、二流子和软弱无能的人一概不姑息，尽可能把他们从集体驱逐出去。\\n\\n 在播种、收割干草和作物上，他对自己的田地和对农民的田地一视同仁。像尼古拉这样播种和收割得又早又好、收入又这么好的地主很少。\\n\\n 他不爱管家奴的事，称他们为吃闲饭的人。然而大家却说他姑息家奴，把他们惯坏了。每当需要对某个家奴作出决定时，特别是作出处分时，他总是犹豫不决，要同家里所有的人商量。只有在可以用家奴代替农民去当兵的时候，他就会毫不犹豫地派家奴去当兵。在处理有关农民的问题上，他从来没有丝毫疑虑。他知道，他的每项决定都得到全体农民的拥护，最多只有一两个人持不同意见。\\n\\n 他不会只凭一时心血来潮找什么人的麻烦或者处分什么人，也不会凭个人的好恶宽恕人和奖赏人。他说不出什么事该做和什么事不该做，但两者的标准在他心里是明确不变的。\\n\\n 他对不顺利，或者乱七八糟的事，常常生气地说：“我们俄国老百姓真没办法。”他似乎觉得他无法容忍这样的农夫。\\n\\n 然而他却是用整个心灵爱“我们俄国老百姓”，爱他们的风俗习惯，正因为这样，他才能了解和采用最富有成效的、最适合俄罗斯农村特点的农村生产经营方法和方式。\\n\\n 玛丽亚伯爵夫人妒忌丈夫对事业的热爱，惋惜她不能分享这种感情，但她也不能理解他在那个对她来说是如此隔膜和生疏的世界里感受到的快乐和烦恼。她无法理解，他天一亮就起身，在田地里或打谷场上消磨整个早晨，在播种、割草或者收获后回家同她一起喝茶时，怎么总是那样兴高采烈，得意洋洋。当他赞赏地谈起富裕农户马特维·叶尔米什和他家里的人通宵搬运庄稼，别人还没有收割，可他已垛好禾捆的时候，她不能理解他讲这种事的时候怎么会这样兴致勃勃。当他看见温顺的细雨洒在干旱的燕麦苗上时，他从窗口走到阳台上，眨着眼，咧开留着胡髭的嘴唇，她无法明了他怎么会笑得那么开心。在割草或者收庄稼的时候，满天乌云被风吹散，他的脸晒得又红又黑汗水淋淋，身上带着一股苦艾和野菊的气味，从打谷场回来，这时，她不能理解为什么他总是高兴地搓着手说“再有一天，我们的粮食和农民的粮食都可以入仓了”。\\n\\n 她更不了解的是，这个心地善良、事事顺她意的人，一听到她替农妇式农夫求情免除他们的劳役时，为什么就会露出绝望的神情，为什么善心的尼古拉坚决拒绝她，他很气忿地叫她不要过问那与她无关的事。她觉得他有一个特殊的世界，他十分热爱那个世界，而她却不懂那个世界的某些规章制度。\\n\\n 她有时竭力想了解他，对他谈起他的功劳在于给农奴做了好事，他一听就恼了，他回答说：“根本不是这么回事，我从来没有这么想过，我也没有为他们谋福利。什么为他人谋幸福，全都是说得漂亮，全都是娘们的胡扯。我可不愿让我的孩子们上街去要饭，我活一天，就要理好我的家业，就是这样。为了做到这一点，就要立个好规矩，必须严格管理，就是这样。”他激动地握紧拳头说。“当然也要公平合理，”他又说，“因为，如果农民缺衣少食，家里只有一匹瘦马，那他既不能为他自己干好活，也不能给我干什么活了。”\\n\\n 也许，正因为尼古拉没有让自己想到他是在为别人做好事，是在乐善好施，于是他所做的一切都是那么富于成效，他的财富迅速增加，邻庄的农奴都来请求把他们买过去。就在他死后很久，农奴们还念念不忘他的治理才能。”“他是个好东家，……把农民的事放在前头，自己的事放在后头。可是他对人并不姑息。没说的——一个好东家。”\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/53/3637.html","bookId":585,"book":{"id":585,"title":"War And Peace战争与和平","description":"简介： War and Peace , a Russian novel by Leo Tolstoy, is considered one of the most celebrated works of fiction.It is regarded, along with Anna Karenina (1873–1877), as Tolstoy\u0027s finest literary achievement.Epic in scale, War and Peace deline...","cover":"http://novel.tingroom.com/uploads/allimg/101230/12858150784da3b.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/53","creation":"Aug 1, 2019 12:18:59 AM","modification":"Aug 1, 2019 12:18:59 AM"}}
