{"id":41022,"no":47,"title":"Book 3 Chapter 1","content":"PRINCE VASSILY used not to think over his plans. Still less did he think of doing harm to others for the sake of his own interest. He was simply a man of the world, who had been successful in the world, and had formed a habit of being so. Various plans and calculations were continually forming in his mind, arising from circumstances and the persons he met, but he never deliberately considered them, though they constituted the whole interest of his life. Of such plans and calculations he had not one or two, but dozens in train at once, some of them only beginning to occur to him, others attaining their aim, others again coming to nothing. He never said to himself, for instance: “That man is now in power, I must secure his friendship and confidence, and through him obtain a grant from the Single-Assistance Fund”; nor, “Now Pierre is a wealthy man, I must entice him to marry my daughter and borrow the forty thousand I need.” But the man in power met him, and at the instant his instinct told him that that man might be of use, and Prince Vassily made friends with him, and at the first opportunity by instinct, without previous consideration, flattered him, became intimate with him, and told him of what he wanted.\\n\\n Pierre was ready at hand in Moscow, and Prince Vassily secured an appointment as gentleman of the bedchamber for him, a position at that time reckoned equal in status to that of a councillor of state, and insisted on the young man\u0027s travelling with him to Petersburg, and staying at his house. Without apparent design, but yet with unhesitating conviction that it was the right thing, Prince Vassily did everything to ensure Pierre\u0027s marrying his daughter. If Prince Vassily had definitely reflected upon his plans beforehand, he could not have been so natural in his behaviour and so straightforward and familiar in his relations with every one, of higher and of lower rank than himself. Something drew him infallibly towards men richer or more powerful than himself, and he was endowed with a rare instinct for hitting on precisely the moment when he should and could make use of such persons.\\n\\n Pierre, on unexpectedly becoming rich and Count Bezuhov, after his lonely and careless manner of life, felt so surrounded, so occupied, that he never succeeded in being by himself except in his bed. He had to sign papers, to present himself at legal institutions, of the significance of which he had no definite idea, to make some inquiry of his chief steward, to visit his estate near Moscow, and to receive a great number of persons, who previously had not cared to be aware of his existence, but now would have been hurt and offended if he had not chosen to see them. All these various people, business men, relations, acquaintances, were all equally friendly and well disposed towards the young heir. They were all obviously and unhesitatingly convinced of Pierre\u0027s noble qualities. He was continually hearing phrases, such as, “With your exceptionally kindly disposition”; or, “Considering your excellent heart”; or, “You are so pure-minded yourself, count …” or, “If he were as clever as you,” and so on, so that he was beginning genuinely to believe in his own exceptional goodness and his own exceptional intelligence, the more so, as at the bottom of his heart it had always seemed to him that he really was very good-natured and very intelligent. Even people, who had before been spiteful and openly hostile to him, became tender and affectionate. The hitherto ill-tempered, eldest princess, with the long waist and the hair plastered down like a doll, had gone into Pierre\u0027s room after the funeral. Dropping her eyes and repeatedly turning crimson, she said that she very much regretted the misunderstanding that had arisen between them, and that now she felt she had no right to ask him for anything except permission, after the blow that had befallen her, to remain for a few weeks longer in the house which she was so fond of, and in which she had made such sacrifices. She could not control herself, and wept at these words. Touched at seeing the statue-like princess so changed, Pierre took her by the hand and begged her pardon, though he could not have said what for. From that day the princess began knitting a striped scarf for Pierre, and was completely changed towards him.\\n\\n “Do this for my sake, my dear boy; she had to put up with a great deal from the deceased, any way,” Prince Vassily said to him, giving him some deed to sign for the princess\u0027s benefit. Prince Vassily reflected that this note of hand for thirty thousand was a sop worth throwing to the poor princess, that it might not occur to her to gossip about Prince Vassily\u0027s part in the action taken with the inlaid portfolio. Pierre signed the note, and from that time the princess became even more amiable. The younger sisters became as affectionate too, especially the youngest one, the pretty one with the mole, who often disconcerted Pierre with her smiles and her confusion at the sight of him.\\n\\n To Pierre it seemed so natural that every one should be fond of him, it would have seemed to him so unnatural if any one had not liked him, that he could not help believing in the sincerity of the people surrounding him. Besides, he had no time to doubt their sincerity or insincerity. He never had a moment of leisure, and felt in a continual state of mild and agreeable intoxication. He felt as though he were the centre of some important public function, felt that something was continually being expected of him; that if he did this and that, all would be well, and he did what was expected of him, but still that happy result loomed in the future.\\n\\n In these early days Prince Vassily, more than all the rest, took control of Pierre\u0027s affairs, and of Pierre himself. On the death of Count Bezuhov he did not let Pierre slip out of his hands. Prince Vassily had the air of a man weighed down by affairs, weary, worried, but from sympathetic feeling, unable in the last resort to abandon this helpless lad, the son, after all, of his friend, and the heir to such an immense fortune, to leave him to his fate to become a prey to plotting knaves. During the few days he had stayed on in Moscow after Count Bezuhov\u0027s death, he had invited Pierre to him, or had himself gone to see Pierre, and had dictated to him what he was to do in a tone of weariness and certainty which seemed to be always saying: “You know that I am overwhelmed with business and that it is out of pure charity that I concern myself with you, and moreover you know very well that what I propose to you is the only feasible thing.”\\n\\n “Well, my dear boy, to-morrow we are off at last,” he said one day, closing his eyes, drumming his fingers on his elbow, and speaking as though the matter had long ago been settled between them, and could not be settled in any other way.\\n\\n “To-morrow we set off; I\u0027ll give you a place in my coach. I\u0027m very glad. Here all our important business is settled. And I ought to have been back long ago. Here, I have received this from the chancellor. I petitioned him in your favour, and you are put on the diplomatic corps, and created a gentleman of the bedchamber. Now a diplomatic career lies open to you.”\\n\\n Notwithstanding the effect produced on him by the tone of weariness and certainty with which these words were uttered, Pierre, who had so long been pondering over his future career, tried to protest. But Prince Vassily broke in on his protest in droning, bass tones, that precluded all possibility of interrupting the flow of his words; it was the resource he fell back upon when extreme measures of persuasion were needed.\\n\\n “But, my dear boy, I have done it for my own sake, for my conscience\u0027 sake, and there is no need to thank me. No one has ever complained yet of being too much loved; and then you are free, you can give it all up to-morrow. You\u0027ll see for yourself in Petersburg. And it is high time you were getting away from these terrible associations.” Prince Vassily sighed. “So that\u0027s all settled, my dear fellow. And let my valet go in your coach. Ah, yes, I was almost forgetting,” Prince Vassily added. “You know, my dear boy, I had a little account to settle with your father, so as I have received something from the Ryazan estate, I\u0027ll keep that; you don\u0027t want it. We\u0027ll go into accounts later.”\\n\\n What Prince Vassily called “something from the Ryazan estate” was several thousands of roubles paid in lieu of service by the peasants, and this sum he kept for himself.\\n\\n In Petersburg, Pierre was surrounded by the same atmosphere of affection and tenderness as in Moscow. He could not decline the post, or rather the title (for he did nothing) that Prince Vassily had obtained for him, and acquaintances, invitations, and social duties were so numerous that Pierre was even more than in Moscow conscious of the feeling of stupefaction, hurry and continued expectation of some future good which was always coming and was never realised.\\n\\n Of his old circle of bachelor acquaintances there were not many left in Petersburg. The Guards were on active service, Dolohov had been degraded to the ranks; Anatole had gone into the army and was somewhere in the provinces; Prince Andrey was abroad; and so Pierre had not the opportunity of spending his nights in the way he had so loved spending them before, nor could he open his heart in intimate talk with the friend who was older than himself and a man he respected. All his time was spent at dinners and balls, or at Prince Vassily\u0027s in the society of the fat princess, his wife, and the beauty, his daughter Ellen.\\n\\n Like every one else, Anna Pavlovna Scherer showed Pierre the change that had taken place in the attitude of society towards him.\\n\\n In former days, Pierre had always felt in Anna Pavlovna\u0027s presence that what he was saying was unsuitable, tactless, not the right thing; that the phrases, which seemed to him clever as he formed them in his mind, became somehow stupid as soon as he uttered them aloud, and that, on the contrary, Ippolit\u0027s most pointless remarks had the effect of being clever and charming. Now everything he said was always “delightful.” Even if Anna Pavlovna did not say so, he saw she was longing to say so, and only refraining from doing so from regard for his modesty.\\n\\n At the beginning of the winter, in the year 1805, Pierre received one of Anna Pavlovna\u0027s customary pink notes of invitation, in which the words occurred: “You will find the fair Hélène at my house, whom one never gets tired of seeing.”\\n\\n On reading that passage, Pierre felt for the first time that there was being formed between himself and Ellen some sort of tie, recognised by other people, and this idea at once alarmed him, as though an obligation were being laid upon him which he could not fulfil, and pleased him as an amusing supposition.\\n\\n Anna Pavlovna\u0027s evening party was like her first one, only the novel attraction which she had provided for her guests was not on this occasion Mortemart, but a diplomat, who had just arrived from Berlin, bringing the latest details of the Emperor Alexander\u0027s stay at Potsdam, and of the inviolable alliance the two exalted friends had sworn together, to maintain the true cause against the enemy of the human race. Pierre was welcomed by Anna Pavlovna with a shade of melancholy, bearing unmistakable reference to the recent loss sustained by the young man in the death of Count Bezuhov (every one felt bound to be continually assuring Pierre that he was greatly afflicted at the death of his father, whom he had hardly known). Her melancholy was of precisely the same kind as that more exalted melancholy she always displayed at any allusion to Her Most August Majesty the Empress Marya Fyodorovna. Pierre felt flattered by it. Anna Pavlovna had arranged the groups in her drawing-room with her usual skill. The larger group, in which were Prince Vassily and some generals, had the benefit of the diplomat. Another group gathered about the tea-table. Pierre would have liked to join the first group, but Anna Pavlovna, who was in the nervous excitement of a general on the battlefield, that mental condition in which numbers of brilliant new ideas occur to one that one has hardly time to put into execution—Anna Pavlovna, on seeing Pierre, detained him with a finger on his coat sleeve: “Wait, I have designs on you for this evening.”\\n\\n She looked round at Ellen and smiled at her.\\n\\n “My dear Hélène, you must show charity to my poor aunt, who has an adoration for you. Go and keep her company for ten minutes. And that you may not find it too tiresome, here\u0027s our dear count, who certainly won\u0027t refuse to follow you.”\\n\\n The beauty moved away towards the old aunt; but Anna Pavlovna still detained Pierre at her side, with the air of having still some last and essential arrangement to make with him.\\n\\n “She is exquisite, isn\u0027t she?” she said to Pierre, indicating the majestic beauty swimming away from them. “And how she carries herself! For such a young girl, what tact, what a finished perfection of manner. It comes from the heart. Happy will be the man who wins her. The most unworldly of men would take a brilliant place in society as her husband. That\u0027s true, isn\u0027t it? I only wanted to know your opinion,” and Anna Pavlovna let Pierre go.\\n\\n Pierre was perfectly sincere in giving an affirmative answer to her question about Ellen\u0027s perfection of manner. If ever he thought of Ellen, it was either of her beauty that he thought, or of her extraordinary capacity for serene, dignified silence in society.\\n\\n The old aunt received the two young people in her corner, but appeared anxious to conceal her adoration of Ellen, and rather to show her fear of Anna Pavlovna. She glanced at her niece, as though to inquire what she was to do with them. Anna Pavlovna again laid a finger on Pierre\u0027s sleeve and said: “I hope you will never say in future that people are bored at my house,” and glanced at Ellen. Ellen smiled with an air, which seemed to say that she did not admit the possibility of any one\u0027s seeing her without being enchanted. The old aunt coughed, swallowed the phlegm, and said in French that she was very glad to see Ellen; then she addressed Pierre with the same greeting and the same grimace. In the middle of a halting and tedious conversation, Ellen looked round at Pierre and smiled at him with the bright, beautiful smile with which she smiled at every one. Pierre was so used to this smile, it meant so little to him, that he did not even notice it. The aunt was speaking at that moment of a collection of snuff-boxes belonging to Pierre\u0027s father, Count Bezuhov, and she showed them her snuff-box. Princess Ellen asked to look at the portrait of the aunt\u0027s husband, which was on the snuff-box.\\n\\n “It\u0027s probably the work of Vines,” said Pierre, mentioning a celebrated miniature painter. He bent over the table to take the snuff-box, listening all the while to the conversation going on in the larger group. He got up to move towards it, but the aunt handed him the snuff-box, passing it across Ellen, behind her back. Ellen bent forward to make room, and looked round smiling. She was, as always in the evening, wearing a dress cut in the fashion of the day, very low in the neck both in front and behind. Her bust, which had always to Pierre looked like marble, was so close to his short-sighted eyes that he could discern all the living charm of her neck and shoulders, and so near his lips that he need scarcely have stooped to kiss it. He felt the warmth of her body, the fragrance of scent, and heard the creaking of her corset as she moved. He saw not her marble beauty making up one whole with her gown; he saw and felt all the charm of her body, which was only veiled by her clothes. And having once seen this, he could not see it otherwise, just as we cannot return to an illusion that has been explained.\\n\\n “So you have never noticed till now that I am lovely?” Ellen seemed to be saying. “You haven\u0027t noticed that I am a woman? Yes, I am a woman, who might belong to any one—to you, too,” her eyes said. And at that moment Pierre felt that Ellen not only could, but would become his wife, that it must be so.\\n\\n He knew it at that moment as surely as he would have known it, standing under the wedding crown beside her. How would it be? and when? He knew not, knew not even if it would be a good thing (he had a feeling, indeed, that for some reason it would not), but he knew it would be so.\\n\\n Pierre dropped his eyes, raised them again, and tried once more to see her as a distant beauty, far removed from him, as he had seen her every day before. But he could not do this. He could not, just as a man who has been staring in a fog at a blade of tall steppe grass and taking it for a tree cannot see a tree in it again, after he has once recognised it as a blade of grass. She was terribly close to him. Already she had power over him. And between him and her there existed no barriers of any kind, but the barrier of his own will.\\n\\n “Very good, I will leave you in your little corner. I see you are very comfortable there,” said Anna Pavlovna\u0027s voice. And Pierre, trying panic-stricken to think whether he had done anything reprehensible, looked about him, crimsoning. It seemed to him as though every one knew, as well as he did, what was passing in him. A little later, when he went up to the bigger group, Anna Pavlovna said to him:\\n\\n “I am told you are making improvements in your Petersburg house.” (This was the fact: the architect had told him it was necessary, and Pierre, without knowing with what object, was having his immense house in Petersburg redecorated.) “That is all very well, but do not move from Prince Vassily\u0027s. It is a good thing to have such a friend as the prince,” she said, smiling to Prince Vassily. “I know something about that. Don\u0027t I? And you are so young. You need advice. You mustn\u0027t be angry with me for making use of an old woman\u0027s privileges.” She paused, as women always do pause, in anticipation of something, after speaking of their age. “If you marry, it\u0027s a different matter.” And she united them in one glance. Pierre did not look at Ellen, nor she at him. But she was still as terribly close to him.\\n\\n He muttered something and blushed.\\n\\n After Pierre had gone home, it was a long while before he could get to sleep; he kept pondering on what was happening to him. What was happening? Nothing. Simply he had grasped the fact that a woman, whom he had known as a child, of whom he had said, without giving her a thought, “Yes, she\u0027s nice-looking,” when he had been told she was a beauty, he had grasped the fact that that woman might belong to him. “But she\u0027s stupid, I used to say myself that she was stupid,” he thought. “There is something nasty in the feeling she excites in me, something not legitimate. I have been told that her brother, Anatole, was in love with her, and she in love with him, that there was a regular scandal, and that\u0027s why Anatole was sent away. Her brother is Ippolit.…Her father is Prince Vassily.…That\u0027s bad,” he mused; and at the very moment that he was reflecting thus (the reflections were not followed out to the end) he caught himself smiling, and became conscious that another series of reflections had risen to the surface across the first, that he was at the same time meditating on her worthlessness, and dreaming of how she would be his wife, how she might love him, how she might become quite different, and how all he had thought and heard about her might be untrue. And again he saw her, not as the daughter of Prince Vassily, but saw her whole body, only veiled by her grey gown. “But, no, why didn\u0027t that idea ever occur to me before?” And again he told himself that it was impossible, that there would be something nasty, unnatural, as it seemed to him, and dishonourable in this marriage. He recalled her past words and looks, and the words and looks of people, who had seen them together. He remembered the words and looks of Anna Pavlovna, when she had spoken about his house, he recollected thousands of such hints from Prince Vassily and other people, and he was overwhelmed with terror that he might have bound himself in some way to do a thing obviously wrong, and not what he ought to do. But at the very time that he was expressing this to himself, in another part of his mind her image floated to the surface in all its womanly beauty.\\n\\n 在莫斯科，皮埃尔和瓦西里公爵十分接近，他替皮埃尔谋到一个低级侍从的差事，当时那官阶等于五等文官，他便坚持己见，要皮埃尔和他一道到彼得堡去，住在他家里。瓦西里公爵促使皮埃尔娶他的女儿为妻所必须做的事情，他样样都做，这样行事仿佛是因为他颟颟顸顸，但同时他又显得信心十足。假如瓦西里公爵事先周密地考虑自己的计划，他在态度上就不会这样自然，在对待比他地位更高或更低的人们就不会这样浑厚和亲切。有某种东西经常吸引他趋向那些比他更有权势、更加富有的人；他在把握什么时候必须、什么时候可以利用别人的时机方面，富有非凡的本事。\\n\\n 不久以前，皮埃尔过着无忧无虑的孤寂的生活，他出乎意料地变成了财主和别祖霍夫伯爵，在此之后他觉得自己被杂事纠缠，忙得不可开交，只有躺在床上时才能独自一人安享清闲。他得签署多种公文，和他不熟悉的办公场所打交道，向总管家询问某些事情，去莫斯科附近的领地走走，接见许多人士，他们从前甚至不想知道他的生活情况，如果现在他不想和他们会面，他们就会感到屈辱和痛心。这些形形色色的人士：实业家、亲戚、熟人，都很和善而温柔地对待年轻的继承人，博取他的欢心，显然他们都对皮埃尔的高尚的品格深信不疑。他不时地听到这些话：“以您的分外的仁慈”，或则：“以您的善心”，或则，“伯爵，您本人如此纯洁……”或则：“如果他像您这样聪明”诸如此类，因此他真的相信自己那种分外的仁慈，相信自己与众不同的智慧，而且在灵魂深处，他经常觉得他确实非常仁慈，非常聪明。甚至连那些过去凶狠、显然怀有敌意的人也对他和和气气，爱抚备至。好生气的大公爵小姐，身腰修长，头发弄得很服贴，像个洋娃娃似的。在安葬别祖霍夫之后，她走进皮埃尔的房间。她垂下眼帘，满面通红，对他说，她对过去他们之间的误会深表遗憾，现在她觉得没有理由奢求什么，只请求在她遭受打击之后准许她在这栋住宅中逗留几个星期，因为她深深地爱着这栋住宅，在这里作出了许多贡献。她说这番话时不禁大哭起来。这个雕像似的公爵小姐发生了很大的变化，这使皮埃尔颇为感动，他一把抓住她的手，请求她宽恕，连他自己也不明白为什么要央求她宽恕。从这天起，公爵小姐便替皮埃尔编织有条纹的围巾，她对他的态度完全变了。\\n\\n “moncher（我亲爱的），你替她办妥这件事吧，她毕竟为死者吃了许多苦啊，”瓦西里公爵对他说，一面要他在一张对公爵小姐有利的文据上签字。\\n\\n 瓦西里公爵拿定了主意，认为这块骨头——三万卢布的期票——还是要扔给可怜的公爵小姐，要她死了心眼，不去谈论瓦西里公爵参与抢夺嵌花皮包的丑事。皮埃尔在期票上签了字，从那时起，公爵小姐变得更加和善了。她的几个妹妹也对他亲热起来，尤其是那个年纪最小、脸上有颗胎痣。长得俊俏的公爵小姐；她笑容可掬，一看见他就觉得不好意思，这常常使得皮埃尔困窘不安。\\n\\n 皮埃尔觉得，大家喜爱他是顺应自然的事情，如果有人不爱他，他就会觉得异乎寻常了，因此，他不能不相信他周围的人都怀有一片诚心。而且他没有功夫去问自己，这些人是否真无二心。他经常忙得不亦乐乎，经常觉得自己处于温柔和欢愉的陶醉之中。他觉得自己是某种重要的公共活动的中心人物，他觉得经常有人对他有所期待，如果不办妥某件事，就会使许多人痛心，就会使他们失望，如果能办妥某件事，那么一切都顺利，因此，如有求于他，他尽力而为，但是这种“顺利”始终是一句后话而已。\\n\\n 起初，瓦西里公爵较诸其他人更多地支配皮埃尔本人和他的各种事情。自从别祖霍夫伯爵去世后，他一直管着皮埃尔，没有放松过。瓦西里公爵摆出那副样子，就像某人负担沉重、精疲力尽似的，但出于怜悯，他终究不能抛弃这个孤立无援的少年，听凭命运和骗子们的摆布，皮埃尔毕竟是他的朋友的儿子，aprèstout①他拥有这么一大笔财富。别祖霍夫伯爵辞世后，他在莫斯科逗留过几天，在这几天中，他常把皮埃尔喊到身边，他也亲自去找皮埃尔，嘱咐他要做什么事，那口气中含有倦意和自信，仿佛他每次都附带说过这席话似的：\\n\\n “Voussavez，quejesuisaccabléd\u0027affairesetquecen\u0027estqueparpurecharitè，quejem\u0027occupedevous，etpuisvoussavezbien，quecequejevousproposeestlaseulchosefaisable．”② \\n\\n ①法语：归根结底。\\n\\n ②法语：你知道，我负担过重的工作，但把你丢开不管，是冷酷无情的。你也知道，我对你所说的话是唯一可行的。\\n\\n “我们明天要走了，我让你坐上我的马车。我感到非常高兴。我们这儿的重要事情都干完了。我早就应当走了。你看，我收到大臣的来信。我为你向他求情，你被编入外交使团，录用为低级侍从。现今你面前展现了一条外交上的康庄大道。”\\n\\n 尽管皮埃尔说了这些话，他那疲倦而自信的腔调强而有力，但是他对自己的功名利禄考虑了很久，心里还想提出异议。可是瓦西里公爵用那低沉的嘟嘟囔囔的声调打断他的话，这种声调排除了别人打断他的话的可能性，通常他是在劝说他人的情况下才应用这种腔调的。\\n\\n “mais，moncher①我为自己，为我自己的良心才办了这件事，所以，用不着感谢我。从来没有任何人抱怨，说人家溺爱他了，以后你没事了，即使明天不干也行。你在彼得堡什么都会看得一清二楚的。你老早就得摆脱这些可怕的回忆，”瓦西里公爵叹了一口气，“我亲爱的，就是这样的。让我的近侍坐你的车子一同去吧。哎呀，对了，我原来忘记了，”瓦西里公爵又补充地说，“moncher，”②你晓得，我和死者有一笔旧帐，梁赞寄来的一笔钱，我收到了，把它留下来，你眼下不缺钱用，我们以后会把帐目算清的。” \\n\\n ①法语：可是，我亲爱的。\\n\\n ②法语：我的朋友。\\n\\n 在彼得堡像在莫斯科一样，那些宠爱皮埃尔的性情温和的人们所造成的气氛笼罩着他。他不能拒绝瓦西里公爵给他谋到的差事，或者莫如说职位（因为他无所事事），而交游、邀请和社会活动竟是那么多，以致皮埃尔比在莫斯科更多地体会到一种迷迷糊糊的忙忙碌碌的感觉，一种即将来临而尚未实现的幸福的感觉。\\n\\n 他从前那些未婚的伙伴中，许多人都不在彼得堡。近卫军远征去了。多洛霍夫已受到降级处分，阿纳托利在外省军队里服役，安德烈公爵在国外，因此皮埃尔既不能像从前那样喜欢消度良霄，也不能和年纪大的受人尊敬的朋友在畅谈中排解愁闷了。他在午宴上、舞会上，主要是在瓦西里公爵家中——在肥胖的公爵夫人、即是他的妻子和美丽的女郎海伦这个小团体中，消度他的全部时光。\\n\\n 安娜·帕夫洛夫娜·舍利尔，也像其他人一样，对皮埃尔改变了态度，发生了社会对他的看法上所发生的那种变化。\\n\\n 以前，皮埃尔在安娜·帕夫洛夫娜面前经常觉得他所说的话失礼、无分寸，说出一些不宜于说出的话。他在脑海中酝酿发言的时候，总觉得他要说的话都是明智的，可是一当他大声说出来，这些话就变得愚蠢了。与之相反，伊波利特说的至为愚蠢的话，却被人看成是明智而且动听的。而今，无论他说什么话，都被认为charmant①。即令安娜·帕夫洛夫娜不开口，他也会发觉，她想说出这一点，为尊重他的谦逊起见，她才忍住没有把话说出来。\\n\\n 从一八○五年冬季之初至一八○六年，皮埃尔接获安娜·帕夫洛夫娜寄来的一封普通的玫瑰色的请帖，请帖上并有补充的话：“VoustrouverezchezmoilabelleHéléne，qu\u0027onneselassejamaisvoir．”② \\n\\n ①法语：十分动听。\\n\\n ②法语：“有个百看不厌的十分标致的海伦要到我这里来。”\\n\\n 安娜·帕夫洛夫娜举办的晚会还和第一次晚会一样，只是安娜·帕夫洛夫娜用以款待客人的一道新菜，现在已经不是莫特马尔，而是一位来自柏林的外交官，他捎来了详细的新闻——亚历山大皇帝在波茨坦逗留、两位至为高贵的朋友在那里立誓永缔牢不可破的联盟，为维护正义事业而反对人类的敌人。皮埃尔受到安娜·帕夫洛夫娜的接待，她流露着一点忧愁，这显然是年轻人不久以前丧父——别祖霍夫伯爵去世之事牵动了安娜的心（大家总是认为，说服皮埃尔，要他对他几乎不认识的父亲的去世深表哀恸，是他们自己的天职），而她流露的一点忧愁宛如她一提到至尊的玛丽亚·费奥多罗夫娜皇太后时流露的哀思一样。这使皮埃尔深感荣幸。安娜·帕夫洛夫娜用她那惯用的方法把她的客厅中的客人编成几个组。瓦西里公爵和几位将军的那个大组用上了一名外交官。另一组人在茶几旁边就座，皮埃尔想加入第一组，可是安娜·帕夫洛夫娜处于激动不安的状态中，就像战场上的将领此时脑海中浮现出千万种上策，但尚未一一实现似的。她望见皮埃尔后，便用指头摸了摸他的袖筒。\\n\\n “Attendezjáidesvuessurvouspourcesoir．”①她望望海伦，对她微露笑容。 \\n\\n ①法语：等一等，今天晚上我打算找您聊聊。\\n\\n 美丽的女郎向姑母跟前走去了，但是安娜·帕夫洛夫娜还把皮埃尔留在自己身边，装出那副样子，好像她还要作出最后一次必要的嘱咐似的。\\n\\n “她多么惹人喜欢，不是吗？”她对皮埃尔说道，一面指着庄重地慢慢走开的美妙的女郎，“Etquelletenue！②这样年轻的姑娘善长于保持有分寸的态度！这是一种出自内心的表现！谁能占有她，谁就会无比幸福。一个非交际场中的丈夫有了她无形中就会在上流社会占有至为显赫的地位。是不是？我只想知道您的意见。”于是安娜·帕夫洛夫娜让皮埃尔走开了。 \\n\\n ①法语：我亲爱的海伦，您要仁慈地对待我可怜的姑母吧，她是宠爱您的。您和她一块呆上十来分钟吧。\\n\\n ②法语：她的举止多么优雅啊！\\n\\n 姑母在一个角落里接待了两个年轻人，但是看起来她想隐瞒她对海伦的宠爱，在安娜·帕夫洛夫娜面前她想更多地流露她的惊恐的神态。她注视着她的侄女，仿佛心里在问，她应当怎样对付这几个人。安娜·帕夫洛夫娜在离开他们的当儿，又用指头摸摸皮埃尔的袖筒，说道：\\n\\n “J\u0027espére，quevousnedirezplusqu\u0027ons\u0027ennuiechezmoi．”①她望了海伦一眼。 \\n\\n ①法语：我希望下次您不要再说，在我这儿觉得寂寞无聊。\\n\\n “这想必是维涅斯所创作的，\u0027皮埃尔说道，同时提到著名的小型彩画家的名字，他向桌前俯下身去，拿起鼻烟壶，继续倾听另外一张桌上的闲谈。\\n\\n 他欠一欠身，想绕过去，可是姑母正从海伦背后把烟壶递过来了。海伦向前弯下腰去让开一下，面露微笑回头看看。她和平素在晚会上那样，穿着一件时髦的袒胸露背的连衣裙，皮埃尔向来认为她的胸部像大理石那样又白又光滑，它现在离他的眼睛很近，所以他情不自禁地用他那对近视眼看清她那十分迷人的肩膀和颈项，并且离她的嘴唇很近，他只要略微弯下腰来，就会碰到他了。他闻到她的身躯的热气、香水味，听到她上身动弹时束腰发出窸窣的响声。他所看见的不是和她那件连衣裙合成一体的大理石般的俊美，他所看见的和所体察到的是她那仅仅散以衣腋的身体的迷人的姿色，他既然看见这一层，就不能去看别的了，就像骗局已被查明，我们不能再上当了。\\n\\n “您到现在还没发现我长得多么漂亮吗？”海伦好像在说话。“您没发现我是一个女人吗？是的，我是一个女人，可以属于任何人，也可以属于您，”她的目光这样说。也就在这一瞬间，皮埃尔心中觉得，海伦不仅能够，而且应当成为他的妻子，并没有别的可能性。\\n\\n 在这个时候，他很确切地知道这一点，就像他和她正在教堂里举行婚礼似的。这件事应如何办理？何时办理？他不知道，他甚至不知道，这件事是否可取（他甚至感到，这件事不知怎的是不可取的），但是他知道，这件事是要办理的。\\n\\n 皮埃尔垂下眼睛，又抬起眼睛，心里重新想把她看作是一个相距遥远的，使他觉得陌生的美女，正如以前他每天看见的她那样，但是他现在已经不能这样办了。就像某人从前在雾霭中观看野蒿中的一株草，把它看作是一棵树，当他看清这株草以后，再也不能把它看作一棵树了。她和他太接近了。她已经在主宰着他。除开他自己的意志力的障碍而外，他和她之间已经没有任何障碍了。\\n\\n “Bon，jevouslaissedansvotrepetitcoin．Jevois，quevousyêtestrèsbien．”①可以听见安娜·帕夫洛夫娜的话语声。 \\n\\n ①法语：好的，我就把你们留在你们的角落里。我看见，你们在那里觉得蛮好。\\n\\n 俄而，他走到那个大组的客人跟前时，安娜·帕夫洛夫娜对他说道：\\n\\n “OnditquevousembellissezvotremaisondePétersbourg．”①\\n\\n （这是实话：建筑师说，他正要办这件事，就连皮埃尔本人也不知道为什么他要装修他在彼得堡的一栋高大的住宅。）\\n\\n “cestbien，maisnedéménagezpasdechezleprinceBasile．Ilestbond\u0027avoirunamicommeleprince，”她面露笑容对瓦西里公爵说。“J\u0027ensaisquelquechoseN\u0027est－cepas？②可是您这么年轻。您所需要的是忠告。您不要生我的气，说我滥用了老太婆的权利。”她默不作声，就像妇女们平素在谈到自己的年纪之后，想等待什么似的，都不愿开口。\\n\\n “如果您结婚，那是另一回事。”她于是把他们的视线连接起来。皮埃尔不看海伦，她也不看他。可是她和他的距离还是很近。他发出哞哞声，满面通红。 \\n\\n ①法语：据说，您在装修您的彼得堡的住宅。\\n\\n ②法语：这很好。可是您不要从瓦西里公爵家中迁走。有这样一个朋友是件好事。这件事我略知一二。您说说看，是不是？\\n\\n “可是她很傻，我自己也说过她很傻，”他心中想道，“她使我产生的一种情感中含有某种鄙劣的应被取缔的东西。有人对我说，她的哥哥阿纳托利钟情于她，她也钟情于他，他们之间有一整段恋爱史，正因为这件事阿纳托利才被逐出家门，伊波利特是她的哥哥……瓦西里公爵是她的父亲……真糟糕……”他想，正当他这样发表议论的时候（这些议论还没有结束），他发觉自己面露微笑，并且意识到，从前面的一系列议论中正在浮现出另一系列议论，他同时想到她的渺小，幻想着她将成为他的妻子，她会爱他，她会变成一个截然不同的女人，他所想到和听到的有关她的情形可能是一派谎言。他又不把她视为瓦西里公爵的女儿，而他所看见的只是她那蔽以灰色连衣裙的躯体。“不对，为什么我脑海中从前没有这种想法呢？”他又对他自己说，这是不可能的事，他仿佛觉得，在这门婚事中含有一种鄙劣的、违反自然的、不正直的东西。他回想起她从前所说的话、所持的观点，他们两人在一起时那些看见他们的人所说的话、所持的观点。他回想起安娜·帕夫洛夫娜对他谈到住宅时所说的话、所持的观点，回想起瓦西里公爵和其他人所作的千万次的这类的暗示，他感到恐怖万分，他是否凭藉什么把自己捆绑起来，去做一件显然是卑劣的、他理应不做的事。但是在他向自己表白这一决心时，从她的灵魂的另一面正浮现出她的整个女性美的形象。\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/53/3345.html","bookId":585,"book":{"id":585,"title":"War And Peace战争与和平","description":"简介： War and Peace , a Russian novel by Leo Tolstoy, is considered one of the most celebrated works of fiction.It is regarded, along with Anna Karenina (1873–1877), as Tolstoy\u0027s finest literary achievement.Epic in scale, War and Peace deline...","cover":"http://novel.tingroom.com/uploads/allimg/101230/12858150784da3b.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/53","creation":"Aug 1, 2019 12:18:59 AM","modification":"Aug 1, 2019 12:18:59 AM"}}
