{"id":41047,"no":72,"title":"Book 4 Chapter 7","content":"TWO MONTHS had passed since the news of the defeat of Austerlitz and the loss of Prince Andrey had reached Bleak Hills. In spite of all researches and letters through the Russian embassy, his body had not been found, nor was he among the prisoners. What made it worst of all for his father and sister was the fact that there was still hope that he might have been picked up on the battlefield by the people of the country, and might perhaps be lying, recovering, or dying somewhere alone, among strangers, incapable of giving any account of himself. The newspapers, from which the old prince had first heard of the defeat at Austerlitz, had, as always, given very brief and vague accounts of how the Russians had been obliged after brilliant victories to retreat and had made their withdrawal in perfect order. The old prince saw from this official account that our army had been defeated. A week after the newspaper that had brought news of the defeat of Austerlitz, came a letter from Kutuzov, who described to the old prince the part taken in it by his son.\n “Before my eyes,” wrote Kutuzov, “your son with the flag in his hands, at the head of a regiment, fell like a hero, worthy of his father and his fatherland. To my regret and the general regret of the whole army it has not been ascertained up to now whether he is alive or dead. I comfort myself and you with the hope that your son is living, as, otherwise, he would have been mentioned among the officers found on the field of battle, a list of whom has been given me under flag of truce.”\n After receiving this letter, late in the evening when he was alone in his study, the old prince went for this morning walk as usual next day. But he was silent with the bailiff, the gardener, and the architect, and though he looked wrathful, said nothing to them. When Princess Marya went in to him at the usual hour, he was standing at the lathe and went on turning as usual, without looking round at her. “Ah? Princess Marya!” he said suddenly in an unnatural voice, and he let the lathe go. (The wheel swung round from the impetus. Long after, Princess Marya remembered the dying creak of the wheel, which was associated for her with what followed.)\n Princess Marya went up to him; she caught sight of his face, and something seemed suddenly to give way within her. Her eyes could not see clearly. From her father\u0027s face—not sad nor crushed, but vindictive and full of unnatural conflict—she saw that there was hanging over her, coming to crush her, a terrible calamity, the worst in life, a calamity she had not known till then, a calamity irrevocable, irremediable, the death of one beloved.\n “Father! Andrey? …” said the ungainly, awkward princess with such unutterable beauty of sorrow and self-forgetfulness that her father could not bear to meet her eyes and turned away sobbing.\n “I have had news. Not among the prisoners, not among the killed, Kutuzov writes,” he screamed shrilly, as though he would drive his daughter away with that shriek. “Killed!”\n The princess did not swoon, she did not fall into a faint. She was pale, but when she heard those words her face was transformed, and there was a radiance of something in her beautiful, luminous eyes. Something like joy, an exalted joy, apart from the sorrows and joys of this world, flooded the bitter grief she felt within her. She forgot all her terror of her father, went up to him, took him by the hand, drew him to her, and put her arm about his withered, sinewy neck.\n “Father,” she said, “do not turn away from me, let us weep for him together.”\n “Blackguards, scoundrels!” screamed the old man, turning his face away from her. “Destroying the army, destroying men! What for? Go, go and tell Liza.”\n Princess Marya sank helplessly into an armchair beside her father and burst into tears. She could see her brother now at the moment when he parted from her and from Liza with his tender and at the same time haughty expression. She saw him at the moment when tenderly and ironically he had put the image on. “Did he believe now? Had he repented of his unbelief? Was he there now? There in the realm of eternal peace and blessedness?” she wondered. “Father, tell me how it was,” she asked through her tears.\n “Go away, go,—killed in a defeat into which they led the best men of Russia and the glory of Russia to ruin. Go away, Princess Marya. Go and tell Liza. I will come.” When Princess Marya went back from her father, the little princess was sitting at her work, and she looked up with that special inward look of happy calm that is peculiar to women with child. It was clear that her eyes were not seeing Princess Marya, but looking deep within herself, at some happy mystery that was being accomplished within her.\n “Marie,” she said, moving away from the embroidery frame and leaning back, “give me your hand.” She took her sister-in-law\u0027s hand and laid it below her waist. Her eyes smiled, expectant, her little dewy lip was lifted and stayed so in childlike rapture. Princess Marya knelt down before her, and hid her face in the folds of her sister-in-law\u0027s dress. “There—there—do you feel it? I feel so strange. And do you know, Marie, I am going to love him very much,” said Liza, looking at her sister-in-law with shining, happy eyes. Princess Marya could not lift her head; she was crying.\n “What\u0027s the matter with you, Marie?”\n “Nothing … only I felt sad … sad about Andrey,” she said, brushing away the tears on the folds of her sister-in-law\u0027s dress. Several times in the course of the morning Princess Marya began trying to prepare her sister-in-law\u0027s mind, and every time she began to weep. These tears, which the little princess could not account for, agitated her, little as she was observant in general. She said nothing, but looked about her uneasily, as though seeking for something. Before dinner the old prince, of whom she was always afraid, came into her room, with a particularly restless and malignant expression, and went out without uttering a word. She looked at Princess Marya with that expression of attention concentrated within herself that is only seen in women with child, and suddenly she burst into tears.\n “Have you heard news from Andrey?” she said.\n “No; you know news could not come yet; but father is uneasy, and I feel frightened.”\n “Then you have heard nothing?”\n “Nothing,” said Princess Marya, looking resolutely at her with her luminous eyes. She had made up her mind not to tell her, and had persuaded her father to conceal the dreadful news from her till her confinement, which was expected before many days. Princess Marya and the old prince, in their different ways, bore and hid their grief. The old prince refused to hope; he made up his mind that Prince Andrey had been killed, and though he sent a clerk to Austria to seek for traces of his son, he ordered a monument for him in Moscow and intended to put it up in his garden, and he told every one that his son was dead. He tried to keep up his old manner of life unchanged, but his strength was failing him: he walked less, ate less, slept less, and every day he grew weaker. Princess Marya went on hoping. She prayed for her brother, as living, and every moment she expected news of his return.\n “我亲眼看见令郎，”库图佐夫写道，“手中擎着一面军旗在兵团前面倒下了，他不愧为他父亲和祖国的英雄。令我和全军感到遗憾的是，直至现在依旧不知道，他是活着，还是牺牲了，否则，在由军使递交给我的战地伤亡军官名单中，必定会列入他的姓名。”\n 夜晚老公爵接到了这个消息，是时他独自一人呆在书斋里。第二天清晨，他一如平时又外出散步，而他在管事、园丁和建筑师当中默不作声，虽然他怒形于色，但他未对任何人道出一句话来。\n 在平时规定的时刻，叫做玛丽亚的公爵小姐走进屋里来看他，他正在车床旁边站着，做镟工活儿，他像平常一样没有掉过头来望望她。\n “啊！公爵小姐玛丽亚！”他突然不自然地说道，扔下了凿子。车床的轮子由于冲力的关系仍在转动着，公爵小姐玛丽亚长久地记得逐渐停息的轮子的吱吱声，和接踵而至的事情在她心目中融合起来了。\n 公爵小姐玛丽亚移动脚步，走到他跟前，一望见他的脸色，她身上便像有件什么东西忽然沉下去了。她的两眼看不清楚了。父亲的面色既不忧愁，也不沮丧，而是凶神恶煞，很不自然，她从父亲的面色看出，一种可怕的不幸，她从未经历的生活中的莫大的不幸，无可挽救的毋容思议的不幸威胁着她，使她精神上感到压抑，而这种不幸指的是亲人的寿终正寝。\n “Mon　père！①是安德烈吗？”姿色不美丽、笨手笨脚的公爵小姐说，她那无法用言语形容的悲痛的魅力和难以控制自己的神情，使父亲经受不住她的目光，哽咽了一阵，转过身去。 \n ①法语：爸爸。\n 公爵小姐并没有倒下去，她没有感到头晕。她的脸色显得惨白，但是她听了这几句话后，她的面容全变了，她那美丽迷人的明眸中闪烁着光辉。仿佛有一种欢乐，一种不以这个世界的悲欢为转移的莫大的欢乐，透过她那极度悲痛的心情浮现出来。她对父亲的畏惧已经忘记得一干二净，她走到他跟前，一把抓住他的手，拉到自己身边来，抱住他那干瘦的青筋赤露的脖子。\n “Mon　pére，”她说道，“不要离开我吧，让我俩在一块儿痛哭吧。”\n “这些坏蛋，卑鄙的家伙！”老头儿喊道，把脸移开，躲避她。“葬送了军队，葬送了人们！为了什么？你去，你去，去告诉丽莎。”\n 公爵小姐软弱无力地坐到父亲旁边的安乐椅上嚎啕大哭起来。现在她好像看见哥哥带着他那温和而傲慢的神态跟她和丽莎告别。她好像看见他温和地、讥讽地给自己戴上小神像。“他是否信教呢？他是否对他不信教而感到后悔呢？他现在是否在那里？是否在那永恒的静谧与极乐的天宫？”她想道。\n “Mon　pére，请您把这件事的经过告诉我吧。”她眼泪汪汪地问道。\n “你去吧，你去吧，他在战斗中给打死了，在那场战斗中打死了许多优秀的俄国人，玷污了俄国的荣誉。公爵小姐玛丽亚，您去吧。去告诉丽莎。我马上就来。”\n 当公爵小姐从父亲那里回来的时候，矮小的公爵夫人正坐着做针线活儿，她用那只有孕妇们才特具的内心平静与幸福的眼神望了望公爵小姐玛丽亚。很明显，她的眼睛没有望见公爵小姐玛丽亚，而是向自己体内望去，向她腹内的幸福而神秘的东西望去。\n “玛丽（玛丽亚的法语称谓），”她说道，从绣花架子移开身子，向后靠着，“把你的手向我伸出来。”她一把抓住公爵小姐的手，把它放在自己的肚子上。\n 她的一对眼睛微露笑意，等待着她那长满茸毛的嘴唇翘起来，像那幸运的儿童不停地翘着嘴唇似的。\n 公爵小姐玛丽亚跪在她面前，把脸蛋藏在嫂嫂的连衣裙的皱襞里。\n “诺，诺，你听见吗？我觉得非常奇怪。玛丽，你要晓得，我是很爱他的，”丽莎说，她用那闪闪发光的幸福的眼睛望着小姑子。公爵小姐玛丽亚没法抬起头来，她哭泣着。\n “玛莎，你怎么？”\n “没有什么……我很悲伤……为安德烈而悲伤。”她说道，一面在嫂嫂的膝头上揩干眼泪。公爵小姐玛丽亚在整个早上接连好几次叫她嫂嫂在思想上要做好准备，而每一次她都哭泣起来，无论矮小的公爵夫人怎样缺乏敏锐的观察力，没法明白她哭泣的原因，但是她的泪水仍旧使她惊恐不已。她不发一言，但却心慌意乱地环顾四周，正在寻找着什么东西。她一向害怕的老公爵在午饭前走进她房里来了，现在他的脸色显得很凶恶，他的心情异常不安定，没有说出一句话便走出去了。她望望公爵小姐玛丽亚，然后就带着孕妇们常有的、凝视自己体内的眼神陷入沉思，她大哭起来。\n “从安德烈那儿得到什么消息吗？”她说。\n “没有，你知道还不会传来什么消息，不过爸爸的心情很不安定，我也就害怕起来。”\n “这么说，没有什么事吗？”\n “没有什么，”公爵小姐玛丽亚说，她把那亮晶晶的眼睛盯着她嫂嫂。嫂嫂在最近几天内要分娩，她决意不向她说什么，并劝父亲在她分娩前也向她隐瞒有关他接到可怕的消息这种事。公爵小姐玛丽亚和老公爵各自忍受和隐瞒自己的悲痛。老公爵不想抱有任何希望，他断言安德烈公爵已被打死了，虽然他派遣一名官吏去奥地利寻找儿子的行踪，但是他仍旧在莫斯科给儿子订购了一块墓碑，打算把它树立在自己的花园里，他告诉大家，说他儿子已被打死了。他竭力地不改变从前的生活方式，但是已经力不从心了，他很少步行，吃得更少，睡得也更少，身体一天天衰弱下去。公爵小姐玛丽亚还抱有一线希望。她把哥哥看作活着的人，替他祈祷，每时每刻等待哥哥回家的消息。\n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/53/3370.html","bookId":585,"book":{"id":585,"title":"War And Peace战争与和平","description":"简介： War and Peace , a Russian novel by Leo Tolstoy, is considered one of the most celebrated works of fiction.It is regarded, along with Anna Karenina (1873–1877), as Tolstoy\u0027s finest literary achievement.Epic in scale, War and Peace deline...","cover":"http://novel.tingroom.com/uploads/allimg/101230/12858150784da3b.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/53","creation":"Aug 1, 2019 12:18:59 AM","modification":"Aug 1, 2019 12:18:59 AM"}}
