{"id":41060,"no":85,"title":"Book 5 Chapter 4","content":"SHORTLY AFTER THIS, there walked into the dark temple to fetch Pierre not the rhetor, but his sponsor Villarsky, whom he recognised by his voice. In reply to fresh inquiries as to the firmness of his resolve, Pierre answered: “Yes, yes, I agree,” and with a beaming, childlike smile he walked forward, stepping timidly and unevenly with one booted and one slippered foot, while Villarsky held a sword pointed at his fat, uncovered chest. He was led out of the room along corridors, turning backwards and forwards, till at last he was brought to the doors of the lodge. Villarsky coughed; he was answered by masonic taps with hammers; the door opened before them. A bass voice (Pierre\u0027s eyes were again bandaged) put questions to him, who he was, where and when he was born, and so on. Then he was again led away somewhere with his eyes still bandaged, and as he walked they spoke to him in allegories of the toils of his pilgrimage, and of holy love, of the Eternal Creator of the world, of the courage with which he was to endure toils and dangers. During this time Pierre noticed that he was called sometimes the seeker, sometimes the sufferer, and sometimes the postulant, and that they made various tapping sounds with hammers and with swords. While he was being led up to some object, he noticed that there was hesitation and uncertainty among his conductors. He heard a whispered dispute among the people round him, and one of them insisting that he should be made to cross a certain carpet. After this they took his right hand, laid it on something, while they bade him with the left hold a compass to his left breast, while they made him repeat after some one who read the words aloud, the oath of fidelity to the laws of the order. Then the candles were extinguished and spirit was lighted, as Pierre knew from the smell of it, and he was told that he would see the lesser light. The bandage was taken off his eyes, and in the faint light of the burning spirit Pierre saw, as though it were in a dream, several persons who stood facing him in aprons like the rhetor\u0027s, and held swords pointed at his breast. Among them stood a man in a white shirt stained with blood. On seeing this, Pierre moved with his chest forward towards the swords, meaning them to stab him. But the swords were drawn back, and the bandage was at once replaced on his eyes. “Now you have seen the lesser light,” said a voice. Then again they lighted the candles, told him that he had now to see the full light, and again removed the bandage, and more than ten voices said all at once: “Sic transit gloria mundi.” Pierre gradually began to regain his self-possession, and to look about at the room and the people in it. Round a long table covered with black were sitting some dozen men, all in the same strange garment that he had seen before. Several of them Pierre knew in Petersburg society. In the president\u0027s chair sat a young man, with a peculiar cross on his neck, whom he did not know. On his right hand sat the Italian abbé whom Pierre had seen two years before at Anna Pavlovna\u0027s. There were among them a dignitary of very high standing and a Swiss tutor, who had once been in the Kuragin family. All preserved a solemn silence, listening to the president, who held a hammer in his hand. In the wall was carved a blazing star; on one side of the table was a small rug with various figures worked upon it; on the other was something like an altar with the gospel and a skull on it. Round the table stood seven big ecclesiastical-looking candlesticks. Two of the brothers led Pierre up to the altar, set his feet at right angles and bade him lie down, saying that he would be casting himself down at the gates of the temple. “He ought first to receive the spade,” said one of the brothers in a whisper. “Oh! hush, please,” said another. Pierre did not obey, but with uneasy short-sighted eyes looked about him, and suddenly doubt came over him. “Where am I? What am I doing? Aren\u0027t they laughing at me? Shan\u0027t I be ashamed to remember this?” But this doubt only lasted a moment. Pierre looked round at the serious faces of the people round him, thought of all he had just been through, and felt that there was no stopping half-way. He was terrified at his own hesitation, and trying to arouse in himself his former devotional feeling, he cast himself down at the gates of the temple. And the devotional feeling did in fact come more strongly than ever upon him. When he had lain there some time, he was told to get up, and a white leather apron such as the others wore was put round him, and a spade and three pairs of gloves were put in his hands; then the grand master addressed him. He told him that he must try never to stain the whiteness of that apron, which symbolised strength and purity. Then of the unexplained spade he told him to toil with it at clearing his heart from vice, and with forbearing patience smoothing the way in the heart of his neighbour. Then of the first pair of gloves he said that he could not know yet their significance, but must treasure them; of the second pair he said that he must put them on at meetings; and finally of the third pair—they were women\u0027s gloves—he said: “Dear brother, and these woman\u0027s gloves are destined for you too. Give them to the woman whom you shall honour beyond all others. That gift will be a pledge of your purity of heart to her whom you select as a worthy helpmeet in masonry.” After a brief pause, he added: “But beware, dear brother, that these gloves never deck hands that are impure.” While the grand master uttered the last words it seemed to Pierre that he was embarrassed. Pierre was even more embarrassed; he blushed to the point of tears, as children blush, looking about him uneasily, and an awkward silence followed. This silence was broken by one of the brothers who, leading Pierre to the rug, began reading out of a manuscript book the interpretation of all the figures delineated upon it: the sun, the moon, the hammer, the balance, the spade, the rough stone and the shaped stone, the past, the three windows, etc. Then Pierre was shown his appointed place, he was shown the signs of the lodge, told the password, and at last permitted to sit down. The grand master began reading the exhortation. The exhortation was very long, and Pierre in his joy, his emotion, and his embarrassment was hardly in a condition to understand what was read. He only grasped the last words of the exhortation, which stuck in his memory. “In our temples we know of no distinctions,” read the grand master, “but those between virtue and vice. Beware of making any difference that may transgress against equality. Fly to the succour of a brother whoever he may be, exhort him that goeth astray, lift up him that falleth, and cherish not malice nor hatred against a brother. Be thou friendly and courteous. Kindle in all hearts the fire of virtue. Share thy happiness with thy neighbour, and never will envy trouble that pure bliss. Forgive thy enemy, revenge not thyself on him but by doing him good. Fulfilling in this wise the highest law, thou wilt regain traces of the ancient grandeur thou hadst lost,” he concluded, and getting up he embraced Pierre and kissed him. Pierre looked round with tears of joy in his eyes, not knowing how to answer the congratulations and greetings from acquaintances with which he was surrounded. He did not recognise any acquaintances; in all these men he saw only brothers, and he burned with impatience to get to work with them. The grand master tapped with his hammer, all sat down in their places, and one began reading a sermon on the necessity of meekness. The grand master proposed that the last duty be performed, and the great dignitary whose duty it was to collect the alms began making the round of all the brothers. Pierre would have liked to give to the list of alms all the money he had in the world, but he feared thereby to sin by pride, and only wrote down the same sum as the others. The sitting was over, and it seemed to Pierre on returning home that he had come back from a long journey on which he had spent dozens of years, and had become utterly changed, and had renounced his old habits and manner of life. “是的，是的，我同意，”他像儿童似的笑容可掬，露出肥胖的胸脯，一只脚穿着皮靴，另一只脚没有穿，他迈着不平稳的、畏葸的步子，挨近维拉尔斯基对准他那裸露的胸前伸出的长剑走去。有人把他从房里领出来，在走廊上转来转去，最后把他领到分会的门口。维拉尔斯基咳嗽了一声，有人用共济会特制的槌子咚咚地敲打几下，作为对他的回答，他们前面的那扇门敞开了。有个具有男低音嗓子的人（皮埃尔的眼睛仍旧被蒙着）向他提出几个问题：他是什么人、在何处定居、在何时出生等等。后来又把他领到什么地方，没有给他解开蒙住眼睛的手绢，在他行走的时候，有人对他说几句含有寓意的话：巡礼中的艰苦、神圣的友谊、亘古永存的创世主，勇敢（他应该勇敢地忍受艰苦和危险）。这次巡礼时，皮埃尔发现，有人时而称他为·求·道·者，时而称他为·受·难·者，时而称他为·请·愿·者，称呼他时，有人用槌子和长剑敲出各种不同的响声。当人家把他领到一件东西前面时，他发觉引导人之间发生慌乱。他听见周围的人低声地争论起来，有一人固执己见，硬要领着他从地毯上走过去。之后他们握住他的右手，把它放在一件什么东西上面，叫他用左手把一只圆规紧紧地贴在左胸上，吩咐他重复地说出别人念的忠于共济会法规的誓言。然后吹熄了几根蜡烛，点燃了酒精（皮埃尔闻到了气味），他们并且说，他将能看见一小束光线。他们取下了蒙住他眼睛的手绢，皮埃尔犹如在梦中一样，在那微弱的酒精火焰的光线照耀下，看见几个人，他们就像修辞班教师那样，都穿着围裙，站在他对面，手里拿着几柄对准他的胸膛的长剑。有一人穿着一件血迹斑斑的白衬衫，站在他们之间。皮埃尔见状，挺起胸膛，移动脚步，迎着几柄长剑走去，想让那长剑刺入他的胸膛。但是那把长剑避开他了，有人又立即给他蒙上眼睛。 “现在你看见了一小束光线，”可以听见某人对他说。然后他们又点燃蜡烛，并且对他说，要他看见充足的光线，他们又给他拿下蒙住眼睛的手绢，并有十多个人忽然齐声地说： “sic　transit　gloria　mandi。”① ①拉丁语：尘世的光荣就这样渐渐消逝。 “他先得领到一把铲子。”有个师兄轻言细语地说。 “啊！够了，别再说了。”另一个说。 皮埃尔没有听从，他用心慌意乱的近视眼睛环顾四周，心里忽然感到怀疑：“我在哪儿？我在做什么？他们是不是嘲笑我呢？我想起这一点会不觉得可耻吗？”可是这种疑惑只持续了片刻。皮埃尔环顾了他周围的人们的严肃的面孔，回想起他经历的一切，他心里明白，不能半途而废。他想到自己多疑，大吃一惊，极欲使他自己产生从前的怜悯心，于是乎拜倒在神殿门前。他脑海中确乎产生了那种较诸从前更为强烈的怜悯心。他仰卧不多时，就有人吩咐他站起身来，给他围上一条别人那样的白皮围裙，将一把铲子和三双手套送到他手上，这时候共济会分会会长才对他讲话。他对他说，要他尽力设法不让任何东西沾污这条表示坚贞和纯洁的围裙的白色，然后对他讲到这把用途不明的铲子，叫他付出劳动，用它来净化自己的内心，剔除种种恶习，用以宽厚地抚慰他人的内心。然后他讲到第一双男式手套，说他不知道它的意义何在，但是皮埃尔应当保存它，至于另一双男式手套，他说他应当戴上这双手套参加会议，末了他就第三双女式手套说明如下： “亲爱的师弟，这双女式手套是送给您的。请您转送给您最尊重的女人。您将来给您自己选择一位贤淑的共济会员太太，您通过这件礼物使她相信您的内心的纯洁。”他沉默片刻，补充说，“但是亲爱的师弟，要遵守一条规定，不能让这双手套去美化不干净的手。”当分会会长说出最后这几句话的时候，皮埃尔仿佛觉得，主席困惑不安。皮埃尔更不好意思，他像孩子似的脸红得连眼泪都夺眶而出，他开始不安地环顾四周，出现了令人困窘的沉寂。 有个师兄打破了这一阵沉默，他把皮埃尔领到地毯前面，开始从笔记本中给他念出地毯上绘制的图形（日、月、槌子、铅锤、铲子、立方形奇石、柱子、三扇窗子等）的说明文字。之后他们给他指定一个座位，把分会证章拿给他看，告诉他入门的暗语，最后允许他坐下。分会会长开始宣读分会章程。章程很长，皮埃尔由于欢喜、激动和羞愧，不能听懂所念的内容，他只谛听了章程的最后几句，并且铭记于心。 “我们的神殿里，”分会会长宣读，“除开位于美德和恶德之间的等级而外，我们不承认任何其他等级。当心不要造成损害平等的某种差别。务须飞奔去帮助师兄师弟，不论他是什么人，必须训导误入迷途的人，扶起跌倒的人，永远不应怀恨或敌视师兄师弟。人人要和蔼可亲。在人人心中点燃起美德的火焰。并与他人分享幸福，永远不让妒嫉扰乱这种纯洁的乐事。” “请宽恕你的敌人，不要复仇，你只有对他行善，以这种方式执行至高无上的教规，你就能遍寻你所失去的古代庄严和雄伟的遗迹。”他说完这些话后，欠了欠身，拥抱皮埃尔，吻吻他。 皮埃尔的眼睛里含着喜悦的泪水，环顾四周，不知道怎样回答他周围的人们的祝贺，不知道怎样回答从新结识之后有何印象。他不去承认任何相识，只把一切人看作师兄师弟，并且急不可待地要和他们一道着手工作。 分会会长敲了一下槌子，大家都各自入座，其中一人宣读有关谦逊的必要性的训词。 分会会长建议大家履行最后的义务，那个号称为布施募集人的显要官吏从师兄师弟身边绕了一圈。皮埃尔很想把他拥有的全部钱财写在布施名册上，但是他怕这样做会显得个人高傲，他于是写了和别人同样多的捐款。 会议结束了，皮埃尔回家后仿佛觉得他从一次远途旅行归来，仿佛在途中过了几十年，他完全变了，落后于从前的生活秩序和习惯。","sourceLink":"http://novel.tingroom.com/jingdian/53/3383.html","bookId":585,"book":{"id":585,"title":"War And Peace战争与和平","description":"简介： War and Peace , a Russian novel by Leo Tolstoy, is considered one of the most celebrated works of fiction.It is regarded, along with Anna Karenina (1873–1877), as Tolstoy\u0027s finest literary achievement.Epic in scale, War and Peace deline...","cover":"http://novel.tingroom.com/uploads/allimg/101230/12858150784da3b.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/53","creation":"Aug 1, 2019 12:18:59 AM","modification":"Aug 1, 2019 12:18:59 AM"}}
