{"id":41063,"no":88,"title":"Book 5 Chapter 7","content":"WHEN BORIS AND ANNA PAVLOVNA returned to the rest, Prince Ippolit was in possession of the ear of the company. Bending forward in his low chair, he was saying:\\n\\n “The King of Prussia!” and as he said it, he laughed. Every one turned towards him. “The King of Prussia,” Ippolit said interrogatively, and again he laughed and again settled himself placidly and seriously in the depths of his big, low chair. Anna Pavlovna paused a little for him, but as Ippolit seemed quite certainly not intending to say more, she began to speak of how the godless Bonaparte had at Potsdam carried off the sword of Frederick the Great.\\n\\n “It is the sword of Frederick the Great, which I …” she was beginning, but Ippolit interrupted her with the words:\\n\\n “The King of Prussia …” and again as soon as all turned to listen to him, he excused himself and said no more. Anna Pavlovna frowned. Mortemart, Ippolit\u0027s friend, addressed him with decision:\\n\\n “Come, what are you after with your King of Prussia?”\\n\\n Ippolit laughed as though he were ashamed of his own laughter.\\n\\n “No, it\u0027s nothing. I only meant …” (He had intended to repeat a joke that he had heard in Vienna and had been trying all the evening to get in.) “I only meant that we are wrong to make war for the King of Prussia.”\\n\\n Boris smiled circumspectly, a smile that might do duty either for a sneer or a tribute to the jest, according to the way it was received. Every one laughed.\\n\\n “It is too bad, your joke, very witty but unjust,” said Anna Pavlovna, shaking her little wrinkled finger at him. “We are not making war for the sake of the King of Prussia, but for the sake of right principles. Ah, le méchant, ce Prince Hippolyte!” she said.\\n\\n The conversation did not flag all the evening, and turned principally upon the political news. Towards the end of the evening it became particularly eager, when the rewards bestowed by the Tsar were the subjects of discussion.\\n\\n “Why, last year N.N. received the snuff-box with the portrait,” said the man of profound intellect. “Why shouldn\u0027t S. S. receive the same reward?”\\n\\n “I beg your pardon, a snuff-box with the Emperor\u0027s portrait is a reward, but not a distinction,” said a diplomatist. “A present, rather.”\\n\\n “There are precedents. I would instance Schwartzenberg.”\\n\\n “It is impossible,” retorted another.\\n\\n “A bet on it. The ribbon of the order is different.”\\n\\n When every one got up to take leave, Ellen, who had said very little all the evening, turned to Boris again with a request, and a caressing, impressive command that he would come to her on Tuesday.\\n\\n “It is of great importance to me,” she said with a smile, looking round at Anna Pavlovna, and Anna Pavlovna, with the same mournful smile with which she accompanied any reference to her royal patroness, gave her support to Ellen\u0027s wishes. It appeared that from some words Boris had uttered that evening about the Prussian army Ellen had suddenly discovered the absolute necessity of seeing him. She seemed to promise him that when he came on Tuesday she would disclose to him that necessity. When Boris entered Ellen\u0027s magnificent reception-room on Tuesday evening he received no clear explanation of the urgent reasons for his visit. Other guests were present, the countess talked little to him, and only as he kissed her hand at taking leave, with a strangely unsmiling face, she whispered to him unexpectedly:\\n\\n “Come to dinner to-morrow … in the evening … you must come … come.”\\n\\n During that stay in Petersburg Boris was constantly at the house of the Countess Bezuhov on a footing of the closest intimacy.\\n\\n “Le　Roi　de　Prusse！”①他说完这句话，笑起来了。大家都向他转过身去：“Le　Roi　de　Prusse？”伊波利特问道，又笑了起来，又心平气和地、严肃地坐在自己的安乐椅中。安娜·帕夫洛夫娜等了一气儿，但因伊波利特好像坚决不想再说下去，所以她就打开话匣子，说不信神的波拿巴在波茨坦偷走了腓特烈大帝的宝剑。\\n\\n “C\u0027est　l\u0027épée　de　Frèdéric　le　Grand，que　je…”②她正要开始说，可是伊波利特打断她的话。\\n\\n “Le　Roi　de　Prusse……”大家刚一向他转过身来，他又道歉了，有半晌没有开口。安娜·帕夫洛夫娜皱了皱眉头。\\n\\n 伊波利特的朋友莫特马尔把脸转向他，坚决地说。\\n\\n “Voyons　à　qui　en　avez－vous　avec　votre　Roi　de　Prusse？”③ \\n\\n ①法语：普鲁士国王。\\n\\n ②法语：这是腓特烈大帝的宝剑，我把它……\\n\\n ③法语：普鲁士国王那又能怎样呢？\\n\\n “Non，ce　n\u0027est　rien，je　voulais　dire　seulement…①（他想把他在维也纳听到的笑话重说一遍，他整个晚上都想把它说出来。）Je　voulais　dire　seulement，que　nous　avons　tort　de　faie　la　guerre　pour　le　roi　de　Prusse．②”\\n\\n 鲍里斯谨慎地微微一笑，他的微笑可能被看成是对笑话的讥笑或者是赞赏，这要看大家怎样对待它了。个个都放声大笑。\\n\\n “Il　est　très　mauvais　votre　jeu　de　mot，trés　spirituel，mais　injuste，”安娜·帕夫洛夫娜用布满皱纹的指头威胁他说，“Nous　ne　faisons　pas　la　guerre　pour　le　roi　de　Prusse，mais　pour　les　bon　principes．Ah，le　méchant，ce　prince，Hippolyte！”③她说。\\n\\n 整个夜晚谈话没有停止，话题主要是以政治新闻为轴心。在晚会快要结束时，谈话涉及到国王的赏赐，它因而显得分外热烈：\\n\\n “要知道‘NN\u0027去年获得一个嵌有肖像的鼻烟壶，”l\u0027hom　me　a　l\u0027ésprit　profond④说，“为什么‘SS\u0027不能获得同样的奖品呢？” \\n\\n ①法语：没有什么，不过我想说……\\n\\n ②法语：不过我想说，我们替普鲁士国王打仗是无济于事的。\\n\\n ③法语：您的双关语很不优美，太俏皮，可是不真实。我们为美好的原则，而不是为普鲁士国王而战。哦，这个伊波利特公爵多么恶毒啊！\\n\\n ④法语：才智卓越的人。\\n\\n “Il　y　eu　plutot　des　antécédents，je　vous　citAerai　Schw　arzenberg．”②\\n\\n “C\u0027est　impossible．”③另一人反驳。\\n\\n “打个赌。Le　grand　cordon，c\u0027est　différent…”④ \\n\\n ①法语：对不起，镶嵌有皇帝肖像的鼻烟壶是赏赐，而不是奖章，毋宁说它是赠品。\\n\\n ②法语：有这种范例，施瓦岑贝格曾经获得赏赐。\\n\\n ③法语：这是不可能的。\\n\\n ④法语：绶带，那是另一码事。\\n\\n “这对我很有必要，”她回头望着安娜·帕夫洛夫娜，含着微笑说，安娜·帕夫洛夫娜也带着她在谈论她的崇高的保护人时常会露出的忧郁的微笑，她肯定地认为海伦怀有这个心愿。这天晚上好像海伦忽然从鲍里斯谈论普鲁士军队时说出的某些话语中发现她有见他的必要。她好像已经答应在礼拜二他来的时候，她要向他说明一下，为什么她有见他的必要。\\n\\n 礼拜二晚上，鲍里斯来到海伦的富丽堂皇的客厅时，海伦并没有明确地向他说明，为什么要他到她这里来。客厅里还有别的几位客人，伯爵夫人很少跟他谈话，只是在他吻着她的手向她告别时，她才显露出一副古怪的样子，面无笑意，她突然低声地对他说：\\n\\n “Venez　demain　diner　le　soir．Il　faut　que　vous　veniez…venez．”① \\n\\n ①法语：明天来出席宴会……晚上，您要来……请您来吧。\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/53/3386.html","bookId":585,"book":{"id":585,"title":"War And Peace战争与和平","description":"简介： War and Peace , a Russian novel by Leo Tolstoy, is considered one of the most celebrated works of fiction.It is regarded, along with Anna Karenina (1873–1877), as Tolstoy\u0027s finest literary achievement.Epic in scale, War and Peace deline...","cover":"http://novel.tingroom.com/uploads/allimg/101230/12858150784da3b.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/53","creation":"Aug 1, 2019 12:18:59 AM","modification":"Aug 1, 2019 12:18:59 AM"}}
