{"id":101261,"no":15,"title":"Page 15","content":"I needed boxes, that was for sure. So I\u0027d also need strapping tape, lots of it, and a Magic Marker, and probably scissors. And finally, I\u0027d need a truck to take whatever I salvaged back to Bon Temps. I could ask Jason to drive down, or I could rent a truck, or I could ask Mr. Cataliades if he knew of a truck I could borrow. If there was a lot of stuff, maybe I would rent a car and a trailer. I\u0027d never done such a thing, but how hard could it be? Since I didn\u0027t have a ride right now, there was no way to obtain the supplies. But I might as well start sorting, since the sooner I finished, the sooner I could get back to work and away from the New Orleans vampires. I was glad, in a corner of my mind, that Bill had come, too. As angry as I sometimes felt with him, he was familiar. After all, he\u0027d been the first vampire I\u0027d ever met, and it still seemed almost miraculous to me how it had happened.\n He\u0027d come into the bar, and I\u0027d been fascinated with the discovery that I couldn\u0027t hear his thoughts. Then later the same evening, I\u0027d rescued him from drainers. I sighed, thinking how good it had been until he\u0027d been recalled by his maker, Lorena, now also definitely dead.\n I shook myself. This wasn\u0027t the time for a trip down memory lane. This was the time for action and decision. I decided to start with the clothes.\n After fifteen minutes, I realized that the clothes were going to be easy. I was going to give most of them away. Not only was my taste radically different from my cousin\u0027s, but her hips and breasts had been smaller and her coloring had been different from mine. Hadley had liked dark, dramatic clothes, and I was altogether a lower-key person. I did sort of wonder about one or two of the black wispy blouses and skirts, but when I tried them on, I looked just like one of the fangbangers who hung around Eric\u0027s bar. Not the image I was going for. I put only a handful of tank tops and a couple of pairs of shorts and sleep pants in the \"keep\" pile.\n I found a large box of garbage bags and used those to pack the clothes away. As I finished with each bag, I set it out on the gallery to keep the apartment clear of clutter.\n It was about noon when I started to work, and the hours passed quickly after I found out how to operate Hadley\u0027s CD player. A lot of the music she had was by artists who\u0027d never been high on my list, no big surprise there - but it was interesting listening. She had a horde of CDs: No Doubt, Nine Inch Nails, Eminem, Usher.\n I\u0027d started on the drawers in the bedroom when it just began turning dark. I paused for a moment to stand on the gallery in the mild evening, and watch the city wake up for the dark hours ahead. New Orleans was a city of the night now. It had always been a place with a brawling and brazen nightlife, but now it was such a center for the undead that its entire character had changed. A lot of the jazz on Bourbon Street was played these days by hands that had last seen sunlight decades before. I could catch a faint spatter of notes on the air, the music of faraway revels. I sat on a chair on the gallery and listened for a while, and I hoped I\u0027d get to see some of the city while I was here. New Orleans is like no other place in America, both before the vampire influx and after it. I sighed and realized I was hungry. Of course, Hadley didn\u0027t have any food in the apartment, and I wasn\u0027t about to start drinking blood. I hated to ask Amelia for anything else. Tonight, whoever came to pick me up to go to the queen\u0027s might be willing to take me to the grocery store. Maybe I should shower and change?\n As I turned to go back into the apartment, I spotted the mildewed towels I\u0027d set out the night before. They smelled much stronger, which surprised me. I would have thought the smell would have diminished by now. Instead, my breath caught in the back of my throat in disgust as I picked up the basket to bring it inside. I intended to wash them. In a corner of the kitchen was one of those washer/dryer sets with the dryer on top. Like a tower of cleanliness.\n I tried to shake out the towels, but they\u0027d dried in a stiff crumpled mass. Exasperated, I jerked at the protruding edge of one towel, and with a little resistance, the clots of stuff binding the folds together gave, and the medium blue terrycloth spread out before my eyes.\n \"Oh, shit\" I said out loud in the silent apartment. \"Oh, no.\"\n The fluid that had dried and clumped on the towels was blood.\n \"Oh, Hadley,\" I said. \"What did you do?\"\n The smell was as awful as the shock. I sat down at the small dining table in the kitchen area. Flakes of dried blood had showered onto the floor and clung to my arms. I couldn\u0027t read the thoughts of a towel, for God\u0027s sake. My condition was of no help to me whatsoever. I needed... a witch. Like the one I\u0027d chastened and sent away. Yep, just like that one.\n But first I needed to check the whole apartment, see if it held any more surprises.\n Oh, yeah. It did.\n The body was in the walk-in closet in the hall.\n There was no odor at all, though the corpse, a young man, had probably been there for the whole time my cousin had been dead. Maybe this young man had been a demon? But he didn\u0027t look anything like Diantha or Gladiola, or Mr. Cataliades, for that matter. If the towels had started to smell, you would think... oh well, maybe I\u0027d just gotten lucky. This was something that I would have to find the answer to, and I suspected it lay downstairs.\n I knocked on Amelia\u0027s door. She answered it immediately, and I saw over her shoulder that her place, though of course laid out exactly like Hadley\u0027s, was full of light colors and energy. She liked yellow, and cream, and coral, and green. Her furniture was modern and heavily cushioned, and the wooden bits were polished to the nth degree. As I\u0027d suspected, Amelia\u0027s place was spotless.\n \"Yes?\" she said, in a subdued kind of way.\n \"Okay,\" I said, as if I were laying down an olive branch. \"I\u0027ve got a problem, and I suspect you do, too.\"\n \"Why do you say that?\" she asked. Her open face was closed now, as if keeping her expression blank would keep me out of her mind.\n \"You put a stasis spell on the apartment, right? To keep everything exactly as it was. Before you warded it against intruders?\"\n \"Yes,\" she said cautiously. \"I told you that.\"\n \"No one\u0027s been in that apartment since the night Hadley died?\"\n \"I can\u0027t give you my word on it, because I suppose a very good witch or wizard could have breached my spell,\" she said. \"But to the best of my knowledge, no one\u0027s been in there.\"\n \"So you don\u0027t know that you sealed a body in there?\"\n I don\u0027t know what I expected in the way of reaction, but Amelia was pretty cool about it. \"Okay,\" she said steadily. She may have gulped. \"Okay. Who is it?\" Her eyelids fluttered up and down a few extra times.\n Maybe she wasn\u0027t quite so cool.\n \"I really don\u0027t know,\" I said carefully. \"You\u0027ll have to come see.\" As we went up the stairs, I said, \"He was killed there, and the mess was cleaned up with towels. They were in the hamper.\" I told her about the condition of the towels.\n \"Holly Cleary tells me you saved her son\u0027s life,\" Amelia said.\n That took me aback. It made me feel awkward, too. \"The police would have found him,\" I said. \"I just accelerated it a little.\"\n \"The doctor told Holly if the little boy hadn\u0027t gotten to the hospital when he did, the bleeding in his brain might not have been stopped in time,\" Amelia said.\n \"That\u0027s good then,\" I said, uncomfortable in the extreme. \"How\u0027s Cody doing?\"\n \"Well,\" the witch said. \"He\u0027s going to be well.\"\n \"In the meantime, we got a problem right here,\" I reminded her.\n \"Okay, let\u0027s see the corpse.\" Amelia worked hard to keep her voice level.\n I kind of liked this witch.\n I led her to the closet. I\u0027d left the door open. She stepped inside. She didn\u0027t make a sound. She came back out with a slightly green tinge to her glowing tan and leaned against the wall.\n \"He\u0027s a Were,\" she said, a moment later. The spell she\u0027d put on the apartment had kept everything fresh, as part of the way it worked. The blood had begun to smell a little before the spell had been cast, and when I\u0027d entered the apartment, the spell had been broken. Now the towels reeked of decay. The body didn\u0027t have an odor yet, which surprised me a little, but I figured it would any minute. Surely the body would decompose rapidly now that it had been released from Amelia\u0027s magic, and she was obviously trying not to point out how well that had worked.\n \"You know him?\"\n \"Yes, I know him,\" she said. \"The supernatural community, even in New Orleans, isn\u0027t that big. It\u0027s Jake Purifoy. He did security for the queen\u0027s wedding.\"\n I had to sit down. I exited the walk-in closet and slid down the wall until I was sitting propped up, facing Amelia. She sat against the opposite wall. I hardly knew where to start asking questions.\n \"That\u0027s would be when she married the King of Arkansas?\" I recalled what Felicia had said, and the wedding photo I\u0027d seen in Al Cumberland\u0027s album. Had that been the queen, under that elaborate headdress? When Quinn had mentioned making the arrangements for a wedding in New Orleans, was this the wedding he\u0027d meant?\n \"The queen, according to Hadley, is bi,\" Amelia told me. \"So yes, she married a guy. Now they have an alliance.\"\n \"They can\u0027t have kids,\" I said. I know, that was obvious, but I wasn\u0027t getting this alliance thing.\n \"No, but unless someone stakes them, they\u0027ll live forever, so passing things on is not a big issue,\" Amelia said. \"It takes months, even years, of negotiations to hammer out the rules for such a wedding. The contract can take just as long. Then they both gotta sign it. That\u0027s a big ceremony, takes place right before the wedding. They don\u0027t actually have to spend their lives together, you know, but they have to visit a couple of times a year. Conjugal-type visit.\"\n Fascinating as this was, it was beside the point right now.\n \"So this guy in the closet, he was part of the security force.\" Had he worked for Quinn? Hadn\u0027t Quinn said that one of his workers had gone missing in New Orleans?\n \"Yeah, I wasn\u0027t asked to the wedding, of course, but I helped Hadley into her dress. He came to pick her up.\"\n \"Jake Purifoy came to pick Hadley up for the wedding.\"\n \"Yep. He was all dressed up that night.\"\n \"And that was the night of the wedding.\"\n \"Yeah, the night before Hadley died.\"\n \"Did you see them leave?\"\n \"No, I just... No. I heard the car pull up. I looked out my living room window and saw Jake coming in. I knew him already, kind of casually. I had a friend who used to date him. I went back to whatever I was doing, watching TV I think, and I heard the car leave after a while.\"\n \"So he may not have left at all.\"\n She stared at me, her eyes wide. \"Could be,\" she said at last, sounding as if her mouth were dry.\n \"Hadley was by herself when he came to pick her up... right?\"\n \"When I came down from her apartment, I left her there alone.\"\n \"All I came to do,\" I said, mainly to my bare feet, \"was clean out my cousin\u0027s apartment. I didn\u0027t much like her anyway. Now I\u0027m stuck with a body. The last time I got rid of a body,\" I told the witch, \"I had a big strong helper, and we wrapped it in a shower curtain.\"\n \"You did?\" Amelia said faintly. She didn\u0027t look too happy to be the recipient of this information.\n \"Yes.\" I nodded. \"We didn\u0027t kill him. We just had to get rid of the body. We thought we\u0027d be blamed for the death, and I\u0027m sure we would have been.\" I stared at my toenail polish some more. It had been a good job when it started out, a nice bright pink, but now I needed to refresh the paint job or remove it. I stopped trying to think about other things and resumed my gloomy contemplation of the body. He was lying in the closet, stretched out on the floor, pushed under the lowest shelf. He\u0027d been covered with a sheet. Jake Purifoy had been a handsome man, I suspected. He\u0027d had dark brown hair, and a muscular build. Lots of body hair. Though he\u0027d been dressed for a formal wedding, and Amelia had said he looked very nice, now he was naked. A minor question: where were his clothes?\n \"We could just call the queen,\" Amelia said. \"After all, the body\u0027s been here, and Hadley either killed him or hid the body. No way could he have died the night she went out with Waldo to the cemetery.\"\n \"Why not?\" I had a sudden, awful thought.\n \"You got a cell phone?\" I asked, rising to my feet as I spoke. Amelia nodded. \"Call the queen\u0027s place. Tell them to send someone over right now.\"\n \"What?\" Her eyes were confused, even as her fingers were punching in numbers.\n Looking into the closet, I could see the fingers of the corpse twitch.\n \"He\u0027s rising,\" I said quietly.\n It only took a second for her to get it. \"This is Amelia Broadway on Chloe Street! Send an older vampire over here right now,\" she yelled into the phone. \"New vamp rising!\" She was on her feet now, and we were running for the door.\n We didn\u0027t make it.\n Jake Purifoy was after us, and he was hungry.\n Since Amelia was behind me (I\u0027d had a head start) he dove to grab her ankle. She shrieked as she went down, and I spun around to help her. I didn\u0027t think at all, because I would have kept on going out the door if I had. The new vamp\u0027s fingers were wrapped around Amelia\u0027s bare ankle like a shackle, and he was pulling her toward him across the smooth laminated-wood floor. She was clawing at the floor with her fingers, trying to find something to stop her progress toward his mouth, which was wide open with the fangs extended full length, oh God! I grabbed her wrists and began pulling. I hadn\u0027t known Jake Purifoy in life, so I didn\u0027t know what he\u0027d been like. And I couldn\u0027t find anything human left in his face, anything I could appeal to. \"Jake!\" I yelled. \"Jake Purifoy! Wake up!\" Of course, that didn\u0027t do a damn bit of good. Jake had changed into something that was not a nightmare but a permanent otherness, and he could not be roused from it: he was it. He was making a kind of gnarr-gnarr-gnarr noise, the hungriest sound I\u0027d ever heard, and then he bit down on the calf of Amelia\u0027s leg, and she screamed.\n It was like a shark had hold of her. If I yanked at her any more, he might take out the bit his teeth had clamped on. He was sucking on the leg wound now, and I kicked him in the head with my heel, cursing my lack of shoes. I put everything I had behind it, and it didn\u0027t faze the new vampire in the least. He made a noise of protest, but continued sucking, and the witch kept shrieking with pain and shock. There was a candlestick on the table behind one of the loveseats, a tall glass candlestick with lots of heft to it. I plucked the candle from it, grasped it with both hands, and brought it down as hard as I could on Jake Purifoy\u0027s head. Blood began to run from his wound, very sluggishly; that\u0027s how vampires bleed. The candlestick came apart with the blow, and I was left with empty hands and a furious vampire. He raised his blood-smeared face to glare at me, and I hope I\u0027m never on the receiving end of another look like that again in my life. His face held the mindless rage of a mad dog.\n But he\u0027d let go of Amelia\u0027s leg, and she began to scramble away. It was obvious she was hurt, and it was kind of a slow scramble, but she made the effort. Tears were streaming down her face and her breathing was all over the place, harsh in the night\u0027s silence. I could hear a siren drawing closer and I hoped it was coming here. It would be too late, though. The vampire launched himself from the floor to knock me down, and I didn\u0027t have time to think about anything.\n He bit down on my arm, and I thought the teeth would penetrate the bone. If I hadn\u0027t thrown up the arm, those teeth would have gripped my neck, and that would have been fatal. The arm might be preferable, but just at this moment the pain was so intense I nearly passed out, and I\u0027d better not do that. Jake Purifoy\u0027s body was heavy on top of mine, and his hands were pressing my free arm to the floor, and his legs were on top of mine. Another hunger was wakening in the new vampire, and I felt its evidence pressing against my thigh. He freed a hand to begin yanking at my pants.\n Oh, no... this was so bad. I would die in the next few minutes, here in New Orleans in my cousin\u0027s apartment, far away from my friends and my family.\n Blood was all over the new vampire\u0027s face and hands.\n Amelia crawled awkwardly across the floor toward us, her leg trailing blood behind her. She should have run, since she couldn\u0027t save me. No more candlesticks. But Amelia had another weapon, and she reached out with a violently shaking hand to touch the vampire. \"Utinam hie sanguis in ignem commutet!\" she yelled.\n The vampire reared back, screaming and clawing at his face, which was suddenly covered by tiny licking blue flames.\n And the police came through the door.\n They were vampires, too.\n For an interesting moment, the police officers thought we had attacked Jake Purifoy. Amelia and I, bleeding and screaming, were shoved up against the wall. But in the meantime, the spell Amelia had cast on the new undead lost its efficacy and he leaped on the nearest uniformed cop, who happened to be a black woman with a proud straight back and a high-bridged nose. The cop whipped out her nightstick and used it with a reckless disregard for the new vamp\u0027s teeth. Her partner, a very short man whose skin was the color of butterscotch, fumbled to open a bottle of TrueBlood that was stuck in his belt like another tool. He bit off the tip, and stuck the rubber cap in Jake Purifoy\u0027s questing mouth. Suddenly, all was silence as the new vamp sucked down the contents of the bottle. The rest of us stood panting and bleeding.\n \"He will be quiet now,\" said the female officer, the cadence of her voice letting me know that she was far more African than American. \"I think we have subdued him.\"\n Amelia and I sank onto the floor, after the male cop gave us a nod to let us know we were off the hook. \"Sorry we got confused about who was the bad guy,\" he said in a voice as warm as melted butter. \"You ladies okay?\" It was a good thing his voice was so reassuring, since his fangs were out. I guess the excitement of the blood and the violence triggered the reaction, but it was kind of disconcerting in a law enforcement officer.\n \"I think not,\" I said. \"Amelia here is bleeding pretty bad, and I guess I am, too.\" The bite didn\u0027t hurt as badly as it was going to. The vamp\u0027s saliva secretes a tiny bit of anesthetic, along with a healing agent. But the healing agent was meant for sealing the pinpricks of fangs, not for actual large tears in human flesh. \"We\u0027re going to need a doctor.\" I\u0027d met a vamp in Mississippi who could heal large wounds, but it was a rare talent.\n \"You both human?\" he asked. The female cop was crooning in a foreign language to the new vampire. I didn\u0027t know if the former werewolf, Jake Purifoy, could speak the language, but he recognized safety when he saw it. The burns on his face healed as we sat there.\n \"Yes,\" I said.\n While we waited for the paramedics to come, Amelia and I leaned against each other wordlessly. Was this the second body I\u0027d found in a closet, or the third? I wondered why I even opened closet doors any more.\n \"We should have known,\" Amelia said wearily. \"When he didn\u0027t smell at all, we should have known.\"\n \"Actually, I figured that out. Since it was only thirty seconds before he woke up, it didn\u0027t do a hell of a lot of good,\" I said. My voice was just as limp as hers.\n Everything got very confusing after that. I kept thinking it would be a good time to faint if I was ever going to, because this was really not a process I wanted to be in on, but I just couldn\u0027t pass out. The paramedics were very nice young men who seemed to think we\u0027d been partying with a vamp and it had gotten out of hand. I guessed neither of them would be calling Amelia or me for a date any time soon.\n \"You don\u0027t want to be messing with no vampires, cherie,\" said the man who was working on me. His name tag read DELAGARDIE. \"They supposed to be so attractive to women, but you wouldn\u0027t believe how many poor girls we\u0027ve had to patch up. And that was the lucky ones,\" Delagardie said grimly. \"What\u0027s your name, young lady?\"\n \"Sookie,\" I said. \"Sookie Stackhouse.\"\n \"Pleased to meet you, Miss Sookie. You and your friend seem like nice girls. You need to hang with better people, live people. This city\u0027s overrun with the dead, now. It was better when everyone here was breathing, I tell you the truth. Now let\u0027s get you to the hospital and get you stitched up. I\u0027d shake your hand if you wasn\u0027t all bloody,\" he said. He gave me a sudden smile, white-toothed and charming. \"I\u0027m giving you good advice for free, pretty lady.\"\n I smiled, but it was the last time I was going to be doing that for a while. The pain was beginning to make itself felt. Very quickly, I became preoccupied with coping.\n Amelia was a real warrior. Her teeth were gritted as she fought to keep herself together, but she managed all the way to the hospital. The emergency room seemed to be packed.\n By a combination of bleeding, being escorted by cops, and the friendly Delagardie and his partner putting in a word for us, Amelia and I got put in curtained cubicles right away. We weren\u0027t adjacent to each other, but we were in line to see a doctor. I was grateful. I knew that had to be quick, for an urban emergency room.\n As I listened to the bustle around me, I tried not to swear at the pain in my arm. In moments when it wasn\u0027t throbbing as much, I wondered what had happened to Jake Purifoy. Had the vampire cops taken him to a vampire cell at the jail, or was everything excused since he was a brand new vamp with no guidance? There\u0027d been a law passed about that, but I couldn\u0027t remember the terms and strictures. It was hard for me to be too concerned. I knew the young man was a victim of his new state; that the vampire who had made him should have been there to guide him through his first wakening and hunger. The vampire to blame was most likely my cousin Hadley, who had hardly expected to be murdered. Only Amelia\u0027s stasis spell on the apartment had kept Jake from rising months ago. It was a strange situation, probably unprecedented even in vampire annals. And a werewolf who\u0027d become a vampire! I\u0027d never heard tell of such a thing. Could he still change?\n I had a while to think about that and quite a few other things, since Amelia was too far away for conversation, even if she\u0027d been up to it. After about twenty minutes, during which time I was disturbed only by a nurse who wrote down some information, I was surprised to see Eric peer around the curtain.\n \"May I come in?\" he asked stiffly. His eyes were wide and he was speaking carefully. I realized that to a vampire, the smell of blood in the emergency room was enchanting and pervasive. I caught a glimpse of his fangs.\n \"Yes,\" I said, puzzled by Eric\u0027s presence in New Orleans. I wasn\u0027t really in an Eric mood, but there was no point in telling the former Viking he couldn\u0027t come into the curtained area. This was a public building, and he wasn\u0027t bound by my words. Anyway, he could simply stand outside and talk to me through the cloth until he found out whatever he\u0027d come to discover. Eric was nothing if not persistent. \"What on earth are you doing here in town, Eric?\"\n \"I drove down to bargain with the queen for your services during the summit. Also, Her Majesty and I have to negotiate how many of my people I can bring with me.\" He smiled at me. The effect was disconcerting, what with the fangs and all. \"We\u0027ve almost reached an agreement. I can bring three, but I want to bargain up to four.\"\n \"Oh, for God\u0027s sake, Eric,\" I snapped. \"That\u0027s the lamest excuse I\u0027ve ever heard. Modern invention, known as the telephone?\" I moved restlessly on the narrow bed. I couldn\u0027t find a comfortable position. Every nerve in my body was jangling with the aftermath of the fear of my encounter with Jake Purifoy, new child of the night. I was hoping that when I finally saw a doctor, he or she would give me an excellent painkiller. \"Leave me alone, okay? You don\u0027t have a claim on me. Or a responsibility to me.\"\n \"But I do.\" He had the gall to look surprised. \"We have a bond. I\u0027ve had your blood, when you needed strength to free Bill in Jackson. And we\u0027ve made love often, according to you.\"\n \"You made me tell you,\" I protested. And if I sounded a little on the whiny said, well, dammit, I thought it was okay to whine a little. Eric had agreed to save a friend of mine from danger if I\u0027d spill the truth to him. Is that blackmail? Yes, I think so.\n But there wasn\u0027t any way to untell him. I sighed. \"How\u0027d you get here, anyway?\"\n \"The queen monitors what happens to vampires in her city very closely, of course. I thought I\u0027d come provide moral support. And, of course, if you need me to clean you of blood...\" His eyes flashed as he inspected my arm. \"I\u0027d be glad to do it.\"\n I almost smiled, very reluctantly. He never gave up.\n \"Eric,\" said Bill\u0027s cool voice, and he slipped around the curtain to join Eric at my bedside.\n \"Why am I not surprised to see you here?\" Eric said, in a voice that made it clear he was displeased.\n Eric\u0027s anger wasn\u0027t something Bill could ignore. Eric outranked Bill, and he looked down his substantial nose at the younger vampire. Bill was around one hundred thirty-five years old: Eric was perhaps over a thousand. (I had asked him once, but he honestly didn\u0027t seem to know.) Eric had the personality for leadership. Bill was happier on his own. The only thing they had in common was that they\u0027d both made love to me: and just at the moment, they were both pains in my butt.\n \"I heard over the police band radio at the queen\u0027s headquarters that the vampire police had been called in to subdue a fresh vampire, and I recognized the address,\" Bill said by way of explanation. \"Naturally, I found out where Sookie had been brought, and came here as fast as I could.\"\n I closed my eyes.\n \"Eric, you\u0027re tiring her out,\" Bill said, his voice even colder than usual. \"You should leave Sookie alone.\"\n There was a long moment of silence. It was fraught with some big emotion. My eyes opened and went from one face to another. For once, I wished I could read vampire minds.\n As much as I could read from his expression, Bill was deeply regretting his words, but why? Eric was looking at Bill with a complex expression compounded of resolve and something less definable; regret, maybe.\n \"I quite understand why you want to keep Sookie isolated while she\u0027s in New Orleans,\" Eric said. His r\u0027s became more pronounced, as they did when he was angry.\n Bill looked away.\n Despite the pain pulsing in my arm, despite my general exasperation with the both of them, something inside me sat up and took notice. There was an unmistakable significance to Eric\u0027s tone. Bill\u0027s lack of response was curious... and ominous.\n \"What?\" I said, my eyes flicking from one to the other. I tried to prop myself up on my elbows and settled for one when the other arm, the bitten one, gave a big throb of pain. I pressed the button to raise the head of the bed. \"What\u0027s all the big hinting about, Eric? Bill?\"\n \"Eric should not be agitating you when you\u0027ve got a lot to handle already,\" Bill said, finally. Though never known for its expressiveness, Bill\u0027s face was what my grandmother would have described as \"locked up tighter than a drum.\"\n Eric folded his arms across his chest and looked down at them.\n \"Bill?\" I said.\n \"Ask him why he came back to Bon Temps, Sookie,\" Eric said very quietly.\n \"Well, old Mr. Compton died, and he wanted to reclaim his...\" I couldn\u0027t even describe the expression on Bill\u0027s face. My heart began to beat faster. Dread gathered in a knot in my stomach. \"Bill?\"\n Eric turned to face away from me, but not before I saw a shade of pity cross his face. Nothing could have scared me more. I might not be able to read a vampire\u0027s mind, but in this case his body language said it all. Eric was turning away because he didn\u0027t want to watch the knife sliding in.\n \"Sookie, you would find out when you saw the queen... Maybe I could have kept it from you, because you won\u0027t understand... but Eric has taken care of that.\" Bill gave Eric\u0027s back a look that could have drilled a hole through Eric\u0027s heart. \"When your cousin Hadley was becoming the queen\u0027s favorite...\"\n And suddenly I saw it all, knew what he was going to say, and I rose up on the hospital bed with a gasp, one hand to my chest because I felt my heart shattering. But Bill\u0027s voice went on, even though I shook my head violently.\n \"Apparently, Hadley talked about you and your gift a lot, to impress the queen and keep her interest. And the queen knew I was originally from Bon Temps. On some nights, I\u0027ve wondered if she sent someone to kill the last Compton and hurry things along. But maybe he truly died of old age.\" Bill was looking down at the floor, didn\u0027t see my left hand extended to him in a \"stop\" motion.\n \"She ordered me to return to my human home, to put myself in your way, to seduce you if I had to...\"\n I couldn\u0027t breathe. No matter how my right hand pressed to my chest, I couldn\u0027t stop the decimation of my heart, the slide of the knife deeper into my flesh.\n \"She wanted your gift harnessed for her own use,\" he said, and he opened his mouth to say more. My eyes were so blurred with tears that I couldn\u0027t see properly, couldn\u0027t see what expression was on his face and didn\u0027t care anyway. But I could not cry while he was anywhere near me. I would not.\n \"Get out,\" I said, with a terrible effort. Whatever else happened, I could not bear for him to see the pain he had caused.\n He tried to look me straight in the eyes, but mine were too full. Whatever he wanted to convey, it was lost on me. \"Please let me finish,\" he said.\n \"I never want to see you again, ever in my life,\" I whispered. \"Ever.\"\n He didn\u0027t speak. His lips moved, as if he were trying to form a word or phrase, but I shook my head. \"Get out,\" I told him, in a voice so choked with hatred and anguish that it didn\u0027t sound like my own. Bill turned and walked past the curtain and out of the emergency room. Eric did not turn around to see my face, thank God. He reached back to pat me on the leg before he left, too.\n I wanted to scream. I wanted to kill someone with my bare hands.\n I had to be by myself. I could not let anyone see me suffer this much. The pain was tied up with a rage so profound that I had never felt its like. I was sick with anger and hurt. The snap of Jake Purifoy\u0027s teeth had been nothing compared to this.\n I couldn\u0027t stay still. With some difficulty, I eased off the bed. My feet were still bare, of course, and I noticed with an odd detached part of my mind that they were extraordinarily dirty. I staggered out of the triage area, spotted the doors to the waiting room, and aimed myself in that direction. Walking was a problem.\n A nurse bustled up to me, a clipboard in her hand. \"Miss Stackhouse, a doctor\u0027s going to be with you in just a minute. I know you\u0027ve had to wait, and I\u0027m sorry, but...\"\n I turned to look at her and she flinched, took a step backward. I kept on toward the doors, my steps uncertain but my purpose clear. I wanted out of there. Beyond that, I didn\u0027t know. I made it to the doors and pushed and then I was dragging myself through the waiting room thronged with people. I blended in perfectly with the mix of patients and relatives waiting to see a doctor. Some were dirtier and bloodier than I was, and some were older - and some were way younger. I supported myself with a hand against a wall and kept moving to the doors, to the outside.\n I made it.\n It was much quieter outside, and it was warm. The wind was blowing, just a little. I was barefoot and penniless, standing under the glaring lights of the walk-in doors. I had no idea where I was in relation to the house, and no idea if that was where I was going, but I wasn\u0027t in the hospital any more.\n A homeless man stepped in front of me. \"You got any change, sister?\" he asked. \"I\u0027m down on my luck, too.\"\n \"Do I look like I have anything?\" I asked him, in a reasonable voice.\n He looked as unnerved as the nurse had. He said, \"Sorry,\" and backed away. I took a step after him.\n I screamed, \"I HAVE NOTHING!\" And then I said, in a perfectly calm voice, \"See, I never had anything to start with.\"\n He gibbered and quavered and I ignored him. I began my walk. The ambulance had turned right coming in, so I turned left. I couldn\u0027t remember how long the ride had been. I\u0027d been talking to Delagardie. I had been a different person. I walked and I walked. I walked under palm trees, heard the rich rhythm of music, brushed against the peeling shutters of houses set right up to the sidewalk.\n On a street with a few bars, a group of young men came out just as I was passing, and one of them grabbed my arm. I turned on him with a scream, and with a galvanic effort I swung him into a wall. He stood there, dazed and rubbing his head, and his friends pulled him away.\n \"She crazy,\" one of them said softly. \"Leave her be.\" They wandered off in the other direction.\n After a time, I recovered enough to ask myself why I was doing this. But the answer was vague. When I fell on some broken pavement, scraping my knee badly enough to make it bleed, the new physical pain called me back to myself a little bit more.\n \"Are you doing this so they\u0027ll feel sorry they hurt you?\" I asked myself out loud. \"Oh my God, poor Sookie! She walked out of the hospital all by herself, driven crazy with grief, and she wandered alone through the dangerous streets of the Big Easy because Bill made her so crazy!\"\n I didn\u0027t want my name to cross Bill\u0027s lips ever again. When I was a little more myself - just a little - the depth of my reaction began to surprise me. If we\u0027d still been a couple when I learned what I\u0027d learned this evening, I\u0027d have killed him; I knew that with crystal clarity. But the reason I\u0027d had to get away from the hospital was equally clear; I couldn\u0027t have stood dealing with anyone in the world just then. I\u0027d been blindsided with the most painful knowledge: the first man to ever say he loved me had never loved me at all.\n His passion had been artificial.\n His pursuit of me had been choreographed.\n I must have seemed so easy to him, so gullible, so ready for the first man who devoted a little time and effort to winning me. Winning me! The very phrase made me hurt worse. He\u0027d never thought of me as a prize.\n Until the structure had been torn down in a single moment, I hadn\u0027t realized how much of my life in the past year had been built on the false foundation of Bill\u0027s love and regard.\n \"I saved his life,\" I said, amazed. \"I went to Jackson and risked my life for his, because he loved me.\" One part of my brain knew that wasn\u0027t entirely accurate. I\u0027d done it because I had loved him. And I was amazed, at the same moment, to realize that the pull of his maker, Lorena, had been even stronger than the orders of his queen. But I wasn\u0027t in the mood to split emotional hairs. When I thought of Lorena, another realization socked me in the stomach. \"I killed someone for him,\" I said, my words floating in the thick dark night. \"Oh, my God. I killed someone for him.\"\n I was covered in scrapes, bruises, blood, and dirt when I looked up to see a sign reading CHLOE STREET. That was where Hadley\u0027s apartment was, I realized slowly. I turned right, and began to walk again.\n The house was dark, up and down. Maybe Amelia was still at the hospital. I had no idea what time it was or how long I had walked.\n Hadley\u0027s apartment was locked. I went downstairs and picked up one of the flowerpots Amelia had put around her door. I carried it up the stairs and smashed in a glass pane on the door. I reached inside, unlocked the door, and stepped in. No alarm shrieked. I\u0027d been pretty sure the police wouldn\u0027t have known the code to activate it when they\u0027d left after doing whatever it was they\u0027d done.\n I walked through the apartment, which was still turned upside down by our fight with Jake Purifoy. I had some more cleaning to do in the morning, or whenever... whenever my life resumed. I went into the bathroom and stripped off the clothes I\u0027d been wearing. I held them and looked at them for a minute, at the state they were in. Then I stepped across the hall, unlocked the closest French window, and threw the clothes over the railing of the gallery. I wished all problems were that easily disposed of, but at the same time my real personality was waking up enough to trigger a thread of guilt that I was leaving a mess that someone else would have to clean up. That wasn\u0027t the Stackhouse way. That thread wasn\u0027t strong enough to make me go back down the stairs to retrieve the filthy garments. Not then.\n After I\u0027d wedged a chair under the door I\u0027d broken, and after I\u0027d set the alarm system with the numbers Amelia had taught me, I got into the shower. The water stung my many scrapes and cuts, and the deep bite in my arm began bleeding again. Well, shit. My cousin the vampire hadn\u0027t needed any first aid supplies, of course. I finally found some circular cotton pads she\u0027d probably used for removing makeup, and I rummaged through one of the bags of clothes until I found a ludicrously cheerful leopard-patterned scarf. Awkwardly, I bound the pads to the bite and got the scarf tight enough.\n At least the vile sheets were the least of my worries. I climbed painfully into my nightgown and lay on the bed, praying for oblivion. \n","sourceLink":"https://allnovel.net/definitely-dead-sookie-stackhouse-6/page-15.html","bookId":2196,"book":{"id":2196,"title":"Definitely Dead (Sookie Stackhouse #6)","description":"Storyline: \n Definitely Dead (Sookie Stackhouse #6) \n As a person with so few living relatives, Louisiana cocktail waitress Sookie Stackhouse really hated to lose one. But she never guessed that it would be her cousin Hadley—a consort of the Vampire Queen of New Orleans. After all, technically speaking, Hadley was already dead. And now, as unexpected heir to Hadley’s estate, Sookie discovers the inheritance definitely comes with a risk. Someone doesn’t want Sookie looking too deeply into Hadley’s past—or for that matter, Hadley’s possessions. And they’re prepared to do anything in their power to stop her. But who? The range of suspects runs from the Rogue Weres who reject Sookie as a friend of the Pack to the Vampire Queen herself, who could be working through a particularly vulnerable subject—Sookie’s first love, Bill. \n Whoever it is, they’re definitely dangerous—and Sookie’s life is definitely on the line… \n With HBO\u0027s launching of an all-new show, True Blood, based on the Southern Vampire novels, the demand for Charlaine Harris and Sookie Stackhouse is bigger than ever.\n \n","cover":"https://allnovel.net/images/definitely-dead-sookie-stackhouse-6.jpg","author":"Charlaine Harris","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/definitely-dead-sookie-stackhouse-6.html","creation":"Oct 5, 2019 8:58:26 AM","modification":"Oct 5, 2019 9:59:28 PM"}}
