{"id":98255,"no":17,"title":"Page 17","content":"Hence the reason I’m in here making coffee.\\n\\n I figure she’ll just be processing things. I can’t begin to imagine how it must feel to know that your mom abandoned you.\\n\\n I’ve never been abandoned, but dying mothers I have down to pat.\\n\\n My real mom, Abbi, died in childbirth. She had a heart problem that they didn’t know about, and the stress of giving birth to me killed her.\\n\\n She wasn’t married to Dad. They were young, in a steady relationship, but my dad hadn’t kept it covered, so nine months later it was hello Jordan.\\n\\n After Abbi died, Dad raised me alone with the help of my grandpa. When I was two, Belle, my step-mom who I always refer to as mom as she’s the only one I ever known, came back to town, and her and dad got back together. Dad and Mom were childhood sweethearts. Mom left town to go to college, but Dad stayed here and went to the police academy. Before she left they broke up, and that was when he met Abbi and had me.\\n\\n Mom died four years ago, and he hasn’t looked at another woman since.\\n\\n Dad has had such a rough time in his life. He’s lost two women he loved. I think losing both of them has killed his faith in love. Totally understandable.\\n\\n And that’s why I stay single. I only bother with a woman when I need to get laid.\\n\\n The phone starts to ring. “Golden Oaks.”\\n\\n “Hey son, how you doing?”\\n\\n “Hey Dad, I’m good. How’s Grandpa doing? He driving you crazy yet?”\\n\\n He laughs. “Of course. You know your Grandpa. How are things at the hotel?”\\n\\n “Yeah, good. We’ve got a guest staying at the moment. She’s here for two weeks.”\\n\\n “She?” Silence. “You’ve got a woman staying there right now?”\\n\\n “Yes, Dad.” I sigh.\\n\\n “Is she alone?”\\n\\n “Yep.”\\n\\n “How old is she?”\\n\\n “I don’t know, around my age, maybe a few years younger.”\\n\\n “Does she have a boyfriend?”\\n\\n “Jesus, Dad.” I sigh again. “I don’t know her relationship status—” A lie. “—because I don’t need to. I’m not gonna touch her, okay? She’s not my type.”\\n\\n That one is a small lie. Mia isn’t my usual type. She’s so much more.\\n\\n “Every girl is your type, Jordan.”\\n\\n “Not every girl!” I scoff. “I would never sleep with an ugly girl. Jeez, give me some fuckin’ credit, Dad.”\\n\\n “Jesus, Jordan, do you have to cuss so much?”\\n\\n “Yes, I fucking do.”\\n\\n How do parents have the ability to turn you from a grown ass man into a teenager in the matter of seconds?\\n\\n “So, she’s ugly then?” he says, starting in again.\\n\\n “Who?” I play out.\\n\\n He lets out a loud sigh. “The girl you have no intention of trying to get into bed.”\\n\\n “Well … no, she’s not what I would call ugly…”\\n\\n He laughs. Loudly.\\n\\n It really pisses me off.\\n\\n “Look, I know you think I’m a fuck up, and I know that’s my fault, but I am fully capable of keeping my hands to myself. I’m staying away from this girl. She’s a guest. End of.”\\n\\n “Whoa, calm down, son. First off, I do not think you’re a fuck-up. You hear me? I just worry about you. Parent’s privilege. I just want you to be happy, but you always seem to look for happiness in all the wrong places. More so recently.”\\n\\n This is getting a little deeper than I like. I don’t do deep. Especially not with my dad.\\n\\n I lean my arm against the wall and rest my forehead on it.\\n\\n I blow out a breath. “I’m fine, Dad. I’m happy. Look, I have to go. Say hi to Grandpa for me, will you?”\\n\\n “Sure.” He sounds resigned, and I’m glad. I don’t want this conversation to go on any longer than necessary. “Take care, son. Speak to you soon.”\\n\\n I hang up the phone, then realize I forgot to tell him about Dozer’s accident. Whatever. I’m not in the mood to call him back right now. I’ll tell him later.\\n\\n I take our coffees outside. Mia is sitting at the table. Her sunglasses are off, and she’s leaned back in her chair, head tilted, staring up at the sky.\\n\\n I watch her for longer than I should.\\n\\n Her head comes up suddenly, and she catches me staring.\\n\\n Acting like there is nothing weird about me staring at her, I smile and walk over, putting her coffee on the table in front of her.\\n\\n “Thanks.” She smiles up at me, and it feels like I just got punched in the chest.\\n\\n That is seriously starting to drive me crazy. Not the smiles … no, those are awesome. It’s my reaction to them that’s pissing me off. My reaction to her.\\n\\n I take the chair across from her. Settling back, I take a sip of my coffee and set it down.\\n\\n “Any idea where you want to start?” I nod at the papers in front of her.\\n\\n Mia takes a sip of coffee, her eyes watching mine over the brim of the cup. “I thought maybe I would start with the Anna that lives in Farmington. That’s the largest town, right? Because I thought if I were her and I was getting away that’s where I would go. Or maybe go to another state altogether, so I’d be harder to find.”\\n\\n Her lips downturn. I feel a pang of … I don’t know. All I do know is I really don’t like to see her sad.\\n\\n “Think positive, Mia. Start with what we have and go from there.”\\n\\n Her eyes lift. “You’re right. I’ll drive out there tomorrow—”\\n\\n “We,” I emphasize.\\n\\n I could really do without going to Farmington. I’ve avoided that place like the plague since what happened with Dad. But I can’t let her go there alone. And the likelihood I’ll see anyone I don’t want to see, during the day, is slim to none.\\n\\n The likes of me only come out to play at night.\\n\\n Mia places her cup down. “You don’t have to come with me. You’ve helped me enough already – and you have the hotel to run.”\\n\\n Leaning back, I cross my leg over my other and rest my ankle on my thigh. “If you haven’t noticed, we’re not exactly busy. You’re my only guest, so call this the all-inclusive package.” I grin so that it doesn’t come off as creepy.\\n\\n She laughs.\\n\\n Good sign.\\n\\n Her eyebrow lifts, and she starts pulling on that damn lip again. “So … what does this all-inclusive package entail?”\\n\\n Hmm. She’s flirting with me. Interesting.\\n\\n Very. Fucking. Interesting.\\n\\n “Nothing specific. It’s more of a try and see kind of thing.”\\n\\n “Right.” She hasn’t taken her eyes off me.\\n\\n I’m really liking the direction this is going. I shouldn’t, but I can’t help myself. I have Mia’s interest, and I’m not letting go until I know what it means.\\n\\n My breathing has picked up, so I take a quick sip of my coffee to cover it, but don’t take my eyes off her.\\n\\n “But part of that package does mean I’m coming with you tomorrow. I really don’t think it’s safe for you drive out there alone.”\\n\\n A little frown dimples between her brows, and a fire lights in her eyes. It’s sexy, but I know I’ve pissed her off. I had this going in a good direction, but I just had to open my big mouth and ruin it.\\n\\n She folds her arms across her chest. It pushes those perfect tits of hers up; tits that I’m trying really hard not to look at.\\n\\n “Jordan, I drove across seven states alone to get here. I can manage a drive out of town.” She sounds pissed off, and her lip has jutted out. I can’t help but chuckle.\\n\\n She’s so goddamn adorable. I’m tempted to throw all caution to the wind, and take her face in my hands and kiss those beautiful lips of hers.\\n\\n “I get it,” I say, covering up a smile. “You can take care of yourself. But just humor me. Remember, I grew up the son of a cop, I know about the bad side of women driving alone long distance. Jeez, just knowing you did that to get here makes me feel like I’m going to break out in hives. And that wouldn’t be pretty. You don’t want to be responsible for making me look ugly, do you? Like the kind of ugly that scares small children.” I pull a face, and she smiles.\\n\\n I’m playing, because I don’t want to knock the self-confidence and independence she so clearly needs to exert—the confidence that bastard took away from her the instant he laid a finger on her.\\n\\n But I also can’t let her go there alone.\\n\\n She looks down at the table and runs her fingertip along the groove. I’ve already gotten familiar with the face she pulls when she’s thinking something over, and she’s wearing that look right now.\\n\\n She lifts her head, looking at me intently. “I don’t want to be the one responsible for spoiling that nice face of yours, so … okay, you can come.”\\n\\n “You think I have a nice face?” I tilt my head to the side, grinning.\\n\\n Of course, I caught that. And of course I want to know the answer. Mia is the only woman I’ve ever had to question as to whether she finds me attractive or not.\\n\\n She’s so hard to read that it’s impossible to tell what she’s thinking most of the time.\\n\\n It’s fucking with my head, to say the least.\\n\\n Her face has gone as red as I expected it would. I’ve never met a girl as shy as she is.\\n\\n I’ve never met a girl like her, period. She’s so different. Unassuming of anything, mainly herself. She has no clue just how fucking awesome she actually is, but I want her to know. I just wish I knew how to tell her.\\n\\n “Uh, um, well…” She runs her fingers through her hair, and keeps her eyes fixed on the coffee in front of her. “You have a nice face. You know, as faces go.”\\n\\n “I’ll take that as a compliment.” I smile. But what I actually feel like doing is breaking into a fucking dance. “You have a nice face too, Mia. Really nice.”\\n\\n I hear her quick intake of breath, and I notice the flush on her chest. She’s affected by me.\\n\\n A-fuckin-men!\\n\\n “Thank you,” she says quietly, biting down on a smile.\\n\\n “You have a serious problem with that.”\\n\\n “What?” Her eyes flick up to mine, the warmth instantly dying.\\n\\n I hold off the frown I feel knowing why she reacts like she does – suspicious of what I say and do. But it doesn’t mean I have to like it. What that asshole has done to her, how he has broken her confidence … and I don’t even know the half of it. I’m just praying that the black-eye was the whole of it and nothing more.\\n\\n “Saying thank you. You say it all the time,” I tell her.\\n\\n “Oh. Good manners … they were drummed into me.” The light heartedness in her voice doesn’t match the look in her eyes.\\n\\n If I hadn’t been watching closely, I would have missed how her eyes dimmed, but I didn’t, and now it’s stirred an uncomfortable feeling in my gut.\\n\\n There is more—more than the black-eye from the douchebag ex of hers. And now I’m fucking fuming.\\n\\n I want to know the rest … need to know so I can help her. But I can’t ask her outright, I don’t want to upset her like I did before, so I’ll just have to wait until she’s ready to tell me. \\n\\n","sourceLink":"https://allnovel.net/trouble/page-17.html","bookId":2000,"book":{"id":2000,"title":"Trouble","description":"Storyline: Mia Monroe is running. Running from a person she doesn’t ever want to find her. Running from a past she doesn’t ever want anyone to know. Desperate to find a future, that yesterday, she could only dream of having. \\n Jordan Matthews likes easy. Easy women. Easy life. \\n Then he meets Mia. \\n She’s damaged, troubled and has more baggage than any person can carry. But the more Jordan gets to know Mia-for the first time in his life-he finds himself wanting to try hard for something … for someone … for her. \\n And then life isn’t so easy anymore. \\n Jordan is everything Mia shouldn’t want. A whole bunch of dirty hotness, tattooed, cocky bad boy, who made his money at poker tables and picked his women up in bars. Yet, Mia finds herself falling for him. Then the past Mia was running from, quickly starts to catch up with her. Because that’s the problem with running … you have to stop sometime. \\n And when you stop, you get caught.\\n","cover":"https://allnovel.net/images/trouble.jpg","author":"Samantha Towle","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/trouble.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 6:31:56 PM"}}
