{"id":98264,"no":27,"title":"Page 27","content":"“I’ll pick you up at eight.” And right before I hang up, I add, “And I’m bringing Mia with me.”\n Chuckling, I push my cell in my pocket and hop down from the mower. That’ll give Beth something to chew on instead of fretting over her impending date.\n Dozer’s ears prick as I approach. He gets to his feet and hobbles over to me. I crouch down to stroke him.\n Mia’s eyes lift from her book to me. “Hey.” She smiles, sitting up.\n I suddenly feel nervous. And a little queasy. “Your book good? You looked lost in it.”\n Turning the book over, she stares down at the cover.\n I grin when I see that it is a picture of a half-naked guy draped over a half-naked chick.\n Book porn. Go Mia.\n Realizing her mistake at showing me the cover, her face goes bright red. She quickly closes the book and sets it down. Back cover up, naked couple down.\n Shame.\n “Yeah, it’s okay.” She looks out at the lake. Leaning over, she trails her fingers in the water. “I wanted to ask … is this water okay to swim in?”\n “Yeah,” I answer, moving to sit in front of her. “I swim in here all the time. You up for a swim now?”\n An image of Mia wearing a bikini flashes through my mind. It’s a really fucking great image.\n “Oh, not right now.” She scores her lower lip with her teeth.\n And that’s it. My thoughts go to shit. It takes me a good minute just to remember why I actually came over.\n Beth. Date. Club.\n “So I, uh…” I push my hair out of my eyes. “I came over because I just got off the phone with Beth. She’s got a date tonight, and she’s talked me into going with her.”\n Her eyebrow lifts. “Aren’t dates supposed to be just a two person thing?”\n “Normally. But it’s a big deal for her, and her date is going to be DJing at the club, so she’ll be alone for the first hour or so. She needs me to keep her company. And Beth is impossible to say no to when she wants something, so I said I’d go and … I was … uh, wondering if you wanted to come along – with me?”\n Her eyes widen. I’m not sure if it’s shock of the bad variety, or surprise of the good.\n “Do you mean, like, on a date?” Her eyes instantly close on a groan. “Did I say that out loud? I said that out loud. Oh god.”\n I can’t help the smile on my face, or the happy in my voice. “Yeah, you said it out loud.”\n “Oh god.” She groans again, covering her face with her hands.\n My confidence instantly bolstered, I reach over and pull a hand from her face. One eye pops open.\n “Do you want me to be asking you out on a date?”\n Slowly, she lowers her other hand from her face.\n My heart is hammering in my chest, waiting for her to put me out of my misery.\n “Yes,” she whispers.\n I tangle my fingers with hers. “Then I’m asking you out on a date.”\n Chapter Fourteen\n Mia\n Oh god. Oh god. Oh god.\n I agreed to go on a date with Jordan.\n What was I thinking?\n I wasn’t thinking. That’s the point. I was looking into his amazing eyes and saying yes before I knew what I was agreeing to.\n It was my fault because there was all that talk of Beth’s date … I got confused and thought he was asking me out … and me being me, I blurted out what I was thinking, which I seem to do all the time around him, and before I knew it, he was asking, and I was saying yes.\n I should back out.\n I don’t want to, but I should. I don’t have the best track record when it comes to men. I’m not a winner picker.\n But this is Jordan.\n And I’m about eighty-five percent sure I can trust him. He’s given me no reason to not. And yes, I know Forbes came across as trustworthy in the beginning, but back then I was naïve and a fool.\n I’m not that person anymore. I know the signs to look for, and I see none of them in Jordan.\n There’s no over the top niceness, which is there in the beginning to hide the monster lying in wait. There’s no control in his personality. He is just who he is. If anything, Jordan has been really open and honest with me about his past.\n If all he cared about is tricking me and getting me where he wants me – in his bed and under his control – that wouldn’t be the way. And men like that are not honest. Not right away, anyway.\n Jordan’s fun. He makes me laugh. He makes me feel happiness in a way I’ve never known. I love being around him, and I think I deserve some fun; some happiness and laughter in my life.\n And really, it is just one date. It’s not as if I’m marrying the guy.\n I should just go out with him tonight and see how it goes. I’ve got absolutely nothing to lose, and we won’t be alone. Beth will be there with her date too.\n It’ll be fine.\n Taking a deep breath, I survey myself in the mirror.\n I wasn’t sure what to wear. Jordan said I shouldn’t wear anything I’m too attached to as apparently it’s a paint party at the club tonight. I’ve never heard of that before, but it sounds fun, if not a little messy. But I’m all up for trying new things at the moment.\n I’m not really a dancer, and I’m not attached to any of my clothes, so it’s not too difficult for me to choose what to wear. It’s a really warm evening, so I’ve decided to wear a white tank top and khaki linen pants. I’ve accessorized with a cute black and white bead necklace and matching bracelet that I picked up while shopping with Jordan yesterday.\n I want to look as nice as possible, but I don’t have a lot to work with here. Not much can be done with my short hair, but the style has really grown on me and it looks cool.\n I’ve applied some make-up – mascara, blusher and lip-gloss. I also used cover-up as there is still a trace of yellow bruising around my eye. No hiding the cut on my brow, but it’s healing nicely.\n I’m just fastening the laces on my sneakers when there’s a knock at the door.\n My date is here.\n A swarm of fireflies takes flight in my stomach. I quickly finish off tying up my lace and get to my feet, taking deep breaths as I approach the door. I open it to a ‘more gorgeous than normal looking’ Jordan.\n He’s only wearing a plain black t-shirt and distressed jeans. White sneakers on his feet. Simple, but oh so effective. Jordan makes anything look good.\n I can see that he’s shaved as his stubble from earlier is gone. His dark hair is in its trademark style. My fingers itch to run through the silky strands.\n I can smell his aftershave. Clean and fresh. He smells as gorgeous as he looks; exactly as a man should smell. I have to resist the urge to lean close and inhale.\n He runs a hand through his shiny hair. “You look great—” He shakes his head. “—I mean, pretty. You look real pretty, Mia.”\n I curl my fingers around the beads, holding them like a life support. “Thanks, you too. Not pretty – handsome. I mean you look handsome.” God, kill me now.\n Jordan chuckles and leans his shoulder up against the door frame. “Are you ready to go? I told Beth we’d pick her up at eight, so we need to set off soon.”\n “Sure. Let me just grab my things.”\n I decide against taking a purse with me, so I put my room key, money and lip-gloss into my pocket while Jordan waits in the hall. I let the door lock behind me, then follow him out the hotel and to his car.\n He opens the passenger door for me. No one has ever done that before, and I can’t help but smile at his gesture. I slip into the seat and watch as Jordan rounds the hood. The way his body moves with such confident ease … it’s so attractive on him. I wish I was that comfortable in my own skin.\n He climbs in next to me.\n There’s a quiet unease between us. I know I’m the cause of it because of my nerves at being on a date with him, but I’m really missing the ease we normally have between us. I do want to be on a date with Jordan, I just don’t like the pressure it’s putting on me … or the pressure I’m putting on myself.\n He starts the engine and the radio fills the empty background, but the silence between us is still palpable.\n “Are you okay?” His softly spoken words bring my face to him.\n I wring my hands in my lap. “Just a little nervous, I guess.”\n “About?”\n “Being on a date.” I twist the beads around my finger. “I just … I haven’t…” I shake my head, struggling to find the right words to explain my feelings.\n “Hey…” He gently touches my chin with his finger.\n I love the way his touch feels. I never thought it would be possible, and I’ll never tire of him touching me, but I just wish I knew how to tell him. How to express how he makes me feel … how I feel about him. I know I’m not what he’s used to, and I know I won’t ever be able to be like those women. I’m afraid I’m going to be a disappointment to him.\n “… there is nothing to be nervous about. We’re just going out to have some fun, dance and get sprayed with paint.” He grins.\n It’s impossible not to smile back.\n “There you go.” He touches the corner of my smile with his thumb. And those damn fireflies start off in my stomach again, swooping and somersaulting. “Nothing will happen tonight that you don’t want, okay?” His gaze is warm on my skin.\n I take a deep breath. “Okay.”\n Beth seems nervous about her date. She has done nothing but talk about it from the moment we picked her up. She’s like a bundle of nervous energy, but honestly, I like it. I like her. And Beth’s nerves are making me feel a little more normal about my own.\n I love the dynamic between Beth and Jordan. The way he never seems to get annoyed or irritated by her incessant chatter about her date with Toni. Forbes would never have let me talk that way, but then I guess Beth is Jordan’s friend, not his girlfriend.\n I’ve wondered why they are nothing more than friends as Beth is really pretty and they get on so well, but I had my question answered after five minutes of Beth being in the car when she talked about Toni in the female sense. Turns out Beth is into girls.\n A girl who went to my school was a lesbian. She was bullied incessantly because of it. I used to feel so terrible for her, but it wasn’t as if I could do anything to help her. I wish I could have, but I couldn’t even deal with my own problems, so I had no chance of helping anyone else. I wonder if Beth has suffered any hassle because of her sexual orientation. If she has, then I’m glad that Jordan is by her side because I can imagine him kicking the crap out of anyone who bullied her.\n Jordan parks a few blocks over from the club and we start the short walk. The sidewalk is narrow, so Beth is in front, Jordan and I behind.\n Because we’re so close, our hands keep brushing as we walk. Every time they touch, a jolt of heat flares up my arm. I’m desperate to hold his hand. We’ve held hands before, always Jordan holding mine, but that was before this, when we were just friends. Now things have changed, and it makes holding hands seem like such a bigger deal.\n “Fuck it,” I hear him mutter, and the next thing I know he’s taking hold of my hand. \n","sourceLink":"https://allnovel.net/trouble/page-27.html","bookId":2000,"book":{"id":2000,"title":"Trouble","description":"Storyline: \n Mia Monroe is running. Running from a person she doesn’t ever want to find her. Running from a past she doesn’t ever want anyone to know. Desperate to find a future, that yesterday, she could only dream of having. \n Jordan Matthews likes easy. Easy women. Easy life. \n Then he meets Mia. \n She’s damaged, troubled and has more baggage than any person can carry. But the more Jordan gets to know Mia-for the first time in his life-he finds himself wanting to try hard for something … for someone … for her. \n And then life isn’t so easy anymore. \n Jordan is everything Mia shouldn’t want. A whole bunch of dirty hotness, tattooed, cocky bad boy, who made his money at poker tables and picked his women up in bars. Yet, Mia finds herself falling for him. Then the past Mia was running from, quickly starts to catch up with her. Because that’s the problem with running … you have to stop sometime. \n And when you stop, you get caught.\n \n","cover":"https://allnovel.net/images/trouble.jpg","author":"Samantha Towle","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/trouble.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 6:31:56 PM"}}
