{"id":65519,"no":20,"title":"Page 20","content":"ROSCOE AND I DANCED AROUND THE SERVICE ALLEY TOGETHER like players in the dugout watching the winning run soar out of sight. Then we hustled over to the Chevy and raced the mile back to our hotel. Ran into the lobby, into the elevator. Unlocked our room and fell in. The telephone was ringing. It was Finlay, on the line from Margrave again. He sounded as excited as we were.\n \"Molly Beth Gordon just called,\" he said. \"She did it. She\u0027s got the files we need. She\u0027s flying down here, right now. She told me it was amazing stuff. Sounded high as a kite. Atlanta arrivals, two o\u0027clock. I\u0027ll meet you there. Delta, from Washington. Picard give you anything?\"\n \"Sure did,\" I said. \"He\u0027s quite a guy. I got the rest of the printout, I think.\"\n \"You think?\" Finlay said. \"You don\u0027t know?\"\n \"Only just got back,\" I said. \"Haven\u0027t looked at it yet.\"\n \"So look at it, for Christ\u0027s sake,\" he said. \"It\u0027s important, right?\"\n \"See you later, Harvard guy,\" I said.\n We sat down at the table over by the window. Unzipped the little plastic bag and pulled out the paper. Unfolded it carefully. It was a sheet of computer paper. The top inch had been torn off the right-hand corner. Half the heading had been left behind. It said: Operation E Unum.\n \"Operation E Unum Pluribus,\" Roscoe said.\n Underneath was a triple-spaced list of initials with telephone numbers opposite. The first set of initials was P.H. The phone number was torn off.\n \"Paul Hubble,\" Roscoe said. \"His number and the other half of the heading was what Finlay found.\"\n I nodded. Then there were four more sets of initials. The first two were W.B. and K.K. They had phone numbers alongside. I recognized a New York area code against K.K. The W.B. area code I figured I\u0027d have to look up. The third set of initials was J.S. The code was 504. New Orleans area. I\u0027d been there less than a month ago. The fourth set of initials was M.B.G. There was a phone number with a 202 area code. I pointed to it, so Roscoe could see it.\n \"Molly Beth Gordon,\" she said. \"Washington, D.C.\"\n I nodded again. It wasn\u0027t the number I had called from the rosewood office. Maybe her home number. The final two items on the torn paper were not initials, and there were no corresponding phone numbers. The second-to-last item was just two words: Stollers\u0027 Garage. The last item was three words: Gray\u0027s Kliner File. I looked at the careful capital letters and I could just about feel my dead brother\u0027s neat, pedantic personality bursting off the page.\n Paul Hubble we knew about. He was dead. Molly Beth Gordon we knew about. She\u0027d be here at two o\u0027clock. We\u0027d seen the garage up at Sherman Stoller\u0027s place on the golf course. It held nothing but two empty cartons. That left the underlined heading, three sets of initials with three phone numbers, and the three words: Gray\u0027s Kliner File. I checked the time. Just past noon. Too early to sit back and wait for Molly Beth to arrive. I figured we should make a start.\n \"First we think about the heading,\" I said. \"E Unum Pluribus.\"\n Roscoe shrugged.\n \"That\u0027s the U.S. motto, right?\" she said. \"The Latin thing?\"\n \"No,\" I said. \"It\u0027s the motto backwards. This more or less means out of one comes many. Not out of many comes one.\"\n \"Could Joe have written it down wrong?\" she said.\n I shook my head.\n \"I doubt it,\" I said. \"I don\u0027t think Joe would make that kind of a mistake. It must mean something.\"\n Roscoe shrugged again.\n \"Doesn\u0027t mean anything to me,\" she said. \"What else?\"\n \"Gray\u0027s Kliner File,\" I said. \"Did Gray have a file on Kliner?\"\n \"Probably,\" Roscoe said. \"He had a file on just about everything. Somebody spat on the sidewalk, he\u0027d put it in a file.\"\n I nodded. Stepped back to the bed and picked up the phone. Called Finlay down in Margrave. Baker told me he\u0027d already left. So I dialed the other numbers on Joe\u0027s printout. The W.B. number was in New Jersey. Princeton University. Faculty of modern history. I hung up straight away. Couldn\u0027t see the connection. The K.K. number was in New York City. Columbia University. Faculty of modern history. I hung up again. Then I dialed J.S. in New Orleans. I heard one ring tone and a busy voice.\n \"Fifteenth squad, detectives,\" the voice said.\n \"Detectives?\" I said. \"Is that the NOPD?\"\n \"Fifteenth squad,\" the voice said again. \"Can I help you?\"\n \"You got somebody there with the initials J.S.?\" I asked.\n \"J.S.?\" the voice said. \"I got three of them. Which one do you want?\"\n \"Don\u0027t know,\" I said. \"Does the name Joe Reacher mean anything to you?\"\n \"What the hell is this?\" the voice said. \"Twenty Questions or something?\"\n \"Ask them, will you?\" I said. \"Ask each J.S. if they know Joe Reacher. Will you do that? I\u0027ll call back later, OK?\"\n Down in New Orleans, the fifteenth squad desk guy grunted and hung up. I shrugged at Roscoe and put the phone back on the nightstand.\n \"We wait for Molly?\" she said.\n I nodded. I was a little nervous about meeting Molly. It was going to be like meeting a ghost connected to another ghost.\n WE WAITED AT THE CRAMPED TABLE IN THE WINDOW. Watched the sun fall away from its noontime peak. Wasted time passing Joe\u0027s torn printout back and forth between us. I stared at the heading. E Unum Pluribus. Out of one comes many. That was Joe Reacher, in three words. Something important, all bound up in a wry little pun.\n \"Let\u0027s go,\" Roscoe said.\n We were early, but we were anxious. We gathered up our things. Rode the elevator to the lobby and let the dead guys settle up for our phone calls. Then we walked over to Roscoe\u0027s Chevy. Started threading our way around to arrivals. It wasn\u0027t easy. The airport hotels were planned for people heading out of arrivals or heading into departures. Nobody had thought of people going our way.\n \"We don\u0027t know what Molly looks like,\" Roscoe said.\n \"But she knows what I look like,\" I said. \"I look like Joe.\"\n The airport was vast. We saw most of it as we crabbed over to the right quarter. It was bigger than some cities I\u0027d been in. We drove for miles. Found the right terminal. Missed a lane change and passed the short-term parking. Came around again and lined up at the barrier. Roscoe snatched the ticket and eased into the lot.\n \"Go left,\" I said.\n The lot was packed. I was craning over, looking for spaces. Then I saw a vague black shape slide by in the line on my right. I caught it out of the corner of my eye.\n \"Go right, go right,\" I said.\n I thought it was the rear end of a black pickup. Brand-new. Sliding by on my right. Roscoe hauled the wheel over and we swung into the next aisle. Caught a flash of red brake lights in black sheetmetal. A pickup swung out of sight. Roscoe howled down the aisle and cornered hard.\n The next aisle was empty. Nothing moving. Just ranks of automobiles standing quiet in the sun. Same thing in the next aisle. Nothing on the move. No black pickup. We drove all over the lot. Took us a long time. We were held up by the cars moving in and out. But we covered the whole area. Couldn\u0027t find a black pickup anywhere.\n But we did find Finlay. We parked up in an empty space and started the long walk to the terminal. Finlay had parked in a different quarter and was walking in on a different diagonal. He walked the rest of the way with us.\n The terminal was very busy. And it was huge. Built low, but it spread horizontally over acres. The whole place was crowded. Flickering screens high up announced the arrivals. The two o\u0027clock Delta from Washington was in and taxiing. We walked down toward the gate. Felt like a half-mile walk. We were in a long corridor with a ribbed rubber floor. A pair of moving walkways ran down the center of the corridor. On the right was an endless row of bright gaudy advertisements about the attractions of the Sunbelt. Business or pleasure, it was all down here, that\u0027s for sure. On the left was a glass partition, floor to ceiling, with a white etched stripe at eye level to stop people trying to walk through the glass.\n Behind the glass were the gates. There was an endless sequence of them. The passengers came out of the planes and walked along on their side of the glass. Half of them disappeared sideways into the baggage claim areas. Then they came out again and found exit doors in the glass partition which let them out into the main corridor. The other half were the short-haul fliers with no checked baggage. They went straight to the doors. Each set of doors was mobbed by big knots of meeters and greeters. We pushed our way through them as we headed down.\n Passengers were spilling out of the doors, every thirty yards. Friends and relatives were moving in close and the two streams of people were colliding. We fought through eight separate crowds before we got to the right gate. I just pushed my way through. I felt anxious. The glimpse of the black pickup in the lot had unsettled me.\n We reached the gate. We walked on our side of the glass right past the doors. Right down to level with the end of the jetway. People were already coming off the plane. I watched them spilling out of the jetway and turning to walk up toward the baggage area and the exit doors. On our side of the glass, people were walking down to the gates farther on. They were pushing at us as they passed. We were being dragged down the corridor. Like swimming in a heavy sea. We were stepping backward all the time just to stay standing still.\n There was a stream of people behind the glass. I saw a woman coming in who could have been Molly. She was about thirty-five, dressed well in a business suit, carrying a briefcase and a garment bag. I was standing there, trying to get recognized, but she suddenly saw somebody else and pointed and gave a silent shriek behind the glass and blew a kiss to a guy ten yards from me. He shouldered backward toward the doors to wait for her.\n Then it seemed like just about any of the women could be Molly. There must have been a couple of dozen candidates. There were blondes and brunettes, tall ones, short ones, pretty ones, homely ones. All dressed for business, all carrying efficient luggage, all striding in with the weary purposeful manner of tired executives in the middle of a busy day. I watched them all. They flowed with the tide behind the glass, some of them peering out for husbands, lovers, drivers, business contacts, some of them looking straight ahead. All of them carried along in the swarming crowd.\n One of them had matching burgundy leather luggage, a heavy briefcase in one hand and a carry-on which she was wheeling on a long handle with the other. She was small, blond, excited. She slowed as she turned out of the jetway and scanned the crowd through the glass. Her eyes flashed past me. Then they snapped back. She looked straight at me. Stopped. People piled up behind her. She was pushed forward. She fought her way over to the glass. I moved in close on my side. She stared at me. Smiled.\n \"Molly?\" I mouthed through the glass at her.\n She held up the heavy briefcase like a trophy. Nodded toward it. Smiled a big wide smile of excited triumph. She was pushed in the back. Borne along by the crowd toward the exit. She looked back to see if I was following. Roscoe and Finlay and I struggled after her.\n On Molly\u0027s side of the glass, the flow was with her. Our side, it was against us. We were being separated at double speed. There was a solid mob of college kids bearing down on us. Aiming to fly out of a gate farther down. Big, well-fed kids, clumsy luggage, rowdy. The three of us were shoved backward five yards. Through the glass, Molly was way ahead. I saw her blond head disappear. I fought sideways and vaulted over onto the moving walkway. It was going the wrong way. I was carried another five yards before I made it over the moving handgrip onto the other side.\n Now I was going in the right direction, but the walkway was a solid mass of people just standing still on it. Content with the snail\u0027s pace the rubber floor was carrying them. They were standing three abreast. No way through at all. I climbed up onto the narrow handrail and tried to walk along it like a tightrope. I had to crouch because I couldn\u0027t balance. I fell heavily to my right. Got carried five yards the wrong way before I could struggle up. I looked around in panic. Through the glass, I could see Molly was being crowded into the baggage claim. I could see Roscoe and Finlay were way behind me. I was moving slowly the wrong way.\n I didn\u0027t want Molly to go into the baggage claim. She\u0027d flown down here in a hurry. She had urgent news. No way would she have packed a big valise. No way would she have checked any luggage. She shouldn\u0027t be going into the baggage claim. I put my head down and ran. Barged people out of the way. I was traveling against the pace of the walkway. The rubber floor was grabbing at my shoes. Each impact was costing me time. People were yelling in outrage. I didn\u0027t care. I tore through them and left them sprawling. Vaulted off the walkway and clawed through the crowd at the exit doors.\n The baggage claim was a wide low hall, lit with dull yellow lights. I fought my way in through the exit lane. Looking everywhere for Molly. Couldn\u0027t find her. The hall was jammed with people. There must have been a hundred passengers standing around the carousel, three deep. The belt was grinding around under a heavy load of bags. There were ragged lines of luggage carts on the side wall. People were lining up to put quarters in a slot and pull them free. They were wheeling them away through the crowd. Carts were clashing and tangling. People were pushing and shoving.\n I waded into the mass. Shouldered my way through and spun people around, searching for Molly. I\u0027d seen her go in. I hadn\u0027t seen her come out. But she wasn\u0027t in there. I checked every face. I trawled through the whole hall. I let myself be carried outside on the relentless tide. Fought ahead to the exit door. Roscoe was holding tight to the doorframe, battling the flow.\n \"She come out?\" I said.\n \"No,\" she said. \"Finlay\u0027s gone to the end of the corridor. He\u0027s waiting there. I\u0027m waiting here.\"\n We stood there with people pouring past us. Then the crowd coming toward us from the gate was suddenly thinning. The whole planeload was just about through. The last stragglers were strolling down. An old woman in a wheelchair was bringing up the rear. She was being pushed along by an airline employee. The guy had to pause and maneuver his way around something lying in the entrance to the baggage hall. It was a burgundy leather carry-on. It was lying on its side. Its extending handle was still pulled out. From fifteen feet away, I could read the fancy gold monogram on the front. It read: M.B.G.\n Roscoe and I dived back into the baggage claim. In the few minutes I\u0027d been out of there, the place had just about emptied. Not more than a dozen people still in there. Most of them were already hauling their bags off the belt and heading out as we headed in. Within a minute, the hall was deserted. The luggage belt was grinding round, empty. Then it stopped. The hall fell silent. Roscoe and I stood in the sudden quiet and looked at each other.\n The hall had four walls and a floor and a ceiling. There was an entrance door and an exit door. The carousel snaked in through a hole a yard square and snaked out again through a hole a yard square. Both holes were draped with black rubber curtains cut into slats a few inches wide. Next to the carousel was a cargo door. On our side, it was blank. No handle. Locked.\n Roscoe darted back and grabbed Molly Beth\u0027s carry-on. Opened it up. It held a change of clothes and a toilet bag. And a photograph. Eight by ten, in a brassed frame. It was Joe. He looked like me, but a little thinner. A shaved, tanned scalp. A wry, amused smile.\n The hall was filled with the shriek of a warning siren. It sounded for a moment and then the luggage belt graunched back into motion. We stared at it. Stared at the shrouded hole it was coming through. The rubber curtains bellied. A briefcase came out. Burgundy leather. The straps were slashed through. The case was open. It was empty.\n It wobbled mechanically around toward us. We stared at it. Stared at the cut straps. They had been severed with a sharp blade. Severed by somebody in too much of a hurry to click open the catches.\n I leapt onto the moving carousel. Ran back against the belt\u0027s lurching motion and dove like a swimmer headfirst through the rubber slats shrouding the yard-square hole. I landed hard and the belt started to drag me back out. I scrambled and crawled like a kid on my hands and knees. Rolled off and jumped up. I was in a loading bay. Deserted. The afternoon blazed outside. There was a stink of kerosene and diesel fuel from the baggage trains hauling in from the planes on the tarmac.\n All around me were tall piles of forlorn cargo and forgotten suitcases. They were all stacked in three-sided storage bays. The rubber floor was littered with old labels and long bar codes. The place was like a filthy maze. I dodged and skidded about, hopelessly looking for Molly. I ran behind one tall pile after another. Into one bay and then the next. I grabbed at the metal racking and heaved myself around the tight corners. Glancing around desperately. Nobody there. Nobody anywhere. I ran on, sliding and skidding on the litter.\n I found her left shoe. It was lying on its side at the entrance to a dark bay. I plunged in. Nothing there. I tried the next bay. Nothing there. I held onto the shelving, breathing hard. I had to organize. I ran to the far end of the corridor. Started ducking into each bay in turn. Left and right, left and right, working my way back as fast as I could, in a desperate breathless zigzag.\n I found her right shoe three bays from the end. Then I found her blood. At the entry to the next bay, it was pooled on the floor, sticky, spreading. She was slumped at the back of the bay, on her back in the gloom, jammed between two towers of crates. Just sprawled there on the rubber floor. Blood was pouring out of her. Her gut was torn open. Somebody had jammed a knife in her and ripped it savagely upward under her ribs.\n But she was alive. One pale hand was fluttering. Her lips were flecked with bright bubbles of blood. Her head was still, but her eyes were roving. I ran to her. Cradled her head. She gazed at me. Forced her mouth to work.\n \"Got to get in before Sunday,\" she whispered.\n Then she died in my arms. \n","sourceLink":"https://allnovel.net/killing-floor-jack-reacher-1/page-20.html","bookId":2339,"book":{"id":2339,"title":"Killing Floor (Jack Reacher #1)","description":"Storyline: \n Due to some reason, the article content has been deleted. Please do sympathize ! Please read the other stories. \n Do you like this book you can buy books: \n Killing Floor (Jack Reacher #1) \n Ex-military policeman Jack Reacher is a drifter. He’s just passing through Margrave, Georgia, and in less than an hour, he’s arrested for murder. Not much of a welcome. All Reacher knows is that he didn’t kill anybody. At least not here. Not lately. But he doesn’t stand a chance of convincing anyone. Not in Margrave, Georgia. Not a chance in hell. \n The sleepy, forgotten town of Margrave, Georgia, hasn\u0027t seen a crime in decades, but within the span of three days it witnesses events that leave everyone stunned. An unidentified man is found beaten and shot to death on a lonely country road. The police chief and his wife are butchered on a quiet Sunday morning. Then a bank executive disappears from his home, leaving his keys on the table and his wife frozen with fear. The easiest suspect is Jack Reacher - an outsider, a man just passing through. But Reacher is a tough ex-military policeman, trained to think fast and act faster. When authorities learn the first victim was someone from Reacher\u0027s past, and he cannot convince them of his innocence, his patient self-defense becomes a raging crusade of revenge. With two cops who believe in him - a thoughtful black detective and a woman named Roscoe - he closes in on a ruthless conspiracy hiding behind Margrave\u0027s rural charm. But closing in on him is a team of killers. Step by step, the two teams circle - waiting to see which will be the first to walk onto the killing floor.\n \n","cover":"https://allnovel.net/images/killing-floor-jack-reacher-1.jpg","author":"Lee Child","type":"Mystery","source":"allnovel","link":"https://allnovel.net/killing-floor-jack-reacher-1.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:57:36 AM"}}
