{"id":65524,"no":25,"title":"Page 25","content":"NO EASY WAY TO GET THROUGH THE AIRPORT SECURITY hoops with a sap and a knife and a big metal gun, so I left my camouflage jacket in Finlay\u0027s car and told him to transfer it to the Bentley. He ducked into departures with me and put the best part of seven hundred bucks on his credit card for my round trip ticket on Delta to New York. Then he took off to find the Alabama motel and I went through to the gate for the plane to La Guardia.\n I was airborne for a shade over two hours and in a cab for thirty-five minutes. Arrived in Manhattan just after four-thirty. I\u0027d been there in May and it looked pretty much the same in September. The summer heat was over and the city was back to work. The cab took me over the Triborough Bridge and headed west on 116th. Slid around Morningside Park and dropped me at Columbia University\u0027s main entrance. I went in and found my way to the campus security office. Knocked on the glass.\n A campus policeman checked a clipboard and let me in. Led me through to a room in back and pointed to Professor Kelvin Kelstein. I saw a very old guy, tiny, wizened with age, sporting a huge shock of white hair. He looked exactly like that cleaner I\u0027d seen on the third floor at Warburton, except he was white.\n \"The two Hispanic guys been back?\" I asked the college cop.\n He shook his head.\n \"Haven\u0027t seen them,\" he said. \"The old guy\u0027s office told them that the lunch date was canceled. Maybe they went away.\"\n \"I hope so,\" I said. \"Meanwhile, you\u0027re going to have to watch over this guy for a spell. Give it until Sunday.\"\n \"Why?\" he said. \"What\u0027s going on?\"\n \"Not sure, exactly,\" I said. \"I\u0027m hoping the old guy can tell me.\"\n The guard walked us back to Kelstein\u0027s own office and left us there. It was a small and untidy room crammed full to the ceiling with books and thick journals. Kelstein sat in an old armchair and gestured me to sit opposite him in another.\n \"What exactly happened to Bartholomew?\" he asked.\n \"I don\u0027t know exactly,\" I said. \"Jersey police say he got stabbed during a mugging outside his home.\"\n \"But you remain skeptical?\" Kelstein asked.\n \"My brother made a list of contacts,\" I said. \"You\u0027re the only one of them still alive.\"\n \"Your brother was Mr. Joe Reacher?\" he said.\n I nodded.\n \"He was murdered last Thursday,\" I said. \"I\u0027m trying to find out why.\"\n Kelstein inclined his head and peered out of a grimy window.\n \"I\u0027m sure you know why,\" he said. \"He was an investigator. Clearly he was killed in the course of an investigation. What you need to know is what he was investigating.\"\n \"Can you tell me what that was?\" I said.\n The old professor shook his head.\n \"Only in the most general terms,\" he said. \"I can\u0027t help you with specifics.\"\n \"Didn\u0027t he discuss specifics with you?\" I said.\n \"He used me as a sounding board,\" he said. \"We were speculating together. I enjoyed it tremendously. Your brother Joe was a stimulating companion. He had a keen mind and a very attractive precision in the manner in which he expressed himself. It was a pleasure to work with him.\"\n \"But you didn\u0027t discuss specifics?\" I said again.\n Kelstein cupped his hands like a man holding an empty vessel.\n \"We discussed everything,\" he said. \"But we came to no conclusions.\"\n \"OK,\" I said. \"Can we start at the beginning? The discussion was about counterfeit currency, right?\"\n Kelstein tilted his great head to one side. Looked amused.\n \"Obviously,\" he said. \"What else would Mr. Joe Reacher and I find to discuss?\"\n \"Why you?\" I asked him bluntly.\n The old professor smiled a modest smile which faded into a frown. Then he came up with an ironic grin.\n \"Because I am the biggest counterfeiter in history,\" he said. \"I was going to say I was one of the two biggest in history, but after the events of last night at Princeton, sadly now I alone remain.\"\n \"You and Bartholomew?\" I said. \"You were counterfeiters?\"\n The old guy smiled again.\n \"Not by choice,\" he said. \"During the Second World War, young men like Walter and me ended up with strange occupations. He and I were considered more useful in an intelligence role than in combat. We were drafted into the SIS, which as you know was the very earliest incarnation of the CIA. Other people were responsible for attacking the enemy with guns and bombs. We were handed the job of attacking the enemy with economics. We derived a scheme for shattering the Nazi economy with an assault on the value of its paper currency. Our project manufactured hundreds of billions of counterfeit reichsmarks. Spare bombers littered Germany with them. They came down out of the sky like confetti.\"\n \"Did it work?\" I asked him.\n \"Yes and no,\" he said. \"Certainly, their economy was shattered. Their currency was worthless very quickly. But of course, much of their production used slave labor. Slaves aren\u0027t interested one way or the other whether the content of somebody else\u0027s wage packet is worth anything. And of course, alternative currencies were found. Chocolate, cigarettes, anything. Altogether, it was only a partial success. But it left Walter and me two of history\u0027s greatest forgers. That is, if you use sheer volume as a measure. I can\u0027t claim any great talent for the inky end of the process.\"\n \"So Joe was picking your brains?\" I asked him.\n \"Walter and I became obsessed,\" Kelstein said. \"We studied the history of money forging. It started the day after paper money was first introduced. It\u0027s never gone away. We became experts. We carried on the interest after the war. We developed a loose relationship with the government. Finally, some years ago, a Senate subcommittee commissioned a report from us. With all due modesty, I can claim that it became the Treasury\u0027s anticounterfeiting bible. Your brother was familiar with it, of course. That\u0027s why he was talking to Walter and me.\"\n \"But what was he talking to you about?\" I said.\n \"Joe was a new broom,\" Kelstein said. \"He was brought in to solve problems. He was a very talented man indeed. His job was to eradicate counterfeiting. Now, that\u0027s an impossible job. Walter and I told him that. But he nearly succeeded. He thought hard, and he applied strokes of appealing simplicity. He just about halted all illicit printing within the United States.\"\n I sat in his crowded office and listened to the old guy. Kelstein had known Joe better than I had. He had shared Joe\u0027s hopes and plans. Celebrated his successes. Sympathized over his setbacks. They had talked at length, animatedly, sparking off each other. The last time I had spoken to Joe face to face was very briefly after our mother\u0027s funeral. I hadn\u0027t asked him what he was doing. I\u0027d just seen him as my older brother. Just seen him as Joe. I hadn\u0027t seen the reality of his life as a senior agent, with hundreds of people under him, trusted by the White House to solve big problems, capable of impressing a smart old bird like Kelstein. I sat there in the armchair and felt bad. I\u0027d lost something I never knew I\u0027d had.\n \"His systems were brilliant,\" Kelstein said. \"His analysis was acute. He targeted ink and paper. In the end, it all boils down to ink and paper, doesn\u0027t it? If anybody bought the sort of ink or paper that could be used to forge a banknote, Joe\u0027s people knew within hours. He swept people up within days. Inside the States, he reduced counterfeiting activity by ninety percent. And he tracked the remaining ten percent so vigorously he got almost all of them before they\u0027d even distributed the fakes. He impressed me greatly.\"\n \"So what was the problem?\" I asked him.\n Kelstein made a couple of precise little motions with his small white hands, like he was moving one scenario aside and introducing another.\n \"The problem lay abroad,\" he said. \"Outside the United States. The situation there is very different. Did you know there are twice as many dollars outside the U.S. as inside?\"\n I nodded. I summarized what Molly had told me about foreign holdings. The trust and the faith. The fear of a sudden collapse in the desirability of the dollar. Kelstein was nodding away like I was his student and he liked my thesis.\n \"Quite so,\" he said. \"It\u0027s more about politics than crime. In the end, a government\u0027s primary duty is to defend the value of its currency. We have two hundred and sixty billion dollars abroad. The dollar is the unofficial currency of dozens of nations. In the new Russia, for instance, there are more dollars than rubles. In effect, it\u0027s like Washington has raised a massive foreign loan. Raised any other way, that loan would cost us twenty-six billion dollars a year in interest payments alone. But this way, it costs us nothing at all except what we spend on printing pictures of dead politicians on little pieces of paper. That\u0027s what it\u0027s all about, Mr. Reacher. Printing currency for foreigners to buy is the best racket a government can get into. So Joe\u0027s job in reality was worth twenty-six billion dollars a year to this country. And he pursued it with an energy appropriate to those high stakes.\"\n \"So where was the problem?\" I said. \"Geographically?\"\n \"Two main places,\" Kelstein said. \"First, the Middle East. Joe believed there was a plant in the Bekaa Valley that turned out fake hundreds which were practically perfect. But there was very little he could do about it. Have you been there?\"\n I shook my head. I\u0027d been stationed in Beirut for a while. I had known a few people who had gone out to the Bekaa Valley for one reason or another. Not too many of them had come back.\n \"Syrian-controlled Lebanon,\" Kelstein said. \"Joe called it the badlands. They do everything there. Training camps for the world\u0027s terrorists, drug processing laboratories, you name it, they\u0027ve got it. Including a pretty good replica of our own Bureau of Printing and Engraving.\"\n I thought about it. Thought about my time there.\n \"Protected by who?\" I asked him.\n Kelstein smiled at me again. Nodded.\n \"A perceptive question,\" he said. \"You instinctively grasp that an operation of that size is so visible, so complex, that it must be in some way sponsored. Joe believed it was protected by, or maybe even owned by, the Syrian government. Therefore his involvement was marginal. His conclusion was that the only solution was diplomatic. Failing that, he was in favor of air strikes against it. We may live to see such a solution one day.\"\n \"And the second place?\" I asked him.\n He pointed his finger at his grimy office window. Aiming south down Amsterdam Avenue.\n \"South America,\" he said. \"The second source is Venezuela. Joe had located it. That is what he was working on. Absolutely outstanding counterfeit hundred-dollar bills are coming out of Venezuela. But strictly private enterprise. No suggestion of government involvement.\"\n I nodded.\n \"We got that far,\" I said. \"A guy called Kliner, based down in Georgia where Joe was killed.\"\n \"Quite so,\" Kelstein said. \"The ingenious Mr. Kliner. It\u0027s his operation. He\u0027s running the whole thing. We knew that for certain. How is he?\"\n \"He\u0027s panicking,\" I said. \"He\u0027s killing people.\"\n Kelstein nodded sadly.\n \"We thought Kliner might panic,\" he said. \"He\u0027s protecting an outstanding operation. The very best we\u0027ve ever seen.\"\n \"The best?\" I said.\n Kelstein nodded enthusiastically.\n \"Outstanding,\" he said again. \"How much do you know about counterfeiting?\"\n I shrugged at him.\n \"More than I did last week,\" I said. \"But not enough, I guess.\"\n Kelstein nodded and shifted his frail weight forward in his chair. His eyes lit up. He was about to start a lecture on his favorite subject.\n \"There are two sorts of counterfeiters,\" he said. \"The bad ones and the good ones. The good ones do it properly. Do you know the difference between intaglio and lithography?\"\n I shrugged and shook my head. Kelstein scooped up a magazine from a pile and handed it to me. It was a quarterly bulletin from a history society.\n \"Open it,\" he said. \"Any page will do. Run your fingers over the paper. It\u0027s smooth, isn\u0027t it? That\u0027s lithographic printing. That\u0027s how virtually everything is printed. Books, magazines, newspapers, everything. An inked roller passes over the blank paper. But intaglio is different.\"\n He suddenly clapped his hands together. I jumped. The sound was very loud in his quiet office.\n \"That\u0027s intaglio,\" he said. \"A metal plate is smashed into the paper with considerable force. It leaves a definite embossed feel to the product. The printed image looks three dimensional. It feels three dimensional. It\u0027s unmistakable.\"\n He eased himself up and took his wallet out of his hip pocket. Pulled out a ten-dollar bill. Passed it over to me.\n \"Can you feel it?\" he asked. \"The metal plates are nickel, coated with chromium. Fine lines are engraved into the chromium and the lines are filled with ink. The plate hits the paper and the ink is printed onto its topmost surface. Understand? The ink is in the valleys of the plate, so it\u0027s transferred to the ridges on the paper. Intaglio printing is the only way to get that raised image. The only way to make the forgery feel right. It\u0027s how the real thing is done.\"\n \"What about the ink?\" I said.\n \"There are three colors,\" he said. \"Black, and two greens. The back of the bill is printed first, with the darker green. Then the paper is left to dry, and the next day, the front is printed with the black ink. That dries, and the front is printed again, with the lighter green. That\u0027s the other stuff you see there on the front, including the serial number. But the lighter green is printed by a different process, called letterpress. It\u0027s a stamping action, the same as intaglio, but the ink is stamped into the valleys on the paper, not onto the peaks.\"\n I nodded and looked at the ten-dollar bill, front and back. Ran my fingers over it carefully. I\u0027d never really studied one before.\n \"So, four problems,\" Kelstein said. \"The press, the plates, the inks, and the paper. The press can be bought, new or used, anywhere in the world. There are hundreds of sources. Most countries print money and securities and bonds on them. So the presses are obtainable abroad. They can even be improvised. Joe found one intaglio operation in Thailand which was using a converted squid-processing machine. Their hundreds were absolutely immaculate.\"\n \"What about the plates?\" I asked him.\n \"Plates are problem number two,\" he said. \"But it\u0027s a matter of talent. There are people in the world who can forge Old Master paintings and there are people who can play a Mozart piano concerto after hearing it once. And certainly there are engravers who can reproduce banknotes. It\u0027s a perfectly logical proposition, isn\u0027t it? If a human being in Washington can engrave the original, certainly there\u0027s a human being somewhere else who can copy it. But they\u0027re rare. Really good copyists, rarer still. There are a few in Armenia. The Thai operation using the squid-processor got a Malaysian to make the plates.\"\n \"OK,\" I said. \"So Kliner has bought a press, and he\u0027s found an engraver. What about the inks?\"\n \"The inks are problem number three,\" he said. \"You can\u0027t buy anything vaguely like them in the U.S. Joe saw to that. But abroad, they\u0027re available. As I said, virtually every country in the world has its own banknote printing industry. And obviously, Joe couldn\u0027t enforce his systems in every country in the world. So the inks are easy enough to find. The greens are only a question of color. They mix them and experiment until they get them right. The black ink is magnetic, did you know that?\"\n I shook my head again. Looked at the sawbuck closely. Kelstein smiled.\n \"You can\u0027t see it,\" he said. \"A liquid ferrous chemical is mixed with the black ink. That\u0027s how electronic money counters work. They scan the engraving down the center of the portrait, and the machine reads the signal it gives off, like a tape head reads the sounds on a music cassette.\"\n \"And they can get that ink?\" I said.\n \"Anywhere in the world,\" he said. \"Everybody uses it. We lag behind other countries. We don\u0027t like to admit we worry about counterfeiting.\"\n I remembered what Molly had said. Faith and trust. I nodded.\n \"The currency must look stable,\" Kelstein said. \"That\u0027s why we\u0027re so reluctant to change it. It\u0027s got to look reliable, solid, unchanging. Turn that ten over and take a look.\"\n I looked at the green picture on the back of the ten. The Treasury Building was standing in a deserted street. Only one car was driving past. It looked like a Model-T Ford.\n \"Hardly changed since 1929,\" Kelstein said. \"Psychologically, it\u0027s very important. We choose to put the appearance of dependability before security. It made Joe\u0027s job very difficult.\"\n I nodded again.\n \"Right,\" I said. \"So we\u0027ve covered the press, the plates, and the inks. What about the paper?\"\n Kelstein brightened up and clasped his small hands like we\u0027d reached the really interesting part.\n \"Paper is problem number four,\" he said. \"Actually, we should really say it\u0027s problem number one. It\u0027s by far the biggest problem. It\u0027s the thing Joe and I couldn\u0027t understand about Kliner\u0027s operation.\"\n \"Why not?\" I asked him.\n \"Because their paper is perfect,\" he said. \"It\u0027s one hundred percent perfect. Their paper is better than their printing. And that is absolutely unheard of.\"\n He started shaking his great white head in wonderment. Like he was lost in admiration for Kliner\u0027s achievement. We sat there, knee to knee in the old armchairs in silence.\n \"Perfect?\" I prompted him.\n He nodded and started up with the lecture again.\n \"It\u0027s unheard of,\" he said again. \"The paper is the hardest part of the whole process. Don\u0027t forget, we\u0027re not talking about some amateur thing here. We\u0027re talking about an industrial-scale operation. In a year, they\u0027re printing four billion dollars\u0027 worth of hundreds.\"\n \"That many?\" I said, surprised.\n \"Four billion,\" he said again. \"About the same as the Lebanon operation. Those were Joe\u0027s figures. He was in a position to know. And that makes it inexplicable. Four billion in hundreds is forty million banknotes. That\u0027s a lot of paper. That\u0027s a completely inexplicable amount of paper, Mr. Reacher. And their paper is perfect.\"\n \"What sort of paper would they need?\" I asked him.\n He reached over and took the ten-dollar bill back from me. Crumpled it and pulled it and snapped it.\n \"It\u0027s a blend of fibers,\" he said. \"Very clever and entirely unique. About eighty percent cotton, about twenty percent linen. No wood pulp in it at all. It\u0027s got more in common with the shirt on your back than with a newspaper, for instance. It\u0027s got a very clever chemical colorant in it, to give it a unique cream tint. And it\u0027s got random red and blue polymer threads pulped in, as fine as silk. Currency stock is wonderful paper. Durable, lasts for years, won\u0027t come apart in water, hot or cold. Absolutely precise absorbency, capable of accepting the finest engraving the platemakers can achieve.\"\n \"So the paper would be difficult to copy?\" I said.\n \"Virtually impossible,\" he said. \"In a way, it\u0027s so difficult to copy that even the official government supplier can\u0027t copy it. They have tremendous difficulty just keeping it consistent, batch to batch, and they\u0027re by far the most sophisticated papermaker in the entire world.\"\n I ran it all through in my head. Press, plates, ink and paper.\n \"So the paper supply is really the key to all this?\" I said.\n Kelstein nodded ruefully.\n \"That was our conclusion,\" he said. \"We agreed the paper supply was crucial, and we agreed we had no idea how they were managing it. That\u0027s why I can\u0027t really help you. I couldn\u0027t help Joe, and I can\u0027t help you. I\u0027m terribly sorry.\"\n I looked at him.\n \"They\u0027ve got a warehouse full of something,\" I said. \"Could that be paper?\"\n He snorted in derision. Snapped his great head around toward me.\n \"Don\u0027t you listen?\" he said. \"Currency stock is unobtainable. Completely unobtainable. You couldn\u0027t get forty sheets of currency stock, never mind forty million sheets. The whole thing is a total mystery. Joe and Walter and I racked our brains for a year and we came up with nothing.\"\n \"I think Bartholomew came up with something,\" I said.\n Kelstein nodded sadly. He levered himself slowly out of his chair and stepped to his desk. Pressed the replay button on his telephone answering machine. The room was filled with an electronic beep, then with the sound of a dead man\u0027s voice.\n \"Kelstein?\" the voice said. \"Bartholomew here. It\u0027s Thursday night, late. I\u0027m going to call you in the morning and I\u0027m going to tell you the answer. I knew I\u0027d beat you to it. Goodnight, old man.\"\n The voice had excitement in it. Kelstein stood there and gazed into space as if Bartholomew\u0027s spirit was hanging there in the still air. He looked upset. I couldn\u0027t tell if that was because his old colleague was dead, or because his old colleague had beaten him to the answer.\n \"Poor Walter,\" he said. \"I knew him fifty-six years.\"\n I sat quietly for a spell. Then I stood up as well.\n \"I\u0027ll figure it out,\" I said.\n Kelstein put his head on one side and looked at me sharply.\n \"Do you really think you will?\" he said. \"When Joe couldn\u0027t?\"\n I shrugged at the old guy.\n \"Maybe Joe did,\" I said. \"We don\u0027t know what he\u0027d figured out before they got him. Anyway, right now I\u0027m going back to Georgia. Carry on the search.\"\n Kelstein nodded and sighed. He looked stressed.\n \"Good luck, Mr. Reacher,\" he said. \"I hope you finish your brother\u0027s business. Perhaps you will. He spoke of you often. He liked you, you know.\"\n \"He spoke of me?\" I said.\n \"Often,\" the old guy said again. \"He was very fond of you. He was sorry your job kept you so far away.\"\n For a moment I couldn\u0027t speak. I felt unbearably guilty. Years would pass, I wouldn\u0027t think about him. But he was thinking about me?\n \"He was older, but you looked after him,\" he said. \"That\u0027s what Joe told me. He said you were very fierce. Very tough. I guess if Joe wanted anybody to take care of the Kliners, he\u0027d have nominated you.\"\n I nodded.\n \"I\u0027m out of here,\" I said.\n I shook his frail hand and left him with the cops in the security office.\n I WAS TRYING TO FIGURE WHERE KLINER WAS GETTING HIS perfect paper, and I was trying to figure if I could get the six o\u0027clock flight back to Atlanta if I hurried, and I was trying to ignore what Kelstein had told me about Joe speaking fondly of me. The streets were clogged and I was busy thinking about it all and scanning for an empty cab, which was why I didn\u0027t notice two Hispanic guys strolling up to me. But what I did notice was the gun the leading guy showed me. It was a small automatic held in a small hand, concealed under one of those khaki raincoats city people carry on their arms in September.\n He showed me the weapon and his partner signaled to a car waiting twenty yards away at the curb. The car lurched forward and the partner stood ready to open a door like the top-hatted guys do outside the expensive apartment houses up there. I was looking at the gun and looking at the car, making choices.\n \"Get into the car,\" the guy with the gun said softly. \"Or I\u0027ll shoot you.\"\n I stood there and all that was passing through my mind was that I might miss my flight. I was trying to remember when the next non-stop left. Seven o\u0027clock, I thought.\n \"In the car,\" the guy said again.\n I was pretty sure he wouldn\u0027t fire the gun on the street. It was a small gun, but there was no silencer on it. It would make a hell of a noise, and it was a crowded street. The other guy\u0027s hands were empty. He maybe had a gun in his pocket. There was just the driver in the car. Probably a gun on the seat beside him. I was unarmed. My jacket with the blackjack and the knife and the Desert Eagle was eight hundred miles away in Atlanta. Choices.\n I chose not to get into the car. I just stood there in the street, gambling with my life that the guy wouldn\u0027t shoot in public. He stood there, holding the raincoat out toward me. The car stopped next to us. His partner stood on the other side of me. They were small guys. The both of them wouldn\u0027t have made one of me. The car waited, idling at the curb. Nobody moved. We were just frozen there like some kind of a display in a store window. Like new fashions for the fall, old army fatigues put with Burberry raincoats.\n It gave the two guys a big problem. In a situation like that, there\u0027s a split-second opportunity to carry out your threat. If you say you\u0027re going to shoot, you\u0027ve got to shoot. If you don\u0027t, you\u0027re a spent force. Your bluff is called. If you don\u0027t shoot, you\u0027re nothing. And the guy didn\u0027t shoot. He just stood there, twisted up with indecision. People swirled around us on the busy sidewalk. Cars were blasting their horns at the guy stopped at the curb.\n They were smart guys. Smart enough not to shoot me on a busy New York street. Smart enough to know I\u0027d called their bluff. Smart enough to never again make a threat they weren\u0027t going to keep. But not smart enough to walk away. They just stood there.\n So I swayed backward, as if I was going to take a step away. The gun under the raincoat prodded forward at me. I tracked the movement and grabbed the little guy\u0027s wrist with my left hand. Pulled the gun around behind me and hugged the guy close with my right arm around his shoulders. We looked like we were dancing the waltz together or we were lovers at a train station. Then I fell forward and crushed him against the car. All the time I was squeezing his wrist as hard as I could, with my nails dug in. Left-handed, but it was hurting him. My weight leaning up on him was giving him a struggle to breathe.\n His partner still had his hand on the car door. His glance was darting back and forth. Then his other hand was going for his pocket. So I jackknifed my weight back and rolled around my guy\u0027s gun hand and threw him against the car. And then I ran like hell. In five strides I was lost in the crowd. I dodged and barged my way through the mass of people. Ducked in and out of doorways and ran through shrieking and honking traffic across the streets. The two guys stayed with me for a spell, but the traffic eventually stopped them. They weren\u0027t taking the risks I was taking.\n I GOT A CAB EIGHT BLOCKS AWAY FROM WHERE I HAD started and made the six o\u0027clock non-stop, La Guardia to Atlanta. Going back it took longer, for some reason. I was sitting there for two and a half hours. I thought about Joe all the way through the airspace above Jersey, Maryland and Virginia. Above the Carolinas and into Georgia, I thought about Roscoe. I wanted her back. I missed her like crazy.\n We came down through storm clouds ten miles thick. The Atlanta evening gloom was turned to pitch black by the clouds. Looked like an enormous weather system was rolling in from somewhere. When we got off the plane, the air in the little tunnel was thick and heavy, and smelled of storm as well as kerosene.\n I picked up the Bentley key from the information counter in the arrivals hall. It was in an envelope with a parking claim. I walked out to find the car. Felt a warm wind blowing out of the north. The storm was going to be a big one. I could feel the voltage building up for the lightning. I found the car in the short-term lot. The rear windows were all tinted black. The guy hadn\u0027t gotten around to doing the front side glass or the windshield. It made the car look like something royalty might use, with a chauffeur driving them. My jacket was laid out in the trunk. I put it on and felt the reassuring weight of the weaponry in the pockets again. I got in the driver\u0027s seat and nosed out of the lot and headed south down the highway in the dark. It was nine o\u0027clock, Friday evening. Maybe thirty-six hours before they could start shipping the stockpile out on Sunday.\n IT WAS TEN O\u0027CLOCK WHEN I GOT BACK TO MARGRAVE. Thirty-five hours to go. I had spent the hour thinking about some stuff we had learned back in Staff College. We\u0027d studied military philosophies, mostly written by those old Krauts who loved all that stuff. I hadn\u0027t paid much attention, but I remember some big thing which said sooner or later, you\u0027ve got to engage the enemy\u0027s main force. You don\u0027t win the war unless you do that. Sooner or later, you seek out their main force, and you take it on, and you destroy it.\n I knew their main force had started with ten people. Hubble had told me that. Then there were nine, after they ditched Morrison. I knew about the two Kliners, Teale, and Baker. That left me five more names to find. I smiled to myself. Pulled off the county road into Eno\u0027s gravel lot. Parked up on the far end of the row and got out. Stretched and yawned in the night air. The storm was holding off, but it was going to break. The air was still thick and heavy. I could still feel the voltage in the clouds. I could still feel the warm wind on my back. I got into the back of the car. Stretched out on the leather bench and went to sleep. I wanted to get an hour, hour and a half.\n I started dreaming about John Lee Hooker. In the old days, before he got famous again. He had an old steel-strung guitar, played it sitting on a little stool. The stool was placed on a square of wooden board. He used to press old beer bottle caps into the soles of his shoes to make them noisy. Like homemade tap shoes. He\u0027d sit on his stool and play that guitar with his bold, choppy style. All the while pounding on the wooden board with his noisy shoes. I was dreaming of him pounding out the rhythm with his shoes on that old board.\n But it wasn\u0027t John Lee\u0027s shoes making the noise. It was somebody knocking on the Bentley\u0027s windshield. I snapped awake and struggled up. Sergeant Baker was looking in at me. The big chrome clock on the dash showed ten thirty. I\u0027d slept a half hour. That was all I was going to get.\n First thing I did was to change my plan. A much better one had fallen right into my lap. The old Krauts would have approved. Tactical flexibility was big with them. Second thing I did was to put my hand in my pocket and snick the safety off the Desert Eagle. Then I got out of the opposite door and looked along the car roof at Baker. He was using his friendly grin, gold tooth and all.\n \"How you doing?\" he said. \"Sleeping in a public place, around here you could get arrested for vagrancy.\"\n I grinned a friendly grin right back at him.\n \"Highway safety,\" I said. \"They tell you don\u0027t drive if you\u0027re tired. Pull off and take a nap, right?\"\n \"Come on in and I\u0027ll buy you a cup of coffee,\" he said. \"You want to wake up, Eno\u0027s coffee should do it for you.\"\n I locked the car. Kept my hand in my pocket. We crunched over the gravel and into the diner. Slid into the end booth. The woman with the glasses brought us coffee. We hadn\u0027t asked. She just seemed to know.\n \"So how you doing?\" Baker said. \"Feeling bad about your brother?\"\n I shrugged at him. Drank my coffee left-handed. My right hand was wrapped around the Desert Eagle in my pocket.\n \"We weren\u0027t close,\" I said.\n Baker nodded.\n \"Roscoe still helping the Bureau out?\" he said.\n \"Guess so,\" I said.\n \"And where\u0027s old Finlay tonight?\" he asked.\n \"Jacksonville,\" I said. \"He had to go to Florida, check something out.\"\n \"Jacksonville?\" he said. \"What does he need to check out in Jacksonville?\"\n I shrugged again. Sipped my coffee.\n \"Search me,\" I said. \"He doesn\u0027t tell me anything. I\u0027m not on the payroll. I\u0027m just an errand boy. Now he\u0027s got me running up to Hubble\u0027s place to fetch him something.\"\n \"Hubble\u0027s place?\" Baker said. \"What you got to fetch from there?\"\n \"Some old papers,\" I said. \"Anything I can find, I guess.\"\n \"Then what?\" he said. \"You going to Florida too?\"\n I shook my head. Sipped more coffee.\n \"Finlay told me to stick them in the mail,\" I said. \"Some Washington address. I\u0027m going to sleep up at Hubble\u0027s place and mail them in the morning.\"\n Baker nodded slowly. Then he flashed his friendly grin again. But it was forced. We finished up our coffee. Baker dropped a couple of bucks on the table and we slid out and left. He got into his patrol car. Waved at me as he drove off. I let him go ahead and strolled over the gravel to the Bentley. I rolled south to the end of the dark little town and made the right turn up Beckman Drive. \n","sourceLink":"https://allnovel.net/killing-floor-jack-reacher-1/page-25.html","bookId":2339,"book":{"id":2339,"title":"Killing Floor (Jack Reacher #1)","description":"Storyline: \n Due to some reason, the article content has been deleted. Please do sympathize ! Please read the other stories. \n Do you like this book you can buy books: \n Killing Floor (Jack Reacher #1) \n Ex-military policeman Jack Reacher is a drifter. He’s just passing through Margrave, Georgia, and in less than an hour, he’s arrested for murder. Not much of a welcome. All Reacher knows is that he didn’t kill anybody. At least not here. Not lately. But he doesn’t stand a chance of convincing anyone. Not in Margrave, Georgia. Not a chance in hell. \n The sleepy, forgotten town of Margrave, Georgia, hasn\u0027t seen a crime in decades, but within the span of three days it witnesses events that leave everyone stunned. An unidentified man is found beaten and shot to death on a lonely country road. The police chief and his wife are butchered on a quiet Sunday morning. Then a bank executive disappears from his home, leaving his keys on the table and his wife frozen with fear. The easiest suspect is Jack Reacher - an outsider, a man just passing through. But Reacher is a tough ex-military policeman, trained to think fast and act faster. When authorities learn the first victim was someone from Reacher\u0027s past, and he cannot convince them of his innocence, his patient self-defense becomes a raging crusade of revenge. With two cops who believe in him - a thoughtful black detective and a woman named Roscoe - he closes in on a ruthless conspiracy hiding behind Margrave\u0027s rural charm. But closing in on him is a team of killers. Step by step, the two teams circle - waiting to see which will be the first to walk onto the killing floor.\n \n","cover":"https://allnovel.net/images/killing-floor-jack-reacher-1.jpg","author":"Lee Child","type":"Mystery","source":"allnovel","link":"https://allnovel.net/killing-floor-jack-reacher-1.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:57:36 AM"}}
