{"id":30668,"no":9,"title":"CHAP. VI.","content":"Of the Greenland Sea Animals, and Sea Fowls and Fishes. \\n\\n \\n\\n THE Greenland Sea abounds in different sorts of animals, fowls, and fishes, of which the whale bears the sway, and is of divers kinds, shapes, and sizes. Some are called the finned whales, from the fins they have upon their back near the tail; but these are not much valued, yielding but little fat or blubber, and that of the meaner sort; they consist of nothing but lean flesh, sinews, and bones. They are of a long, round, and slender shape, very{67} dangerous to meddle with, for they rage and lay about them most furiously with their tail, so that nobody cares to come at them, or catch them. The Greenlanders make much of them, on account of their flesh, which, with them, passes for dainty cheer. The other sort of whales are reckoned the best for their fat, and fins or whalebones. These differ from the first sort, in that they have no fin on the back towards the tail, but two lesser ones near the eyes, and are covered with a thick black skin, marbled with white strokes. With these side fins they swim with an incredible swiftness. The tail is commonly three or four fathoms broad. The head makes up one-third of the whole fish. The jaws are covered, both above and beneath, with a kind of short hair. At the bottom of the jaws are placed the so called barders, or whalebones, which serve him instead of teeth, of which he has none. They are of different colours, some brown, some black, and others yellow with white streaks. Within the mouth, the barders or whalebones are covered{68} with hair like horse-hair, chiefly those that inclose the tongue. Some of them are bent like a scymitar, or sabre. The smallest are ranged the foremost in the mouth, and the hindermost near the throat; the broadest and largest are in the middle, some of them two fathoms long, by which we may judge of the vast bigness of this animal. On each side there are commonly two hundred and fifty, in all five hundred pieces. They are set in a broad row, as in a sheaf, one close to the other, bent like a crescent or half-moon, broadest at the root, which is of a tough and grisly matter, of a whitish colour, fastened to the upper part of the jaws near the throat, and they grow smaller towards the end, which is pointed; they are also covered with hair, that they may not hurt the tongue. The undermost jaw is commonly white, to which the tongue is fastened, inclosed in the barders, or long whale bones; it is very large, sometimes about eighteen feet, and sometimes more, of a white colour, with black spots, of a soft, fat, and spungy matter. The{69} whale has a bunch on the top of his head, in which are two spouts or pipes, parallel one to the other, and somewhat bent, like the holes upon a fiddle. Through these he receives the air, and spouts out the water, which he takes in at his mouth, and is forced upwards through these holes in very large quantities, and with such violence and noise, that it is heard at a great distance, by which, in hazy weather, he is known to be near, especially when he finds himself wounded, for then he rages most furiously, and the noise of his spouting is so loud, that some have resembled it to the roaring of the sea in a storm, or the firing of great guns, His eyes are placed between the bunch and the side fins; they are not larger than those of an ox, and are armed with eyebrows. \\n\\n \\n\\n The penis of a whale is a strong sinew, seven or eight, and sometimes fourteen feet long, in proportion to his bulk: it is covered with a sheath, in which it lies hidden, so that you see but little of it: the nature of the female is like that of the four-footed animals: she has two{70} breasts with teats like a cow; some white, others stained with black or blue spots. In their spawning time their breasts are larger than usual; and when they couple together, they reach their head above water, to fetch breath, and to cool the heat contracted by that action. It is said, that they never bring forth more than two young ones at a spawning, which they suck with their teats. The spawn of the whale, while it is fresh, is clammy and gluish, so that it may be drawn out in threads like wax or pitch; it has no relation to that which we call spermaceti, for it is soon corrupted and by no art can be preserved. \\n\\n \\n\\n These sea animals, or rather monsters, are of different sizes and bulks; some yield one hundred, and some two or three hundred tuns of fat or blubber. The fat lies between the skin and the flesh, six or eight inches thick, especially upon the back and under the belly. The thickest and strongest sinews are in the tail, which serves him for a rudder, as his fins do for oars, wherewith he swims with an astonishing{71} swiftness, proportioned to his bulk, leaving a track in the sea, like a great ship; and this is called his wake, by which he is often followed. \\n\\n \\n\\n These sea monsters are as shy and timorous as they are huge and bulky, for as soon as they hear a boat rowing, and perceive any body’s approach, they immediately shoot under water and plunge into the deep; but when they find themselves in danger, then they shew their great and surprising strength; for then they break to pieces whatever comes in their way, and if they should hit a boat, they would beat it in a thousand pieces. According to the relation of the whale-catchers, the whale, being struck, will run away with the line some hundreds of fathoms long, faster than a ship under full sail. Now one would think, that such a vast body should need many smaller fishes and sea animals to feed upon; but on the contrary, his food is nothing but a sort of blubber, called pulmo marinus, or whale food, which is of a dark brown colour, with two brims or{72} flaps, with which it moves in the water, with such slowness that one may easily lay hold of it, and get it out of the water. It is like a jelly, soft and slippery, so that if you crush it between your fingers you find it fat and greasy like train oil. The Greenland seas abound in it, which allures and draws this kind of whales thither in search of it; for as their swallow or throat is very narrow (being but four inches in diameter), and the smaller whalebones reaching down his throat, they cannot swallow any hard or large piece of other food, having no teeth to chew it with, so that this sort of nourishment suits them best, their mouth being large and wide to receive a great quantity, by opening it and shutting it again, that nature has provided them with the barders or whalebones, which by their closeness only give passage to the water, like a sieve, keeping back the aliment. Here we ought to praise the wise and kind providence of an Almighty Creator, who has made such mean things suffice for the maintenance of so vast an animal.{73} \\n\\n \\n\\n Next to this there is another sort of whales, called the North Capers, from the place of their abode, which is about the North cape of Norway, though they also frequent the coasts of Iceland, Greenland, and sundry other seas, going in search of their prey, which is herring and other small fish, that resort in abundance to those coasts. It has been observed, that some of these North Cape whales have had more than a tun of herrings in their belly. This kind of whales has this common with the former called fin-whale, in that it is very swift and quick in its motion, and keeps off from the shore in the main sea, as fearing to become a prey to its enemies, if it should venture too near the shore. His fat is tougher and harder than that of the great bay whale; neither are his barders or bones so long and valuable, for which reason he is neglected. \\n\\n \\n\\n The fourth sort is the sword-fish, so called from a long and broad bone, which grows out of the end of his snout on both sides, indented like a saw. He has got two fins upon his back,{74} and four under the belly, on each side two: those on the back are the largest; those under the belly are placed just under the first of the back: his tail broad and flat underneath, and above pointed, but not split or cloved. From the hindermost fin of the back he grows smaller: his nostrils are of an oblong shape: the eyes are placed on the top of his head, just above his mouth. There are different sizes of sword-fish, some of twenty feet, some more, some less. This is the greatest enemy the true whale has to deal with, who gives him fierce battles; and, having vanquished and killed him, he contents himself with eating the tongue of the whale, leaving the rest of the huge carcase for the prey and spoils of the morses and sea birds. \\n\\n \\n\\n The cachelot or pot-fish is a fifth species of whales, whose shape is somewhat different from that of other whales, in that the upper part of his head or skull is much bigger and stronger built; his spouts or pipes are placed on the forehead, whereas other whales have them on{75} the hinder part of the head: his under jaw is armed with a row of teeth which are but short: his tongue is thin and pointed, and of a yellowish colour: he has but one eye on the side of the head, which makes him of easy access to the Greenlanders, who attack him on his blind side. Of his skull that wrongly so called spermaceti is prepared, one yielding twenty to twenty-four tuns thereof. The rest of the body and the tail are like unto those of other whales. He is of a brownish colour on the back, and white under the belly: he is of different sizes, from fifty to seventy feet long. \\n\\n \\n\\n Then comes the white fish, whose shape is not unlike that of the great bay whale, having no fins upon the back, but underneath two large ones; the tail like a whale; his spouts, through which he breathes and throws out the water, are the same; he has likewise a bunch on the head: his colour is of a fading yellow; he is commonly from twelve to sixteen feet in length, and is exceeding fat. The train of his blubber is as clear as the clearest oil: his flesh{76} as well as the fat has no bad taste, and when it is marinated with vinegar and salt, it is as well tasted as any pork whatsoever. The fins also and the tail, pickled or sauced, are good eating. This fish is so far from being shy, that whole droves are seen about the ships at sea: the Greenlanders catch numbers of them, of which they make grand cheer. \\n\\n \\n\\n There is yet another smaller sort of whales, called but-heads, from the form of its head, which at the snout is flat, like a but’s end: he has a fin upon his back towards the tail, and two side fins: his tail is like to that of a whale. In the hinder part of the head he has a pipe to fetch air, and spout the water through, which he does not spout out with that force the whale does: his size is from fourteen to twenty feet: he follows ships under sail with a fair wind, and seems to run for a wager with them; whereas, on the contrary, other whales avoid and fly from them. Their jumping, as well as that of fishes and sea animals, forebodes boisterous and stormy weather.{77} \\n\\n \\n\\n Among the different kinds of whales some reckon the unicorn, as they commonly call him, from a long small horn that grows out of his snout; but his right name is nar-whale. It is a pretty large fish, eighteen or twenty feet long, and yields good fat: his skin is black and smooth without hair; he has one fin on each side, at the beginning of his belly: his head is pointed, and out of his snout on the left side proceeds the horn, which is round, turned, with a sharp taper point; the greatest length of it is fourteen or fifteen feet, and thick as your arm. The root of it goes very deep into the head, to strengthen it for supporting so heavy a burthen. The horn is of a fine, white, and compact matter, wherefore it weighs much: the third part of it, beginning from the root, is commonly hollow; and there are some very solid at the root, and above it grows more and more hollow. On the right side of the head there lies another shorter horn hidden, which does not grow out of the skin, and it cannot be conceived for what end the All-wise Creator has ordained it: he has, like other whales, two pipes or spouts which{78} terminate in one, through which he breathes and fetches air, when he comes up out of the sea with his head. Here I must observe to you, that when the whale comes up to fetch air, it is not water he throws out at the spouts, as the common notion runs; but his breath, which resembles water forced out of a great spout. As for the rest of the unicorn or nar-whale’s body, it is perfectly of the same shape as that of other whales. \\n\\n \\n\\n Concerning this animal’s horn, which has given occasion to so many disputes, whether it be a horn properly so called, or a tooth, my reader must allow me a little digression, to make these gentlemen disputants aware of their mistake, who pretend it to be a tooth and not a horn, being placed on one side of the snout, and not on the top of the forehead, where other animals wear their horns. (See Wormius’s Museum, l. iii. ch. 14.) But it appears clearly to all beholders, that it neither has the shape of a tooth, such as other sea animals are endowed with, nor has its root in the jaws, the ordinary place of teeth, but grows out of the snout. And{79} besides, the absurdity is much greater to hold and maintain, that animals wear teeth on the snout or head, like horns: or dare anybody deny, that the whale’s spouts are his nostrils, through which he fetches breath, because they are on the top of his head; or question, that the clap-mysses’ (a large kind of seal) eyes are such, because they are placed in the hindermost part of the head? Ought we not rather to think, that an All-wise Creator has placed this horn horizontally, to the end that it may not be of any hinderance to the course and swimming of this animal in the water, which would happen if it rose vertically? Furthermore, this horn serves many other ends, as to stir up his food from the bottom of the sea, as he is said to feed upon small sea-weeds, and likewise therewith to bore holes in the ice, in order to fetch fresh air. The inference these gentlemen are pleased to draw from the generality of fishes and sea animals having no such paws or claws as land animals have, is as lame, and of as little force. And it{80} is much less absurd to hold, that sea animals have something common with those of the land, as it is confessed, that many of them have a great resemblance together in figure and shape, viz. sea-calves, sea-dogs, sea-wolves, and sea-horses, together with mermen and mermaids, as it is pretended. Who is ignorant of the winged or flying fishes; and of others with long nebs or bills like birds; also of birds with four feet like beasts, and why then may there not be sea-unicorns as well as land unicorns; if any such there be in rerum natura? for it is a difficult matter to determine what kind of animal the Scripture understands, when it speaks of the unicorn, as in Psalm xxix. ver. 6, and in other places; whether it be such a one as Plinius and other writers describe, giving him the body of a horse, with a stag’s head, and a horn on his snout; or whether it ought not with better reason be applied to a certain animal in Africa, called rhinoceros, whose snout is horned in that fashion. If one had patience to consider the vast disagreement that reigns between these{81} writers, one would conclude that this animal is peculiar to the climate where the fabulous bird ph?nix builds its nest; that is to say in Utopia, or nowhere. For some describe this animal as an amphibious one, that lives by turns upon land and in the water; some will have him to be in the likeness of an ore white spotted, with horse feet; others make a three years’ colt of him, with a stag’s head, and a horn in the front one ell long; and others again tell you it is like a morse or sea-horse, with divided or cloven feet, and a horn in the front. There are authors, who attribute to him a horn ten feet long, others six, and others again but the length of three inches. (See Pliny, Munsterus, Marc. Paulus, Philostratus, Heliodorus, and several others, whose relations are of the same authority with mine, as that of the Greenlanders, concerning a fierce, ravenous wild beast, which they call Amavok; which all pretend to know, but no person ever yet was found, that could say he had seen it.) \\n\\n \\n\\n Nises or porpoises, otherwise sea hogs, are{82} also placed in the class of whales, though of a much smaller size, and are met with in all seas. His head resembles that of a butts-head-whale: his mouth is armed with sharp teeth: he has spouts or pipes like a whale. He has a fin upon the middle of his back, which towards the tail is bended like a half-moon. Under the belly there are two side fins, overgrown with flesh and covered with a black skin. His tail is broad like that of a whale. He has small round eyes; his skin is of a shining black, and the belly white. His length is five to eight feet, at most. His fat makes fine oil, and the flesh is by the Greenlander reckoned a great dainty. \\n\\n \\n\\n Of other Sea Animals. \\n\\n \\n\\n The sea horse or morse has the shape of a seal, though much larger and stronger. He has five claws on each of his feet, as the seal: his head rounder and larger. His skin is an inch thick, especially about the neck, very rough, rugged and wrinkled, covered with a{83} short, brown, and sometimes reddish, or mouse-coloured hair. Out of his upper jaw there grow two large teeth or tusks, bended downwards over the under jaw, of the length of half a yard, and sometimes of a whole yard and more. These tusks are esteemed as much as elephants’ teeth; they are compact and solid, but hollow towards the root. His mouth is not unlike that of a bull, covered above and beneath with strong bristles as big as a straw: his nostrils are placed above his mouth, as those of the seal: his eyes are fiery red, which he can turn on all sides, not being able to turn his head, by reason of the shortness and thickness of his neck. The tail resembles a seal’s tail, being thick and short: his fat is like hog’s lard. He lies commonly upon the ice shoals, and can live a good while on shore, till hunger drives him back into the seas; his nourishment being both herbs and fishes: he snores very loud, when he sleeps; and when he is provoked to anger, he roars like a mad bull. It is a very bold and fierce creature, and they assist each other, when{84} attacked, to the last. He is continually at war with the white bear, to whom he often proves too hard with his mighty tusks, and often kills him, or at least does not give over till they both expire. \\n\\n \\n\\n The seals are of different sorts and sizes, though in their shape they all agree, excepting the clap-myss, so called from a sort of a cap he has on his head, with which he covers it when he fears a stroke. The paws of a seal have five claws, joined together with a thick skin, like that of a goose or a water fowl: his head resembles a dog’s with cropped ears, from whence he has got the name of sea dog: his snout is bearded like that of a cat: his eyes are large and clear with hair about them: the skin is covered with a short hair of divers colours, and spotted; some white and black, others yellowish, others again reddish, and some of a mouse colour: his teeth are very sharp and pointed. Although he seems lamish behind, yet he makes nothing of getting up upon the ice hills, where he loves to sleep and to bask{85} himself in the sun. The largest seals are from five to eight feet in length; their fat yields better train-oil than that of any other fish. This is the most common of all the sea animals in Greenland; and contributes the most to the subsisting and maintaining of the inhabitants, who feed upon the flesh of it, and clothe themselves with the skin, which likewise serves them for the covering of their boats and tents: the fat is their fuel, which they burn in their lamps, and also boil their victuals with. \\n\\n \\n\\n As for other sea monsters and wonderful animals, we find in Tormoder’s History of Greenland, mention made of three sorts of monsters, where he quotes a book, called “Speculum Regale Iclandicum;” or, the Royal Island Looking-Glass, from whence he borrows what he relates[29]. But none of them have been{86} seen by us, or any of our time, that ever I could hear, save that most dreadful monster, that showed itself upon the surface of the water in the year 1734, off our new colony in 64°. This{87} monster was of so huge a size, that coming out of the water, its head reached as high as the mast-head; its body was as bulky as the ship, and three or four times as long. It had a{88} long pointed snout, and spouted like a whale fish; great broad paws, and the body seemed covered with shell work, its skin very rugged and uneven. The under part of its body was{89} shaped like an enormous huge serpent, and when it dived again under water, it plunged backwards into the sea, and so raised its tail aloft, which seemed a whole ship’s length distant from the bulkiest part of the body. \\n\\n \\n\\n Of other Fishes. \\n\\n \\n\\n Of fishes properly so called, the Greenland sea has abundance and of great diversity, of which the largest is called Hay, whose flesh is much like that of the halibut, and is cured in the same manner; being cut into long slices, and hung up to be dried in the sun and in the air, as they cure them in the Northern parts of Norway; but the Greenlanders do not much care for it; its flesh being of a much coarser grain than that of the halibut. This fish has{90} two fins on the back, and six under the belly; the two foremost are the longest, and have the shape of a tongue: the other two middlemost are somewhat broader than the rest, and the hindermost couple near the tail are alike broad before and behind, but shorter than the middlemost: his tail resembles that of the sword fish. There are no bones in him, but gristles only. He has a long snout, under which the mouth is placed like that of the sword fish: he has three rows of sharp pointed teeth; his skin is hard and prickly, of a greyish hue; his length is two or three fathom; he has a great liver, of which they make train oil, the biggest of which makes two or three lasts. It is a fish of prey, bites large pieces out of the whale’s body, and is very greedy after man’s flesh: he cannot be caught with lines made of hemp, for with his sharp teeth he snaps it off; but with iron chains. And the larger sort are taken with harpoons, as we do the whales. The rest of fishes that haunt the Greenland seas are the halibut, torbut, codfish, haddock, scate, small salmon, or{91} sea-trout of different kinds and sizes (the large salmon not being so frequent in Greenland); and these are very fat and good; they are found in all inlets, and mouths of rivers. Cat-fish is the most common food of Greenlanders, insomuch, that when all other things fail, the cat-fish must hold out, of which there are abundance, both winter and summer. In the spring, towards the month of April, they catch a sort of fish called rogncals, or stone biter; and in May another fish, called lyds or stints: both sorts are very savoury; they frequent the bays and inlets in great shoals. There are also whitings in abundance; but herrings are not to be seen. Moreover there is a kind of fish, which neither myself nor any of my company had ever seen before: this fish is not unlike a bream, only it is prickly with sharp points all over, with a small tail. There are different sizes: the Greenlanders say they are well tasted. \\n\\n \\n\\n Among the testaceous animals in Greenland the chief are the muscles, of which there are{92} great quantities; they are large and delicate. In some waters I have found of those larger sorts, in which the Norwegians find pearls. These have also pearls, but very small ones, not bigger than the head of a pin. I shall say nothing of the other sea insects, as crabs, shrimps, \u0026c. though they be not rare here; yet lobsters, crawfish, and oysters, I never met with. According to information had of Greenlanders, on the Southern coasts they sometimes catch tortoises in their nets; for they tell you, that they are covered with a thick shell, have claws and a short tail; and moreover that they find eggs in them, like birds’ eggs. \\n\\n \\n\\n Of Greenland Sea Birds. \\n\\n \\n\\n Amongst the sea fowls the principal are those they call eider-fowl, and ducks; of which there are such numbers, that sometimes sailing along, you find the whole sea covered with them; and when they take their flight, you would think there was no end of them, espe{93}cially in winter time, when in large flocks, to the number of many thousands, they hover about our colony, morning and evening; in the evening standing in for the bay, and in the morning turning out to sea again. They fly so near the shore, that you may from thence shoot them at pleasure. In the spring they retire towards the sea; for upon the island that lies adjacent to the coast they lay their eggs, and hatch their young ones, which arrive in June and July. \\n\\n \\n\\n The natives watch them in this season to rob them of their eggs and their young ones. The fine down feathers, which is the best part of this bird, so much valued by others, the natives make nothing of, leaving them in the nests. \\n\\n \\n\\n There are three sorts of ducks. The first have a broad bill, like our tame duck, with a fine speckled plumage. These build their nests upon the islands as the eider fowls do. The second sort is of a lesser size, their bills long and pointed; they keep most in the bays{94} and in fresh waters, where they nest among the reeds. The third sort are called wood ducks, resembling very much those of the first sort, though somewhat larger in size; the breast is black, the rest of the body grey. These do not propagate in the common way of generation by coupling like other birds, but (which is very surprising) from a slimy matter in the sea, which adheres to old pieces of wood driving in the sea, of which first is generated a kind of muscles, and again in these is bred a little worm, which in length of time is formed into a bird, that comes out of the muscle shell, as other birds come out of egg shells[30]. Besides these there is another sea bird,{95} which the Norway men call alkes, which in the winter season contribute much to the main{96}tenance of the Greenlanders. Sometimes there are such numbers of them, that they drive them{97} in large flocks to the shore, where they catch them with their hands. They are not so large as a duck, nor is their flesh so well tasted, being more trainy, or oily. The lesser sort of alkes, which also abound here, are more eatable than the large ones. Besides this vast number{98} of sea fowls, there is yet one of a smaller size, by the natives called tungoviarseck, which, for the sake of its beautiful feathers, ought not to be forgot: it has the size and shape of a lark. \\n\\n \\n\\n Wild geese or grey geese keep to the Northward of Greenland; they are of shape like other geese, somewhat smaller, with grey feathers. They take their flight from other Southern climates over to Greenland every spring, to breed their young ones; which, when grown and able to fly, they carry along with them and return to the more Southern and milder climates, where they pass the winter season. \\n\\n \\n\\n In short, I have myself found in Greenland all the several sorts of sea fowls which we have in Norway; as all kinds of mews large and small, which build their nests in the clifts of the highest rocks, beyond the reach of any one; and some upon the little islands, as the bird called terne and the like; whose eggs they gather in great abundance among the stones: the lundes,{99} or Greenland parrot, so called on account of its beautiful plumage and broad speckled bill: the lumbs, the sea-emms, a fowl of a large size, and very small wings, for which reason he cannot fly: besides snipes, and a great number of others; some too common to be enumerated and described here, and others, of which I know not the name. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2684/73907.html","bookId":1484,"book":{"id":1484,"title":"A Description of Greenland","description":"简介： THE regions in the neighbourhood of the North Pole have lately become the objects of increased curiosity; and among these regions Greenland has attracted a more than usual interest. This country was first peopled by a colony from Iceland, which occup...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2684","creation":"Aug 1, 2019 12:25:13 AM","modification":"Aug 1, 2019 12:25:13 AM"}}
