{"id":64650,"no":22,"title":"Page 22","content":"\"For the most part. The ones I ran into over the years all looked as though their feet hurt them some.\"\\n\\n \"I \u0027spect mine will,\" he said, \"by the time these shoes take me to 168 Meserole Street.\"\\n\\n \"What did you do, call Brooklyn Information?\"\\n\\n \"Takes too long. They got to answer the phone, and then all they\u0027ll tell you is the number. You still got to look it up in a reverse directory or else call it and trick the address out of whoever answers. Who\u0027s got time for all that shit?\"\\n\\n \"Your time is valuable,\" I said.\\n\\n \"I got on the Net,\" he said. \"Typed in \u0027Peter Meredith, Brooklyn,\u0027 and got the address, the phone, the zip code. Took two seconds an\u0027 I didn\u0027t have to talk to nobody.\"\\n\\n \"Except the address is wrong.\"\\n\\n \"Say what?\"\\n\\n \"Meserole\u0027s in Greenpoint, not Williamsburg. The two neighborhoods run into each other, but Meserole\u0027s in a part of Greenpoint that got gentrified a while ago. That\u0027s not a place to find a low-priced fixer-upper.\"\\n\\n \"That\u0027s Meserole Avenue. They on Meserole Street.\"\\n\\n \"There\u0027s two Meseroles?\"\\n\\n \"You\u0027d think one\u0027d be enough,\" he said. \"Look hard, you can probably find some cities don\u0027t have any.\" From the back of the clipboard he produced a sheet of paper showing a map of a few square miles of North Brooklyn. \"Printed it out just now,\" he said, anticipating my question. \"See? Here\u0027s Meserole Avenue, up in Greenpoint, an\u0027 this here\u0027s Meserole Street, runnin\u0027 over towards Bushwick Terminal.\"\\n\\n I looked at the map. Both Meseroles, street and avenue, crossed Manhattan Avenue, the two intersections a mile and a half apart. It was the sort of thing that drove UPS drivers crazy.\\n\\n Ray Galindez, a police artist I know, had bought a house in Williamsburg a couple of years ago, and I\u0027d taken the L train out to visit him. The same train would get you close to Meserole Street, but you\u0027d have to stay on an extra three stops. I didn\u0027t know the neighborhood- I hadn\u0027t even known the street existed- but I could guess why Kristin Hollander thought she\u0027d rather stay in Manhattan.\\n\\n \"I didn\u0027t know you could do this,\" I said. \"Print out a street map of Brooklyn.\"\\n\\n \"Man, you could just as easy print out a street map of Samarkand. You gotta get on-line. You missin\u0027 out.\"\\n\\n We\u0027d had this conversation before. \"I\u0027m too old for it,\" I told him, not for the first time, and he told me about a man he\u0027d exchanged e-mails with, eighty-eight years old, living in Point Barrow, Alaska, and surfing the Net for hours every day.\\n\\n \"Why would anyone that age live in Point Barrow, Alaska?\" I wondered. \"And how do you know he\u0027s telling the truth? It\u0027s probably some nineteen-year-old lesbian posing as an old man.\"\\n\\n He rolled his eyes.\\n\\n \"I\u0027m sure I\u0027d have a wonderful time surfing the Net,\" I said, \"and I\u0027d be a better person for it, too. But I don\u0027t need to because I\u0027ve got you to do it for me.\"\\n\\n \"And to chase out to Brooklyn for you.\" He looked down at himself, shook his head. \"Good thing it out in the middle of nowhere. Don\u0027t want nobody I know seein\u0027 me lookin\u0027 like this.\"\\n\\n \"Not to worry,\" I said. \"They\u0027d never recognize you.\"\\n\\n EIGHTEEN\\n\\n I should know better, but I tend to form mental images of people I haven\u0027t met. I\u0027ll hear a voice over the phone and think I know what the person\u0027s going to look like.\\n\\n With Seymour Nadler I\u0027d had his voice- low in pitch, professionally calm- to go by, along with his name and address and profession. I found myself preparing to meet a big bear of a man, balding on top, with a mane of dark hair flowing down over the collar of his open-necked corduroy shirt. His beard, as black as his hair, would need trimming.\\n\\n Nadler turned out to be about my height, trimly built, clean-shaven, and wearing a gray glen plaid suit and a striped tie. His hair was brown and neatly barbered, and he still had all of it. His eyes, behind horn-rimmed glasses with bifocal lenses, were a washed-out blue. He had a small, thin-lipped mouth, and the hand he offered me felt small in mine.\\n\\n His office was on the tenth floor, agreeably furnished with older pieces. There was a couch, of course, but there were also several comfortable chairs. The carpet was Oriental, the paintings American primitives. Next to his desk, a computer perched on a black metal stand, the room\u0027s only contemporary note. The windows looked out on Central Park.\\n\\n \"I can give you twenty minutes,\" he said. \"My next appointment\u0027s at two, and I need ten minutes to prepare.\"\\n\\n I told him that would be ample.\\n\\n \"Perhaps you could tell me exactly why you\u0027re here,\" he said. \"My claim for losses incurred in the burglary has long since been settled. It took you people long enough, and I can\u0027t say I was happy with the amount, but it didn\u0027t seem worth going to court over.\" He smiled. \"Although I considered it.\"\\n\\n He evidently thought I was working for his insurance company. I hadn\u0027t quite said that, but I\u0027d certainly done what I could to create that impression.\\n\\n \"Well,\" I said, \"it\u0027s in connection with the gun.\"\\n\\n \"The gun!\"\\n\\n \"Twenty-two-caliber Italian pistol,\" I said. \"Stolen from a desk in your office, if my information\u0027s correct.\"\\n\\n \"I never even reported the loss of the gun.\"\\n\\n I paged through my notebook, trying to look puzzled. \"You didn\u0027t report it to the police? The law requires- \"\\n\\n \"To the police, yes, of course, but I\u0027d already submitted my claim to you people before I missed the gun. It wasn\u0027t that expensive, and I\u0027d never listed it on my inventory, so I didn\u0027t bother to amend my claim. If I\u0027d known you people were going to nickel-and-dime me on the value of my wife\u0027s jewelry, you can be sure I would have put the gun on the list.\"\\n\\n I held up a hand. \"Not my department,\" I said. \"Believe me, I know where you\u0027re coming from. Don\u0027t quote me on this, but our claims adjusters pull that crap all the time.\"\\n\\n \"Well,\" he said, and gave me a sudden smile. We were on the same side now, and I felt pleased with myself for having successfully used psychology on a psychiatrist. \"Well, then. What about the gun?\"\\n\\n \"It was used recently in a home invasion.\"\\n\\n \"Yes,\" he said, frowning. \"Yes, I actually did hear about that. A genuinely horrible incident, and it happened not far from here, I believe.\"\\n\\n \"On West Seventy-fourth Street.\"\\n\\n \"Yes, not far at all. Two people killed.\"\\n\\n \"And two more in Brooklyn.\"\\n\\n \"The perpetrators, yes. Murder and suicide, wasn\u0027t it? Interesting. That seems to happen sometimes, you know, with people who run amok and kill people. They conclude the drama by killing themselves.\" He put the tips of his small fingers together, pursed his lips. \"I\u0027m not certain of the mechanism. The conventional wisdom is that they\u0027re suddenly struck by the enormity of their actions and commit suicide to punish themselves. But I wonder if it isn\u0027t simply that they\u0027ve run out of people to shoot and still feel the need to go on. So they turn the gun on the only person available, their own self.\"\\n\\n His waiting room held several framed diplomas and certificates, but that speech did more to convince me he was a board-certified psychiatrist than a whole wall full of sheepskins.\\n\\n \"Well, that\u0027s just speculation,\" he said, after I\u0027d admired the theory. \"But why are you here? Surely the gun\u0027s not likely to be returned to me.\"\\n\\n \"No, I believe it\u0027s going to have to stay in a police evidence locker for a long time.\"\\n\\n \"It can stay there forever,\" he said. \"I certainly don\u0027t want it back.\"\\n\\n \"Did you replace it?\"\\n\\n He shook his head. \"I bought it for protection. I never expected to use it, and indeed I never had occasion to remove it from the locked drawer where I kept it.\" He stroked his chin. \"When it was gone, I wondered if I might not have wanted it to be gone. Perhaps my distaste for the weapon had somehow contributed to its having been taken away by the burglars.\"\\n\\n \"How would that work, sir?\"\\n\\n \"There\u0027s a principle that nothing happens entirely by accident. Some element of unconscious design is involved. This doesn\u0027t mean that the victim is always at fault, that\u0027s nonsense, but sometimes there\u0027s a contributory element. In this instance, the burglars confined themselves to our living quarters. The gun was absolutely the only item removed from my office. That\u0027s why it took me as long as it did to know the damned thing was missing.\"\\n\\n \"So you think the way you felt about the gun…\"\\n\\n \"It may not have literally induced the burglar to come in here and get the gun,\" he said. \"I can see where you might find that a bit of a stretch, and so might I, truth to tell. But the whole business, well, I certainly didn\u0027t feel inclined to go out and buy another damned gun.\"\\n\\n I said, \"You kept it in your desk.\"\\n\\n \"That\u0027s right.\"\\n\\n \"That desk you\u0027re sitting at?\"\\n\\n \"Yes, of course. Do you see another desk in the room?\"\\n\\n \"And which drawer would that be?\"\\n\\n He looked at me. \"Which drawer? What possible difference can it make which drawer I kept it in?\"\\n\\n \"Probably none,\" I said.\\n\\n \"And once again, just why are you here? I regret profoundly that a weapon I once owned was the instrument of several people\u0027s deaths, but I can\u0027t see that it\u0027s any of my responsibility.\"\\n\\n \"Well, that\u0027s just it.\"\\n\\n \"I beg your pardon?\"\\n\\n \"There\u0027s a question of legal responsibility,\" I said. \"It\u0027s possible that the owner of a weapon could be held accountable for the results of the use of that weapon by another party. In other words, someone injured by a bullet from your gun could sue you for letting the gun fall into criminal hands.\"\\n\\n \"But that\u0027s ridiculous! Why not go all the way, why not sue the gun\u0027s manufacturer, for God\u0027s sake?\"\\n\\n \"Matter of fact,\" I said, \"that\u0027s been done a couple of times. Made a product-liability case out of it and got a judgment against the weapons manufacturer. It\u0027s likely to be overturned on appeal, but- \"\\n\\n \"Are you saying somebody who was shot with my gun is going to sue me?\"\\n\\n \"Well, in this case the primary victims are all deceased. If a suit were brought, the plaintiff would be an heir of one of the victims.\"\\n\\n \"That couple\u0027s daughter…\"\\n\\n I certainly didn\u0027t want him calling Kristin, trying to head off a mythical lawsuit. \"In this instance,\" I said, \"our concern is that one of the other parties might bring suit.\"\\n\\n \"You don\u0027t mean one of the criminals? Someone breaks into my home, steals my personal property, including my lawfully registered pistol, and kills several people with it, himself included, and you\u0027re saying some relative of his is entitled to sue me?\"\\n\\n \"Dr. Nadler,\" I said, \"anyone can instigate a lawsuit, and some lawyer will always turn up to take the case.\"\\n\\n \"Ambulance-chasing shysters,\" he said.\\n\\n \"No suit has been brought, and in the unlikely event that one is, it\u0027s almost certain to be dismissed, or resolved in our favor. I\u0027m just here to gather information that will help us nip such a legal action in the bud.\"\\n\\n It had been surprisingly easy to stir him up, and it wasn\u0027t as easy to calm him down again. I didn\u0027t want to waste time, either; he kept looking at his watch, and I knew he\u0027d send me on my way at ten to two. \\n\\n","sourceLink":"https://allnovel.net/hope-to-die-matthew-scudder-15/page-22.html","bookId":2333,"book":{"id":2333,"title":"Hope to Die (Matthew Scudder #15)","description":"Storyline: Hope to Die (Matthew Scudder #15) \\n The city caught its collective breath when upscale couple Byrne and Susan Hollander were slaughtered in a brutal home invasion. Now, a few days later, the killers themselves have turned up dead behind the locked door of a Brooklyn hellhole -- one apparently slain by his partner in crime who then took his own life. \\n There\u0027s something drawing Matthew Scudder to this case that the cops have quickly and eagerly closed: a nagging suspicion that a third man is involved, a cold, diabolical puppet master who manipulates his two accomplices, then cuts their strings when he\u0027s done with them. No one but Scudder even suspects he exists. And his worst fear is that the guy is just getting started ...\\n","cover":"https://allnovel.net/images/hope-to-die-matthew-scudder-15.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/hope-to-die-matthew-scudder-15.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:54:36 AM"}}
