{"id":64651,"no":23,"title":"Page 23","content":"I asked him again which drawer had held the gun, and had him show me how it was locked and unlocked. The desk was an oval kneehole desk, mahogany, with a tooled leather top. There was a center drawer with three drawers on either side, and the gun had been kept in the second of the three drawers on the right. He was right-handed, he explained, so that would be most convenient, if he were at his desk and needed the gun. All of the drawers were fitted with locks, although the locking mechanisms on two of them had failed with age and rust. The small skeleton-type key was in the center drawer, with a piece of red yarn tied to it, I guess to make it easier to find. \"During the burglary,\" I asked, \"were all the drawers unlocked? Or only the one with the gun?\" \"It was the only one locked in the first place.\" \"Who knew about the gun?\" \"Who knew about it?\" \"That you owned it,\" I said, \"and where you kept it.\" \"No one.\" \"Your wife? Your receptionist?\" \"My wife knew, yes, knew that I owned it but not where it was kept. My wife is somewhat phobic about guns and was opposed to my obtaining one in the first place.\" He frowned. \"I suppose that\u0027s one reason I didn\u0027t amend the insurance claim. As for Georgia, my receptionist, she wouldn\u0027t even have known the gun existed, let alone where it was kept.\" Georgia was a middle-aged black woman with cool eyes and a warm smile, and I had the feeling she didn\u0027t miss much. I let that pass and asked about his patients. Had he ever had occasion to show the gun during a session? \"Absolutely not,\" he said. \"I never so much as opened that drawer with a patient in the room. I never even unlocked- no, that\u0027s not true. Twice, with a patient who was going through a critical time, I prepared for the session by unlocking the drawer. Because of my own anxiety, you see. But in the event I never even opened the drawer, let alone showed the weapon.\" \"And that patient…\" His face clouded. \"Took his own life, I\u0027m sorry to say. Lived in a second-floor apartment, rode the elevator up to the roof and threw himself off it. He left a note, said he was afraid if he didn\u0027t do this he might kill someone. So perhaps my anxiety hadn\u0027t been entirely misplaced.\" \"And this happened recently?\" \"His suicide? No, it was last winter, the week between Christmas and New Year\u0027s. Not an unusual time for it.\" \"Before the gun was taken, then.\" \"Oh, yes. Months before.\" \"The two burglars,\" I said. \"Their names were Jason Bierman and Carl Ivanko.\" \"Yes.\" \"Was either a patient of yours?\" He didn\u0027t even hesitate. He might have refused to answer if he\u0027d thought I was a cop, but he wouldn\u0027t hold out on a guy from the insurance company looking to head off a lawsuit. \"No,\" he said. \"The first I heard of either of them was when I read about them in the newspaper.\" \"Of your other patients,\" I said, \"can you think of any who might have served time in prison?\" He shook his head. \"My patients are middle-class professionals,\" he said. \"Two-thirds or more of them suffer from depression. Several are young women with eating disorders. I have a blocked writer, the author of five novels. The fifth was his breakthrough book, a bestseller. It was published nine years ago and he hasn\u0027t been able to finish anything since. I have patients who are unhappy in their marriages, patients who feel their careers have dead-ended.\" He came out from behind his desk, walked over to the window, looked out at the park. With his back to me he said, \"When I was in medical school they talked admiringly of dermatology. The skin game, they used to call it. \u0027Nobody ever dies, nobody ever gets well.\u0027 \" He turned to face me, one hand holding the other. \"You could say that about what I do, dabbing ointment on psoriasis of the psyche. Of course it\u0027s not really true of a dermatologist. Some of his patients do recover, certainly, and some die of melanoma. And many of mine are better for having treatment. Their depression is lessened, their neuroses less debilitating. And, of course, now and then one flings himself off a roof.\" He returned to his desk, picked up a letter opener, brass, with a handle of green malachite. \"I had a patient who molested all four of his children, three girls and a boy,\" he said. \"I had another who embezzled a quarter of a million dollars from his employer to finance an enthusiasm for sports gambling and cocaine. Neither of them went to jail. I suppose the work I do might benefit a criminal, an ex-inmate, but none has ever come to me.\" He started to add something, then drew himself up short and looked at his watch. \"It\u0027s ten minutes of two,\" he said. \"I really can\u0027t spare you any more time. No one could have known the gun was there. No patient of mine ever saw it. If there\u0027s nothing else…\" \"You\u0027ve been very helpful,\" I said. \"I\u0027m sorry to have taken so much of your time. Unofficially, let me just say that I don\u0027t think you have anything to worry about.\" \"Then I won\u0027t,\" he said, and gave me a wintry smile. I can\u0027t say he looked too worried. We shook hands, and he showed me to the door. NINETEEN It was drizzling when I left Nadler\u0027s office, but not enough to make me sorry I\u0027d left the umbrella home. We had a concert that evening and I wanted to fit in a meeting first, so I walked through the raindrops to Broadway and took the subway down to the Village. There\u0027s a storefront on Perry Street that\u0027s been leased to an AA group for twice as long as I\u0027ve been sober. Back when I came in they used to hold two or three meetings a day there, and now they run pretty much continuously from early morning to late at night. I got there halfway through one meeting, went out for coffee when it ended, and came back for a little more than half of the next one. I heard a lot of the neurotic self-absorbed drivel that Seymour Nadler had to listen to all day, and I wasn\u0027t getting paid, either. But when I walked out of there I was sober. T J called in, reporting that no one had questioned his performance as a deputy inspector for the Department of Buildings, City of New York, Borough of Brooklyn. He\u0027d had no trouble finding the house on Meserole Street, but said he\u0027d have felt more comfortable in that part of town if he\u0027d stayed with the camo shorts. There were Dumpsters here and there and a lot of renovation going on, so the neighborhood was evidently in the process of improving, but it looked to him like it had a ways to go. He\u0027d met Peter Meredith, and three of his four housemates, and he\u0027d report at length face to face, but for now he\u0027d summarize it by saying Meredith might not have gained weight since Kristin saw him last, but it didn\u0027t look as though he\u0027d lost any, either, and he wasn\u0027t about to fit into Jason Bierman\u0027s shirt and jeans. And two of the other people he\u0027d met were women, and the other man was black, and, while we\u0027d never actually spelled it out, he more or less assumed our mystery dude was of the Caucasian persuasion. That left one member of the team he didn\u0027t get to see, I told Elaine, and another visit from the same buildings inspector might arouse suspicions. But he had the name of the missing man, and we could figure out some way to check him out. \"I know it\u0027s never a complete waste,\" she said, \"but it sounds as though he had a long trip for nothing.\" \"That\u0027s what I said. He said it wasn\u0027t that long a trip, and he got to see a part of town he hadn\u0027t known before. Besides, it wasn\u0027t for nothing.\" \"Because you get to rule these people out.\" \"That\u0027s only half of it. He got paid. They believed he was a genuine buildings inspector, and evidently they\u0027d had dealings with the breed before, or knew someone who had. So, when he kept hanging around, wanting to look at one thing after another to no particular purpose, Peter Meredith took him aside and slipped him a hundred-dollar bill.\" \"And of course T J took it.\" \"If he hadn\u0027t,\" I said, \"I don\u0027t know what I would do with him. Yes, of course he took it. It would have spiked his whole act to turn it down, and on top of that it would have contravened a fundamental principle.\" \" \u0027When they give you money, put it in your pocket.\u0027 \" \"That\u0027s the one.\" We ate at home and walked up Ninth to Lincoln Center. It was raining in earnest by the time we set out, so we might have taken a cab, but the rain made it impossible to get one. It was only half a dozen blocks, and we both had umbrellas, and stayed dry under them. The concert featured a Belgian pianist who performed on a Mozart piano, which was evidently some intermediate stage in evolution between a harpsichord and the modern piano. The program notes told me more than I cared to know about the differences and similarities involved. The Mostly Mozart orchestra provided accompaniment, and what they played was certainly easy to listen to. And, in my case, easy not to listen to, because I couldn\u0027t keep my mind on it. I kept playing different conversations through my mind- with Nadler, with Kristin Hollander, with my police contacts in Brooklyn and Manhattan. I ran switches on the scenario I\u0027d spun out for Kristin (\"Scudder\u0027s variations on the Third Man Theme\") until they became a dream I couldn\u0027t wake up from, or a song I couldn\u0027t get out of my head. At intermission Elaine asked me if I wanted to go. \"You\u0027re not squirming in your seat,\" she said, \"but your mind\u0027s miles away, isn\u0027t it?\" I said I\u0027d stay. The festival had only a week to run, and we had tickets for two of the remaining concerts. She\u0027d be taking a friend to one of them, and then there\u0027d be the last night, and eleven months before we did it again. It was early, and Danny Boy\u0027s day was just starting. It wouldn\u0027t hurt me to sit back and let them play beautiful music for me, whether I listened to it or not. A Ninth Avenue bus pulled up just as we were leaving. The rain had lessened and she said she\u0027d walk, and I said either she\u0027d take the bus or I would walk with her. She said, \"And then turn around and walk all the way back to Seventy-second Street?\" \"So take the bus,\" I said, and she did. Poogan\u0027s is on Seventy-second east of Broadway, a dark little hole in the wall with precious little to recommend it, as far as I\u0027m concerned, aside from the frequent presence of Danny Boy Bell. I\u0027ve known him for years- Elaine was sitting at his table the night I first laid eyes on her. I\u0027d say he hasn\u0027t changed, that he looks exactly the same, but I know that can\u0027t be true. He was around twenty-eight when I met him, and looked much younger. He still looks young for his years, but there are more of them, and it shows. Back then he looked like nobody else in the world, and that hasn\u0027t changed. He\u0027s African-American, a term I don\u0027t tend to use much, but it fits him better than \"black,\" which doesn\u0027t fit him at all. Danny Boy\u0027s a true albino, his skin whiter than white, his hair colorless, his eyes pink and light-sensitive. Even in the summer, he manages to see about as much daylight as an overly cautious vampire. Nights, he generally holds court at one of two places where the lighting and sound are both muted. Mother Blue\u0027s, farther uptown, has live music and a more upscale salt-and-pepper clientele; Poogan\u0027s, with a tasteful if eclectic jukebox, is a little more raffish. At either place he takes his usual table and waits for people to come join him. Some bring him information and others take information away with them. If this is the Information Age, Danny Boy\u0027s up to date- information is his stock in trade.","sourceLink":"https://allnovel.net/hope-to-die-matthew-scudder-15/page-23.html","bookId":2333,"book":{"id":2333,"title":"Hope to Die (Matthew Scudder #15)","description":"Storyline: Hope to Die (Matthew Scudder #15) The city caught its collective breath when upscale couple Byrne and Susan Hollander were slaughtered in a brutal home invasion. Now, a few days later, the killers themselves have turned up dead behind the locked door of a Brooklyn hellhole -- one apparently slain by his partner in crime who then took his own life. There\u0027s something drawing Matthew Scudder to this case that the cops have quickly and eagerly closed: a nagging suspicion that a third man is involved, a cold, diabolical puppet master who manipulates his two accomplices, then cuts their strings when he\u0027s done with them. No one but Scudder even suspects he exists. And his worst fear is that the guy is just getting started ...","cover":"https://allnovel.net/images/hope-to-die-matthew-scudder-15.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/hope-to-die-matthew-scudder-15.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:54:36 AM"}}
