{"id":64661,"no":33,"title":"Page 33","content":"\"Or Alden,\" I suggested, \"or maybe Alton. They\u0027re both occasionally used as first names.\" Elaine checked the phone book. There were several Brills, but none with the initial A. \"Of course that\u0027s just Manhattan,\" she said. \"And who knows where he lives, or if his phone\u0027s listed.\" \"It\u0027s probably not his name,\" I said. \"Well, here\u0027s the way I see it,\" Wentworth said. \"If it is his name, he\u0027s probably not the guy.\" Elaine said, \"Wait a minute, I must be missing something. If there actually is an English scholar named Arden Brill, that means the girl was lying? That doesn\u0027t make any sense.\" Wentworth shook his head. \"Let\u0027s assume she wasn\u0027t telling a story,\" he said, \"because why would she? No, she was telling the truth. A guy told her his name was Arden Brill and he was doing a thesis on her aunt. Now if there really is such a person, then not only was she telling the truth, but so was he. His name really is Brill and he really was doing a paper, a thesis, whatever. So he\u0027s legit.\" \"And if there\u0027s nobody by that name- \" \"Then he\u0027s a phony,\" I said, \"and he got close to Lia so that he could copy her key and find a way around the burglar alarm. So if Brill is real, somebody else had a reason to want Lia Parkman dead. And if there\u0027s no such person as Brill, then he\u0027s the one.\" \"And a lot of good it does us to know that,\" Wentworth said, \"because we\u0027ve got no idea who he is.\" After he left, promising to get back to us when he knew something, Elaine said there was another possibility. \"There could be a man named Arden Brill, and he could even be a doctoral candidate in the English department. But that doesn\u0027t mean he\u0027s necessarily the man who got in touch with Lia Parkman.\" \"Don\u0027t stop there.\" \"Well, say I want to win your confidence. I make up this story about my thesis and your aunt, di dah di dah di dah. But suppose you check? So I pick a name of somebody who really exists, some scholar she wouldn\u0027t ordinarily run into in a million years, and when she checks, yes, there is an Arden Brill in the English department, as a matter of fact he\u0027s hard at work on his doctorate, which is probably on bird symbolism in the poetry of Robinson Jeffers and nothing to do with Susan Hollander, but nobody\u0027s going to tell her that. You see what I mean?\" \"Yes, sure.\" \"Does it make sense?\" \"Maybe.\" \"Because here\u0027s what doesn\u0027t make sense otherwise,\" she said. \"If his name\u0027s not Arden Brill, why would he make up such an unusual name?\" TWENTY-SEVEN I was shaving when the call came. An Officer Tillis from the Twenty-sixth Precinct, and could I come in so they could take my statement in the Lia Parkman case? I said I could, and drank a cup of coffee before I caught the train to 125th Street. The station house is on 126th Street, a block and a half west of Broadway. I walked there and wound up sitting at a metal desk in a room that was otherwise empty, except for a framed photo of the mayor on the wall over the desk. Above it, someone had taped up a headline cut from an American Express magazine ad: DO YOU KNOW ME? They gave me a yellow pad and let me use my own pen, and I wrote out a sort of Reader\u0027s Digest version of my connection to Lia Parkman. I hadn\u0027t told Wentworth about my first meeting with the girl, or her initial suspicions of her cousin. Why add to the confusion? With that exception, my statement was reasonably complete. I read it over and signed it, and they told me I could go home. There\u0027s an Episcopal church across the street from the Two-six, and if the doors had been open I might have gone in. Instead I went back to the subway entrance, then kept on going to La Salle and west for a block to Claremont. I didn\u0027t know which building was Lia\u0027s, but I didn\u0027t have to ask too many people before the sleepy-eyed attendant at a coin laundry pointed out the apartment house on the corner. I stood across the street and looked it over, a six-story brick cube with mock-Tudor trim. I didn\u0027t go in, didn\u0027t try to locate any of her roommates. An official investigation was in process, and I had no business getting in everybody\u0027s way. I just wanted a closer look, and I decided this was close enough. I headed back to Broadway. There was a West African restaurant a few doors up La Salle, and I made a note to try it sometime. Meanwhile I thought of the Salonika, just two blocks away. I was hungry, I hadn\u0027t had anything but that one cup of coffee, and I could eat there as well as anywhere else, but I decided I didn\u0027t want to share my table with a ghost. I didn\u0027t blame myself for her death, I blamed the son of a bitch who\u0027d killed her, but I couldn\u0027t help wondering whether the hand might have played out differently if I\u0027d been a little firmer with her the previous afternoon. And if I had, and if she\u0027d told me in person what she later told my answering machine? Wouldn\u0027t she still have gone home, and wouldn\u0027t he still have paid her a visit? And wouldn\u0027t it have all come out the same? I rode downtown and had my breakfast at the Morning Star. When I got home there was a message to call Ira Wentworth, and this time I didn\u0027t shortcut the process by ringing Lia Parkman\u0027s cell phone. I called the precinct, and he answered his own phone. I told him he was putting in a lot of hours. \"I stayed at it pretty late last night,\" he said, \"and I came in early this morning, because I wanted to see if I could goose the ME\u0027s office a little. I got the report. Injuries to the throat are consistent with a choke hold. Cause of death is definitely drowning, water in the lungs, et cetera. Blood alcohol is close to zero. Small amount of vodka in the stomach, unabsorbed into the bloodstream because she died so soon after ingesting it. He was being cute with the vodka, and it\u0027s three different kinds of a wrong note.\" He\u0027d been cute before, with the brass bolt he\u0027d attached to the inside of Bierman\u0027s door. \"And you\u0027ll like this,\" he said. \"Skin tissue on the face reveals traces of- and there\u0027s a chemical name a yard long I\u0027m not even going to try to pronounce, but it\u0027s identified as a propellant frequently added to chemical Mace.\" \"That\u0027s how he took her down.\" \"Maced her and choked her,\" he said, \"and then took her and drowned her. Must have been quick.\" \"And quiet.\" \"Well, it had to be quiet, with her roommates just a few yards away. Poor kid.\" \"She was on full scholarship,\" I said. \"Taking a summer school course on the French Revolution.\" \"Maybe she had a classmate named Arden Brill. Wouldn\u0027t that be handy?\" But there was no Arden Brill. Wentworth called an hour later to tell me as much. There were no Brills at all registered at Columbia, none at NYU or CUNY or any other colleges he\u0027d checked. Phone directories for the city and the surrounding tristate area showed a fair number of Brills, about the same number proportionally as we\u0027d found in the Manhattan book. None with Arden for a first name, though, and nothing close- no Alden, no Alton, no Auden. He had a couple of officers on the phones, working their way through the Brills, trying to find an Arden Brill. It was a thankless task, stupefyingly dull, and he didn\u0027t expect it to yield anything useful. \"He made up a name,\" he said, \"and she passed it on, and got killed for it. It proves one thing, though it wouldn\u0027t prove it in court.\" \"Oh?\" \"Proves you were right about the Hollanders. Case never should have been closed, though you can see why they closed it.\" I asked if he was going to try to get it reopened. \"Call up somebody I don\u0027t know and tell him he fucked up? That\u0027s no way to win friends and influence people.\" \"It might help get police protection for Kristin Hollander.\" \"The cousin. You think she needs it?\" He answered his own question. \"Both parents and a cousin, I guess somebody ought to keep an eye on her. Reminds me, she\u0027s on my list of people I\u0027d better talk to.\" \"Has she been notified?\" \"Not by me. Next of kin\u0027s her mother, and nobody\u0027s been able to reach her yet. Roommate ID\u0027d the body.\" \"I\u0027ll notify Kristin,\" I said, \"and I\u0027ll tell her to expect to hear from you.\" \"Appreciate it.\" \"And not to open the door for anybody else.\" \"I\u0027ll make sure I\u0027m the one contacts her,\" he said. \"And as far as reopening the case, for now all I want to concentrate on is getting this guy. Once he\u0027s good for Parkman, we can add the Hollanders to his tab.\" \"Plus two in Brooklyn.\" \"Yeah, I forgot those. What\u0027s that come to, five in all? He\u0027s beginning to look like a poster boy for the death penalty, but I wouldn\u0027t count on it. Still, five life sentences should keep him on ice for a while. Now if only we had some idea who he is and where to find him.\" \"You\u0027ll find him,\" I said. \"He\u0027s good, but he\u0027s too cute to stay hidden.\" \"You know,\" he said, \"I got the same feeling myself. There\u0027s one more thing he did, besides the vodka bottle.\" \"What\u0027s that?\" \"Well, you gave her your card, didn\u0027t you? Your business card?\" \"Yes.\" \"And she must have had it out to dial your number. So where is it?\" \"Gone, I gather.\" \"And it didn\u0027t walk off by itself. One more thing to confirm what we already know, which is that she didn\u0027t just slip beneath the water\u0027s surface and drown of her own accord. Of course there\u0027s something else it tells us.\" \"What\u0027s that?\" \"Well, he picked up the card. He knows who you are.\" Kristin hadn\u0027t looked at a paper or listened to the news, so I got to tell her that her cousin was dead. It might have been gentler in person, but I was more interested in saving the time it would take to get from my place to hers. So I didn\u0027t see her face when I gave her the news. \"He tried to make it look like accidental death,\" I said, \"but he didn\u0027t do a very good job of it, and there\u0027s a damn good cop running the investigation. His name\u0027s Ira Wentworth, and he\u0027ll be in touch with you.\" \"He\u0027ll want to talk to me?\" \"Definitely.\" \"But I don\u0027t know anything,\" she said. \"What can I tell him that he doesn\u0027t already know?\" Probably nothing, I allowed, but he\u0027d want to establish that for himself. I told her he might be getting someone higher up to authorize police protection for her, and that she should accept a police guard if he offered it. \"I don\u0027t think you\u0027re in danger,\" I said, \"but I didn\u0027t think your cousin was in danger, either, and it turned out I was wrong. In the meantime, I don\u0027t want you to open your door to anyone but me or Detective Ira Wentworth.\" I described him, and told her to make sure he showed some ID in that name. \"And can you screen your calls? I\u0027d advise you to do that, if only to avoid the press. It\u0027s a miracle they haven\u0027t learned yet that Lia was your cousin, but they\u0027ll get the word before long, and they\u0027ll start calling and turning up on your doorstep. Don\u0027t talk to them and don\u0027t answer the door.\" \"I won\u0027t.\" \"I mean it, Kristin. It\u0027s not just that they\u0027ll upset you and waste your time. There\u0027s also the fact that one of them could be the man who killed your cousin.\" \"And my parents.\" \"Yes.\" \"I won\u0027t let anyone in. Oh.\" \"What?\"","sourceLink":"https://allnovel.net/hope-to-die-matthew-scudder-15/page-33.html","bookId":2333,"book":{"id":2333,"title":"Hope to Die (Matthew Scudder #15)","description":"Storyline: Hope to Die (Matthew Scudder #15) The city caught its collective breath when upscale couple Byrne and Susan Hollander were slaughtered in a brutal home invasion. Now, a few days later, the killers themselves have turned up dead behind the locked door of a Brooklyn hellhole -- one apparently slain by his partner in crime who then took his own life. There\u0027s something drawing Matthew Scudder to this case that the cops have quickly and eagerly closed: a nagging suspicion that a third man is involved, a cold, diabolical puppet master who manipulates his two accomplices, then cuts their strings when he\u0027s done with them. No one but Scudder even suspects he exists. And his worst fear is that the guy is just getting started ...","cover":"https://allnovel.net/images/hope-to-die-matthew-scudder-15.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/hope-to-die-matthew-scudder-15.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:54:36 AM"}}
