{"id":64662,"no":34,"title":"Page 34","content":"\"Well, I\u0027m expecting someone this afternoon.\"\n \"Who?\"\n \"His name\u0027s David Hamm. He\u0027s the man who gave me the ride home the night I found… the night it happened.\"\n He\u0027d waited at the curb, making sure she got in all right.\n \"It couldn\u0027t be him,\" she said, anticipating my thought, \"because he was there all evening, at my friend\u0027s house. And the police investigated him thoroughly before they found the two dead bodies in Brooklyn.\"\n \"Whose idea was it for him to come over this afternoon?\"\n \"Well, he called. I invited him. He called once before, after the funeral, all concerned, and…\"\n Her voice trailed off. I said, \"Call him now and tell him something\u0027s come up, you won\u0027t be home, you can\u0027t have company.\"\n \"All right.\"\n \"If he calls back, don\u0027t take the call, and don\u0027t return it.\"\n \"But… all right.\"\n \"Call him now, and then call me back.\"\n \"All right.\"\n He was probably perfectly all right. He couldn\u0027t have been in two places at one time, and the police would have checked him inside and out during the early stages of the investigation. I didn\u0027t give a damn. I didn\u0027t want him getting close to her, him or anybody else.\n I was just starting to wonder what was taking so goddam long when the phone rang and she said it was all taken care of, and was there anything else?\n \"Yes,\" I said. \"As a matter of fact, there is. Do you know anyone named Arden Brill?\"\n \"Arden Brill.\"\n \"Yes. Does the name ring a bell?\"\n \"No, should it?\"\n \"Did anyone ever get in touch with you, recently or in the past, with the explanation that he was doing a doctoral dissertation on your mother?\"\n \"On my mother?\"\n \"On her writing.\"\n \"Gosh, no,\" she said. \"I can\u0027t imagine that anyone would. I mean, she was serious about her work, and I think she was a fine writer, but she wasn\u0027t important to the extent that anyone would write a thesis about her.\"\n \"But someone could have been interested in her work.\"\n \"Well, sure. I mean, she was an interesting writer, so why wouldn\u0027t people be interested?\"\n \"Could you see if she had any correspondence from Arden Brill?\"\n \"Is that who- \"\n \"I don\u0027t think he exists,\" I said, \"but I think that\u0027s one name that he used.\"\n \"I could check her files,\" she said. \"She filed all her correspondence in a cabinet in her studio, and there\u0027s a pile of miscellaneous papers, and I could go through those. And I could check her computer, too, and see if his name comes up. First name A-R-D-E-N, last name B-R-I-L-L? I\u0027ll call and let you know if I find anything.\"\n I\u0027d tried T J a couple of times earlier but he was out. The second time I remembered to try him on his cell phone- it\u0027s never the first thing I think of- and it rang unanswered. I took another shot when I got off the phone with Kristin, and this time he picked up right away.\n He already knew about Lia. He\u0027d been on the Columbia campus, and there were a lot of conflicting stories going around- that she was the latest victim of the man the tabloids had dubbed the Dorm Rapist, that she had killed herself, that the boyfriend of one of her roommates had killed her accidentally in some sort of rough sex play involving water.\n \"The last part\u0027s right,\" I said. \"The part about the water.\" I filled him in, then asked if he was home.\n \"You just called me,\" he said, \"and I picked up. Where else I gonna be?\"\n \"You could be anyplace,\" I said. \"I called you on your cell phone, didn\u0027t I?\"\n \"Oh,\" he said. \"So you did.\"\n \"I think I did, but I suppose- \"\n \"No, must be you did,\" he said, \" \u0027cause here I be, talkin\u0027 on it.\"\n \"You didn\u0027t answer when I tried you before.\"\n \"Had the sound turned off when I was in the classroom. Professors get all hinky when they\u0027re in the middle of a sentence and some fool\u0027s phone goes off.\"\n \"But you\u0027re home now. Don\u0027t go anywhere, I\u0027m on my way over.\"\n \"Can\u0027t wait.\"\n \"Force yourself,\" I said. \"And while you\u0027re waiting, start looking for Arden Brill.\"\n There was an Alden Brill in Yreka, California, and an Arlen Brill in Gadsden, Alabama, and their names popped up without much effort on his part. I was impressed, but he frowned and shook his head.\n \"Ain\u0027t gonna find him this way,\" he said. \"Even if we do, we don\u0027t be findin\u0027 nothin\u0027. This ain\u0027t about some dude flew in from California an\u0027 killed a bunch of people. Guy we lookin\u0027 for is homegrown.\"\n \"That\u0027s true, but- \"\n \"An\u0027 his name ain\u0027t Arden Brill, neither.\"\n \"Still,\" I said, \"it\u0027s a place to start, and it\u0027s all we have.\"\n He was nodding. \"What you said before,\" he said, \"that Elaine said. Why\u0027d he pick a name like Arden Brill?\"\n \"That\u0027s the question.\"\n \"Maybe that\u0027s where we ought to go.\"\n \"How?\"\n \"Let\u0027s see something,\" he said, bending over the keyboard. \"This here\u0027ll take a minute. Y\u0027all just talk amongst yourselves.\"\n I put the TV on but muted it so the sound wouldn\u0027t distract him. When I found myself trying to read Judy Fortin\u0027s lips I gave up and turned it off. I reached for a magazine and got one called MacAddict, which wasn\u0027t, as I might have guessed, for people who filled up regularly on Happy Meals and Egg McMuffins, but for users of Macintosh computers. I was trying to find an article I could make head or tail out of when he said, \"Arden Brill.\"\n \"You found something?\"\n \"Coulda called himself Abe,\" he said, \" \u0027less he thought it was too ethnic. Or AA, only then you\u0027d likely go lookin\u0027 for him at a meetin\u0027.\"\n \"What are you talking about?\"\n \" \u0027Bout Arden Brill. Could called himself Carl Young, an\u0027 then we never woulda got nowhere \u0027cause we never woulda knowed how he spelled it. You don\u0027t see what I\u0027m sayin\u0027, do you?\"\n \"Not a clue.\"\n \"Thing is,\" he said, \"I heard the name Brill, an\u0027 I knew it was familiar. But there\u0027s this Steven Brill, started Court TV and all.\"\n \"I think we can rule him out.\"\n \"Yeah, well I know that. But there was another Brill naggin\u0027 at my mind, but \u0027tween Steve an\u0027 Arden I couldn\u0027t get him sorted out. An\u0027 when I typed in Brill on Google I got about a million hits, and most of \u0027em had to do with Contentville, which is this Web site he started. Steven Brill, I\u0027m talkin\u0027 about.\"\n \"And?\"\n \"Let me print this out,\" he said, \"and you can read it for yourself.\"\n \"If it\u0027s as crystal-clear as this magazine- \"\n \"No,\" he said, tapping keys. \"It\u0027s real simple. You\u0027ll see.\"\n He switched on the printer, and in less than a minute a sheet of paper scrolled into the tray. He picked it up and handed it to me.\n I read:\n BRILL, Abraham Arden, 1874-1948. Born in Austria, came to United States alone at age 13, resided in New York City. Graduated NYU 1901, MD Columbia University 1903. Studied in Switzerland with Carl Jung, returned to US in 1908. An early and outspoken advocate of psychoanalysis, Brill was one of the first to translate Freud and Jung into English, and did much to make their theories accessible in the United States. He taught for years at NYU and Columbia; publications include Psychoanalysis, Its Theories and Application (1912) and Fundamental Conceptions of Psychoanalysis (1921).\n \"Could be a coincidence,\" he said.\n \"No.\"\n \"You still see his books on reading lists. That\u0027s what rang a bell. Arden, though, that kept the penny from dropping. It\u0027s usually A. A. Brill, or Abraham Brill.\"\n He\u0027d dropped the hip-hop speech patterns, and sounded like someone who\u0027d know about Freud and Jung, and Abraham Brill.\n I said, \"It\u0027s not a coincidence.\"\n \"It really couldn\u0027t be, could it?\"\n \"He picked the name because it meant something to him, and he was confident it wouldn\u0027t mean anything to her.\"\n \"To Lia, you mean.\"\n \"No one else was ever supposed to hear the name. He went to Lia\u0027s dorm and killed her to keep her from repeating it. He was too late, but not by much. \u0027Arden Brill\u0027 were two of the last words she ever spoke.\"\n \"Good thing you had your machine on.\"\n \"If I\u0027d been home to take the call- \"\n \"Good thing you weren\u0027t.\"\n \"How do you figure that?\"\n \"Because she\u0027d have said she thought of something, that it might be important. And you\u0027d have said, \u0027No, not over the phone, I\u0027ll meet you in twenty minutes at the Salonika.\u0027 Only you\u0027d have been waiting a long time at that restaurant, because she\u0027d be floating in the bathtub, and you never would have heard the name Arden Brill.\"\n I thought about it, agreed it was possible.\n \"Or,\" he said, \"she hears your voice, and she gets flustered and hangs up.\"\n \"She could just as easily have hung up on the answering machine.\"\n \"But she didn\u0027t,\" he said.\n \"If I\u0027d questioned her a little more intensively at the Salonika- \"\n \"Maybe she\u0027d have said then and there.\"\n \"Maybe.\"\n \"And maybe not,\" he said. \"Maybe she\u0027d have clammed up tight, and not made a phone call later, because of how hard you pressed her.\"\n \"Maybe.\"\n \"And he would have shown up right on schedule,\" he went on, \"and she\u0027d be just as dead as she is now, same as if we never even made the call and went up there yesterday in the first place. This way we got a name, Arden Brill, and otherwise we wouldn\u0027t have a thing.\"\n \"Arden Brill,\" I said.\n \"Figure it\u0027s him?\"\n \"It pretty much has to be.\"\n \"Yeah,\" he said. \"I guess.\"\n \"I suppose,\" I said, \"when you turn around and take a good long look at it, it all becomes very obvious. But I was right in the room with the son of a bitch and it never even occurred to me. For Christ\u0027s sake, it was his gun. The son of a bitch used his own gun!\"\n TWENTY-EIGHT\n He sits, watching the lights of the city go on and off, on and off. It\u0027s the middle of the afternoon, but on his computer it is forever night, and his screensaver is tireless. Office and apartment lights wink on and wink off, and gradually buildings change their shapes, adding floors, losing floors, becoming wider or narrower. The idea, of course, is that each tiny subsection of the monitor will have its turn to be dark, and thus no single high-traffic spot will burn out ahead of the others.\n Is this a real problem? Do computer screens ever burn out? With the relentless march of technology, does anyone actually keep a piece of equipment long enough for wear and tear to affect it?\n Probably not. Every year- every six months- the new computers are faster and more powerful, and cost less than the previous generation. Soon he\u0027ll replace his own computer. There is nothing wrong with it, it does everything he could possibly require of it, but he\u0027ll replace it with one that is newer-better-faster… and he\u0027ll dutifully install his screensaver on his new hard drive.\n All so he can watch lights wink on and off…\n He lowers a finger, touches a key, and the screensaver is gone. He touches more keys, clicks his mouse, and in no time at all (though the next machine will do it even faster) he\u0027s on-line. \n","sourceLink":"https://allnovel.net/hope-to-die-matthew-scudder-15/page-34.html","bookId":2333,"book":{"id":2333,"title":"Hope to Die (Matthew Scudder #15)","description":"Storyline: \n Hope to Die (Matthew Scudder #15) \n The city caught its collective breath when upscale couple Byrne and Susan Hollander were slaughtered in a brutal home invasion. Now, a few days later, the killers themselves have turned up dead behind the locked door of a Brooklyn hellhole -- one apparently slain by his partner in crime who then took his own life. \n There\u0027s something drawing Matthew Scudder to this case that the cops have quickly and eagerly closed: a nagging suspicion that a third man is involved, a cold, diabolical puppet master who manipulates his two accomplices, then cuts their strings when he\u0027s done with them. No one but Scudder even suspects he exists. And his worst fear is that the guy is just getting started ...\n \n","cover":"https://allnovel.net/images/hope-to-die-matthew-scudder-15.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/hope-to-die-matthew-scudder-15.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:54:36 AM"}}
