{"id":64675,"no":47,"title":"Page 47","content":"I was reaching for my notebook when T J said, \"One sixty-eight.\"\\n\\n \"That\u0027s some memory, Tom Jones.\"\\n\\n \"He was out there,\" I said.\\n\\n \"When was this?\"\\n\\n \"Few days ago,\" T J said. \"Met all but one of them. They showed me what they doin\u0027, the renovations an\u0027 all.\"\\n\\n \"They just gave you the grand tour?\"\\n\\n \"They under the \u0027pression I from the Buildings Department,\" he said. \"They was doin\u0027 a whole lot of work on that house.\"\\n\\n \"That\u0027s nothing,\" Wentworth said. \"You\u0027re not gonna recognize the place.\"\\n\\n It had taken them a while to get the fire under control, but it was out by the time we got there, and the last hook-and-ladder unit was just pulling away as Wentworth angled in next to a red NYFD inspector\u0027s car.\\n\\n I saw, but barely registered, the crowds of onlookers, the booted firemen walking around, the house itself with its windows gone and great holes chopped in its roof. We walked in, escorted by a fire inspector and a cop from the local precinct. Crime lab personnel were on the scene, along with someone from the medical examiner\u0027s office.\\n\\n We climbed stairs to the top floor and worked our way down. Most of the internal walls had been removed in the renovation, so we didn\u0027t have to go room to room; each floor was just one large room, and each room held its dead.\\n\\n On the top floor, a large man lay on his side, one arm under his body, the other flung out to the side. He\u0027d been pretty thoroughly roasted in the fire, and there wasn\u0027t enough of his face left to offer a clue of what he looked like.\\n\\n \"Stabbed twice, maybe more,\" somebody said. \"They were all stabbed, though it\u0027s easier to tell with some of them than with the others. There\u0027s empty drums of muriatic acid all over the place. You use it to get plaster residue off brick, and it looks as though he sloshed it over their faces. But we won\u0027t know for a while how much damage the acid did and how much was the fire, because everybody got a second dousing with accelerant before the place went up.\"\\n\\n T J said the dead man was Peter Meredith, basing his identification on the corpse\u0027s girth. One floor down we found two more bodies, killed the same way, disfigured and burned the same way. T J was less certain, but guessed we were looking at all that was left of Marsha Kittredge and Lucian Bemis. They lay side by side, with the smaller figure nestled in the crook of the larger one\u0027s arm.\\n\\n The fire had been a little less intense on the first floor, at least at the front of the house where the two bodies lay. The man\u0027s hands and face had been bathed in muriatic acid, and his hair and most of his clothing had been burned away, but it was easy to spot the stab wounds in his chest.\\n\\n \"Kieran Eklund,\" T J said. \"Never did meet him, but that there\u0027s Ruth Ann Lipinsky. Just about enough left of her to recognize.\"\\n\\n She lay a few feet away, her face eroded by the acid, her hair burned away in the fire, her throat slashed. Blood had gouted from the wound and pooled around her, and big bloody footprints, still distinguishable after the fire, led diagonally across the floor to a stairway at the rear.\\n\\n \"He went out the back,\" I said, but the fire inspector shook his head.\\n\\n \"He didn\u0027t go anywhere,\" he said.\\n\\n The stairs down to the basement had mostly burned away. A portable metal ladder, marked FDNY, had been laid down over what remained of it, and we made our way down it one at a time. The cellar floor was a couple of inches deep in water, among other things.\\n\\n There was a pile of rags at the foot of the stairs. Except it wasn\u0027t a pile of rags.\\n\\n \"Crispiest critter of them all,\" the fire inspector said, nudging the corpse with a booted foot. \"That\u0027s a hunting knife next to him, and what do you bet it\u0027s the one made those cuts upstairs? I\u0027d say the odds are good. You want to know what happened?\"\\n\\n \"I\u0027d love to know what happened,\" Wentworth said.\\n\\n \"I can tell you how we reconstruct it, based on preliminary observations. It\u0027s all subject to change when we\u0027ve reached the stage where we\u0027re ready to release a full report.\"\\n\\n \"Understood.\"\\n\\n \"He went floor by floor, starting at the top. Killed the guy on the top floor, came down a flight, did the man and woman, one more flight and killed the last couple. Though how he managed to do all that without anybody resisting is something I\u0027m glad it\u0027s not my job to figure out.\"\\n\\n \"They were patients of his,\" I said. \"He was somewhere between a father figure and a cult leader.\"\\n\\n \"Maybe they drank Kool-Aid first,\" Wentworth said.\\n\\n \"Whatever,\" the fire inspector said. \"He killed the last one and went upstairs again and did what he did with the muriatic acid, and then poured accelerant over the bodies and elsewhere on the various floors. It looks as though he had all kinds of accelerants to choose from and it looks as though he used them all. Paint thinner, turpentine, joint compound, different kinds of solvents. They were artists, and between their art supplies and what they were using for renovation, they had enough accelerant to burn down Mount Everest. Worked his way down killing, worked his way down a second time with the acid and the accelerant.\\n\\n \"Time he got down here he was running low on accelerant, or maybe it was beginning to dawn on him that he better move his ass before the place went up like a torch. So he went a little light on the accelerant, and he stepped in the blood, and tracked it across the floor.\"\\n\\n \"Sloppy,\" somebody said.\\n\\n \"Down here,\" the inspector went on, \"is what he was saving the rest of the accelerant for, and his instincts were good, because fire burns up, not down. He splashed shit all over the place, and then he did something you never want to do when you\u0027re fixing to burn your house down.\"\\n\\n \"Lit a cigarette?\"\\n\\n \"Well, he could have, if he was dumber than shit. If he was not quite that stupid, my guess is he decided he needed a little more light, and he flicked that switch right over there. You flick a light switch, you\u0027re apt to get a little bit of a spark. You never see it and it doesn\u0027t amount to anything, unless you happen to be in a room full of volatile fumes, which he was. Boom- instant explosion, instant wall of flame, and we can only hope he knows better next time.\"\\n\\n \"Fucking electricity,\" someone said. \"He shoulda used a candle.\"\\n\\n \"If only,\" the inspector said. \"One other possibility, before you all clear out of here and go home to the dinners you\u0027ve no longer got any stomach for. It\u0027s just as possible he knew what he was doing. If he figured it was all up and he wanted to join his fellow cult members in the next world, well, this way he\u0027d go fast. It might not be much fun while it lasted, but it wouldn\u0027t last very long. Any questions, gentlemen?\"\\n\\n Wentworth said, \"Anybody got a flashlight?\" And, when one was handed to him, \"Is it all right to turn this on? Is it safe?\"\\n\\n \"I don\u0027t think you get a spark from a flashlight,\" the inspector said. \"And you may not have noticed it, but they already had their fire here.\"\\n\\n \"Looks like something on that wall,\" Wentworth said, and flicked on the flashlight.\\n\\n \"I noticed that before,\" the inspector said. \"I thought it was blood at first, but it looks like he used red paint.\"\\n\\n \" \u0027I came like water and like wind I go. Audrey Beardsley.\u0027 Who in the hell is Audrey Beardsley?\"\\n\\n \"I think it\u0027s Aubrey Beardsley.\"\\n\\n \"Is that a B? All right, maybe it is. Same question. Who the hell is Aubrey Beardsley?\"\\n\\n \"An illustrator,\" I said. \"Around the turn of the century. And he didn\u0027t write those lines. They\u0027re from the The Rubбiyбt of Omar Khayyбm.\"\\n\\n \"Maybe Beardsley was easier to spell,\" someone suggested.\\n\\n Wentworth said, \"Arden Brill, Adam Breit, and Aubrey Beardsley. I guess he wanted to hang on to his monogrammed luggage.\" He pointed the flashlight at all that was left of our mystery man. He said, \"Well? Does he look familiar?\"\\n\\n He didn\u0027t even look human. Then something caught my eye, and I reached for the flashlight. I stooped down and aimed it where I\u0027d seen a glint of something, reached and picked it up.\\n\\n A gold chain, its links melted and fused. And, hanging from it, an O-shaped disc of mottled pink stone.\\n\\n FORTY\\n\\n On Saturday Mostly Mozart had its final concert of the season. I went with Elaine, and we took ourselves out to a late dinner afterward. The festival had lasted just four weeks, and had served as muted accompaniment for more bloodshed than you get in your average opera. The death toll was pretty high- Byrne and Susan Hollander, Jason Bierman, Carl Ivanko, Lia Parkman, Deena Sur from the massage parlor, Peter Meredith and his four housemates, and, finally, Adam Breit or Arden Brill or Aubrey Beardsley, as you prefer.\\n\\n That\u0027s an even dozen, but the count reached thirteen the middle of the following week, when Ira Wentworth told me he\u0027d played a hunch, and had the ME\u0027s office run some checks on unidentified corpses they\u0027d accumulated during the past eight or ten months. A floater, recovered from the Hudson in the spring after having spent a couple of months in the water, was now identifiable on the basis of dental records as all that was left of Harold Fischer. The distinguished paleontologist hadn\u0027t gone to France after all, and it was now clear how Adam Breit, unable to pay his rent at Broadway and Waverly, had suddenly been able to afford a handsome apartment in an elegant building on Central Park West.\\n\\n I brought Wentworth into the kitchen and made a pot of coffee, and again he commented on how good it was. I asked what dental records or anything else might have had to say about the body in the basement, and he said, \"It\u0027s got to be him, don\u0027t you think?\"\\n\\n \"It\u0027d be nice to confirm it. What about DNA? Can\u0027t they get it from a burned body?\"\\n\\n \"They can get it from dinosaur bones,\" he said. \"Remember Jurassic Park? They got plenty of DNA from him.\"\\n\\n \"And?\"\\n\\n \"And there\u0027s nothing to match it to, that\u0027s the whole problem.\"\\n\\n \"What about the Kleenex in the massage parlor?\"\\n\\n \"Somebody went through the bucket of tissues,\" he said. \"You know, whenever I start whining that I\u0027ve got the worst job in America, just remind me of that poor schmuck, will you? But they went through it and they didn\u0027t find anything that matched. Which might mean he\u0027s a fucking criminal genius who really did fish his own scum-soaked tissue out of the bucket, or it might mean that little scientific report we found on his computer was founded upon a lie.\"\\n\\n \"He never went to the massage parlor?\"\\n\\n \"He never got off. He didn\u0027t come, and therefore there was no reason for her to use a Kleenex and no DNA to throw away. And that\u0027s why he killed her, but he didn\u0027t want to face the fact he was sexually inadequate, so he told himself that\u0027s not how it happened, here\u0027s how it happened, and wrote it all up.\"\\n\\n \" \u0027I may be a killer, but I ain\u0027t no limp-dick wuss.\u0027 \"\\n\\n \"Something like that, yeah.\"\\n\\n \"Maybe,\" I said. \"Of course there\u0027s another possibility we haven\u0027t mentioned.\"\\n\\n \"I don\u0027t even want to think about it.\"\\n\\n \"He faked his own death once already,\" I said, \"and left a stooge behind in his place.\"\\n\\n \"Jason Bierman.\"\\n\\n \"Uh-huh. Fire inspector said there were two possibilities, either he accidentally touched off the explosion and fire before he could get out of the building, or he wanted to go down with the ship. I thought of a third one right away.\" \\n\\n","sourceLink":"https://allnovel.net/hope-to-die-matthew-scudder-15/page-47.html","bookId":2333,"book":{"id":2333,"title":"Hope to Die (Matthew Scudder #15)","description":"Storyline: Hope to Die (Matthew Scudder #15) \\n The city caught its collective breath when upscale couple Byrne and Susan Hollander were slaughtered in a brutal home invasion. Now, a few days later, the killers themselves have turned up dead behind the locked door of a Brooklyn hellhole -- one apparently slain by his partner in crime who then took his own life. \\n There\u0027s something drawing Matthew Scudder to this case that the cops have quickly and eagerly closed: a nagging suspicion that a third man is involved, a cold, diabolical puppet master who manipulates his two accomplices, then cuts their strings when he\u0027s done with them. No one but Scudder even suspects he exists. And his worst fear is that the guy is just getting started ...\\n","cover":"https://allnovel.net/images/hope-to-die-matthew-scudder-15.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/hope-to-die-matthew-scudder-15.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:54:36 AM"}}
