{"id":39868,"no":1,"title":"Chapter I Mushrooms","content":"\"La célébrité est comme le feu, qui br?le de près et illumine de loin.\" Under a glorious sky, in the year 1869, Paris gathered to rejoice in the centenary of the birth of the First Napoleon. A gathering this of mushroom nobility, soldiery and diplomacy, to celebrate the hundredth anniversary of the greatest mushroom that ever sprang to life in the hotbed of internecine strife. \"Adventurers all,\" said John Turner, the great Paris banker, with whom I was in the Church of the Invalides; \"and yonder,\" he added, indicating the Third Napoleon, \"is the cleverest.\" We had pushed our way into the gorgeous church, and now rubbed elbows with some that wore epaulettes on peaceful shoulders. There were ladies present, too. Did not the fair beings contribute to the rise and fall of that marvellous Second Empire? Representatives of almost every European power paid homage that day to the memory of a little Corsican officer of artillery.[2] As for me, I went from motives of curiosity, as, no doubt, went many others, if indeed all had so good a call. In my neighbourhood, for instance, stood a stout gentleman in court uniform, who wept aloud whenever the organ permitted his grief to be audible. \"Who is that?\" I inquired of my companion. \"A Legitimist, who would perhaps accept a Napoleonic post,\" replied John Turner, in his stout and simple way. \"And is he weeping because the man who was born a hundred years ago is dead?\" \"No! He is weeping because that man\u0027s nephew may perchance note his emotion.\" One could never tell how dense or how acute John Turner really was. His round, fat face was always immobile and fleshy—no wrinkle, no movement of lip or eyelid, ever gave the cue to his inmost thought. He was always good-natured and indifferent—a middle-aged bachelor who had found life not hollow, but full—of food. Nature having given me long legs (wherewith to give the slip to my responsibilities, and also to the bailiffs, as many of my female relatives have enjoyed saying), I could look over the heads of the majority of people present, and so saw the Emperor Napoleon III for the first time in my life. The mind is, after all, a smaller thing than those who deny[3] the existence of that which is beyond their comprehension would have us believe. At that moment I forgot to think of all that lay behind those dull, extinguished eyes. I forgot that this was a maker of history, and one who will be placed by chroniclers, writing in the calm of the twentieth century, only second to his greater uncle among remarkable Frenchmen, and merely wondered whether Napoleon III perceived the somewhat obtrusive emotion of my neighbour in the court uniform. But a keener observer than myself could scarce have discerned the information on the still, pale features of the Emperor, who, indeed, in his implacability always reminded me more of my own countrymen than of the French. The service was proceeding with that cunning rise and fall of voice and music which, I take it, has won not a few emotional souls back to the Mother Church. Suddenly John Turner chuckled in a way that fat people have. \"Laughing at your d—d piano-case,\" he explained. I had told him shortly before how I had boarded the Calais boat at Dover in the form and semblance of a piano, snugly housed in one of Messrs. Erard\u0027s cases, while my servant engaged in pleasant converse on the quay the bailiff who had been set to watch for me: this, while they were actually slinging me on board. The picture of the[4] surprise of my fellow-passengers when Loomer gravely unscrewed me and I emerged from my travelling-carriage in mid-channel had pleased John Turner vastly. Indeed, he told the story to the end of his days, and even brought that end within hail at times by an over-indulgence in apoplectic mirth. He chuckled at it now in the midst of this solemn service. But I, more easily moved perhaps by outward show and pomp, could only think of our surroundings. The excitement of giving my creditors the slip was a thing of the past; for those were rapid days, and I no laggard, as many took care to tell me, on the heel of the flying moment. The ceremony in which we were taking part was indeed strange enough to rivet the attention of any who witnessed it—strange, I take it, as any historical scene of a century that saw the rise and fall of Napoleon I. Strange beyond belief, that this dynasty should arise from ashes as cold as those that Europe heaped on St. Helena\u0027s dead, to celebrate the birth of its founder! Who would have dared to prophesy fifty years earlier that a second Emperor should some day sit upon the throne of France? Who would have ventured to foretell that this capricious people, loathing as they did in 1815 the name of Buonaparte, should one day choose by universal suffrage another of that family to rule over them?[5] Few of those assembled in the great tomb were of devout enough mind to take much heed of the service now proceeding at the altar, where the priest droned and the incense rose in slow clouds towards the dome. We all stared at each other freely enough, and in truth the faces of many, not to mention bright uniforms and brilliant names, warranted the abstraction from holy thought and fervour. The old soldiers lining the aisle had fought, some at Inkerman, some at Solferino, some in Mexico, that land of ill-omen. The generals of all nations, mixing freely in the crowd, bowed grimly enough to each other. They had met before. It was indeed a strange jumble of prince and pauper, friend and foe, patriot and adventurer. And the face that drew my gaze oftenest was one as still and illegible now as it was on the morning of January 11, four years later, when I bowed before it at Chiselhurst. The Third Napoleon, with eyes that none could read—a quiet, self-possessed enigma—passed down the aisle between his ranked soldiers, and the religious part of the day\u0027s festivities was over. Paris promised to be en fête while daylight lasted, and at night a display of fireworks of unprecedented splendour was to close the festive celebration. There is no lighter heart than that which beats within the narrow waistcoat of the little Parisian[6] bourgeois, unless indeed it be that in the trim bodice of madame his wife; and even within the church walls we could hear the sound of merriment in the streets. When the Emperor had gone we all moved towards the doors of the church, congratulating each other, embracing each other, laughing and weeping all in one breath. One near to me seized my hand. \"You are English!\" he cried. \"I am.\" \"Then embrace me.\" We embraced. \"Waterloo\"—he called it Vatterlo—\"is forgotten. It is buried in the Crimea,\" cried this emotional son of Gaul. He was a stout man who had partaken of garlic at déje?ner. \"It is,\" I answered. And we embraced again. Then I got away from him. It was gratifying but inexpedient to be an Englishman at that moment, and John Turner, whose clothes were made in Paris, silently denied me and edged away. Others seemed desirous of burying Waterloo also, but I managed the obsequies of that great victory with a shake of the hand. \"Vive l\u0027Empereur!\" they cried. \"Long live Napoleon!\"[7] And I shouted as loud as any. Whatever one may think, it is always wise to agree with the mob. On the steps of the church I found John Turner awaiting me. \"Finished embracing your new-found friend?\" he asked me, with a shortness which may have been a matter of breath. At all events, it was habitual with this well-fed philosopher. \"We were forgetting Waterloo,\" I answered. At that moment a merry laugh behind us made me turn. It was not directed towards myself, and was doubtless raised by some incident which had escaped our notice. The mere fact that this voice was raised in merriment did not make me wheel round on my heel as if I had been shot. It was the voice itself—some note of sympathy which I seemed to have always known and yet never to have heard until this moment. A strange thing—the reader will think—to happen to a man in his thirties, who had knocked about the world, doing but little good therein, as some are ready and even anxious to relate. Strange it may be, but it was true. I seemed to have known that voice all my life—and it was only the merry laugh of a heedless girl. Has any listened to the prattle of the schoolroom without hearing at odd moments the tone of some note that is not girlish—the voice of the[8] woman speaking gravely through the chatter of the child? I seemed to hear that note now, and turning, found the owner of the voice within touch of me. She was tall and slim, with a certain fresh immaturity, which was like the scent of the first spring flowers in my own Norfolk woods at home. Flower-like, too, was her face—somewhat long and narrow, with a fair flush on it of youth, health and happiness. The merriest eyes in the world were looking laughingly into the face of an old gentleman at her side, smiling, happy eyes of innocent maidenhood. And yet here again I saw the woman in the girl. I saw a gracious lady, knowing life, and being yet pure, having learned of good and evil only to remember the good. For the knowledge of evil is like vaccine—it causes disturbance only when hidden impurity awaits it. \"Come,\" said John Turner, taking my arm, \"no one else wants to forget Waterloo.\" I went with him a little. Then I paused. \"Who is the young lady coming down the steps behind us?\" John Turner, looking over his shoulder, gave a grunt. \"Old De Clericy and his daughter,\" he answered. \"One of the families that are too old to keep pace with the times.\" \"WHO IS THE YOUNG LADY COMING DOWN THE STEPS BEHIND US?\" \"WHO IS THE YOUNG LADY COMING DOWN THE STEPS BEHIND US?\" [9] We walked on a little. \"There is a chance for you—wants a secretary,\" muttered my companion. \"Does he?\" I exclaimed, stopping. \"Then introduce me.\" \"Not I.\" \"Why?\" \"Can\u0027t introduce a man who came across in a piano-case,\" he answered, with a laugh, which made me remember that this was a man of station and some standing in Paris, while I was but a vagabond and ne\u0027er-do-well. \"Then I\u0027ll introduce myself,\" I said, hastily. John Turner shrugged his broad shoulders and walked on. As for me, I stopped and on the impulse of the moment turned. Monsieur and Mademoiselle de Clericy were coming slowly towards me, and more than one looked at the fair young girl with a franker admiration than I cared about, while she was happily unconscious of it. It would seem that she must lately have left the convent, for the guileless pink and white of that pure life lingered on her face, while her eyes danced with an excitement out of all proportion to the moment. What should she know of Napoleon I, and how rejoice for France when she knew but little of the dark days through which the great general had brought that land?[10] I edged my way towards them through the crowd without pausing to reflect what I was about to do. I had run away from my creditors, it is true, but was not called upon to work for my living. The Howards had not done much of that, so far as I knew; though many of my ancestors, if one may credit the old portraits at home, had fought for rights, and even wrongs, with considerable spirit and success. The throng was a well-dressed one, and consequently of a cold and evil temper if one worked against it. I succeeded, however, in reaching Monsieur de Clericy and touched his arm. He turned hastily, as one possessing foes as well as friends, and showed me a most benevolent countenance, kindly and sympathetic even when accosted by a total stranger. \"Monsieur de Clericy?\" I asked. He peered up at me with pleasant, short-sighted eyes while returning my salute. \"But yes. Am I happy enough to be able to do anything for Monsieur?\" He spoke in a high, thin voice that was almost childlike, and a feeling of misgiving ran through me that one so young and inexperienced as Mademoiselle de Clericy should be abroad on such a day with no better escort than this old man. \"Pardon my addressing you,\" I said, \"but I[11] hear that you are seeking a secretary. I only ask permission to call at your hotel and apply for the post.\" \"But, mon grand monsieur,\" he said with a delightful playfulness, spreading out his hands in recognition of my height and east-country bulk, \"this is no time to talk of affairs. To-day we are at pleasure.\" \"Not all, Monsieur; some are busy enough,\" I replied, handing him my card, which he held close to his eyes, after the manner of one who has never possessed long or keen sight. \"What determination!\" he exclaimed, with an old man\u0027s tolerance. \"Mon Dieu! these English allies of ours!\" \"Well!\" he said, after a pause, \"if Monsieur honours me with such a request, I shall be in and at your service from ten o\u0027clock to-morrow morning.\" He felt in his pocket and handed me a card with courtesy. It was quite refreshing to meet such a man in Paris in 1869—so na?ve, so unassuming, so free from that aggressive self-esteem which characterized Frenchmen before the war. Since I had arrived in the capital under the circumstances that amused John Turner so consumedly, I had been tempted to raise my fist in the face of every second flaneur I met on the boulevard. Again I joined my English friend, who was[12] standing where I had left him, looking around him with a stout, good-natured tolerance. \"Well,\" he asked, \"have you got the situation?\" \"No; but I am going to call to-morrow morning at ten o\u0027clock and obtain it.\" \"Umph!\" said John Turner; \"I did not know you were such a scoundrel.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2820/77922.html","bookId":1258,"book":{"id":1258,"title":"Dross","description":"简介： La clbrit est comme le feu, qui br?le de prs et illumine de loin.Under a glorious sky, in the year 1869, Paris gathered to rejoice in the centenary of the birth of the First Napoleon. A gathering this of mushroom nobility, soldiery and diplomacy, to...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2820","creation":"Aug 1, 2019 12:24:44 AM","modification":"Aug 1, 2019 12:24:44 AM"}}
