{"id":39896,"no":29,"title":"Chapter XXVIII The Links","content":"\"La plus grande preuve d\u0027abnégation que donne l\u0027amitié, c\u0027est de vivre à coté de l\u0027amour.\" Earlier in this record mention has been made—and, indeed, the reader\u0027s attention called thereto—of certain events which, in the light of subsequent knowledge, pieced themselves together like links of a chain into one complete whole. During the quiet months that closed the year of the Commune I dwelt at Hopton, Isabella being away, and Little Corton in the care of a housekeeper. Leisure was thus afforded me for the task of piecing together these links of the past. It was hard at first to realise that those few moments passed on the pierhead at Genoa did not form part of my illness and the dreamy memories of that time. But having always been of a matter of fact mind I allowed myself no illusions in this respect, and this strange detail of an incomprehensible life forced itself upon my understanding at length when the inexplicable became dimly legible. In my native air I soon picked up strength, for[313]getting, in truth, my wounds and illness before the shooting season. Nevertheless, I throw a gun up to my shoulder less nimbly than I did before Miste\u0027s bullet found its billet among the muscles of my arm. Madame de Clericy and Lucille had returned to Paris, but, the former wrote me, were anxious to get away from the capital, which no longer offered a pleasant home to avowed Legitimists. Madame still entrusted me with the management of her affairs, which I administered tant bien que mal by correspondence, and the harvest promised to be such a good one as to set our minds at rest respecting the immediate future. Alphonse Giraud passed a few days, from time to time, with the ladies, but he being a poor correspondent, and I no better, we had but little knowledge of each other at this time. Madame, I observed, made but brief reference to Lucille now. \"Alphonse is with us,\" she would write, and nothing else; or \"Lucille keeps well and is ever gay,\" with which scant details I had to content myself. Twice she invited me to pass some days, or weeks, if it could be so arranged, at the Rue des Palmiers, and twice I refused. For in truth I scarcely wished to meet Madame de Clericy until my chain was pieced together and I could lay[314] before her a tale of evidence that had no weak link in it. In the month of September I journeyed to Paris, staying there but two days, and so arranging my movements that I met neither Madame de Clericy and her daughter nor Alphonse. I succeeded beyond my expectations in forging an important link. \"Perhaps, as you cannot leave your estates just now,\" Madame had written, \"you will come to us at La Pauline towards the end of the vintage. Indeed, my friend, I must ask you to make an effort to do so, for I learn that the harvest will be a heavy one, and your judgment will be required in financial matters since you are so good as to place it at our disposal.\" To this I had returned a vague answer, thinking that before that time Alphonse might have news to tell us which would alter many arrangements and a few lives. For now that he had recovered a greater part of his vast wealth there could, assuredly, be no reason for further delay in pressing his suit auprès de Lucille. I had, by the way, propounded to John Turner the problem that would arise in the case of our having to conclude that Miste\u0027s confederate had perished in the ill-fated Principe Amadeo, taking out of this world, if he could not carry it to the next, the remainder of Giraud\u0027s fortune.[315] \"Within five years,\" he answered me, \"Giraud will be repaid the value of the missing drafts, for we have now a sufficient excuse to stop payment of them, assuming, as we may safely do, that the bills were lost at sea.\" In the same letter my old friend imparted some news affecting myself. \"I am,\" he wrote, \"getting on in years, and fatter. In view of these facts I have made a will leaving you, by the way, practically my heir. A man who could refuse to marry such a pretty girl as Isabella Gayerson, with such an exceedingly pretty fortune as she possesses, deserves to have money troubles; so I bequeath \u0027em to you.\" Towards the end of September Madame again wrote to me with the information that they were installed at La Pauline for the winter, and begged me to name the day when I could visit them. With due deliberation I accepted this invitation, and wrote to Giraud in Paris that I was about to pass through that city, and would much like to see him as often as possible. \"You know, Dick,\" he said to me, when we had dined together at his club, \"it is better fun being ruined. All this money—Mon Dieu—what a trouble it is!\" \"Yes,\" answered I—and the words came from[316] my heart—\"it only brings ill fortune to those that have it.\" Nevertheless, Alphonse Giraud was quite happy in the recovery of his wealth, and took much enjoyment in its expenditure on others. Never, surely, beat a more generous heart than Giraud\u0027s, for whom to spend his money on a friend was the greatest known happiness. \"You remember,\" he cried, \"how we used to drink our Benedictine in claret glasses only. Ah! what it is to be young, n\u0027est ce pas! and to think that we shall one day get all we want!\" His quick face darkened suddenly, and all the boyishness vanished from it. \"I have been,\" he said, \"a famous fool—and thou art another, my grim-faced Englishman. But I have found out my folly, and discover that there is still happiness in this world—enough to go on with, at all events.\" I rose to bid him good-night, for I had to make an early start the next morning. \"I only hope, mon ami,\" he said, taking my hand in his small fingers, \"that the good God will show you soon what a fool you have been.\" I arrived at Draguignan late on the following evening, and put up at the H?tel Bertin there, than which the traveller will find no better accommodation in Provence. I had not named the hour or day[317] of my proposed arrival at La Pauline, knowing that the affairs of Madame de Clericy might delay me in Paris, which, in fact, they did. The next morning I set out on foot for the Chateau of La Pauline by the road passing through the vineyards and olive groves lately despoiled of their fruit. The rich hues of autumn were creeping up the mountains, where the cool air of the upper slopes preserved the verdure longer than in the sunburnt valley. The air was light and fresh, with a brisk breeze from the west. The world seemed instinct with fruition and the gathering of that which had been sown with toil and carefulness. Is it the world that fits itself to our humour, or does the Creator mould our thoughts with wind and sky, light and shade? As I neared the Chateau my heart sank within me, for I had but evil news for the lady whom I respected above all women, save one—and how would Madame take my tidings? It seemed best to ask her to speak to me alone, for much that I had to relate was surely for the wife\u0027s ear, and would need to be tempered to the daughter\u0027s hearing. This expedient was, however, spared me, for as I approached the old Chateau I noted the presence of some one in the trellis-covered summerhouse at the eastern end of the terrace, and caught the flutter of what seemed to be a white handker[318]chief. It was, I soon perceived, Madame at her lace-work—and alone. Leaving the road I took a path through the olive groves and came upon Madame, not however by surprise, for she saw me approaching and laid aside her work. \"So you have come at last,\" she said, holding out her kind hand. We went into the vine-grown hut and sat down, Madame looking at me with deep speculation. \"You are a strong man, mon ami,\" she said. \"For one sees no signs in your face of what you have gone through.\" But it was not of myself that I had come to talk. The tale had to be told to Madame de Clericy, and being a plain-spoken Englishman and no hero of a book, I purposed telling it briefly without allegory or symbol. \"Madame,\" I said, \"it was not Miste who took the money. It was not the Baron Giraud that we buried from the Rue des Palmiers. It was not the Vicomte de Clericy that we found in the Seine near Passy and laid to earth in the churchyard at Senneville.\" And I saw that the Vicomtesse thought me mad. \"My poor friend,\" she said, with the deepest [319]pity in her voice, \"why do you talk like that, and what do you mean?\" THE VICOMTESSE TURNED A LITTLE IN HER CHAIR, AND, LEANING HER ELBOW ON THE TABLE, SHOWED ME ONLY HER PROFILE AS SHE SAT, WITH HER CHIN IN THE PALM OF HER HAND, LOOKING DOWN INTO THE VALLEY. THE VICOMTESSE TURNED A LITTLE IN HER CHAIR, AND, LEANING HER ELBOW ON THE TABLE, SHOWED ME ONLY HER PROFILE AS SHE SAT, WITH HER CHIN IN THE PALM OF HER HAND, LOOKING DOWN INTO THE VALLEY. \"I only mean, Madame, that no man is safe in temptation, and that money is the greatest of all. I would not trust myself with ten million francs. I would not now trust any man on earth.\" \"Why?\" And I thought that in Madame\u0027s eyes there was already the light of understanding. For a moment I paused, and she said quickly: \"Is my husband alive?\" \"No, Madame.\" The Vicomtesse turned a little in her chair, and, leaning her elbow on the table, showed me only her profile as she sat, with her chin in the palm of her hand, looking down into the valley. \"Tell me all you know,\" she said. \"I will not interrupt you; but do not pity me.\" \"The Baron Giraud did my old patron a great wrong when, in his selfish fear, he placed that great fortune in his care. For it appears that no man may trust himself where money is concerned, and no other has a right to tempt him. So far as we can judge, the Vicomte had all that he could want. I know he had more money than he cared to spend. You are aware, Madame, that I had the greatest respect and admiration for your husband. During the months that we were in daily intercourse he[320] endeared himself to me by a hundred kindnesses, a thousand tokens of what I hope was affection.\" Madame nodded briefly, and I hastened on with my narrative, for suspense is the keenest arrow in the quiver of human suffering. \"What I have learnt has been gathered with the greatest care from many sources, and what I now tell you is neither known nor suspected by any other on earth. If you so desire, the knowledge can well remain the property of two persons only.\" \"My friend,\" Madame said on the impulse of the kindest heart in the world, \"I think your strength lies in the depth of your thought for others.\" \"The Vicomte was tempted,\" I went on. \"He had in his nature a latent love of money. The same is in many natures, but the majority have never the opportunity of gratifying it. He did what ninety-nine out of a hundred other men would have done—what I think I should have done myself. He yielded. He had at hand a ready tool and the cleverest aid in Charles Miste, who actually carried the money, but for some reason—possibly because he was unable to forge the necessary signatures—could not obtain the cash for the drafts without the Vicomte\u0027s assistance. Unconsciously, I repeatedly prevented their meeting, and thus frustrated the design.\"[321] All the while Madame sat and looked down into the valley. Her self-command was infinite, for she must have had a thousand questions to ask. \"It was, I think, my patron\u0027s intention to go to the New World with his great wealth and there begin life afresh—this, however, is one of the details that must ever remain incomprehensible. Possibly when the temptation gripped him he ceased to reflect at all—else he must assuredly have recognised all that he was sacrificing for the mere possession of money that he could never live to spend. Men usually pay too high a price for their desires. In order to carry out his scheme he conceived and accomplished—with a strange cunning, which develops, I am told, after crime—a clever ruse.\" Madame turned and looked at me for a moment. \"We must think of him, Madame,\" I explained, \"as one suffering from a mental disease; for the love of money in its acute stages is nothing else, lacking, as it assuredly does, common sense. The most singular part of his mental condition was the rapidity and skill with which he turned events to his own advantage, and seized each opportunity for the furtherance of his ends. The Baron Giraud died at the H?tel Clericy—here was a chance. The Vicomte, with a cunning which was surely unnatural—you remember his strange behaviour at[322] that time, how he locked himself in his study for hours together—took therefore the Baron\u0027s body from the coffin, dressed it in his own garments, placed in the clothing his own purse, and pocket-book, and cast the body into the Seine. I have had the coffin that we laid in Père la Chaise exhumed and opened. It contained only old books from the upper shelves in the study in the Rue des Palmiers. The Vicomte must have packed it thus when he took the Baron\u0027s body—doubtless with Miste\u0027s clever aid—and threw it into the river for us to find and identify.\" \"Yes,\" said Madame, slowly, \"he was cleverer than any suspected. I knew that.\" \"The body,\" I went on, for my tale was nearly done, \"which we found at Passy and buried at Senneville was undoubtedly that of the Baron Giraud. This, however, is the only detail of my story which I am unable to assert as a positive fact.\" \"Of the rest you have no doubt?\" Madame asked, slowly. And I shook my head. \"Is it not possible,\" she suggested, with that quiet sureness of judgment which, I think, is rarely given to women, \"that Miste is alone responsible and the criminal? Of course, I cannot explain the Baron Giraud\u0027s disappearance—but it is surely[323] possible that Miste may have murdered the Vicomte and thrown his body into the Seine.\" \"No, Madame, there has been no murder done.\" \"You are sure?\" \"I have, since the war, seen the Vicomte alive and well.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2820/78379.html","bookId":1258,"book":{"id":1258,"title":"Dross","description":"简介： La clbrit est comme le feu, qui br?le de prs et illumine de loin.Under a glorious sky, in the year 1869, Paris gathered to rejoice in the centenary of the birth of the First Napoleon. A gathering this of mushroom nobility, soldiery and diplomacy, to...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2820","creation":"Aug 1, 2019 12:24:44 AM","modification":"Aug 1, 2019 12:24:44 AM"}}
