{"id":93416,"no":18,"title":"Page 18","content":"Kelly was gone when Ramsey rose the following night. The house was empty, silent as a tomb. An apt comparison, he mused bleakly. He showered, dressed, then wandered through the dark, quiet house. He paused in the third-floor turret room, staring down at the grounds below. Where had she gone? Back to that seedy hotel? Or one like it? Why had she really left? He couldn\u0027t believe she was jealous of his feelings for Marisa. The few weeks he had shared with Kelly had been the happiest of his life. He smiled bitterly. Or death. She had banished his loneliness. Her blood had soothed the ravening hunger within him, made it manageable. There had been times when he had felt almost human again. And her kisses... He closed his eyes, remembering. Sweet, so sweet. Damn her for making him think they could have some sort of life together, for giving him hope and then running away. He opened his eyes and stared into the darkness. He could stand here until dawn, then jump from the window. Perhaps landing on the flagstones below would render him unconscious before the sun incinerated him. And perhaps not. Kelly. His heart ached for her; his body cried out for the relief that only her blood seemed able to provide. Kelly. His mind screamed her name. Turning away from the window, he went downstairs. It was then he saw the newspaper lying open on the living room table. The headline read: NOAH FOX, RECLUSIVE MILLIONAIRE, MISSING FOUL PLAY SUSPECTED He read the story quickly. According to his household staff, Fox had spent the previous evening in his study with his financial advisor, Bryan Knowlton. Knowlton had left the house at midnight. Again, according to his staff, Fox had spent the remainder of the evening watching movies in his study, and then gone to bed. It was his habit to sleep during the day, and his absence hadn\u0027t been noted until a little after six o\u0027clock, when the butler went in to lay out Fox\u0027s attire for the evening. The butler reported that there was no sign of violence in the room. Other members of the household staff had been questioned. No one had seen Fox since the night before. No one had heard anything in the night. No one had come to the house after Knowlton left. Ramsey tossed the paper onto the kitchen table. It was possible that Fox had decided to leave town, but it seemed doubtful. If he had left on his own, wouldn\u0027t his staff know? Wouldn\u0027t his financial advisor know? Fox had lived in the city for over twenty years. Certainly, he would have taken his clothes and personal effects. Unless he didn\u0027t have time. Unless something had scared him so badly he had run for his life. Ramsey chuckled mirthlessly. There was nothing scarier than Khira. He could hear her voice in his mind, as clearly as if she stood beside him. I don\u0027t like to share. One way or another, Noah Fox was gone from the city; that much was certain. Ramsey grunted softly as he left the house. \"Three down, three to go.\" That night, he hunted with a single-mindedness that would have made Khira proud. He had no mercy in him that night, his only thought to satisfy his hunger. The beast raged within him, clawing at his vitals, demanding to be fed. Only when he was bent over his victim, his savage thirst slaked at last, did he give a thought to the woman in his arms. Only then did he realize she was hardly breathing, that her heartbeat was faint and labored. He looked up as familiar laughter reached his ears. \"Khira.\" She materialized before him: regal, ethereal, a vision with silver hair and blue eyes that could be as warm as a summer sun or as cold as winter ice. She floated toward him, her feet not touching the ground. \"Finish her, Edward. Accept what you are.\" Her voice moved over him, soft and seductive, sweetly coaxing. \"You will never be at peace until you do.\" \"Are you at peace?\" he asked. \"How many lives have you taken to satisfy your monstrous lust for blood? Do none of them haunt you?\" \"How dare you speak to me like that?\" Power coalesced around her. He felt it sizzling through the air, prickling the hair on his arms, raising the hair on his nape. She could be the answer he was looking for, he thought, if he just had the guts to push her a little harder. But not tonight. He glanced at the woman in his arms. \"How do I revive her?\" \"You don\u0027t. Take her, Edward!\" Her eyes flashed blue fire. \"You want to. I know it. And so do you.\" \"No.\" She glared at him in disgust, and with a wave of her hand, she was gone. Ramsey stared at the woman in his arms. He couldn\u0027t let her die, damn it; he couldn\u0027t. With a savage cry, he willed himself to the nearest hospital. Blocking their presence from the security guard at the door, he moved down the corridor until he found an empty gurney. He laid the woman on it, covered her with a blanket, then summoned a doctor to her side and vanished from the building. The night stretched out before him: dark and empty like his past. Like his future. Feeling a sudden need for the company of others, he speeded across town. The nightclub was crowded, filled with people who, for reasons of their own, were more comfortable hidden in the shadows than basking in the light The atmosphere was dark, the air heavy with the odor of too many bodies, too much booze. A single couple swayed on the small dance floor, their bodies so closely entwined it was hard to tell where one ended and the other began. Ramsey found a place at the end of the bar and ordered a glass of red wine. \"Edward? Edward Ramsey, is that you?\" Ramsey turned at the sound of his name, smiled at the man shouldering his way through the crowd toward him. \"Tom!\" Tom Duncan slapped him on the back. \"Ramsey, you old son of a vampire hunter, how the hell are you?\" \"I\u0027m good. What are you doing in L.A.?\" \"On the hunt, as always,\" Tom replied. He summoned the bartender and ordered a screwdriver. He punched Ramsey on the arm. \"We haven\u0027t hunted together in years. Remember the last one?\" Ramsey nodded. He stood beside the vampire\u0027s coffin, watching while Tom placed heavy silver chains across the vampire\u0027s neck, chest, and legs, then placed a large silver cross on her breast, over her heart. The vampire had awakened the moment the silver touched her skin. The air had filled with the stink of scorched flesh. The vampire had cursed them, hissing and screeching when she discovered she could not move. Her eyes had blazed red with fury and fear when Ramsey placed the stake over her heart. He had lifted the heavy wooden mallet without hesitation. It never failed to surprise him, the amount of blood that fountained from the killing wound. The vampire had screamed once. It had been Tom\u0027s lot to take the head... Ramsey\u0027s gaze moved over his old friend. He looked the same as always: his dark brown hair worn short, his brown eyes wary and watchful, old beyond his years. A heavy gold cross on a thick gold chain hung from his neck. \"I heard there were several vamps here in the city,\" Tom said, \"so when I finished up my last hunt, I thought I\u0027d come here and give you a hand.\" He slapped Ramsey on the back. \"I\u0027ve got my gear in the car. You got a line on any of them?\" \"One or two,\" Ramsey said. Tom drew back a little. \"You okay? You look a little pale.\" \"No worries,\" Ramsey said. He sipped his wine. Tom was one of the best hunters in the world. If he truly wanted to die, Tom was the answer. \"So, who\u0027s the head vamp in the city? Last I heard, it was Chiavari. I sure would like to take him out! What a coup that would be.\" Ramsey nodded, his mind racing. Tom could be the answer to everything. All he had to do was tell the hunter where Chiavari lived, where Madame Rosa lived, where Khira lived, and where he himself lived, and leave the rest to Tom. Even though they had been friends for more than fifteen years, Ramsey knew Tom wouldn\u0027t hesitate to stake him if he knew Ramsey was a vampire. The man was relentless, tenacious. Merciless. Ramsey had taught him everything he knew. Tom tossed back his drink and ordered another. \"So, what do you say we meet up tomorrow afternoon and start sniffing around?\" \"I wish I could,\" Ramsey said, thinking quickly, \"but I\u0027m leaving town.\" \"Damn, where are you headed?\" \"The beach, the mountains - who knows?\" The lie rolled easily off his tongue. \"I wouldn\u0027t admit this to anyone but you, but after that business with Kristov, my nerves are shot. I need a break.\" Tom nodded. \"That was a rough one, huh?\" \"You have no idea.\" \"How long are you gonna be gone?\" \"I\u0027m not sure. A month, maybe more.\" Duncan pulled out a scrap of paper and a pen and scribbled down his address and phone number. \"Give me a call when you get back. And don\u0027t worry, I\u0027ll look after things here while you\u0027re gone.\" With a nod, Ramsey shoved the paper into his pants pocket. Tom grinned at him. \"And try to get a little sun, will ya? You look as pale as one of the undead yourself.\" After leaving the bar, Ramsey walked the streets for hours, his mind in turmoil, his loyalties oddly divided. His first instinct was to tell Tom where the vampires of the city rested and let Tom destroy them. But how could he destroy Chiavari without hurting Marisa? And what of Madame Rosa, whom he had never met? And what of Khira... ? Of them all, Khira was perhaps the only one who posed a threat to both vampire and mortal alike. She was an indiscriminate killer - cold, efficient, ruthless. Just like Tom, he mused. Just like he himself had been until Grigori Chiavari turned his life upside down. It was near three A.M. when he found himself standing outside Chiavari\u0027s house. It was the only house on the block with lights still burning. He debated a moment, then walked up the long drive. The door opened before he could knock. Grigori stood there, shirtless and barefoot. \"Ramsey. What the hell are you doing here at this time of the morning?\" \"It\u0027s nice to see you, too.\" Chiavari took a step back. \"Well, come on in, as long as you\u0027re here.\" \"I\u0027ve had more gracious invitations,\" Ramsey muttered. \"I\u0027ve had more gracious guests.\" Ramsey followed Chiavari into the living room, which was dark. \"Where is Marisa?\" \"She is upstairs, watching TV.\" Chiavari sat down on the sofa. \"Sit down, and tell me what brings you here.\" Ramsey dropped into the chair across from the sofa. \"There\u0027s a hunter in town.\" The words hung in the air between them. \"So,\" Chiavari said at length. \"Anyone you know?\" Ramsey nodded. \"Tom Duncan.\" \"I\u0027ve heard of him. It is said he is one of the best.\" \"Yes. He knows you are here.\" Chiavari grunted, apparently unconcerned. \"He wanted us to hunt together. I guess I don\u0027t have to tell you who he wants to hunt.\" \"I can guess. Does he know about the others?\" \"I don\u0027t know.\" Ramsey laughed softly. \"He told me I looked a little pale. I told him I was leaving town. A vacation.\" \"Might be a good idea. Until you decide whose side you are on.\" \"I\u0027m not on any side,\" Ramsey retorted. \"Aren\u0027t you?\" Chiavari laced his hands behind his neck. \"Then why are you here?\" \"Because of Marisa.\" Chiavari\u0027s eyes darkened. \"What about her?\" he asked, his voice low and dangerous. \"She loves you. I do not want to see her hurt.\" \"I thought you told her she would be better off without me.\" Ramsey grunted softly. \"She told you that, did she?\" \"Of course. We have no secrets between us. So, you came to warn me to spare Marisa?\" \"I would kill you myself if I thought it would make a difference, but she loves you. Getting rid of you will not make her love me.\" He wasn\u0027t even sure he wanted her love now. It wasn\u0027t thoughts of Marisa that tormented him, but thoughts of Kelly. \"So, we have two killers in the city.\" Chiavari stretched his arms across the back of the sofa. \"Khira and Duncan. But then, we are all killers, are we not?\" Ramsey took his leave shortly after that. Chiavari\u0027s words echoed in his mind as he made his way home. Funny, he had never thought of himself as a killer when he had destroyed vampires. You couldn\u0027t kill something that was already dead. He hadn\u0027t felt like a killer until he had taken that woman\u0027s life, until he had listened to the last faint beat of her heart. The fact that he hadn\u0027t meant to kill her didn\u0027t lessen his guilt. By accident or design, the woman was still dead, and it was his fault. Duncan and Khira. Between the two of them, the city would soon be free of vampires. As for himself, he never wanted to kill again. There was blood enough on his hands already. And yet, without Kelly, the urge to kill grew stronger every night. Without her, life, such as it was, was not worth living.","sourceLink":"https://allnovel.net/after-sundown-vampire-trilogy-2/page-18.html","bookId":2297,"book":{"id":2297,"title":"After Sundown (Vampire Trilogy #2)","description":"Storyline: After Sundown (Vampire Trilogy #2) He Has Become What He Once Destroyed. Edward Ramsey has spent his life hunting vampires. Now he is one of them. Yet Edward\u0027s human conscience—and his heart—compel him to save beautiful Kelly Anderson, and soon their growing love is his reason for living. And as the ancient, stunning, and merciless vampire, Khira, seeks supremacy among Los Angeles\u0027 undead, Edward and his former nemesis, Grigori Chiavari, once Khira\u0027s lover, must unite to stop her— before the city, and everything they cherish, is in her power...After Sundown.","cover":"https://allnovel.net/images/after-sundown-vampire-trilogy-2.jpg","author":"Amanda Ashley","type":"Mystery","source":"allnovel","link":"https://allnovel.net/after-sundown-vampire-trilogy-2.html","creation":"Oct 5, 2019 8:58:34 AM","modification":"Oct 5, 2019 6:01:07 PM"}}
