{"id":93404,"no":6,"title":"Page 6","content":"Ramsey stared at the woman on the bed in horror. Kelly. Her name was Kelly, but he could not bear to call her that. Acknowledging her by name only made what he had done seem more monstrous somehow. Her skin was as white as the sheet upon which she lay. And she was still, so still. What had he done? He had kept her here for three days, trapped between life and death.\\n\\n He backed away from the bed. He hadn\u0027t meant to kill her. Never that! He was not a murderer.\\n\\n Aren\u0027t you? The voice of his conscience whispered down the tortured corridors of his mind. What of all the lives you have taken in the past ?\\n\\n \"But they were monsters. Vampires who preyed on the innocent...\"\\n\\n Sardonic, silent laughter mocked him. And now you have become one of them. You are what you hunted, Edward Ramsey, what you and your family have hated and destroyed for centuries...\\n\\n \"No!\" Anguish sliced through him, and he screamed the word in denial, even though he knew it was true. He was a vampire. He had become what he had hated, what he had spent his lifetime destroying.\\n\\n Vampire. Vampire. Vampire!\\n\\n He pressed his hands to his temples in a vain attempt to block the word and the horror it entailed, but it seemed to echo off the walls, the ceiling, even the floor.\\n\\n Vampire... vampire... vampire...\\n\\n Killer of innocents.\\n\\n Drinker of blood.\\n\\n Unholy.\\n\\n Unclean.\\n\\n Monster.\\n\\n \"No, no.\" He sank to his knees and closed his eyes to shut out the image of the woman on the bed: her body limp, lifeless, the single drop of blood that lay like a scarlet teardrop on the pale skin of her neck - but her image was burned into his brain.\\n\\n She had wanted to die...\\n\\n But even that thought offered no absolution. The Ramsey of old would have offered her comfort and solace. His family had provided protection for the innocents of the world. Yet he had feasted on her blood, drawn on her life force, until he had taken too much, taken it all. The self-satisfied restraint he had prided himself on had been nothing but an illusion.\\n\\n He had only been kidding himself, thinking he could do this, live like this. The thought that he had taken her blood, and found an almost sensual pleasure in it, burned through him like acid.\\n\\n He had killed her. He was a vampire. There was nothing to do but accept it, just as there was only one way to ensure that such a thing would never happen again. Not for the first time, he thought of walking out into the sunlight and ending his existence. Did he have the nerve to end his own life? After what he had just done, how could he not?\\n\\n Lost in his own misery, he failed to realize he was no longer alone.\\n\\n \"She is not dead,\" a low, throaty voice said. \"Soon, but not yet.\"\\n\\n Ramsey jumped to his feet and spun around, his nostrils filling with the scent of jasmine. His gaze pierced the darkness, focusing on the woman standing in the doorway. Wrapped in a long black cloak, a shadow within shadows, she was tall and slender, with silver-blond hair. And she was a vampire. A very old vampire. Her power slid over his skin, raising the hair on his arms.\\n\\n \"Who the hell are you?\" he demanded.\\n\\n A faint smile tugged at her lips. \"You might say I am your grandmother.\"\\n\\n Ramsey frowned, surprised that he was no longer afraid. \"Grandmother?\" He laughed softly. \"What big teeth you have.\"\\n\\n \"The better to eat you with, my dear,\" she replied, and her laughter joined his. \"I am Khira.\"\\n\\n \"Khira!\" The vampire who had brought Grigori across.\\n\\n \"The very same. May I come in?\"\\n\\n He hesitated, then shook his head as the habits of a lifetime of vampire hunting took over. \"I\u0027ll come out.\"\\n\\n She laughed softly and stepped aside so he could join her outside. \"What will you do with her?\" she asked, gesturing at the woman lying on the bed.\\n\\n \"What do you mean?\" He couldn\u0027t bring himself to look at the woman lying so cold and still.\\n\\n \"You seemed grieved when you thought she was dead. Will you bring her across?\"\\n\\n \"No! I don\u0027t make vampires. I destroy them.\"\\n\\n \"So you did. As did your forebears, as well. A long line of nuisances, your ancestors.\" She laughed softly. \"Trust Grigori to be the first one to bring a Ramsey across! What delicious irony. Tell me, my handsome new vampire, why do your thoughts reek of self-destruction?\"\\n\\n He looked at her, mute, disconcerted by the ease with which she read his mind.\\n\\n \"You are strong for such a young one. You have restrained yourself with your little mortal - amazing control for one so young. But you must not drink from your prize every night if you wish her to live,\" Khira went on. \"And you must feed her well. Thick soup. Red meat to strengthen her blood.\"\\n\\n She drew her cloak more closely about her. It was a gesture with no real meaning. She did not feel the cold. \"It will be interesting, I think, to see which of your natures prevails,\" she mused. \"The conscience-stricken mortal, or the strong young vampyre.\"\\n\\n And in the blink of an eye, she was gone. \\n\\n","sourceLink":"https://allnovel.net/after-sundown-vampire-trilogy-2/page-6.html","bookId":2297,"book":{"id":2297,"title":"After Sundown (Vampire Trilogy #2)","description":"Storyline: After Sundown (Vampire Trilogy #2) \\n He Has Become What He Once Destroyed. \\n Edward Ramsey has spent his life hunting vampires. Now he is one of them. Yet Edward\u0027s human conscience—and his heart—compel him to save beautiful Kelly Anderson, and soon their growing love is his reason for living. And as the ancient, stunning, and merciless vampire, Khira, seeks supremacy among Los Angeles\u0027 undead, Edward and his former nemesis, Grigori Chiavari, once Khira\u0027s lover, must unite to stop her— before the city, and everything they cherish, is in her power...After Sundown.\\n","cover":"https://allnovel.net/images/after-sundown-vampire-trilogy-2.jpg","author":"Amanda Ashley","type":"Mystery","source":"allnovel","link":"https://allnovel.net/after-sundown-vampire-trilogy-2.html","creation":"Oct 5, 2019 8:58:34 AM","modification":"Oct 5, 2019 6:01:07 PM"}}
