{"id":100255,"no":20,"title":"Page 20","content":"“Amaliya!” “Fuck you,” Amaliya answered. Chapter 12 Cian stood in the dark, staring out over the sparkling lights of downtown Austin. After Amaliya and Samantha had stormed off, he had considered following Amaliya upstairs to speak to her reasonably. It had only taken the sound of the door upstairs slamming repeatedly for him to realize that he had best let Amaliya calm down before speaking to her again. Instead, he had turned off all the lights in the downstairs area and pondered the cityscape. The change in Austin was dramatic. When Cian had arrived in the city, the tallest buildings had been the UT Tower, the capitol building, and the Westgate Tower. Now, towering buildings were rising up all around downtown. Construction sites dotted the area. Deep foundations were being dug behind hurricane fences and tall cranes hovered over the city. Even in the residential neighborhoods, older houses were being torn down in favor of more modern structures. Lamar Boulevard was under transformation as well. Older stores were gone, replaced with new modern buildings that were reminiscent of other cities far away from Austin. Yet, he couldn\u0027t mourn the past of Austin like others did. He was a vampire and during his long life he had watched the entire world change. Every decade was vastly different from the one before. Technology leaped forward every year now. Cian remembered his fascination with electricity, phones and automobiles when they had first appeared on the landscape, but now he updated his cellphones and computers without a second thought. Everything changed as he remained the same. Forever twenty-seven, he would never see himself age, sicken and die. When his time came, it would be violent. There was no other form of death for a vampire. When he had arrived in Austin, he had come with a purpose. The challenge laid down between The Summoner and Cian had been simple: If Cian could acquire a city, The Summoner would leave him to his own devices. Roberto and Cian had chosen Austin because it was a small city with a low population of supernatural creatures. The coyotes had run off any other type of weres and a war between black witches and white witches had destroyed their population. The vampire cabal had consisted of fairly young vampires who were more interested in living an extended youth with endless partying than being any sort of powerhouse among the supernatural world. Christian, the vampire master of Austin, had welcomed Cian warmly. Too young to realize Cian was centuries older than he was, Christian had considered Cian an asset to his cabal. It was Cian\u0027s wealth that had seduced Christian, and Cian made sure to spoil the vampires with everything they desired. It was among them that Cian had found what he desired: a lovely woman with a kind heart and gentle soul that loved him. A Russian exchange student who had never gone home, Galina had been incredibly beautiful with vivid blue eyes, long dark hair and pale skin. She was the mortal lover and blood minion to Christian. Despite the danger of upsetting the master of Austin, they had fallen in love and had a torrid affair behind Christian\u0027s back. Pushing open the door to the balcony, Cian gazed toward the lake. It was there that he had betrayed the vampires. He had killed humans, deliberately leaving the telltale signs of a vampire. The police had quickly had a paranoid public on their hands. The Son of Sam murders and the Zodiac Killer had the population primed for a panic. Roberto had helped Cian locate the local vampire hunters and Cian had brokered a deal with Jeff\u0027s father. The vampire hunters would destroy the cabal, and Cian, Roberto, and Galina would be spared. In exchange, Cian would take over the city and help keep it vampire free. Cian still remembered awakening in a house filled with dead vampires. He had taken a risk remaining in the house with the cabal when the vampire hunters had come during the day to stake them and take their heads. Cian was confident that he could read people, and James Summerfield had been a man he felt he could trust. Crawling out of his coffin, he had found Summerfield sitting among the dead cabal. “It\u0027s done,” Professor Summerfield had said in a weary voice. He had been splattered with vampire blood and still held a machete. “And the girl?” Cian had asked. “Alive.” Cian had found Galina huddled in one of the bedroom closets. Terrified, she had screamed when he had opened the door. Galina had clung to him as he had taken her from the house they had shared with the cabal. She had been inconsolable for days, mourning Christian despite the fact she had been sleeping with Cian for some time. Cian had hoped she would regain her senses and stay with him, but one night he had awoken to find she had fled. He had been alone for years afterward until Samantha had stumbled into his life. Just as he had hurt Galina, Cian had also hurt Samantha. Frowning, Cian leaned against the railing of the balcony. Over the years he had made plenty of mistakes, but he was determined not to repeat them. He recognized now that he should have built up a cabal of vampires and other supernaturals. He should have anticipated that one day The Summoner would be gone and with him the protective veil that had kept Cian from attack. Without realizing it, Cian had wasted time and endangered not only himself, but the woman he now loved. The last few months had been the best he could remember in a very long time. Amaliya had not only reawakened the vampire in him, but the true man. He had been foolish to believe he could return to the man he was before The Summoner had seized him, killed him, and turned him. Perhaps Rachon was coming to kill him, but his years with her caused him to believe it was not so simple. Rachon was clever and deceptive. She would never attack him outright. He believed that without a doubt. Perhaps it was because he shared those very traits with her. Cian was a master at manipulation from his years dealing with The Summoner. Rubbing his face, Cian sighed. The city was alive below him, filled with life and excitement. It was his city, yet he had failed it. Only he, Amaliya and an inexperienced crew of vampire hunters could protect it from whatever Rachon, Etzli and Santos were planning. Though his mistakes were now haunting him, he knew he would not fall without a fight. No matter what their enemies conspired, Cian believed that he and Amaliya could withstand their attacks. If they died, he was consoled with the thought of being with her until the very end. “No more morose thoughts,” he chided himself. Turning, he slipped back into his apartment. Snuggled into a recliner he had dragged into his grandmother’s bedroom, Sergio kept a wary eye on her tiny form on the bed. The whisper of the A/C unit in the window mingled with her soft snoring into a comforting sound. Burrowing deeper into the old worn quilt his wife had tucked around him, Sergio wished his grandmother didn’t like to sleep in such a cold room. The quilt wasn’t quite big enough to cover his large frame and he kept having to readjust his limbs to keep his feet and elbows from being exposed to the chilly air. The glow of his cellphone screen was hidden under the quilt as he watched the fourth season of Dr. Who. As a precaution, he wore only one ear bud. Watching the antics of the Doctor and his companions, he stifled a yawn. He had already called into work and hoped that he wouldn’t end up on the bad end of his boss’ temper. Cynthia had volunteered to keep watch in Innocente’s room, but Sergio didn’t want to put her in danger. He wasn’t too sure where ghosts were on a scale of scariest monsters, but he wasn’t looking forward to one showing up in his grandmother’s bedroom. Sipping the watered down remains of the soda in his glass, he swept his gaze over the room, scrutinizing every inch of it. Nothing seemed amiss. The clock on the bed stand next to his grandmother’s big king-size bed said it was nearly three in the morning. Yawning again, Sergio fought the urge to close his eyes and sleep. He stared intently at the tiny screen before him as the Doctor ran about with Donna on his heels. Lifting his glass to sip the very last bit of his drink, he gasped as the icy surface felt like it stung his flesh. He briefly glimpsed the soda frozen solid at the bottom of the glass just as his phone went dead, cutting off the Doctor in mid-sentence and plunging the room into darkness. The blackness that filled the room terrified him. It was absolute. He couldn’t even make out his own hand in front of his eyes. Forcing his limbs into action, he set his phone and glass aside on the floor and slid to the edge of his chair. The temperature was dropping fast and he was certain the dinky little air conditioner wasn’t the cause. Wrapping the quilt tightly around his broad shoulders, he rose to his feet. The dark was unwavering in its intensity. The digital clock’s red numbers weren’t even visible in the thick miasma of black. Out of the gloom, his grandmother’s voice was a soft whisper. He couldn’t discern her words for it was difficult to hear over the chattering of his teeth. The piercing cold enveloped him and his body violently shivered. Sergio couldn’t recall the distance between the bed and the chair. Cautiously, he inched his way toward the sound of his grandmother’s murmuring. Just as his knee bumped the edge of the bed, Sergio was engulfed in the clutch of an icy pillar of air. “Fuck!” Stumbling, he tripped over the corner of the bed and fell with a mighty thump. The wood floor shivered beneath him. Gasping in the frigid air, he grabbed onto the mattress and hauled himself onto his knees.","sourceLink":"https://allnovel.net/pretty-when-she-kills-pretty-when-she-dies-2/page-20.html","bookId":2617,"book":{"id":2617,"title":"Pretty When She Kills (Pretty When She Dies #2)","description":"Storyline: Pretty When She Kills (Pretty When She Dies #2) Amaliya Vezorak never believed in happy endings… When Amaliya harnessed her necromancer powers to defeat her greatest enemy, she believed she had finally found a happy ending with Cian, her lover and the master of Austin. That happiness is short-lived when the vampire ruling over San Antonio attempts a takeover of Austin in order to capture Amaliya and use her power for his own devices. To make matters worse, Samantha, Cian’s ex-fiancée, is seeing ghosts, the untested vampire hunters of Austin are running scared as a supernatural war looms, a mysterious man is hunting Amaliya with the help of her one time lover, Pete, and Rachoń, the Summoner’s favorite progeny, appears to be out for revenge. When Amaliya’s grandmother, a powerful medium, experiences terrible visions that reveal there is another necromancer vampire and she is crying out for help, Amaliya realizes happy endings do not come easily…","cover":"https://allnovel.net/images/pretty-when-she-kills-pretty-when-she-dies-2.jpg","author":"Rhiannon Frater","type":"Horror","source":"allnovel","link":"https://allnovel.net/pretty-when-she-kills-pretty-when-she-dies-2.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:50:18 PM"}}
