{"id":100261,"no":26,"title":"Page 26","content":"\n “Nope. Just wondering.” Ethan slid behind the wheel of the truck and yanked his door shut.\n Pete climbed back into the cab. In the few short minutes the vehicle had been standing still, the interior had already heated up. He tilted the air conditioning vents toward him as Ethan started up the truck and blinked the sweat from his eyes. As Pete shut the passenger door, he tilted his head to regard the man next to him thoughtfully.\n Ethan caught his look and gave him a slight smile. “I haven’t the faintest idea why they aren’t at church. I’m just trying to track down Amaliya.”\n “Okay. Because if you need me to help you there needs to be some measure of trust between us,” Pete said in an even voice.\n Pulling out onto the empty highway, Ethan shrugged. “Trust has to be earned, don’t you know that?”\n “I’m trusting you to do what you promised. Cure Amaliya,” Pete pointed out.\n “No, you’re hoping I will do what I promised. You’re scared shitless that I’m lying to you, but you love her enough to put aside your worries and hope for the best. There’s a big difference,” Ethan answered. His tone wasn’t confrontational, angry, or mocking. He said it simply and plainly.\n “Okay, you got me there. I’m hoping that you’re being forthright with me and not giving me a heap of bullshit.”\n Ethan nodded once. “Exactly. Now you’re being honest with me.”\n Pete sank back in his chair and exhaled through his teeth. “Are you being honest with me?”\n “I’m looking for Amaliya because I’m tracking her master. I need your help to convince her family to help me locate her. There is a cure for young vampires to return to mortals.”\n Pete mulled over his words, wiping the beads of moisture form his face with his fingers before rubbing his hands on his jeans. He felt like a fool, but he was a desperate fool. He kept seeing images in his head of Amaliya on that night: the elusive memories he had lost for so many months. Now that he had recollected the events, he wished with all his heart that he had reacted differently. If he hadn’t been so afraid he could have helped her, kept her safe, until the mysterious stranger had arrived to turn her back.\n “You know, Pete, there ain’t no shame in loving someone. None at all.”\n “I’m ashamed that I was afraid of her,” Pete admitted.\n “Well, vampires are scary as shit. Especially when they first come back. They are usually out of control and extremely dangerous. It’s only after they learn to control their hunger and use their powers to survive that they become much more cunning creatures. She’s still a fledgling vampire. We can save her.”\n Pete gave a solemn nod of his head. “Then that’s what we’ll do.”\n Innocente’s house was surrounded by a well-tended yard filled with flower beds and statues. The house was painted a pale shade of pink with dark blue trim. The last time Pete had visited there hadn’t been a jungle gym in the backyard or an above-ground pool. The water was bright blue and the steel-frame and blue vinyl liner were in tip-top condition. Pete had the sudden urge to run and throw himself into it.\n “A vampire would have a hell of a time just getting to the house,” Ethan said with admiration. “Look at all those relics.”\n “Think she knows what Amaliya is?” Pete wondered.\n “Nah, I think she’s just a nice Mexican old lady,” Ethan answered. He killed the engine and shoved open his door.\n Pete slid out of the truck and lifted his cowboy hat so he could smooth down his hair. He felt rumpled and a little out of sorts after being on the road so long.\n The front door swung open and Sergio leaned out. He was in Dallas Cowboy pajama bottoms and a blue t-shirt. “C’mon in!” He waved to them, then disappeared back inside, leaving the front door open behind the screen door.\n Pete ambled up the front walk and glanced down at the small stone vases set along the path. Each one was filled with water and he briefly wondered if it was Holy Water. A little girl with dark curly hair peered out at him from behind the screen. She was smiling at him sweetly.\n “Hey, Emma Leigh. How are you today?” Pete asked.\n The four-year-old giggled and dashed away from the doorway.\n Pete edged the door open and slipped inside, Ethan right behind him. The air inside of the house was fresh, cool, and smelled of chorizo. As Ethan shut the door behind them, the refreshing gloom was a relief after the hot Texas sunlight. Both men took off their hats and ran their fingers through their hair.\n “C’mon!” Cynthia motioned to them from the hallway. “We’re in the kitchen.”\n Sergio’s little boy, Alex, darted into view long enough to wave hello, then dashed away.\n “Cute kids,” Ethan said with a grin.\n “They have four of them.” Pete’s voice held more of a wistful tone than he had intended. “Hopefully after this is all said and done I can get down to making some of my own.”\n A pretty girl with dark green eyes and curly dark hair walked down the hallway from the bedrooms. “Hey, Pete.”\n “Hey, Jackie. When did you get so tall?”\n The girl looked like she was at least three years older than twelve. It unnerved Pete. Kids grew up so fast nowadays.\n Jackie shrugged, giggled, and gave him a brief hug. She glanced toward Ethan suspiciously. “Who’s that?”\n “A friend,” Pete answered.\n “You shouldn’t lie,” Jackie chastised him, shaking her head.\n Ethan arched both of his eyebrows as he pocketed his sunglasses.\n Jackie regarded Ethan suspiciously.\n Pete felt uncomfortable suddenly. He had the eerie feeling that something was going on that he didn’t understand.\n Rolling her eyes, Jackie shook her head. “Remember where liars go,” she said, and headed toward the kitchen.\n Realizing the comment was not directed at him, Pete cast a wary look at Ethan.\n “Interesting,” was all Ethan said, and followed the girl.\n The kitchen was cramped. Emma Leigh and Alex were seated at the kitchen table watching the small TV set on a counter while eating some very colorful cereal. The baby, Anna Belle, was drinking her bottle in her highchair, regarding everyone with dark eyes. Sergio and Cynthia were huddled behind the stove cooking breakfast.\n “Hey, sorry to be a bad hostess, but I don’t want the chorizo to burn,” Cynthia said, leaning in to kiss Pete’s cheek as he greeted her with a hug.\n Sergio was on tortilla duty. “Hey, guys. The kids are almost done. We’ll shove them out the door in a sec.”\n “Dad, that’s rude!” Jackie declared.\n Sergio grinned at her and continued his duty.\n “Well, it’s good to see everyone,” Pete said. He was a little more nervous than he expected. “This is my friend, Ethan.” Pete quickly made the introductions.\n “Good to meet you,” Cynthia said, casting a smile in their direction as she poured diced potatoes into the big black skillet where the spicy chorizo was sizzling. “You guys on a hunting trip or something?”\n “You could say that,” Ethan said with a wide grin. “Smells really good in here.”\n “I’m making chorizo, potato, and egg tacos. I can make you some bacon and eggs if you’d prefer that.”\n “No, ma’am. Those tacos sound great.” Ethan slid off his duster and laid it over the back of a chair before settling onto it. “The kids don’t like tacos?”\n “We get to eat cereal on weekends, because then we can run all the sugar out of our systems,” Jackie said tartly.\n “Ah, I see.” Ethan nodded his head with understanding.\n Jackie continued to regard him suspiciously as she poured herself some cereal. “Sure you do.”\n “Jackie, be nice to our visitors,” Sergio called out.\n With a frown, the girl tucked into her sugary flakes.\n Pete also took a seat at the big breakfast table. Alex and Emma Leigh ignored them, staring at some horrible kid’s program on the TV. Anna Belle was also watching as she slowly slurped on her bottle, but her eyes kept flicking toward him. Pete gave her a slight smile and her eyes narrowed.\n “Do you want some coffee? Or some orange juice?” Sergio asked.\n “Uh, coffee would be great,” Pete said. “I can get it though.” He quickly busied himself with collecting mugs and snagged the coffee pot from where it sat steaming. He was surprised to see that his hands were trembling. Glancing over his shoulder, he saw Jackie glowering at Ethan and baby Anna Belle twisting around in her seat to look toward Pete. Maybe the kids were just curious, but he felt uneasy.\n Casual small talk started between Ethan and Cynthia, lessening the tension in the room. Or maybe Pete was just imagining it. Sergio finished his tortilla duty and checked on his kids. Pete set a mug before Ethan and poured the coffee. Watching Sergio fussing over his kids made his own heart pang with an unexpected sadness. How many times had Pete imagined this sort of future for him and Amaliya?\n Wrangling the kids out the back door was easier than expected. Jackie nearly drowned herself gulping down the last of her sugary milk and hurried out after her younger siblings. She gave Ethan one last dark look before banging the backdoor behind her. \n","sourceLink":"https://allnovel.net/pretty-when-she-kills-pretty-when-she-dies-2/page-26.html","bookId":2617,"book":{"id":2617,"title":"Pretty When She Kills (Pretty When She Dies #2)","description":"Storyline: \n Pretty When She Kills (Pretty When She Dies #2) \n Amaliya Vezorak never believed in happy endings… \n When Amaliya harnessed her necromancer powers to defeat her greatest enemy, she believed she had finally found a happy ending with Cian, her lover and the master of Austin. That happiness is short-lived when the vampire ruling over San Antonio attempts a takeover of Austin in order to capture Amaliya and use her power for his own devices. \n To make matters worse, Samantha, Cian’s ex-fiancée, is seeing ghosts, the untested vampire hunters of Austin are running scared as a supernatural war looms, a mysterious man is hunting Amaliya with the help of her one time lover, Pete, and Rachoń, the Summoner’s favorite progeny, appears to be out for revenge. \n When Amaliya’s grandmother, a powerful medium, experiences terrible visions that reveal there is another necromancer vampire and she is crying out for help, Amaliya realizes happy endings do not come easily…\n \n","cover":"https://allnovel.net/images/pretty-when-she-kills-pretty-when-she-dies-2.jpg","author":"Rhiannon Frater","type":"Horror","source":"allnovel","link":"https://allnovel.net/pretty-when-she-kills-pretty-when-she-dies-2.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:50:18 PM"}}
