{"id":100476,"no":26,"title":"Page 26","content":"VISION OF THE PAST\n We soon have to turn to Ten-Towns,\" Drizzt informed Regis one morning.\n They were out on the tundra, and had been for a tenday since their departure from Berkthgar and the Tribe of the Elk. They both knew they should have gone back to one of the towns with winter coming in so fast and hard. Prudence demanded such, for Icewind Dale winters were indeed deadly.\n But they had stayed out, roaming from the Sea of Moving Ice to the south, and the foothills of the Spine of the World. They had encountered two other tribes, and had been greeted cordially, if not warmly, by both. Neither had any word of Wulfgar, however, and indeed had counted him dead.\n \"He\u0027s not out here,\" Regis said after a while. \"He must have gone south, out of the dale.\"\n Drizzt nodded, or tried to, but so unconvincing was he that his motion seemed more a head shake of denial.\n \"Wulfgar was too upset at the revelation, embarrassed even, and so he went right past Ten-Towns,\" Regis went on stubbornly. \"When he lost his past, he lost his home, and so he could not bear to remain here.\"\n \"And he traveled past Luskan?\"\n \"We don\u0027t know that Wulfgar avoided Luskan. He might have gone in - perhaps he signed on with a ship and is sailing the southern Sword Coast, out by Memnon or even Calimport. Wouldn\u0027t he be amused to see us huddled in a snowstorm looking for him?\"\n Drizzt shrugged. \"It\u0027s possible,\" he admitted, but again, his tone and posture conveyed no confidence.\n \"Whatever happened, we\u0027ve seen no sign that he\u0027s out here, alone or with anyone else,\" said Regis. \"He left Icewind Dale. He walked right past Ten-Towns last spring and moved south through the dale - or maybe he\u0027s back in that little fiefdom, Auckney was its name, with Colson! Yes, that\u0027s...\"\n Drizzt held up his hand to stop the rambling halfling. He, they, had no idea what had happened to Wulfgar, or to Colson for that matter, since she had left the Silver Marches with him but was not with him when he entered Ten-Towns those years ago. Perhaps Regis was correct, but more likely, Berkthgar, who understood Icewind Dale and who knew the turmoil within Wulfgar, had deduced it correctly.\n So many men had ventured out alone on the tundra, to simply disappear - into a bog, under the snow, into the belly of a monster.... Wulfgar wouldn\u0027t have been the first, surely, nor would he be the last.\n \"We make for Ten-Towns today,\" Drizzt informed the halfling.\n The dark elf stared up at the heavy gray sky, and knew that yet another snow was fast approaching, and one that would be colder and more driven by the winds - one that could kill them.\n Regis started to argue, but just nodded and gave a sigh. Wulfgar was lost to them.\n The pair set out forlornly, Regis following closely in Drizzt\u0027s trail - which wasn\u0027t much of a path in the snow, since the drow verily ran atop it - across the flat, white emptiness. Many times even Drizzt, who knew Icewind Dale so well, had to pause for a long while to regain his bearings.\n By midday, the snow had begun to fall, lightly at first, but it steadily worsened, along with the howl of the northwestern gale. The pair bundled their cloaks tighter and leaned forward, pressing on.\n \"We should find a cave!\" Regis shouted, his voice tiny against the wind.\n Drizzt turned back and nodded, but before he turned forward again, Regis gave a yelp of alarm.\n In the blink of an eye, Drizzt whirled, scimitars in hand, just in time to see a huge spear descend through the storm and drive into the ground just a few feet in front of him. He jumped back and tried to spot the thrower, but found his eyes drawn instead to the quivering weapon stuck into the ground before him.\n The head of a verbeeg was tied to it, dangling at the end of a leather strap at the back of the spear.\n Drizzt moved to it, glancing all around, and up, expecting a volley of similar missiles at any moment.\n The giant head rolled over the spear shaft with the gusts of wind, lolling back and forth, staring at Drizzt with empty, dead eyes. Its forehead was curiously scarred. Drizzt used Twinkle to brush aside its thick shock of hair to get a better look.\n \"Wulfgar,\" Regis muttered, and Drizzt turned to regard him. The halfling stared at the verbeeg\u0027s scarred forehead.\n \"Wulfgar?\" Drizzt replied. \"This is a verb - \"\n \"The pattern,\" Regis said, pointing to the scar.\n Drizzt examined it more closely, and sucked in his breath with anticipation. The scar, a brand, really, was jumbled and imperfect, but Drizzt could make out the overlapping symbols of three dwarf gods - the same etching that Bruenor had carved into the head of Aegis-fang! Wulfgar, or someone else holding Aegis-fang, had used that warhammer\u0027s head to brand that verbeeg.\n Drizzt stood up straight and looked all around. In the storm, the thrower could not have been too far away, particularly if he wanted to be sure he didn\u0027t skewer either Drizzt or Regis.\n \"Wulfgar!\" he yelled, and it echoed off the nearby stones, but died quickly under the muffling blanket of falling snow and howling wind.\n \"It was him!\" Regis cried, and he, too, began shouting for their lost friend.\n But no voice came back to them, save the echoes of their own.\n Regis continued to shout for a while, until Drizzt, grinning knowingly, finally halted him.\n \"What?\" the halfling asked.\n \"I know this place - I should have thought of this before.\"\n \"Thought of what?\"\n \"A cave, not so far away,\" Drizzt explained. \"A place where Wulfgar and I first fought side-by-side.\"\n \"Against verbeegs,\" Regis said, catching on as he looked back to the spear.\n \"Against verbeegs,\" Drizzt confirmed.\n \"Looks like you didn\u0027t kill them all.\"\n \"Come along,\" Drizzt bade him.\n The drow found his bearings then called in Guenhwyvar and sent her off and running in search of the cave. Her roars led them through the mounting storm, and though the distance was not far, no more than a few hundred yards, it took the pair some time to at last come to the opening of a deep, dark cave. Drizzt moved just inside and spent a long while standing there staring into the deeper darkness, letting his eyes adjust. He replayed that long ago battle as he did, trying to remember the twists and turns of the tunnels of Biggrin\u0027s Lair.\n He took Regis by the hand and started in, for the halfling couldn\u0027t see nearly as well as the drow in unlit caverns. At the first intersection, a turn down to their left, they saw that not all the caverns were unlit.\n Drizzt motioned for Guenhwyvar to lead and for Regis to stay put, and drew his blades. He moved cautiously and silently, one slow, short step at a time. Ahead of him, Guenhwyvar reached the lit chamber, the fire within silhouetting her so clearly he saw her ears go up and her muscles relax as she trotted in, out of his view.\n He picked up his pace, replacing his blades in their sheaths. At the chamber entrance, he had to squint against the bright flames.\n He hardly recognized the man sitting on the far side of that fire, hardly recognized that it was a man at all at first, for with all the layers of furs, he surely could have passed for a giant himself.\n Of course, such had often been said of Wulfgar, son of Beornegar.\n Drizzt started in, but Regis rushed past him, crying, \"Wulfgar!\" with great joy.\n The man managed a smile back through his thick blond beard at the exuberant halfling.\n \"We thought you were dead,\" Regis gushed.\n \"I was,\" Wulfgar answered. \"Perhaps I still am, but I\u0027m nearly back to life.\" He pulled himself up straight but didn\u0027t stand as Drizzt and Regis neared. The barbarian motioned to two furs he had set out for them to sit upon.\n Regis looked curiously to Drizzt for some answers, and the drow, more versed in the way of the barbarians, seconded Wulfgar\u0027s motion and took his own seat opposite the man.\n \"I have beaten three of the seasons,\" Wulfgar explained. \"But the most difficult now steps before me in challenge.\"\n Regis started to question the curious wording, but Drizzt stopped him with an upraised hand, and led by example as they waited for Wulfgar to tell his tale.\n \"Colson is back with her mother in Auckney,\" Wulfgar began. \"As it should be.\"\n \"And her father, the foolish lord?\" Drizzt asked.\n \"His foolishness has been tempered by the companionship of a fine woman, it seems,\" Wulfgar answered.\n \"It must have pained you,\" Regis remarked, and Wulfgar nodded slightly.\n \"When I traveled from Auckney to the main north-south trail, I didn\u0027t know which way I would turn. I fear I have abandoned Bruenor, and that is no small thing.\"\n \"He fares well,\" Drizzt assured his friend. \"He misses you dearly, but his kingdom is at peace.\"\n \"At peace, with a host of orcs outside his northern door?\" said Wulfgar, and it was Drizzt\u0027s turn to nod.\n \"The peace will not hold, and Bruenor will know war again,\" Wulfgar predicted.\n \"It\u0027s possible,\" the drow replied. \"But because he showed patience and tolerance, any outbreak of war by the orcs will be met by Mithral Hall and a host of mighty allies. Had Bruenor continued the war against Obould, he would have fought it alone, but now, should it come to blows....\"\n \"May the gods keep him, and all of you, safe,\" Wulfgar said. \"But what brought you here?\"\n \"We journeyed to Mirabar as emissaries of Bruenor,\" the drow explained.\n \"Since we were in your neighborhood....\" Regis quipped, an assertion made funny by its ridiculousness - Mirabar was nowhere near Icewind Dale.\n \"We all wanted to know how you fared,\" Drizzt said.\n \"All?\u0027\n \"We two, Bruenor, and Catti-brie.\" The drow paused to measure Wulfgar\u0027s expression, but to his relief saw no pain there. \"She is well,\" he added, and Wulfgar smiled.\n \"Never did I doubt otherwise.\"\n \"Your father will return here soon to visit you,\" Regis assured the man. \"Should he look for this cave?\"\n Wulfgar smiled at that. \"Seek the banner of the elk,\" he replied.\n \"They think you dead,\" the halfling said.\n \"And so I was. But Tempus has been kind and has allowed me a rebirth in this place, his home.\"\n He paused, and his crystal blue eyes, so much like the autumn sky of Icewind Dale, flashed. Regis started to say something, but Drizzt held him back.\n \"I made errors upon my return - too many,\" the barbarian said somberly a few heartbeats later. \"Icewind Dale does not forgive, and does not often offer a second chance to correct a mistake. I had forgotten who I was and who my people were, and most of all, I had forgotten my home.\"\n He paused and stared into the flames for what seemed like an hour. \"Icewind Dale challenged me,\" he said quietly, as if speaking more to himself than to his friends. \"Tempus dared me to remember who I was, and the price of failure would be - will be - my life.\n \"But I have won thus far,\" he said, looking up at the pair. \"I survived the bears and hunters of the spring, the bottomless bogs of the summer, and the last frenzy of feeding in the autumn. I made this my home and painted it with the blood of the goblinkind and giantkin who lived here.\"\n \"We saw,\" Regis said dryly, but his smile was not infectious - not to Wulfgar at least.\n \"I will defeat the winter, my quest will be at an end, and I will return to the Tribe of the Elk. I remember now. I am again the son of Icewind Dale, the son of Beornegar.\"\n \"They will have you back,\" Drizzt stated.\n Wulfgar paused for a long while, and finally nodded his agreement, though slowly. \"My people will forgive me.\"\n \"You will claim leadership again?\" Regis asked.\n Wulfgar shook his head. \"I will take a wife and have as many children as we can. I will hunt the caribou and kill the goblins. I will live as my father lived, and his father before him, as my children will live and their children after them. There is peace in that, Drizzt, and comfort and joy and endlessness.\"\n \"There are many handsome women among your kin,\" Drizzt said. \"Who wouldn\u0027t be proud to be the wife of Wulfgar, son of Beornegar?\"\n Regis scrunched up his face as he regarded the drow after that curious comment, but when he looked over at Wulfgar, he saw that Drizzt\u0027s words had apparently been well-spoken.\n \"I would have married more than a year ago,\" Wulfgar said. \"There is one...\" His voice trailed off with a little laugh. \"I was not worthy.\"\n \"Perhaps she is still available,\" Drizzt offered, and Wulfgar smiled again, and nodded.\n \"But they think you dead,\" Regis blurted, and Drizzt scowled at him.\n \"I was dead,\" Wulfgar said. \"On the day I left, I had never truly returned. Berkthgar knew it. They all knew it. Icewind Dale does not forgive.\"\n \"You had to earn your way back to this life,\" said Drizzt.\n \"I am again the son of Beornegar.\"\n \"Of the Tribe of the Elk - after the winter,\" said Drizzt, and he offered a sincere nod and smile of understanding.\n \"And you will not forget your friends?\" Regis asked, breaking the silent communication between Drizzt and Wulfgar, both turning to regard him. \"Well?\" he said stubbornly. \"Is there no place in the life of the son of Beornegar for those who once knew him and loved him? Will you forget your friends?\"\n The halfling\u0027s warmth melted the ice from Wulfgar\u0027s face, and he grinned widely. \"How could I ever?\" he asked. \"How could anyone forget Drizzt Do\u0027Urden, and the dwarf king of Mithral Hall, who was as my father for all those years? How could I forget the woman who taught me how to love, and who showed me such sincerity and honesty?\"\n Drizzt squirmed a bit at that reminder that it was his relationship with Catti-brie that had driven Wulfgar from them. But there was no malice, no regret, in Wulfgar\u0027s eyes. Just calm nostalgia and peace - peace as Drizzt hadn\u0027t seen in him in many, many years.\n \"And who could ever forget Regis of Lonelywood?\" Wulfgar asked.\n The halfling nodded appreciatively. \"I wish you would come home,\" he whispered.\n \"I am home, at long last,\" said Wulfgar.\n Regis shook his head and wanted to argue, but no words escaped the lump in his throat.\n \"You will one day challenge for the leadership of your tribe,\" Drizzt said. \"It\u0027s the way of Icewind Dale.\"\n \"I am old among them now,\" Wulfgar replied. \"There are many young and strong men.\"\n \"Stronger than the son of Beornegar?\" Drizzt said. \"I think not.\"\n Wulfgar nodded in silent appreciation.\n \"You will one day challenge, and will again lead the Tribe of the Elk,\" Drizzt predicted. \"Berkthgar will serve you loyally, as you will serve him until that day arrives, until you are again comfortable among the people and among the dale. He knows that.\"\n Wulfgar shrugged. \"I have yet to defeat the winter,\" he said. \"But I will return to them in the spring, after the first draw of light and dark. And they will accept me, as they tried to accept me when first I returned. From there, I don\u0027t know, but I do know, with confidence, that ever will you be welcome among my people, and we will rejoice at your visits.\"\n \"They were gracious to us even without you there,\" Drizzt assured him.\n Wulfgar again stared into the fire for a long, long while, deep in thought. Then he rose and moved to the back of the chamber, returning with a thick piece of meat. \"I share my meal with you this night,\" he said. \"And give you my ear. Icewind Dale will not be angry at me for hearing of that which I left behind.\"\n \"A meal for a tale,\" Regis remarked.\n \"We will leave at dawn\u0027s first light,\" Drizzt assured Wulfgar, and that drew a startled expression from Regis. Wulfgar, though, nodded in gratitude.\n \"Then tell me of Mithral Hall,\" he said. \"Of Bruenor and Catti-brie. Of Obould - he is dead now, I hope.\"\n \"Not remotely,\" said Regis.\n Wulfgar laughed, skewered the meat, and began to slow roast it.\n They spent many hours catching up on the last four years, with Drizzt and Regis doing most of the talking, Drizzt running the litany of events and Regis adding color to every incident. They told him of Bruenor\u0027s grudging acceptance of the Treaty of Garumn\u0027s Gorge, for the good of the region, and of Obould\u0027s fledgling and tentative kingdom. Wulfgar just shook his head in obvious disapproval. They told him of Catti-brie\u0027s new endeavors alongside Lady Alustriel, turning to the Art, and surprisingly, the barbarian seemed quite pleased with the news, though he did quip, \"She should bear your children.\"\n With much prodding, Wulfgar finally related his own adventures, the road with Colson that led to Auckney and his decision that her mother should raise her - and his insistence and relief that the foolish lord of Auckney went along with the decision.\n \"She is better off by far,\" he said. \"Her blood is not the blood of Icewind Dale, and here she would not have thrived.\"\n Regis and Drizzt exchanged knowing looks, recognizing the open wound in Wulfgar\u0027s heart.\n Regis was fast to change the subject at Wulfgar\u0027s next pause, telling of Deudermont\u0027s war in Luskan, of the fall of the Hosttower and the devastation that was general throughout the City of Sails.\n \"I fear that he moved too boldly, too swiftly,\" Drizzt remarked.\n \"But he is beloved,\" Regis argued, and a brief discussion and debate ensued about whether or not their friend had done the right thing. It was brief, because both quickly realized that Wulfgar cared little for the fate of Luskan. He sat there, his expression distant, rubbing his hands along the thick, sleek fur of Guenhwyvar, who lay beside him.\n So Drizzt turned the discussion to times long past, to the first time he and Wulfgar had come to the verbeegs\u0027 lair, and to their walks up Bruenor\u0027s Climb on Kelvin\u0027s Cairn. They replayed their adventures, those long and trying roads they had walked and sailed, the many fights, the many pleasures. They were still talking, though the conversation slowed as the fire burned low, when Regis fell fast asleep, right there on a little fur rug on the stone floor.\n He awoke to find Drizzt and Wulfgar already up, sharing breakfast.\n \"Eat quickly,\" Drizzt said to him. \"The storm has subsided and we must be on our way.\"\n Regis did so, silently, and a short while later, the three said their good-byes at the edge of Wulfgar\u0027s temporary home.\n Wulfgar and Drizzt clasped hands firmly, eyes locking in deep and mutual respect. They fell into a tight hug, a bond that would last forever, then broke apart, Drizzt turning for the brightness outside. Wulfgar slapped Guenhwyvar on the rump as she trotted by.\n \"Here,\" Regis said to him, and held out a piece of scrimshaw he\u0027d been working for some time.\n Wulfgar took it carefully and lifted it up before his eyes, his smile widening as he recognized it as a carving of the Companions of the Hall: Wulfgar and Drizzt, Cattie-brie and Bruenor, Regis and Guenhwyvar, side-by-side, shoulder-to-shoulder. He chuckled at the likeness of Aegis-fang in his miniature\u0027s hand, at the sculpture of Bruenor\u0027s axe and Catti-brie\u0027s bow - a bow carried by Drizzt, he noted as he examined the scrimshaw.\n \"I will keep it against my heart and in my heart for the rest of my days,\" the barbarian promised.\n Regis shrugged, embarrassed. \"If you lose the piece,\" he offered, \"well, if it\u0027s in your heart then you never can.\"\n \"Never,\" Wulfgar agreed, and he lifted Regis in a crushing hug.\n \"You will find your way back to Icewind Dale,\" he said in the halfling\u0027s ear. \"I will surprise you on the banks of Maer Dualdon. Perhaps I will even take the moment to bait your hook.\"\n The sun, meager though it was, seemed all the brighter to Regis and Drizzt that morning, as it reflected off the brilliant whiteness of new-fallen snow, glistening in their moist eyes.\n PART 4\n PRINCIPLES AND PRAGMATISM\n T hey are two men I love dearly, two men I truly respect, and as such, I\u0027m amazed when I step back and consider the opposite directions of the roads of Wulfgar and Deudermont. Indeed, they are both true warriors, yet they have chosen different foes to battle.\n Deudermont\u0027s road, I think, was wrought of frustration. He has spent more than two decades sailing the Sword Coast in pursuit of pirates, and no person in the memories of old elves has ever been so successful at such a dangerous trade. All honors were bestowed upon Sea Spritewhen she put in to any of the major cities, particularly the all-important Waterdeep. Captain Deudermont dined with lords, and could have taken that title at his whim, bestowed by the grateful noblemen of Waterdeep for his tireless and effective service.\n But for all that, it was upon learning the truth of the newest pirate advances, that the Hosttower of the Arcane supported them with magic and coin, that Captain Deudermont had to face the futility of his lifelong quest. The pirates would outlive him, or at least, they would not soon run out of successors.\n Thus was Deudermont faced with an untenable situation and a lofty challenge indeed. He didn\u0027t shy, he didn\u0027t sway, but rather took his ship straight to the source to face this greater foe.\n His reaction to a more terrible and wider world was to fight for control of that which seemed uncontrollable. And with such courage and allies, he may actually succeed, for the specter of the Hosttower of the Arcane is no more, Arklem Greeth is no more, and the people of Luskan have rallied to Deudermont\u0027s noble cause.\n How different has been Wulfgar\u0027s path. Where Deudermont turned outward to seek greater allies and greater victories, Wulfgar turned inward, and returned his thoughts to a time and place more simple and straightforward. A time and place no less harsh or dangerous, to be sure, but one of clear definition, and one where a victory does not mean a stalemate with a horde of orcs, or a political concession for the sake of expediency. In Wulfgar\u0027s world, in Icewind Dale, there is no compromise. There is perfection of effort, of body, of soul, or there is death. Indeed, even absent mistakes, even if perfection is achieved, Icewind Dale can take a man, any man, at a whim. Living there, I know, is the most humbling of experiences.\n Still, I have no doubt that Wulfgar will defeat Icewind Dale\u0027s winter season. I have no doubt that upon his return to the Tribe of the Elk at the spring equinox, he will be greeted as family and friend, to be trusted. I have no doubt that Wulfgar will one day again be crowned as chief of his tribe, and that, should a terrible enemy rise up in the dale, he will stand forward, with all the inspired tribes gratefully at his back, cheering for the son of Beornegar.\n His legend is secured, but hardly fully written.\n So one of my friends battles a lich and an army of pirates and sorcerers, while the other battles inner demons and seeks definition of a scattered and unique existence. And there, I think, rests the most profound difference in their respective roads. For Deudermont is secure in his time and place, and reaches from solid foundation to greater endeavors. He is confident and comfortable with, above all others, Deudermont. He knows his pleasures and comforts, and knows, too, his enemies within and without. Because he understands his limitations, so he can find the allies to help him step beyond them. He is, in spirit, that which Wulfgar will become, for only after one has understanding and acceptance of the self can one truly affect the external.\n I have looked into the eyes of Wulfgar, into the eyes of the son of Beornegar, into the eyes of the son of Icewind Dale.\n I fear for him no longer - not in body, not in soul.\n And yet, even though Wulfgar seeks as a goal to be where Deu dermont already resides, it\u0027s Deudermont for whom I now fear. He steps with confidence and so he steps boldly, but in Menzoberranzan we had a saying, \"Noet z\u0027hin lil\u0027avinsin.\"\n \"Boldly stride the doomed.\" \n","sourceLink":"https://allnovel.net/the-pirate-king-transitions-2/page-26.html","bookId":2188,"book":{"id":2188,"title":"The Pirate King (Transitions #2)","description":"Storyline: \n The Pirate King (Transitions #2) \n The Arcane Brotherhood has long held the city of Luskan in their power, but when corruption eats away at their ranks, Captain Deudermont comes to the rescue of a city that has become a safe haven for the Sword Coast\u0027s most dangerous pirates. But rescuing a city from itself may not be as easy as Deudermont thinks, and when Drizzt can\u0027t talk him out of it, he\u0027ll be forced to help. \n Drizzt is back in action again, and bringing more changes to the Forgotten Realms setting. This all new hardcover adventure will keep Drizzt fans guessing the whole way, with edge-of-your-seat action and plot twists that even the most casual reader of the Forgotten Realms novel line can\u0027t afford to miss!\n \n","cover":"https://allnovel.net/images/the-pirate-king-transitions-2.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-pirate-king-transitions-2.html","creation":"Oct 5, 2019 8:58:26 AM","modification":"Oct 5, 2019 6:52:15 PM"}}
