{"id":100457,"no":7,"title":"Page 7","content":"EXPEDIENCE\\n\\n Bruenor is still angry with him,\" Regis said to Drizzt. Torgar and Shingles had moved out ahead of them to look for familiar trails, for the dwarves believed they were nearing their old home city of Mirabar.\\n\\n \"No.\"\\n\\n \"He holds grudges for a long, long time.\"\\n\\n \"And he loves his adopted children,\" Drizzt reminded the halfling. \"Both of them. True, he was angry when first he learned that Wulfgar had left, and at a time when the world seemed dark indeed.\"\\n\\n \"We all were,\" said Regis.\\n\\n Drizzt nodded and didn\u0027t disagree, though he knew the halfling was wrong. Wulfgar\u0027s departure had saddened him, but hadn\u0027t angered him, for he understood it all too well. Carrying the grief of a dead wife, one he had let down terribly by missing all her signs of misery, had bowed his shoulders. Following that, Wulfgar had to watch Catti-brie, the woman he had once dearly loved, wed his best friend. Circumstance had not been kind to Wulfgar, and had wounded him profoundly.\\n\\n But not mortally, Drizzt knew, and he smiled despite the unpleasant memories. Wulfgar had come to accept the failures of his past and bore nothing but love for the other Companions of the Hall. But he had decided to look forward, to find his place, his wife, his family, among his ancient people.\\n\\n So when Wulfgar departed for the east, Drizzt harbored no anger, and when word had arrived back in Mithral Hall that following autumn that Wulfgar was back in Icewind Dale, the news lifted Drizzt\u0027s heart.\\n\\n He couldn\u0027t believe that four years had passed. It seemed like only a day, and yet, when he thought of Wulfgar, it seemed as though he hadn\u0027t been beside his friend in a hundred years.\\n\\n \"I hope he is well,\" Regis stated, and Drizzt nodded.\\n\\n \"I hope he is alive,\" Regis added, and Drizzt patted his friend on the shoulder.\\n\\n \"Today,\" Torgar Hammerstriker announced, coming up over a rocky rise. He pointed back behind him and to the left. \"Two miles for a bird, four for a dwarf.\" He paused and grinned. \"Five for a fat halfling.\"\\n\\n \"Who ate too much of last night\u0027s rations,\" Shingles McRuff added, moving up to join his old friend.\\n\\n \"Then let us be quick to the gates,\" Drizzt remarked, stealing the mirth with his serious tone. \"I wish to be long away before the fall of night if Marchion Elastul holds true to his former ways.\"\\n\\n The two dwarves exchanged concerned looks, their excitement at returning to their former home tempered by the grim reminder that they had left under less than ideal circumstances those years before. They, along with many of their kin, more than half the dwarves of Mirabar, had deserted Elastul and his city over a dispute concerning King Bruenor. Over the last three years, many more Mirabarran dwarves, Delzoundwarves, had come to Mithral Hall to join them, and not all of the hundreds formerly of Mirabar that called Bruenor their king had agreed with Torgar\u0027s decision to trust the emissary and return.\\n\\n More than one had warned that Elastul would throw Torgar and Shingles in chains.\\n\\n \"He won\u0027t make ye walk away,\" Torgar said with determination. \"Elastul\u0027s a stubborn one, but he\u0027s no fool. He\u0027s wanting his eastern trade route back. He never thinked that Silverymoon and Sundabar would side with Mithral Hall.\"\\n\\n \"We shall see,\" was all Drizzt would concede, and off they went at a swift pace.\\n\\n They passed through the front gates of Mirabar soon after, hustled in by excited guards both dwarf and human. They were greeted by cheers - even Drizzt, who had been denied entrance just a few short years earlier when King Bruenor had returned to Mithral Hall. Before any of the companions could even digest the pleasant surprise the four found themselves before Elastul himself, a highly unusual circumstance.\\n\\n \"Torgar Hammerstriker, never did I expect to see you again,\" the old marchion - and indeed, he seemed much, much older than when Torgar had left - said with a tone as warm as the dancing licks of faerie fire.\\n\\n Torgar, ever mindful of his place, bowed low, as did Shingles. \"We come to ye as emissaries of King Bruenor Battlehammer of Mithral Hall, both in appreciation of your warning to us and in reply to yer request for an audience.\"\\n\\n \"Yes, and I hear that went quite well,\" said Elastul. \"With the emissary of the Arcane Brotherhood, I mean.\"\\n\\n \"Devil feathers all over the field,\" Torgar assured him.\\n\\n \"You were there?\" asked Elastul, and Torgar nodded. \"Holding up the pride of Mirabar, I hope.\"\\n\\n \"Don\u0027t ye go there,\" the dwarf replied, and Regis sucked in his breath. \"Was one day I\u0027d get me to the Nine Hells and back, singing for Mirabar all the while. Me axe\u0027s for Bruenor now and Mithral Hall, and ye\u0027re knowin\u0027 as much and knowin\u0027 it\u0027s not to change.\"\\n\\n For a brief moment, Elastul seemed as if he were about to shout at Torgar, but he suppressed his anger. \"Mirabar is not the city you left, my old friend,\" he said instead, and again Drizzt sensed that the sweetness of his tone was tearing the old marchion apart behind his facade. \"We have grown, in understanding if not in size. Witness your dark-skinned friend, here, standing before my very throne.\"\\n\\n Torgar snickered. \"If ye was any more generous, Moradin himself\u0027d drop down and kiss ye.\"\\n\\n Elastul\u0027s expression soured at the dwarf\u0027s sarcasm, but he worked hard to bring himself back to a neutral posture.\\n\\n \"I\u0027m serious in my offer, Torgar Hammerstriker,\" he said. \"Full amnesty for you and any of the others who went over to Mithral Hall. You may return to your previous status - indeed, I will grant you a commendation and promotion within the ranks of the Shield of Mirabar, because it was your courageous determination that forced me to look beyond my own walls and beyond the limitations of a view too parochial.\"\\n\\n Torgar bowed again. \"Then thank me and me boys by accepting what is, and what\u0027s going to be,\" he said. \"I come for Bruenor, me king and me friend. And all hopes o\u0027 Mithral Hall are that we\u0027re both for lettin\u0027 past...unpleasantness, pass. The orcs\u0027re tamed well enough and the route\u0027s an easy one for yer own trade east and ours back west.\"\\n\\n Elastul slumped back in his throne and seemed quite deflated, again on the verge of screaming. He looked at Drizzt instead and said, \"Welcome to Mirabar, Drizzt Do\u0027Urden. It\u0027s far past time that you enjoyed the splendors of my most remarkable city.\"\\n\\n Drizzt bowed and replied, \"I have heard of them often, and am honored.\"\\n\\n \"You have unfettered access, of course,\" Elastul said. \"All of you. And I will prepare a treaty for King Bruenor that you may take and deliver before the blows of the northern winds bury those easy routes under deep snows.\"\\n\\n He motioned for them to go and they were more than happy to oblige, with Torgar muttering to Drizzt as they walked out of the audience chamber\u0027s door, \"He\u0027s needing the trade...badly.\"\\n\\n The city\u0027s reaction to Torgar and Shingles proved to be as mixed as the structures of the half above-ground, half below-ground city. For every two smiling dwarves, the former Mirabarrans found the scowl of another obviously harboring feelings of betrayal, and few of the many humans in the upper sections even looked at Torgar, though their eyes surely weighed uncomfortably on the shoulders of a certain dark elf.\\n\\n \"It was all a ruse,\" Regis remarked after one old woman spat on the winding road as Drizzt passed her by.\\n\\n \"Not all of it,\" Drizzt answered, though Shingles was nodding and Torgar wore a disgusted look.\\n\\n \"They expected we would come, and practiced for it,\" Regis argued. \"They hustled us right in to see Elastul, not because he was so thrilled at our arrival, but because he wanted to greet us before we knew the extent of Mirabar\u0027s grudge.\"\\n\\n \"He let us in, and most o\u0027 me kin\u0027ll be glad for it,\" Torgar said. \"The pain\u0027s raw. When me and me boys left, we cut open a wound long festerin\u0027 in the town.\"\\n\\n \"Uppity dwarves, huzzah,\" Shingles deadpanned.\\n\\n \"The wound will heal,\" said Drizzt. \"In time. Elastul has placed a salve on it now by greeting us so warmly.\" As he finished, he gave a slight bow and salute to a couple of elderly men who glared at him with open contempt. His disarming greeting brought a harrumph of disgust from the pair, and they turned away in a huff.\\n\\n \"The voice of experience,\" Regis dryly observed.\\n\\n \"I\u0027m no stranger to scorn,\" Drizzt agreed. \"Though my charm wins them over every time.\"\\n\\n \"Or yer blades cut them low,\" said Torgar.\\n\\n Drizzt let it go with a chuckle. He knew already that it would be the last laugh the four would share for some time. The reception in Mirabar, Elastul\u0027s promise of hospitality notwithstanding, would fast prove counterproductive to Bruenor\u0027s designs.\\n\\n Very soon after the group descended the great lift to the town\u0027s lower reaches, where the dwarves proved no less scornful of Drizzt than had the humans above. The drow had seen enough.\\n\\n \"We\u0027ve a long road and a short season remaining,\" Drizzt said to Torgar and Shingles. \"Your city is as wondrous as you\u0027ve oft told me, but I fear that my presence here hinders your desire to bring good will from Mithral Hall.\"\\n\\n \"Bah, but they\u0027ll shut their mouths!\" Torgar insisted, and he seemed to be winding himself into a froth. Drizzt put a hand on his shoulder.\\n\\n \"This is for King Bruenor, not for you and not for me,\" the drow explained. \"And my reason is not false. The trail to Icewind Dale fast closes, often before winter proper, and I would see my old and dear friend before the spring melt.\"\\n\\n \"We\u0027re leaving already?\" Regis put in. \"I\u0027ve been promised a good meal.\"\\n\\n \"And so ye\u0027re to get one,\" said Torgar, and he steered them toward the nearest tavern.\\n\\n But Drizzt grabbed him by the arm and pulled him up short, and Torgar turned to see the drow shaking his head. \"There\u0027s likely to be a commotion that will do none of us any good.\"\\n\\n \"Getting dark outside,\" Torgar argued.\\n\\n \"It has been dark every night since we left Mithral Hall, as expected,\" the drow replied with a disarming grin. \"I don\u0027t fear the night. Many call it the time of the drow, and I am, after all....\"\\n\\n \"But I\u0027m not, and I\u0027m hungry,\" Regis argued.\\n\\n \"Our packs are half full!\"\\n\\n \"With dry bread and salted meat. Nothing juicy and tender and...\"\\n\\n \"He\u0027ll moan all the way to Icewind Dale,\" Torgar warned.\\n\\n \"Long road,\" Shingles added.\\n\\n Drizzt knew he was defeated, so he followed the dwarves into the common room. It was as expected, with every eye turning on Drizzt the moment he walked through the door. The tavernkeeper gave a great sigh of resignation; word had gone out from Elastul that the drow must be served, Drizzt realized.\\n\\n He didn\u0027t argue, nor did he press the point, allowing Torgar and Shingles to go to the bar to get the food while he and Regis settled at the most remote table. The four spent the whole of their meal suffering the glares of a dozen other patrons. If it bothered Regis at all, he didn\u0027t show it, for he never looked up from his plate, other than to scout out the next helping.\\n\\n It was no leisurely meal, to be sure. The tavernkeeper and his serving lady showed great efficiency in producing the meal and cleaning the empty plates.\\n\\n That suited Drizzt, and when the last of the bones and crumbs were removed and Regis pulled out his pipe and began tapping it on the table, the drow put his hand atop it, holding it still. He held still, too, the halfling\u0027s gaze.\\n\\n \"It\u0027s time to go,\" he said.\\n\\n \"Mirabar won\u0027t open her gates at this hour,\" Torgar protested.\\n\\n \"I\u0027m betting they will,\" Drizzt replied, \"to let a dark elf leave.\"\\n\\n Torgar was wise enough to refuse that bet, and as the gates of the city above swung open, Drizzt and Regis said farewell to their two dwarf companions and went out into the night.\\n\\n \"That bothers me more than it bothers you, doesn\u0027t it?\" Regis asked as the city receded into the darkness behind them.\\n\\n \"Only because it costs you a soft bed and good food.\"\\n\\n \"No,\" the halfling said, in all seriousness.\\n\\n Drizzt shrugged as if it didn\u0027t matter, and of course, to him it didn\u0027t. He had found similar receptions in so many surface communities, particularly during his first years on the World Above, before his reputation had spread before him. The mood of Mirabar, though the folk harbored resentment against the dwarves and Mithral Hall as well, had been light compared to Drizzt\u0027s early days - days when he dared not even approach a city\u0027s gates without an expectation of mortal peril.\\n\\n \"I wonder if Ten-Towns is different now,\" Regis remarked some time later, as they set their camp in a sheltered dell.\\n\\n \"Different?\"\\n\\n \"Bigger, perhaps. More people.\"\\n\\n Drizzt shook his head, thinking that unlikely. \"It\u0027s a difficult journey through lands not easily tamed. We will find Luskan a larger place, no doubt, unless plague or war has visited it, but Icewind Dale is a land barely touched by the passage of time. It is now as it has been for centuries, with small communities surviving on the banks of the three lakes and various tribes of Wulfgar\u0027s people following the caribou, as they have beyond memory.\"\\n\\n \"Unless war or a plague has left them empty.\"\\n\\n Drizzt shook his head again. \"If any or all of the ten towns of Icewind Dale were destroyed, they would be rebuilt in short order and the cycle of life and death there is returned to balance.\"\\n\\n \"You sound certain.\"\\n\\n That brought a smile to the drow\u0027s face. There was indeed something comforting about the perpetuity of a land like Icewind Dale, some solace and a sense of belonging in a place where traditions reached back through the generations, where the rhythms of nature ruled supreme, where the seasons were the only timepiece that really mattered.\\n\\n \"The world is grounded in places like Icewind Dale,\" Drizzt said, as much to himself as to Regis. \"And all the tumult of Luskan and Waterdeep, prey to the petty whims of transient, short-lived rulers, cannot take root there. Icewind Dale serves no ruler, unless it be Toril herself, and Toril is a patient mistress.\" He looked at Regis and grinned to lighten the mood. \"Perhaps a thousand years from now, a halfling fishing the banks of Maer Dualdon will happen upon a piece of ancient scrimshaw, and will see the mark of Regis upon it.\"\\n\\n \"Keep talking, friend,\" Regis replied, \"and Bruenor and your wife will wonder, years hence, why we didn\u0027t return.\" \\n\\n","sourceLink":"https://allnovel.net/the-pirate-king-transitions-2/page-7.html","bookId":2188,"book":{"id":2188,"title":"The Pirate King (Transitions #2)","description":"Storyline: The Pirate King (Transitions #2) \\n The Arcane Brotherhood has long held the city of Luskan in their power, but when corruption eats away at their ranks, Captain Deudermont comes to the rescue of a city that has become a safe haven for the Sword Coast\u0027s most dangerous pirates. But rescuing a city from itself may not be as easy as Deudermont thinks, and when Drizzt can\u0027t talk him out of it, he\u0027ll be forced to help. \\n Drizzt is back in action again, and bringing more changes to the Forgotten Realms setting. This all new hardcover adventure will keep Drizzt fans guessing the whole way, with edge-of-your-seat action and plot twists that even the most casual reader of the Forgotten Realms novel line can\u0027t afford to miss!\\n","cover":"https://allnovel.net/images/the-pirate-king-transitions-2.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-pirate-king-transitions-2.html","creation":"Oct 5, 2019 8:58:26 AM","modification":"Oct 5, 2019 6:52:15 PM"}}
