{"id":101924,"no":9,"title":"Page 9","content":"\"Remind me...\" I hit the floor with a whump , dazed for a moment despite the soft padding Kristoff had assured me would break my fall. Even with that, it took me a moment before I felt my wits returning. \"Remind me next time to take a plane instead of a portal.\"\n Hands grabbed my arms, hauling me to my feet. I leaned against the warm, hard body attached to the hands, breathing in his delicious scent.\n \"You wanted to use a portal.\" Kristoff\u0027s voice rumbled deep in his chest. I let out a sigh of sheer happiness and managed to take a step back from him, just in time to see a body suddenly appear in midair, twisting like a cat as it, too, hit the floor.\n \"Yeah, I know. I thought it would be quicker and easier to get out of Germany that way, but I\u0027ve changed my mind. Ow.\" I rubbed my butt as I eyed the body on the floor next to us.\n \"Have your light ready,\" Kristoff warned as he released me in order to grab Mattias by the back of his collar.\n I nodded, gathering up another small handful of light. Kristoff had warned me that traveling through a portal could well remove the effect of the light-binding on Mattias. \"Just one more reason to take a plane.\"\n Mattias shook his head for a moment, squinting until his eyes focused on me. \"Wife!\" he said.\n That was all I needed to hear. I tossed the light at his head, watching with some amazement as it wrapped itself around him, slowly dissipating into nothing.\n The frown that Mattias had donned upon seeing me melted away into a happy grin. \"Pia-pooh!\"\n \"Ugh. I had hoped he had forgotten that. Mattias, we\u0027re in Iceland. I want you to do exactly as Kristoff says.\"\n \"I love Iceland!\" he cried, delighted. \"I love Pia! I love Kristoff!\"\n \"If he tries to hug me again, I\u0027m going to-\"\n Kristoff didn\u0027t get to finish his threat before Mattias, who was as big as Kristoff, shouted, \"Hug time!\" and enveloped both of us in a bear hug.\n \"You just had to say the word, didn\u0027t you?\" I said, extricating myself from Mattias\u0027s grip. \"Mattias, remember what I said before about inappropriate shows of affection?\"\n Mattias released Kristoff, a pensive look on his face. \"I\u0027m not to kiss you anymore because Kristoff doesn\u0027t like it.\"\n \"That\u0027s right. And?\" I prompted.\n \"And I can\u0027t lick you when he\u0027s looking because it makes you squirm.\"\n Kristoff eyed me.\n \"No,\" I said hastily. \"You can\u0027t lick me at any time because it\u0027s wrong.\"\n He sighed. \"I can\u0027t lick sweet, adorable Pia because it\u0027s wrong. How about him?\" He pointed at Kristoff.\n \"He can lick me if he wants. But that\u0027s neither here nor there.\"\n \"Can I lick her?\"\n I looked over to my shoulder to where an employee of the portal company we\u0027d used to transport ourselves from Berlin to Reykjavik stood waiting for us. \"Judging by the expression on her face, I don\u0027t think she\u0027d enjoy that, no.\"\n \"I want to lick someone,\" he said forlornly.\n \"I know you do,\" I said, taking his arm and propelling him toward the door. \"I\u0027ll get you an ice-cream cone or a puppy or something lickable later. Right now we have to get going before certain vampires figure out we\u0027re not with Magda and Raymond.\"\n \"They should follow them to Rome before they realize we aren\u0027t with them,\" Kristoff said as a form of reassurance as we exited the tiny office that was the portal service in Reykjavik. \"You can stop worrying, Pia. I know my brother\u0027s mind.\"\n \"I just hope so. I\u0027m not going to underestimate him again, though. Not after he was waiting for us in Frankfurt. We barely made that train to Berlin. You\u0027re sure he didn\u0027t read your mind to know what we were doing?\"\n \"I\u0027m sure. We do not have a sympathetic connection like that.\"\n \"Hmm. How\u0027s your nose?\"\n Kristoff\u0027s shoulder twitched. I took his hand, enjoying once again the feeling of his fingers twining through mine. \"I told you it wasn\u0027t broken. Andreas wasn\u0027t trying to hurt me, just stop us.\"\n Mattias, walking behind us on the narrow sidewalk, nudged the back of my shoulder. I ignored him. \"I don\u0027t care. I think that was pretty underhanded of him to sock you on the nose just because I roasted his toes a bit.\"\n Mattias nudged me again, making an unhappy, lost-puppy noise. Exasperated, I stopped.\n He held out his hand.\n \"Oh, for God\u0027s... Fine.\" I took his hand as well. He beamed at me. \"Just so you know, I feel like I\u0027m three years old and being escorted across the road.\"\n Kristoff, who had been glaring across me to Mattias, donned a familiar martyred expression. \"I can\u0027t decide if I would rather have him as he normally is, or this human version of a puppy demanding constant petting.\"\n \"Hugs?\" Mattias asked.\n \"No!\" I said quickly, ignoring the looks we were getting as we strolled through town to a nearby car rental agency. \"Behave yourself, or you\u0027ll have to take another long nap like you did on the plane.\"\n \"I will behave,\" he promised solemnly.\n Are you absolutely certain the reapers want him back? Kristoff asked as we entered the car rental place. We could just drop him off somewhere and make our escape.\n Kristoff! We can\u0027t do that! He\u0027s like a child in this state, very suggestible and clueless. Anyone could take advantage of him and make him do the most heinous acts without him being aware of it. They could even make him throw himself off the top of one of the fjords.\n Only if we\u0027re very lucky.\n I gave him a mental glare. He actually smiled into my mind, a warm, tickling sensation that left me silently bemused, watching him as he arranged for a car.\n \"Ulfur first,\" I told him once he had possession of the keys.\n \"Reaper first, then your spirit.\"\n \"Ulfur has been left alone, and is probably bored out of his mind-\"\n \"And the Dark Ones guarding the reaper could be alerted at any moment that we are in the vicinity.\"\n I made a little face. He had a point. \"All right, but if Ulfur yells at me because we got Kristjana first, I\u0027m totally blaming you.\"\n Fifteen minutes later we were beetling out of Reykjavik to a town about half an hour away, where the Brotherhood folk had said Kristjana was being held. I looked up from the GPS unit and over to the man who sat beside me, and decided the time had come to get to know him better.\n How come you know terms like \"blow job\"? \"Turn left at the next cross street, then a right onto the highway.\"\n Kristoff shot me a quick glance before returning his gaze to the road. Why shouldn\u0027t I know what a blow job is?\n \"Pia, Pia, Pia,\" Mattias said happily from the backseat.\n I sighed. \"Nap time, Mattias! You\u0027re tired. Very tired. Go to sleep until I wake you up.\"\n \"All right. I will sleep. You will wake me up. Smoochie?\"\n Because you were born during the Renaissance, weren\u0027t you? \"I\u0027m going to give Magda hell for ever using that word in front of you. No, you do not need a good-night smooch. Go to sleep.\"\n Yes. Kristoff smiled . That doesn\u0027t mean I hadn\u0027t had a blow job before I met you.\n No, of course not, I answered, pushing down a nasty sting of jealousy at the thought of him being so pleasured by any other woman.\n The smile deepened.\n But it\u0027s an awfully modern term for you to be bandying about. I mean, didn\u0027t you have some other name for it back then? Something euphemistic and romantic?\n A soft \"Pia, Pia, Pia,\" drifted up from the backseat, where Mattias, still firmly in the grip of the mind-altering light-binding, lay with his eyes closed. I felt a momentary pang of guilt at keeping the spell on him, but a memory of his antagonistic tendencies had me brushing away the concern.\n Well, there was one phrase I recall being used.\n Oh, good. What was it?\n The whore\u0027s kiss.\n I shot him a glare.\n His lips curled a smidgen more. Why did you want to know?\n If we\u0027re going to spend the rest of our lives together, I thought it would be nice if we got to know each other better. I\u0027m boring, but you\u0027ve lived centuries. I can only imagine the sorts of things you must have seen.\n All I remember is death, disease, and lots of fleas.\n I sat back in my seat, disgruntled.\n Oh, and one exceptionally talented prostitute in Rome. She had the most amazing muscle control. You would not believe what she could do with a hard-boiled egg.\n You know, I\u0027m willing to bet I can guess.\n Silence filled the car as we drove through the night. It was starting to get dark now in Iceland during the nights, the endless sun of summer beginning its journey into early fall. I looked out into the darkness, wondering at how much my life had changed since I had first been here.\n What is the mortal expression-\"penny for your thoughts\"?\n Oh, come, now-you may be immortal, but you\u0027ve been around us lesser folk long enough to pick up phrases like \"blow job.\" I couldn\u0027t help but smile a little at his attempt at mental coyness.\n I guarantee you that every male, no matter what form he takes, knows every colloquial phrase for oral sex. Some of us, however, have little to do with the mortal world.\n I slid him a glance. \"That must make it a bit difficult. Surely you had to interact with humans in order to eat.\"\n \"I seldom fed from mortals. They complicated things too much.\"\n My heart, as usual, contracted at the oblique reference to his deceased love.\n \"When I did, I tried to keep the contact at a minimum. It was better for everyone\u0027s sake.\"\n \"Did you... er... did you... you know... have sex with everyone you drank from?\" I asked, driven by a horrible spurt of jealousy I badly wanted to pretend wasn\u0027t there.\n His lips softened into a slight curve. \"I told you once before that feeding, to a Dark One, is an intimate act that sometimes involves other aspects of intimacy. It is seldom planned, but sometimes happens.\"\n Damn him. I ground my teeth a little as we approached the town, trying to cope with my unreasonable need to demand to know just how many times he\u0027d given in to that particular impulse.\n You\u0027re jealous, he said with a hint of surprise.\n Shut up, I muttered, glaring out of the window at the blackness . I\u0027ve had boyfriends, too, you know.\n I know.\n Startled, I looked at him.\n Alec would have mentioned it if you\u0027d been a virgin.\n My mouth dropped open in horror. \"You talked to Alec about me? About... sex with me?\"\n \"He brought it up,\" he answered, negotiating an exit into the town, consulting the GPS unit briefly before taking the appropriate turn.\n \"You talked about me?\" Heat washed upward from my chest. I felt perilously close to tears or a nervous breakdown. I just couldn\u0027t decide which.\n \"He told me about spending the night with you.\" He glanced at me, frowning slightly as we came into a street filled with people streaming into a nightclub. \"I didn\u0027t ask for specifics, if that\u0027s what you\u0027re worried about.\"\n I caught the echo in his mind. \"You didn\u0027t have to, did you? He told you everything. Everything! Oh, my God, he told you about me insisting on the light being off?\"\n \"He said you were very modest.\"\n I could feel Kristoff desperately trying to shove thoughts back out of the way so I couldn\u0027t pick through them, but I pounced on a mental image that made my skin burn. \"Oh, my God! He told you he didn\u0027t... that we didn\u0027t... Oh, my God!\"\n \"You\u0027re making too much of this. Alec and I have always discussed women, although I do not go into specifics as he does.\"\n \"Oh, really? And did you tell him all about you and Angelica?\" The words were off my tongue before I could stop myself, but I regretted them the instant I heard them.\n Kristoff\u0027s jaw tightened. He kept his gaze grimly on the people milling around as he inched through them. \"No.\"\n The familiar stab of anguish I was coming to think of as Angelica pain lanced my chest. Of course he didn\u0027t talk to Alec about her. She was special. She was the woman he\u0027d chosen to spend his life with, not one who had been thrust on him by circumstances and fate.\n Unreasonable and unwanted tears pricked the back of my eyes. \"Did you tell him about us?\"\n \"No.\" He shot me another swift glance. \"Would it make you feel any better to know I was pleased when he told me that he had not engaged in anything other than oral sex with you?\"\n \"You were?\" I asked, looking at him despite my embarrassment. \"Really? Why?\"\n He nodded, a slightly chagrined expression on his face. \"I\u0027ve been told in the past that I can be overly possessive where women are concerned. You had expressed your preference for Alec, and I accepted that, but I could not help but be pleased that he did not possess you completely.\"\n I didn\u0027t quite know what to say to that, other than to acknowledge my own little kernel of happiness that he, too, could be jealous. \"Possessive, hmm?\"\n His lips turned downward, his eyes steadfastly on the street before us. \"It is not unknown for Dark Ones.\"\n \"Given what I\u0027ve seen,\" I said, thinking of the vampires I\u0027d met, \"I\u0027d say that is a fair statement. I have to admit that I kind of like it.\"\n One of his lovely sable eyebrows rose. \"I thought women did not like possessiveness.\"\n \"A little of it can be nice,\" I said with a little smile to myself. \"Too much is obnoxious, but a little... It makes us feel wanted.\"\n He said nothing as he pulled into a parking lot next to what looked like a government building, but allowed me to feel the need that always seemed to be simmering within him.\n I was a bit surprised to find my body answering his with a little hum of excitement. \"Do you need, for lack of a better phrase, topping off?\" I asked as we sat together in the warm, intimate darkness of the car.\n \"Do you really want to have sex here in the parking lot, where anyone could see us?\" he asked in return, his eyes glittering like a cat\u0027s in the night.\n I considered, for a few seconds, that very thing. \"I don\u0027t suppose you could eat without us going at it like bunnies?\"\n He pursed his lips at me, and before I could stop myself, I leaned into him and licked them. With a low growl he wrapped both arms around me and pulled me onto his lap, claiming my mouth in a way that left me breathless and mindless of everything but him.\n Does that answer your question? Reluctantly, he released my lower lip and looked down into my eyes, the teal fire in his bathing me in the warmth of his desire.\n I suppose it does. My skin tingled where I was pressed against him. We sat like that for a moment, unwilling to part, but a slight snore from the backseat had me pushing myself off him. \"Later?\"\n \"You can count on that,\" he said with a look that almost seared my clothes. \"I know of a place here you will like. I will feed there.\"\n \"Deal.\"\n \"You think it\u0027s OK to leave him here?\" I asked as we got out of the car. Mattias was snoring away happily, hugging my sweater to his chest.\n \"Unfortunately, yes,\" Kristoff said with a sigh.\n I poked him in the side, and then took his hand when he offered it. Despite the chilly air of the evening, I fanned myself as we walked toward the building on the other side of the government offices, secretly delighted. It was shameless of me, I knew, but dammit, if I had to spend the rest of my life bound to this man, I was going to enjoy every minute.\n My libido had calmed down enough that I could think coherently by the time we stood at the back of the old stone building. \"You\u0027re sure that no one will have contacted the vampires here to warn them we\u0027ll be coming for Kristjana?\"\n \"It\u0027s not likely.\" Kristoff examined the back of the building, his gaze going from window to window, upward along a permanent fire escape, and he stepped back so he could look at the top of the four-story building. \"Andreas will expect that we\u0027ll be taking the sacristan to the nearest group of reapers, and that is in Rome.\"\n \"Why would he think we wanted to get rid of Mattias?\" I asked softly, scooting a little closer to him. The alley we were in wasn\u0027t even remotely dirty, but the large trash bin next to me loomed up with a menacing shadow. \"He\u0027s docile as a lamb so long as I keep him light-bound.\"\n \"He knows I will have to feed more frequently than normal for the next few days,\" he answered, slipping off his long duster and tucking it behind the garbage bin. \"Stay here. I\u0027m going to climb up and see if anyone has alerted them that we\u0027ve escaped with the sacristan.\"\n \"Oh, no,\" I said, glancing around at the shadows. \"If you\u0027re going, I\u0027m going, too.\"\n \"No, you\u0027re not. I just want to reconnoiter. Until I know if they\u0027re watching for us, you stay here.\"\n \"I could go around front and be a distraction while you snatch Kristjana,\" I suggested generously.\n \"Do you seriously believe she will come with me without screaming down the entire town?\" he asked.\n \"I suppose not. I\u0027ll have to do the light thingie with her, too, I guess.\"\n \"Exactly. Stay here while I see what sort of security the Dark Ones have in place.\"\n I glanced around at the shadows in the alley. \"All right, but don\u0027t take too long. I have the feeling we\u0027re not alone here.\"\n \"Stay hidden,\" he ordered before he jumped and caught hold of the bottom of the metal ladder, hauling himself upward.\n I have a better idea. I\u0027m going to take a look around this area and see if I can find signs of Ulfur.\n He didn\u0027t like that idea much, I could tell. Stay in the shadows as much as you can. I don\u0027t know who here will recognize you.\n I didn\u0027t let him feel me rolling my eyes at such a silly statement, but I did stick to the shadows as much as possible as I made a quick tour of the blocks surrounding the building.\n Everything OK? I asked after about five minutes of silence from him.\n Yes. There is an elaborate security system in place. It\u0027s taking time for me to avoid setting it off.\n No problem. I\u0027ll just keep looking around. So far I haven\u0027t found any spirit to ask about Ulfur. I thought he said Reykjavik was crawling with ghosties.\n I rounded a corner about two blocks away from Kristoff, pausing as I examined a pedestrian zone. Despite the late hour, a brightly lit neon sign and the faint sounds of jazz were proof that the Icelandic nightlife was alive and kicking. A couple passed me on their way into the club. I gave the small clutch of people standing outside a quick once-over, making sure there was no one I recognized. I was just about to move on when a woman across the square on her way into the club glanced my way, did an obvious double take, then waved as she hurried over.\n \"Oh, hello! You\u0027re a Zorya, aren\u0027t you?\" she said in a breathless voice. \"Just who I need!\"\n I gave the moonstone hanging from my wrist a quick check. She followed my gaze, laughing as she put a hand on my arm, giving me a little squeeze. \"Oh, I\u0027m not a ghost! I\u0027m a real person. I\u0027m Siobhan. Siobhan Gullstein.\"\n I must have looked surprised at her name, because she grinned. \"Mummy is an Irish pagan, and Dad is a rabbi from the Bronx. They\u0027re not quite your typical love match, but they\u0027re happy, so who am I to quibble?\"\n \"Er... hi. Pia Thomason,\" I said, holding out my hand and trying to remember if I\u0027d met her before. She didn\u0027t look familiar, her dark hair and eyes and rather elfin manner reminding me of Demi Moore at her most dewy-eyed. \"How did you know I was a Zorya?\"\n \"I\u0027m a vespillo,\" Siobhan said matter-of-factly, as if that explained everything.\n \"Are you, indeed?\" I said politely, trying not to look utterly clueless . Boo, what\u0027s a vespillo?\n A vespillo? Why do you want to know?\n Because I just met one.\n I felt his sudden alertness. Who?\n She says her name is Siobhan. Why, what is she? I hate to ask. It seems so rude.\n His sudden spurt of concern faded away. I do not know her. She is probably no danger to us. A vespillo is an assistant to a necromancer.\n Oh, that\u0027s a lot of help.\n Do not speak to her, regardless. I am almost into the building .\n Siobhan had been eyeing me with amusement while Kristoff and I had the quick conversation. \"I hope you don\u0027t take this the wrong way, but are you new to all this?\"\n I relaxed a smidgen, giving a wry smile. \"I\u0027m afraid so. I know that vespillos are assistants to necromancers, but beyond that I\u0027m a bit fuzzy.\"\n \"Don\u0027t worry. It took me forever to get the terminology down,\" she said with another friendly grin, then waved toward the nightclub. \"Why don\u0027t we go have a drink, and I\u0027ll tell you all about life as a vespillo.\"\n \"I\u0027m afraid I\u0027m waiting for someone,\" I said, hesitating.\n \"Ah. Gotcha. I\u0027ve got some friends waiting for me inside, but I thought I\u0027d say hi and see if you\u0027re doing anything tomorrow.\"\n \"Tomorrow? I\u0027m not sure what we\u0027re doing. We\u0027re probably leaving soon.\"\n \"Really?\" Her brow wrinkled. \"I thought you were here because of the Ilargi, but I guess I\u0027m wrong. Well, nice meeting you. If you\u0027re still here tomorrow, I\u0027m at the Hotel Reykjavik. Give me a jingle if you\u0027re available to help a poor, overwhelmed vespillo.\"\n She started to turn away, but I caught her sleeve, stopping her. \"Wait a second-you said Ilargi. You don\u0027t mean reapers, do you? The Brotherhood of the Blessed Light?\" I wondered if she\u0027d seen Kristjana, although I doubted if the vampires had let her escape their clutches.\n \"No, Ilargi. You know, the soul suckers?\" She squinted a little at me. \"You really are new, aren\u0027t you?\"\n \"I think we\u0027d better have that drink,\" I said, considering telling Kristoff, but deciding he had enough on his mind trying to determine what was going on with the vampires holding Kristjana.\n She grinned. \"My kind of girl. We\u0027ll have a quick one at the bar before I join my friends, OK? They\u0027re a good lot, but kind of noisy.\"\n I followed her into the club and was immediately enveloped in a dark, womblike warmth. Siobhan steered me toward the bar farthest away from the musicians. I ordered a glass of wine, waiting until she returned from checking in with her friends before settling down on a barstool.\n \"Let\u0027s start at the beginning,\" I said, accepting my glass of wine. \"What exactly do you do?\"\n \"Well, originally, \u0027vespillo\u0027 was the name they gave people who carried out the dead for burying,\" she said, sipping a giant stein of beer. \"But something like a millennium ago, the name was used by a necromancer\u0027s assistant, and it kind of stuck. Not that we\u0027re mere assistants anymore-we unionized, you see. So now we\u0027re considered sort of a cross between a necromancer and a metal detector.\"\n \"All right,\" I said slowly, wondering how I could admit that I was just as much in the dark as ever.\n \"We find essences of unbound bodies,\" she said, evidently noting my lack of understanding. \"Hence the metal detector reference.\"\n \"Unbound bodies. Like... ghosts?\"\n \"No, not spirits. Everyone has an essence, right?\"\n \"Your soul, do you mean?\" I asked.\n She made a so-so gesture. \"Kind of, but not exactly, if you know what I mean. An essence is something unique to each person. When they die, their soul and spirit are bound together and take off for wherever. Well, that\u0027s where you come in, right?\"\n I nodded.\n \"But their essence remains with their body. Think of it as kind of a marker that stays with their bones, and even after, when those turn to dust.\"\n \"And you find that essence?\"\n She took a sip of her beer and nodded. \"That\u0027s what a vespillo does. We can see them. They look like swirly blue glowing things, generally, although sometimes their pattern is weak and hard to see.\"\n \"Why would you want to find the essence of anyone?\" I couldn\u0027t help but ask.\n \"Ooh, peanuts. Yum.\" She pushed the bowl toward me after scooping out a handful. \"Necromancers use us, mostly, since they\u0027re the ones who can really do anything with the essence, but sometimes I get the odd legal request to locate the remains of someone who\u0027s gone missing and presumed banished to the Akasha.\"\n I searched my mind for any clues as to the purpose of a necromancer. \"I realize I\u0027m sounding horribly ignorant, but what does a necromancer do with the essence?\"\n \"Raises them as a lich, of course,\" she said, popping another handful of nuts into her mouth. She added around the mouthful, \"That\u0027s how you make liches. You raise the remains of a person or, if the body is not present, raise the lich from the essence. It\u0027s easier with a corpse, of course, but a good necromancer thinks nothing of raising from an essence.\"\n \"Ah, liches.\" I frowned, trying to remember who\u0027d mentioned them recently. \"The... er... zombie guys, right?\"\n She took another swallow of beer. \"Eve would yell at you for that. Eve\u0027s my girlfriend, and a fourth-class necromancer. We normally work together, although sometimes I get gigs without her. The difference is that revenants aren\u0027t bound to the person who raised them, and liches are. And then there\u0027s that whole magic thing, but that\u0027s really neither here nor there.\"\n I thought of asking her for more information, but a glance at the clock behind the bartender reminded me that Kristoff was probably going to need my services in a few minutes\n Everything A-OK?\n I am in the building, but there are several Dark Ones here.\n Be careful, I told him before returning my attention to the peanut-munching woman in front of me. \"You mentioned an Ilargi in the area. There was one here a few months ago, but I never found him. Have you seen him?\"\n \"Nope, but I gather from the lack of spirits in this area that he\u0027s been really active, sucking back the souls of all the ghosties he could find. I\u0027ve only found one he missed, in fact.\"\n My skin crawled with horror. \"Dear God. The ghost you talked to-was his name Ulfur, by any chance?\"\n \"No, this was an old woman who is parked out in the harbor. She\u0027s afraid to come ashore. Ulfur, you say? Just a second.\" She dug through the messenger bag that was slung across her chest and pulled out a battered notebook, paging through it. \"Let\u0027s see, new curse I saw in Barcelona, list of wards useful against phantasms, recipe for a whole-wheat challah-\" She flashed me a grin. \"Dad loves to cook. Oh, here it is.\"\n She pulled out a piece of paper from the notebook, running her finger down it until she nodded. \"Got it. Ulfur Hallursson. He\u0027s on the list.\"\n \"What list?\" I asked, panicking slightly. I\u0027d left Ulfur here because he\u0027d assured me he\u0027d be fine wandering around and watching the tourists until I could find a way to send him to Ostri so he could be with the rest of his village.\n \"The list of people whom Eve is supposed to raise. See?\" She held out the paper for me. \"It\u0027s a group of about twenty folks. Ulfur got washed into the ocean a hundred and fifty years ago, evidently. That\u0027s what I was asking if you could help me with-the Ilargi evidently had no idea exactly where on the coast the village used to be. I wondered if you\u0027d go out with me to grill any spirits who remained.\"\n I stared at her in growing horror. \"The Ilargi hired you?\"\n \"No, not me. Eve. Technically, Eve should have hired me to find the essences, but I give her a break on large jobs, and she gives me a cut of her fees. It works out well,\" she said, sipping her beer and reaching for more peanuts.\n \"But... Ilargis suck souls.\"\n \"I know, and I don\u0027t really like working for them because of that,\" she said, giving me a sympathetic look. \"But a girl has to live, and really, if the Ilargi has already sucked their souls-and Eve says he has-then the harm is already done. Raising them isn\u0027t really going to make things worse for them, is it? In fact, it\u0027ll be better, because they won\u0027t be phantasms anymore.\"\n My mind whirled in a miasma of horror and disbelief. Spirits feared losing their souls-which turned them into hopelessly forsaken phantasms-more than anything. My heart wept at the thought of sweet, self-sacrificing Ulfur ending up as one. But if Siobhan was right, then perhaps there was still hope. \"I had no idea there was a way out of being a phantasm,\" I said slowly. \"You\u0027re sure that the Ilargi told you he\u0027d taken the souls of the people on that list?\"\n She nodded, chewing for a moment before she answered. \"I told you he\u0027d been busy on the island. But he didn\u0027t tell Eve where the village was.\"\n \"The village... it\u0027s south along the coast,\" I answered absently, still trying to sort through the confusion in my brain. \"But I sent the villagers on to Ostri. All but Ulfur.\"\n \"That\u0027s part of the problem. He\u0027s the only one from that village on my list, so it\u0027s almost impossible to find it. Will you help me?\"\n I was silent for a moment, my fingers rubbing the stem of the wineglass. \"No.\"\n \"Oh.\" Her face fell.\n \"But I will hire you,\" I said, making a decision.\n \"For what?\" She set down her beer, clearly interested.\n Dio!\n \"I want Ulfur. That is, I want his spirit or whatever is left of him returned the way it was.\" What\u0027s wrong?\n \"Mmm.\" She frowned for a moment. \"Can\u0027t do it. The Ilargi has his soul now.\"\n This woman is a she-devil! She\u0027s alerted the Dark Ones to me.\n Wait a second. You\u0027re tackling Kristjana without me?\n \"Leave the Ilargi to me,\" I said with far more confidence than I felt. \"You said your girlfriend can raise Ulfur, right?\"\n She was alone. I thought I could knock her out and take her out through the window. But she screamed before I could silence her.\n \"Yes, but the lich is bound to either the person who raised him or the person who holds his soul. So I\u0027m afraid that means he\u0027d be bound to the Ilargi.\"\n You\u0027re supposed to wait for me so I can brain-zap her! I said, digging through my purse for a few coins. Hastily, I pulled out a pen and a receipt, scribbling our hotel name and room number on it before shoving it at Siobhan. \"I\u0027ll worry about that later. I just don\u0027t want poor Ulfur in the hands of some clearly deranged madman. I\u0027m sorry, but I have to go. My husband needs me. Here\u0027s where we are, under the name Vincenzi. Call me in the morning and we\u0027ll work out all the details.\"\n She took the paper, watching with raised eyebrows as I gathered up my things. \"All righty, although Eve is going to be a bit touchy about two-timing her employer.\"\n \"Her employer is an evil soul-sucking bastard who gets what he has coming to him,\" I answered, pulling on my coat and waving as I dashed out of the club. On my way! \n","sourceLink":"https://allnovel.net/crouching-vampire-hidden-fang-dark-ones-7/page-9.html","bookId":2208,"book":{"id":2208,"title":"Crouching Vampire, Hidden Fang (Dark Ones #7)","description":"Storyline: \n Crouching Vampire, Hidden Fang (Dark Ones #7) \n For a woman married to the vampire of her nightmares, the honeymoon’s over—and reality bites… \n Pia’s dream of being married has come true. \n But her husband is straight out of her nightmares. \n Pia Thomason is torn between two Dark Ones and feeling like a fool, considering she doesn’t know where either of them are. Alec was no doubt broken-hearted over finding out that Pia was mated to his best friend, Kristoff. And hubby Kristoff believes she has ties to the group trying to destroy his people. \n So Pia goes back to her humdrum Seattle life determined to forget about Kristoff—but fate has other plans. With Alec missing, something truly evil threatening her ghostly charges, and the vampire community hunting both Kristoff and her for crimes they didn’t commit, Pia realizes that if they’re going to be shackled together for better or worse, she may as well start to enjoy it…\n \n","cover":"https://allnovel.net/images/crouching-vampire-hidden-fang-dark-ones-7.jpg","author":"Katie MacAlister","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/crouching-vampire-hidden-fang-dark-ones-7.html","creation":"Oct 5, 2019 8:58:27 AM","modification":"Oct 5, 2019 10:09:52 PM"}}
