{"id":4492,"no":44,"title":"Chapter 44","content":"44:1 [hgb] 他 又 带 我 回 到 圣 地 朝 东 的 外 门 。 那 门 关 闭 了 。 [kjv] Then he brought me back the way of the gate of the outward sanctuary which looketh toward the east; and it was shut. [bbe] And he took me back to the outer doorway of the holy place, looking to the east; and it was shut. 44:2 [hgb] 耶 和 华 对 我 说 ， 这 门 必 须 关 闭 ， 不 可 敞 开 ， 谁 也 不 可 由 其 中 进 入 。 因 为 耶 和 华 以 色 列 的 神 已 经 由 其 中 进 入 ， 所 以 必 须 关 闭 。 [kjv] Then said the LORD unto me; This gate shall be shut, it shall not be opened, and no man shall enter in by it; because the LORD, the God of Israel, hath entered in by it, therefore it shall be shut. [bbe] And the Lord said to me, This doorway is to be shut, it is not to be open, and no man is to go in by it, because the Lord, the God of Israel, has gone in by it; and it is to be shut. 44:3 [hgb] 至 于 王 ， 他 必 按 王 的 位 分 ， 坐 在 其 内 ， 在 耶 和 华 面 前 吃 饼 。 他 必 由 这 门 的 廊 而 入 ， 也 必 由 此 而 出 。 [kjv] It is for the prince; the prince, he shall sit in it to eat bread before the LORD; he shall enter by the way of the porch of that gate, and shall go out by the way of the same. [bbe] But the ruler will be seated there to take his food before the Lord; he will go in by the covered way to the door, and will come out by the same way. 44:4 [hgb] 他 又 带 我 由 北 门 来 到 殿 前 。 我 观 看 ， 见 耶 和 华 的 荣 光 充 满 耶 和 华 的 殿 ， 我 就 俯 伏 在 地 。 [kjv] Then brought he me the way of the north gate before the house: and I looked, and, behold, the glory of the LORD filled the house of the LORD: and I fell upon my face. [bbe] And he took me to the north doorway in front of the house; and, looking, I saw that the house of the Lord was full of the glory of the Lord; and I went down on my face. 44:5 [hgb] 耶 和 华 对 我 说 ， 人 子 阿 ， 我 对 你 所 说 耶 和 华 殿 中 的 一 切 典 章 法 则 ， 你 要 放 在 心 上 ， 用 眼 看 ， 用 耳 听 ， 并 要 留 心 殿 宇 和 圣 地 一 切 出 入 之 处 。 [kjv] And the LORD said unto me, Son of man, mark well, and behold with thine eyes, and hear with thine ears all that I say unto thee concerning all the ordinances of the house of the LORD, and all the laws thereof; and mark well the entering in of the house, with every going forth of the sanctuary. [bbe] And the Lord said to me, Son of man, take to heart, and let your eyes see and your ears be open to everything I say to you about all the rules of the house of the Lord and all its laws; and take note of the ways into the house and all the ways out of the holy place. 44:6 [hgb] 你 要 对 那 悖 逆 的 以 色 列 家 说 ， 主 耶 和 华 如 此 说 ， 以 色 列 家 阿 ， 你 们 行 一 切 可 憎 的 事 ， 当 够 了 吧 。 [kjv] And thou shalt say to the rebellious, even to the house of Israel, Thus saith the Lord GOD; O ye house of Israel, let it suffice you of all your abominations, [bbe] And say to the uncontrolled children of Israel, This is what the Lord has said: O you children of Israel, let it be enough for you, among the disgusting things which you have done, 44:7 [hgb] 你 们 把 我 的 食 物 ， 就 是 脂 油 和 血 献 上 的 时 候 ， 将 身 心 未 受 割 礼 的 外 邦 人 领 进 我 的 圣 地 ， 玷 污 了 我 的 殿 。 又 背 了 我 的 约 ， 在 你 们 一 切 可 憎 的 事 上 ， 加 上 这 一 层 。 [kjv] In that ye have brought into my sanctuary strangers, uncircumcised in heart, and uncircumcised in flesh, to be in my sanctuary, to pollute it, even my house, when ye offer my bread, the fat and the blood, and they have broken my covenant because of all your abominations. [bbe] To have let men from strange lands, without circumcision of heart or flesh, come into my holy place, making my house unclean; and to have made the offering of my food, even the fat and the blood; and in addition to all your disgusting ways, you have let my agreement be broken. 44:8 [hgb] 你 们 也 没 有 看 守 我 的 圣 物 ， 却 派 别 人 在 圣 地 替 你 们 看 守 我 所 吩 咐 你 们 的 。 [kjv] And ye have not kept the charge of mine holy things: but ye have set keepers of my charge in my sanctuary for yourselves. [bbe] And you have not taken care of my holy things; but you have put them as keepers to take care of my work in my holy place. 44:9 [hgb] 主 耶 和 华 如 此 说 ， 以 色 列 中 的 外 邦 人 ， 就 是 身 心 未 受 割 礼 的 ， 都 不 可 入 我 的 圣 地 。 [kjv] Thus saith the Lord GOD; No stranger, uncircumcised in heart, nor uncircumcised in flesh, shall enter into my sanctuary, of any stranger that is among the children of Israel. [bbe] For this cause the Lord has said, No man from a strange land, without circumcision of heart and flesh, of all those who are living among the children of Israel, is to come into my holy place. 44:10 [hgb] 当 以 色 列 人 走 迷 的 时 候 ， 有 利 未 人 远 离 我 ， 就 是 走 迷 离 开 我 ， 随 从 他 们 的 偶 像 ， 他 们 必 担 当 自 己 的 罪 孽 。 [kjv] And the Levites that are gone away far from me, when Israel went astray, which went astray away from me after their idols; they shall even bear their iniquity. [bbe] But as for the Levites, who went far from me, when Israel went out of the right way, turning away from me to go after their images; their punishment will come on them. 44:11 [hgb] 然 而 他 们 必 在 我 的 圣 地 当 仆 役 ， 照 管 殿 门 ， 在 殿 中 供 职 。 必 为 民 宰 杀 燔 祭 牲 和 平 安 祭 牲 ， 必 站 在 民 前 伺 候 他 们 。 [kjv] Yet they shall be ministers in my sanctuary, having charge at the gates of the house, and ministering to the house: they shall slay the burnt offering and the sacrifice for the people, and they shall stand before them to minister unto them. [bbe] But they may be caretakers in my holy place, and overseers at the doors of the house, doing the work of the house: they will put to death the burned offering and the beasts offered for the people, and they will take their place before them as their servants. 44:12 [hgb] 因 为 这 些 利 未 人 曾 在 偶 像 前 伺 候 这 民 ， 成 了 以 色 列 家 罪 孽 的 绊 脚 石 ， 所 以 我 向 他 们 起 誓 ， 他 们 必 担 当 自 己 的 罪 孽 。 这 是 主 耶 和 华 说 的 。 [kjv] Because they ministered unto them before their idols, and caused the house of Israel to fall into iniquity; therefore have I lifted up mine hand against them, saith the Lord GOD, and they shall bear their iniquity. [bbe] Because they did this work for them before their images, and became a cause of sin to the children of Israel; for this cause my hand has been lifted up against them, says the Lord, and their punishment will be on them. 44:13 [hgb] 他 们 不 可 亲 近 我 ， 给 我 供 祭 司 的 职 分 ， 也 不 可 挨 近 我 的 一 件 圣 物 ， 就 是 至 圣 的 物 。 他 们 却 要 担 当 自 己 的 羞 辱 和 所 行 可 憎 之 事 的 报 应 。 [kjv] And they shall not come near unto me, to do the office of a priest unto me, nor to come near to any of my holy things, in the most holy place: but they shall bear their shame, and their abominations which they have committed. [bbe] And they will not come near me to do the work of priests to me, or come near any of my holy things, or the things which are most holy: but their shame will be on them, and the punishment for the disgusting things which they have done. 44:14 [hgb] 然 而 我 要 使 他 们 看 守 殿 宇 ， 办 理 其 中 的 一 切 事 ， 并 作 其 内 一 切 当 作 之 工 。 [kjv] But I will make them keepers of the charge of the house, for all the service thereof, and for all that shall be done therein. [bbe] But I will make them responsible for the care of the house and all its work and everything which is done in it. 44:15 [hgb] 以 色 列 人 走 迷 离 开 我 的 时 候 ， 祭 司 利 未 人 撒 督 的 子 孙 仍 看 守 我 的 圣 所 。 他 们 必 亲 近 我 ， 事 奉 我 ， 并 且 侍 立 在 我 面 前 ， 将 脂 油 与 血 献 给 我 。 这 是 主 耶 和 华 说 的 。 [kjv] But the priests the Levites, the sons of Zadok, that kept the charge of my sanctuary when the children of Israel went astray from me, they shall come near to me to minister unto me, and they shall stand before me to offer unto me the fat and the blood, saith the Lord GOD: [bbe] But as for the priests, the sons of Zadok, who took care of my holy place when the children of Israel were turned away from me, they are to come near me to do my work, they will take their places before me, offering to me the fat and the blood, says the Lord; 44:16 [hgb] 他 们 必 进 入 我 的 圣 所 ， 就 近 我 的 桌 前 事 奉 我 ， 守 我 所 吩 咐 的 。 [kjv] They shall enter into my sanctuary, and they shall come near to my table, to minister unto me, and they shall keep my charge. [bbe] They are to come into my holy place and they are to come near to my table, to do my work and have the care of my house. 44:17 [hgb] 他 们 进 内 院 门 必 穿 细 麻 衣 。 在 内 院 门 和 殿 内 供 职 的 时 候 不 可 穿 羊 毛 衣 服 。 [kjv] And it shall come to pass, that when they enter in at the gates of the inner court, they shall be clothed with linen garments; and no wool shall come upon them, whiles they minister in the gates of the inner court, and within. [bbe] And when they come in by the doorways of the inner square, they are to be clothed in linen robes; there is to be no wool on them while they are doing my work in the doorway of the inner square and inside the house. 44:18 [hgb] 他 们 头 上 要 戴 细 麻 布 裹 头 巾 ， 腰 穿 细 麻 布 裤 子 。 不 可 穿 使 身 体 出 汗 的 衣 服 。 [kjv] They shall have linen bonnets upon their heads, and shall have linen breeches upon their loins; they shall not gird themselves with any thing that causeth sweat. [bbe] They are to have linen head-dresses on their heads and linen trousers on their legs, and they are to have nothing round them to make their skin wet with heat. 44:19 [hgb] 他 们 出 到 外 院 的 民 那 里 ， 当 脱 下 供 职 的 衣 服 ， 放 在 圣 屋 内 ， 穿 上 别 的 衣 服 ， 免 得 因 圣 衣 使 民 成 圣 。 [kjv] And when they go forth into the utter court, even into the utter court to the people, they shall put off their garments wherein they ministered, and lay them in the holy chambers, and they shall put on other garments; and they shall not sanctify the people with their garments. [bbe] And when they go out into the outer square to the people, they are to take off the robes in which they do the work of priests, and put them away in the holy rooms, and put on other clothing, so that the people may not be made holy by their robes. 44:20 [hgb] 不 可 剃 头 ， 也 不 可 容 发 绺 长 长 ， 只 可 剪 发 。 [kjv] Neither shall they shave their heads, nor suffer their locks to grow long; they shall only poll their heads. [bbe] They are not to have all the hair cut off their heads, and they are not to let their hair get long, but they are to have the ends of their hair cut. 44:21 [hgb] 祭 司 进 内 院 的 时 候 都 不 可 喝 酒 。 [kjv] Neither shall any priest drink wine, when they enter into the inner court. [bbe] The priests are not to take wine when they go into the inner square. 44:22 [hgb] 不 可 娶 寡 妇 和 被 休 的 妇 人 为 妻 ， 只 可 娶 以 色 列 后 裔 中 的 处 女 ， 或 是 祭 司 遗 留 的 寡 妇 。 [kjv] Neither shall they take for their wives a widow, nor her that is put away: but they shall take maidens of the seed of the house of Israel, or a widow that had a priest before. [bbe] And they are not to take as wives any widow or woman whose husband has put her away: but they may take virgins of the seed of Israel, or a widow who is the widow of a priest. 44:23 [hgb] 他 们 要 使 我 的 民 知 道 圣 俗 的 分 别 ， 又 使 他 们 分 辨 洁 净 的 和 不 洁 净 的 。 [kjv] And they shall teach my people the difference between the holy and profane, and cause them to discern between the unclean and the clean. [bbe] And they are to make clear to my people the division between what is holy and what is common, and to give them the knowledge of what is clean and what is unclean. 44:24 [hgb] 有 争 讼 的 事 ， 他 们 应 当 站 立 判 断 ， 要 按 我 的 典 章 判 断 。 在 我 一 切 的 节 期 必 守 我 的 律 法 ， 条 例 ， 也 必 以 我 的 安 息 日 为 圣 日 。 [kjv] And in controversy they shall stand in judgment; and they shall judge it according to my judgments: and they shall keep my laws and my statutes in all mine assemblies; and they shall hallow my sabbaths. [bbe] In any cause, they are to be in the position of judges, judging in harmony with my decisions: they are to keep my laws and my rules in all my fixed feasts; and they are to keep my Sabbaths holy. 44:25 [hgb] 他 们 不 可 挨 近 死 尸 沾 染 自 己 ， 只 可 为 父 亲 ， 母 亲 ， 儿 子 ， 女 儿 ， 弟 兄 ， 和 未 嫁 人 的 姐 妹 沾 染 自 己 。 [kjv] And they shall come at no dead person to defile themselves: but for father, or for mother, or for son, or for daughter, for brother, or for sister that hath had no husband, they may defile themselves. [bbe] They are not to come near any dead person so as to become unclean: but for a father or mother or son or daughter or brother or for a sister who has no husband, they may make themselves unclean. 44:26 [hgb] 祭 司 洁 净 之 后 ， 必 再 计 算 七 日 。 [kjv] And after he is cleansed, they shall reckon unto him seven days. [bbe] And after he has been made clean, seven days are to be numbered for him. 44:27 [hgb] 当 他 进 内 院 ， 进 圣 所 ， 在 圣 所 中 事 奉 的 日 子 ， 要 为 自 己 献 赎 罪 祭 。 这 是 主 耶 和 华 说 的 。 [kjv] And in the day that he goeth into the sanctuary, unto the inner court, to minister in the sanctuary, he shall offer his sin offering, saith the Lord GOD. [bbe] And on the day when he goes into the inner square, to do the work of the holy place, he is to make his sin-offering, says the Lord. 44:28 [hgb] 祭 司 必 有 产 业 ， 我 是 他 们 的 产 业 。 不 可 在 以 色 列 中 给 他 们 基 业 。 我 是 他 们 的 基 业 。 [kjv] And it shall be unto them for an inheritance: I am their inheritance: and ye shall give them no possession in Israel: I am their possession. [bbe] And they are to have no heritage; I am their heritage: you are to give them no property in Israel; I am their property. 44:29 [hgb] 素 祭 ， 赎 罪 祭 ， 和 赎 愆 祭 他 们 都 可 以 吃 ， 以 色 列 中 一 切 永 献 的 物 都 要 归 他 们 。 [kjv] They shall eat the meat offering, and the sin offering, and the trespass offering: and every dedicated thing in Israel shall be theirs. [bbe] Their food is to be the meal offering and the sin-offering and the offering for error; and everything given specially to the Lord in Israel will be theirs. 44:30 [hgb] 首 先 初 熟 之 物 和 一 切 所 献 的 供 物 都 要 归 给 祭 司 。 你 们 也 要 用 初 熟 的 麦 子 磨 面 给 祭 司 。 这 样 ， 福 气 就 必 临 到 你 们 的 家 了 。 [kjv] And the first of all the firstfruits of all things, and every oblation of all, of every sort of your oblations, shall be the priest\u0027s: ye shall also give unto the priest the first of your dough, that he may cause the blessing to rest in thine house. [bbe] And the best of all the first-fruits of everything, and every offering which is lifted up of all your offerings, will be for the priests: and you are to give the priest the first of your bread-making, so causing a blessing to come on your house. 44:31 [hgb] 无 论 是 鸟 是 兽 ， 凡 自 死 的 ， 或 是 撕 裂 的 ， 祭 司 都 不 可 吃 。 [kjv] The priests shall not eat of any thing that is dead of itself, or torn, whether it be fowl or beast. [bbe] The priests may not take for food any bird or beast which has come to a natural death or whose death has been caused by another animal.","sourceLink":"http://novel.tingroom.com/shuangyu/132/2012.html","bookId":156,"book":{"id":156,"title":"以西结书 Ezekiel","description":"简介： 1:1 [hgb] 当 三 十 年 四 月 初 五 日 ， 以 西 结 （ 原 文 作 我 ） 在 迦 巴 鲁 河 边 被 掳 的 人 中 ， 天 就 开 了 ， 得 见 神 的 异 象 。 [kjv] Now it came to pass in the thirtieth year, in the fourth month, in the fifth day of ...","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/132","creation":"Aug 1, 2019 12:18:20 AM","modification":"Aug 1, 2019 12:23:40 AM"}}
