{"id":40639,"no":10,"title":"Chapter 10.","content":"The Ace of Hearts. Who should I find in the drawing-room, talking fluently and smiling, after his wont, to old Lady Chelford, who seemed to receive him very graciously, for her at least, but Captain Stanley Lake! I can’t quite describe to you the odd and unpleasant sort of surprise which that very gentlemanlike figure, standing among the Brandon household gods at this moment, communicated to me. I thought of the few odd words and looks that had dropped from Wylder about him with an ominous pang as I looked, and I felt somehow as if there were some occult relation between that confused prelude of Wylder’s and the Mephistophelean image that had risen up almost upon the spot where it was spoken. I glanced round for Wylder, but he was not there. ‘You know Captain Lake?’ said Lord Chelford, addressing me. And Lake turned round upon me, a little abruptly, his odd yellowish eyes, a little like those of the sea-eagle, and the ghost of his smile that flickered on his singularly pale face, with a stern and insidious look, confronted me. There was something evil and shrinking in his aspect, which I felt with a sort of chill, like the commencing fascination of a serpent. I often thought since that he had expected to see Wylder before him. The church-yard meteor expired, there was nothing in a moment but his ordinary smile of recognition. ‘You’re surprised to see me here,’ he said in his very pleasing low tones. ‘I lighted on him in the village; and I knew Miss Brandon would not forgive me if I allowed him to go away without coming here. (He had his hand upon Lake’s shoulder.) They are cousins, you know; we are all cousins. I’m bad at genealogies. My mother could tell us all about it — we, Brandons, Lakes; Wylders, and Chelfords.’ At this moment Miss Brandon entered, with her brilliant Cousin Rachel. The blonde and the dark, it was a dazzling contrast. So Chelford led Stanley Lake before the lady of the castle. I thought of the ‘Fair Brunnisende,’ with the captive knight in the hands of her seneschal before her, and I fancied he said something of having found him trespassing in her town, and brought him up for judgment. Whatever Lord Chelford said, Miss Brandon received it very graciously, and even with a momentary smile. I wonder she did not smile oftener, it became her so. But her greeting to Captain Lake was more than usually haughty and frozen, and her features, I fancied, particularly proud and pale. It seemed to me to indicate a great deal more than mere indifference — something of aversion, and nearer to a positive emotion than anything I had yet seen in that exquisitely apathetic face. How was it that this man with the yellow eyes seemed to gleam from them an influence of pain or disturbance, wherever almost he looked. ‘Shake hands with your cousin, my dear,’ said old Lady Chelford, peremptorily. The little scene took place close to her chair; and upon this stage direction the little piece of by-play took place, and the young lady coldly touched the captain’s hand, and passed on. Young as he was, Stanley Lake was an old man of the world, not to be disconcerted, and never saw more than exactly suited him. Waiting in the drawing-room, I had some entertaining talk with Miss Lake. Her conversation was lively, and rather bold, not at all in the coarse sense, but she struck me as having formed a system of ethics and views of life, both good-humoured and sarcastic, and had carried into her rustic sequestration the melancholy and precocious lore of her early London experience. When Lord Chelford joined us, I perceived that Wylder was in the room, and saw a very cordial greeting between him and Lake. The captain appeared quite easy and cheerful; but Mark, I thought, notwithstanding his laughter and general jollity, was uncomfortable; and I saw him once or twice, when Stanley’s eye was not upon him, glance sharply on the young man with an uneasy and not very friendly curiosity. At dinner Lake was easy and amusing. That meal passed off rather pleasantly; and when we joined the ladies in the drawing-room, the good vicar’s enthusiastic little wife came to meet us, in one of her honest little raptures. ‘Now, here’s a thing worth your looking at! Did you ever see anything so bee-utiful in your life? It is such a darling little thing; and — look now — is not it magnificent?’ She arrested the file of gentlemen just by a large lamp, before whose effulgence she presented the subject of her eulogy — one of those costly trifles which announce the approach of Hymen, as flowers spring up before the rosy steps of May. Well, it was pretty — French, I dare say — a little set of tablets — a toy — the cover of enamel, studded in small jewels, with a slender border of symbolic flowers, and with a heart in the centre, a mosaic of little carbuncles, rubies, and other red and crimson stones, placed with a view to light and shade. ‘Exquisite, indeed!’ said Lord Chelford. ‘Is this yours, Mrs. Wylder?’ ‘Mine, indeed!’ laughed poor little Mrs. Dorothy. ‘Well, dear me, no, indeed;’— and in an earnest whisper close in his ear —‘a present to Miss Brandon, and the donor is not a hundred miles away from your elbow, my lord!’ and she winked slyly, and laughed, with a little nod at Wylder. ‘Oh! I see — to be sure — really, Wylder, it does your taste infinite credit.’ ‘I’m glad you like it,’ says Wylder, chuckling benignantly on it, over his shoulder. ‘I believe I have a little taste that way; those are all real, you know, those jewels.’ ‘Oh, yes! of course. Have you seen it, Captain Lake?’ And he placed it in that gentleman’s fingers, who now took his turn at the lamp, and contemplated the little parallelogram with a gleam of sly amusement. ‘What are you laughing at?’ asked Wylder, a little snappishly. ‘I was thinking it’s very like the ace of hearts,’ answered the captain softly, smiling on. ‘Fie, Lake, there’s no poetry in you,’ said Lord Chelford, laughing. ‘Well, now, though, really it is funny; it did not strike me before, but do you know, now, it is,’ laughs out jolly Mrs. Dolly, ‘isn’t it. Look at it, do, Mr. Wylder — isn’t it like the ace of hearts?’ Wylder was laughing rather redly, with the upper part of his face very surly, I thought. ‘Never mind, Wylder, it’s the winning card,’ said Lord Chelford, laying his hand on his shoulder. Whereupon Lake laughed quietly, still looking on the ace of hearts with his sly eyes. And Wylder laughed too, more suddenly and noisily than the humour of the joke seemed quite to call for, and glanced a grim look from the corners of his eyes on Lake, but the gallant captain did not seem to perceive it; and after a few seconds more he handed it very innocently back to Mrs. Dorothy, only remarking — ‘Seriously, it is very pretty, and appropriate.’ And Wylder, making no remark, helped himself to a cup of coffee, and then to a glass of Cura?oa, and then looked industriously at a Spanish quarto of Don Quixote, and lastly walked over to me on the hearthrug. ‘What the d — has he come down here for? It can’t be for money, or balls, or play, and he has no honest business anywhere. Do you know?’ ‘Lake? Oh! I really can’t tell; but he’ll soon tire of country life. I don’t think he’s much of a sportsman.’ ‘Ha, isn’t he? I don’t know anything about him almost; but I hate him.’ ‘Why should you, though? He’s a very gentlemanlike fellow and your cousin.’ ‘My cousin — the Devil’s cousin — everyone’s cousin. I don’t know who’s my cousin, or who isn’t; nor you don’t, who’ve been for ten years over those d — d papers; but I think he’s the nastiest dog I ever met. I took a dislike to him at first sight long ago, and that never happened me but I was right.’ Wylder looked confoundedly angry and flustered, standing with his heels on the edge of the rug, his hands in his pockets, jingling some silver there, and glancing from under his red forehead sternly and unsteadily across the room. ‘He’s not a man for country quarters! he’ll soon be back in town, or to Brighton,’ I said. ‘If he doesn’t, I will. That’s all.’ Just to get him off this unpleasant groove with a little jolt, I said — ‘By-the-bye, Wylder, you know the pictures here; who is the tall man, with the long pale face, and wild phosphoric eyes? I was always afraid of him; in a long peruke, and dark red velvet coat, facing the hall-door. I had a horrid dream about him last night.’ ‘That? Oh, I know — that’s Lorne Brandon. He was one of our family devils, he was. A devil in a family now and then is not such a bad thing, when there’s work for him.’ (All the time he was talking to me his angry little eyes were following Lake.) ‘They say he killed his son, a blackguard, who was found shot, with his face in the tarn in the park. He was going to marry the gamekeeper’s daughter, it was thought, and he and the old boy, who was for high blood, and all that, were at loggerheads about it. It was not proved, only thought likely, which showed what a nice character he was; but he might have done worse. I suppose Miss Partridge would have had a precious lot of babbies; and who knows where the estate would have been by this time.’ ‘I believe, Charlie,’ he recommenced suddenly, ‘there is not such an unnatural family on record as ours; is there? Ha, ha, ha! It’s well to be distinguished in any line. I forget all the other good things he did; but he ended by shooting himself through the head in his bed-room, and that was not the worst thing ever he did.’ And Wylder laughed again, and began to whistle very low — not, I fancy, for want of thought, but as a sort of accompaniment thereto, for he suddenly said — ‘And where is he staying?’ ‘Who? — Lake?’ ‘Yes.’ ‘I don’t know; but I think he mentioned Larkins’s house, didn’t he? I’m not quite sure.’ ‘I suppose he this I’m made of money. By Jove! if he wants to borrow any I’ll surprise him, the cur; I’ll talk to him; ha, ha, ha!’ And Wylder chuckled angrily, and the small change in his pocket tinkled fiercely, as his eye glanced on the graceful captain, who was entertaining the ladies, no doubt, very agreeably in the distance.","sourceLink":"http://novel.tingroom.com/jingdian/1441/43355.html","bookId":1372,"book":{"id":1372,"title":"Wylder\u0027s Hand","description":"简介： It was late in the autumn, and I was skimming along, through a rich English county, in a postchaise, among tall hedgerows gilded, like all the landscape, with the slanting beams of sunset. The road makes a long and easy descent into the little town o...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1441","creation":"Aug 1, 2019 12:24:56 AM","modification":"Aug 1, 2019 12:24:56 AM"}}
