{"id":40661,"no":32,"title":"Chapter 32.","content":"Mr. Larkin and the Vicar. The good vicar was not only dismayed but endangered by his brother’s protracted absence. It was now the first week in November. Bleak and wintry that ungenial month set in at Gylingden; and in accord with the tempestuous and dismal weather the fortunes of the Rev. William Wylder were darkened and agitated. This morning a letter came at breakfast, by post, and when he had read it, the poor vicar grew a little white, and he folded it very quietly and put it in his waistcoat pocket, and patted little Fairy on the head. Little Fairy was asking him a question all this time, very vehemently, ‘How long was Jack’s sword that he killed the giants with?’ and several times to this distinct question he received only the unsatisfactory reply, ‘Yes, my darling;’ and at last, when little Fairy mounted his knee, and hugging the abstracted vicar round the neck, urged his question with kisses and lamentations, the parson answered with a look of great perplexity, and only half recalled, said, ‘Indeed, little man, I don’t know. How long, you say, was Jack’s sword? Well, I dare say it was as long as the umbrella.’ He got up, with the same perplexed and absent look, as he said this, and threw an anxious glance about the room, as if looking for something he had mislaid. ‘You are not going to write now, Willie, dear?’ expostulated his good little wife, ‘you have not tasted your tea yet.’ ‘I have, indeed, dear; haven’t I? Well, I will.’ And, standing, he drank nearly half the cup she had poured out for him, and set it down, and felt in his pocket, she thought, for his keys. ‘Are you looking for anything, Willie, darling? Your keys are in my basket.’ ‘No, darling; no, darling — nothing. I have everything I want. I think I must go to the Lodge and see Mr. Larkin, for a moment.’ ‘But you have eaten nothing,’ remonstrated his partner; ‘you must not go until you have eaten something.’ ‘Time enough, darling; I can’t wait — I sha’n’t be away twenty minutes — time enough when I come back.’ ‘Have you heard anything of Mark, darling?’ she enquired eagerly. ‘Of Mark? Oh, no! — nothing of Mark.’ And he added with a deep sigh, ‘Oh, dear! I wonder he does not write — no, nothing of Mark.’ She followed him into the hall. ‘Now, Willie darling, you must not go till you have had your breakfast — you will make yourself ill — indeed you will — do come back, just to please me, and eat a little first.’ ‘No, darling; no, my love — I can’t, indeed. I’ll be back immediately; but I must catch Mr. Larkin before he goes out. It is only a little matter — I want to ask his opinion — and — oh! here is my stick — and I’ll return immediately.’ ‘And I’ll go with you,’ cried little Fairy. ‘No, no, little man; I can’t take you — no, it is business — stay with mamma, and I’ll be back again in a few minutes.’ So, spite of Fairy’s clamours and the remonstrances of his fond, clinging little wife, with a hurried kiss or two, away he went alone, at a very quick pace, through the high street of Gylingden, and was soon in the audience chamber of the serious, gentleman attorney. The attorney rose with a gaunt and sad smile of welcome — begged Mr. Wylder, with a wave of his long hand, to be seated — and then seating himself and crossing one long thigh over the other, he threw his arm over the back of his chair, and leaning back with what he conceived to be a graceful and gentlemanly negligence — with his visitor full in the light of the window and his own countenance in shadow, the light coming from behind — a diplomatic arrangement which he affected — he fixed his small, pink eyes observantly upon him, and asked if he could do anything for Mr. William Wylder. ‘Have you heard anything since, Mr. Larkin? Can you conjecture where his address may now be?’ asked the vicar, a little abruptly. ‘Oh! Mr. Mark Wylder, perhaps, you refer to?’ ‘Yes; my brother, Mark.’ Mr. Larkin smiled a sad and simple smile, and shook his head. ‘No, indeed — not a word — it is very sad, and involves quite a world of trouble — and utterly inexplicable; for I need not tell you, in my position, it can’t be pleasant to be denied all access to the client who has appointed me to act for him, nor conducive to the apprehension of his wishes upon many points, which I should much prefer not being left to my discretion. It is really, as I say, inexplicable, for Mr. Mark Wylder must thoroughly see all this: he is endowed with eminent talents for business, and must perfectly appreciate the embarrassment in which the mystery with which he surrounds the place of his abode must involve those whom he has appointed to conduct his business.’ ‘I have heard from him this morning,’ resumed the lawyer; ‘he was pleased to direct a power of attorney to me to receive his rents and sign receipts; and he proposes making Lord Viscount Chelford and Captain Lake trustees, to fund his money or otherwise invest it for his use, and’— ‘Has he — I beg pardon — but did he mention a little matter in which I am deeply — indeed, vitally interested?’ The vicar paused. ‘I don’t quite apprehend; perhaps if you were to frame your question a little differently, I might possibly — a — you were saying’— ‘I mean a matter of very deep interest to me,’ said the poor vicar, colouring a little, ‘though no very considerable sum, viewed absolutely; but, under my unfortunate circumstances, of the most urgent importance — a loan of three hundred pounds — did he mention it?’ Again Mr. Larkin shook his head, with the same sad smile. ‘But, though we do not know how to find him, he knows very well where to find us — and, as you are aware, we hear from him constantly — and no doubt he recollects his promise, and will transmit the necessary directions all in good time.’ ‘I earnestly hope he may,’ and the poor cleric lifted up his eyes unconsciously and threw his hope into the form of a prayer. ‘For, to speak frankly, Mr. Larkin, my circumstances are very pressing. I have just heard from Cambridge, and find that my good friend, Mr. Mountain, the bookseller, has been dead two months, and his wife — he was a widower when I knew him, but it would seem has married since — is his sole executrix, and has sold the business, and directed two gentlemen — attorneys — to call in all the debts due to him — peremptorily — and they say I must pay before the 15th; and I have, absolutely, but five pounds in the world, until March, when my half-year will be paid. And indeed, only that the tradespeople here are so very kind, we should often find it very difficult to manage.’ ‘Perhaps,’ said Mr. Larkin, blandly, ‘you would permit me to look at the letter you mention having received from the solicitors at Cambridge?’ ‘Oh, thank you, certainly; here it is,’ said William Wylder, eagerly, and he gazed with his kind, truthful eyes upon the attorney’s countenance as he glanced over it, trying to read something of futurity therein. ‘Foukes and Mauley,’ said Mr. Larkin. ‘I have never had but one transaction with them; they are not always pleasant people to deal with. Mind, I don’t say anything affecting their integrity — Heaven forbid; but they certainly did take rather what I would call a short turn with us on the occasion to which I refer. You must be cautious; indeed, my dear Sir, very cautious. The fifteenth — just ten clear days. Well, you know you have till then to look about you; and you know we may any day hear from your brother, directing the loan to be paid over to you. And now, my dear and reverend friend, you know me, I hope,’ continued Mr. Larkin, very kindly, as he handed back the letter; ‘and you won’t attribute what I say to impertinent curiosity; but your brother’s intended advance of three hundred pounds can hardly have had relation only to this trifling claim upon you. There are, no doubt — pardon me — several little matters to be arranged; and considerable circumspection will be needed, pending your brother’s absence, in dealing with the persons who are in a position to press their claims unpleasantly. You must not trifle with these things. And let me recommend you seeing your legal adviser, whoever he is, immediately.’ ‘You mean,’ said the vicar, who was by this time very much flushed, ‘a gentleman of your profession, Mr. Larkin. Do you really think — well, it has frequently crossed my mind — but the expense, you know; and although my affairs are in a most unpleasant and complicated state, I am sure that everything would be perfectly smooth if only I had received the loan my kind brother intends, and which, to be sure, as you say, any day I may receive.’ ‘But, my dear Sir, do you really mean to say that you would pay claims from various quarters — how old is this, for instance? — without examination!’ The vicar looked very blank. ‘I— this — well, this I certainly do owe; it has increased a little with interest, though good Mr. Mountain never charged more than six per cent. It was, I think, about fifteen pounds — books — I am ashamed to say how long ago; about a work which I began then, and laid aside — on Eusebius; but which is now complete, and will, I hope, eventually repay me.’ ‘Were you of age, my dear Sir, when he gave you these books on credit? Were you twenty-one years of age?’ ‘Oh! no; not twenty; but then I owe it, and I could not, as s a Christian man, you know, evade my debts.’ ‘Of course; but you can’t pay it at present, and it may be highly important to enable you to treat this as a debt of honour, you perceive. Suppose, my dear Sir, they should proceed to arrest you, or to sequestrate the revenue of your vicarage. Now, see, my dear Sir, I am, I humbly hope, a Christian man; but you will meet with men in every profession — and mine is no exception — disposed to extract the last farthing which the law by its extremest process will give them. And I really must tell you, frankly, that if you dream of escaping the most serious consequences, you must at once place yourself and your affairs in the hands of a competent man of business. It will probably be found that you do not in reality owe sixty pounds of every hundred claimed against you.’ ‘Oh, Mr. Larkin, if I could induce you.’ Mr. Larkin smiled a melancholy smile, and shook his head. ‘My dear Sir, I only wish I could; but my hands are so awfully full,’ and he lifted them up and shook them, and shook his tall, bald head at the same time, and smiled a weary smile. ‘Just look there,’ and he waved his fingers in the direction of the Cyclopean wall of tin boxes, tier above tier, each bearing, in yellow italics, the name of some country gentleman, and two baronets among the number; ‘everyone of them laden with deeds and papers. You can’t have a notion — no one has — what it is.’ ‘I see, indeed,’ murmured the honest vicar, in a compassionating tone, and quite entering into the spirit of Mr. Larkin’s mournful appeal, as if the being in large business was the most distressing situation in which an attorney could well find himself. ‘It was very unreasonable of me to think of troubling you with my wretched affairs; but really I do not know very well where to turn, or whom to speak to. Maybe, my dear Sir, you can think of some conscientious and Christian practitioner who is not so laden with other people’s cares and troubles as you are. I am a very poor client, and indeed more trouble than I could possibly be gain to anyone. But there may be some one; pray think; ten days is so short a time, and I can do nothing.’ Mr. Larkin stood at the window ruminating, with his left hand in his breeches pocket, and his right, with finger and thumb pinching his under lip, after his wont, and the despairing accents of the poor vicar’s last sentence still in his ear. ‘Well,’ he said hesitatingly, ‘it is not easy, at a moment’s notice, to point out a suitable solicitor; there are many, of course, very desirable gentlemen, but I feel it, my dear Sir, a very serious responsibility naming one for so peculiar a matter. But you shall not, in the meantime, go to the wall for want of advice. Rely upon it, we’ll do the best we can for you,’ he continued, in a patronising way, with his chin raised, and extending his hand kindly to shake that of the parson. ‘Yes, I certainly will — you must have advice. Can you give me two hours to-morrow evening — say to tea — if you will do me the honour. My friend, Captain Lake, dines at Brandon to-morrow. He’s staying here with me, you are aware, on a visit; but we shall be quite by ourselves, say at seven o’clock. Bring all your papers, and I’ll get at the root of the business, and see, if possible, in each particular case, what line is best to be adopted.’ ‘How can I thank you, my dear Sir,’ cried gentle William Wylder, his countenance actually beaming with delight and gratitude — a brighter look than it had worn for many weeks. ‘Oh, don’t — pray don’t mention it. I assure you, it is a happiness to me to be of any little use; and, really, I don’t see how you could possibly hold your own among the parties who are pressing you without professional advice.’ ‘I feel,’ said the poor vicar, and his eyes filled as he smiled, and his lip quivered a little —‘I feel as if my prayer for direction and deliverance were answered at last. Oh! my dear Sir, I have suffered a great deal; but something assures me I am rescued, and shall have a quiet mind once more — I am now in safe and able hands.’ And he shook the safe and able, and rather large, hands of the amiable attorney in both his. ‘You make too much of it, my dear Sir. I should at any time be most happy to advise you,’ said Mr. Larkin, with a lofty and pleased benevolence, ‘and with great pleasure, provisionally, until we can hit upon a satisfactory solicitor with a little more time at his disposal, I undertake the management of your case.’ ‘Thank Heaven!’ again said the vicar, who had not let go his hands. ‘And it is so delightful to have for my guide a Christian man, who, even were I so disposed, would not lend himself to an unworthy or questionable defence; and although at this moment it is not in my power to reward your invaluable assistance ——’ ‘Now really, my dear Sir, I must insist — no more of this, I beseech you. I do most earnestly insist that you promise me you will never mention the matter of professional remuneration more, until, at least, I press it, which, rely upon it, will not be for a good while.’ The attorney’s smile plainly said, that his ‘good while’ meant in fact ‘never.’ ‘This is, indeed, unimaginable kindness. How have I deserved so wonderful a blessing!’ ‘And I have no doubt,’ said the attorney, fondling the vicar’s arm in his large hand, ‘that these claims will ultimately be reduced fully thirty per cent. I had once a good deal of professional experience in this sort of business; and, oh! my dear Sir, it is really melancholy!’ and up went his small pink eyes in a pure horror, and his hands were lifted at the same time; ‘but we will bring them to particulars; and you may rely upon it, you will have a much longer time, at all events, than they are disposed to allow you.’","sourceLink":"http://novel.tingroom.com/jingdian/1441/43392.html","bookId":1372,"book":{"id":1372,"title":"Wylder\u0027s Hand","description":"简介： It was late in the autumn, and I was skimming along, through a rich English county, in a postchaise, among tall hedgerows gilded, like all the landscape, with the slanting beams of sunset. The road makes a long and easy descent into the little town o...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1441","creation":"Aug 1, 2019 12:24:56 AM","modification":"Aug 1, 2019 12:24:56 AM"}}
