{"id":40670,"no":41,"title":"Chapter 41.","content":"In which Sir Francis Seddley Manipulates. \\n\\n \\n\\n At about two o’clock Buddle was called up, and spirited away to Brandon in a dog-cart. A haemorrhage, perhaps, a sudden shivering, and inflammation — a sinking, maybe, or delirium — some awful change, probably — for Buddle did not return. \\n\\n \\n\\n Old Major Jackson heard of it, in his early walk, at Buddle’s door. He had begun to grow more hopeful. But hearing this he walked home, and replaced the dress-coat and silk stockings he had ventured to remove, promptly in his valise, which he buckled down and locked — swallowed with agitated voracity some fragments of breakfast — got on his easy boots and gaiters — brushed his best hat, and locked it into its leather case — placed his rug, great-coat, and umbrella, and a rough walking-stick for service, and a gold-tipped, exquisite cane, for duty on promenades of fashion, neatly on top of his valise, and with his old white hat and shooting-coat on, looking and whistling as much as possible as usual, he popped carelessly into John Hobbs’s stable, where he was glad to see three horses standing, and he mentally chose the black cob for his flight to Dollington. \\n\\n \\n\\n ‘A bloodthirsty rascal that Bracton,’ muttered the major. The expenses were likely to be awful, and some allowance was to be made for his state of mind. \\n\\n \\n\\n He was under Doctor Buddle’s porch, and made a flimsy rattle with his thin brass knocker. ‘Maybe he has returned?’ He did not believe it, though. \\n\\n \\n\\n Major Jackson was very nervous, indeed. The up trains from Dollington were ‘few and far between,’ and that diddled Crutchleigh would be down on him the moment the breath was out of poor Lake. ‘It was plain yesterday at the sessions that infernal woman (his wife) had been at him. She hates Bracton like poison, because he likes the Brandon people; and, by Jove, he’ll have up every soul concerned. The Devil and his wife I call them. If poor Lake goes off anywhere between eleven and four o’clock, I’m nabbed, by George!’ \\n\\n \\n\\n The door was opened. The doctor peeped out of his parlour. \\n\\n \\n\\n ‘Well?’ enquired the major, confoundedly frightened. \\n\\n \\n\\n ‘Pretty well, thank ye, but awfully fagged — up all night, and no use.’ \\n\\n \\n\\n ‘But how is he?’ asked the major, with a dreadful qualm of dismay. \\n\\n \\n\\n ‘Same as yesterday — no change — only a little bleeding last night — not arterial; venous you know — only venous.’ \\n\\n \\n\\n The major thought he spoke of the goddess, and though he did not well comprehend, said he was ‘glad of it.’ \\n\\n \\n\\n ‘Think he’ll do then?’ \\n\\n \\n\\n ‘He may — very unlikely though. A nasty case, as you can imagine.’ \\n\\n \\n\\n ‘He’ll certainly not go, poor fellow, before four o’clock P.M. I dare say — eh?’ \\n\\n \\n\\n The major’s soul was at the Dollington station, and was regulating poor Lake’s departure by ‘Bradshaw’s Guide.’ \\n\\n \\n\\n ‘Who knows? We expect Sir Francis this morning. Glad to have a share of the responsibility off my shoulders, I can tell you. Come in and have a chop, will you?’ \\n\\n \\n\\n ‘No, thank you, I’ve had my breakfast.’ \\n\\n \\n\\n ‘You have, have you? Well, I haven’t,’ cried the doctor, with an agreeable chuckle, shaking the major’s hand, and disappearing again into his parlour. \\n\\n \\n\\n I found in my lodgings in London, on my return from Doncaster, some two months later, a copy of the county paper of this date, with a cross scrawled beside the piece of intelligence which follows. I knew that tremulous cross. It was traced by the hand of poor old Miss Kybes — with her many faults always kind to me. It bore the Brandon postmark, and altogether had the impress of authenticity. It said:— \\n\\n \\n\\n ‘We have much pleasure in stating that the severe injury sustained four days since by Captain Stanley Lake, at the time a visitor at the Lodge, the picturesque residence of Josiah Larkin, Esq., in the vicinity of Gylingden, is not likely to prove so difficult of treatment or so imminently dangerous as was at first apprehended. The gallant gentleman was removed from the scene of his misadventure to Brandon Hall, close to which the accident occurred, and at which mansion his noble relatives, Lord Chelford and the Dowager Lady Chelford, are at present staying on a visit. Sir Francis Seddley came down express from London, and assisted by our skilful county practitioner, Humphrey Buddle, Esq., M.D. of Gylingden, operated most successfully on Saturday last, and we are happy to say the gallant patient has since been going on as favourably as could possibly have been anticipated. Sir Francis Seddley returned to London on Sunday afternoon.’ \\n\\n \\n\\n Within a week after the operation, Buddle began to talk so confidently about his patient, that the funereal cloud that overhung Brandon had almost totally disappeared, and Major Jackson had quite unpacked his portmanteau. \\n\\n \\n\\n About a week after the ‘accident’ there came one of Mr. Mark Wylder’s strange letters to Mr. Jos. Larkin. This time it was from Marseilles, and bore date the 27th November. It was much the longest he had yet received, and was in the nature of a despatch, rather than of those short notes in which he had hitherto, for the most part, communicated. \\n\\n \\n\\n Like the rest of his letters it was odd, but written, as it seemed, in better spirits. \\n\\n \\n\\n ‘Dear Larkin — You will be surprised to find me in this port, but I think my secret cruise is nearly over now, and you will say the plan was a master-stroke, and well executed by a poor devil, with nobody to advise him. I am coiling such a web round them, and making it fast, as you may see a spider, first to this point and then to the other, that I won’t leave my persecutors one solitary chance of escape. I’ll draw it quietly round and round — closer and closer — till they can neither blow nor budge, and then up to the yardarm they go, with what breath is left in them. You don’t know yet how I am dodging, or why my measures are taken; but I’ll shorten your long face a good inch with a genuine broad grin when you learn how it all was. I may see you to tell the story in four weeks’ time; but keep this close. Don’t mention where I write from, nor even so much as my name. I have reasons for everything, which you may guess, I dare say, being a sharp chap; and it is not for nothing, be very sure, that I am running this queer rig, masquerading, hiding, and dodging, like a runaway forger, which is not pleasant anyway, and if you doubt it, only try; but needs must when the old boy drives. He is a clever fellow, no doubt, but has been sometimes out-witted before now. You must arrange about Chelford and Lake. I don’t know where Lake is staying. I don’t suppose at Brandon; but he won’t stay in the country nor spend his money to please you or I. Therefore you must have him at your house — be sure — and I will square it with you; I think three pounds a week ought to do it very handsome. Don’t be a muff and give him expensive wines — a pint of sherry is plenty between you; and when he dines at his club half-a-pint does him. I know; but if he costs you more, I hereby promise to pay it. Won’t that do? Well, about Chelford: I have been thinking he takes airs, and maybe he is on his high-horse about that awkward business about Miss Brandon. But there is no reason why Captain Lake should object. He has only to hand you a receipt in my name for the amount of cheques you may give him, and to lodge a portion of it where I told him, and the rest to buy Consols; and I suppose he will expect payment for his no-trouble. Every fellow, particularly these gentlemanlike fellows, they have a pluck at you when they can. If he is at that, give him at the rate of a hundred a-year, or a hundred and fifty if you think he won’t do for less; though 100_l. ought to be a good deal to Lake; and tell him I have a promise of the adjutancy of the county militia, if he likes that; and I am sure of a seat in Parliament either for the county or for Dollington, as you know, and can do better for him then; and I rely on you, one way or another, to make him undertake it. And now for myself: I think my vexation is very near ended. I have not fired a gun yet, and they little think what a raking broadside I’ll give them. Any of the county people you meet, tell them I’m making a little excursion on the Continent; and if they go to particularise, you may say the places I have been at. Don’t let anyone know more. I wish there was any way of stopping that old she’—(it looked like dragon or devil — but was traced over with a cloud of flourishes, and only ‘Lady Chelford’s mouth’ was left untouched). ‘Don’t expect to hear from me so long a yarn for some time again; and don’t write. I don’t stay long anywhere, and don’t carry my own name — and never ask for letters at the post. I’ve a good glass, and can see pretty far, and make a fair guess enough what’s going on aboard the enemy. \\n\\n \\n\\n ‘I remain always, \\n\\n \\n\\n ‘Dear Larkin, \\n\\n \\n\\n ‘Ever yours truly, \\n\\n \\n\\n ‘MARK WYLDER.’ \\n\\n \\n\\n ‘He hardly trusts Lake more than he does me, I presume,’ murmured Mr. Larkin, elevating his tall bald head with an offended and supercilious air; and letting the thin, open letter fall, or rather throwing it with a slight whisk upon the table. \\n\\n \\n\\n ‘No, I take leave to think he certainly does not. Lake has got private directions about the disposition of a portion of the money. Of course, if there are persons to be dealt with who are not pleasantly approachable by respectable professional people — in fact it would not suit me. It is really rather a compliment, and relieves me of the unpleasant necessity of saying — no.’ \\n\\n \\n\\n Yet Mr. Larkin was very sore, and curious, and in a measure, hated both Lake and Wylder for their secret confidences, and was more than ever resolved to get at the heart of Mark’s mystery. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1441/43401.html","bookId":1372,"book":{"id":1372,"title":"Wylder\u0027s Hand","description":"简介： It was late in the autumn, and I was skimming along, through a rich English county, in a postchaise, among tall hedgerows gilded, like all the landscape, with the slanting beams of sunset. The road makes a long and easy descent into the little town o...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1441","creation":"Aug 1, 2019 12:24:56 AM","modification":"Aug 1, 2019 12:24:56 AM"}}
