{"id":40686,"no":57,"title":"Chapter 57.","content":"Concerning a New Danger which Threatened Captain Stanley Lake. The ambitious captain walked out, sniffing, white, and incensed. There was an air of immovable resolution in the few words which Dorcas had spoken which rather took him by surprise. The captain was a terrorist. He acted instinctively on the theory that any good that was to be got from human beings was to be extracted from their fears. He had so operated on Mark Wylder; and so sought to coerce his sister Rachel. He had hopes, too, of ultimately catching the good attorney napping, and leading him too, bound and docile, into his ergastulum, although he was himself just now in jeopardy from that quarter. James Dutton, too. Sooner or later he would get Master Jim into a fix, and hold him also spell-bound in the same sort of nightmare. It was not from malice. The worthy attorney had much more of that leaven than he. Stanley Lake did not care to smash any man, except such as stood in his way. He had a mercantile genius, and never exercised his craft, violence and ferocity, on men or objects, when no advantage was obtainable by so doing. When, however, fortune so placed them that one or other must go to the wall, Captain Stanley Lake was awfully unscrupulous. But, having disabled, and struck him down, and won the stakes, he would have given what remained of him his cold, white hand to shake, or sipped claret with him at his own table, and told him stories, and entertained him with sly, sarcastic sallies, and thought how he could make use of him in an amicable way. But Stanley Lake’s cold, commercial genius, his craft and egotism, were frustrated occasionally by his temper, which, I am afraid, with all its external varnish, was of the sort which is styled diabolical. People said also, what is true of most terrorists, that he was himself quite capable of being frightened; and also, that he lied with too fertile an audacity: and, like a man with too many bills afloat, forgot his endorsements occasionally, and did not recognise his own acceptances when presented after an interval. Such were some of this dangerous fellow’s weak points. But on the whole it was by no means a safe thing to cross his path; and few who did so came off altogether scathless. He pursued his way with a vague feeling of danger and rage, having encountered an opposition of so much more alarming a character than he had anticipated, and found his wife not only competent ferre aspectum to endure his maniacal glare and scowl, but serenely to defy his violence and his wrath. He had abundance of matter for thought and perturbation, and felt himself, when the images of Larcom, Larkin, and Jim Dutton crossed the retina of his memory, some thrill of the fear which ‘hath torment’— the fear of a terrible coercion which he liked so well to practise in the case of others. In this mood he paced, without minding in what direction he went, under those great rows of timber which over-arch the pathway leading toward Redman’s Dell — the path that he and Mark Wylder had trod in that misty moonlight walk on which I had seen them set out together. Before he had walked five minutes in this direction, he was encountered by a little girl in a cloak, who stopped and dropped a courtesy. The captain stopped also, and looked at her with a stare which, I suppose, had something forbidding in it, for the child was frightened. But the wild and menacing look was unconscious, and only the reflection of the dark speculations and passions which were tumbling and breaking in his soul. ‘Well, child,’ said he, gently, ‘I think I know your face, but I forget your name.’ ‘Little Margery, please Sir, from Miss Lake at Redman’s Farm,’ she replied with a courtesy. ‘Oh! to be sure, yes. And how is Miss Rachel?’ ‘Very bad with a headache, please, Sir.’ ‘Is she at home?’ ‘Yes, Sir, please.’ ‘Any message?’ ‘Yes, Sir, please — a note for you, Sir;’ and she produced a note, rather, indeed, a letter. ‘She desired me, Sir, please, to give it into your own hand, if I could, and not to leave it, please, Sir, unless you were at home when I reached.’ He read the direction, and dropped it unopened into the pocket of his shooting coat. The peevish glance with which he eyed it betrayed a presentiment of something unpleasant. ‘Any answer required?’ ‘No, Sir, please — only to leave it.’ ‘And Miss Lake is quite well?’ ‘No, Sir, please — a bad headache to-day.’ ‘Oh! I’m very sorry, indeed. Tell her so. She is at home, is she?’ ‘Yes, Sir.’ ‘Very well; that’s all. Say I am very sorry to hear she is suffering; and if I can find time, I hope to see her to-day; and remember to say I have not read her letter, but if I find it requires an answer, it shall have one.’ He looked round like a man newly awakened, and up among the great boughs and interlacing foliage of the noble trees, and the child made him two courtesies, and departed towards Redman’s Farm. Lake sauntered back slowly toward the Hall. On his way, a rustic seat under the shadow invited him, and he sat down, drawing Rachel’s letter from his pocket. What a genius they have for teasing! How women do contrive to waste our time and patience over nonsense! How ingeniously perverse their whimsies are! I do believe Beelzebub employs them still, as he did in Eden, for the special plague of us, poor devils. Here’s a lecture or an exhortation from Miss Radie, and a quantity of infinitely absurd advice, all which I am to read and inwardly digest, and discuss with her whenever she pleases. I’ve a great mind to burn it quietly.’ But he applied his match, instead, to his cigar; and having got it well lighted, he leaned back, and broke the seal, and read this letter, which, I suspect, notwithstanding his preliminary thoughts, he fancied might contain matter of more practical import:— ‘I write to you, my beloved and only brother, Stanley, in an altered state of mind, and with clearer views of duty than, I think, I have ever had before.’ ‘Just as I conjectured,’ muttered Stanley, with a bitter smile, as he shook the ashes off the top of his cigar —‘a woman’s homily.’ He read on, and a livid frown gradually contracted his forehead as he did so. ‘I do not know, Stanley, what your feelings may be. Mine have been the same ever since that night in which I was taken into a confidence so dreadful. The circumstances are fearful; but far more dreadful to me, the mystery in which I have lived ever since. I sometimes think I have only myself to blame. But you know, my poor brother, why I consented, and with what agony. Ever since, I have lived in terror, and worse, in degradation. I did not know, until it was too late, how great was my guilt. Heaven knows, when I consented to that journey, I did not comprehend its full purpose, though I knew enough to have warned me of my danger, and undertook it in great fear and anguish of mind. I can never cease to mourn over my madness. Oh! Stanley, you do not know what it is to feel, as I do, the shame and treachery of my situation; to try to answer the smiles of those who, at least, once loved me, and to take their hands; to kiss Dorcas and good Dolly; and feel that all the time I am a vile impostor, stained incredibly, from whom, if they knew me, they would turn in horror and disgust. Now, Stanley, I can bear anything but this baseness — anything but the life-long practice of perfidy — that, I will not and cannot endure. Dorcas must know the truth. That there is a secret jealously guarded from her, she does know — no woman could fail to perceive that; and there are few, Stanley, who would not prefer the certainty of the worst, to the anguish of such relations of mystery and reserve with a husband. She is clever, she is generous, and has many noble qualities. She will see what is right, and do it. Me she may hate, and must despise; but that were to me more endurable than friendship gained on false pretences. I repeat, therefore, Stanley, that Dorcas must know the whole truth. Do not suppose, my poor brother, that I write from impulse — I have deeply thought on the subject.’ ‘Deeply,’ repeated Stanley, with a sneer. ‘And the more I reflect, the more am I convinced — if you will not tell her, Stanley, that I must. But it will be wiser and better, terrible as it may be, that the revelation should come from you, whom she has made her husband. The dreadful confidence would be more terrible from any other. Be courageous then, Stanley; you will be happier when you have disclosed the truth, and released, at all events, one of your victims. ‘Your sorrowful and only sister, ‘RACHEL.’ On finishing the letter, Stanley rose quickly to his feet. He had become gradually so absorbed in reading it, that he laid his cigar unconsciously beside him, and suffered it to go out. With downcast look, and an angry contortion, he tore the sheets of note-paper across, and was on the point of reducing them to a thousand little snow flakes, and giving them to the wind, when, on second thoughts, he crumpled them together, and thrust them into his breast pocket. His excitement was too intense for foul terms, or even blasphemy. With the edge of his nether lip nipped in his teeth, and his clenched hands in his pockets, he walked through the forest trees to the park, and in his solitudes hurried onward as if his life depended on his speed. Gradually he recovered his self-possession. He sat down under the shade of a knot of beech trees, overlooking that ill-omened tarn, which we have often mentioned, upon a lichen-stained rock, his chin resting on his clenched hand, his elbow on his knee, and the heel of his other foot stamping out bits of the short, green sod. ‘That d — d girl deserves to be shot for her treachery,’ was the first sentence that broke from his white lips. It certainly was an amazing outrage upon his self-esteem, that the secret which was the weapon of terror by which he meant to rule his sister Rachel, should, by her slender hand, be taken so easily from his grasp, and lifted to crush him. The captain’s plans were not working by any means so smoothly as he had expected. That sudden stab from Jos. Larkin, whom he always despised, and now hated — whom he believed to be a fifth-rate, pluckless rogue, without audacity, without invention; whom he was on the point of tripping up, that he should have turned short and garotted the gallant captain, was a provoking turn of fortune. That when a dire necessity subjugated his will, his contempt, his rage, and he inwardly decided that the attorney’s extortion must be submitted to, his wife — whom he never made any account of in the transaction, whom he reckoned carelessly on turning about as he pleased, by a few compliments and cajoleries — should have started up, cold and inflexible as marble, in his path, to forbid the payment of the black mail, and expose him to the unascertained and formidable consequences of Dutton’s story, and the disappointed attorney’s vengeance — was another stroke of luck which took him altogether by surprise. And to crown all, Miss Radie had grown tired of keeping her own secret, and must needs bring to light the buried disgraces which all concerned were equally interested in hiding away for ever. Stanley Lake’s position, if all were known, was at this moment formidable enough. But he had been fifty times over, during his brief career, in scrapes of a very menacing kind; once or twice, indeed, of the most alarming nature. His temper, his craft, his impetus, were always driving him into projects and situations more or less critical. Sometimes he won, sometimes he failed; but his audacious energy hitherto had extricated him. The difficulties of his present situation were, however, appalling, and almost daunted his semi-diabolical energies. From Rachel to Dorcas, from Dorcas to the attorney, and from him to Dutton, and back again, he rambled in the infernal litany he muttered over the inauspicious tarn, among the enclosing banks and undulations, and solitary and lonely woods. ‘Lake Avernus,’ said a hollow voice behind him, and a long grisly hand was laid on his shoulder. A cold breath of horror crept from his brain to his heel, as he turned about and saw the large, blanched features and glassy eyes of Uncle Lorne bent over him. ‘Oh, Lake Avernus, is it?’ said Lake, with an angry sneer, and raising his hat with a mock reverence. ‘Ay! it is the window of hell, and the spirits in prison come up to see the light of it. Did you see him looking up?’ said Uncle Lorne, with his pallid smile. ‘Oh! of course — Napoleon Bonaparte leaning on old Dr. Simcock’s arm,’ answered Lake. It was odd, in the sort of ghastly banter in which he played off this old man, how much hatred was perceptible. ‘No — not he. It is Mark Wylder,’ said Uncle Lorne; ‘his face comes up like a white fish within a fathom of the top — it makes me laugh. That’s the way they keep holiday. Can you tell by the sky when it is holiday in hell? I can.’ And he laughed, and rubbed his long fingers together softly. ‘Look! ha! ha! — Look! ha! ha! ha! — Look!‘ he resumed pointing with his cadaverous forefinger towards the middle of the pool. ‘I told you this morning it was a holiday,’ and he laughed very quietly to himself. ‘Look how his nostrils go like a fish’s gills. It is a funny way for a gentleman, and he’s a gentleman. Every fool knows the Wylders are gentlemen — all gentlemen in misfortune. He has a brother that is walking about in his coffin. Mark has no coffin; it is all marble steps; and a wicked seraph received him, and blessed him till his hair stood up. Let me whisper you.’ ‘No, not just at this moment, please,’ said Lake, drawing away, disgusted, from the maniacal leer and titter of the gigantic old man. ‘Aye, aye — another time — some night there’s aurora borealis in the sky. You know this goes under ground all the way to Vallambrosa?’ ‘Thank you; I was not aware: that’s very convenient. Had you not better go down and speak to your friend in the water?’ ‘Young man, I bless you for remembering,’ said Uncle Lorne, solemnly. ‘What was Mark Wylder’s religion, that I may speak to him comfortably?’ ‘An Anabaptist, I conjecture, from his present situation,’ replied Lake. ‘No, that’s in the lake of fire, where the wicked seraphim and cherubim baptise, and anabaptise, and hold them under, with a great stone laid across their breasts. I only know two of their clergy — the African vicar, quite a gentleman, and speaks through his nose; and the archbishop with wings; his face is so burnt, he’s all eyes and mouth, and on one hand has only one finger, and he tickles me with it till I almost give up the ghost. The ghost of Miss Baily is a lie, he said, by my soul; and he likes you — he loves you. Shall I write it all in a book, and give it you? I meet Mark Wylder in three places sometimes. Don’t move, till I go down; he’s as easily frightened as a fish.’ And Uncle Lorne crept down the bank, tacking, and dodging, and all the time laughing softly to himself; and sometimes winking with a horrid, wily grimace at Stanley, who fervently wished him at the bottom of the tarn. ‘I say,’ said Stanley, addressing the keeper, whom by a beck he had brought to his side, ‘you don’t allow him, surely, to go alone now?’ ‘No, Sir — since your order, Sir,’ said the stern, reserved official. ‘Nor to come into any place but this — the park, I mean?’ ‘No, Sir.’ ‘And do you mind, try and get him home always before nightfall. It is easy to frighten him. Find out what frightens him, and do it or say it. It is dangerous, don’t you see? and he might break his d — d neck any time among those rocks and gullies, or get away altogether from you in the dark.’ So the keeper, at the water’s brink, joined Uncle Lorne, who was talking, after his fashion, into the dark pool. And Stanley Lake — a general in difficulties — retraced his steps toward the park gate through which he had come, ruminating on his situation and resources.","sourceLink":"http://novel.tingroom.com/jingdian/1441/43430.html","bookId":1372,"book":{"id":1372,"title":"Wylder\u0027s Hand","description":"简介： It was late in the autumn, and I was skimming along, through a rich English county, in a postchaise, among tall hedgerows gilded, like all the landscape, with the slanting beams of sunset. The road makes a long and easy descent into the little town o...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1441","creation":"Aug 1, 2019 12:24:56 AM","modification":"Aug 1, 2019 12:24:56 AM"}}
