{"id":40638,"no":9,"title":"Chapter 9.","content":"I See the Ring of the Persian Magician. ‘That’s a devilish fine girl,’ said Mark Wylder. He was sitting at this moment on the billiard table, with his coat off and his cue in his hand, and had lighted a cigar. He and I had just had a game, and were tired of it. ‘Who?’ I asked. He was looking on me from the corners of his eyes, and smiling in a sly, rakish way, that no man likes in another. ‘Radie Lake — she’s a splendid girl, by Jove! Don’t you think so? and she liked me once devilish well, I can tell you. She was thin then, but she has plumped out a bit, and improved every way.’ Whatever else he was, Mark was certainly no beauty; — a little short he was, and rather square — one shoulder a thought higher than the other — and a slight, energetic hitch in it when he walked. His features in profile had something of a Grecian character, but his face was too broad — very brown, rather a bloodless brown — and he had a pair of great, dense, vulgar, black whiskers. He was very vain of his teeth — his only really good point — for his eyes were a small cunning, gray pair; and this, perhaps, was the reason why he had contracted his habit of laughing and grinning a good deal more than the fun of the dialogue always warranted. This sea-monster smoked here as unceremoniously as he would have done in ‘Rees’s Divan,’ and I only wonder he did not call for brandy-and-water. He had either grown coarser a great deal, or I more decent, during our separation. He talked of his fiancée as he might of an opera-girl almost, and was now discussing Miss Lake in the same style. ‘Yes, she is — she’s very well; but hang it, Wylder, you’re a married man now, and must give up talking that way. People won’t like it, you know; they’ll take it to mean more than it does, and you oughtn’t. Let us have another game.’ ‘By-and-by; what do you think of Larkin?’ asked Wylder, with a sly glance from the corners of his eyes. ‘I think he prays rather more than is good for his clients; mind I spell it with an ‘a,’ not with an ‘e;’ but hang it, for an attorney, you know, and such a sharp chap, it does seem to me rather a — a joke, eh?’ ‘He bears a good character among the townspeople, doesn’t he? And I don’t see that it can do him any harm, remembering that he has a soul to be saved.’ ‘Or the other thing, eh?’ laughed Wylder. ‘But I think he comes it a little too strong — two sermons last Sunday, and a prayer-meeting at nine o’clock?’ ‘Well, it won’t do him any harm,’ I repeated. ‘Harm! O, let Jos. Larkin alone for that. It gets him all the religious business of the county; and there are nice pickings among the charities, and endowments, and purchases of building sites, and trust deeds; I dare say it brings him in two or three hundred a year, eh?’ And Wylder laughed again. ‘It has broken up his hard, proud heart,’ he says; ‘but it left him a devilish hard head, I told him, and I think it sharpens his wits.’ ‘I rather think you’ll find him a useful man; and to be so in his line of business he must have his wits about him, I can tell you.’ ‘He amused me devilishly,’ said Wylder, ‘with a sort of exhortation he treated me to; he’s a delightfully impudent chap, and gave me to understand I was a limb of the Devil, and he a saint. I told him I was better than he, in my humble opinion, and so I am, by chalks. I know very well I’m a miserable sinner, but there’s mercy above, and I don’t hide my faults. I don’t set up for a light or a saint; I’m just what the Prayer-book says — neither more nor less — a miserable sinner. There’s only one good thing I can safely say for myself — I am no Pharisee; that’s all; I air no religious prig, puffing myself, and trusting to forms, making long prayers in the market-place’ (Mark’s quotations were paraphrastic), ‘and thinking of nothing but the uppermost seats in the synagogue, and broad borders, and the praise of men — hang them, I hate those fellows.’ So Mark, like other men we meet with, was proud of being a Publican; and his prayer was —‘I thank Thee that I am not as other men are, spiritually proud, formalists, hypocrites, or even as this Pharisee.’ ‘Do you wish another game?’ I asked. ‘Just now,’ said Wylder, emitting first a thin stream of smoke, and watching its ascent. ‘Dorcas is the belle of the county; and she likes me, though she’s odd, and don’t show it the way other girls would. But a fellow knows pretty well when a girl likes him, and you know the marriage is a sensible sort of thing, and I’m determined, of course, to carry it through; but, hang it, a fellow can’t help thinking sometimes there are other things besides money, and Dorcas is not my style. Rachel’s more that way; she’s a tremendious fine girl, by Jove! and a spirited minx, too; and I think,’ he added, with an oath, having first taken two puffs at his cigar, ‘if I had seen her first, I’d have thought twice before I’d have got myself into this business.’ I only smiled and shook my head. I did not believe a word of it. Yet, perhaps, I was wrong. He knew very well how to take care of his money; in fact, compared with other young fellows, he was a bit of a screw. But he could do a handsome and generous thing for himself. His selfishness would expand nobly, and rise above his prudential considerations, and drown them sometimes; and he was the sort of person, who, if the fancy were strong enough, might marry in haste, and repent — and make his wife, too, repent — at leisure. ‘What do you laugh at, Charlie?’ said Wylder, grinning himself. ‘At your confounded grumbling, Mark. The luckiest dog in England! Will nothing content you?’ ‘Why, I grumble very little, I think, considering how well off I am,’ rejoined he, with a laugh. ‘Grumble! If you had a particle of gratitude, you’d build a temple to Fortune — you’re pagan enough for it, Mark.’ ‘Fortune has nothing to do with it,’ says Mark, laughing again. ‘Well, certainly, neither had you.’ ‘It was all the Devil. I’m not joking, Charlie, upon my word, though I’m laughing.’ (Mark swore now and then, but I take leave to soften his oaths). ‘It was the Persian Magician.’ ‘Come, Mark, say what you mean.’ ‘I mean what I say. When we were in the Persian Gulf, near six years ago, I was in command of the ship. The captain, you see, was below, with a hurt in his leg. We had very rough weather — a gale for two days and a night almost — and a heavy swell after. In the night time we picked up three poor devils in an open boat —. One was a Persian merchant, with a grand beard. We called him the magician, he was so like the pictures of Aladdin’s uncle.’ ‘Why he was an African,’ I interposed, my sense of accuracy offended. ‘I don’t care a curse what he was,’ rejoined Mark; ‘he was exactly like the picture in the story-books. And as we were lying off — I forget the cursed name of it — he begged me to put him ashore. He could not speak a word of English, but one of the fellows with him interpreted, and they were all anxious to get ashore. Poor devils, they had a notion, I believe, we were going to sell them for slaves, and he made me a present of a ring, and told me a long yarn about it. It was a talisman, it seems, and no one who wore it could ever be lost. So I took it for a keepsake; here it is,’ and he extended his stumpy, brown little finger, and showed a thick, coarsely-made ring of gold, with an uncut red stone, of the size of a large cherry stone, set in it. ‘The stone is a humbug,’ said Wylder. ‘It’s not real. I showed it to Platten and Foyle. It’s some sort of glass. But I would not part with it. I got a fancy into my head that luck would come with it, and maybe that glass stuff was the thing that had the virtue in it. Now look at these Persian letters on the inside, for that’s the oddest thing about it. Hang it, I can’t pull it off — I’m growing as fat as a pig — but they are like a queer little string of flowers; and I showed it to a clever fellow at Malta — a missionary chap — and he read it off slick, and what do you think it means: “I will come up again;”’ and he swore a great oath. ‘It’s as true as you stand there — our motto. Is not it odd? So I got the “resurgam” you see there engraved round it, and by Jove! it did bring me up. I was near lost, and did rise again. Eh?’ Well, it certainly was a curious accident. Mark had plenty of odd and not unamusing lore. Men who beat about the world in ships usually have; and these ‘yarns,’ furnished, after the pattern of Othello’s tales of Anthropophagites and men whose heads do grow beneath their shoulders, one of the many varieties of fascination which he practised on the fair sex. Only in justice to Mark, I must say that he was by no means so shameless a drawer of the long-bow as the Venetian gentleman and officer. ‘When I got this ring, Charlie, three hundred a year and a London life would have been Peru and Paradise to poor Pill Garlick, and see what it has done for me.’ ‘Aye, and better than Aladdin’s, for you need not rub it and bring up that confounded ugly genii; the slave of your ring works unseen.’ ‘So he does,’ laughed Wylder, in a state of elation, ‘and he’s not done working yet, I can tell you. When the estates are joined in one, they’ll be good eleven thousand a year; and Larkin says, with smart management, I shall have a rental of thirteen thousand before three years! And that’s only the beginning, by George! Sir Henry Twisden can’t hold his seat — he’s all but broke — as poor as Job, and the gentry hate him, and he lives abroad. He has had a hint or two already, and he’ll never fight the next election. D’ye see — hey?’ And Wylder winked and grinned, with a wag of his head. ‘M.P. — eh? You did not see that before. I look a-head a bit, eh? and can take my turn at the wheel — eh?’ And he laughed with cunning exultation. ‘Miss Rachel will find I’m not quite such a lubber as she fancies. But even then it is only begun. Come, Charlie, you used to like a bet. What do you say? I’ll buy you that twenty-five guinea book of pictures — what’s its name? — if you give me three hundred guineas one month after I’m a peer of Parliament. Hey? There’s a sporting offer for you. Well! what do you say — eh?’ ‘You mean to come out as an orator, then?’ ‘Orator be diddled! Do you take me for a fool? No, Charlie; but I’ll come out strong as a voter — that’s the stuff they like — at the right side, of course, and that is the way to manage it. Thirteen thousand a year — the oldest family in the county — and a steady thick and thin supporter of the minister. Strong points, eh, Charlie? Well, do you take my offer?’ I laughed and declined, to his great elation, and just then the gong sounded and we were away to our toilets. While making my toilet for dinner, I amused myself by conjecturing whether there could be any foundation in fact for Mark’s boast, that Miss Brandon liked him. Women are so enigmatical — some in everything — all in matters of the heart. Don’t they sometimes actually admire what is repulsive? Does not brutality in our sex, and even rascality, interest them sometimes? Don’t they often affect indifference, and occasionally even aversion, where there is a different sort of feeling? As I went down I heard Miss Lake chatting with her queen-like cousin near an open door on the lobby. Rachel Lake was, indeed, a very constant guest at the Hall, and the servants paid her much respect, which I look upon as a sign that the young heiress liked her and treated her with consideration; and indeed there was an insubordinate and fiery spirit in that young lady which would have brooked nothing less and dreamed of nothing but equality.","sourceLink":"http://novel.tingroom.com/jingdian/1441/43354.html","bookId":1372,"book":{"id":1372,"title":"Wylder\u0027s Hand","description":"简介： It was late in the autumn, and I was skimming along, through a rich English county, in a postchaise, among tall hedgerows gilded, like all the landscape, with the slanting beams of sunset. The road makes a long and easy descent into the little town o...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1441","creation":"Aug 1, 2019 12:24:56 AM","modification":"Aug 1, 2019 12:24:56 AM"}}
