{"id":86465,"no":22,"title":"Page 22","content":"\n Nicky looked down for a long moment before he raised his head. “All right.”\n “Uh-all right what?You accept your punishment?” Marco’s tone was nervous.\n “I understand what you’re saying, and I said all right. May I go now?”\n “Nicky, this punishment is for your own good. Ian will place you on a work detail. You’ll be with Logan too. The thirty days will pass before you know it.”\n Nicky nodded. “Sure thing. May I go now? Sir?”\n Marco nodded nervously, and Nicky strode to the door, followed by Logan.\n When Nicky got to the door, he turned with an innocent look on his face.“Oh and where are we to sleep during this time?”\n “Sleep? At home, of course!” Marco thundered,\n “Oh, I think not.I’m not sure if I have a home here anymore. I’ll just sleep outside, if it’s all right with you.I’d be a lot more comfortable.”\n Logan stepped over beside him.“And that goes for me too. Either outside or in a cell.”\n Marco and Ian exchanged glances, and Marco turned a furious gaze on the young men. “Suit yourselves.”\n Nicky inclined his head regally and swept out of the room, drawing Logan with him.\n Ian called behind them. “Wait outside the rear lodge door. I’ll be out in a moment with your assignments.”\n Nicky nodded again and took off down the hall, speaking over his shoulder to Logan. “Bastard. Marco may think they’re going to give me my assignment, but he’s got another think coming.”\n “What are we going to do?”\n “Not we, Logan. I don’t want to pull you into this.”\n “Nicky, we’re a team now. I go where you go.”\n Nicky grinned. “Okay. But let’s wait till we get farther away before I tell you. Marco can read my mind at close quarters. It’s a blood match thing. Very annoying.”\n They walked to the apartment area before Nicky turned to him. “We’re leaving the compound. Marco said we’d be banished. So we’re banished.”\n Logan’s eyebrows raised. “But…”\n “Scared?” Nicky asked, still enjoying himself.\n “Not scared, no, but Hunters are in the woods, and we won’t last long without wolf blood. They said they’d feed us before we left.”\n Nicky nodded. “We’ll find Rory and feed from him. It won’t taste as good, and you won’t enjoy it much, but it will nourish you. I’ll swear Rory to secrecy. Let Marco and Ian worry about us going feral. It will serve them right. I just might plant a little idea in Rory’s head too, in case they manage to break him down. One that will have Marco eating out of my hand.”\n Nicky led Logan to Rory’s quarters, assuring Logan there would be no one there that time of day. Once there, Nicky went into Rory’s closet and found shirts, jeans, and boots that would fit them and coats for both. He included a second set to provide them both with a change, grabbed a few blankets off the shelf as well, and handed some to Logan.\n “Now we need to slip away without being seen by too many people and take off to the woods. We’ll figure out where we’re going once we get safely out of here and find Rory.”\n They accomplished the first task without too much difficulty, but finding Rory was a different story. They went to three different work sites before they saw him on the north side of the compound chopping wood. Luckily, he was off by himself, with only a few other workers around. Nicky called softly to him from the tree line, and he looked up in surprise. Putting down his axe, he went over to him.\n “What are you two doing out here? I thought Marco was keeping you in jail.”\n “Marco decided to get cute and try to force me to obey him. He banished us for thirty days if we refused tojoin a work detail,” Nicky explained.\n “What? You must have really made him furious, Nicky. One day you’ll push him too far.”\n “Hmm, that day may have come. We’re leaving Mountainwood.”\n “What?”\n “Oh, stop saying what, Rory. You knowI won’t let Marco force me that way. He needs to learn a lesson once and for all.I’m not his damn little slave or his child. We’re leaving for the full thirty days. If Marco and Ian are worried, oh well.”\n “But what about your feedings? You can’t last thirty days without—oh no, sothat’s why you’re here. I don’t want to get involved in this!”\n “So you’d rather see us starve? Rory, you have to help.”\n “Damn, Nicky, feeding two of you will make me so weak I won’t be able to work the rest of the day.”\n “So say you’re sick and go home.”\n “Shit!” Rory rolled up his sleeve and bit down into his wrist. Nicky went first, drinking deeply.\n He finished and looked up at Rory. “Do you need to rest?”\n “No, go ahead, Logan.” He held out his arm to Logan.\n Gingerly, he put his mouth on Rory’s wrist and sucked. Nicky was right. It didn’t taste anything like Ian’s. It wasn’t as unpleasant as he thought it would be, but he still had to force himself to keep sucking until Nicky touched his arm.\n “Enough, Logan. That should last us for two weeks. Rory, we’ll need to see you again in a couple of weeks to feed. Will you meet us back here? Same place?”\n Rory, little pale and weak, nodded his head. “Okay, but be careful, Nicky. The Hunters are in the woods.” He glanced over at Logan and shrugged apologetically. “Sorry.”\n “It’s all right. I’m not a Hunter anymore. I’m Werekin.”\n Rory smiled,and Nicky squeezed Logan’s hand. “Remember, Rory, you haven’t seen us. Don’t give them the comfort of knowing we’ve fed. Oh, and one more thing. We’re thinking of asking the Huntersfor asylum if something can’t be worked out. Then they’ll have to send blood in to us on a regular basis if they want to keep us alive.If Marco and Ian don’t value us anymore and want to banish us, we’ll go to the Hunters for help. They might even have discovered a synthetic blood by now.”\n Rory shook his head. “Damn, Nicky, you’re talking crazy and you can be so cruel to Marco. You know you don’t mean any of that!”\n Nicky blushed. “I might! Okay, of course I won’t. You know I’m crazy about Marco, but he’s so stubborn. He can be pretty cruelhimself, and he has to stop treating me like I’m a disobedient kid. Just look at how Ian has treated poor Logan.You’re welcome to come with us.”\n “No, Casey has finally started acting almost normal again. It’s been a rough couple of days for me. You know how he gets. I’ll stay and tough it out—I’m used to working anyway. If I wasn’t doing this, it would be some other chore. No, just be careful. Please. Forget this shit about the Hunters, Nicky. You’ll get yourself and Logan into some serious trouble.”\n Nicky shrugged and gave Rory a hug.\n “I thought you couldn’t touch another wolf,” Logan said.\n “He’s related to Marco so it’s allowed between us. Besides, I don’t much care about wolf laws right now.”\n They heard the sounds of some kind of uproar going on already. In the distance they saw people running here and there.Nicky pulled Logan’s arm.\n “They know we’re gone. Hurry. We need to get as far away as possible so Marco can’t sense me.”\n “Followme,” Logan said. “I know a place we can go.”\n Nicky looked surprised, but followed along as Logan led the way, waving a hand to Rory as they left. Logan ran due north of the compound, off the trails, through some pretty dense underbrush. Nicky pulled on a coat to avoid scratching up his bare arms and plowed through the woods behind Logan, already protected with the camo he still wore. After about thirty minutes of making their way through the underbrush, they came to an old trail, mostly grown up, but still clear in some places. Logan followed the trail, again heading north of the compound. They walked for two hours, stopping a couple of times to rest. Logan was out of practice, and Nicky had been mostly sedentary for months. They’d made about four miles, and both were growing a bit weary before Logan heard the sound of the waterfall he searched for. He led Nicky to the falls, and they climbed around to gain access. “Take off your clothes, roll them up and try to keep them dry. We have to go under the falls.”\n It wasn’t a huge torrent, like many of the falls in the area, more of a steady rain shower effect. Nicky followed Logan’s example, stripping off and rolling the blankets and clothes into a tight ball. They ducked through the falls and into a shallow cave beyond. The mouth of the cave was damp and wet, but further in, toward the back of the cave, it was dry with signs of people having camped there in the past.\n “This is an old Hunters’ cave,” Logan explained. “Hasn’t been used in a while as you can see, not since we moved up closer to the compound,but it’s perfect for our needs. We can have a fire back here, and it just looks like spray or mist outside the cave.”\n “Plenty of handy water, too, but what happens if they come back?”\n “There’s a back way out.”\n “I’ve never heard Marco mention this place, either. Perfect!”\n They quickly set up their camp, making their pallets and beds and starting a small fire. Nicky looked over at Logan while he worked. “Do you know how to get us some food? We don’t actually have to eat, since the wolf’s blood will keep us nourished for a while, but I still get hungry.”\n Logan grinned. “My Hunter’s skills will come in handy. I can snare rabbits and kill birds with a sling shot I can make. Yeah, I can probably keep us fed pretty well. This stream has fishing further down too, and you can do that. I’ll make you a pole tomorrow. We can tear off the trimming on these blankets to make the strings we’ll need. There’s wild plants that are edible, too, and don’t taste too bad. It’s too late tonight, but I can get started in the morning.” \n","sourceLink":"https://allnovel.net/logan-s-choice-dark-hollow-wolf-pack-3/page-22.html","bookId":2255,"book":{"id":2255,"title":"Logan\u0027s Choice (Dark Hollow Wolf Pack #3)","description":"Storyline: \n Logan\u0027s Choice (Dark Hollow Wolf Pack #3) \n As the beta of the Dark Hollow Wolf Pack, Ian is supposed to be the calm, sensible one, but when a young Hunter is captured, his overpowering attraction to the gorgeous man has him acting way out of character. \n As a sworn enemy to the wolf pack, the captive can’t be allowed to go free, yet the pack hates to keep Logan imprisoned. The only solution is to convince Logan to agree to mate with one of the wolves to form an unbreakable bond. Unwilling to see him mated to anyone else, Ian makes a decision—he must make the young man fall in love with him and agree to stay on as his mate. \n Can Logan make this difficult choice and leave behind the life he used to lead? When Ian is captured and tortured by the Hunters, Logan must make the most difficult choice of his life.\n \n","cover":"https://allnovel.net/images/logan-s-choice-dark-hollow-wolf-pack-3.jpg","author":"Shannon West","type":"Mystery","source":"allnovel","link":"https://allnovel.net/logan-s-choice-dark-hollow-wolf-pack-3.html","creation":"Oct 5, 2019 8:58:31 AM","modification":"Oct 5, 2019 5:14:17 PM"}}
