{"id":86062,"no":23,"title":"Page 23","content":"\n The car picks us up and takes us to the Upper East Side. The doorman lets us in and we take the elevator up to the penthouse, where her uncle is waiting when the doors open.\n “Uncle Nate,” Jill says, and she runs to him and hugs him. “You were right about everything. I’m so sorry I didn’t listen to you.”\n “Jill—what on earth is going on?” He lets go of her and scrutinizes her face, gripping her by the shoulders. Then he sees me and does a double take.\n “Who . . . what are you doing here?” he says finally.\n “Uncle Nate, this is Griffin. This is my uncle Nate,” Jill says.\n I hold my hand out. Her uncle has the oddest look on his face, as though he recognizes me, though I’m fairly certain I’ve never seen the guy before in my life.\n “Nice to meet you,” I say.\n He’s still giving me a look like I just told him I eat shit for breakfast or something.\n He stutters. “Hello,” he finally says, coughing. We shake hands, his palm slick with sweat. I wipe my hand on my jeans.\n “Are you okay, Uncle Nate?” Jill asks.\n He coughs again and shoots me a look, then turns his gaze to her. “Yes, Jill. Everything’s fine.” He looks at her more closely. “What happened to your neck?”\n We go and sit in the parlor. They start talking, and from what I get from the conversation, it sounds like Jill’s uncle knew about this all along. After a little while, though, I zone out, and try to make sense of the fact that not only is my father a giant asshole, he’s responsible for the death of one person and nearly killing someone else. So he’s even more of a giant asshole than I thought he was. More ruthless, more sociopathic, just completely fucked up. What will happen now? It’s hard to picture good old Dad in Sing Sing, but if I’m honest, that’s exactly what I hope will happen.\n I get up and use the bathroom. When I come back, Jill and her uncle are still talking, so I sit back down. From somewhere behind me, I hear the door open and footsteps approaching.\n “Nate, you in?” a male voice calls.\n I recognize that voice. It takes me a second, but then it clicks, and when he appears in the doorway, I’m not surprised to see he’s got a pockmarked face and picket fence teeth.\n “Bruce,” Nate says, jumping up as Snaggletooth steps into the room. “This is my niece, Jill. And her boyfriend. Griffin.”\n The three of us stand there and I can feel the pieces falling into place, practically hear the click click as they align like gears on a watch.\n Nate coughs again and Bruce extends his hand. “Nice to meet you both,” he says.\n “Have we met before?” I ask.\n He too stutters and then clears his throat and shoots a surreptitious glance at Nate.\n “No, I guess you’ve just got one of those faces,” I say, giving him a wink.\n They start talking about the Yankees-Red Sox game coming up, and that’s as deep as the conversation gets. So I let it lie.\n When I finally look at my phone, I have thirty-seven missed calls, mostly from Cam, a few from my mother.\n “What the fuck is going on?” he shouts when I finally call him back. I hold the phone away from my ear. “Dad was arrested?! You had something to do with it?”\n “You mean Carl? Yes, Carl was arrested. Would you like to know why? Oh, because he almost killed my girlfriend. Is Carl going to be adjusting to a new life of three hots and a cot? I’d say so, and for a long ass time.”\n “DO YOU HAVE ANY IDEA WHAT YOU’VE DONE?”\n “The right thing, for once in my life. Look, Cam, I think Dad was involved in a whole bunch of shit we had no idea about. Like, bad stuff—”\n “Oh my god.”\n It sounds like he’s hyperventilating. Or crying. Maybe both.\n “I’ve got to go. I’ve got to fucking go. Jesus Christ. You have NO IDEA how badly you’ve just messed things up, you moronic piece of shit! FUCK YOU, Griffin. FUCK!” He screams this last part, his voice cracking, and then the line goes dead. I stare at the phone for a minute. I take three deep breaths, in through the nose, out through the mouth, then slip the phone back into my pocket.\n Chapter 28: Jill\n Testifying against the man who tried to kill me is not as cathartic as you might imagine. The courtroom is packed, and the entire time I’m being questioned I feel as though I’m stuck in a terrible dream where I’m on stage for a school play and I’ve forgotten all my lines. But I am able to look out into the sea of faces and find Griffin, and all he has to do is give me a little smile and I know that yes, I can get through this. Afterward, we fly back to California. There is no need to follow the rest of the trial or the ensuing media circus. The second session of camp starts up, and both Griffin and I dive back into the routine, glad for the distraction.\n It’s the night of the Beach BBQ, which has pretty much wound down to a few campers giggling in their tents. Griffin and I set up separate tents next to each other, but we both wind up outside, lying in the sand, looking up at an impossibly clear sky that looks like crushed velvet.\n “Maybe you should be down there patrolling the shore for any more kidnapped men who happen to wash up,” Griffin says. He’s holding my hand, running his thumb in slow circles over my wrist bone. “You know, one that might be more handsome and better in the sack than I am.”\n I laugh. “You’re actually the only person I want to be with. Even if your father did try to kill me.”\n “Oh yeah, that. Well, there’s also the whole getting kidnapped by your uncle, so maybe it’s a fair trade-off. Clearly, our families are both completely fucking insane.”\n “So then we probably are, too? I mean, it seems like such a bad way to start a relationship. That’s what the basis of our relationship is: My uncle had you kidnapped; your father tried to kill me.”\n “Lift your head up a little,” he whispers.\n His breath is warm against my ear. I do, and he slides his arm under my neck and pulls me toward him. I turn so I’m lying more on my side and drape my arm across his face, nestle my own face in the crevice where his shoulder meets his neck. “It doesn’t matter what our families tried to do. Or actually, it does, because that’s what got us together to begin with. So am I glad it all happened? Yes and no. Nobody wants shitty things to happen to other people, but sometimes they do, and sometimes good things come of it. Not to get all New Age-y on you or anything. But really, the way I see it for myself, anyway, getting kidnapped gave me this second chance to actually live a life that wasn’t a total fucking waste. I don’t know if it would’ve happened otherwise, or it might’ve taken a lot longer. And then I met you, and actually get to be with you, well, that just tells me for once I made the right choices.”\n It’s an interesting way to look at things. And who knows? Maybe he’s right. Maybe every bad thing that happens is just an opportunity for a second chance, for a better way of doing things. It has certainly brought the two of us closer, and we both, in a way, have a second chance at things, and I think that just maybe that means things will work out.\n Epilogue - Griffin\n The day of Jill’s graduation is warm and sunny. We drive over from our apartment in Hayes Valley to her mom’s house to help her get ready for the ceremony. When Annabel is ready, I wheel her outside and help her get into the car.\n “I just wish her father could be here to see this,” she says. “But I’m really so proud of her.”\n The ceremony is long, and during a particularly verbose speech, I find myself daydreaming, thinking about the past year. I’d be lying if I didn’t say that I occasionally miss the old days, but it’s a fleeting type of longing, and not something I’d ever go back to if I could. My days now have a steadiness to them that I think of as a kind of rhythm, a balance that I never had before. I like nothing more than waking up in the bedroom of our third-floor apartment, the sun gently filtering in through the curtains Jill and I picked out. I get up, make coffee, we have breakfast together. We get ready; she goes to the Sutter St. Women’s Center, where she’s doing an internship when she doesn’t have class, and I head up to Marin, where I’m working as an intake counselor at the Morning Glory Rehabilitation Center. I get a paycheck every two weeks, directly deposited into my bank account. We pay our bills, we go out sometimes, still have great sex. Life is good.\n I talk to Mom occasionally; I’m trying to get her to come out and visit, though she’s resisting, for whatever reason. She is still recovering from everything that happened, and though she isn’t living a life of poverty, Dad’s legal fees depleted a significant portion of his wealth. Cam has disappeared. No one has heard from him, I’ve looked for his face on the cover of those supermarket tabloids, but nothing. The phone he gave me never rings, though I still keep it on my dresser and check it once in a while.\n I don’t know if I’ll ever go visit my father in prison. Unlikely, but I occasionally think of writing him a letter. The only problem is I don’t know what I’d write. Does he deserve a second chance as well? I’m not sure.\n Annabel and I both yell our heads off when Jill’s name is called, and she walks across the stage and gets her diploma. She’s the hottest girl up there, by far, and I stick my fingers in my mouth and give her the loudest whistle I can.\n When the ceremony is over, it takes us a little while to find her in the crowd. She comes over, diploma in hand, and I give her a bouquet of flowers (not orchids!) and a hug.\n “Congratulations, sweetheart,” I say. “You’re a graduate.”\n “I am!” she says gleefully. She gives me a kiss. “Thank you for everything.”\n “Me? I hardly did a thing.” I lean toward her, my mouth against her ear. “But I’ll tell you one thing: I can’t wait to take you home and properly celebrate.”\n She looks at me and grins. “I like the sound of that,” she says.\n Much later that night, after Jill and I have celebrated her new status as college graduate in our own way, I get up to get a glass of water. The moonlight filters in through the curtains and throws narrow rectangular strips of lights across the hardwood floor. Seeing it reminds me for a second of the thin shaft of lights I first saw when I came to in that walk-in closet on the yacht, and I wonder: Maybe everything really does happen for a reason? I always believed you made your own destiny, the path you were supposed to follow was whatever one you chose to go down. But for everything that’s happened since I landed in Koh Phangan and made my way to the Full Moon party makes me think otherwise.\n I set the glass down in the sink and head back into the bedroom. Jill is lying there, the sheet draped halfway across that long, gorgeous body of hers. For a moment, I lean against the doorframe and watch her sleep. I could do this for the rest of my life, I think. I could wake up next to this woman for the rest of my life and be totally and completely content.\n I walk toward the bed when my dresser suddenly starts glowing. It’s the phone, Cam’s phone, and it rattles lightly against the wood as it vibrates, once, then twice. Text message. I go over and pick it up. It is from a number I don’t recognize, but the message is clear enough:\n This is not over yet.\n I think about texting something funny back, but then don’t. I wait to see if any more messages follow, but after a minute the screen darkens and then shuts off completely, though I can still see those five little words as if I were looking right at them.\n I turn the phone off completely and put it in my sock drawer. Then I crawl back into bed, back into this wonderful bed where a very short time ago I was experiencing all the ecstacy and bliss a human is pretty much capable of. Now, though, I only feel a tightening knot of uneasiness in my chest, swirling down toward my gut, full of the certainty that Cam will make good on his promise and that this is nowhere near from over. \n","sourceLink":"https://allnovel.net/fall-with-me/page-23.html","bookId":1898,"book":{"id":1898,"title":"Fall With Me","description":"Storyline: \n Jill Freyss-Charon is just trying to get through the year. After losing her father in a horrific car accident, she is eager to return to her summer job at a horse ranch where she knows everything will be just as it always is each summer. \n But when a tanned young man washes up on the beach outside her tent one night, half-drowned and begging to be given shelter until morning, any hope of normality immediately vanishes. \n Jill has dated Griffin Alexander\u0027s type before, and soon regrets taking him in when he decides to stay on at the ranch. She finds she is repelled by him, and doesn\u0027t believe his crazy story about being kidnapped and held to ransom... until three words escape his lips that send her head into a tailspin. \n ...Three words that threaten to unravel her painful past and bring her closer to this man she is trying to avoid - which will put her in more danger than either realizes.\n \n","cover":"https://allnovel.net/images/fall-with-me.jpg","author":"Bella Forrest","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/fall-with-me.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 5:10:52 PM"}}
