{"id":86047,"no":8,"title":"Page 8","content":"He sets his plate on the clean counter. “You really shamed me back there, you know. About the lion hunting.”\n I can’t tell if he’s joking or not; his expression is difficult to read.\n “It wasn’t my idea,” he continues. “It’s something my father wanted to do. He thought it would be a good father-son bonding experience or something. The African Serengeti is totally the place I’d choose for something like that.”\n “Well, your dad sounds like a real gem.”\n Griffin smiles. “Oh, he is. You have no idea. Except when it came down to actually taking the shot, he couldn’t do it.”\n “So is that supposed to make it better?”\n “I’m not saying that. But, yes, maybe. Seeing as I wasn’t the one who actually did it.” He reaches across me and turns the water on, runs his plate under the faucet. His arm touches mine and I take a step back.\n “Look,” he says. “I wanted to tell you—”\n “Unless you’re telling me you’re leaving, there’s really nothing to say,” I snap.\n Something that might be a hurt look crosses his face. I try not to roll my eyes.\n “I don’t know what I did to make you decide I’m this terrible person, but—”\n “You showing up here was enough. I’ve had an incredibly shitty year and I figured the one thing I could count on was coming back to my summer job—the same summer job I’ve had for years now—and knowing that at least this would be the same as it’s always been, that at least I had that to look forward to. But no, I don’t even have that, because you show up—claiming you were fucking kidnapped, which is the biggest load of shit, by the way.”\n He holds up his hands. “Look, sweetheart—is it because you feel like I’m stealing the spotlight from you or something? Because that’s really not what I’m trying to do at all. Allison said you were—”\n I laugh. “Allison knows nothing about me. And I don’t care about this proverbial spotlight, I just want things to go back to how they used to be.” I say the last part of this sentence in a shaky voice, and I’m mortified to feel tears pricking the corners of my eyes.\n He looks at me, confused. “Are you okay?”\n But I don’t answer. I turn and leave the kitchen, refusing to let him or anyone else see me cry. A sob rises up in my throat that I try valiantly to keep from surfacing but it’s too late, and I’m probably not out of earshot when I burst into tears.\n I actually go and cry on my bed for a good five minutes. Finally, I stop, a few residual hiccups left over.\n Get a grip, I tell myself. I sit up, my face soggy. This is pathetic. It doesn’t have to ruin my summer, it doesn’t have to do anything. Griffin is here, and most likely, Allison will keep him preoccupied the whole time. End of the fucking problem.\n Chapter 9: Griffin\n I’ve got to admit that it’s nice not having anything.\n I haven’t run through an official inventory yet, but somewhere between here and Koh Phangan is my North Face rucksack with my passport, my iPhone, a wallet containing ID, debit card, cash, the keys to my apartment in Tribeca. Also clothes, a pair of Gucci sunglasses, a bottle of Clive Christian No. 1. Perhaps all that stuff is floating in the Great Pacific garbage patch, or maybe it’s been sold on the black market and some kid in Bangkok is rocking my sunglasses and two thousand dollar bottle of cologne.\n But it’s nice, basically being stranded here at this horse ranch in Northern Cali. For the first time in a long time I really feel like I’m taking a break. Like this is something different, a change of pace. I find myself actually looking forward to getting up early. You’d think, then, that I’d wouldn’t do anything that might jeopardize this pastoral existence I’ve somehow stumbled into, but I decide it’s time to call my father. Allison lets me use her phone and I walk down to one of the paddocks and lean against the split-rail fence while I wait for him to answer his phone.\n “Carl Alexander,” he says in a clipped tone when he picks up.\n “Hey, Dad, how’s it going?”\n There’s a pause. “Griffin?”\n “Yes, Dad. Who else would be calling you Dad?” That’s another distinction Cam made for himself early on. I don’t actually have any memories of Cam calling our father “Dad.” It was always “Carl.” Carl, would you let me borrow your Mercedes, or, better yet, buy me one of my own? Carl, you won’t believe how Griffin fucked up again. Carl, would you pass the peas?\n “There was some static on the line. I’m out on the golf course. It’s windy. I don’t usually answer my phone when I’m golfing.”\n “Yet you did this time.”\n “Yet I did. So would you like to tell me what exactly it is I can help you with?”\n “Oh . . . you know. Just had a quick question. Did you receive any strange calls from someone? From someone, say, oh, I don’t know, claiming that they had kidnapped me?”\n He coughs, once, twice. “Excuse me one minute,” I hear him say in a muffled voice to whoever he’s out golfing with. He gets back on the phone. “I may have received a rather unorthodox call. Clearly, though, you are all right. Am I correct?”\n “You always are.” Or at least you think you always are.\n “So then I was also correct in assuming that the call was a prank. Yet another pathetic extortion attempt by people who are too lazy or too stupid to amass large sums of money on their own. It’s really not difficult, you know.”\n “What? Extorting you? Because there actually were two men, who are probably dead now, who said they were going to kill me unless you paid them 7.2 million dollars. And confessed to something. What on earth could you possibly have to confess to, Dad?”\n There’s a lot he could confess to, I’m sure. A thing or two I might even be privy to, if you want the truth, though I’m no snitch. I wonder, though, just what sort of things he’s done that has pissed off someone so badly they’d demand that much money and a confession.\n “Is there something you need, Griffin? Because if not, I’ve got things to get back to.”\n “Of course. Don’t want to keep the putting green waiting. But yes. While I was being kidnapped, I lost my wallet. Can you believe it? So I need some money.”\n “Call your mother. She’s probably at home. She can transfer whatever you need into your bank account. You might also want to consider getting a job. Getting your life together and stop living off my dime. That thought ever cross your mind? You think your brother would call me with some ridiculous story like this? Get back in touch when you’ve got some good news to share. Like I said, I’m in the middle of something important right now, so it’s not really a good time to be talking about this.”\n “Okay, great!” I say. “Try not to go eight over par this time! Bye, Dad!”\n I throw the phone down and wonder how it’s possible my father is such a fucking douchebag.\n I take a few calming breaths. In through the nose, out through the mouth. Ommmm. I had relations with a yoga teacher once, and aside from being wonderfully flexible, she taught me how to breathe. How most people go through their whole life not really being conscious of breath, and how, in almost any situation, taking a step back, looking inward, and focusing on breathing, will help you feel better almost immediately.\n I pick up the phone and dial Cam’s number.\n “It’s Griffin,” I say when he picks up.\n “I know who it is,” he snaps. “Where are you? What the hell is going on?”\n “Well, I’m okay, if that’s what you’re asking.”\n “So you’re not . . . you’re not kidnapped?” A hard edge is starting to creep into his tone.\n “I was kidnapped. And managed to escape, with the little help of an overzealous cetacean.”\n “A what?”\n “A whale.”\n He lets out a noisy breath. Cam, I can assure you, is not one of those people who pays much attention to the way they breathe.\n “Griffin,” he says, his voice low. “I am going to ask you this one time. Once, you got that? And you better tell me the truth.”\n “Okay.”\n “Are you just fucking with me here?”\n “No! Do you seriously think I’d call you out of the blue and tell you that I’d been kidnapped?”\n “The answer to that question is so blatantly obvious I’m not even going to dignify it with a response. So what happened, then? Where are you now?”\n I tell myself the concern in his voice is because he actually does give a shit about what happens to me. “I’m in California. Half Moon Bay. Nice place, actually.”\n “Are you coming back to New York?”\n “Eh . . . not right now—”\n “Because I’d really like to speak to you. In person.”\n I straighten. “You what?”\n “You should come back to New York. I’ll come get you at the airport. I need to talk to you.”\n “Uh . . . well. Okay. Okay, maybe I can do that. I mean, I will eventually, but I was sort of enjoying myself out here. I’ve got a job, even. Cool, huh?”\n “A job? You, Griffin Alexander, all of a sudden have a job? What, are you settling down now? You need to get your ass back to New York, because I really need to talk to you about this.”\n Hmm. This is interesting. If I’m not mistaken, it almost sounds like there’s a note of desperation in his voice. “I talked to Dad, you know.”\n “You did?”\n “Yes. He didn’t seem all that concerned. About anything, except golfing.”\n “Listen, Griffin. There’s a meeting I’ve got to get to—I’m already late. Is this your phone number? I’m going to call you back.”\n “No, it’s not. I lost my phone. I don’t have a phone. Which is actually kind of nice—”\n “You need to be available so I can reach you. Can you get a phone?”\n “I guess, but—”\n “No, I’ll send you one. Tell me your address. Tell me where to send you a phone. Do you need anything else? I can send you whatever you need.”\n “Um . . . just my yellow Speedo thong for the days I’m not wearing the mankini.”\n There is a pause, and then he actually laughs, though it sounds forced. “Just give me your mailing address.”\n I give him the address. “I’ll express mail it,” he says. “Be expecting a package. And my call. Goodbye.”\n He hangs up. I stare at the phone for a while and wonder if that conversation actually just happened.\n See, the thing about Cam is that he’s never acted like he’s given two shits about me. Ever. I was always the annoying little brother, the tagalong, and then I was the obnoxious wild child, where it seemed like my sole purpose for existing was to fuck up and make Cam look like the golden boy he is.\n But I’ve always wanted him to like me. Pretty much everyone he comes in contact with does, and usually only the very successful men and very beautiful women are given the privilege of his company.\n It’s just as likely he’s getting his assistant to go buy a phone to express mail to me, but I like to think he’s hurrying down to the Mac store, stuffing an iPhone into a padded envelope, and writing my name on it himself. Waiting in line at the post office or FedEx or wherever. There is, of course, a part of me that doesn’t think this package will ever show up, that doubts my brother will call, but a larger part of me hopes he will. And if he does, then . . . maybe I should have got myself kidnapped sooner.\n I go for a swim, which, even after all I’ve been through, is still my second favorite way to let off some steam and clear my head. The water is cold but refreshing. I follow the footpath back to the ranch, but stop before I actually come all the way out into the clearing. Jill is walking into the main pasture where they keep most of the horses, and several of the horses are ambling over toward her. She pets them, and it looks like she’s talking to them though I can’t hear what she’s saying. She pulls something out of the back pocket of her jeans and then runs her hand down one of the horse’s legs. The horse lifts its foot to her and she bends, using the pick she’s pulled from her pocket to dig something from the horse’s hoof. When she’s done, she gives the horse a hearty pat on the neck, and the horse bumps its nose against her shoulder, as if to say thanks.\n She looks different, around the horses, even from this distance I can tell. More at ease, more like who I think she might’ve looked like when she was younger, when you’re still carefree and don’t have to deal with all the stresses of life. \n","sourceLink":"https://allnovel.net/fall-with-me/page-8.html","bookId":1898,"book":{"id":1898,"title":"Fall With Me","description":"Storyline: \n Jill Freyss-Charon is just trying to get through the year. After losing her father in a horrific car accident, she is eager to return to her summer job at a horse ranch where she knows everything will be just as it always is each summer. \n But when a tanned young man washes up on the beach outside her tent one night, half-drowned and begging to be given shelter until morning, any hope of normality immediately vanishes. \n Jill has dated Griffin Alexander\u0027s type before, and soon regrets taking him in when he decides to stay on at the ranch. She finds she is repelled by him, and doesn\u0027t believe his crazy story about being kidnapped and held to ransom... until three words escape his lips that send her head into a tailspin. \n ...Three words that threaten to unravel her painful past and bring her closer to this man she is trying to avoid - which will put her in more danger than either realizes.\n \n","cover":"https://allnovel.net/images/fall-with-me.jpg","author":"Bella Forrest","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/fall-with-me.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 5:10:52 PM"}}
