{"id":65060,"no":22,"title":"Page 22","content":"“Amends, he called it. He was going through his life, trying to make up for everything bad he ever did. You do that yourself?” “Not yet.” “Man, I was never a drinker, you know? Day I graduated Pembroke High I hit all the parties and came home shit-faced drunk. Fell into bed with my clothes on, and the room started spinning. Leaned over, puked on the carpet, and passed out. Woke up and said I’m never doing that again, and I never did.” Until he got to the last four words, his story was one I’d heard more times than I could count. “Amends,” he said, in something approaching wonder. “What did he ever do to me that he’s got to make amends? Me and Jack, we knew each other for a few years there. Worked a few moving jobs together, smoked a little dope together, hung out some. Only thing came to mind, he tried to get me to tip him to some people who’d be good pickings. You know, people I moved, and they had good stuff, and I’d get a cut of what he got from ripping them off.” “But you weren’t interested.” “No way, man!” He shook his head. “Man, run a little scam on the Welfare Department, get a check I got no right to? Go up to Klein’s, boost some socks and a shirt? Okay, why not? I’m no saint, I’m cool with shit like that. But stealing from human beings? People I met, people who paid me to take good care of their stuff, people who gave me tips? Not my scene.” He took a long drink of soda. “But where’s the amends come in? I, like, turned him down flat on that one. Never even tempted. Didn’t judge the man, just said no, not my scene. Matter of fact—” “What?” “Well, just thinking about it now, maybe I was the one owed him an amends. ’Cause what I did, a couple of the moving companies I worked for, I sort of told them not to hire him no more. Didn’t say why. Just, like, he’s not the most reliable cat to work with, he don’t pull his weight, he slacks off. Nothing to get him banned or give him a bad name, just enough so he’s the last one hired. Here I’m his friend and I’m keeping him from getting work, so maybe…” His voice trailed off, and I could see him running the question in his mind. He looked to be capable of devoting the next hour to its philosophical implications. I said, “But that wasn’t what was on his mind.” “Oh,” he said. “No, nothing like that. It was loose.” “How’s that?” “Loosey-goosey. Luce. Lucille, man. My old lady.” He looked off to the side, smiled at a memory. “Years back, this was. Not my old lady anymore. Been a few of them since her. My experience, they tend to come and go. You know what’s funny?” “What?” “They’re always around the same age. The ones that move all the way in, I mean. A chick who’s in my life for, like, fifteen minutes, she could be any age. But the ones who move in and park their shoes under the bed, they’re always twenty-four, twenty-five years old. When I was nineteen I had an old lady six years older’n me, and now I’m what, forty-seven? And the last old lady I had, like she moved out a year ago, and she was twenty years younger’n me. Man, Picture of Dorian Gray? Can you dig it?” He frowned. “Except not exactly Dorian Gray, but you see what I’m getting at, don’t you?” “Lucille,” I said. “Oh, right. Man, she was choice. Out of her fucking mind, but sweet. Had some fucked-up childhood.” He moved a hand to wave the past away. “Jack comes here, tells me how he was balling her. Him and Lucille, going at it like, I don’t know, mink? Man, he thinks he has to make amends to me for that?” “You already knew about it?” “I took it for fucking granted, man! Lucille, she was balling everybody. It didn’t take us more than a couple of months to get way past the whole fidelity number. We went to a few parties where everybody just did anybody who was handy. Man, after you watch your woman getting fucked by a stranger, you either let go of jealousy or you put her clothes in a box and set it out by the curb. I told him, I said, Jack, if this is keeping you up nights, man, let go of it. ‘But you were my friend and I betrayed you.’ By fucking Lucille? You want to make amends for that, go get in line, and it’s a long line.” “Wasn’t there something about a child?” “Oh, right. He thought he knocked her up. Well, somebody did. She was pregnant a couple of times while we were together. First time she had an abortion and the second time she waited too long and decided she’d have the baby. Then she winds up having a miscarriage, which was like good news and bad news, you know?” He looked off to the side again. “Makes you wonder.” “Oh?” “Say she had the kid. I mean, is that gonna keep us together? She could have had triplets and we’re still gonna split the blanket when the time comes. You can start thinking, Oh, we have a kid, I go to work for IBM, we get ourselves a split-level in Tarrytown, but none of that’s gonna happen. If she had a kid all it woulda meant is she’d have had one more thing to carry when she took off. Or she’d have left me with the kid, and what am I gonna do? Wrap it up and leave it outside a convent?” I had this sudden unbidden image: my sons, Mike and Andy, standing at a locked iron gate, waiting to be taken in by the Little Sisters of the Poor. I took a deep breath and blinked it away. “I wonder where she is now,” he was saying. “Last I heard she was in San Francisco. She could have a kid or two by now. Not mine, though. Not Jack’s either.” He had that faraway look again. “I might have a kid out there somewhere. That I had with somebody else, that I never knew about.” XXII THEN IT LOOKS as though we’re done,” Greg Stillman said. “They’re all in the clear.” “You sound disappointed.” “Not exactly. I had a problem and now it’s been resolved, and I’m grateful to you for resolving it. But—” “But it feels incomplete. Unfinished.” “Yes, of course. How do you feel, Matt? You’re the one who’s been out there doing the work. All I did was pick up the tab.” And all I’d done was go through the motions. I was in my hotel room with a cup of coffee from the deli downstairs, looking across the rooftops at some lighted offices all the way downtown. I’d decided I could make my final report over the phone. There was no real need to sit in another coffee shop while I told my client we were out of suspects. “I feel all right,” I said. “I’d like it better if I’d managed to crack the case, but that’s not what you hired me for. That’s a police matter anyway.” “But they won’t do anything.” “We don’t know that. It’ll be an open file, and when some new information comes their way, they’ll pick it up and work it. Greg, you wanted to be sure you weren’t holding out on them. Well, you’re not. Whoever killed your sponsee, it wasn’t one of the five people on his Eighth Step list.” “The man in prison—” “Piper MacLeish.” “Obviously he couldn’t have done it. Unless they give you a weekend pass so that you can even an old score. But couldn’t he pass the word to somebody outside?” “He’d have had to get the word himself. There’s nothing to indicate that Jack ever visited him, or even wrote to him. And it doesn’t really add up emotionally anyway.” “What do you mean?” “Say you’re in prison, serving a long sentence for something you did. ‘Hi, remember me? Say, I want to apologize because I’m the guy who ratted you out, and you wouldn’t have wound up in the joint if it wasn’t for me.’ ” “What a marvelous Ninth Step declaration.” “Well, he might have worded it differently, but that would be the gist of it. And what’s MacLeish’s reaction? ‘That son of a bitch, he did this to me, I’d better call in a favor and have him killed.’ No, we already crossed the Piper off the list, and I think we can leave it that way.” “I’m sure you’re right.” “I was a cop for a lot of years,” I said, “and I wasn’t the NYPD equivalent of a Step Nazi. I learned how to overlook things, and sometimes I profited financially from what I overlooked. But homicide was always different. When somebody got killed and it landed on my desk, I wanted to clear the case. “That didn’t necessarily mean that anybody wound up going away for it. That was the goal, but it didn’t always work out that way. Sometimes I knew who did it but couldn’t make a case that would stand up. But I’d done what I could, and the case was solved, so my work was done.” “And in this case?” “My work’s done,” I said. “Even though the case isn’t solved. So it feels incomplete to me, and yes, maybe a little disappointing. But that doesn’t mean I can’t let go of it. And I will. I pretty much already have.” He was silent for a moment. Then he said, “Maybe it’s just my ego.” “Because a perfect being like you ought to be able to do something?” “That’s part of it, Matt. The other part is further confirmation that I’m not really the piece of shit the world revolves around. Remember what I told you? That I got him killed, that I pushed him into the Eighth and Ninth Steps and that’s why he was murdered. But I guess that wasn’t it after all. I guess I’m not the prime mover of the universe. I guess I’m just another drunk.” At the meeting that night I mentioned that I’d spent an hour or two with a fellow who’d spent the past twenty-plus years quietly stoned on marijuana. “He knew not to offer me any,” I said, “and he didn’t smoke while I was there, but he’d smoked before I got there and I’m sure he fired up a joint the minute I left. The apartment reeked of it.” A woman named Donna came up to me on the break. She was a semi-regular at St. Paul’s, and had spoken there for her third anniversary a few months ago. Her approach was purposeful, and I assumed she had something to say about marijuana and its effects over time. I didn’t recall a whole lot of pot in her story, but that didn’t mean she couldn’t find something there to identify with. But it wasn’t that at all. Some months ago she’d moved in with her boyfriend, another sober alcoholic. He was still an alcoholic, but he was no longer a sober one, and she wanted out. “I’m such an idiot,” she said. She had long auburn hair, and kept pushing it out of her eyes, and it kept falling back across her face. “I’d heard his story, for God’s sake. I knew he went out every time he put a couple of years together. But he was sober when I met him, and he had more sober time than I did, and I thought he’d stay sober.” But he hadn’t. She’d kept her rent-stabilized apartment—“What is it they say? I may be crazy but I’m not stupid”—and that’s where she was staying now, but she had a whole lot of stuff at his place in Cobble Hill, and she hated to leave it but was afraid to go there by herself. “I don’t think he’d do anything,” she said, “because he’s a very gentle guy. At least when he’s sober. But he does have a history of spousal abuse. I’m not telling tales, it’s in his qualification, he mentions it every time he tells his story. And he always says it only happened when he was drunk. Well, he’s drunk now, isn’t he?”","sourceLink":"https://allnovel.net/a-drop-of-the-hard-stuff-matthew-scudder-17/page-22.html","bookId":2335,"book":{"id":2335,"title":"A Drop of the Hard Stuff (Matthew Scudder #17)","description":"Storyline: A Drop of the Hard Stuff (Matthew Scudder #17) \"Right up there with Mr. Block\u0027s best....A DROP OF THE HARD STUFF keeps us guessing.\"--Tom Nolan, Wall Street Journal Facing his demons in his first year of sobriety, Matthew Scudder finds himself on the trail of a killer. When Scudder\u0027s childhood friend Jack Ellery is murdered, presumably while attempting to atone for past sins, Scudder reluctantly begins his own investigation, with just one lead: Ellery\u0027s Alcoholics Anonymous list of people he wronged. One of them may be a killer, but that\u0027s not necessarily Scudder\u0027s greatest danger. Immersing himself in Ellery\u0027s world may lead him right back to the bar stool. In a novel widely celebrated by critics and readers, Lawrence Block circle back to how it all began, reestablishing the Matthew Scudder series as one of the pinnacles of American detective fiction.","cover":"https://allnovel.net/images/a-drop-of-the-hard-stuff-matthew-scudder-17.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/a-drop-of-the-hard-stuff-matthew-scudder-17.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:55:54 AM"}}
