{"id":65068,"no":30,"title":"Page 30","content":"“Good, because that’s not what she wants either. Donna’s got a good job, makes decent money. She works downtown somewhere, doesn’t she?”\n “She’s at an investment bank. I don’t know exactly what she does there.”\n “Whatever it is, it pays well. And the next man she hooks up with, and it’s not going to be anytime soon, won’t be a guy like Vinnie, a knockaround guy from South Brooklyn who stays sober between drunks. And you know who else he won’t be?”\n “An unlicensed private eye living in a hotel room.”\n “There you go. You had a good time, and you didn’t have to spend Saturday night alone.”\n “Right.”\n “And you came out of it two hundred dollars to the good. What’s the matter?”\n “Is that what the money was for?”\n “No, of course not. The money was so that she wasn’t sleeping with you to pay you back for helping her out. Merry Christmas, kiddo.”\n “Huh?”\n “You don’t know the joke? Mailman brings the mail to this one house and the wife invites him in, gives him a fresh-baked brownie and a cup of coffee. Next thing he knows she’s taking him upstairs to the bedroom. Afterward she hands him a dollar.\n “And he says, ‘Hey, what’s this?’ And he tries to hand it back, but she won’t take it. ‘It’s for you,’ she says. ‘It was my husband’s idea.’ ‘Your husband’s idea?’ ‘Yeah,’ she says. ‘I asked him what should we do for the mailman for Christmas, and he said, Fuck him, give him a dollar. The brownie and coffee were my idea.’ ”\n We went to the meeting at St. Clare’s, and afterward I walked him back to his place. On my way home I remembered that I’d walked right past the desk earlier without seeing if any of my callers had left messages. This time I checked, and there was nothing. I went upstairs, picked up the phone, put it down without dialing anybody’s number, and went to bed.\n XXIX\n MONDAY MORNING I called Greg Stillman first thing after breakfast. There was no answer, so I left a message on his machine. I knew better than to call Donna, and I wasn’t ready to call Jan. I found the number for Dennis Redmond, and someone else at the precinct answered his phone. I left my name and number.\n Redmond and I played phone tag for a day and a half. I was never in my room when he called, and he was never at his desk when I called him back. I went to Fireside for the Monday noon meeting, and to St. Paul’s that night. I thought I might run into Donna, but wasn’t surprised when I didn’t.\n Jim wasn’t there either, but I found some other people to have coffee with, and it was past eleven when I got home from the Flame. No messages, but Jacob informed me that I’d had a call. “But he didn’t leave no name,” he said, “nor no number neither.”\n Nohow, I thought.\n I was surprised Greg hadn’t returned my call, and decided it wasn’t too late to call him. I got the machine again, so either he was out wolfing down strawberry-rhubarb pie or he’d turned in for the night. I hung up without leaving another message and went to bed.\n Tuesday afternoon my phone finally rang when I was there to answer it. It was Jan, just calling to say hello. We had a curiously hollow conversation, where what didn’t get said was more significant than what did. Neither of us said anything about the past Saturday night, or about the coming one. I didn’t say any of the several things I had on my mind, and I don’t think she did either.\n So it wasn’t much of a phone call, but it broke the logjam, because after I got off the phone with her I called Redmond, and this time he was there to answer.\n “Sorry,” he said. “I’ve been meaning to get back to you. I did call a couple of times.”\n “I’ve been hard to reach myself,” I said. “I was just wondering if it was you who picked up Jack Ellery’s possessions.”\n He didn’t know what I was talking about. I explained that someone had collected Ellery’s belongings from the super, and thought it might be him.\n “Jesus,” he said. “Why would I do that?”\n “That’s what I was wondering.”\n “The super said it was me?”\n “I never talked to him,” I said. “Gregory Stillman went over there, and he got the impression some police officer had picked up the stuff.”\n “What stuff? The long-lost loot from the Brinks Job?”\n “Well, I don’t know,” I said. “Stillman thought there might be some notebooks, some AA keepsakes.”\n “You ever been to his room?”\n “Ellery’s? No.”\n “Well, I was, because it was where he was killed. Outside of a razor and a toothbrush and a clock radio, he didn’t own a whole hell of a lot. Some old clothes, an extra pair of shoes. Maybe half a dozen books. Some of them were AA books. Is that what you were looking for?”\n “I wasn’t looking for anything. Stillman—”\n “Right, Stillman. There was a brass coin about the size of a half-dollar. Maybe a little larger. Had what I guess is the AA symbol on it. Two As in a circle or a triangle, I forget which.”\n “Both.”\n “Huh?”\n “Two As in a triangle, with the triangle enclosed in a circle.”\n “I’m glad you cleared that up for me. Whatever it was, it’d be hard to buy a drink with it.”\n Some groups give them out for members’ anniversaries. There’s a Roman numeral on one side, for however many years you’re celebrating. I didn’t feel Redmond needed to be burdened with this information.\n “Anyway,” he said, “the poor sonofabitch didn’t have much, and I didn’t need to see any of it a second time. So whoever picked up his things, it wasn’t me. Hang on a second.”\n I waited, and he returned to report that nobody else knew anything about Ellery’s leavings. I said maybe the super had kept them and made up a story. More likely he threw everything out, Redmond said, because there was nothing there to keep. He tossed it, and to avoid getting bawled out he blamed it on the cops.\n “Which we ought to be used to,” he said. “You know, I was hoping you had something better than a question.”\n “Like what?”\n “I figured maybe your conscience was troubling you and you wanted to tell me how you shot your old childhood pal.”\n “Why would I do that?”\n “I just said. Because your conscience—”\n “Why would I shoot him?”\n “How do I know? You’re the one with the guilty conscience. Maybe he stole a baseball card from you a hundred years ago in the Bronx, and you just realized it was the one that’s worth a fortune. I forget who’s on it.”\n “I can’t help you there.”\n “Honus Wagner. So who needs your help? You didn’t do it, huh?”\n “I’m afraid not.”\n “Just my luck. Hey, you’re not fucking around with the case, are you? Playing detective?”\n “No.”\n “You want to say that a little more convincingly? Never mind. I’d caution you about getting in our way, but the caseload we’ve got, your pal Ellery’s not getting a lot of our time. You run across anything, you know where to bring it.”\n That was Tuesday. Thursday morning I was reading the paper while I had my breakfast. There was a back-page item I barely registered, a man killed on the street near Gramercy Park, apparently during a mugging. I was several pages past the story when something clicked, and I went back and looked at the victim’s name, and right away I knew which Mark it was who’d been trying to call me.\n XXX\n MARK SATTENSTEIN,” Joe Durkin said. “Killed shortly after midnight within three blocks of his home, death the result of multiple blows to the head. Went out for a couple of drinks at a bar with an Irish name, if you can believe such a place exists. They know him there, not a regular, not a heavy drinker, but he’ll come in now and then for a beer. Well, not anymore, he won’t. Not the first mugging in that neighborhood, not even the first this month, and it’s still early in the month. Wallet gone, watch gone, pockets turned inside out—what’s it sound like to you, Matt?”\n “Robbery with violence.”\n “It does sound like robbery, and there’s no question about the violence. Which leaves me with two questions. How’s this anything other than what it looks like? And, while I’m at it, what’s it to you?”\n “I knew him.”\n “Yeah? Old friend?”\n No, I thought. That was the other dead guy. I said, “I only met him once. I was looking into a matter for a friend, and I had some questions for Sattenstein. I went to his apartment, talked with him for an hour tops.”\n “Learn anything?”\n “Enough to rule him out.”\n “Out of what?”\n “Out of the picture,” I said. “I don’t want to go into detail here, but he was one direction I could go, and after I talked to him I realized that would be a dead end.”\n He looked at me, thought about it. “And this was recent?”\n “Within the past couple of weeks.” \n","sourceLink":"https://allnovel.net/a-drop-of-the-hard-stuff-matthew-scudder-17/page-30.html","bookId":2335,"book":{"id":2335,"title":"A Drop of the Hard Stuff (Matthew Scudder #17)","description":"Storyline: \n A Drop of the Hard Stuff (Matthew Scudder #17) \n \"Right up there with Mr. Block\u0027s best....A DROP OF THE HARD STUFF keeps us guessing.\"--Tom Nolan, Wall Street Journal \n Facing his demons in his first year of sobriety, Matthew Scudder finds himself on the trail of a killer. When Scudder\u0027s childhood friend Jack Ellery is murdered, presumably while attempting to atone for past sins, Scudder reluctantly begins his own investigation, with just one lead: Ellery\u0027s Alcoholics Anonymous list of people he wronged. One of them may be a killer, but that\u0027s not necessarily Scudder\u0027s greatest danger. Immersing himself in Ellery\u0027s world may lead him right back to the bar stool. \n In a novel widely celebrated by critics and readers, Lawrence Block circle back to how it all began, reestablishing the Matthew Scudder series as one of the pinnacles of American detective fiction.\n \n","cover":"https://allnovel.net/images/a-drop-of-the-hard-stuff-matthew-scudder-17.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/a-drop-of-the-hard-stuff-matthew-scudder-17.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:55:54 AM"}}
