{"id":65078,"no":40,"title":"Page 40","content":"“It’s already got the power.” “I guess.” “The way you give it more power,” he said, “is by picking it up and drinking it. And the first step in picking it up and drinking it is picking it up at all.” “So I left it there.” “And locked the door on it. What time is it? Shit.” “What’s the matter?” “This isn’t something for you to do all by yourself,” he said. “I’d go with you after the meeting, assuming I can wrap this up in time to go to the meeting, but I don’t like the idea of letting it sit there for the next few hours. Or letting you sit somewhere between now and meeting time, locked out of your room and with no place to go. I’d come over now, but—” “No, you’ve got work to do.” “It would be really inconvenient to leave now. You’ve got phone numbers, right? People in the program, people who live nearby?” “Sure.” “And you’ve got quarters.” “And subway tokens,” I said, “though I can’t see how one of those will come in handy right now.” “You never know. You’re where? Down the block from your hotel?” “Five blocks away. It took me that long to find a working phone without somebody already using it.” “Make some calls. Get somebody to keep you company, and call me as soon as you pour out the booze. Will you do that?” “Sure.” “Call me from your room. And if you can’t find somebody, don’t go back to your room alone.” “I won’t.” “Call me instead. And we’ll figure out something. Matt?” “What?” “Didn’t I tell you? Sometimes things get a little crazy right before a person’s anniversary.” There were a couple of phone numbers I didn’t have to look up. Two of them were Jim’s, of course, at home and at his place of business, and another was Jan’s. I’d already spoken to Jim and I wasn’t about to call Jan. I’d have called her if I had to. When I was just starting to string sober days together, before we’d begun to become a couple, she’d made me promise to call her before I picked up a drink. In the world we shared, sobriety trumped everything, so even if we had ceased keeping company, either of us could call the other in order to stay sober. But not now. There were plenty of other people I could call, and they were a lot closer than Lispenard Street. I was limited, though, to the ones whose numbers were in my wallet. Now and then someone will hand me a card, or a slip of paper, and I’ll find room for it in my wallet until I get a chance to copy it into my book. I have a little memo book, itself about the size of a business card, that I use for AA phone numbers, and that’s where they wind up. I keep the book in my room, next to the phone, so that it’s handy if I want to call someone. I almost never do, the only AA calls I make with any frequency are to Jim, but it’s good to have the book, if only because I can periodically copy down new phone numbers and clear out my wallet. The point of this is that I now needed to call someone, and I had plenty of phone numbers, but they were all in the book. If I wanted to have someone with me when I returned to my room, I was largely limited to whatever numbers were still in my wallet. There were a few of those, and the first one I came to was Motorcycle Mark. I caught him on his way out the door, and he said that was no problem, he didn’t have anything to do that wouldn’t keep. Where should he meet me? I said I’d meet him at my hotel, and by the time I’d walked the four or five blocks he was already there, with his bike parked out front. On our way through the lobby he said he’d noticed the hotel hundreds of times, and often wondered what it was like inside. It seemed all right, he said, and I agreed that it wasn’t bad. The door to my room was locked, as I’d left it, and as I was fitting the key in the lock I had this sudden image of finding the room not as I remembered it but as I’d left it that morning, with no bottle and no glass and no smell of whiskey. And Mark, in his boots and leather jacket and with his helmet under his arm, would nod his head knowingly and talk gently to me in that tone you use with ambulatory psychotics. Calming me down, talking me off the ledge. The image was so vivid it made me reluctant to open the door. But I did, of course, and it was all still there, the uncapped bottle of Maker’s Mark, the glass filled almost to the brim, the chair positioned to welcome me, and the raw smell of bourbon suffusing the room. “Fucking Jesus,” Mark said. “That’s what I walked in on.” “Man, the smell! It’s like a fucking distillery. That’s not from one drink sitting in a glass.” “It’s strong, isn’t it?” He moved past me, walked over to the bed. “Come here, Matt. Look.” That was what made the smell so strong. My pillow and mattress were soaked. My visitor had upended a bottle of bourbon over my bed. I turned from it, went to the desk. The open bottle had no more than a couple of ounces missing, less than the glass contained. So he’d come to my room with a glass and two bottles, poured a drink, emptied a bottle on my bed, and left me plenty of bourbon to get good and drunk on. “Unbelievable, man. Who could pull some shit like this?” “Steve,” I said. “You know the guy?” “Just his name.” He shook his head, and we both stood there for a moment, taking it all in. Then he said, “First things first, Matt. The bottle and the glass.” “Right.” “You want me to—” “No, let me do it,” I said, and picked up the glass and carried it into the bathroom. I held the thing at arm’s length, as if it were a snake that might whip its head around and bite me, and I upended it over the sink and ran water to wash its contents down the drain. I held the glass under the tap and rinsed it out, and then I dropped it in the wastebasket. It was a perfectly good drinking glass, and perfectly safe now that I’d rinsed the residue of bourbon out of it, but what did I need with it? I went back for the bottle, and emptied it into the sink, and let the tap water speed its passage through the plumbing. I rinsed out the bottle, too, and Mark handed me the cap, and I held that under the running water before I screwed it back onto the bottle. Then I put the thing in the wastebasket, with the glass. “That’s better,” he said. “Be hard to drink it now. You’d have to go down into the sewer after it, and the alligators’d beat you to it.” “A load off my mind,” I said. “Next we got to do something about that bed. No way you can sleep on it.” “No.” “There a porter or somebody who can get it out of here?” “Not at this hour.” We stood there thinking about it. Then Mark said, “You know, that mattress is done. You can’t fix a mattress like that. It’ll stink of alcohol forever.” “I know.” “The pillow too. Total loss.” “Right.” He walked over to the window, opened it as wide as it would open. “Good it’s a single bed,” he said. “Never work with a double.” “You think?” “What else, man?” I let him take charge. He was a good fifteen years younger than I, and I’d been sober a little longer, but he seemed to know what to do and that was more than I could say for myself. We stripped off the bed linen, and Mark had me help him lug the bare mattress over to the window. When we had it balanced half in and half out, he sent me downstairs to make sure no one was underneath the thing when he shoved it out. I walked past Jacob and out onto the pavement. I looked up, and there was my mattress, hanging out of my window. An older man wearing a suit and a tie had just emerged from McGovern’s, and I waited while he walked toward me with the careful gait of a man who’s drunk and knows it. He looked up to see what was holding my attention, decided it was nothing he had to be concerned about, and walked on by. The sidewalk was clear now, and I called out to Mark, and my mattress came sailing down at me and landed at my feet. I got hold of it, dragged it over to the curb. I went inside and asked Jacob which rooms were vacant. There was a single on my floor, at the rear of the building. He gave me the key. The room had been serviced since the last guest had departed. It was a little smaller than mine, but had the same iron bedstead, and the same size mattress. Mark and I took the mattress, linen and all, and carried it the length of the hall to my room, and placed it on my empty frame. “Like it’s been there forever,” Mark said. “Just one thing missing.” I fetched the pillow from the vacant room, and set it on my bed. We took my pillow and my sheets, balled them up, and put them in the service pantry. There was a big trash can there, and it got the contents of my wastebasket, the empty bottle and the glass. I locked the vacant room, and we stopped downstairs at the desk to return the key. “It’s a funny thing,” I told Jacob, “but there’s no mattress on the bed in that room.” “There ain’t?” “No,” I said, “but I’m sure the porter can rustle up a spare from the storeroom first thing in the morning.” A couple of bills moved from my hand to his. “For his trouble,” I said. “And for yours.”","sourceLink":"https://allnovel.net/a-drop-of-the-hard-stuff-matthew-scudder-17/page-40.html","bookId":2335,"book":{"id":2335,"title":"A Drop of the Hard Stuff (Matthew Scudder #17)","description":"Storyline: A Drop of the Hard Stuff (Matthew Scudder #17) \"Right up there with Mr. Block\u0027s best....A DROP OF THE HARD STUFF keeps us guessing.\"--Tom Nolan, Wall Street Journal Facing his demons in his first year of sobriety, Matthew Scudder finds himself on the trail of a killer. When Scudder\u0027s childhood friend Jack Ellery is murdered, presumably while attempting to atone for past sins, Scudder reluctantly begins his own investigation, with just one lead: Ellery\u0027s Alcoholics Anonymous list of people he wronged. One of them may be a killer, but that\u0027s not necessarily Scudder\u0027s greatest danger. Immersing himself in Ellery\u0027s world may lead him right back to the bar stool. In a novel widely celebrated by critics and readers, Lawrence Block circle back to how it all began, reestablishing the Matthew Scudder series as one of the pinnacles of American detective fiction.","cover":"https://allnovel.net/images/a-drop-of-the-hard-stuff-matthew-scudder-17.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/a-drop-of-the-hard-stuff-matthew-scudder-17.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:55:54 AM"}}
