{"id":67837,"no":32,"title":"Page 32","content":"In the months that followed, Senator Adam Warner was becoming a household word. His background, ability and charisma had made him a presence in the Senate from the beginning. He won a place on several important committees and he sponsored a piece of major labor legislation that passed quickly and easily. Adam Warner had powerful friends in Congress. Many had known and respected his father. The consensus was that Adam was going to be a presidential contender one day. Jennifer felt a bittersweet pride. Jennifer received constant invitations from clients, associates and friends to dinner and the theater and various charity affairs, but she refused almost all of them. From time to time she would spend an evening with Ken. She enjoyed his company immensely. He was funny and self-deprecating, but beneath the facade of lightness, Jennifer knew, there was a sensitive, tormented man. He would sometimes come to the house for lunch or dinner on weekends, and he would play with Joshua for hours. They loved each other. Once, when Joshua had been put to bed and Jennifer and Ken were having dinner in the kitchen, Ken kept staring at Jennifer until she asked, \"Is anything wrong?\" \"Christ, yes,\" Ken groaned. \"I\u0027m sorry. What a bitch of a world this is.\" And he would say nothing further. Adam had not tried to get in touch with Jennifer in almost nine months now, but she avidly read every newspaper and magazine article about him, and watched him whenever he appeared on television. She thought about him constantly. How could she not? Her son was a living reminder of Adam\u0027s presence. Joshua was two years old now and incredibly like his father. He had the same serious blue eyes and the identical mannerisms. Joshua was a tiny, dear replica, warm and loving and full of eager questions. To Jennifer\u0027s surprise, Joshua\u0027s first words had been car-car, when she took him for a drive one day. He was speaking in sentences now and he said please and thank you. Once, when Jennifer was trying to feed him in his high chair, he said impatiently, \"Mama, go play with your toys.\" Ken had bought Joshua a paint set, and Joshua industriously set about painting the walls of the living room. When Mrs. Mackey wanted to spank him, Jennifer said, \"Don\u0027t. It will wash off. Joshua\u0027s just expressing himself.\" \"That\u0027s all I wanted to do,\" Mrs. Mackey sniffed. \"Express myself. You\u0027ll spoil that boy rotten.\" But Joshua was not spoiled. He was mischievous and demanding, but that was normal for a two-year-old. He was afraid of the vacuum cleaner, wild animals, trains and the dark. Joshua was a natural athlete. Once, watching him at play with some of his friends, Jennifer turned to Mrs. Mackey and said, \"Even though I\u0027m Joshua\u0027s mother, I\u0027m able to look at him objectively, Mrs. Mackey. I think he may be the Second Coming.\" Jennifer had made it a policy to avoid any cases that would take her out of town and away from Joshua, but one morning she received an urgent call from Peter Fenton, a client who owned a large manufacturing firm. \"I\u0027m buying a factory in Las Vegas and I\u0027d like you to fly down there and meet with their lawyers.\" \"Let me send Dan Martin,\" Jennifer suggested. \"You know I don\u0027t like to go out of town, Peter.\" \"Jennifer, you can wrap the whole thing up in twenty-four hours. I\u0027ll fly you down in the company plane and you\u0027ll be back the next day.\" Jennifer hesitated. \"All right.\" She had been to Las Vegas and was indifferent to it. It was impossible to hate Las Vegas or to like it. One had to look upon it as a phenomenon, an alien civilization with its own language, laws and morals. It was like no other city in the world. Huge neon lights blazed all night long, pro-claiming the glories of the magnificent palaces that had been built to deplete the purses of tourists who flocked in like lemmings and lined up to have their carefully hoarded savings taken away from them. Jennifer gave Mrs. Mackey a long and detailed list of instructions about taking care of Joshua. \"How long are you going to be away, Mrs. Parker?\" \"I\u0027ll be back tomorrow.\" \"Mothers!\" Peter Fenton\u0027s Lear jet picked Jennifer up early the next morning and flew her to Las Vegas. Jennifer spent the afternoon and evening working out the details of the contract. When they finished, Peter Fenton asked Jennifer to have dinner with him. \"Thank you, Peter, but I think I\u0027ll stay in my room and get to bed early. I\u0027m returning to New York in the morning.\" Jennifer had talked to Mrs. Mackey three times during the day and had been reassured each time that little Joshua was fine. He had eaten his meals, he had no fever and he seemed happy. \"Does he miss me?\" Jennifer asked. \"He didn\u0027t say,\" Mrs. Mackey sighed. Jennifer knew that Mrs. Mackey thought she was a fool, but Jennifer did not care. \"Tell him I\u0027ll be home tomorrow.\" \"I\u0027ll give him the message, Mrs. Parker.\" Jennifer had intended to have a quiet dinner in her suite, but for some reason, the rooms suddenly became oppressive, the walls seemed to be closing in on her. She could not stop thinking about Adam. How could he have made love to Mary Beth and made her pregnant when... The game Jennifer always played, that her Adam was just away on a business trip and would soon return to her, did not work this time. Jennifer\u0027s mind kept returning to a picture of Mary Beth in her lace negligee and Adam... She had to get out, to be somewhere where there were noisy crowds of people. Perhaps, Jennifer thought, I might even see a show. She quickly showered, dressed and went downstairs. Marty Allen was starring in the main show room. There was a long line at the entrance to the room for the late show, and Jennifer regretted that she had not asked Peter Fenton to make a reservation for her. She went up to the captain at the head of the line and said, \"How long a wait will there be for a table?\" \"How many in your party?\" \"I\u0027m alone.\" \"I\u0027m sorry, miss, but I\u0027m afraid - \" A voice beside her said, \"My booth, Abe.\" The captain beamed and said, \"Certainly, Mr. Moretti. This way, please.\" Jennifer turned and found herself looking into the deep black eyes of Michael Moretti. \"No, thank you,\" Jennifer said. \"I\u0027m afraid I - \" \"You have to eat.\" Michael Moretti took Jennifer\u0027s arm and she found herself walking beside him, following the captain to a choice banquette in the center of the large room. Jennifer loathed the idea of dining with Michael Moretti, but she did not know how to get out of it now without creating a scene. She wished fervently that she had agreed to have dinner with Peter Fenton. They were seated at a banquette facing the stage and the captain said, \"Enjoy your dinner, Mr. Moretti, miss.\" Jennifer could feel Michael Moretti\u0027s eyes on her and it made her uncomfortable. He sat there, saying nothing. Michael Moretti was a man of deep silences, a man who distrusted words, as though they were a trap rather than a form of communication. There was something riveting about his silence. Michael Moretti used silence the way other men used speech. When he finally spoke, Jennifer was caught off guard. \"I hate dogs,\" Michael Moretti said. \"They die.\" And it was as though he was revealing a private part of himself that came from some deep wellspring. Jennifer did not know what to reply. Their drinks arrived and they sat there drinking quietly, and Jennifer listened to the conversation they were not having. She thought about what he had said: I hate dogs. They die. She wondered what Michael Moretti\u0027s early life had been like. She found herself studying him. He was attractive in a dangerous, exciting way. There was a feeling of violence about him, ready to explode. Jennifer could not say why, but being with this man made her feel like a woman. Perhaps it was the way his ebony black eyes looked at her, then looked away from her, as though fearful of revealing too much. Jennifer realized it had been a long time since she had thought of herself as a woman. From the day she had lost Adam. It takes a man to make a woman feel female, Jennifer thought, to make her feel beautiful, to make her feel wanted. Jennifer was grateful he could not read her mind. Various people approached their booth to pay their respects to Michael Moretti: business executives, actors, a judge, a United States senator. It was power paying tribute to power, and Jennifer began to feel a sense of how much influence he wielded. \"I\u0027ll order for us,\" Michael Moretti said. \"They prepare this menu for eight hundred people. It\u0027s like eating on an airline.\" He raised his hand and the captain was at his side instantly. \"Yes, Mr. Moretti. What would you like tonight, sir?\" \"We\u0027ll have a Chateaubriand, pink and charred.\" \"Of course, Mr. Moretti.\" \"Pommes soufflees and an endive salad.\" \"Certainly, Mr. Moretti.\" \"We\u0027ll order dessert later.\" A bottle of champagne was sent to the table, compliments of the management. Jennifer found herself beginning to relax, enjoying herself almost against her will. It had been a long while since she had spent an evening with an attractive man. And even as the phrase came into Jennifer\u0027s mind, she thought, How can I think of Michael Moretti as attractive? He\u0027s a killer, an amoral animal with no feelings. Jennifer had known and defended dozens of men who had committed terrible crimes, but she had the feeling that none of them was as dangerous as this man. He had risen to the top of the Syndicate and it had taken more than a marriage to Antonio Granelli\u0027s daughter to accomplish that. \"I telephoned you once or twice while you were away,\" Michael said. According to Ken Bailey, he had called almost every day. \"Where were you?\" He made the question sound casual. \"Away.\" A long silence. \"Remember that offer I made you?\" Jennifer took a sip of her champagne. \"Don\u0027t start that again, please.\" \"You can have any - \" \"I told you, I\u0027m not interested. There\u0027s no such thing as an offer you can\u0027t refuse. That\u0027s only in books, Mr. Moretti. I\u0027m refusing.\" Michael Moretti thought of the scene that had taken place in his father-in-law\u0027s home a few weeks earlier. There had been a meeting of the Family and it had not gone well. Thomas Colfax had argued against everything that Michael had proposed. When Colfax had left, Michael had said to his father-in-law, \"Colfax is turning into an old woman. I think it\u0027s time to put him out to pasture, Papa.\" \"Tommy\u0027s a good man. He\u0027s saved us a lot of trouble over the years.\" \"That\u0027s history. He doesn\u0027t have it anymore.\" \"Who would we get to take his place?\" \"Jennifer Parker.\" Antonio Granelli had shaken his head. \"I told you, Michael. It ain\u0027t good to have a woman know our business.\" \"This isn\u0027t just a woman. She\u0027s the best lawyer around.\" \"We\u0027ll see,\" Antonio Granelli had said. \"We\u0027ll see.\" Michael Moretti was a man who was used to getting what he wanted, and the more Jennifer stood up to him, the more he was determined to have her. Now, sitting next to her, Michael looked at Jennifer and thought, One day you\u0027re going to belong to me, baby - all the way. \"What are you thinking about?\" Michael Moretti gave Jennifer a slow, easy smile, and she instantly regretted the question. It was time to leave. \"Thank you for a wonderful dinner, Mr. Moretti. I have to get up early, so - \" The lights began to dim and the orchestra started an overture. \"You can\u0027t leave now. The show is starting. You\u0027ll love Marty Allen.\" It was the kind of entertainment that only Las Vegas could afford to put on, and Jennifer thoroughly enjoyed it. She told herself she would leave immediately after the show, but when it was over and Michael Moretti asked Jennifer to dance, she decided it would be ungracious to refuse. Besides, she had to admit to herself that she was having a good time. Michael Moretti was a skillful dancer, and Jennifer found herself relaxing in his arms. Once, when another couple collided with them, Michael was pushed against Jennifer and for an instant she felt his male hardness, and then he immediately pulled away, careful to hold her at a discreet distance. Afterward, they walked into the casino, a vast terrain of bright lights and noise, packed with gamblers engrossed in various games of chance, playing as though their lives depended on their winning. Michael took Jennifer to one of the dice tables and handed her a dozen chips. \"For luck,\" he said. The pit boss and dealers treated Michael with deference, calling him Mr. M. and giving him large piles of hundred-dollar chips, taking his markers instead of cash. Michael played for large stakes and lost heavily, but he seemed unperturbed. Using Michael\u0027s chips, Jennifer won three hundred dollars, which she insisted on giving to Michael. She had no intention of being under any obligation to him. From time to time during the course of the evening, various women came up to greet Michael. All of them were young and attractive, Jennifer noticed. Michael was polite to them, but it was obvious that he was only interested in Jennifer. In spite of herself, she could not help feeling flattered. Jennifer had been tired and depressed at the beginning of the evening, but there was such a vitality about Michael Moretti that it seemed to spill over, charging the air, enveloping Jennifer. Michael took her to a small bar where a jazz group was playing, and afterward they went on to the lounge of another hotel to hear a new singing group. Everywhere they went Michael was treated like royalty. Everyone tried to get his attention, to say hello to him, to touch him, to let him know they were there. During the time they were together, Michael did not say one word at which Jennifer could take offense. And yet, Jennifer felt such a strong sexuality coming from him that it was like a series of waves beating at her. Her body felt bruised, violated. She had never experienced anything like it. It was a disquieting feeling and, at the same time, exhilarating. There was a wild, animal vitality about him that Jennifer had never encountered before. It was four o\u0027clock in the morning when Michael finally walked Jennifer back to her suite. When they reached Jennifer\u0027s door, Michael took her hand and said, \"Good night. I just want you to know this has been the greatest night of my life.\" His words frightened Jennifer.","sourceLink":"https://allnovel.net/rage-of-angels/page-32.html","bookId":2357,"book":{"id":2357,"title":"Rage of Angels","description":"Storyline: A worldwide bestseller first published in 1980, this novel tells the story of Jennifer Parker, a successful lawyer who is loved by two men, one a politician, the other, a mafia don. Other work by the author includes The Other Side of Midnight and If Tomorrow Comes.","cover":"https://allnovel.net/images/rage-of-angels.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/rage-of-angels.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:05:13 AM"}}
