{"id":67852,"no":47,"title":"Page 47","content":"It was their last day in Acapulco, a perfect morning with warm, soft breezes playing melodies through the palm trees. The beach at La Concha was crowded with tourists greedily soaking up the sun before returning to the routine of their everyday lives.\n Joshua came running up to the breakfast table wearing a bathing suit, his athletic little body fit and tan. Mrs. Mackey lumbered along behind him.\n Joshua said, \"I\u0027ve had plenty of sufficient time to digest my food, Mom. Can I go water skiing now?\"\n \"Joshua, you just finished eating.\"\n \"I have a very high metabolism rate,\" he explained earnestly. \"I digest food fast.\"\n Jennifer laughed. \"All right. Have a good time.\"\n \"I will. Watch me, huh?\"\n Jennifer watched as Joshua raced along the pier to a waiting speedboat. She saw him engage the driver in earnest conversation, and then they both turned to look at Jennifer. She signaled an okay, and the driver nodded and Joshua began to put on water skis.\n The motor boat roared into life and Jennifer looked up to see Joshua beginning to rise on his water skis.\n Mrs. Mackey said proudly, \"He\u0027s a natural athlete, isn\u0027t he?\"\n At that moment, Joshua turned to wave at Jennifer and lost his balance, falling against the pilings. Jennifer leaped to her feet and began racing toward the pier. An instant later, she saw Joshua\u0027s head appear above the surface of the water and he looked at her, grinning.\n Jennifer stood there, her heart beating fast, and watched as Joshua put the water skis back on. As the boat circled and began to move forward again, it gained enough momentum to pull Joshua to his feet. He turned once to wave at Jennifer and then was racing away on top of the waves. She stood there watching, her heart still pounding from fright. If anything happened to him...She wondered whether other mothers loved their children as much as she loved her son, but it did not seem possible. She would have died for Joshua, killed for him. I have killed for him, she thought, with the hand of Michael Moretti.\n Mrs. Mackey was saying, \"That could have been a nasty fall.\"\n \"Thank God it wasn\u0027t.\"\n Joshua was out on the water for an hour. When the boat pulled back into the slip, he let go of the tow rope and gracefully skied up onto the sand.\n He ran over to Jennifer, filled with excitement. \"You should have seen the accident, Mom. It was incredible! A big sailboat tipped over and we stopped and saved their lives.\"\n \"That\u0027s wonderful, son. How many lives did you save?\"\n \"There were six of them.\"\n \"And you pulled them out of the water?\"\n Joshua hesitated. \"Well, we didn\u0027t exactly pull them out of the water. They were kinda sittin\u0027 on the side of their boat. But they probably would have starved to death if we hadn\u0027t come along.\"\n Jennifer bit her lip to keep from smiling. \"I see. They were very lucky you came along, weren\u0027t they?\"\n \"I\u0027ll say.\"\n \"Did you hurt yourself when you fell, darling?\"\n \"Course not.\" He felt the back of his head. \"I got a little bump.\"\n \"Let me feel it.\"\n \"What for? You know what a bump feels like.\"\n Jennifer reached down and gently ran her hand along the back of Joshua\u0027s head.\n Her fingers found a large lump. \"It\u0027s as big as an egg, Joshua.\"\n \"It\u0027s nothing.\"\n Jennifer rose to her feet. \"I think we\u0027d better get started back to the hotel.\"\n \"Can\u0027t we stay a little while longer?\"\n \"I\u0027m afraid not. We have to pack. You don\u0027t want to miss your ball game Saturday, do you?\"\n He sighed. \"No. Old Terry Waters is just waitin\u0027 to take my place.\"\n \"No chance. He pitches like a girl.\"\n Joshua nodded smugly. \"He does, doesn\u0027t he?\"\n When they returned to Las Brisas, Jennifer telephoned the manager and asked him to send a doctor to the room. The doctor arrived thirty minutes later, a portly, middle-aged Mexican dressed in an old-fashioned white suit. Jennifer admitted him into the bungalow.\n \"How may I serve you?\" Dr. Raul Mendoza asked.\n \"My son had a fall this morning. He has a nasty bump on his head. I want to make sure he\u0027s all right.\"\n Jennifer led him into Joshua\u0027s bedroom, where he was packing a suitcase.\n \"Joshua, this is Doctor Mendoza.\"\n Joshua looked up and asked, \"Is somebody sick?\"\n \"No. No one\u0027s sick, my lad. I just wanted the doctor to take a look at your head.\"\n \"Oh, for Pete\u0027s sake, Mom! What\u0027s the matter with my head?\"\n \"Nothing. I would just feel better if Doctor Mendoza checked it over. Humor me, will you?\"\n \"Women!\" Joshua said. He looked at the doctor suspiciously. \"You\u0027re not going to stick any needles in me or anything, are you?\"\n \"No, senor, I am a very painless doctor.\"\n \"That\u0027s the kind I like.\"\n \"Please sit down.\"\n Joshua sat on the edge of the bed and Dr. Mendoza ran his fingers over the back of Joshua\u0027s head. Joshua winced with pain but he did not cry out. The doctor opened his medical bag and took out an ophthalmoscope. \"Open your eyes wide, please.\"\n Joshua obeyed. Dr. Mendoza stared through the instrument.\n \"You see any naked dancin\u0027 girls in there?\"\n \"Joshua!\"\n \"I was just askin\u0027.\"\n Dr. Mendoza examined Joshua\u0027s other eye. \"You are fit as a fiddle. That is the American slang expression, no?\" He rose to his feet and closed his medical bag. \"I would put some ice on that,\" he told Jennifer. \"Tomorrow the boy will be fine.\"\n It was as though a heavy load had been lifted from Jennifer\u0027s heart. \"Thank you,\" she said.\n \"I will arrange the bill with the hotel cashier, senora. Good-bye, young man.\"\n \"Good-bye, Doctor Mendoza.\"\n When the doctor had gone, Joshua turned to his mother. \"You sure like to throw your money away, Mom.\"\n \"I know. I like to waste it on things like food, your health - \"\n \"I\u0027m the healthiest man on the whole team.\"\n \"Stay that way.\"\n He grinned. \"I promise.\"\n They boarded the six o\u0027clock plane to New York and were back in Sands Point late that night. Joshua slept all the way home. \n","sourceLink":"https://allnovel.net/rage-of-angels/page-47.html","bookId":2357,"book":{"id":2357,"title":"Rage of Angels","description":"Storyline: \n A worldwide bestseller first published in 1980, this novel tells the story of Jennifer Parker, a successful lawyer who is loved by two men, one a politician, the other, a mafia don. Other work by the author includes The Other Side of Midnight and If Tomorrow Comes.\n \n","cover":"https://allnovel.net/images/rage-of-angels.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/rage-of-angels.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:05:13 AM"}}
