{"id":67862,"no":57,"title":"Page 57","content":"When Michael Moretti left his father-in-law\u0027s grave, he was already late for an appointment. He decided to call the office and reschedule it. He stopped at a telephone booth along the highway and dialed the number. The phone rang once and a voice answered, \"Acme Builders.\"\n Michael said, \"This is Mike. Tell - \"\n \"Mr. Moretti isn\u0027t here. Call back later.\"\n Michael felt his body tightening. All he said was \"Tony\u0027s Place.\"\n He hung up and hurried back to the car. Rosa looked at his face and asked, \"Is everything all right, Michael?\"\n \"I don\u0027t know. I\u0027m going to drop you off at your cousin\u0027s. Stay there until you hear from me.\n Tony followed Michael into the office in the rear of the restaurant.\n \"I got word that the Feds are crawlin\u0027 all over your house and the downtown office, Mike.\"\n \"Thanks,\" Michael said. \"I don\u0027t want to be disturbed.\"\n \"You won\u0027t be.\"\n Michael waited until Tony walked out of the room and closed the door behind him. Then Michael picked up the telephone and furiously began to dial.\n It took Michael Moretti less than twenty minutes to learn that a major disaster was taking place. As the reports of the raids and arrests began to filter in, Michael received them with mounting disbelief. All his soldiers and lieutenants were being picked up. Drops were being raided; gambling operations were being seized; confidential ledgers and records were being impounded. What was happening was a nightmare. The police had to be obtaining information from someone in his Organization.\n Michael placed telephone calls to other Families around the country, and all of them demanded to know what was going on. They were being badly hurt and no one knew where the leak was coming from. They all suspected it was coming from the Moretti Family.\n Jimmy Guardino, in Las Vegas, gave him an ultimatum. \"I\u0027m calling on behalf of the Commission, Michael.\" The National Commission was the supreme power that superseded the power of any individual Family when there was trouble. \"The police are rounding up all the Families. Someone big is singing. The word we get is that it\u0027s one of your boys. We\u0027re giving you twenty-fours to find him and take care of him.\"\n In the past, police raids had always netted the small fry, the expendables. Now, for the first time, the men at the top were being pulled in. Someone big is singing. The word we get is that it\u0027s one of your boys. They had to be right. Michael\u0027s Family had been the hardest hit, and the police were looking for him. Someone had given them solid evidence, or they never would have mounted a campaign this big. But who could it be? Michael sat back, thinking.\n Whoever was tipping off the authorities had inside information that was known only to Michael and his two top lieutenants, Salvatore Fiore and Joseph Colella. Only the three of them knew where the ledgers were hidden, and the FBI had found them. The only other person who would have had the information was Thomas Colfax, but Colfax was buried under a garbage dump in New Jersey.\n Michael sat there and thought about Salvatore Fiore and Joseph Colella. It was difficult to believe that either one of them could have broken omerta and talked. They had been with him from the beginning; he had handpicked them. He had allowed them to have their own loan-sharking operation on the side and to run a small prostitution ring. Why would they betray him? The answer, of course, was simple: the chair he was sitting in. They wanted his chair. Once he was out, they could move in and take over. They were a team; they had to be in it together.\n Michael was filled with a murderous rage. The stupid bastards were trying to pull him down, but they would not live long enough to enjoy it. The first thing he had to do was arrange bail for his men who had been arrested. He needed a lawyer he could trust - Colfax was dead, and Jennifer - Jennifer! Michael could feel the coldness creeping around his heart again. In his head he could hear himself saying, Get back as fast as you can. I\u0027ll miss you. I love you, Jennifer. He had said that and she had betrayed him. She would pay for that.\n Michael made a telephone call and sat back to wait, and fifteen minutes later Nick Vito hurried into the office.\n \"What\u0027s happening?\" Michael asked.\n \"The place is still buzzin\u0027 with Feds, Mike. I drove around the block a couple of times, but I did like you said. I stayed away.\"\n \"I\u0027ve got a job for you, Nick.\"\n \"Sure, boss. What can I do for you?\"\n \"Take care of Salvatore and Joe.\"\n Nick Vito stared at him. \"I - I don\u0027t understand. When you say, take care of them, you don\u0027t mean - \"\n Michael shouted, \"I mean blow their fucking brains out! Do you need a blueprint?\"\n \"N-no,\" Nick Vito stammered. \"It\u0027s just that I-I-I mean - Sal and Joe are your top men!\"\n Michael Moretti moved to his feet, his eyes dangerous. \"You want to tell me how to run my business, Nick?\"\n \"No, Mike. I - sure. I\u0027ll take care of them for you. When - ?\"\n \"Now. Right away. I don\u0027t want them to live to see the moon tonight. Do you understand?\"\n \"Yeah. I understand.\"\n Michael\u0027s hands tightened into fists. \"If I had time, I\u0027d take care of them myself. I want them to hurt, Nick. Make it slow, you hear? Suppilu suppilu.\"\n \"Sure. Okay.\"\n The door opened and Tony hurried in, his face gray. \"There\u0027s two FBI agents out there with a warrant for your arrest. I swear to God I don\u0027t know how they knew you was here. They - \"\n Michael Moretti turned to Nick Vito and snapped, \"Out the back way. Move!\" He turned to Tony. \"Tell them I\u0027m in the can. I\u0027ll be right with them.\"\n Michael picked up the telephone and dialed a number. One minute later he was talking to a judge of the Superior Court of New York.\n \"There are two Feds out here with a warrant for my arrest.\"\n \"What are the charges, Mike?\"\n \"I don\u0027t know and I don\u0027t give a shit. I\u0027m calling you to set things up so that I\u0027m bailed out. I can\u0027t sit around in the slammer. I\u0027ve got things to do.\"\n There was a silence and the judge\u0027s voice said carefully, \"I\u0027m afraid I won\u0027t be able to help you this time, Michael. The heat\u0027s on all over and if I try to interfere - \"\n When Michael Moretti spoke, there was an ominous note in his voice. \"Listen to me, you asshole, and listen good. If I spend one hour in jail, I\u0027ll see to it that you\u0027re behind bars for the rest of your life. I\u0027ve been taking good care of you for a long time. You want me to tell the D.A. how many cases you fixed for me? Would you like me to give the IRS the number of your Swiss bank account? Would you - \"\n \"For God\u0027s sake, Michael!\"\n \"Then move!\"\n \"I\u0027ll see what I can do,\" Judge Lawrence Waldman said. \"I\u0027ll try to - \"\n \"Try to, shit! Do it! Do you hear me, Larry? Do it!\" Michael slammed down the receiver.\n His mind was working swiftly and coolly. He was not concerned about being taken to jail. He knew that Judge Waldman would do as he was told, and he could trust Nick Vito to attend to Fiore and Colella. Without their testimony, the government could not prove a thing against him.\n Michael looked in the small mirror on the wall, combed back his hair, straightened his tie, and went out to meet the two FBI agents.\n Judge Lawrence Waldman came through, as Michael had known he would. At the preliminary hearing, an attorney selected by Judge Waldman requested bail, and it was set at five hundred thousand dollars.\n Di Silva stood there, angry and frustrated, as Michael Moretti walked out of the courtroom. \n","sourceLink":"https://allnovel.net/rage-of-angels/page-57.html","bookId":2357,"book":{"id":2357,"title":"Rage of Angels","description":"Storyline: \n A worldwide bestseller first published in 1980, this novel tells the story of Jennifer Parker, a successful lawyer who is loved by two men, one a politician, the other, a mafia don. Other work by the author includes The Other Side of Midnight and If Tomorrow Comes.\n \n","cover":"https://allnovel.net/images/rage-of-angels.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/rage-of-angels.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:05:13 AM"}}
