{"id":67867,"no":62,"title":"Page 62","content":"The twin bridges of the Garden State Parkway were not named on the map. The Garden State Parkway crossed the Raritan River between the Amboys, splitting into the two bridges, one northbound and the other southbound.\n The limousine was just west of Perth Amboy, heading toward the southbound bridge. Adam Warner was seated in back, with a secret service man beside him, and two secret service men in front.\n Agent Clay Reddin had been assigned to the senator\u0027s guard detail six months earlier, and he had come to know Adam Warner well. He had always thought of him as an open, accessible man, but all day the senator had been strangely silent and withdrawn. Deeply troubled were the words that came to Agent Reddin. There was no question in his mind but that Senator Warner was going to be the next President of the United States, and it was Reddin\u0027s responsibility to see that nothing happened to him. He reviewed again the precautions that had been taken to safeguard the senator, and he was satisfied that nothing could go wrong.\n Agent Reddin glanced again at the probable President-to-be, and wondered what he was thinking.\n Adam Warner\u0027s mind was on the ordeal that was confronting him. He had been informed by Di Silva that Jennifer Parker had been arrested. The thought of her being locked away like an animal was anathema to him. His mind kept returning to the wonderful moments they had shared together. He had loved Jennifer as he had never loved another woman.\n One of the secret service men in the front seat was saying, \"We should be arriving in Atlantic City right on schedule, Mr. President.\"\n Mr. President. That phrase again. According to all the latest polls, he was far ahead. He was the country\u0027s new folk hero, and Adam knew it was due in no small measure to the crime investigation he had headed, the investigation that would destroy Jennifer Parker.\n Adam glanced up and saw that they were approaching the twin bridges. There was a side road just before the bridge and a huge semitrailer truck was stopped at the entrance on the opposite side of the road. As the limousine neared the bridge, the truck started to pull out, so that the two vehicles arrived at the bridge at the same time.\n The secret service driver applied his brakes and slowed down. \"Look at that idiot.\"\n The shortwave radio crackled into life. \"Beacon One! Come in, Beacon One!\"\n The agent in the front seat next to the driver picked up the transmitter. \"This is Beacon One.\"\n The large truck was abreast of the limousine now as it started across the span. It was a behemoth, completely blocking out the view on the driver\u0027s side of the car. The limousine driver started to speed up to get ahead of it, but the truck simultaneously increased its speed.\n \"What the hell does he think he\u0027s doing?\" the driver muttered.\n \"We\u0027ve had an urgent call from the District Attorney\u0027s office. Fox One is in danger! Do you read me?\"\n Without warning, the truck veered to the right, hitting the side of the limousine, forcing it against the bridge railing. In seconds, the three secret service men in the car had their guns out.\n \"Get down!\"\n Adam found himself pushed down onto the floor, while Agent Reddin shielded Adam\u0027s body. The secret service agents rolled down the windows on the left side of the limousine, guns pointed. There was nothing at which to shoot. The side of the huge semitrailer blotted out everything. The driver was up ahead, out of sight. There was another jolt and a grinding crash as the limousine was knocked into the railing again. The driver swung the wheel to the left, fighting to keep the car on the bridge, but the truck kept forcing him back. The cold Raritan River swirled two hundred feet below them.\n The secret service agent next to the driver had grabbed his radio microphone and was calling wildly into it, \"This is Beacon One! Mayday! Mayday! Come in all units!\"\n But everyone in the limousine knew that it was too late for anyone to save them. The driver tried to stop the car, but the truck\u0027s huge fenders were locked into it, sweeping the limousine along. It was only a matter of seconds before the huge truck would edge them over the side of the bridge. The agent driving the car tried evasive tactics, alternately using the brake and the accelerator to slow down and speed up, but the truck had the car cruelly pinned against the bridge railing. There was no room for the car to maneuver. The truck blocked off any escape on the left side, and on the right side the limousine was being pushed against the iron railing of the bridge. The agent fought the wheel desperately as the truck pressed hard into the limousine once again, and everyone in the car could feel the bridge railing start to give way.\n The truck was jamming harder now, forcing the limousine over the side. Those in the car could feel the sudden list as the front wheels broke through the railing and went over the edge of the bridge. The car was teetering on the brink and each man, in his own way, prepared to die.\n Adam felt no fear, only an ineffable sadness at the loss, the waste. It was Jennifer he should have shared his life with, had children with - and suddenly Adam knew, from somewhere deep within himself, that they had had a child.\n The limousine gave another lurch and Adam cried out once aloud at the injustice of what had happened, what was happening.\n From overhead came the roar of two police helicopters as they swooped down out of the sky, and a moment later there was the sound of machine guns. The semitrailer lurched and all motion suddenly stopped. Adam and the others could hear the helicopters circling overhead. The men remained motionless, knowing that the slightest movement could send the car over the bridge, into the waters below.\n There was the distant scream of police sirens drawing nearer, and a few minutes later the sound of voices barking out commands. The engine of the truck roared into life again. Slowly, carefully, the truck moved, inching away from the trapped car, removing the pressure against it. The limousine tilted for one terrible instant, and then was still. A moment later, the truck had been backed out of the way and Adam and the others could see out of the left-hand windows.\n There were half a dozen squad cars and uniformed policemen with drawn guns swarming over the bridge.\n A police captain was at the side of the battered car.\n \"We\u0027ll never get the doors open,\" he said. \"We\u0027re going to bring you out through the windows - real easy.\"\n Adam was lifted out of the window first, slowly and carefully, so as not to upset the balance of the car and send it over the side. The three secret service men were next.\n When all the men had been removed from the car, the police captain turned to Adam and asked, \"Are you all right, sir?\"\n Adam turned to look at the car hanging over the edge of the bridge, and then at the dark water of the river far below.\n \"Yes,\" he said. \"I\u0027m all right.\"\n Michael Moretti glanced up at the clock on the wall. \"It\u0027s all over.\" He turned to face Jennifer. \"Your boyfriend\u0027s in the river by now.\"\n She was watching him, her face pale. \"You can\u0027t - \"\n \"Don\u0027t worry. You\u0027re going to have a fair trial.\" He turned to Gino Gallo. \"Did you tell her that Adam Warner was going to be blown away in New Canaan?\"\n \"Just like you told me, boss.\"\n Michael looked at Jennifer. \"The trial\u0027s over.\"\n He rose to his feet and walked over to where Jennifer was sitting. He grabbed her blouse and pulled her to her feet.\n \"I loved you,\" he whispered. He hit her hard across the face. Jennifer did not flinch. He hit her again, harder, then a third time, and she fell to the floor.\n \"Get up. We\u0027re taking a trip.\"\n Jennifer lay there, dizzy from the blows, trying to clear her head. Michael hauled her roughly to her feet.\n \"You want me to take care of her?\" Gino Gallo asked.\n \"No. Bring the car around the back.\"\n \"Right, boss.\" He hurried out of the room.\n Jennifer and Michael were alone.\n \"Why?\" he asked. \"We owned the world, and you threw it away. Why?\"\n She did not answer.\n \"You want me to fuck you once more for old times\u0027 sake?\" Michael moved toward her and grabbed her arm. \"Would you like that?\" Jennifer did not respond. \"You\u0027re never going to fuck anyone again, you hear? I\u0027m going to put you in the river with your lover! You can keep each other company.\"\n Gino Gallo came back into the room, his face white. \"Boss! There\u0027s a - \"\n There was a crashing sound from outside the room. Michael dived for the gun in his desk drawer. He had it in his hand when the door burst open. Two federal agents came through the door, guns drawn.\n \"Freeze!\"\n In that split second, Michael made his decision. He raised the gun and turned and fired at Jennifer. He saw the bullets go into her a second before the agents started shooting. He watched the blood spurt out of her chest, then he felt a bullet tear into him, and then another. He saw Jennifer lying on the floor, and Michael did not know which was the greater agony, her death or his. He felt the hammer blow of another bullet, and then he felt nothing. \n","sourceLink":"https://allnovel.net/rage-of-angels/page-62.html","bookId":2357,"book":{"id":2357,"title":"Rage of Angels","description":"Storyline: \n A worldwide bestseller first published in 1980, this novel tells the story of Jennifer Parker, a successful lawyer who is loved by two men, one a politician, the other, a mafia don. Other work by the author includes The Other Side of Midnight and If Tomorrow Comes.\n \n","cover":"https://allnovel.net/images/rage-of-angels.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/rage-of-angels.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:05:13 AM"}}
