{"id":96231,"no":1,"title":"Page 1","content":"I had to admit it, Dullsville was no longer dull.\\n\\n Infact, for me, RavenMadison, the morbidlymonotonous townI\u0027d grownup inhad finallybecome the most exciting place on earth.\\n\\n Not onlywas Imadlyinlove withmyvampire boyfriend,Alexander Sterling, but I\u0027d witnessed for the first time inmy vampire-obsessed existence anactual vampire bite. The onlyproblem was that it wasn\u0027t myneck being bitten.\\n\\n This wouldn\u0027t have beensucha tragedyfor me if the recipient of the bite had beenOnyxor Scarlet, the superfabulous Underworldyfriends I\u0027d met at the CoffinClub, but the bite was givento myownvampire adversary,a real vampire and gothic beauty, Luna Maxwell.\\n\\n I\u0027d beenwaiting almost a year to be bitten, since I\u0027d metAlexander, not to mentionmyentire life of immortal dreaming, but for Luna it happened withinhours of meeting another vampire. That night, onAlexander\u0027s lawn,there had beenanamazing group of partygoers--a handful of vampires mixing withthe mortal local students. It was something I\u0027d never thought would happen. While playing spinthe bloodybottle, Luna and Sebastian,Alexander\u0027s handsome and hapless best friend, had locked eyes and gone infor more thana juicylip-lock. His fangs pierced the soft flesh of her swanlike neck. Luna had stared up at me, her eyes dreamy, as if she were some hippie tripping at Woodstock. She glowed even more radiantly than she normally did as a morbid fairy girl fashionista. Most of the partyers missed the action, but those who saw the bite passed it off as a macabre prank.\\n\\n Sebastian had since moved out of the Mansion, and the rest of the vampires were perhaps back in Romania, or haunting the CoffinClub several towns awayinHipsterville. We hadn\u0027t gottenword of their whereabouts, and I hadn\u0027t seenanysigns of them at Dullsville\u0027s cemetery.\\n\\n For the week following the love bite, Itried mybest to getAlexander\u0027s mind off his disappointment. He was suffering because his best friend\u0027s impulsive behavior had put not onlyhimself and Luna but evenAlexander\u0027s secret in possible jeopardy. Happily, tonight Alexander was finally obliging.\\n\\n We were lying in the grass on a hilltop that overlooked Dullsville. From there we were able to see the glamorous sites of Hipsterville, suchas the graveyard, but Ididn\u0027t notice them because Iwas lost inAlexander\u0027s lips.\\n\\n Ihadn\u0027t broached the tender subject of receiving myownlove bite withAlexander ina while. But Isaw this evening,alone with him and without distractions, as my chance for another try.\\n\\n Fiddling witha link chainhanging from his black leather belt, Iasked, \"Do youthink it\u0027s easier for Sebastianto fall for a girl and to take her blood?\"\\n\\n Alexander furrowed his brow.\\n\\n \"Or was it easyto do what he did at the party,\" Icontinued, \"because Luna is alreadya vampire?\"\\n\\n \"Ican\u0027t speak for someone else.\"\\n\\n \"But Iwant to know what youthink.\"\\n\\n Alexander paused. \"Thenyes, Ithink it\u0027s easier for him. He is veryimpulsive.\" His tone was clear and matter-of-fact.\\n\\n I sighed.\\n\\n Alexander reached for me and guided myhair back from myface withhis fingers. \"It means more to me thanthat,\"he said directly.\\n\\n \"Me too,\" Isaid, touching his shoulder. \"But what if I were alreadya vampire?\" Iasked thoughtfully. \"What if someone else turns me--not onsacred ground--so Iwon\u0027t be bonded to them forever. But--\"\\n\\n Alexander withdrew his arm. \"That\u0027s what youwant?\" he asked, his voice almost cracking. \"To be turned--by anyone? Sebastian? Or Jagger?\"\\n\\n \"Iwas just thinking out loud,\" Iquicklyrefuted. Ididn\u0027t realize I\u0027d hurt him.\\n\\n \"It would be that easyto have someone turnyou? Just like that?\"\\n\\n WhenAlexander posed it to me like that, myfantastical solutiondidn\u0027t seem so romantic or practical inits reality.\\n\\n \"That\u0027s not what Imeant.\"\\n\\n \"Are youso sure? You\u0027d have mybest friend bite you? Or worse, mylongtime enemy?\"\\n\\n \"But now youare friends withJagger,\" Isaid, trying to lightenthe mood.\\n\\n \"That\u0027s not the point.\"\\n\\n \"Of course not--Ionlywant you. . . . Iwas just trying to take the pressure off of you. Iwas just thinking out loud.\"\\n\\n Alexander didn\u0027t seem pleased withmyresponse and continued to stare off into the distance.\\n\\n \"Let\u0027s be clear,\" Isaid, turning his face toward me. \"Iwant to be a vampire. But Iwant to be one withyou.\"\\n\\n He barely broke a smile.\\n\\n \"I\u0027m turning eighteensoonand you\u0027ll be seventeen,\" he finallysaid. \"It\u0027s something Ithink about, Raven. You. Me.\\n\\n Our future. Iwant youto know that. But this is something that is life changing--especiallyfor you.\"\\n\\n \"Iknow.\" Igazed up at mydreamyboyfriend\u0027s eyes. His face was so handsome inthe moonlight. \"But will you reallybe eighteen? Or something else, invampire years?\"\\n\\n \"Iwill reallybe eighteen,\" he said.\\n\\n \"And thenthe next year?\"\\n\\n \"Uh. . . nineteen,\" he said as if Ishould have known.\\n\\n \"But youare immortal.\"\\n\\n \"The aging process will slow down. But that\u0027s many, manyyears from now. Is that what youare worried about? Us not being able to be together unless youare immortal, too?\"\\n\\n \"I\u0027ve always wanted to be a vampire, since Iwas born,\" Isaid to him urgently. \"But thenwhenImet you, I wanted to be one--to be turned byyou. To have the covenant ceremonythat youdidn\u0027t have withLuna inRomania.A beautiful wrought-ironlace trellis witha coffinand two goblets, onsacred ground. I\u0027d be dressed ina black corset dress and hold black roses. You\u0027d be wearing a black suit and have a black rose inyour jacket lapel. We\u0027d say a few Romanianwords and drink from eachother\u0027s glasses. Then, you\u0027d turnme.\"\\n\\n \"Wow!\" he said witha laugh. \"Iguess youhave thought about it, too.\"\\n\\n \"But it\u0027s not about me living forever. It\u0027s about me being romanticallybonded withyouand experiencing the world as a vampire.\" Istared up at him, the stars shining above him.\\n\\n I waited for him to laugh, to think my ideas were childish and naive.\\n\\n Instead he leaned into me and stared straight into myeyes, his chocolate ones dreamyand seductive. \"There is a yearning that Ihave for you--that goes deeper thanlove,\" he said. \"It\u0027s a desire that is palpable.\" He took myhand and raised it, exposing the inside of mywrist. \"This desire courses throughmyveins,\" he said. He traced a prominent veinwithhis fingertip. \"And yours. But I\u0027d never put youbefore myownneeds. What Istruggle withisn\u0027t something that youshould have to as well. It\u0027s a complicated life--more so thanyourealize.\"\\n\\n \"Iknow it\u0027s complicated. If youdon\u0027t want to talk about it . . .\" Ifigured it was best to drop the subject. Ididn\u0027t want to be a nagging girlfriend, andAlexander had beenthroughso muchalreadywithSebastian\u0027s antics. Whycouldn\u0027t I be more patient and not spoil our pure quality time alone together?\\n\\n \"Well, youalreadyknow it\u0027s complicated,\"Alexander commented. \"I\u0027m not sure how Icankeep convincing you.\"\\n\\n Ismiled. \"Ilike it whenyoutry,\" Iteased. \"But sometimes Iworrythat you\u0027ll leave the Mansionand returnto Romania.And I\u0027ll be stuck here, alone for the rest of mylife.\"\\n\\n \"Well, Iam not planning onleaving.\"\\n\\n \"But youweren\u0027t planning oncoming here, were you?\"\\n\\n \"No . . .\"\\n\\n \"See?\"\\n\\n \"But Ididn\u0027t have the same reasons to staythere as Ido here,\" he said. \"Is the only way I can convince you how much I care to . . .\"\\n\\n I waited. Maybe this was my chance to demand my need to be a vampire. But it had to be a decision he was ready for as much as I was.\\n\\n \"It isn\u0027t something we need to decide tonight, is it?\" he asked.\\n\\n If Isaid yes and his answer was that he wasn\u0027t going to turnme, what was Ito do then? NormallyIwas daring.\\n\\n Adventure ranthroughmyblood just as muchas oxygendid. But this kind of risk--the emotional kind--was far different than sneaking into rumored haunted houses or cemeteries. This was my love life.\\n\\n I gave him a puppy-dog face. \"Of course not. But Iwonder if it is something youwant,\" Isaid withtrepidation, \"or is it only my fantasy?\"\\n\\n I waited. I knew Alexander had thought about it. We\u0027d discussed it before. But as he said, he was going to be eighteen and me seventeen--and, most important, I was now being faced with watching other vampires bite. It wasn\u0027t something we could put off forever.\\n\\n \"I can guarantee you it\u0027s not just your fantasy,\" he re-assured me. Then he glanced away, looking in the direction of the Mansionsitting a top BensonHill. \"You are so much like my grandmother . . .\"\\n\\n \"But wasn\u0027t she lonely? For the rest of your family? Is that the fate you\u0027d wishfor me?\"\\n\\n Alexander faced me and stroked mycheek. \"The onlyfate I\u0027d wishfor youis for us to be together.\"\\n\\n My heart skipped a beat.\\n\\n Slowly and seductively he leaned me back on the blanket. I gazed up at Alexander, the starlight filling my eyes. He began tickling me.\\n\\n WhenI\u0027d wrestled withBillygrowing up, I\u0027d learned to relaxmymuscles, whichresulted inmyno longer being ticklish. Mylittle brother would runoff, disgruntled, and I\u0027d claim victory. ButAlexander was no BillyBoy. Isquirmed inmyvampire boyfriend\u0027s powerful clutches and giggled like a little girl.\\n\\n My head whipped side to side and my face hit something jagged on the ground.\\n\\n \"Ouch!\" Icried.\\n\\n Alexander released his grip. \"Are youokay? Ididn\u0027t meanto hurt you.\"\\n\\n He helped me sit up. Ifelt onlya slight bit of pain. But it wasAlexander\u0027s reactionthat disturbed me.\\n\\n He was staring at my mouth.\\n\\n \"What\u0027s wrong?\" Iasked.\\n\\n Alexander didn\u0027t speak. Instead his gazed was fixed.\\n\\n I touched the corner of my lip.\\n\\n A mixture of lavender lipstick and dark red liquid stained my ultrawhite fingertips. Oozing blood. To Alexander it was like an exotic perfume. Tantalizing and irresistible. Fresh blood to a hungry vampire.\\n\\n I\u0027d only been in this situation with Alexander once before, when he had come to myhouse to take me to the Snow Ball. I\u0027d nicked my finger tip on the corsage pin. He\u0027d had that same intense expression as he did now, only then I hadn\u0027t known he was a vampire, and I\u0027d just quickly wiped the blood away.\\n\\n But tonight was different. I knew that Alexander was a vampire. And the way he stared at me, so transfixed and intense, slightly frightened me but also made me feel wanted and alive.\\n\\n Thought his blood was mylife line,Alexander needed myblood--or anyone else\u0027s--for his ownexistence. Others\u0027blood was his life line.\\n\\n Alexander wasn\u0027t repulsed bythe sight and scent but intentlyattracted to it. I\u0027d never witnessed it as muchas I did today. It was apparent he was fighting his impulses. I wasn\u0027t sure if I wanted him to.\\n\\n He shut his eyes and turned away from me.\\n\\n \"What would it be like?\" I asked.\\n\\n \"Don\u0027t . . .\"Alexander\u0027s appearance was scornful. Then his eyes softened. \"I want to help you. Take care of your cut. But I can\u0027t. Don\u0027t you see how hard it is for me? I can\u0027t even help the one person I love. I can\u0027t come near you or Imight--\"\\n\\n Alexander was fighting his natural impulse, and I was fighting mine. He rose up, his hands balled up in fists. He was biting his own lip. But I followed him.\\n\\n I held my bloodstained fingers out to him.\\n\\n I wanted Alexander to crave me more than he already did. Like Sebastian had craved Becky. But was that possible? Alexander was so intense and passionate as it was--was there anything deeper that he could feel or show me?And didn\u0027t he alreadycrave me and myblood without me tempting him inthis way?\\n\\n I wondered if Alexander was right--that I might not like the vampire lifestyle after all, or that mylife long dream of hiding from the sun and rising by the moonlight might not be as romantic as it seemed. Ultimately, becoming a vampire would be a decision I couldn\u0027t change.A test I couldn\u0027t retake.Anill-fitting dress I couldn\u0027t exchange. It would be for life. Forever. For eternity. But this wasn\u0027t about being turned.Alexander and I weren\u0027t onsacred ground. This was about something different.\\n\\n My boyfriend stared at me, consumed by the scent of blood and the irresistible desire to devour it. \"This is what you want? Me to be like the others--Jagger and Sebastian? Impulsive, needy?\"\\n\\n \"No. I want you to be you. This was never about being anyone else,\" I said.\\n\\n I could see Alexander was in turmoil. I was tempting him with something that was bigger than a fantasy to him.\\n\\n This was his everyday reality--a basic desire he had to fight against.\\n\\n \"It\u0027s okay,\" I said. I moved back and glanced away from him.\\n\\n But instead of retreating, too, he stood still. I could feel his gaze fixed on me with a power that was hypnotic.\\n\\n \"No,\" he said. \"Don\u0027t go.\"\\n\\n I was surprised by Alexander\u0027s response and he eded his plea. I wasn\u0027t sure what he would do next. I almost gasped. Instead of leaving me, he stepped closer and took my face in his hands.\\n\\n Alexander was so close to me, his alluring presence took my breath away. He slowly reached his hand to my cheek. I froze as if the events were happening in slow motion. As his firm hand slid seductively along my face, I melted with it. Then he tenderly wiped the blood from my mouth. It was as if he had touched my soul. My blood was now staining his fingers just as it had stained mine.\\n\\n I waited with bated breath as the biggest moment of mylife unfolded. I didn\u0027t think anything could have been dreamier than the first time we kissed or I slept in his coffin. Alexander was moments from taking my blood as his own.\\n\\n I was suddenly filled with guilt and sadness as I thought maybe Alexander was doing this for the wrong reasons.\\n\\n Maybe I\u0027d just wornhim down.\\n\\n Itook his hand and lifted mysleeve to wipe the dripping blood away. \"Youdon\u0027t have to. . . .\" Ifinallysaid.\\n\\n Alexander gentlyblocked myhand withhis free one. \"Iwant to,\" he said intensely.\\n\\n The moment seemed surreal, and I felt as if I were in a dream. My body flooded with warmth.\\n\\n Alexander stared at the dewy blood droplets now trickling down the side of his ghost white palm. It was as if he was making the decisionof a lifetime. This wasn\u0027t just anyblood to him. It was myblood.\\n\\n Alexander glanced at me and smiled. His sharp fangs caught the moonlight and glistened like icicles. Then Alexander drew his hand to his mouth. I watched, my mouth agape, as he took his bloody hand to his lips, pressed his hand to his mouth, and the red droplets disappeared. He inhaled a huge audible breath, as if he were breathing the life of me into him.\\n\\n I gazed at Alexander. He appeared transformed. For a moment it seemed as if his pale complexion was almost alive. Alexander whipped toward me with unbridled intensity. He leaned into me, his hair flopping over his forehead, and kissed me with such force my knees shook and my flesh quivered. I thought I might die of heavenly bliss.\\n\\n Alexander held me, limp in his arms, and I felt bonded to him ina deeper waythanI\u0027d ever experienced. He\u0027d let me into his world, further than ever before.\\n\\n Alexander squeezed me so tightly, it was as if we were one person. He picked me up and swung me around, the twinkling lights of Dullsville swirling by me.\\n\\n When he let me down, we both were giddy and dizzy. When I regained my vision I could see my school, the country club, and the vacant Sinclair Mill off in the distance. It was then I noticed something unusual.\\n\\n Alexander found me lost in thought.\\n\\n \"What is it?\" he said. \"Ihope youaren\u0027t--\"\\n\\n \"No--everything is fine,\" Ireassured him. \"It\u0027s nothing.\" Ididn\u0027t want anything to break our perfect moment.\\n\\n \"What\u0027s wrong?\" he insisted.\\n\\n Ihad to squint to make out the object. It was thenIcould see clearlya familiar car--or, rather, hearse.\\n\\n Itried to blockAlexander\u0027s view byattempting to pull him away, but he didn\u0027t budge.\\n\\n Alexander was already staring at the barren factory.\\n\\n His blissful expressionsharpened slightly, and Icould tell it registered to him that it was Jagger\u0027s car.\\n\\n Iremained inhis comforting clutches, bound to mylove ina wayIhadn\u0027t beenbefore. We clung to eachother, both reluctant to break our euphoric encounter and face the situation that we now overlooked.\\n\\n So Jagger hadn\u0027t gone back to Romania or Hipsterville whenAlexander\u0027s partywas over. There had to be a reasonwhyhe didn\u0027t returnand was apparentlystaying inthe factory.\\n\\n Alexander and I shared one last kiss before giving over to the distraction that lay at the bottom of the hill. \\n\\n","sourceLink":"https://allnovel.net/cryptic-cravings-vampire-kisses-8/page-1.html","bookId":2146,"book":{"id":2146,"title":"Cryptic Cravings (Vampire Kisses #8)","description":"Storyline: Cryptic Cravings (Vampire Kisses #8) \\n The morbidly monotonous Dullsville has finally become the most exciting place on earth now that Raven is madly in love with her hot vampire boyfriend Alexander, and a crew of vampires has taken residence in Dullsville\u0027s old mill. Raven discovers Jagger\u0027s plan to open a new club, The Crypt, right here in Dullsville. But is it her dream come true, or her worst nightmare? Raven and Alexander have to figure out what the nefarious vampire has in store for Dullsville\u0027s teen and vampire population. Can Raven convince Jagger to listen to her plans to make the Crypt the morbidly magnificent dance club it could be? Will it be safe for mortals and vampires alike? \\n And as Sebastian and Luna\u0027s relationship heats up, Raven wonders about her own amorous fate: Will Alexander ever turn her? Does he crave her and does he want to spend eternity together? And what does she really want? \\n With cryptic secrets and cravings, this eighth installment in the Vampire Kisses series is a romantic and mysterious thrill ride.\\n","cover":"https://allnovel.net/images/cryptic-cravings-vampire-kisses-8.jpg","author":"Ellen Schreiber","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/cryptic-cravings-vampire-kisses-8.html","creation":"Oct 5, 2019 8:58:23 AM","modification":"Oct 5, 2019 6:19:17 PM"}}
