{"id":19014,"no":34,"title":"THE CHIM?RA","content":"ONCE, in the old, old times (for all the strange things which I tell you about happened long before anybody can remember), a fountain gushed out of a hill-side, in the marvelous land of Greece. And, for aught I know, after so many thousand years, it is still gushing out of the very selfsame spot. At any rate, there was the pleasant fountain, welling freshly forth and sparkling adown the hill-side, in the golden sunset, when a handsome young man named Bellerophon drew near its margin. In his hand he held a bridle, studded with brilliant gems, and adorned with a golden bit. Seeing an old man, and another of middle age, and a little boy, near the fountain, and likewise a maiden, who was dipping up some of the water in a pitcher, he paused, and begged that he might refresh himself with a draught. \"This is very delicious water,\" he said to the maiden as he rinsed and filled her pitcher, after drinking out of it. \"Will you be kind enough to tell me whether the fountain has any name?\"-177- \"Yes; it is called the Fountain of Pirene,\" answered the maiden; and then she added, \"My grandmother has told me that this clear fountain was once a beautiful woman; and when her son was killed by the arrows of the huntress Diana, she melted all away into tears. And so the water, which you find so cool and sweet, is the sorrow of that poor mother\u0027s heart!\" \"I should not have dreamed,\" observed the young stranger, \"that so clear a well-spring, with its gush and gurgle, and its cheery dance out of the shade into the sunlight, had so much as one tear-drop in its bosom! And this, then, is Pirene? I thank you, pretty maiden, for telling me its name. I have come from a far-away country to find this very spot.\" A middle-aged country fellow (he had driven his cow to drink out of the spring) stared hard at young Bellerophon, and at the handsome bridle which he carried in his hand. \"The water-courses must be getting low, friend, in your part of the world,\" remarked he, \"if you come so far only to find the Fountain of Pirene. But, pray, have you lost a horse? I see you carry the bridle in your hand; and a very pretty one it is with that double row of bright stones upon it. If the horse was as fine as the bridle, you are much to be pitied for losing him.\" \"I have lost no horse,\" said Bellerophon, with a smile. \"But I happen to be seeking a very famous one, which, as wise people have informed me, must be found hereabouts, if anywhere. Do you know whether the winged horse Pegasus still-178- haunts the Fountain of Pirene, as he used to do in your forefathers\u0027 days?\" But then the country fellow laughed. Some of you, my little friends, have probably heard that this Pegasus was a snow-white steed, with beautiful silvery wings, who spent most of his time on the summit of Mount Helicon. He was as wild, and as swift, and as buoyant, in his flight through the air, as any eagle that ever soared into the clouds. There was nothing else like him in the world. He had no mate; he never had been backed or bridled by a master; and, for many a long year, he led a solitary and a happy life. Oh, how fine a thing it is to be a winged horse! Sleeping at night, as he did, on a lofty mountain-top, and passing the greater part of the day in the air, Pegasus seemed hardly to be a creature of the earth. Whenever he was seen, up very high above people\u0027s heads, with the sunshine on his silvery wings, you would have thought that he belonged to the sky, and that, skimming a little too low, he had got astray among our mists and vapors, and was seeking his way back again. It was very pretty to behold him plunge into the fleecy bosom of a bright cloud, and be lost in it, for a moment or two, and then break forth from the other side. Or, in a sullen rain-storm, when there was a gray pavement of clouds over the whole sky, it would sometimes happen that the winged horse descended right through it, and the glad light of the upper region would gleam after him. In another instant, it is true, both Pegasus-179- and the pleasant light would be gone away together. But any one that was fortunate enough to see this wondrous spectacle felt cheerful the whole day afterwards, and as much longer as the storm lasted. In the summer-time, and in the beautifullest of weather, Pegasus often alighted on the solid earth, and, closing his silvery wings, would gallop over hill and dale for pastime, as fleetly as the wind. Oftener than in any other place, he had been seen near the Fountain of Pirene, drinking the delicious water, or rolling himself upon the soft grass of the margin. Sometimes, too (but Pegasus was very dainty in his food), he would crop a few of the clover-blossoms that happened to be sweetest. To the Fountain of Pirene, therefore, people\u0027s great-grandfathers had been in the habit of going (as long as they were youthful, and retained their faith in winged horses), in hopes of getting a glimpse at the beautiful Pegasus. But, of late years, he had been very seldom seen. Indeed, there were many of the country folks, dwelling within half an hour\u0027s walk of the fountain, who had never beheld Pegasus, and did not believe that there was any such creature in existence. The country fellow to whom Bellerophon was speaking chanced to be one of those incredulous persons. And that was the reason why he laughed. \"Pegasus, indeed!\" cried he, turning up his nose as high as such a flat nose could be turned up,—\"Pegasus, indeed! A winged horse, truly!-180- Why, friend, are you in your senses? Of what use would wings be to a horse? Could he drag the plow so well, think you? To be sure, there might be a little saving in the expense of shoes; but then, how would a man like to see his horse flying out of the stable window?—yes, or whisking up him above the clouds, when he only wanted to ride to mill? No, no! I don\u0027t believe in Pegasus. There never was such a ridiculous kind of a horse-fowl made!\" \"I have some reason to think otherwise,\" said Bellerophon, quietly. And then he turned to an old, gray man, who was leaning on a staff, and listening very attentively, with his head stretched forward, and one hand at his ear, because, for the last twenty years, he had been getting rather deaf. \"And what say you, venerable sir?\" inquired he. \"In your younger days, I should imagine, you must frequently have seen the winged steed!\" \"Ah, young stranger, my memory is very poor!\" said the aged man. \"When I was a lad, if I remember rightly, I used to believe there was such a horse, and so did everybody else. But, nowadays, I hardly know what to think, and very seldom think about the winged horse at all. If I ever saw the creature, it was a long, long while ago; and, to tell you the truth, I doubt whether I ever did see him. One day, to be sure, when I was quite a youth, I remember seeing some hoof-tramps round about the brink of the fountain. Pegasus might have made those hoof-marks; and so might some other horse.\"","sourceLink":"http://novel.tingroom.com/duanpian/3057/84541.html","bookId":1007,"book":{"id":1007,"title":"A Wonder Book for Girls \u0026 Boys","description":"简介： THE author has long been of opinion that many of the classical myths were capable of being rendered into very capital reading for children. In the little volume here offered to the public, he has worked up half a dozen of them, with this end in view....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3057","creation":"Aug 1, 2019 12:24:08 AM","modification":"Aug 1, 2019 12:24:08 AM"}}
