{"id":34922,"no":14,"title":"THE LEAPING MATCH","content":"A flea, a grasshopper, and a frog once wanted to see which one of them could jump the highest. So they made a festival and invited the whole world and everybody else besides, who would like to come, to see the frolic. When the people assembled to see the contest they all admitted that these three famous jumpers were indeed well worth seeing. \n \n “I will give the princess, my daughter, to the one who can jump the highest,” said the king. “The champion in such a trial of skill must be rewarded.” \n \n The flea was the first to come forward. His manners were perfect and he bowed to the company on every side, for noble blood flowed in his veins; and, besides, he had been accustomed to associating with human beings, which was much to his advantage. \n 74 \n \n 75The grasshopper came next. The green uniform, which he always wore, set off his figure very well. He carried himself with great dignity, for he belonged to a very old Egyptian family, he said, and was highly thought of in the house in which he lived. \n \n In fact when he was brought out of the fields he was put into a card house, three stories high. The colored sides of the cards were turned in and the doors and windows were cut out of the Queen of Hearts. “It was built on purpose for me,” he said, “and I sing so well that sixteen crickets who had chirped all their life, and still had no card house to live in, were so angry at hearing me that they grew thinner than they ever had been before.” \n \n In this way the flea and the grasshopper went on with their long praises, each thinking himself quite an excellent match for the princess. \n \n 76The frog said nothing, but his silence only made the people think he knew a great deal, and the house dog who sniffed at him walked away with an air of approval. \n \n The old counselor who had issued three orders for keeping quiet, said at last, that the frog was a prophet, for one could tell from his back whether the coming winter would be severe or mild. Such wisdom could never be gained from the back of the man who writes almanacs. \n \n “I shall say nothing,” said the king, “but I have my own opinion; for I see everything.” \n \n And now the leaping match began. The flea jumped first. He jumped so high that no one could see what had become of him. So the people said he did not jump at all. How shameful it was of him after all his boasting! \n \n The grasshopper jumped only half as high; but he jumped right into the king’s face. This act the king thought extremely rude. \n \n The frog stood still for a long time; some 77began to think that he did not mean to jump at all. \n \n “Perhaps he’s ill,” said the house dog; so he went up to sniff at the frog again; when “pop” he made a side jump which landed him right into the lap of the princess, who was sitting on a little golden stool. \n \n “There is nothing in the world higher than my daughter,” called out the king. “The frog has made the highest jump that can be made. Only one who has a good mind could have done anything so clever as that.” And so the leaping frog won the princess. \n \n “I jumped the highest,” said the flea, “in spite of what the king said, but the decision does not matter to me. The princess may have that heavy, stiff-legged, ugly creature if he’s to her taste. Dullness and heaviness win in this stupid world. I’m too light and airy.” So the flea went into foreign lands. \n \n The grasshopper sat down upon a green bank and thought about the world and its ways. “Yes,” he said to himself, “dullness 78and heaviness do win in this stupid world. People care most about fine looks nowadays.” Then he began to sing in the grasshopper way; and from his song we have taken this little story. \n \n \n","sourceLink":"http://novel.tingroom.com/ertong/1708/50306.html","bookId":653,"book":{"id":653,"title":"Merry Tales","description":"简介： To keep children sane and sweet they must be given bright and cheery stories to read. They will find them in Merry Tales. Early in life they should learn something of myths and folklore. These tales are founded on these old treasures, but are charmin...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/1708","creation":"Aug 1, 2019 12:19:06 AM","modification":"Aug 1, 2019 12:19:06 AM"}}
