{"id":15870,"no":11,"title":"Chapter XI--Strange Noises are Heard","content":"Saturday night could not have been regarded as restful. In fact, a great many things happened beside the bracelet sliding in my room in that strange way. I managed to get up enough courage to get out of bed and put it away after an hour or so. When I at last did get to sleep, it was way past midnight, and I slept jerkily. Every once and again I would find myself sitting up, reaching for my flashlight and staring at that spot near my bed where the Jumel bracelet had lain. Then I would lie back, feeling sick, trembling and breathing hard. I couldn’t seem to help this. At twelve-thirty Evelyn let out a terrible yell (there is no other word for this), and things began to move. Even Amy and I got up this time, feeling that we would not be suspected. Aunt Penelope, with her hair done in a tight wad at the back of her head, was bending over Evelyn and saying: “Well, can’t you tell me what upset you?” And Evelyn kept gasping: “No, no! . . . The hateful thing, he put--how could he--oh, how could he!” Then she stopped, surveyed her hand, and gasped some more. “What did ‘he put’?” Aunt Penelope questioned. But Evelyn would only say, “Let me alone!” between asserting that she was sure she was going to have hysterics, and gasping. And she told her mother that that flour paste on her hand was Adonis Cream! And then she began to moan. We had not realized that she would blame him, and we began to feel worried. Well, they got her feet in hot water, and Aunt Penelope held the smelling-salts under her nose, and even Uncle Archie joined the crowd. And I think it is the only time that I ever saw aunt with him when she didn’t ask him for money. “What’s up?” he asked, looking at Evelyn, who had closed her eyes and was leaning back against the chair in a limp, sick way. “If you can tell me,” said Aunt Penelope irritably, “I will be grateful! I am aroused from my sleep by hearing Evelyn scream, and I get here and she won’t explain, and----” “Mother,” gasped Evelyn, “if you keep this up I will have hysterics; I am in no mood to--bear it--oh, the feeling!” “Huh!” grunted Uncle Archie, and paddled off to bed. Then aunt told us to stay with Evelyn while she hunted the aromatic spirits of ammonia, and we settled down to listen to her gasp. We felt sorry, but it was sort of funny, and especially when she said: “Is nothing true, is nothing sacred?” And I suppose she meant that that basket should have been too hallowed to him to fill with flour paste. Amy giggled, and then said she felt nervous and that made it. But Evelyn didn’t hear her, so it didn’t matter. She was too busy being dramatic. “To think,” she whispered, “that I believed him--thought it real!” And then, as they say in fiction, “she laughed hollowly.” After this she calmed, and while we were waiting for Aunt Penelope’s return the noise came, a scratching noise on the window-sill in my room. “What’s that?” Evelyn gasped, sitting up and quite forgetting to be limp. “I don’t know,” I answered, but my heart began to pump, for I was afraid I did. I felt that it was connected with my bracelet, and I later found that I was right. I stood up and tried to go to my room, but my knees didn’t work well. They seemed to think that they were castanets and that I wanted them to play a tune. I didn’t--but that didn’t influence them. Amy began to cry. “Hush!” said Evelyn, and she leaned forward, and in the stillness we listened. . . . There would be a scraping sound, then a lull, and then another long, grating, rasping sound. And on top of this suddenly there were two raps. . . . Somehow I reached the door which led to the small hall that connected the rooms, and from here I almost shouted: “What do you want?” And then--after one rap and the splintering sound of wood--the noises stopped. I sank down in a chair by the door and bit my lips to steady them. When I looked at Amy she was biting too, but at her nails, and as if they must all be shortened just as far as possible in ten seconds. She looked terribly intent and funny. I saw that even then. Evelyn had got one foot out of the tub, and held it, dripping in mid-air. She had her left hand over her heart. Then Aunt Penelope came back, looking as white as a sheet and carrying the bottle of ammonia upside down in one hand (uncorked too) and the ice-pick in the other. “Did you hear it?” she whispered. And then she went over to Evelyn and said: “Drink this immediately! Immediately!” and gave her the ice-pick. But no one laughed. Then there was an awful noise, and everyone screamed, but the voice of Uncle Archie was heard to say something that I cannot quote, and everyone was reassured. He had only run into an onyx pedestal which has Leonardo da Vinci’s or Raphael’s (I’ve forgotten which) flying Mercury on it. He had encountered this in the dark. In a moment he stood in the doorway, rubbing his shins and muttering. “What’s up?” he asked. “If you will tell me!” rattled Aunt Penelope, so fast you could hardly hear her words, “I shall be grateful. . . . We must all be calm! (Amy, stop biting your nails! You drive me crazy!) I was in the pantry when it began--in Natalie’s room, I think. . . . Evelyn, put your foot back in the tub; the water is dripping all over the rug. . . . And I heard it--and----” “Hugh!” grunted Uncle Archie, and went toward my room. In it, we heard him turn on the lights and put up the window which opened on the small iron balcony, from which one can lower a fire-escape if necessary. Trembling, we followed him. Evelyn didn’t even stop to wipe her feet. . . . And we saw that the window-sill was splintered and that there were deep dents in it, as if someone had pounded in a huge nail and then pulled it out. “More thieving,” said aunt. “We must be calm. . . . I am going to faint, I know I am. Evelyn, get your bedroom slippers. There seems to be no safety, no calm. But if you will just try to hold on to control----” And then somehow Amy got tangled up in the telephone cord and pulled the telephone from the table, and the table over with it, and aunt simply screamed. Uncle Archie was tired. He said he was going to live at the club if things didn’t change, and the frank way he talked diverted everyone for a few moments. Then, after a half-hour more everyone went to bed, but the lights were all left on and no one slept much. . . . Before I went to bed, I looked for the bracelet, which I was surprised to find undisturbed. We had a very late breakfast the next morning, and we all had it together and really had a good time. Even Evelyn was pleasant, and it was the last time for ages that she was nice to me. . . . We had the Sunday papers to look at (Uncle Archie gets a great many), and we all had a section and commented on the pictures, and that made talk. . . . Evelyn became greatly interested in a group of pictures of some important Spanish people who had been visiting New York on some mission. Someone had taken them to see the Jumel Mansion, because of course it is a great show place; and outside of this a reporter had snapped them. I felt sure that Se?orita Marguerita Angela Blanco y Chiappi was the little Spanish woman who had so greatly admired the Jumel bracelet and who had so extravagantly voiced her admiration in her liquid tongue. By her was a tall, very handsome man, who looked down, and he was a Cuban sugar king, it said under the picture. His name was Vicente Alcon y Rodriguez. Evelyn and I decided he admired Marguerita a great deal. His look at her made the picture very interesting. Then of course there were two or three others, standing on the steps, and one walking toward the camera with one foot in mid-air, and a swinging arm blurred. That has to happen in every group photograph. We fooled around this way until about a quarter of twelve, and then, because the day was lovely, Amy and I decided to take a walk, and Evelyn, who hadn’t an engagement before three, said she’d go with us. So we all put on our outdoor things and started out. . . . Evelyn was just as pleasant as she could be, and we had a lovely time! And I can’t think why she isn’t that way always, since everyone likes her so much when she is kind. . . . But once in a while she was quiet and seemed absent-minded, and during one of these attacks Amy whispered: “We’ll have to fix it. She thinks it was HIM.” I nodded. And I agreed. We really didn’t want to hurt her or to make trouble. We only wanted to have a little fun. She does raise such Cain that it is hard not to frighten her if one has a good opportunity. And of course, if you have initiative, you cannot help making your opportunities. The day, as I said, was lovely and made being out great fun. There was a high wind which swept your skirts around you, made you draw deep breaths, and fight to walk against it. Evelyn didn’t like it so much, but Amy and I did, thoroughly. Then a great many men chased hats (and most of them were fat and bald), which added to the interest of the stroll, and we saw men taking photographs of people on the street. They go around doing this on Sundays and holidays, especially. Some of the people looked funny while they were being taken, and we enjoyed that, although of course we didn’t let them see that we did. After a long half-hour of this Evelyn said she was tired, and we turned toward home. At the corner we encountered Mr. Herbert Apthorpe, who is part owner of the basket. He fell into step with us. Evelyn icily presented him to me; he greeted me casually and then spoke to her. “I hope you aren’t tired after last night?” he said. Evelyn had gone to a party with him, and he referred to that, but she understood it in a different way. “Of course I am tired,” she replied. “It was the most horrible experience of my life!” He looked baffled, as anyone would, and not exactly flattered. Although Amy and I were sorry, we couldn’t help giggling, for it was so funny to see them. Evelyn glared at him, and he did nothing but swallow. He had been grinning at her in a silly way for a few moments after they met, sort of as if he didn’t want to, but couldn’t help it, and that made me agree with Amy about their mutual interest. But soon his grin faded; I think he swallowed it. I never saw anyone do so much swallowing. His Adam’s apple looked like a monkey on a stick. “I never pretended that I could dance,” he said stiffly. Evelyn ignored this. Then he looked at us, and I felt in his look a great lack of cordiality. I am sure he wished that we weren’t there. But we were glad we were. “I cannot see----” he said. “I do not understand----” And then Evelyn actually allowed herself a sneer. “You alone,” she said, “understand my horror of slimy things. You alone know about the receptacle . . .” (I suppose she thought “receptacle” would stall us, but it didn’t) “and so,” she finished coldly, “the r?le of innocent is absurd to assume.” “Evelyn!” he said, and the way he said it was really dramatic. And then, her voice shaking, she ended with: “I am at loss to comprehend your ideas of humour, Mr. Apthorpe, and I must request that you do not ask me to comprehend any of your moods hereafter!” And then, with head held high, she swept into the door, and we followed her. We were really proud to know her, for she had done it so beautifully. But we were sorry too, and decided to fix it up when we had time. However, the violets made it worse. I warned Amy against taking them, but she would, since they had an orchid in them, and she wanted to dazzle a girl she doesn’t like but was going to take driving. However, that happened Monday. At two on Sunday Mr. Kempwood sent me up a little ivory elephant that I had liked, to keep, and a magazine which he loaned me because it had some letters in it from Captain Roger Morris. Mrs. Amherst Morris had written the article, and it appeared in the Hertfordshire Magazine for November, 1907. In one letter he said: “God Almighty grant that some fortunate circumstance will happen to bring about a suspension of hostilities. As for myself, I breathe only: Peace I can have none until I am back with you. How much I miss you! Your repeated marks of tender love and esteem so daily occur to my mind that I am totally unhinged. Only imagine that I, who, as you well know, never thought myself so happy anywhere as under my own roof, have now no home, and am a wanderer from day to day.” And that did make me feel sorry for him! . . . I think his wife, who Mr. Kempwood says was a famed beauty and a toast of that day (for men drank toasts to women then, if they liked them), must have been kind as well as pretty. For a man may love a woman first for the loveliness of her skin or her eyes or her hair, but he loves her long for only one thing, and that is the beauty of her spirit. In another letter he called her his “Dearest Life,” which I think must have gratified her, and in this he wrote: “My chief wish is to spend the remainder of my days with you, whose Prudency is my great comfort, and whose Kindness in sharing with patience and resignation those misfortunes which we have not brought upon ourselves, is never failing.” I was interested in those letters. I think the way they expressed themselves in other days is fascinating. And shows, perhaps more clearly than anything else, the changes that have come to men and women. . . . Mr. Vernon Castle’s letters to his wife were not at all like that (Evelyn cut some of those out of a magazine), and I am quite sure if a man was in Captain Roger Morris’ circumstances to-day he would write: “Dear old Girl, I do hope things will clear up in a hurry, for I would like to get home, you can bet;” or something like that. You cannot imagine the average New Yorker of to-day calling his wife “Dearest Life.” After I read the magazine, I decided I would go out again, for I have never got over the stuffy feeling that indoors gives me. I feel as if I am only half breathing. So I put on my things and started out. In a queer way the Jumel Mansion beckoned to me. I felt as if I must go there. I suppose it is my nervous dread of what may happen next to my bracelet that almost makes me visit it, but anyway, whatever it is, when I walk I find myself turning toward it and, before I know it, there. And when I first reached it I was so glad I had decided to go, for I found Mr. Kempwood coming up the long walk from Amsterdam Avenue, and he waved to me, and I waited. I thanked him as hard as I could for the elephant. He told me that he had put a little charm on that elephant and that I was to keep it as long as I liked him; and when I stopped, I must return it, for in such case his wish--or charm--would have to break. I said it was mine for life, for I was sure I would always care for him and his friendship. Very soberly he said: “Please do.” And then, after a long breath (the wind was high again, and I suppose he felt it), he asked me where I was going. I told him to the Jumel Mansion, Washington’s headquarters, and the Roger Morris House. He said I was a clever person to do it all at once, which was a joke, as they are all one. . . . “Suppose,” he said, “we sit down outside, or is it too cold for you?” I replied that it wasn’t, and we climbed the high steps and settled on a green bench which faces the Jumel Mansion porch. . . . And Mr. Kempwood talked and made me see things. “Look over there,” he said. I looked. I saw nothing until he spoke again and made me pretend, and suddenly I seemed to see. “There is an elegant carriage,” he said, “for ‘elegant’ is what they said in those days, but the horses’ heads droop, for they have come all the way from New York to enable the Charming Polly to see the spot where she will live. . . . She has got out. . . . ‘Roger,’ she says, ‘I think it is a grand site, and most beautiful we shall be situated!’ And he mutters, ‘Dearest heart of hearts,’ but under his breath, for Mrs. Robinson is with them. “?‘The river’s so calm flowing!’ Mary Philipse Morris, or the Charming Polly, continues. ‘But is it prudence for us to have two establishments, my husband?’ “?‘Anything you wish, and that I can give you, is prudence,’ he responds gallantly. And Mrs. Beverly Robinson, who has overheard a bit of this, puts in with: ‘The air, my dear, for you and the children is worth a deal. . . . Often I have remarked to Beverly, since our living part time at Dobbs Ferry: “How did we stand the entire year within the strict confines of the crowded town?”?’” I smiled at Mr. Kempwood and said I liked that, for I had, a lot. “What did she have on?” I asked. “Um----” he muttered, and frowned. “Stumped!” he confessed, and laughed. “I suppose she wore a cap?” he continued, “for they did at about twenty-seven in those days. And a sky-blue satin frock, all quilted and made very tight around the waist. Fitted, you know; low-necked and with a lace ruffle which fell over her shoulders? Would that do, Nat?” I liked his calling me Nat. I told him so. It made me think of uncle, and I told him that too. “Well,” he said, “I like your liking it, but I don’t like my reminding you of your uncle!” And then he poked around in the gravel at his feet with his cane. He seemed to be thinking pretty hard, and I didn’t interrupt him. After a while he asked if I thought thirty-three very old, and I said I didn’t. Although I really did. But I judged he was thirty-three, and he is. However, I have come to know that age is misleading, for he is quite as young as I am inside. The years have only added niceness to him. After another silence, I asked him to go on, and he did. “There’s a group on the porch,” he said, “and in front of this stands a man called Washington. He is staring off toward New York, which is a huge city of some thirty thousand souls. There is a tired sag to his shoulders, and discouragement shows in every line of his figure. . . . He rubs his hand across his eyes--see? Probably he hasn’t slept well, for worries will make even a good bed hard. . . . He has been made Commander-in-Chief of the Army recently. It seems John Adams urged this at the second Continental Congress in Philadelphia, in 1775. “The way things are going makes him unhappy--nervous. . . . True, he had driven the British from Boston, which they had held about two years, and they were also whipped out of North and South Carolina. But now they are turning their attention to New York, the Hudson River, and Lake Champlain. . . . Washington has guessed that they hope to divide the North and the South, and so he has mustered troops and hurried them here. . . . It has been a military headquarters before, and so he does not have to ask permission for its use from Mrs. Roger Morris. That might embarrass him, for it was said that he once entertained rather tender sentiments toward that lady. . . . I wonder if he’s thinking of her now? Do you think so, Nat?” Mr. Kempwood stared toward the porch, and I did too. “If he is,” I said, “I hope his wife won’t know it, for she is probably worrying about him, and it would be discouraging to worry about a man who is romancing over a lost love!” Mr. Kempwood agreed. “Forgotten Martha!” he said. “All apologies! He is thinking of her. . . . See him take a wallet out of his pocket and pretend to look at a map? Well, under that there’s a silhouette. He’s looking at that----” I nodded, for I liked that better. “I’m sure he loved her,” I said. “Probably he looks back at his younger affair and says: ‘In truth, I was a young idiot, to think my heart did pound a merry tune for her, who now wears two chins where but one should be!’?” Mr. Kempwood liked that. “What made him discouraged?” I asked; “anything in particular?” “Yes,” answered Mr. Kempwood, “the day before some of his troops from Connecticut turned and fled in utter terror. The British had landed in New York, and our boys, hearing this, had let their imaginations get the best of them. . . . There were only sixty of the foe, but nothing could induce our poor soldiers to stand up to them. Horse-whippings (and they were whipped by everyone, from Washington down) had no effect; they simply turned and fled. . . . You know,” he said, with a meaning look at me, “imagination can make lots that isn’t worth notice grow very gruesome!” I smiled and nodded. Then I looked down at my bracelet. “The battle of Harlem Heights came somewhere along there,” he went on; “I don’t know quite when. But our soldiers fought well, after that one day of fright, and redeemed themselves. . . . The British, after that, for a little space, took the affair as a joke. And when they started out to fight one day, blew bugles to indicate that it was in the nature of a hunt. . . . But they didn’t do that more than once.” “Was General Washington here very long?” I asked, as I looked up at the porch and seemed to see him. “No,” Mr. Kempwood answered, “only thirty-three days. After that the British took possession. . . . When you think of what those old walls have seen and heard----” Mr. Kempwood paused. Then he stood up, smiled down at me, and I knew that history was over. “My dear child,” he said, “that breeze is too strong. I am sure that your tam will have rheumatism. I should feel so sorry if it grew stiff. I like to see it waving in the wind. . . . Shall we go in for a little while?” I said I thought it would be fine, and we did. As we stood before the portrait of Madam Jumel and her niece and nephew, I began to feel cold and frightened. Mr. Kempwood pointed out the break in the canvas, and I couldn’t help feeling a little scornful toward the boy. “Weak,” I said. Mr. Kempwood, like most people, misunderstood my meaning. He thought I meant because he had let himself be married at fifteen--to a woman who only wanted his money. He was paid for that, poor boy, in more than unhappiness, for Madam Jumel disinherited him. And she sewed a black patch over his face too, saying that he had placed it there by hurting his character. Again, as I looked, she seemed to smile. I became frightfully, absurdly, frightened, and I slipped the bracelet from my arm. “She does not want me to have it!” I whispered. Mr. Kempwood laughed at me, and even ridiculed me a little, but it did not help. Then he took the bracelet and slipped it in his pocket. I let him have it until I was myself again, and then I took it back. We were alone in a little back room at that time, looking up at a high-set cupboard, which Mr. Kempwood thought had once held much good English ale. And he said he wished some of it would come back to haunt its home of long before, since he was getting tired of Bevo. “I’m ashamed,” I said; “give me the bracelet!” And he clasped it on, and said: “Now, dear child, no more nonsense!” But he was so gentle about this that it was not a scolding. After that he said, “By George!” and looked at his watch. “Dinner engagement,” he added quickly, “and a half-hour over-due. . . . Good-bye, Nat. I’ll see you Monday or Tuesday--want to take you to the Hippodrome----” But he saw me before that, and he did not keep the dinner engagement. . . . He couldn’t, for he was unconscious--at that time, I thought dead! \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3293/90062.html","bookId":458,"book":{"id":458,"title":"Natalie Page","description":"简介： I think it is strange how the scenes surrounding big events stay in your memory. And sometimes with years they become more clear than the happening which impressed them. I know this, because I remember a big four-posted bed, and a lot of people aroun...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3293","creation":"Aug 1, 2019 12:18:47 AM","modification":"Aug 1, 2019 12:18:47 AM"}}
