{"id":15872,"no":13,"title":"Chapter XIII--Blue Monday","content":"Everything started wrong Monday morning when Amy found that Evelyn was going to return some violets Mr. Apthorpe sent her. “It’s disgusting,” she said, “for they have an orchid in them.” And then she stood looking out of the window and tapping on the glass with her finger-tips. “Going to rain all day,” she said next. “I know it will; slow rains like this always do. And I haven’t a decent thing for fall wear. . . . Look how the leaves are blowing--must have come for blocks. It’s a horrid time!” And then she sat down and stared dismally ahead of her. I felt like that too, for the day was depressing, and the happenings of the afternoon before had left me feeling fearful of what might come next. It had all been reasoned out that a pair of thieves had worked together, and that one, finding Mr. Kempwood alone, had thought what his pockets might hold worth the risk of holding him up. And--the empty Jumel Mansion had afforded another opportunity. It was all reasoned out, as I said, and sounded well, but--I didn’t believe it. I knew it was connected with my bracelet. There were too many signs that pointed to this. I was absolutely sure. “I’ve never had any orchids,” said Amy after a few moments, “and mother didn’t let me have any summer furs. And sometimes I don’t know what life has held for me--except pain and going without.” Then she fumbled for a handkerchief. “Consider,” she said oratorically, after she had wiped her eyes, “how I could use that orchid. Here, I am taking Gladys Howell to Bertha Clay’s little party this afternoon (Bertha asked me to stop for her), and I could so easily use it to impress them. I have never liked them because they have constantly impressed upon me that they were older. I think an orchid mashed in a lot of violets would make them sit up and respect me!” I agreed with her. “Do you think Evelyn would give them to you?” I asked. “Maybe she could tell him she wouldn’t accept them, but that you would.” “That’s like you,” said Amy, and almost sneered, so I realized that my suggestion wasn’t a good one. We were quiet after that, for I didn’t know what to say, and Amy didn’t want to talk. The direction of the rain had changed, and it began to fall more quickly, beating a little, sombre tune upon the window as it fell. . . . The ivy on the house next door was dripping, and the leaves hung their heads. And here and there were thin spots where the arms of the vines stood out boldly against the bricks. . . . Fall had come, I could see. . . . Down below, the pavements would be sticky with rain and dust together making a paste; and here and there a leaf would glue itself tight to the walk, its colours spoiled by the city dirt it had caught after it fell. I knew what would be happening at home. . . . Every little lane would have a bonfire after dark, and the sparks from those would fly against the first, gray night sky. . . . Then the girls and boys would come out and all play hide-and-seek all over the town and even down by the river in the lumber. . . . And the air would be cool and make you want to run. And the leaves would rustle in every gutter, for there are so many trees that, even with sweeping up and burning the leaves constantly, there are always more--more and more. . . . And the crowd would roast apples and corn, and the creek is lovely in the late afternoons, echoing as it does all the red and golden world. . . . We always had paper chases in the fall, too, and that was great fun because the paper would get lost in the leaves and the trail was easily lost. . . . Sitting there, in that hot, stuffy apartment, I saw it all, and I seemed to smell the burning leaves and the odour of baking apples, and hear the snap of chestnuts as they opened in the heat. . . . And oh, how I wanted it! I wanted to go home and play ball in the middle of the street; to see Miss Hooker mincing along and hear her call: “Natalie, aren’t you ashamed to play ball--a great girl like you!” . . . To go home way after supper-time, so hungry that I ached under my belt, and to find that Bradly-dear had made fresh doughnuts, and that Uncle Frank had all three pairs of glasses on his forehead--and was hunting them all so that he could look more closely at a cocoon he had just found. . . . Oh, I wanted it! I think I would have been utterly miserable, but Amy diverted me. “Going to take them,” she said, standing up. “Evelyn will never know, and he won’t go rooting around in a returned box. If he has any sense of fitness, he will fling it from him with a curse and bury his head in his arms!” I knew Amy had read that somewhere, because it wasn’t her style, but I didn’t say I knew it. “Wouldn’t he?” she questioned. I said I supposed he would. “Well, then, what’s the use of those violets and that orchid rotting?” she asked; and she acted exactly as if I were opposing her, although I was not. Often, I have found, people do this when they want to convince themselves. They shout at you, as if you, instead of their conscience, were objecting. I said there wasn’t any. “I hate waste,” she stated loudly and stood up. “And hasn’t the Government preached against waste for ages? Orchids are much more valuable than flour!” I knew that, and said so. Then she confided that the box was in the hall, waiting for Ito to take it down, and that Evelyn had put a note inside. Amy said she was going to take the note out, slip it under the cord, and weight the box with something light so that its emptiness wouldn’t be suspicious. Then she left, to return in a moment, looking very satisfied. “Put an old pair of stockings in it,” she said. “Evelyn had thrown them in the waste basket because they had a run up the back, and it feels just right when you lift it. Ito took the flowers and put them in the pantry refrigerator and said he wouldn’t speak of them after I gave him fifty cents. I hated that, but when you consider--an orchid and violets are cheap at fifty cents.” After that she was quite cheered up, and I became so too. We decided we must right the wrong we had done, and fix up Evelyn’s and Mr. Apthorpe’s quarrel. And it seemed quite safe to blame it on Jane, but it wasn’t. . . . We took a piece of paper out of the waste basket, and Amy wrote: “I did it. I put the paste in the basket as a joke. I beg forgiveness.--Jane.” I said that wasn’t like Jane. And we compromised on “I done it. I put that there paste in the basket and kindly ask your pardon.--Jane.” And we giggled quite a little over doing it. Then we took it to Evelyn’s room and put it back of the hair receiver. “Suppose she speaks to Jane?” I asked. Amy looked annoyed. “You have more sensible suggestions that make trouble----!” she complained, but she wrote this addition: “If this is as much as spoke of, I shall leave!” And she said that she was glad I’d thought of it. . . . “They always mention leaving,” she said. “It’s as much a part of modern servants as their uniforms. It gives just the touch.” And then, feeling very clever, we went to the living-room, where we had lunch on a little table before the fire. There was a man in the dining-room arranging for new hangings, and I was glad, for eating on the small table was fun and cosy. That part of the day was nice. We talked to Ito as he served, and told him how tired we got of nourishing food, and asked him if there wasn’t something sweet in the kitchen, beside the blanc-mange which aunt had ordered for us. He thought so and vanished, to return with fruit cake and meringues, which had nothing to go in them, but which we accepted with gratitude. Altogether it was a charming hour. Amy grew confidential. I suppose the fire-light and the closed-in feeling that the rain pattering on the windows gave us made that; and she told me of her ambitions. She is going to marry a millionaire who worships the ground she walks on, and live on Fifth Avenue in the biggest house there, and have Henry Hutt paint her portrait, because she loves his kind of art. And she said her husband would have her portrait in a little room all lined with pink velvet and put violets under it (the portrait, not the velvet) every day. She has it all arranged. He is to be a broker, and after coming home from down-town he will go in that room, which Amy calls his “Heart Sanctuary,” and kneel before her picture. I asked why he didn’t kneel before her, and she said she’d be off playing auction or at the matinée. Then she ate her third meringue and stared absently into the fire. “Life is what you make it,” she said; and then: “He is going to wear a checked suit and a red tie.” I couldn’t see him kneeling in that pink room in that rig, but I didn’t say anything. “What are you going to do with your future?” she questioned, after an interval of silence. I told her I only asked to be allowed to climb fences and ride and fish, and stay at home in Queensburg. Then I realized I had not been tactful, and tried to fix it up, but I couldn’t, and our nice time was spoiled. Amy told me that I was frightfully gauche and embarrassed her and Evelyn a lot, and as for my staying at home--it was only kindness of them to take me out of it! And then she spoke of my new clothes, which I did not think was nice, and told me just how much Aunt Penelope had paid for them. I felt myself growing white, as you do when you are very hurt. And I told her I would some day pay for those clothes, after which she stopped speaking and looked embarrassed. “Don’t worry about that,” she said in a moment. “Mother expected to have to do that for you. She said she knew your things would be frightful.” I thought of Mrs. Bradly’s making them; and all the weariness of the rain and the many miles which lay between me and Queensburg sunk into my heart and ached. I felt miserable. “Mother is going to speak to you,” Amy went on. “She hasn’t any time before Wednesday morning, but she has you marked for then. I saw it on her pad; ‘Natalie ten’ is on it. She is going to ask you to be more careful of your conversational topics. I suppose you know you didn’t make a hit yesterday?” I hadn’t supposed I had, but I didn’t know I’d done anything very wrong. I said I was sorry if I had. “You should be,” said Amy. “That description of how wasps laid eggs annoyed Evelyn. Someone else was talking about the Russian arts, and you came in with that, and it sounded--queer. Egg-laying is not a subject for afternoon teas, anyway.” I didn’t see why not, but I didn’t say so. What I did say was that I was sorry I had annoyed Evelyn, and that some day, in some way, I would pay them back all I was costing them. Then I stood up and said I thought I would go off and rest for a little while. My voice sounded heavy and dull, as voices do when someone has put out all your inside fire with the cold douche of their disapproval. Amy shrugged her shoulders and didn’t reply, and I went to my room. Here I sat down and thought--sort of miserably. We had had lights on in the drawing-room, and the fire had cheered, but my room, unlit, was gray and seemed chilly in spite of being really warm. Then I tried to write Uncle Frank and Bradly-dear, but I couldn’t. As I tore up what I had written and turned away from my small desk, my attention was caught by a movement at the window. I saw the inner drapery ripple and--that someone was hidden behind it! I got up, shaking horribly and went to the hall to call Ito. He was slow to answer my ring, and when he at last did it was no wonder that the curtain hid nothing. “Wind?” he said. I shook my head. Then he looked around thoroughly, but nothing could be seen. “Wind,” he said, and this time as a statement, but I was not convinced, although I let him think I was. . . . I heard Amy dressing in the adjoining room, and I was glad she hadn’t heard the noise or what it was about. I asked Ito not to tell her, and then, because I did not want to talk to her just then, put on a plain gray sailor, a long coat, and my overshoes, and started out. The rain had almost stopped and was beginning to be a mist. I didn’t put up my umbrella, but let it blow against my cheeks, and it helped me. After I had walked eight or nine blocks I began to feel better. I did not think Amy had been kind, but I began to realize that her lack of it was not all her fault. No one had ever seemed to have time to teach her the rules--the rules that make you take a beating without noise, and make you treat the visiting team as if they were Royalty, and make you shoulder your own mistakes. They would have taught her to stand up to punishment, even if it wasn’t hers, and bear this, unless the other fellow was big enough to speak--and she would have learned that it isn’t decent to give a person things and then speak of the cost. Mrs. Bradly and Uncle Frank and baseball taught me those things. And with all my heart I am grateful that I have learned them. For although knowing how to enter a room is nice, knowing how to be square is of most importance, and I am sure it should come first. I walked a long way. The streets were more empty than usual, and I liked that. . . . The gray skylights caught in the wet pavements, which reflected everything, and it was pretty. . . . I began to feel very much better. On my way home I found a woman selling violets, and I bought a little bouquet for Mr. Kempwood. It took all of two dollars which Uncle Frank had sent me, but I was so glad to spend it that way. I stopped at Mr. Kempwood’s going up. Evelyn had just driven up in a motor, but she was with friends whom I didn’t know, so I didn’t wait. I don’t think, to be honest, that she wanted me to, for she only looked quickly at me and my violets, gave a casual wave, and turned back to speak to the group in the car. Mr. Kempwood had not gone down-town and was glad to see me, and I took off my coat and sat down with him before a fire. It seemed hot, as indoors so often does after you have been walking fast in the rain. I felt my cheeks grow warm. He was very glad to get the violets and put them in a little glass basket that shimmered with hundreds of colours. He said they were positively the nicest violets he had ever had, and I could see that he really liked my bringing them to him. I hadn’t dreamed that it would please him so much, and I began to be honestly happy. After a while, without his knowing why I asked it, I asked if he thought the mention of how a certain sort of wasp laid eggs was wrong. And I told him about how they did it, mentioning Uncle Frank with pride. Uncle Frank, of course, has taught me all I know of insect life. It seems this sort of wasp lays her eggs in the back of caterpillars (the shaved varieties), and they hatch there and eat the caterpillar, who dies, which I think is sad, but clever of the wasp. And I told him that I had heard of a country girl telling this story at a tea and embarrassing people to whom she was related, and why shouldn’t she, and was it terrible? And didn’t he feel sorry for the caterpillar? He answered at length. He said that it was perfect rot for anyone to be offended by that, and why should they be? He grew quite angry. “The world,” he said, “is full of fools, Nat. You couldn’t say anything unpleasant, my dear. It isn’t in you!” I didn’t want him to know it was I, and I thought I had fixed it so he wouldn’t, but he is very clever! “You can say anything,” he went on, “if you look at it in the bright, true light of decency and speak of it--aloud.” I nodded, my eyes on him. “I know,” I agreed. “My dear, I know you do,” he said, then asked if he might smoke, and lit a cigarette. “I think that’s an interesting story,” he continued, after a few puffs, “and I’ll admit it’s clever of Mrs. Wasp, but pretty hard on the amiable caterpillar. Think of being out for a stroll and having a day nursery grafted on you! And then consider finding yourself a boarding-house and--on top of that--being asked to supply meals at all hours! I don’t blame the old boy for kicking off. It would be simply too much!” I wondered how he could protect himself, and Mr. Kempwood said he shouldn’t have shaved. He said shaving made men lots of trouble, anyway, and if this fellow had been wise and grown a Van Dyke on his back, all troubles with the adopted family would have been avoided. Then I said I must go, and stood up. “Do you think,” I asked, “that Madam Jumel ever had a servant who grew blind? Or did anyone who was ever blind love her very much?” “I heard,” said Mr. Kempwood, “that one of those French refugees went blind and that she let him stay around the place, but don’t know how much truth there is in it. Someone who had known the coachman’s son said that this old chap used to sit out near the back door and sing peasant songs of his part of France and that he worshipped old Madam Jumel. . . . I think perhaps he missed Royalty and that she seemed that to him. . . . Anyway, it is said that he swore he would do anything for her that she asked, and that--blind or not--he would accomplish what he set out to do.” I was interested, and it was as I supposed. “Why did you ask?” he questioned. “Some day perhaps I’ll tell you,” I responded, “but not now----” And then I left. As I started for my walk that day I had passed the blind man, and for a space, in one empty street, he had followed me. And as I returned I found him sitting huddled up in a little dry spot near the basement entrance of our building. I meant to keep the bracelet. It was mine. But--keeping it was beginning to be a terror-striking matter. . . . I thought of it, fearfully, I will confess, as I went up to our apartment, but once there all thoughts of Madam Jumel’s servant, Madam Jumel, and my bracelet fled. For Evelyn stood in the centre of the hall orating to Aunt Penelope. She held an empty box in one hand and the note Amy and I had written and signed with Jane’s name in the other. And I then felt the bluest spot in all that blue Monday. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3293/90064.html","bookId":458,"book":{"id":458,"title":"Natalie Page","description":"简介： I think it is strange how the scenes surrounding big events stay in your memory. And sometimes with years they become more clear than the happening which impressed them. I know this, because I remember a big four-posted bed, and a lot of people aroun...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3293","creation":"Aug 1, 2019 12:18:47 AM","modification":"Aug 1, 2019 12:18:47 AM"}}
