{"id":9836,"no":3,"title":"Chapter 3.","content":"One of Mariam\u0027s earliest memories was the sound of awheelbarrow\u0027s squeaky iron wheels bouncing over rocks. Thewheelbarrow came once a month, filled with rice, flour, tea,sugar, cooking oil, soap, toothpaste. It was pushed by two ofMariam\u0027s half brothers, usually Muhsin and Ramin, sometimesRamin and Farhad. Up the dirt track, over rocks and pebbles,around holes and bushes, the boys took turns pushing untilthey reached the stream. There, the wheelbarrow had to beemptied and the items hand-carried across the water. Then theboys would transfer the wheelbarrow across the stream andload it up again. Another two hundred yards of pushingfollowed, this time through tall, dense grass and around thicketsof shrubs. Frogs leaped out of their way. The brothers wavedmosquitoes from their sweaty faces. \n \"He has servants,\" Mariam said. \"He could send a servant.\"\"His idea of penance,\" Nana said. \n The sound of the wheelbarrow drew Mariam and Nanaoutside. Mariam would always remember Nana the way shelooked on Ration Day: a tall, bony, barefoot woman leaning inthe doorway, her lazy eye narrowed to a slit, arms crossed ina defiant and mocking way. Her short-cropped, sunlit hairwould be uncovered and uncombed. She would wear anill-fitting gray shirt buttoned to the throat. The pockets werefilled with walnut-sized rocks. \n The boys sat by the stream and waited as Mariam and Nanatransferred the rations to thekolba They knew better than toget any closer than thirty yards, even though Nana\u0027s aim waspoor and most of the rocks landed well short of their targets. \n Nana yelled at the boys as she carried bags of rice inside, andcalled them names Mariam didn\u0027t understand. She cursed theirmothers, made hateful faces at them. The boys never returnedthe insults. \n Mariam felt sorry for the boys. How tired their arms and legsmust be, she thought pityingly, pushing that heavy load. Shewished she were allowed to offer them water. But she saidnothing, and if they waved at her she didn\u0027t wave back. Once,to please Nana, Mariam even yelled at Muhsin, told him hehad a mouth shaped like a lizard\u0027s ass-and was consumed laterwith guilt, shame, and fear that they would tell Jalil. Nana,though, laughed so hard, her rotting front tooth in full display,that Mariam thought she would lapse into one of her fits. Shelooked at Mariam when she was done and said, \"You\u0027re agood daughter.\"When the barrow was empty, the boys scuffled back andpushed it away. Mariam would wait and watch them disappearinto the tall grass and flowering weeds. \n \"Are you coming?\"\"Yes, Nana.\"\"They laugh at you. They do. I hear them.\"\"I\u0027m coming.\"\"You don\u0027t believe me?\"\"Here I am.\"\"You know I love you, Mariam jo.\"* * *In the mornings, they awoke to the distant bleating of sheepand the high-pitched toot of a flute as Gul Daman\u0027s shepherdsled their flock to graze on the grassy hillside. Mariam andNana milked the goats, fed the hens, and collected eggs. Theymade bread together. Nana showed her how to knead dough,how to kindle the tandoor and slap the flattened dough ontoits inner walls. Nana taught her to sew too, and to cook riceand all the different toppings:shalqam stew with turnip,spinachsabzi, cauliflower with ginger. \n Nana made no secret of her dislike for visitors-and, in fact,people in general-but she made exceptions for a select few. \n And so there was Gul Daman\u0027s leader, the villagearbab, HabibKhan, a small-headed, bearded man with a large belly whocame by once a month or so, tailed by a servant, who carrieda chicken, sometimes a pot ofkichiri rice, or a basket of dyedeggs, for Mariam. \n Then there was a rotund, old woman that Nana called Bibi jo,whose late husband had been a stone carver and friends withNana\u0027s father. Bibi jo was invariably accompanied by one ofher six brides and a grandchild or two. She limped and huffedher way across the clearing and made a great show of rubbingher hip and lowering herself, with a pained sigh, onto the chairthat Nana pulled up for her. Bibi jo too always broughtMariam something, a box ofdishlemeh candy, a basket ofquinces. For Nana, she first brought complaints about herfailing health, and then gossip from Herat and Gul Daman,delivered at length and with gusto, as her daughter-in-lawsatlistening quietly and dutifully behind her. \n But Mariam\u0027s favorite, other than Jalil of course, was MullahFaizullah, the elderly village Koran tutor, itsakhund He came byonce or twice a week from Gul Daman to teach Mariam thefive dailynamaz prayers and tutor her in Koran recitation, justas he had taught Nana when she\u0027d been a little girl It wasMullah Faizullah who had taught Mariam to read, who hadpatiently looked over her shoulder as her lips worked thewords soundlessly, her index finger lingering beneath eachword, pressing until the nail bed went white, as though shecould squeeze the meaning out of the symbols. It was MullahFaizullah who had held her hand, guided the pencil in it alongthe rise of eachalef, the curve of eachbeh, the three dots ofeachseh. \n He was a gaunt, stooping old man with a toothless smile anda white beard that dropped to his navel. Usually, he camealone to thekolba, though sometimes with his russet-haired sonHamza, who was a few years older than Mariam. When heshowed up at thekolba, Mariam kissed Mullah Faizullah\u0027shand-which felt like kissing a set of twigs covered with a thinlayer of skin-and he kissed the top of her brow before theysat inside for the day\u0027s lesson. After, the two of them satoutside thekolba, ate pine nuts and sipped green tea, watchedthe bulbul birds darting from tree to tree. Sometimes they wentfor walks among the bronze fallen leaves and alder bushes,along the stream and toward the mountains. Mullah Faizullahtwirled the beads of histasbeh rosary as they strolled, and, inhis quivering voice, told Mariam stories of all the things he\u0027dseen in his youth, like the two-headed snake he\u0027d found inIran, on Isfahan\u0027s Thirty-three Arch Bridge, or the watermelonhe had split once outside the Blue Mosque in Mazar, to findthe seeds forming the wordsAllah on one half,Akbar on theother. \n Mullah Faizullah admitted to Mariam that, at times, he did notunderstand the meaning of the Koran\u0027s words. But he said heliked the enchanting sounds the Arabic words made as theyrolled off his tongue. He said they comforted him, eased hisheart. \n \"They\u0027ll comfort you too, Mariam jo,\" he said. \"You cansummon them in your time of need, and they won\u0027t fail you. \n God\u0027s words will never betray you, my girl\"Mullah Faizullah listened to stories as well as he told them. \n When Mariam spoke, his attention never wavered He noddedslowly and smiled with a look of gratitude, as if he had beengranted a coveted privilege. It was easy to tell Mullah Faizullahthings that Mariam didn\u0027t dare tell Nana. \n One day, as they were walking, Mariam told him that shewished she would be allowed to go to school. \n \"I mean a real school,akhund sahib. Like in a classroom. Likemy father\u0027s other kids.\"Mullah Faizullah stopped. \n The week before, Bibi jo had brought news that Jalil\u0027sdaughters Saideh and Naheed were going to the Mehri Schoolfor girls in Herat. Since then, thoughts of classrooms andteachers had rattled around Mariam\u0027s head, images ofnotebooks with lined pages, columns of numbers, and pens thatmade dark, heavy marks. She pictured herself in a classroomwith other girls her age. Mariam longed to place a ruler on apage and draw important-looking lines. \n \"Is that what you want?\" Mullah Faizullah said, looking at herwith his soft, watery eyes, his hands behind his stooping back,the shadow of his turban falling on a patch of bristlingbuttercups. \n \u0027Yes. \n \"And you want me to ask your mother for permission.\"Mariam smiled. Other than Jalil, she thought there was noone in the world who understood her better than her oldtutor. \n \"Then what can I do? God, in His wisdom, has given us eachweaknesses, and foremost among my many is that I ampowerless to refuse you, Mariam jo,\" he said, tapping hercheek with one arthritic finger. \n But later, when he broached Nana, she dropped the knifewith which she was slicing onions. \"What for?\"\"If the girl wants to learn, let her, my dear. Let the girl havean education.\"\"Learn? Learn what, Mullah sahib?\" Nana said sharply. \"Whatis there to learn?\"She snapped her eyes toward Mariam. \n Mariam looked down at her hands. \n \"What\u0027s the sense schooling a girl like you? It\u0027s like shining aspittoon. And you\u0027ll learn nothing of value in those schools. \n There is only one, only one skill a woman like you and meneeds in life, and they don\u0027t teach it in school. Look at me.\"\"You should not speak like this to her, my child,\" MullahFaizullah said. \n \"Look at me.\"Mariam did. \n \"Only one skill And it\u0027s this:iahamuL Endure.\"\"Endure what, Nana?\"\"Oh, don\u0027t you fret aboutthat, \" Nana said. \"There won\u0027t beany shortage of things.\"She went on to say how Mil\u0027s wives had called her an ugly,lowly stone carver\u0027s daughter. How they\u0027d made her washlaundry outside in the cold until her face went numb and herfingertips burned. \n \"It\u0027s our lot in life, Mariam. Women like us. We endure. It\u0027sall we have. Do you understand? Besides, they\u0027ll laugh at youin school. They will. They\u0027ll call youharaml They\u0027ll say the mostterrible things about you. I won\u0027t have it.\"Mariam nodded. \n \"And no more talk about school. You\u0027re all I have. I won\u0027tlose you to them. Lookat me. No more talk about school.\"\"Be reasonable- Come now. If the girl wants-\" Mullah Faizullahbegan. \n \"And you,akhund sahib, with all due respect, you should knowbetter than to encourage these foolish ideas of hers. Ifyou reallycare about her, then you make her see that she belongs hereat home with her mother. Thereis nothing out there for her. \n Nothing but rejection and heartache. I know,akhund sahib. \n Iknow. \" \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1838/53222.html","bookId":1002,"book":{"id":1002,"title":"A Thousand Splendid Suns 灿烂千阳","description":"简介： 《灿烂千阳》再次以阿富汗战乱为背景，时空跨越三十年，用细腻感人的笔触描绘了阿富汗旧家族制度下苦苦挣扎的妇女，她们所怀抱的希望、爱情、梦想与所有的失落。《灿烂千阳》一书的主人公玛丽雅姆在阿富汗一个偏远贫穷的地方长大，她想上学，母亲却告诫她：学校怎么会教...","cover":"http://novel.tingroom.com/file/upload/201707/19/14-14-15-92-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1838","creation":"Aug 1, 2019 12:24:08 AM","modification":"Aug 1, 2019 12:24:08 AM"}}
