{"id":9869,"no":36,"title":"Chapter 36.","content":"LailaAs daylight steadily bleached darkness from the skythat springmorning of1994, Laila became certain that Rasheed knew. That,any moment now, he would drag her out of bed and askwhether she\u0027d really taken him for such akhar, such a donkey,that he wouldn\u0027t find out. Butazan rang out, and then themorning sun was falling flat on the rooftops and the roosterswere crowing and nothing out of the ordinary happenedShe could hear him now in the bathroom, the tapping of hisrazor against the edge of the basin. Then downstairs, movingabout, heating tea. The keys jingled. Now he was crossing theyard, walking his bicycle. Laila peered through a crack in the living-room curtains. Shewatched him pedal away, a big man on a small bicycle, themorning sun glaring off the handlebars. \"Laila?\"Mariam was in the doorway. Laila could tell that she hadn\u0027tslept either. She wondered if Mariam too had been seized allnight by bouts of euphoria and attacks of mouth-drying anxiety. \"We\u0027ll leave in half an hour,\" Laila said. * * *In the backseat of the taxi, they did not speak. Aziza sat onMariam\u0027s lap, clutching her doll, looking with wide-eyedpuzzlement at the city speeding by. \"Ona!\"she cried, pointing to a group of little girls skippingrope. \"Mayam!Ona\"Everywhere she looked, Laila saw Rasheed. She spotted himcoming out of barbershops with windows the color of coal dust,from tiny booths that sold partridges, from battered,open-fronted stores packed with old tires piled from floor toceiling. She sank lower in her seat. Beside her, Mariam was muttering a prayer. Laila wished shecould see her face, but Mariam was in burqa-they bothwere-and all she could see was the glitter of her eyes throughthe grid. This was Laila\u0027s first time out of the house in weeks,discounting the short trip to the pawnshop the daybefore-where she had pushed her wedding ring across a glasscounter, where she\u0027d walked out thrilled by the finality of it,knowing there was no going back. All around her now, Laila saw the consequences of the recentfighting whose sounds she\u0027d heard from the house. Homes thatlay in roofless ruins of brick and jagged stone, gouged buildingswith fallen beams poking through the holes, the charred,mangled husks of cars, upended, sometimes stacked on top ofeach other, walls pocked by holes of every conceivable caliber,shattered glass everywhere. She saw a funeral processionmarching toward a mosque, a black-clad old woman at therear tearing at her hair. They passed a cemetery littered withrock-piled graves and raggedshaheed flags fluttering in thebreeze. Laila reached across the suitcase, wrapped her fingers aroundthe softness of her daughter\u0027s arm. * * *At the Lahore Gate bus station, near Pol Mahmood Khan inEast Kabul, a row of buses sat idling along the curbside. Menin turbans were busy heaving bundles and crates onto bustops, securing suitcases down with ropes. Inside the station,men stood in a long line at the ticket booth. Burqa-clad womenstood in groups and chatted, their belongings piled at their feet. Babies were bounced, children scolded for straying too far. Mujahideen militiamen patrolled the station and the curbside,barking curt orders here and there. They wore boots,pakols,dusty green fatigues. They all carried Kalashnikovs. Laila felt watched. She looked no one in the face, but she feltas though every person in this place knew, that they werelooking on with disapproval at what she and Mariam weredoing. \"Do you see anybody?\" Laila asked. Mariam shifted Aziza in her arms. \"I\u0027m looking.\"This, Laila had known, would be the first risky part, finding aman suitable to pose with them as a family member. Thefreedoms and opportunities that women had enjoyed between1978 and 1992 were a thing of the past now- Laila could stillremember Babi saying of those years of communist rule,It\u0027s agood time to be a woman in Afghanistan, Laila Since theMujahideen takeover in April 1992, Afghanistan\u0027s name hadbeen changed to the Islamic State of Afghanistan. The SupremeCourt under Rabbani was filled now with hard-liner mullahswho did away with the communist-era decrees that empoweredwomen and instead passed rulings based on Shari\u0027a, strictIslamic laws that ordered women to cover, forbade their travelwithout a male relative, punished adultery with stoning. Even ifthe actual enforcement of these laws was sporadic at best.Butthey\u0027d enforce them on us more, Laila had said to Mariam,ifthey weren\u0027t so busy killing each other. And us. The second risky part of this trip would come when theyactually arrived in Pakistan. Already burdened with nearly twomillion Afghan refugees, Pakistan had closed its borders toAfghans in January of that year. Laila had heard that onlythose with visas would be admitted. But the border wasporous-always had been-and Laila knew that thousands ofAfghans were still crossing into Pakistan either with bribes orby proving humanitarian grounds- and there were alwayssmugglers who could be hired.We\u0027ll find a way when we getthere, she\u0027d told Mariam. \"How about him?\" Mariam said, motioning with her chin. \"He doesn\u0027t look trustworthy.\"\"And him?\"\"Too old. And he\u0027s traveling with two other men.\"Eventually,Laila found him sitting outside on a park bench,witha veiled woman at his side and a little boy in a skullcap,roughly Aziza\u0027s age, bouncing on his knees.He wastall andslender, bearded, wearing an open-collaredshirt and a modestgray coat with missing buttons. \"Wait here,\"she said to Mariam. Walking away, she againheard Mariam muttering a prayer. When Laila approached the young man, he looked up,shielded the sun from his eyes with a hand. \"Forgive me, brother, but are you going to Peshawar?\"\"Yes,\" he said, squinting. \"I wonder ifyou can help us. Can you do us a favor?\"He passed the boy to his wife. He and Laila stepped away. \"What is it,hamshiraT\u0027 She was encouraged to see that he had soft eyes, a kindface. She told him the story that she and Mariam had agreed on. She was abiwa,she said, a widow. She and her mother anddaughter had no oneleft in Kabul. They were going toPeshawar to stay with her uncle. \"You want to come with my family,\" the young man said\"I know it\u0027szahmat for you. But you look like a decentbrother, and I-\"\"Don\u0027t worry,hamshira I understand. It\u0027s no trouble. Let mego and buy your tickets.\"\"Thank you, brother. This issawab, a good deed. God willremember.\"She fished the envelope from her pocket beneath the burqaand passed it to him. In it was eleven hundred afghanis, orabout half of the money she\u0027d stashed over the past year plusthe sale of the ring. He slipped the envelope in his trouserpocket. \"Wait here.\"She watched him enter the station. He returned half an hourlater. \"It\u0027s best I hold on to your tickets,\" he said. The bus leavesin one hour, at eleven. We\u0027ll all board together. My name isWakil. If they ask-and they shouldn\u0027t-I\u0027ll tell them you\u0027re mycousin.\"Laila gave him their names, and he said he would remember. \"Stay close,\" he said. They sat on the bench adjacent to Wakil and his family\u0027s. Itwas a sunny, warm morning, the sky streaked only by a fewwispy clouds hovering in the distance over thehills. Mariambegan feeding Aziza a few of the crackers she\u0027d remembered tobring in their rush to pack. She offered one to Laila. \"I\u0027ll throwup,\" Laila laughed. \"I\u0027m too excited.\"\"Metoo.\"\"Thankyou, Mariam.\"\"For what?\"\"For this.For coming with us,\" Laila said. \"I don\u0027t think I coulddo this alone.\"\"You won\u0027t have to.\"\"We\u0027re going to be all right, aren\u0027t we, Mariam, where we\u0027regoing?\"Mariam\u0027s hand slid across the bench and closed over hers. \"The Koran says Allah is the East and the West, thereforewherever you turn there is Allah\u0027s purpose.\"\"Bov!\"Aziza cried, pointing to a bus. \"Mayam,bov\"\"I see it, Aziza jo,\" Mariam said. \"That\u0027s right,bov. Soon we\u0027reall going to ride on abov. Oh, the things you\u0027re going to see.\"Laila smiled. She watched a carpenter in his shop across thestreet sawing wood, sending chips flying. She watched the carsbolting past, their windows coated with soot and grime. Shewatched the buses growling idly at the curb, with peacocks,lions, rising suns, and glittery swords painted on their sides. In the warmth of the morning sun, Laila felt giddy and bold. She had another of those little sparks of euphoria, and when astray dog with yellow eyes limped by, Laila leaned forward andpet its back. A few minutes before eleven, a man with a bullhorn called forall passengers to Peshawar to begin boarding. The bus doorsopened with a violent hydraulic hiss. A parade of travelersrushed toward it, scampering past each other to squeezethrough. Wakil motioned toward Laila as he picked up his son. \"We\u0027re going,\" Laila said. Wakil led the way. As they approached the bus, Laila sawfaces appear in the windows, noses and palms pressed to theglass. All around them, farewells were yelled. A young militia soldier was checking tickets at the bus door. \"Bov!\" Azxzz.cried. Wakil handed tickets to the soldier, who tore them in half andhanded them back. Wakil let his wife board first. Laila saw alook pass between Wakil and the militiaman. Wakil, perched onthe first step of the bus, leaned down and said something inhis ear. The militiaman nodded. Laila\u0027s heart plummeted. \"You two, with the child, step aside,\" the soldier said. Laila pretended not to hear. She went to climb the steps, buthe grabbed her by the shoulder and roughly pulled her out ofthe line. \"You too,\" he called to Mariam. \"Hurry up! You\u0027reholding up the line.\"\"What\u0027s the problem, brother?\" Laila said through numb lips. \"We have tickets. Didn\u0027t my cousin hand them to you?\"He made aShh motion with his finger and spoke in a lowvoice to another guard. The second guard, a rotund fellow witha scar down his right cheek, nodded. \"Follow me,\" this one said to Laila. \"We have to board this bus,\" Laila cried, aware that her voicewas shaking. \"We have tickets. Why are you doing this?\"\"You\u0027re not going to get on this bus. You might as well acceptthat. You will follow me. Unless you want your little girl to seeyou dragged.\"As they were led to a truck, Laila looked over her shoulderand spotted Wakil\u0027s boy at the rear of the bus. The boy sawher too and waved happily. * * *At the police station at Torabaz Khan Intersection, they weremade to sit apart, on opposite ends of a long, crowdedcorridor, between them a desk, behind which a man smokedone cigarette after another and clacked occasionally on atypewriter. Three hours passed this way. Aziza tottered fromLaila to Mariam, then back. She played with a paper clip thatthe man at the desk gave her. She finished the crackers. Eventually, she fell asleep in Mariam\u0027s lap. At around three o\u0027clock, Laila was taken to an interview room. Mariam was made to wait with Aziza in the corridor. The man sitting on the other side of the desk in the interviewroom was in his thirties and wore civilian clothes- black suit,tie, black loafers. He had a neatly trimmed beard, short hair,and eyebrows that met. He stared at Laila, bouncing a pencilby the eraser end on the desk. \"We know,\" he began, clearing his throat and politely coveringhis mouth with a fist, \"that you have already told one lietoday,kamshira The young man at the station was not yourcousin. He told us as much himself. The question is whetheryou will tell more lies today. Personally, I advise you against it.\"\"We were going to stay with my uncle,\" Laila said \"That\u0027s thetruth.\"The policeman nodded. \"Thehamshira in the corridor, she\u0027syour mother?\"\"Yes.\"\"She has a Herati accent. You don\u0027t.\"\"She was raised in Herat, I was born here in Kabul.\"\"Of course. And you are widowed? You said you were. Mycondolences. And this uncle, thiskaka, where does he live?\"\"In Peshawar.\"\"Yes, you said that.\" He licked the point of his pencil andpoised it over a blank sheet of paper. \"But where inPeshawar? Which neighborhood, please? Street name, sectornumber.\"Laila tried to push back the bubble of panic that was comingup her chest. She gave him the name of the only street sheknew in Peshawar-she\u0027d heard it mentioned once, at the partyMammy had thrown when the Mujahideen had first come toKabul-\"Jamrud Road.\"\"Oh, yes. Same street as the Pearl Continental Hotel. He mighthave mentioned it.\"Laila seized this opportunity and said he had. \"That very samestreet, yes.\"\"Except the hotel is on Khyber Road.\"Laila could hear Aziza crying in the corridor. \"My daughter\u0027sfrightened. May I get her, brother?\"\"I prefer \u0027Officer.\u0027 And you\u0027ll be with her shortly. Do you havea telephone number for this uncle?\"\"I do. I did. I…\" Even with the burqa between them, Lailawas not buffered from his penetrating eyes. \"I\u0027m so upset, Iseem to have forgotten it.\"He sighed through his nose. He asked for the uncle\u0027s name,his wife\u0027s name. How many children did he have? What weretheir names? Where did he work? How old was he? Hisquestions left Laila flustered. He put down his pencil, laced his fingers together, and leanedforward the way parents do when they want to conveysomething to a toddler. \"You do realize,hamshira, that it is acrime for a woman to run away. We see a lot of it. Womentraveling alone, claiming their husbands have died. Sometimesthey\u0027re telling the truth, most times not. You can be imprisonedfor running away, I assume you understand that,nay1?\"\"Let us go, Officer…\" She read the name on his lapel tag. \"Officer Rahman. Honor the meaning of your name and showcompassion. What does it matter to you to let a mere twowomen go? What\u0027s the harm in releasing us? We are notcriminals.\"\"I can\u0027t.\"\"I beg you, please.\"\"It\u0027s a matter ofqanoon, hamshira, a matter of law,\" Rahmansaid, injecting his voice with a grave, self-important tone. \"It ismy responsibility, you see, to maintain order.\"In spite of her distraught state, Laila almost laughed. She wasstunned that he\u0027d used that word in the face of all that theMujahideen factions had done-the murders, the lootings, therapes, the tortures, the executions, the bombings, the tens ofthousands of rockets they had fired at each other, heedless ofall the innocent people who would die in the cross fire.Order. But she bit her tongue. \"If you send us back,\" she said instead, slowly, \"there is nosaying what he will do to us.\"She could see the effort it took him to keep his eyes fromshifting. \"What a man does in his home is his business.\"\"What about the law,then, Officer Rahman?\" Tears of ragestung her eyes. \"Will you be there to maintain order?\"\"As a matter of policy, we do not interfere with private familymatters,hamshira\"\"Of course you don\u0027t. When it benefits the man. And isn\u0027t thisa \u0027private family matter,\u0027 as you say? Isn\u0027t it?\"He pushed back from his desk and stood up, straightened hisjacket. \"I believe this interview is finished. I must say,hamshira,that you have made a very poor case for yourself. Very poorindeed. Now, if you would wait outside I will have a few wordswith your…whoever she is.\"Laila began to protest, then to yell, and he had to summonthe help of two more men to have her dragged out of hisoffice. Mariam\u0027s interview lasted only a few minutes. When she cameout, she looked shaken. \"He asked so many questions,\" she said. \"I\u0027m sorry, Laila jo. I am not smart like you. He asked so many questions, I didn\u0027tknow the answers. I\u0027m sorry.\"\"It\u0027s not your fault, Mariam,\" Laila said weakly. \"It\u0027s mine. It\u0027sall my fault. Everything is my fault.\"* * *It was past six o\u0027clock when the police car pulled up in frontof the house. Laila and Mariam were made to wait in thebackseat, guarded by a Mujahid soldier in the passenger seat. The driver was the one who got out of the car, who knockedon the door, who spoke to Rasheed. It was he who motionedfor them to come. \"Welcome home,\" the man in the front seat said, lighting acigarette. * * *\"You,\" he said to Mariam. \"You wait here.\"Mariam quietly took a seat on the couch. \"You two, upstairs.\"Rasheed grabbed Laila by the elbow and pushed her up thesteps. He was still wearing the shoes he wore to work, hadn\u0027tyet changed to his flip-flops, taken off his watch, hadn\u0027t evenshed his coat yet. Laila pictured him as he must have been anhour, or maybe minutes, earlier, rushing from one room toanother, slamming doors, furious and incredulous, cursing underhis breath. At the top of the stairs, Laila turned to him. \"She didn\u0027t want to do it,\" she said. \"I made her do it. Shedidn\u0027t want to go-\"Laila didn\u0027t see the punch coming. One moment she wastalking and the next she was on all fours, wide-eyed andred-faced, trying to draw a breath. It was as if a car had hither at full speed, in the tender place between the lower tip ofthe breastbone and the belly button. She realized she haddropped Aziza, that Aziza was screaming. She tried to breatheagain and could only make a husky, choking sound. Dribblehung from her mouth. Then she was being dragged by the hair. She saw Aziza lifted,saw her sandals slip off, her tiny feet kicking. Hair was rippedfrom Laila\u0027s scalp, and her eyes watered with pain. She saw hisfoot kick open the door to Mariam\u0027s room, saw Aziza flungonto the bed. He let go of Laila\u0027s hair, and she felt the toe ofhis shoe connect with her left buttock. She howled with pain ashe slammed the door shut. A key rattled in the lock. Aziza was still screaming. Laila lay curled up on the floor,gasping. She pushed herself up on her hands, crawled towhere Aziza lay on the bed. She reached for her daughter. Downstairs, the beating began. To Laila, the sounds she heardwere those of a methodical, familiar proceeding. There was nocursing, no screaming, no pleading, no surprised yelps, only thesystematic business of beating and being beaten, thethump,thump of something solid repeatedly striking flesh, something,someone, hitting a wall with a thud, cloth ripping. Now andthen, Laila heard running footsteps, a wordless chase, furnitureturning over, glass shattering, then the thumping once more. Laila took Aziza in her arms. A warmth spread down thefront of her dress when Aziza\u0027s bladder let go. Downstairs, the running and chasing finally stopped. Therewas a sound now like a wooden club repeatedly slapping aside of beef. Laila rocked Aziza until the sounds stopped, and, when sheheard the screen door creak open and slam shut, she loweredAziza to the ground and peeked out the window. She sawRasheed leading Mariam across the yard by the nape of herneck. Mariam was barefoot and doubled over. There was bloodon his hands, blood on Mariam\u0027s face, her hair, down herneck and back. Her shirt had been ripped down the front. \"I\u0027m so sorry, Mariam,\" Laila cried into the glass. She watched him shove Mariam into the toolshed. He went in,came out with a hammer and several long planks of wood. Heshut the double doors to the shed, took a key from his pocket,worked the padlock. He tested the doors, then went aroundthe back of the shed and fetched a ladder. A few minutes later, his face was in Laila\u0027s window, nailstucked in the comer of his mouth. His hair was disheveled. There was a swath of blood on his brow. At the sight of him,Aziza shrieked and buried her face in Laila\u0027s armpit. Rasheed began nailing boards across the window. * * *The dark was total, impenetrable and constant, without layeror texture. Rasheed had filled the cracks between the boardswith something, put a large and immovable object at the footof the door so no light came from under it. Something hadbeen stuffed in the keyhole. Laila found it impossible to tell the passage of time with hereyes, so she did it with her good ear.Azan and crowingroosters signaled morning. The sounds of plates clanking in thekitchen downstairs, the radio playing, meant evening. The first day, they groped and fumbled for each other in thedark. Laila couldn\u0027t see Aziza when she cried, when she wentcrawling. \"Aishee,\"Aziza mewled.\"Aishee.\"\"Soon.\" Laila kissed her daughter, aiming for the forehead,finding the crown of her head instead. \"We\u0027ll have milk soon. You just be patient. Be a good, patient little girl for Mammy,and I\u0027ll get you someaishee. \"Laila sang her a few songs. Azanrang out a second time and still Rasheed had not giventhem any food, and, worse, no water. That day, a thick,suffocating heat fell on them. The room turned into a pressurecooker. Laila dragged a dry tongue over her lips, thinking ofthe well outside, the water cold and fresh. Aziza kept crying,and Laila noticed with alarm that when she wiped her cheeksher hands came back dry. She stripped the clothes off Aziza,tried to find something to fan her with, settled for blowing onher until she became light-headed. Soon, Aziza stopped crawlingaround. She slipped in and out of sleep. Several times that day, Laila banged her fists against the walls,used up her energy screaming for help, hoping that a neighborwould hear. But no one came, and her shrieking onlyfrightened Aziza, who began to cry again, a weak, croakingsound. Laila slid to the ground. She thought guiltily of Mariam,beaten and bloodied, locked in this heat in the toolshed. Laila fell asleep at some point, her body baking in the heat. She had a dream that she and Aziza had run into Tariq. Hewas across a crowded street from them, beneath the awning ofa tailor\u0027s shop. He was sitting on his haunches and samplingfrom a crate of figs.That\u0027s your father, Laila said.That manthere, you see him? He\u0027s your real baba. She called his name,but the street noise drowned her voice, and Tariq didn\u0027t hear. She woke up to the whistling of rockets streaking overhead. Somewhere, the sky she couldn\u0027t see erupted with blasts andthe long, frantic hammering of machine-gun fire. Laila closedher eyes. She woke again to Rasheed\u0027s heavy footsteps in thehallway. She dragged herself to the door, slapped her palmsagainst it. \"Just one glass, Rasheed. Not for me. Do it for her. Youdon\u0027t want her blood on your hands.\" He walked past-Shebegan to plead with him. She begged for forgiveness, madepromises. She cursed him. His door closed. The radio came on. The muezzin calledazan a third time. Again the heat. Azizabecame even more listless. She stopped crying, stopped movingaltogether. Laila put her ear over Aziza\u0027s mouth, dreading each time thatshe would not hear the shallow whooshing of breath. Even thissimple act of lifting herself made her head swim. She fellasleep, had dreams she could not remember. When she wokeup, she checked on Aziza, felt the parched cracks of her lips,the faint pulse at her neck, lay down again. They would diehere, of that Laila was sure now, but what she really dreadedwas that she would outlast Aziza, who was young and brittle. How much more could Aziza take? Aziza would die in thisheat, and Laila would have to lie beside her stiffening littlebody and wait for her own death. Again she fell asleep. Wokeup. Fell asleep. The line between dream and wakefulnessblurred. It wasn\u0027t roosters orazan that woke her up again but thesound of something heavy being dragged. She heard a rattling-Suddenly, the room was flooded with light. Her eyes screamedin protest. Laila raised her head, winced, and shielded her eyes. Through the cracks between her fingers, she saw a big, blurrysilhouette standing in a rectangle of light. The silhouette moved. Now there was a shape crouching beside her, looming overher, and a voice by her ear. \"You try this again and I will find you. I swear on theProphet\u0027s name that I will find you. And, when I do, there isn\u0027ta court in this godforsaken country that will hold meaccountable for what I will do. To Mariam first, then to her,and you last. I\u0027ll make you watch. You understand me?I\u0027llmake you watch.\"And, with that, he left the room. But not before delivering akick to the flank that would have Laila pissing blood for days.","sourceLink":"http://novel.tingroom.com/jingdian/1838/53255.html","bookId":1002,"book":{"id":1002,"title":"A Thousand Splendid Suns 灿烂千阳","description":"简介： 《灿烂千阳》再次以阿富汗战乱为背景，时空跨越三十年，用细腻感人的笔触描绘了阿富汗旧家族制度下苦苦挣扎的妇女，她们所怀抱的希望、爱情、梦想与所有的失落。《灿烂千阳》一书的主人公玛丽雅姆在阿富汗一个偏远贫穷的地方长大，她想上学，母亲却告诫她：学校怎么会教...","cover":"http://novel.tingroom.com/file/upload/201707/19/14-14-15-92-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1838","creation":"Aug 1, 2019 12:24:08 AM","modification":"Aug 1, 2019 12:24:08 AM"}}
