{"id":9874,"no":41,"title":"Chapter 41.","content":"MadamIn the summer of 2000, the drought reached its third andworst year. \\n\\n In Helmand, Zabol, Kandahar, villages turned into herds ofnomadic communities, always moving, searching for water andgreen pastures for their livestock. When they found neither,when their goats and sheep and cows died off, they came toKabul They took to the Kareh-Ariana hillside, living in makeshiftslums, packed in huts, fifteen or twenty at a time. \\n\\n That was also the summer ofTitanic, the summer that Mariamand Aziza were a tangle of limbs, rolling and giggling, Azizainsistingshe get to be Jack. \\n\\n \"Quiet, Aziza jo.\"\"Jack! Say my name, Khala Mariam. Say it. Jack!\" \"Yourfather will be angry if you wake him.\"\"Jack! And you\u0027re Rose.\"It would end with Mariam on her back, surrendering, agreeingagain to be Rose. \"Fine, you be Jack,\" she relented \"You dieyoung, and I get to live to a ripe old age.\"\"Yes, but I die a hero,\" said Aziza, \"while you, Rose, youspend your entire, miserable life longing for me.\" Then,straddling Mariam\u0027s chest, she\u0027d announce, \"Now we mustkiss!\" Mariam whipped her head side to side, and Aziza,delighted with her own scandalous behavior, cackled throughpuckered lips. \\n\\n Sometimes Zalmai would saunter in and watch this game. \\n\\n What didhe get to be, he asked\"You can be the iceberg,\" said Aziza. \\n\\n That summer,Titanic fever gripped Kabul. People smuggledpirated copies of the film from Pakistan- sometimes in theirunderwear. After curfew, everyone locked their doors, turnedout the lights, turned down the volume, and reaped tears forJack and Rose and the passengers of the doomed ship. Ifthere was electrical power, Mariam, Laila, and the childrenwatched it too. A dozen times or more, they unearthed the TVfrom behind the toolshed, late at night, with the lights out andquilts pinned over the windows. \\n\\n At the Kabul River, vendors moved into the parched riverbed. \\n\\n Soon, from the river\u0027s sunbaked hollows, it was possible tobuyTitanic carpets, andTitanic cloth, from bolts arranged inwheelbarrows. There wasTitanic deodorant,Titanictoothpaste,Titanic perfume,Titanicpakora, evenTitanic burqas. Aparticularly persistent beggar began calling himself \"TitanicBeggar.\"\"Titanic City\" was born. \\n\\n It\u0027s the song,they said. \\n\\n No, the sea. The luxury. The ship. \\n\\n It\u0027s the sex,they whisperedLeo,said Aziza sheepishly.It\u0027s all about Leo. \\n\\n \"Everybody wants Jack,\" Laila said to Mariam. \"That\u0027s what itis. Everybody wants Jack to rescue them from disaster. Butthere is no Jack. Jack is not coming back. Jack is dead.\"* * *Then, late that summer, a fabric merchant fell asleep andforgot to put out his cigarette. He survived the fire, but hisstore did not. The fire took the adjacent fabric store as well, asecondhand clothing store, a small furniture shop, a bakery. \\n\\n They told Rasheed later that if the winds had blown eastinstead of west, his shop, which was at the corner of the block,might have been spared. \\n\\n * * *They sold everything. \\n\\n First to go were Mariam\u0027s things, then Laila\u0027s. Aziza\u0027s babyclothes, the few toys Laila had fought Rasheed to buy her. \\n\\n Aziza watched the proceedings with a docile look. Rasheed\u0027swatch too was sold, his old transistor radio, his pair of neckties,his shoes, and his wedding ring. The couch, the table, the rug,and the chairs went too. Zalmai threw a wicked tantrum whenRasheed sold the TV. \\n\\n After the fire, Rasheed was home almost every day. Heslapped Aziza. He kicked Mariam. He threw things. He foundfault with Laila, the way she smelled, the way she dressed, theway she combed her hair, her yellowing teeth. \\n\\n \"What\u0027s happened to you?\" he said. \"I marriedapart, and nowI\u0027m saddled with a hag. You\u0027re turning into Mariam.\"He got fired from the kebab house near Haji Yaghoub Squarebecause he and a customer got into a scuffle. The customercomplained that Rasheed had rudely tossed the bread on histable. Harsh words had passed. Rasheed had called thecustomer a monkey-faced Uzbek. A gun had been brandished. \\n\\n A skewer pointed in return. In Rasheed\u0027s version, he held theskewer. Mariam had her doubts. \\n\\n Fired from the restaurant in Taimani because customerscomplained about the long waits, Rasheed said the cook wasslow and lazy. \\n\\n \"You were probably out back napping,\" said Laila. \\n\\n \"Don\u0027t provoke him, Laila jo,\" Mariam said. \\n\\n \"I\u0027m warning you, woman,\" he said. \\n\\n \"Either that or smoking.\"\"I swear to God.\"\"You can\u0027t help being what you are.\"And then he was on Laila, pummeling her chest, her head,her belly with fists, tearing at her hair, throwing her to thewall. Aziza was shrieking, pulling at his shirt; Zalmai wasscreaming too, trying to get him off his mother. Rasheedshoved the children aside, pushed Laila to the ground, andbegan kicking her. Mariam threw herself on Laila. He went onkicking, kicking Mariam now, spittle flying from his mouth, hiseyes glittering with murderous intent, kicking until he couldn\u0027tanymore. \\n\\n \"I swear you\u0027re going to make me kill you, Laila,\" he said,panting. Then he stormed out of the house. \\n\\n * * *When the money ran out, hunger began to cast a pall overtheir lives. It was stunning to Mariam how quickly alleviatinghunger became the crux of their existence. \\n\\n Rice, boiled plain and white, with no meat or sauce, was arare treat now. They skipped meals with increasing andalarming regularity. Sometimes Rasheed brought home sardinesin a can and brittle, dried bread that tasted like sawdust. \\n\\n Sometimes a stolen bag of apples, at the risk of getting hishand sawed off. In grocery stores, he carefully pocketed cannedravioli, which they split five ways, Zalmai getting the lion\u0027sshare. They ate raw turnips sprinkled with salt. Limp leaves oflettuce and blackened bananas for dinner. \\n\\n Death from starvation suddenly became a distinct possibility. \\n\\n Some chose not to wait for it. Mariam heard of aneighborhood widow who had ground some dried bread, lacedit with rat poison, and fed it to all seven of her children. Shehad saved the biggest portion for herself. \\n\\n Aziza\u0027s ribs began to push through the skin, and the fat fromher cheeks vanished. Her calves thinned, and her complexionturned the color of weak tea. When Mariam picked her up,she could feel her hip bone poking through the taut skin. \\n\\n Zalmai lay around the house, eyes dulled and half closed, or inhis father\u0027s lap limp as a rag. He cried himself to sleep, whenhe could muster the energy, but his sleep was fitful andsporadic. White dots leaped before Mariam\u0027s eyes whenever shegot up. Her head spun, and her ears rang all the time. Sheremembered something Mullah Faizullah used to say abouthunger when Ramadan started:Even the snakebiiien man findssleep, but not the hungry. \\n\\n \"My children are going to die,\" Laila said. \"Right before myeyes.\"\"They are not,\" Mariam said. \"I won\u0027t let them. It\u0027s going tobe all right, Laila jo. I know what to do.\"* * *One blistering-hot day, Mariam put on her burqa, and sheand Rasheed walked to the Intercontinental Hotel. Bus fare wasan un-affordable luxury now, and Mariam was exhausted bythe time they reached the top of the steep hill. Climbing theslope, she was struck by bouts of dizziness, and twice she hadto stop, wait for it to pass. \\n\\n At the hotel entrance, Rasheed greeted and hugged one ofthe doormen, who was dressed in a burgundy suit and visorcap. There was some friendly-looking talk between them. \\n\\n Rasheed spoke with his hand on the doorman\u0027s elbow. Hemotioned toward Mariam at one point, and they both lookedher way briefly. Mariam thought there was something vaguelyfamiliar about the doorman. \\n\\n When the doorman went inside, Mariam and Rasheed waited. \\n\\n From this vantage point, Mariam had a view of the PolytechnicInstitute, and, beyond that, the old Khair khana district and theroad to Mazar. To the south, she could see the bread factory,Silo, long abandoned, its pale yellow fa9ade pocked withyawning holes from all the shelling it had endured. Farthersouth, she could make out the hollow ruins of DarulamanPalace, where, many years back, Rasheed had taken her for apicnic. The memory of that day was a relic from a past thatno longer seemed like her own. \\n\\n Mariam concentrated on these things, these landmarks. Shefeared she might lose her nerve if she let her mind wander. \\n\\n Every few minutes, jeeps and taxis drove up to the hotelentrance. Doormen rushed to greet the passengers, who wereall men, armed, bearded, wearing turbans, all of them steppingout with the same self-assured, casual air of menace. Mariamheard bits of their chatter as they vanished through the hotel\u0027sdoors. She heard Pashto and Farsi, but Urdu and Arabic too. \\n\\n \"Meet ourreal masters,\" Rasheed said in a low-pitched voice. \\n\\n \"Pakistani and Arab Islamists. The Taliban are puppets.Theseare the big players and Afghanistan is their playground.\"Rasheed said he\u0027d heard rumors that the Taliban wereallowing these people to set up secret camps all over thecountry, where young men were being trained to becomesuicide bombers and jihadi fighters. \\n\\n \"What\u0027s taking him so long?\" Mariam said. \\n\\n Rasheed spat, and kicked dirt on the spit. \\n\\n An hour later, they were inside, Mariam and Rasheed,following the doorman. Their heels clicked on the tiled floor asthey were led across the pleasantly cool lobby. Mariam saw twomen sitting on leather chairs, rifles and a coffee table betweenthem, sipping black tea and eating from a plate ofsyrup-coatedjelabi, rings sprinkled with powdered sugar. Shethought of Aziza, who lovedjelabi, and tore her gaze away. \\n\\n The doorman led them outside to a balcony. From his pocket,he produced a small black cordless phone and a scrap ofpaper with a number scribbled on it. He told Rasheed it washis supervisor\u0027s satellite phone. \\n\\n \"I got you five minutes,\" he said. \"No more.\"\"Tashakor,\"Rasheed said. \"I won\u0027t forget this.\"The doorman nodded and walked away. Rasheed dialed. Hegave Mariam the phone. \\n\\n As Mariam listened to the scratchy ringing, her mindwandered. It wandered to the last time she\u0027d seen Jalil, thirteenyears earlier, back in the spring of 1987. He\u0027d stood on thestreet outside her house, leaning on a cane, beside the blueBenz with the Herat license plates and the white stripe bisectingthe roof, the hood, and trunk. He\u0027d stood there for hours,waiting for her, now and then calling her name, just as shehad once calledhis name outsidehis house. Mariam had partedthe curtain once, just a bit, and caught a glimpse of him. Onlya glimpse, but long enough to see that his hair had turnedfluffy white, and that he\u0027d started to stoop. He wore glasses, ared tie, as always, and the usual white handkerchief triangle inhis breast pocket. Most striking, he was thinner, much thinner,than she remembered, the coat of his dark brown suitdrooping over his shoulders, the trousers pooling at his ankles. \\n\\n Jalil had seen her too, if only for a moment. Their eyes hadmet briefly through a part in the curtains, as they had metmany years earlier through a part in another pair of curtains. \\n\\n But then Mariam had quickly closed the curtains. She had saton the bed, waited for him to leave. \\n\\n She thought now of the letter Jalil had finally left at her door. \\n\\n She had kept it for days, beneath her pillow, picking it up nowand then, turning it over in her hands. In the end, she hadshredded it unopened. \\n\\n And now here she was, after all these years, calling him. \\n\\n Mariam regretted her foolish, youthful pride now. She wishednow that she had let him in. What would have been the harmto let him in, sit with him, let him say what he\u0027d come to say? \\n\\n He was her father. He\u0027d not been a good father, it was true,but how ordinary his faults seemed now, how forgivable, whencompared to Rasheed\u0027s malice, or to the brutality and violencethat she had seen men inflict on one another. \\n\\n She wished she hadn\u0027t destroyed his letter. \\n\\n A man\u0027s deep voice spoke in her ear and informed her thatshe\u0027d reached the mayor\u0027s office in Herat. \\n\\n Mariam cleared her throat.\"Salaam, brother, I am looking forsomeone who lives in Herat. Or he did, many years ago. Hisname is Jalil Khan. He lived in Shar-e-Nau and owned thecinema. Do you have any information as to his whereabouts?\"The irritation was audible in the man\u0027s voice. \"This is whyyoucall the mayor\u0027s office?\"Mariam said she didn\u0027t know who else to call. \"Forgive me,brother. I know you have important things to tend to, but it islife and death, a question of life and death I am calling about.\"\"I don\u0027t know him. The cinema\u0027s been closed for many years.\"\"Maybe there\u0027s someone there who might know him,someone-\"\"There is no one.\"Mariam closed her eyes. \"Please, brother. There are childreninvolved. Small children.\"A long sigh. \\n\\n \"Maybe someone there-\"\"There\u0027s a groundskeeper here. I think he\u0027s lived here all ofhis life.\"\"Yes, ask him, please.\"\"Call back tomorrow.\"Mariam said she couldn\u0027t. \"I have this phone for five minutesonly. I don\u0027t-\"There was a click at the other end, and Mariam thought hehad hung up. But she could hear footsteps, and voices, adistant car horn, and some mechanical humming punctuated byclicks, maybe an electric fan. She switched the phone to herother ear, closed her eyes. \\n\\n She pictured Jalil smiling, reaching into his pocket. \\n\\n Ah. Of course. Well Here then. Without Juriher ado…A leaf-shaped pendant, tiny coins etched with moons and starshanging from it. \\n\\n Try it on, Mariam jo. \\n\\n What do you think? \\n\\n Ithink you look like a queen. \\n\\n A few minutes passed. Then footsteps, a creaking sound, anda click. \"He does know him.\"\"He does?\"\"It\u0027s what he says.\"\"Where is he?\" Mariam said. \"Does this man know where JalilKhan is?\"There was a pause. \"He says he died years ago, back in1987.\"Mariam\u0027s stomach fell. She\u0027d considered the possibility, ofcourse. Jalil would have been in his mid-to late seventies bynow, but…1987. \\n\\n He was dying then. He had driven all the way from Herat tosay good-bye. \\n\\n She moved to the edge of the balcony. From up here, shecould see the hotel\u0027s once-famous swimming pool, empty andgrubby now, scarred by bullet holes and decaying tiles. Andthere was the battered tennis court, the ragged net lying limplyin the middle of it like dead skin shed by a snake. \\n\\n \"I have to go now,\" the voice at the other end said\"I\u0027m sorry to have bothered you,\" Mariam said, weepingsoundlessly into the phone. She saw Jalil waving to her,skipping from stone to stone as he crossed the stream, hispockets swollen with gifts. All the times she had held herbreath for him, for God to grant her more time with him. \\n\\n \"Thank you,\" Mariam began to say, but the man at the otherend had already hung up. \\n\\n Rasheed was looking at her. Mariam shook her head. \\n\\n \"Useless,\" he said, snatching the phone from her. \"Likedaughter, like father.\"On their way out of the lobby, Rasheed walked briskly to thecoffee table, which was now abandoned, and pocketed the lastringof jelabi. He took it home and gave it to Zalmai. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1838/53260.html","bookId":1002,"book":{"id":1002,"title":"A Thousand Splendid Suns 灿烂千阳","description":"简介： 《灿烂千阳》再次以阿富汗战乱为背景，时空跨越三十年，用细腻感人的笔触描绘了阿富汗旧家族制度下苦苦挣扎的妇女，她们所怀抱的希望、爱情、梦想与所有的失落。《灿烂千阳》一书的主人公玛丽雅姆在阿富汗一个偏远贫穷的地方长大，她想上学，母亲却告诫她：学校怎么会教...","cover":"http://novel.tingroom.com/file/upload/201707/19/14-14-15-92-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1838","creation":"Aug 1, 2019 12:24:08 AM","modification":"Aug 1, 2019 12:24:08 AM"}}
