{"id":9875,"no":42,"title":"Chapter 42.","content":"LailaIn a paper bag, Aziza packed these things: her flowered shirtand her lone pair of socks, her mismatched wool gloves, anold, pumpkin-colored blanket dotted with stars and comets, asplintered plastic cup, a banana, her set of dice-It was a coolmorning in April 2001, shortly before Laila\u0027s twenty-thirdbirthday. The sky was a translucent gray, and gusts of aclammy, cold wind kept rattling the screen door. \n This was a few days after Laila heard that Ahmad ShahMassoud had gone to France and spoken to the EuropeanParliament. Massoud was now in his native North, and leadingthe Northern Alliance, the sole opposition group still fighting theTaliban. In Europe, Massoud had warned the West aboutterrorist camps in Afghanistan, and pleaded with the U.S. tohelp him fight the Taliban. \n \"If President Bush doesn\u0027t help us,\" he had said, \"theseterrorists will damage the U.S. and Europe very soon.\"A month before that, Laila had learned that the Taliban hadplanted TNT in the crevices of the giant Buddhas in Bamiyanand blown them apart, calling them objects of idolatry and sin. \n There was an outcry around the world, from the U.S. toChina. Governments, historians, and archaeologists from all overthe globe had written letters, pleaded with the Taliban not todemolish the two greatest historical artifacts in Afghanistan. Butthe Taliban had gone ahead and detonated their explosivesinside the two-thousand-year-old Buddhas. They hadchantedAllah-u-akbar with each blast, cheered each time thestatues lost an arm or a leg in a crumbling cloud of dust. Lailaremembered standing atop the bigger of the two Buddhas withBabi and Tariq, back in 1987, a breeze blowing in their sunlitfaces, watching a hawk gliding in circles over the sprawlingvalley below. But when she heard the news of the statues\u0027 \n demise, Laila was numb to it. It hardly seemed to matter. Howcould she care about statues when her own life was crumblingdust? \n Until Rasheed told her it was time to go, Laila sat on thefloor in a comer of the living room, not speaking andstone-faced, her hair hanging around her face in straggly curls. \n No matter how much she breathed in and out, it seemed toLaila that she couldn\u0027t fill her lungs with enough air. \n * * *On the way to Karteh-Seh, Zalmai bounced in Rasheed\u0027s arms,and Aziza held Mariam\u0027s hand as she walked quickly besideher. The wind blew the dirty scarf tied under Aziza\u0027s chin andrippled the hem of her dress. Aziza was more grim now, asthough she\u0027d begun to sense, with each step, that she wasbeing duped. Laila had not found the strength to tell Aziza thetruth. She had told her that she was going to a school, aspecial school where the children ate and slept and didn\u0027t comehome after class. Now Aziza kept pelting Laila with the samequestions she had been asking for days. Did the students sleepin different rooms or all in one great big room? Would shemake friends? Was she, Laila, sure that the teachers would benice? \n And, more than once,How long do I have to stay? \n They stopped two blocks from the squat, barracks-stylebuilding. \n \"Zalmai and I will wait here,\" Rasheed said. \"Oh, before Iforget…\"He fished a stick of gum from his pocket, a parting gift, andheld it out to Aziza with a stiff, magnanimous air. Aziza took itand muttered a thank-you. Laila marveled at Aziza\u0027s grace,Aziza\u0027s vast capacity for forgiveness, and her eyes filled. Herheart squeezed, and she was faint with sorrow at the thoughtthat this afternoon Aziza would not nap beside her, that shewould not feel the flimsy weight of Aziza\u0027s arm on her chest,the curve of Aziza\u0027s head pressing into her ribs, Aziza\u0027s breathwarming her neck, Aziza\u0027s heels poking her belly. \n When Aziza was led away, Zalmai began wailing, crying, Ziza! \n Ziza! He squirmed and kicked in his father\u0027s arms, called forhis sister, until his attention was diverted by an organ-grinder\u0027smonkey across the street. \n They walked the last two blocks alone, Mariam, Laila, andAziza. As they approached the building, Laila could see itssplintered fa9ade, the sagging roof, the planks of wood nailedacross frames with missing windows, the top of a swing setover a decaying wall. \n They stopped by the door, and Laila repeated to Aziza whatshe had told her earlier. \n \"And if they ask about your father, what do you say?\"\"The Mujahideen killed him,\" Aziza said, her mouth set withwariness. \n \"That\u0027s good. Aziza, do you understand?\"\"Because this is a special school,\" Aziza said Now that theywere here, and the building was a reality, she looked shaken. \n Her lower lip was quivering and her eyes threatened to wellup, and Laila saw how hard she was struggling to be brave. \n \"If we tell the truth,\" Aziza said in a thin, breathless voice,\"they won\u0027t take me. It\u0027s a special school. I want to go home.\"\"I\u0027ll visit all the time,\" Laila managed to say. \"I promise.\"\"Me too,\" said Mariam. \"We\u0027ll come to see you, Aziza jo, andwe\u0027ll play together, just like always. It\u0027s only for a while, untilyour father finds work.\"\"They have food here,\" Laila said shakily. She was glad forthe burqa, glad that Aziza couldn\u0027t see how she was fallingapart inside it. \"Here, you won\u0027t go hungry. They have riceand bread and water, and maybe even fruit.\"\"Butyouwon\u0027t be here. And Khala Mariam won\u0027t be with me.\"\"I\u0027ll come and see you,\" Laila said. \"All the time. Look at me,Aziza. I\u0027ll come and see you. I\u0027m your mother. If it kills me, I\u0027llcome and see you.\"* * *The orphanage director was a stooping, narrow-chested manwith a pleasantly lined face. He was balding, had a shaggybeard, eyes like peas. His name was Zaman. He wore askullcap. The left lens of his eyeglasses was chipped. \n As he led them to his office, he asked Laila and Mariam theirnames, asked for Aziza\u0027s name too, her age. They passedthrough poorly lit hallways where barefoot children steppedaside and watched They had disheveled hair or shaved scalps. \n They wore sweaters with frayed sleeves, ragged jeans whoseknees had worn down to strings, coats patched with duct tape. \n Laila smelled soap and talcum, ammonia and urine, and risingapprehension in Aziza, who had begun whimpering. \n Laila had a glimpse of the yard: weedy lot, rickety swing set,old tires, a deflated basketball. The rooms they passed werebare, the windows covered with sheets of plastic. A boy dartedfrom one of the rooms and grabbed Laila\u0027s elbow, and tried toclimb up into her arms. An attendant, who was cleaning upwhat looked like a puddle of urine, put down his mop andpried the boy off. \n Zaman seemed gently proprietary with the orphans. He pattedthe heads of some, as he passed by, said a cordial word ortwo to them, tousled their hair, without condescension. Thechildren welcomed his touch. They all looked at him, Lailathought, in hope of approval. \n He showed them into his office, a room with only threefolding chairs, and a disorderly desk with piles of paperscattered atop it. \n \"You\u0027re from Herat,\" Zaman said to Mariam. \"I can tell fromyour accent.\"He leaned back in his chair and laced his hands over hisbelly, and said he had a brother-in-law who used to live there. \n Even in these ordinary gestures, Laila noted a laborious qualityto his movements. And though he was smiling faintly, Lailasensed something troubled and wounded beneath,disappointment and defeat glossed over with a veneer of goodhumor. \n \"He was a glassmaker,\" Zaman said. \"He made thesebeautiful, jade green swans. You held them up to sunlight andthey glittered inside, like the glass was filled with tiny jewels. \n Have you been back?\"Mariam said she hadn\u0027t. \n \"I\u0027m from Kandahar myself. Have you ever been toKandahar,hamshira1? No? It\u0027s lovely. What gardens! And thegrapes! Oh, the grapes. They bewitch the palate.\"A few children had gathered by the door and were peekingin. Zaman gently shooed them away, in Pashto. \n \"Of course I love Herat too. City of artists and writers, Sufisand mystics. You know the old joke, that you can\u0027t stretch aleg in Herat without poking a poet in the rear.\"Next to Laila, Aziza snorted. \n Zaman feigned a gasp. \"Ah, there. I\u0027ve made you laugh,littlehamshira. That\u0027s usually the hard part. I was worried, there,for a while. I thought I\u0027d have to cluck like a chicken or braylike a donkey. But, there you are. And so lovely you are.\"He called in an attendant to look after Aziza for a fewmoments. Aziza leaped onto Mariam\u0027s lap and clung to her. \n \"We\u0027re just going to talk, my love,\"Laila said. \"I\u0027ll be righthere. All right? Right here.\"\"Why don\u0027t we go outside for a minute, Aziza jo?\" Mariamsaid. \"Your mother needs to talk to Kaka Zaman here.Just fora minute. Now, come on.\"When they were alone, Zaman asked for Aziza\u0027s date of birth,history of illnesses, allergies. He asked about Aziza\u0027s father, andLaila had the strange experience of telling a lie that was reallythe truth. Zaman listened, his expression revealing neither beliefnor skepticism. He ran the orphanage on the honor system, hesaid. If ahamshira said her husband was dead and she couldn\u0027tcare for her children, he didn\u0027t question it. \n Laila began to cry. \n Zaman put down his pen. \n \"I\u0027m ashamed,\" Laila croaked, her palm pressed to her mouth. \n \"Look at me,hamshira \"\"What kind of mother abandons her own child?\"\"Look at me.\"Laila raised her gaze. \n \"It isn\u0027t your fault. Do you hear me? Not you. It\u0027sthosesavages, thosewahshis, who are to blame. They bringshame on me as a Pashtun. They\u0027ve disgraced the name ofmy people. And you\u0027re not alone,hamshira We get mothers likeyou all the time-all the time-mothers who come here who can\u0027tfeed their children because the Taliban won\u0027t let them go outand make a living. So you don\u0027t blame yourself. No one hereblames you. I understand.\" He leaned forward.\"Hamshira Iunderstand.\"Laila wiped her eyes with the cloth of her burqa. \n \"As for this place,\" Zaman sighed, motioning with his hand,\"you can see that it\u0027s in dire state. We\u0027re always underfunded,always scrambling, improvising. We get little or no support fromthe Taliban. But we manage. Like you, we do what we have todo. Allah is good and kind, and Allah provides, and, as longHe provides, I will see to it that Aziza is fed and clothed. Thatmuch I promise you.\"Laila nodded. \n \"All right?\"He was smiling companionably. \"But don\u0027t cry,hamshira Don\u0027tlet her see you cry.\"Laila wiped her eyes again. \"God bless you,\" she said thickly. \n \"God bless you, brother.\"***But \"when the time for good-byes came, the scene eruptedprecisely as Laila had dreaded. \n Aziza panicked. \n All the way home, leaning on Mariam, Laila heard Aziza\u0027sshrill cries. In her head, she saw Zaman\u0027s thick, callousedhands close around Aziza\u0027s arms; she saw them pull, gently atfirst, then harder, then with force to pry Aziza loose from her. \n She saw Aziza kicking in Zaman\u0027s arms as he hurriedly turnedthe corner, heard Aziza screaming as though she were aboutto vanish from the face of the earth. And Laila saw herselfrunning down the hallway, head down, a howl rising up herthroat. \n \"I smell her,\" she told Mariam at home. Her eyes swamunseeingly past Mariam\u0027s shoulder, past the yard, the walls, tothe mountains, brown as smoker\u0027s spit. \"I smell her sleep smell. \n Do you? Do you smell it?\"\"Oh, Laila jo,\" said Mariam. \"Don\u0027t. What good is this? Whatgood?\"* * *At first, Rasheed humored Laila, and accompanied them-her,Mariam, and Zalmai-to the orphanage, though he made sure,as they walked, that she had an eyeful of his grievous looks,an earful of his rants over what a hardship she was puttinghim through, how badly his legs and back and feet achedwalking to and from the orphanage. He made sure she knewhow awfully put out he was. \n \"I\u0027m not a young man anymore,\" he said. \"Not that you care. \n You\u0027d run me to the ground, if you had your way. But youdon\u0027t, Laila. You don\u0027t have your way.\"They parted ways two blocks from the orphanage, and henever spared them more than fifteen minutes. \"A minute late,\"he said, \"and I start walking. I mean it.\"Laila had to pester him, plead with him, in order to spin outthe allotted minutes with Aziza a bit longer. For herself, and forMariam, who was disconsolate over Aziza\u0027s absence, though, asalways, Mariam chose to cradle her own suffering privately andquietly. And for Zalmai too, who asked for his sister every day,and threw tantrums that sometimes dissolved into inconsolablefits of crying. \n Sometimes, on the way to the orphanage, Rasheed stoppedand complained that his leg was sore. Then he turned aroundand started walking home in long, steady strides, without somuch as a limp. Or he clucked his tongue and said, \"It\u0027s mylungs, Laila. I\u0027m short of breath. Maybe tomorrow I\u0027ll feelbetter, or the day after. We\u0027ll see.\" He never bothered to feigna single raspy breath. Often, as he turned back and marchedhome, he lit a cigarette. Laila would have to tail him home,helpless, trembling with resentment and impotent rage. \n Then one day he told Laila he wouldn\u0027t take her anymore. \n \"I\u0027m too tired from walking the streets all day,\" he said,\"looking for work.\"\"Then I\u0027ll go by myself,\" Laila said. \"You can\u0027t stop me,Rasheed. Do you hear me? You can hit me all you want, butI\u0027ll keep going there.\"\"Do as you wish. But you won\u0027t get past the Taliban. Don\u0027tsay I didn\u0027t warn you.\"\"I\u0027m coming with you,\" Mariam said. \n Laila wouldn\u0027t allow it. \"You have to stay home with Zalmai. Ifwe get stopped…Idon\u0027t want him to see.\"And so Laila\u0027s life suddenly revolved around finding ways tosee Aziza. Half the time, she never made it to the orphanage. \n Crossing the street, she was spotted by the Taliban and riddledwith questions-What is your name? Where are you going? Whyare you alone? Where is yourmahram? -before she was senthome. If she was lucky, she was given a tongue-lashing or asingle kick to the rear, a shove in the back. Other times, shemet with assortments of wooden clubs, fresh tree branches,short whips, slaps, often fists. \n One day, a young Talib beat Laila with a radio antenna. \n When he was done, he gave a final whack to the back of herneck and said, \"I see you again, I\u0027ll beat you until yourmother\u0027s milk leaks out of your bones.\"That time, Laila went home. She lay on her stomach, feelinglike a stupid, pitiable animal, and hissed as Mariam arrangeddamp cloths across her bloodied back and thighs. But, usually,Laila refused to cave in. She made as if she were going home,then took a different route down side streets. Sometimes shewas caught, questioned, scolded-two, three, even four times in asingle day. Then the whips came down and the antennas slicedthrough the air, and she trudged home, bloodied, without somuch as a glimpse of Aziza. Soon Laila took to wearing extralayers, even in the heat, two, three sweaters beneath the burqa,for padding against the beatings. \n But for Laila, the reward, if she made it past the Taliban, wasworth it. She could spend as much time as she likedthen-hours,even-with Aziza. They sat in the courtyard, near theswing set, among other children and visiting mothers, andtalked about what Aziza had learned that week. \n Aziza said Kaka Zaman made it a point to teach themsomething every day, reading and writing most days, sometimesgeography, a bit of history or science, something about plants,animals. \n \"But we have to pull the curtains,\" Aziza said, \"so the Talibandon\u0027t see us.\" Kaka Zaman had knitting needles and balls ofyarn ready, she said, in case of a Taliban inspection. \"We putthe books away and pretend to knit.\"One day, during a visit with Aziza, Laila saw a middle-agedwoman, her burqa pushed back, visiting with three boys and agirl. Laila recognized the sharp face, the heavy eyebrows, if notthe sunken mouth and gray hair. She remembered the shawls,the black skirts, the curt voice, how she used to wear herjet-black hair tied in a bun so that you could see the darkbristles on the back of her neck. Laila remembered this womanonce forbidding the female students from covering, sayingwomen and men were equal, that there was no reason womenshould cover if men didn\u0027t. \n At one point, Khala Rangmaal looked up and caught her gaze,but Laila saw no lingering, no light of recognition, in her oldteacher\u0027s eyes. \n * *","sourceLink":"http://novel.tingroom.com/jingdian/1838/53261.html","bookId":1002,"book":{"id":1002,"title":"A Thousand Splendid Suns 灿烂千阳","description":"简介： 《灿烂千阳》再次以阿富汗战乱为背景，时空跨越三十年，用细腻感人的笔触描绘了阿富汗旧家族制度下苦苦挣扎的妇女，她们所怀抱的希望、爱情、梦想与所有的失落。《灿烂千阳》一书的主人公玛丽雅姆在阿富汗一个偏远贫穷的地方长大，她想上学，母亲却告诫她：学校怎么会教...","cover":"http://novel.tingroom.com/file/upload/201707/19/14-14-15-92-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1838","creation":"Aug 1, 2019 12:24:08 AM","modification":"Aug 1, 2019 12:24:08 AM"}}
