{"id":9842,"no":9,"title":"Chapter 9.","content":"It was early evening the following day by the time theyarrived at Rasheed\u0027s house. \\n\\n \"We\u0027re in Deh-Mazang,\" he said. They were outside, on thesidewalk. He had her suitcase in one hand and was unlockingthe wooden front gate with the other. \"In the south and westpart of the city. The zoo is nearby, and the university too.\"Mariam nodded. Already she had learned that, though shecould understand him, she had to pay close attention when hespoke. She was unaccustomed to the Kabuli dialect of his Farsi,and to the underlying layer of Pashto accent, the language ofhis native Kandahar. He, on the other hand, seemed to haveno trouble understanding her Herati Farsi. \\n\\n Mariam quickly surveyed the narrow, unpaved road alongwhich Rasheed\u0027s house was situated. The houses on this roadwere crowded together and shared common walls, with small,walled yards in front buffering them from the street. Most ofthe homes had flat roofs and were made of burned brick,some of mud the same dusty color as the mountains thatringed the city. Gutters separated the sidewalk from the roadon both sides and flowed with muddy water. Mariam saw smallmounds of flyblown garbage littering the street here and there. \\n\\n Rasheed\u0027s house had two stories. Mariam could see that it hadonce been blue. \\n\\n When Rasheed opened the front gate, Mariam found herselfin a small, unkempt yard where yellow grass struggled up inthin patches. Mariam saw an outhouse on the right, in a sideyard, and, on the left, a well with a hand pump, a row ofdying saplings. Near the well was a toolshed, and a bicycleleaning against the wall. \\n\\n \"Your father told me you like to fish,\" Rasheed said as theywere crossing the yard to the house. There was no backyard,Mariam saw. \"There are valleys north of here. Rivers with lotsoffish. Maybe I\u0027ll take you someday.\"He unlocked the front door and let her into the house. \\n\\n Rasheed\u0027s house was much smaller than Jalil\u0027s, but, comparedto Mariam and Nana\u0027skolba, it was a mansion. There was ahallway, a living room downstairs, and a kitchen in which heshowed her pots and pans and a pressure cooker and akeroseneLshiop. The living room had a pistachio green leathercouch. It had a rip down its side that had been clumsily sewntogether. The walls were bare. There was a table, two cane-seatchairs, two folding chairs, and, in the corner, a black, cast-ironstove. \\n\\n Mariam stood in the middle of the living room, lookingaround. At thekolba, she could touch the ceiling with herfingertips. She could lie in her cot and tell the time of day bythe angle of sunlight pouring through the window. She knewhow far her door would open before its hinges creaked. Sheknew every splinter and crack in each of the thirty woodenfloorboards. Now all those familiar things were gone. Nana wasdead, and she was here, in a strange city, separated from thelife she\u0027d known by valleys and chains of snow-cappedmountains and entire deserts. She was in a stranger\u0027s house,with all its different rooms and its smell of cigarette smoke,with its unfamiliar cupboards full of unfamiliar utensils, itsheavy, dark green curtains, and a ceiling she knew she couldnot reach. The space of it suffocated Mariam. Pangs of longingbore into her, for Nana, for Mullah Faizullah, for her old life. \\n\\n Then she was crying. \\n\\n \"What\u0027s this crying about?\" Rasheed said crossly. He reachedinto the pocket of his pants, uncurled Mariam\u0027s fingers, andpushed a handkerchief into her palm. He lit himself a cigaretteand leaned against the wall. He watched as Mariam pressedthe handkerchief to her eyes. \\n\\n \"Done?\"Mariam nodded. \\n\\n \"Sure?\"\"Yes.\"He took her by the elbow then and led her to the living-roomwindow. \\n\\n \"This window looks north,\" he said, tapping the glass with thecrooked nail of his index finger. \"That\u0027s the Asmai mountaindirectly in front of us-see?-and, to the left, is the Ali Abadmountain. The university is at the foot of it. Behind us, east,you can\u0027t see from here, is the Shir Darwaza mountain. Everyday, at noon, they shoot a cannon from it. Stop your crying,now. I mean it.\"Mariam dabbed at her eyes. \\n\\n \"That\u0027s one thing I can\u0027t stand,\" he said, scowling, \"the soundof a woman crying. I\u0027m sorry. I have no patience for it.\"\"I want to go home,\" Mariam said. \\n\\n Rasheed sighed irritably. A puff of his smoky breath hitMariam\u0027s face. \"I won\u0027t take that personally. This time.\"Again, he took her by the elbow, and led her upstairs. \\n\\n There was a narrow, dimly lit hallway there and twobedrooms. The door to the bigger one was ajar. Through itMariam could see that it, like the rest of the house, wassparsely furnished: bed in the corner, with a brown blanketand a pillow, a closet, a dresser. The walls were bare exceptfor a small mirror. Rasheed closed the door. \\n\\n \"This is my room.\"He said she could take the guest room. \"I hope you don\u0027tmind. I\u0027m accustomed to sleeping alone.\"Mariam didn\u0027t tell him how relieved she was, at least aboutthis. \\n\\n The room that was to be Mariam\u0027s was much smaller thanthe room she\u0027d stayed in at Jalil\u0027s house. It had a bed, an old,gray-brown dresser, a small closet. The window looked into theyard and, beyond that, the street below. Rasheed put hersuitcase in a corner. \\n\\n Mariam sat on the bed. \\n\\n \"You didn\u0027t notice,\" he said He was standing in the doorway,stooping a little to fit. \\n\\n \"Look on the windowsill. You know what kind they are? I putthem there before leaving for Herat.\"Only now Mariam saw a basket on the sill. White tuberosesspilled from its sides. \\n\\n \"You like them? They please you?\"\"Yes.\"\"You can thank me then.\"\"Thank you. I\u0027m sorry.Tashakor -\"\"You\u0027re shaking. Maybe I scare you. Do I scare you? Are youfrightened of me?\"Mariam was not looking at him, but she could hear somethingslyly playful in these questions, like a needling. She quicklyshook her head in what she recognized as her first lie in theirmarriage. \\n\\n \"No? That\u0027s good, then. Good for you. Well, this is your homenow. You\u0027re going to like it here. You\u0027ll see. Did I tell you wehave electricity? Most days and every night?\"He made as if to leave. At the door, he paused, took a longdrag, crinkled his eyes against the smoke. Mariam thought hewas going to say something. But he didn\u0027t. He closed the door,left her alone with her suitcase and her flowers. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1838/53228.html","bookId":1002,"book":{"id":1002,"title":"A Thousand Splendid Suns 灿烂千阳","description":"简介： 《灿烂千阳》再次以阿富汗战乱为背景，时空跨越三十年，用细腻感人的笔触描绘了阿富汗旧家族制度下苦苦挣扎的妇女，她们所怀抱的希望、爱情、梦想与所有的失落。《灿烂千阳》一书的主人公玛丽雅姆在阿富汗一个偏远贫穷的地方长大，她想上学，母亲却告诫她：学校怎么会教...","cover":"http://novel.tingroom.com/file/upload/201707/19/14-14-15-92-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1838","creation":"Aug 1, 2019 12:24:08 AM","modification":"Aug 1, 2019 12:24:08 AM"}}
