{"id":85175,"no":84,"title":"Page 84","content":"Chapter 87 Marlow We ate dinner at a table near the lobby bar, at the open edge of the building, where we could hear the pounding of the waves barely out of sight and see the fronds of coconut palms streaming past. The afternoon\u0027s breeze had certainly become a wind, tossing and rustling them so that the noise was as persistent as the sound of the ocean, and I thought again of Lord Jim. I asked Mary what she was reading, and she described a contemporary novel I hadn\u0027t heard of, a translation of a young Vietnamese author. My attention wandered from her words to her eyes, strangely hooded in the flicker of our candle, and to her narrow cheekbone. The waiters at the bar were climbing on a stool to light torches in a pair of stone bowls high above the glasses and bottles, so that the bar looked like a sacrificial altar--some designer\u0027s dramatic effect, Mayan or Aztec. I saw that Mary\u0027s attention had wandered, too, although she hadn\u0027t stopped telling me about the boat people in the novel, and I noticed that there was only one other couple having dinner nearby, and three children teasing a scarlet macaw that preened on a perch a few yards away. Tourists came in and out of the wind: a man in a wheelchair with a younger woman pushing it and bending over him to say something, a glossy-haired family strolling around, looking at the flat turquoise fountains, the irritable bird. Watching all this, I felt divided down my center, half of me riveted by Mary\u0027s presence--the pale hair on her arms and the even finer down, nearly invisible, along her cheek in the candlelight-- and half mesmerized by the newness of this place, its smells and echoing spaces, the people passing through... on their way to what pleasures? I had seldom been in a place constructed completely for pleasure; my parents hadn\u0027t really believed in such experiences, or in spending money on them, and my adult life had revolved almost entirely around work, with the occasional edifying trip or painting excursion. This was different, first of all because of the softness of the wind, the luxury of every surface, the smells of salt and palm, but also because of the absence of ancient architecture or national park, something to study or explore, a justification; it was entirely a place for relaxation. \"This is all to worship the ocean, isn\u0027t it?\" Mary said, and I realized she\u0027d interrupted her description of her reading to finish my own thought. I couldn\u0027t speak; my throat swelled. It was a mere coincidence, our convergent thoughts, but I wanted to lunge across the table and kiss her, almost to weep -- and for what? For the people I knew who were no longer alive and were missing this, maybe, or for everyone who was not me at that moment, not my most fortunate self, with all I seemed to have to look forward to. I nodded, indicating what I hoped was judicious agreement, and we ate in silence. For a few minutes, the flavors of guava and salsa and the delicate fish took up my attention, but I was still watching her, or letting her watch me. I saw myself, as if there were a mirror on the other side of the bar, a little past my prime-- my shoulders broad but slightly stooped, my hair still thick but also beginning to gray, the lines from the well of my nose to the corners of my mouth deepened by the dim light, my middle (under the linen napkin) as trim as I could keep it. I\u0027d lived companion-ably, undemandingly, with this body for a long time, asking of it only that it take me to and from work, that it get some exercise several times a week. I dressed it and washed it, fed it, made it swallow vitamins. In an hour or two I would put it in Mary\u0027s hands if she still wanted me to do that. A shiver went over me when I thought of this, first of pleasure: her fingers on my neck, between my legs, my hands on her breasts, which I knew only by their shadowy outline in her blouse. Then a shiver of shame: my years exposed under a bedside light, my long absence from love, my sudden possible failure, her disappointment. I had to force the thought of Kate out of my mind, and the thought of Robert, lying on top of each of them, Kate and Mary. What was I doing here, with a second of his women? But she was something different for me now; she was herself. How could I not have been there with her? \"Oh God,\" I said aloud. Mary glanced up at me with her fork to her lips, startled, her sheet of hair slipping forward over one shoulder. \"Nothing,\" I said. She, calm, unquestioning, drank water. I silently blessed her for not being the sort of woman who demands of you constantly, \"What are you thinking?\" Then it occurred to me that I was highly paid to ask people exactly that question all day--I smiled in spite of myself. She was watching me, clearly puzzled, but didn\u0027t speak. She was, I felt with a wave of affection, a person who did not even want to know everything. She carried her own sphere around her, her beautiful diffidence. After dinner we went upstairs together without speaking, as if words had been swept away from us; I couldn\u0027t bring myself to look at her during the seconds it took me to unlock the door of our room. I wondered if I should wait in the hall while she used the room or the bathroom, and then decided that it would be more awkward to ask if she\u0027d like me to stay outside than it would to go in with her. So I followed her into our shared space and lay down fully dressed on the bed with a leftover Washington Post while she took a shower behind the closed bathroom door. When she came out, she was wearing one of the bathrobes provided by the hotel, white and thick, with the fan of her wet hair across it. Her face and neck were flushed. We both stayed very still, staring at each other. \"I\u0027ll take a shower, too,\" I said, trying to fold my newspaper and then trying to set it normally on the bed. \"All right,\" she agreed. Her voice was tight and distant. She regrets this, I thought. She regrets having agreed to come, putting herself into this situation with me. She feels trapped now. And I felt suddenly harsh--too bad; we were both there and we had to go through with it, make the best of it. I got up without attempting to speak to her again and took off my shoes and socks; my feet looked dismally skinny against the pale carpet. I got my toilet kit out of my suitcase while she moved to the corner of the room to let me pass into the bathroom. Why had I ever thought this would work? I shut the door quietly behind me. The man in the mirror probably had one other thing wrong with him: he was not Robert Oliver. Well, Robert could go to hell, too. I took off my clothes, forcing myself not to look away from the patch of silver moss between my breasts. At least I had kept my shape, my running muscles, but she would never feel them now. No need, after all, to go through with anything. There was no reversing Mary\u0027s history. I had been foolish to think of trying. I washed myself under the beating shower with water so hot it hurt, soaping my genitals, although she probably wouldn\u0027t be touching them. I shaved my middle-aged chin carefully in the mirror and put on the second hotel bathrobe. (\"If you love our robe, you can take one home! Ask of the hotel shop in the lobby\" -- and then a heart-stopping price in pesos.) I brushed my teeth and combed my toweled hair. It was also not possible late in life to let anyone else in, not in a serious way; that was clear. I began to wonder how either of us would get any sleep after not making love. I might still be able to request a single room for myself--I would leave the double bed to her and take my suitcase with me, let her rest in privacy and comfort. I hoped we could settle this division of rooms, and whatever it meant, without a quarrel, with dignity and civility. I would tell her at the right point that I\u0027d certainly understand if she chose to leave Acapulco early. When I had arranged this with myself and gripped one of my hands into a fist for a second or two, to still my breathing, I was able to open the bathroom door with regret only at leaving my steamy haven to begin such a conversation. To my surprise, the room was dark. For a moment, I thought she must have settled the matter herself by moving to another room, and then I saw a form glimmering white in one corner--she was sitting on the edge of the bed, just out of reach of the light from the bathroom. Her hair was as dark as the room, and the lines of her naked body were blurred. I turned out the bathroom light with frozen fingers and took two steps toward her before I thought to remove my own bathrobe. I dropped it over the desk chair, or where I thought the chair was, and reached her in a few hesitant steps. Even then, I wasn\u0027t sure enough to put my hands out toward her, but I felt her rise to meet me, so that the warmth of her breath came close to my mouth and the warmth of her skin was against me. I had been chilled, I realized. I had been chilled for years. Her hands came down like two birds on my cold, bare shoulders. Then she was slowly filling all the other deficits--my speechless mouth, the hollow space in my breast, my empty hands. I first began to draw human anatomy in a course with George Bo, at the Art League School--over a long period, I took that course twice and then one on painting the human body, because I realized that the portraits I was trying to paint would never improve unless I learned the muscles under the face, neck, arms, hands. In class, we did draw muscles, endlessly, but over them we finally put skin--over those long, smooth lines, over the muscles that make us walk and bend and reach, we drew skin. There is so much that even an observant person doesn\u0027t know about the body, so much hidden inside all of us. I wondered, when I began to study anatomy as an artist, years after I\u0027d studied it for medicine, if this new perspective would make flesh clinical for me once again. It didn\u0027t, of course. Knowing the muscles that cause the dimple on each side of the base of the spine has not diminished my wish to caress that dimple, and the same is true for the way the spine itself makes an exquisite long division of the back. I can draw the muscles that give the waist its supple bend to each side, although I don\u0027t need them in most of my portraits, because I like to show my subjects from the breastbone up, to concentrate on shoulders and face. But I know that bone well, too, and the muscles that radiate from it, and the smooth hook and curl of the collarbone, and the smooth flesh in between. When I need to, I can draw correctly the ripple in the strong supporting thigh, the long reach from knee to buttock, the firm swell toward the inside of the leg. The painter shows muscles through skin, through clothing, but he or she depicts something else as well, something both elusive and immutable: the warmth of the body, its heat and pulsing reality, life. And, by extension, its movements, its soft sounds, the tide of feeling that rises and floods us when we are loved enough to forget ourselves. Sometime close to morning, Mary put her head against my neck and slept; and I, cradling all of her in my previously empty arms, slept instantly, too, with my cheek against her hair. Chapter 88 1879 That evening, in her candlelit room, she stares at a book until late, unseeing, uncomprehending. When the clock downstairs strikes midnight, she brushes out her hair and hangs her clothes on the hooks in the wardrobe. She pulls on her second nightgown--the best one, with its tiny ruffles at throat and wrists, its million tucks covering her breasts -- and ties her dressing gown over it. She washes her face and hands in the basin, puts on her silent and gold-embroidered slippers, takes her key, and blows out the candle. She kneels by the bed and says a short prayer, a memorial to the grace she is leaving, asking in advance for forgiveness. Perversely, it is Zeus she sees when her eyes are closed. Her door does not creak. When she tries his at the end of the hall, she finds it unlocked, which makes her heart pound from certainty; she closes it behind her with infinite quiet and locks it. He has been reading, too, in the chair by his curtained window, one candle on the desk. His face is old, with a sudden look of skull in the frugal light, and she fights an urge to turn back to her room. Then his eyes meet hers, and they are sober, soft. He is wearing a scarlet dressing gown she has never seen. He closes his book, blows out the candle, and rises to open the curtains a little; she understands that now they can see each other at least vaguely in the gaslight seeping off the street, without being observed from outside. She has not moved. He comes to her, putting his hands gently on her shoulders. He searches for her gaze in the dimness. \"My dearest,\" he whispers. Then her name. He kisses her mouth, beginning at one corner. Through her fright and doubt, a vista opens, a road in sunlight, someplace he must have walked years before she knew him, possibly years before she was born, a road leading out under sycamores. He kisses her lips, a fraction at a time. She puts her hands on his shoulders in return, and his bones are knobby under the silk, the mechanics of a well-built clock, a branch on a stately tree. He is drinking from her mouth, tasting the youth in it, telling into the hollow inside her the things love has taught him decades before this, dropping a tiny stone into the well. When she is panting, he stands straight, unbuttons her nightgown from the topmost pearl, and slips his cupping, tender hand inside it, brushes it back over her shoulders, lets it fall around her to the floor. For a moment she fears this is merely another anatomy lesson for him, man of the world, old master of the brush, friend of models. But then he touches her mouth with one hand and reaches slowly down with the other, and she catches the shine, the tracks of salt water on his face. He is the one shedding a skin, not she; he is the one she will comfort in her arms until almost morning. Chapter 89 Marlow Caillet lived in a house overlooking the Bay of Acapulco, on a terraced street high above the sweep of water. It was one of a neighborhood of elegant adobe houses crowded among oleanders, and of stucco walls ornamented with bougainvillea. The bell was answered by a man with a mustache and a white coat like a waiter\u0027s. Inside Caillet\u0027s gate, another man, this one in brown shirt and trousers, was carefully watering the grass and an orange tree. There were birds in the branches and roses climbing the shutters of the house. Mary, standing beside me in her long skirt and pale blouse, was looking around--at the colors, I knew--alert as a cat, her hand unabashedly in mine. I\u0027d called Caillet this morning to be certain he was expecting me, and added that I hoped he wouldn\u0027t mind if I brought along my painter friend, to which he assented gravely. His voice on the phone was mellow and deep, with an accent I thought might be French. Now the door among the flowers opened, and a man came out to greet us--Caillet himself, I thought immediately. He was not tall, but his presence was distinct. He wore a black Nehru jacket over a deep-blue shirt, and he held a burning cigar in one hand, so that the smoke rose around him in the doorway. His hair was white and thick, brushy, his skin brick-colored, as if the Mexican sun had made him mysteriously ill over the years. Up close, his smile was genuine, his dark eyes faded. We shook hands. \"Good morning,\" he said in that same baritone, and kissed Mary\u0027s hand, but matter-of-factly. Then he held the door for us. The interior of the house was very cool--air-conditioned and with thick walls. Caillet led us from the low-ceilinged hall through brightly painted doorways and into a large, spreading room with columns. There I found myself gazing around in astonishment at paintings whose quality leapt out from every wall. The furniture was modern and unobtrusive, incidental, but those paintings hung four or five in a row, from waist-level to ceiling, a kaleidoscope. They spanned a wide range of styles and eras, from a few canvases that looked like seventeenth-century Dutch or Flemish to abstract forms and a disturbing portrait I felt sure was an Alice Neel. But the dominant theme was Impressionism: sunny fields, gardens, poplars, water. It was as if we\u0027d stepped across a threshold dividing Mexico from France, into a different light. Of course, some of the paintings around us could have been from nineteenth-century England or California, but at first glance I felt we were seeing Caillet\u0027s heritage, places he himself might have known and wandered through; perhaps that was one reason he\u0027d collected these images. I heard a movement from Mary; she had turned away and was standing in front of a large canvas next to the door where we\u0027d entered. It showed a winter scene, snow, the bank of a river, bushes gold under the creamy weight, the surface of water frozen to a silver patina with pale olive patches of open water, the familiar strokes and layers, white that was not white, gold, lavender, the heavy black name and date in the lower right-hand corner. A Monet. I looked around at Caillet, who stood calmly next to his minimalist sofa, smoke from his cigar drifting (shockingly) across all these treasures. \"Yes,\" he said, although I hadn\u0027t asked. \"I bought it in Paris in nineteen fifty-four.\" His accent was harsh, the voice under it rich and gentle. \"It was very expensive, even then. But I do not regret it even one minute.\" He gestured for us to sit down with him on the pale-gray linen. There was a glass table in their midst, which held some blooming prickly plant and a book of paintings: Antoine et Pedro Caillet: Une Retrospective Double. The glossy cover showed two vertical paintings, deeply different from each other in form and color but reproduced side by side in a forced diptych; I recognized in them the styles of some of the abstract paintings in the room. I yearned to pick the book up and turn through it but didn\u0027t want to presume, and now the man in the white jacket was bringing in a tray laden with glasses and pitchers--ice, limes, orange juice, a bottle of sparkling water, a spray of white flowers. Caillet mixed the refreshments for us himself. He had begun to seem to me almost as silent as Robert Oliver, but he handed a spray of flowers to Mary--\"For you to paint, young lady.\" I expected her to bristle, as she would have had I said such a thing to her. She smiled instead, and caressed the flowers in her dark-draped lap. Caillet tapped cigar ash into a glass bowl on the glass table. He waited while his man closed the shutters on one side of the room, extinguishing half the paintings. Finally, he turned to us and spoke. \"You would like to know about Beatrice de Clerval. Yes, I owned some of her early work and--as you may have read -- she had only early work. It is believed that she stopped painting at the age of twenty-eight. You know that Monet painted until he was eighty-six and Renoir until he was seventy-nine. Picasso, of course, worked until he died at ninety-one.\" He gestured to a set of four bullfights behind him. \"Artists keep working, for the most part. So you see that Clerval was a strange case, but then women were not so encouraged. She was very, very gifted. She could have been one of the great ones. She was only a little younger than the first Impressionists--eleven years younger than Monet, for example. Think of that.\" He mashed the stub of his cigar in the glass dish. His nails looked manicured; I had never seen such a perfect hand on an old man, and certainly not on a painter. \"She would have been a major artist, like Morisot and Cassatt, if she had not blocked her own way.\" He settled back again. \"You said you owned some of her work. Do you no longer have it?\" I couldn\u0027t help looking around the cavernous room. Mary was scanning it, too. \"Oh, I have some. I sold most of it in nineteen thirty-six and nineteen thirty-seven to pay off my debts.\" Caillet smoothed his hair back over the top of his head. He did not appear to regret this decision in any way. \"I bought her paintings from Henri Robinson--who is still alive, by the way. In Paris. We have not kept in touch, but I saw his name in a magazine article very recently. He is still writing about literature and furniture and philosophy. Philosophy and bric-a-brac.\" I thought he would have snorted if he had been the sort of man to snort. \"Who is Henri Robinson?\" I asked. Caillet regarded me for a moment, then dropped his gaze to the Christmas cactus, or whatever it was, between us. \"He is a fine critic and art collector, and he was the lover of Aude de Clerval until she died. Beatrice\u0027s daughter. She left him what was surely Beatrice\u0027s greatest painting, .\" I nodded, hoping he would continue, although I hadn\u0027t seen any mention of this work in the material I\u0027d read so far. But Caillet seemed to have fallen into that profound silence again. After a moment, he began to fish in his inner jacket pocket and finally drew out another cigar, this one small and slender, like a child of the first one. A little more searching produced a silver lighter, and his beautifully manicured old hands went through the whole ritual, lighting, cupping. He drew on it, and smoke curled away from him. \"Did you know Aude de Clerval yourself?\" I asked at last. I was beginning to wonder if we would get more than the most rudimentary information from this elegant man. He leaned back again, propping one arm up with the other hand. \"Yes,\" he said. \"Yes, I knew her. She took my lover from me.\" A very long silence followed this meditative statement, during which Caillet smoked slowly and Mary and I, of one accord, did not look at each other. I thought about what to say that would not jeopardize our search and at last fell back on my office manner. \"That must have been very difficult for you.\" Caillet smiled. \"Oh, at the time it was difficult, but that was because I was young and I thought that it mattered. In any case, I liked Aude de Clerval. She was a wonderful woman, in her way, and I believe she made my friend happy. And she also made it possible for him to buy about half my collection, and that made it possible for me and for my brother\"--he indicated the museum catalog on the table--\"to paint. So life arranges things. Aude wanted to have the works by her mother that I had bought, especially The Swan Thieves. I owned that one only a short time -- it came from the sale of the estate of Armand Thomas, the younger brother, in Paris.\" Caillet tapped his cigarillo in the ashtray. \"Aude thought that was her mother\u0027s greatest painting and also her last, although I\u0027m not sure. Everybody was happy, you might say. But Aude died in nineteen sixty-six, so Henri has had to live for years without her. Apparently, Henri and I are both cursed with very long life. He is even older than I, poor man. And Aude was twenty-two years older than he. The queer and the old lady--they were an interesting pair. The heart does not go backward. Only the mind.\" He seemed lost in this for so long that I began to wonder if he was a user of substances other than the tobacco and the tequila, or if he had simply lapsed into the silences of living alone. Mary broke his reverie this time, and her question surprised me. \"Did Aude talk about her mother?\" Caillet glanced at her, his ruddy face alert, remembering. \"Yes, sometimes. I will tell you what I remember, which is not very much. I knew her for only a little time, because after Henri fell in love with her, I left Paris and came here, to Acapulco. I grew up here, you know. My father was a mostly French engineer and my mother was Mexican, a schoolteacher. I remember that Aude said one day that her mother had been a great artist all of her life. \u0027No one stops being an artist,\u0027 she said to us. And I argued with her that a painter who stops painting is no longer a painter. It is the act of painting that matters. Yes, we were sitting in a cafe in the rue Pigalle. Another time she told us that her mother had been her closest friend in life, and Henri actually looked hurt. She was not a painter herself, Aude, and she collected only her mother\u0027s work. She guarded The Swan Thieves jealously after she bought it from me, a tradition poor Henri has continued, I assume, since it has never appeared anywhere and has never been written about, to the best of my knowledge. I think Henri wanted Aude because she was so complete, so finished, so parfaite. She needed no one. He was part English, too--his father\u0027s parents--always a little the outsider, and Aude was absolutely, totally French. And he wanted maybe to show to her that she could have one last friend in life. They went through the war together in terrible deprivation. He was faithful to her until the end. She died slowly.\" Caillet tapped his cigarillo and pointed it to the ceiling in one raised hand. Clearly he could speak at length once he got going. \"Aude was not exactly the beauty her mother had been, to judge by the little Olivier Vignot portrait--I mean, Beatrice de Clerval was a beauty. But Aude was tall, with a very interesting face -- what they call in French \u0027jolie laide,\u0027 ugly one moment and mesmerizing the next. I painted her myself one time, soon after I met her. Henri kept that one. I do not paint portraits often, and I do not trust self-portraits.\" He turned to Mary. \"Do you paint self-portraits, madame?\" \"No,\" she said. Caillet regarded her a moment longer, one cheek resting on his hand, as if she might be an emissary from a tribe he had once studied. Then he smiled again, and his face was so transformed by indulgent kindness that I found myself thinking irrelevantly what a sweet grandfather he might have made--assuming, of course, that he actually wasn\u0027t one. \"You came to see the paintings of Beatrice de Clerval, not a too-talkative old Mexican. Let me show them to you.\"","sourceLink":"https://allnovel.net/the-swan-thieves/page-84.html","bookId":2244,"book":{"id":2244,"title":"The Swan Thieves","description":"Storyline: Psychiatrist Andrew Marlowe has a perfectly ordered life--solitary, perhaps, but full of devotion to his profession and the painting hobby he loves. This order is destroyed when renowned painter Robert Oliver attacks a canvas in the National Gallery of Art and becomes his patient. In response, Marlowe finds himself going beyond his own legal and ethical boundaries to understand the secret that torments this genius, a journey that will lead him into the lives of the women closest to Robert Oliver and toward a tragedy at the heart of French Impressionism. Ranging from American museums to the coast of Normandy, from the late nineteenth century to the late twentieth, from young love to last love, THE SWAN THIEVES is a story of obsession, the losses of history, and the power of art to preserve human hope.","cover":"https://allnovel.net/images/the-swan-thieves.jpg","author":"Elizabeth Kostova","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-swan-thieves.html","creation":"Oct 5, 2019 8:58:30 AM","modification":"Oct 5, 2019 5:02:47 PM"}}
