{"id":85183,"no":92,"title":"Page 92","content":"In the narrow hotel room, I lay down with Zoe\u0027s translation and located the passage:\\n\\n I am a little tired today myself, and can\u0027t settle down to anything but letter writing, although my painting went well yesterday because I have found a good model, Esme, another of my maids; she once told me, shyly, when I asked her whether she knows your own beloved Louveciennes, that hers is the very next village, called Gremiere. Yves says I shouldn\u0027t torment the servants by making them sit for me, but where else could I find such a patient model?\\n\\n In the store next to the hotel, I was able to buy a phone card for the equivalent of twenty dollars--lots of conversation time to the United States--and a road map of France. I\u0027d noticed several phone booths in the Gare de Lyon, across the street, and I strolled up there with the file of letters in my hand, feeling that tremendous building hovering above me, its external sculptures eaten by acid rain. I wished for a moment that I could walk inside and board a steam train, hear it whistle and gasp, ride it out of the station into some world Beatrice would have recognized. But there were only three sleek, space-age TGVs pulled up to the near end of the rail, and the interior echoed with unintelligible departure announcements.\\n\\n I sat down on the first empty bench I could find and opened my map. Louveciennes was west of Paris, if you followed the Seine and the footsteps of the Impressionists; I\u0027d seen several scenes from Louveciennes at the Musee d\u0027Orsay the day I arrived, including one by Sisley himself. I found Moret-sur-Loing, where he had died. Nearby, a speck--Gremiere. I shut myself into one of the phone booths and called Mary. It was afternoon at home, but she would be back by now, painting or getting ready for her evening class. To my relief, she answered after the second ring. \"Andrew? Are you all right?\"\\n\\n \"Of course. I\u0027m in the Gare de Lyon. It\u0027s marvelous.\" From where I stood I could look up through the glass and see the murals above Le Train Bleu, once the Buffet de la Gare de Lyon, the most fashionable station restaurant of Beatrice\u0027s era, or Aude\u0027s, at least. It was still serving dinner after a century. I wished acutely that Mary were with me.\\n\\n \"I knew you\u0027d call.\"\\n\\n \"How are you?\"\\n\\n \"Oh, painting,\" she said. \"Watercolors. I\u0027m tired of my still life right now. We ought to go on a landscape excursion when you get back.\"\\n\\n \"Absolutely. You plan it.\"\\n\\n \"Is everything all right?\"\\n\\n \"Yes, although I\u0027m calling about a problem. Not a practical problem, exactly--more like a puzzle for Holmes.\"\\n\\n \"I can be your Watson, then,\" she said, laughing.\\n\\n \"No--you\u0027re my Holmes. Here\u0027s the question. Alfred Sisley painted a village landscape in 1895. ft shows a woman walking away down a road, wearing a dark dress with a special design around the bottom, sort of a Greek geometrical pattern. I saw it at the National Gallery, so maybe you know it.\"\\n\\n \"I don\u0027t remember that one.\"\\n\\n \"I think she\u0027s wearing Beatrice de Clerval\u0027s dress.\"\\n\\n \"What? How on earth do you know that?\"\\n\\n \"Henri Robinson has a photograph of her in it. He\u0027s fabulous, by the way. And you were right about the letters. Robert got them in France. He took them from Henri, I\u0027m very sorry to say.\"\\n\\n She was silent for a moment. \"And you returned them?\"\\n\\n \"Of course. Henri is very happy to have them back.\"\\n\\n I thought she must be brooding over Robert and his multiplying crimes, but then she said, \"Even if you\u0027re sure it\u0027s the same dress, what does that matter? Maybe they knew each other and she posed for him.\"\\n\\n \"The village where he painted her is called Gremiere, which was where her maid came from. Henri told me that, when Beatrice\u0027s daughter, Aude, was dying, she told Henri--if you follow me-- that Beatrice gave her maid something important, some proof of her love for Aude. Aude could never figure out what it was.\"\\n\\n \"Do you want me to go to Gremiere with you?\"\\n\\n \"I wish you could. Is that what I should do?\"\\n\\n \"I don\u0027t see how you could find anything in a whole village, and after so much time. Maybe one of them is buried there?\"\\n\\n \"Possibly Esme--I don\u0027t know. I suppose the Vignots would be buried in Paris.\"\\n\\n \"Yes.\"\\n\\n \"Am I doing this for Robert?\" I wanted to hear her voice again, reassuring, warm, mocking.\\n\\n \"Don\u0027t be silly, Andrew. You\u0027re doing it for yourself--as you know perfectly well.\"\\n\\n \"And a little for you.\"\\n\\n \"And a little for me.\" She was silent along that endless Atlantic cable. Or was it satellite these days? It occurred to me that I should call my father while I was at it.\\n\\n \"Well, I\u0027ll take a quick trip up there, since it\u0027s close to Paris. It can\u0027t be too hard to drive to that area. I wish I could go to etretat, too.\"\\n\\n \"Maybe we\u0027ll go there together someday, depending.\" Her voice sounded tight now, and she cleared her throat. \"I was going to wait, but may I talk with you about something?\"\\n\\n \"Yes, of course.\"\\n\\n \"It\u0027s a little hard for me to know where to start, because,\" she said, \"I found out yesterday that I\u0027m pregnant.\"\\n\\n I stood squeezing the receiver in my hand, conscious for a moment only of bodily sensation, a seismic registration of difference. \"And it\u0027s--\"\\n\\n \"It\u0027s certain.\"\\n\\n I had meant something different. \"And it\u0027s--\" The door that opened in my mind at that moment seemed to hold a looming figure, although my phone booth stayed firmly shut.\\n\\n \"It\u0027s yours, if that\u0027s what you want to know.\"\\n\\n \"I--\"\\n\\n \"It can\u0027t be Robert\u0027s.\" I could hear her resolution over the phone, her determination to tell me all this straight, the long fingers holding the receiver on the other side of an ocean. \"Remember, I haven\u0027t seen Robert in months and months, or wanted to. You know full well I\u0027ve never been to see him. And there is no one else. Only you. I was taking precautions, as you know, but there\u0027s a rate of failure with almost anything. I\u0027ve never been pregnant before. In my life. I\u0027ve always been so careful.\"\\n\\n \"But I--\"\\n\\n An impatient laugh. \"Aren\u0027t you going to say something about it? Happiness? Horror? Disappointment?\"\\n\\n \"Give me a moment, please.\"\\n\\n I leaned against the inside of the booth, put my forehead on the glass, not caring what other heads had touched it in the last twenty-four hours. Then I began to cry. It had been years since I\u0027d cried; once, a moment of hot and angry tears after a favorite patient had committed suicide--but, most important, years before that, when I\u0027d sat at my mother\u0027s side, holding her warm, soft, dead hand and realizing after long minutes that she could not hear me anymore, so that she wouldn\u0027t mind my giving way, even if I had promised to prop up my father. Besides, it was he who had propped me up. We were both familiar with death, from our work; but he had comforted the bereaved all his life.\\n\\n \"Andrew?\" Mary\u0027s voice was searching over the line, anxious, hurt. \"Are you that upset? You don\u0027t have to pretend--\"\\n\\n I rubbed my shirtsleeve over my face, catching my nose with the cuff links. \"Then you won\u0027t mind marrying me?\"\\n\\n This time her laugh was familiar, if choked, the contagious mirth I had noticed in Robert Oliver. Had I noticed it myself? He had never laughed with me; I must have been thinking of someone else\u0027s description. I heard her grappling with her voice to steady it. \"I won\u0027t mind, Andrew. I didn\u0027t think I\u0027d ever feel like marrying anyone, but you aren\u0027t anyone. And it\u0027s not because of the baby.\"\\n\\n At the moment I heard that phrase--the baby--my life divided itself in two, mitosis of love. One half was not even quite present yet; but those two small words, over the phone, had carved out another world for me, or doubled the one I knew. \\n\\n","sourceLink":"https://allnovel.net/the-swan-thieves/page-92.html","bookId":2244,"book":{"id":2244,"title":"The Swan Thieves","description":"Storyline: Psychiatrist Andrew Marlowe has a perfectly ordered life--solitary, perhaps, but full of devotion to his profession and the painting hobby he loves. This order is destroyed when renowned painter Robert Oliver attacks a canvas in the National Gallery of Art and becomes his patient. In response, Marlowe finds himself going beyond his own legal and ethical boundaries to understand the secret that torments this genius, a journey that will lead him into the lives of the women closest to Robert Oliver and toward a tragedy at the heart of French Impressionism. Ranging from American museums to the coast of Normandy, from the late nineteenth century to the late twentieth, from young love to last love, THE SWAN THIEVES is a story of obsession, the losses of history, and the power of art to preserve human hope.\\n","cover":"https://allnovel.net/images/the-swan-thieves.jpg","author":"Elizabeth Kostova","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-swan-thieves.html","creation":"Oct 5, 2019 8:58:30 AM","modification":"Oct 5, 2019 5:02:47 PM"}}
