{"id":105227,"no":30,"title":"Page 30","content":"Fights were commonplace. When I worked the Eastern District for the St. Paul cops, the very last call you wanted to take was to quell a disturbance at Lehane’s. Sometimes you found guys going at it with fists, sometimes with knives, sometimes with guns. That’s how Patrick Lehane got his. A slug from a nine-millimeter fired by a customer who refused to take last call for an answer. That was back in the mid-eighties. Since then the bar had changed hands at least a half-dozen times while retaining its name, rowdy reputation, and white-trash clientele. It was specifically because of Lehane’s that the St. Paul City Council adopted what it labeled “a nuisance ordinance.” The statute allowed them to shutter any business they wanted if they could prove “by a preponderance of evidence that the property owners operated in a manner that maintained and permitted conditions that unreasonably annoyed a substantial number of people and endangered the safety, health, morals, comfort, or repose of considerable numbers of the public.” Yet, while the ordinance had been used to threaten and shut down several other less notorious bars over the years, including a pretty decent African American–owned blues joint, Lehane’s remained in business. Go figure. I opened the door and was slapped in the face by the smell of cigarettes and beer and the sour odor of industrial disinfectant. I tried not to react to it. The bartender glanced at me when I stepped inside. His eyes worked me over, wondering if I was trouble, how much, and whether or not he could handle it. From the way he smirked and turned his head, I doubt I impressed him much. There were six other men in Lehane’s. At first glance you would have pegged them as working class, except I doubted any of them actually had a job or filed a tax return. More likely, they all made their living in the so-called underground economy. I would have bet my Audi that each of them had a criminal record. The men were divided into pairs. One pair sat at the bar near the door, and another sat at the opposite end, as far away from the first pair as possible. The two other men sat at a table in the corner, their heads close together, speaking intently—at least until I somehow interrupted their conversation by moving to the center of the bar. When they spotted me, they both leaned away from each other and frowned. The others looked at me with an expression of casual indifference before returning their attention to the TV above the bar—I could live or die or go to Iowa for all they cared. Maybe it was my clothes. I was overdressed because I was wearing a clean shirt and jeans. Maybe if I went outside and rolled around in the gutter. Instead of a legitimate sport, they had ultimate fighting on—think professional wrestling with real malice, real violence, and real injuries. The customers didn’t seem to be rooting for anyone in par tic u lar, just watching the mayhem, maybe taking mental notes on how to hurt and disable. “Wooooo,” one of them hummed when a fighter head-butted his opponent, hurled him down on the mat, and proceeded to pound his face with a forefist. “I bet that hurts.” “He’s a pussy,” his companion said without indicating which fighter he meant. The bartender seemed annoyed that I distracted him from the program. He needed a shave and a haircut, his eyes were unsteady, and his belly strained the buttons of his shirt. I set a ten on the bar in front of him and said, “Shot of rye and a bottle of beer. And quarters for the pool table.” “No bottles,” he said. “Only cans.” A good policy, I decided. Having been attacked with both over the years, I could testify that aluminum cans were definitely less lethal than broken glass. While the bartender’s back was turned, I fished a pack of Marlboros and a brand-new Bic lighter from my pocket. I had bought both at a SuperAmerica store down the street. When Karen asked why, I said, “Props. An actor needs his props.” I was lighting the cigarette when the bartender set the shot glass and beer in front of me. “Law says you can’t smoke in here,” he said. “What the fuck do I care?” The bartender gave me a small squat glass to use as an ashtray. “I don’t want to see no butts on the floor,” he said, even though the black rubber tiles were already littered with cigarette butts as well as crushed pretzels, peanut shells, and kernels of buttered popcorn. There weren’t any baskets on the bar, so I figured the debris must have been what remained of Lehane’s happy hour spread. The bartender took the ten and returned a moment later with my change, including seven quarters. I used four of them to buy a round of pool at the table in the back. I racked the balls and carefully selected a cue from the half-dozen sticks collected in a busted wooden frame screwed to the wall. I found only one that was reasonably straight and still had the tip attached. I was chalking the cue when she walked in.","sourceLink":"https://allnovel.net/madman-on-a-drum-mac-mckenzie-5/page-30.html","bookId":2221,"book":{"id":2221,"title":"Madman on a Drum (Mac McKenzie #5)","description":"Storyline: Homicide cop Bobby Dunston\u0027s daughter has been kidnapped, taken in broad daylight on a city street in the middle of September. The kidnappers demand a million dollars and force Dunston to get the ransom from his friend McKenzie. It soon becomes apparent to the two of them that one of the kidnappers is childhood pal Scottie, a once aspiring drummer now gone astray, and that the kidnapping is payback for \"crimes\" committed in their past. McKenzie, former cop and now unlicensed P.I., handles the ransom drop-off and the child is returned safely. But Scottie is found dead - brutally murdered - and someone has taken out an open contract on McKenzie, using his own money to pay for it. Dodging attempts on his life from assassins of all shapes and sizes, McKenzie now has precious little time to uncover the mastermind behind it all if he\u0027s going to survive.","cover":"https://allnovel.net/images/madman-on-a-drum-mac-mckenzie-5.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/madman-on-a-drum-mac-mckenzie-5.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:41:35 PM"}}
