{"id":105232,"no":35,"title":"Page 35","content":"Bobby leaned forward. “Why?” he said.\n “He just went through a messy divorce. He needs money. Plus, he’s been working out, and, well, his name does begin with a T.”\n Bobby leaned back and Honsa and Harry glanced at each other as if they had all simultaneously flashed on the same idea that I had had— maybe it was Tommy’s voice on the phone, not Scottie’s. I didn’t believe it. Yet it was possible.\n Honsa passed a look to the tech agent. The tech agent grabbed a handheld and left the room.\n “What happens now?” Bobby asked.\n “The hardest part,” said Honsa. “We wait.”\n “Oh, God,” moaned Shelby.\n “I’m optimistic,” Honsa said.\n No one agreed or disagreed with him out loud, yet we all understood the possibility: Scottie learned we had been looking for him, panicked, killed Victoria, and returned to the halfway house to avoid detection. It was a fear too great to speak aloud.\n “We’ll wait for the kidnappers to call,” Honsa said. He looked first at Shelby and then at Bobby as he spoke. “They will call. They will call tomorrow. As soon as it’s humanly possible, we will arrange to exchange the money for your daughter. Once your daughter is safely home, we will make sure these men pay for their crimes.”\n “I don’t care if they pay or not,” Shelby said. “As long, as long…”\n “I understand,” Honsa said.\n “Do you have children, Agent Honsa?”\n “Yes, ma’am. That’s one of the reasons I do this job.”\n I don’t know if she found comfort in that or not. She slowly rose from the table and, without speaking, left the room. After a few moments, Bobby followed her.\n Karen and I left Shelby’s Place at the same time.\n “I pray that the girl comes home safely,” she said. “I pray that no one gets hurt.”\n “Me, too.”\n My car was parked on the far side of Wilder, facing north. Her car was on the near side, facing south. As I passed her car, Karen said, “I am so wired, there’s no way I could possibly fall asleep. I really don’t want to be alone, anyway. McKenzie, will you have a drink with me? Or…” The “or” is what made me stop in the middle of the street. “The way I feel right now, I could be talked into anything.”\n “Anything?” I said.\n “The way I feel—if you feel the same way…”\n I thought about it. I gave it all of five seconds before I said, “I have to make a phone call.”\n “Nina?”\n “Yes.”\n “I’ll wait.”\n “No.”\n Karen nodded as if a great truth had been revealed to her. “Before, you said that Nina would do until the real thing came along. She is the real thing, isn’t she?”\n “As real as it gets.”\n “Why didn’t you say so? Were you embarrassed?”\n Good question. Nina and I had discussed the M-word on several occasions, only she had been there, done that, and had nothing to show for it except some extra bad memories and a lovely daughter, so marriage wasn’t on the agenda. Still, in essence we had pretty much vowed to forsake all others. Why I had a difficult time admitting that aloud was as much a mystery to me as it was to everyone else.\n “I’m told I don’t express my feelings well,” I said.\n “You should work on it.”\n “I’ve been told that, too.”\n Karen took several tentative steps toward me, paused. Her hand dipped inside her bag. For a moment, I had the irrational fear that she was reaching for her gun. Her hand came out with her wallet instead. “I’d really like to know what happens with that little girl,” she said. She took a card from her wallet. “Will you call me? Will you tell me what happens?” I took the card and put it in my pocket. “Or I could call you.”\n There was that “or” again.\n “I’ll call you,” I said.\n I was on I-94, heading west toward the Highway 280 exit, driving with one hand while holding my cell phone to my ear with the other. Nina Truhler was asking questions and I was trying to answer as best I could. “Ohmigod,” she kept saying. “Oh. My. God!” As if saying it often and loud enough would convince him to intervene on Victoria’s behalf. Personally, I thought she was taking the Lord’s name in vain. God never intervenes. He leaves that to us mere mortals.\n I had hoped that Nina would invite herself over to my house. Like Karen Studder, I felt the need for some TLC. Instead, Nina announced that she was going home early to check on her own daughter, Erica. I didn’t blame her a bit and told her so.\n It wasn’t until we finished our conversation that my hands began to shake. To avoid a wreck, I took the Larpenteur Avenue exit off 280 and pulled into the rutted lot of the abandoned service station at the top of the ramp. I had Stacey Kent in the CD player; she was wrapping her cool, hip, girlish voice around some jazz standards. It took a half-dozen songs before I stopped trembling and another half dozen before I felt up to driving home. I might have broken down altogether except what good would that do?\n 10 \n","sourceLink":"https://allnovel.net/madman-on-a-drum-mac-mckenzie-5/page-35.html","bookId":2221,"book":{"id":2221,"title":"Madman on a Drum (Mac McKenzie #5)","description":"Storyline: \n Homicide cop Bobby Dunston\u0027s daughter has been kidnapped, taken in broad daylight on a city street in the middle of September. The kidnappers demand a million dollars and force Dunston to get the ransom from his friend McKenzie. It soon becomes apparent to the two of them that one of the kidnappers is childhood pal Scottie, a once aspiring drummer now gone astray, and that the kidnapping is payback for \"crimes\" committed in their past. \n McKenzie, former cop and now unlicensed P.I., handles the ransom drop-off and the child is returned safely. But Scottie is found dead - brutally murdered - and someone has taken out an open contract on McKenzie, using his own money to pay for it. Dodging attempts on his life from assassins of all shapes and sizes, McKenzie now has precious little time to uncover the mastermind behind it all if he\u0027s going to survive.\n \n","cover":"https://allnovel.net/images/madman-on-a-drum-mac-mckenzie-5.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/madman-on-a-drum-mac-mckenzie-5.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:41:35 PM"}}
