{"id":105250,"no":53,"title":"Page 53","content":"“That’s what his ID said,” Harry told me. “I just wanted to make it official.” Shakespeare wrote that “the evil that men do lives after them, the good is oft interred with their bones,” but I think he’s wrong. Staring down at Scottie I didn’t dwell on what he had done to Victoria and the Dunston family, or any of his other crimes. I remembered that he was a sure-handed shortstop with plenty of range; I remembered listening to him playing the drums at the mixer at Merriam Park, trying hard to be Ginger Baker or Keith Moon. “I’m sorry he’s dead,” I said. “Me, too,” Harry said. “No, you’re sorry because he can’t lead you to his partner. I’m sorry because it shouldn’t have ended this way. He had been a good guy once. God! What is his mother going to think, I wonder? Damn, Scottie. Dammit.” “This is bad. This is very, very bad.” Harry was standing outside the ominous yellow tape surrounding the crime scene. He was leaning against a dark-colored van; his arms were folded, his chin resting against his chest. The street had been closed, and various law enforcement vehicles were parked every which way along it. A group of men milled about on the far side of the van talking to themselves. Others, most of them wearing windbreakers with the white letters FBI on the back, a few dressed in the uniforms of the St. Paul Police Department, were scattered up and down the street; a few were inside the yellow house. They were all probably searching for clues, but you couldn’t have proven it by me. The yellow tape was held up by the SPPD uniform who carried the attendance log noting the names of everyone who had visited the crime scene. I ducked under it and joined Harry at the van. “No sign of the money, I suppose,” I said. “Nope.” “How the hell did you let him get away, Harry? You had two SWAT teams in position, for chrissake.” “We had to wait to make sure you were clear before we moved in. And now it looks like they knew we were coming.” “Well, duh.” “Look, McKenzie. We’re going to get a lot of shit over this as it is. We don’t need to hear it from you, too.” “We? There’s no we.” I pointed my finger at him. “I’m blaming you personally.” I would have said more except for the expression on Harry’s face. I have no compunction about kicking a man while his back is turned, but never when he’s down. Still, it was my money! I glanced up the street. The cars I had seen earlier were still parked where they had been, except for the big white moving truck. Agents were progressing from house to house, searching for witnesses, maybe hoping the kidnappers were still holed up in the area. From their expressions and the way they went about their business, I don’t think anyone liked their chances. “You might want to have your agents check the duplex down the street,” I told Harry. “There was a moving van parked in front of it before. Maybe the movers saw something—” Then it hit me. There were no movers, only the truck. “Oh, crap.” “What?” “There was a sixteen-foot moving van parked across the street, its doors open, the ramp down. A truck that size, I bet the interior is at least ninety inches wide and a hundred eighty inches long.” “So?” “The kidnappers loaded the money into the back of a Vibe. Did Honsa tell you?” “Yes.” “A Vibe is about seventy inches wide and one hundred seventy inches long.” “Oh, you gotta be kidding me.” “I remember thinking at the time that it was a poor excuse for a getaway car—it’s so small, such a weak engine. Only they didn’t get away in the Vibe. I bet the kidnappers drove it into the back of the truck and got away in that.” “Tell me you got a license plate.” “No.” “A name painted on the side of the truck?” “I didn’t notice.” Harry went inside the van. While he was there, the FBI’s forensic pathologist arrived, ducked under the yellow tape, and began examining the body. I turned my back to him. Harry exited the van and said, “Do you have anything else you’d like to share, McKenzie?” “Sorry,” I said. “Look at the bright side. Victoria is safe and sound. Now we can conduct a proper investigation. We’ll start by interviewing everyone you spoke to the day before yesterday. I’m convinced that one of them must have tipped off Scottie that we were looking for him and he subsequently told his partner. That’s probably why the partner killed him, to protect himself.” “Umm.” Harry spun toward me. “Umm?” he said. “What does umm mean?” “I umm…” “You umm?” “I might have made a mistake.” “Tell me?” “After we made the exchange, and Victoria was safely in the car, and the car was in gear, and we were driving off, I might have said something.” “What might you have said?” “I might have said something about seeing him real soon.” “You used Scottie’s name, didn’t you?”","sourceLink":"https://allnovel.net/madman-on-a-drum-mac-mckenzie-5/page-53.html","bookId":2221,"book":{"id":2221,"title":"Madman on a Drum (Mac McKenzie #5)","description":"Storyline: Homicide cop Bobby Dunston\u0027s daughter has been kidnapped, taken in broad daylight on a city street in the middle of September. The kidnappers demand a million dollars and force Dunston to get the ransom from his friend McKenzie. It soon becomes apparent to the two of them that one of the kidnappers is childhood pal Scottie, a once aspiring drummer now gone astray, and that the kidnapping is payback for \"crimes\" committed in their past. McKenzie, former cop and now unlicensed P.I., handles the ransom drop-off and the child is returned safely. But Scottie is found dead - brutally murdered - and someone has taken out an open contract on McKenzie, using his own money to pay for it. Dodging attempts on his life from assassins of all shapes and sizes, McKenzie now has precious little time to uncover the mastermind behind it all if he\u0027s going to survive.","cover":"https://allnovel.net/images/madman-on-a-drum-mac-mckenzie-5.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/madman-on-a-drum-mac-mckenzie-5.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:41:35 PM"}}
