{"id":105205,"no":7,"title":"Page 7","content":"“I know.” “I listen to what the kidnappers want and I ask, is it because of you, McKenzie? Because of your money? Because of the things you do, the favors you do for people? Is that why they took my daughter? Tell me.” The idea that I had brought all this down on the Dunston family had occurred to me when I listened to the voice on the tape recording and knew, like Bobby, that I had heard it before. I decided to ignore it. My father and a man named Mr. Mosley—after my mother died, they taught me by their example to keep my emotions to myself. So did eleven and a half years as a St. Paul cop. I was doing that now. Trying to, anyway. Especially the guilt. Only my emotions were dangerously close to the surface and I knew that it wouldn’t take much to turn them loose and what good would that do? So No, it isn’t your fault, my inner voice advised me and I went along with it. To Shelby, I said, “Someone who knows Bobby and me, someone who knows we’re friends—” “Are you going to give us the money?” “I’ll give you everything I have, you know that.” Shelby gave a small shake of her head, bent over, her hands clasped together in her lap. When her head came up there were tears in her swollen eyes. An odd sound, a fusion of anguish and laughter, escaped her throat, and she placed both hands over her mouth and stared at me. I wanted to comfort her, hold her in my arms. When I rose from the floor she held up a hand, stopping me. My cell phone demanded attention. While I answered it, Shelby left the room. “H. B. Sutton,” I said after reading the name off the caller ID. “McKenzie.” Sutton’s voice was cold and hard and humorless, and hearing it always made me want to turn up the furnace. Once you came to know her, Sutton was actually quite pleasant and interesting to be with, but penetrating the thick walls she built around herself took some effort. I blamed her flower-children parents for the walls. After I had known her for three years, Sutton confided to me what the H. B. stood for. “Heavenly-love Bambi.” “You’re kidding,” I said. “Try growing up with that name, going to school. Try looking for a job.” “Do you even speak to your parents?” “Only during the summer solstice.” Speaking to her now, listening to her no-nonsense voice, gave me strength. “What’s this about needing money?” Sutton asked. “I need a million dollars.” “Sure you do.” “I need it right away.” “McKenzie, we’ve had this discussion before. You have enough invested now where you don’t need to spend your own money to buy something. You can borrow—” “I need it in cash.” “Who the hell deals in cash?” I explained. “Wow,” Sutton said. “Will you help me?” “Of course I will, except it’s not as easy as it sounds. We can sell off your holdings right now, right this minute, using after-market networks. Except they have a three-day settlement. It would take three days before you could get your money. We can wait until the markets open tomorrow morning, but they demand a one-day settlement.” “I wouldn’t be able to get my money until the day after tomorrow?” “That’s how it works.” “I can’t wait that long, H. B. Give me something. Anything.” “We could margin the equity in your accounts and take out a loan. One million against five million in holdings, it shouldn’t be a problem. I can start the paperwork right now.” “When would I get the money?” “We can wire it to your money market or personal checking account by eleven tomorrow morning. Possibly sooner. I’ll call you when the transaction is complete.” “Please and thank you,” I said. “Put it in checking. Do you have my account number?” “I do.” “I appreciate this, H. B.” “McKenzie, that little girl…” “I know.” 2 Shelby had returned to Katie’s room. I watched her for a moment. She refused to acknowledge me. For the first time in my life I felt like an intruder in her home. I continued down the corridor. The four FBI agents were gathered in a knot at the foot of the stairs. They spoke quietly. There was no laughing, no smiling; nor were there any grimaces or outbursts of anger. They were suppressing all of their emotions out of deference to Bobby and Shelby, and I admired them for it. When I reached them, Honsa took me by the arm and led me into the kitchen. There was coffee brewing, and he filled two mugs. I took a sip from mine, put it down, and never touched it again. Honsa drank from his as if it were plasma, as if it were keeping him alive. His reassuring smile never left his lips, not for a moment. His eyes, on the other hand, worked me over like a collector appraising an antique armoire.","sourceLink":"https://allnovel.net/madman-on-a-drum-mac-mckenzie-5/page-7.html","bookId":2221,"book":{"id":2221,"title":"Madman on a Drum (Mac McKenzie #5)","description":"Storyline: Homicide cop Bobby Dunston\u0027s daughter has been kidnapped, taken in broad daylight on a city street in the middle of September. The kidnappers demand a million dollars and force Dunston to get the ransom from his friend McKenzie. It soon becomes apparent to the two of them that one of the kidnappers is childhood pal Scottie, a once aspiring drummer now gone astray, and that the kidnapping is payback for \"crimes\" committed in their past. McKenzie, former cop and now unlicensed P.I., handles the ransom drop-off and the child is returned safely. But Scottie is found dead - brutally murdered - and someone has taken out an open contract on McKenzie, using his own money to pay for it. Dodging attempts on his life from assassins of all shapes and sizes, McKenzie now has precious little time to uncover the mastermind behind it all if he\u0027s going to survive.","cover":"https://allnovel.net/images/madman-on-a-drum-mac-mckenzie-5.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/madman-on-a-drum-mac-mckenzie-5.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:41:35 PM"}}
