{"id":105269,"no":72,"title":"Page 72","content":"A half-dozen years ago, Officer Willie Buckman was responsible for one of the most colossal animal-abuse cases in Minnesota history, resulting in four felony convictions and forty-seven misdemeanor citations. The way Buckman told the story, it had been an accident. He was patrolling for the Minneapolis Police Department when he caught a domestic. When he arrived at the scene, instead of abusive spouses going at it, he discovered nearly fifty suspects watching a dogfight inside a garage. He called for backup. Arrests were made. Dogs were seized.\\n\\n If it had been a drug bust, not much would have been made of it. But, it’s a curious characteristic of society today that citizens are more intensely outraged over the mistreatment of dogs, cats, horses, and other animals than they are of humans. The arrests made Buckman a hero to the viewers of every local TV news program in the Twin Cities. Not to mention CNN and Good Morning America. Soon after, he was offered a position as an investigator for the Minnesota Animal Humane Society. Now he wears a brown and tan uniform with a gold badge and a sidearm and investigates cruelty-to-animals complaints and conducts training and workshops for the humane enforcement industry.\\n\\n “The thing is,” he told us, “we never did learn who called in the domestic. I always thought it was someone’s ex-wife or girlfriend. Maybe a neighbor who wanted to remain anonymous. Most of the complaints we get, there aren’t any names attached to them.”\\n\\n “You get a lot of those?” Schroeder asked.\\n\\n “Oh, yeah. That’s where we get most of our intel. Someone’s pissed at someone else and they’re looking for payback, they call in. Doesn’t do us much good, though. You need hard evidence, and that’s difficult to come by. Professional dogfighting is a very secretive, very suspicious world. It’s hard to get close. I know who’s out there; I know what they’re doing. Proving it in court—dogs aren’t real good at giving testimony, if you know what I mean.”\\n\\n “You should have stayed with the MPD,” Schroeder said. “Jacking up kids smoking dope on the street corner or giving college chicks a chance to work off their DWIs.”\\n\\n “Or I could’ve become a PI,” Buckman said. “Shooting pictures through the windows of hot-sheet motel rooms with digital cameras, negotiating with the babes over what they’ll give you for not showing the pictures to their husbands.”\\n\\n “Don’t knock it,” Schroeder said. “That’s how I met my third wife.”\\n\\n “How did that work out for you?” Buckman asked.\\n\\n “You know how that worked out,” Schroeder said, and the two men slapped hands. Boys just being boys.\\n\\n “Excuse me,” I said. “Do you know anything about a banger who calls himself Dogman-G?”\\n\\n Schroeder threw a thumb in my direction. “You’ll have to forgive McKenzie,” he said. “He’s got a lot on his mind these days.”\\n\\n “Oh, I can tell he’s a fun guy,” Buckman said. “Must be the Kevlar. And the fact that you haven’t slept in twenty-four hours, am I right?”\\n\\n “What can I say? They were broadcasting a Charlie’s Angels marathon on TV Land.”\\n\\n Schroeder and Buckman both thought that was funny. Finally Buckman said, “Dogman-G, huh? Yeah, I know him. A wannabe tough guy deals drugs in North Minneapolis. He’s a dabbler. He wants to be a real dogman, breed pit bulls and fight them on the circuit. Except he also uses pits to intimidate his competition, to mark his territory. Instead of flashing a nine-millimeter, he’ll use a nasty-looking dog on a leash to frighten off his rivals. The real dogmen, the professionals, they don’t care for that kind of behavior.”\\n\\n “Sure.”\\n\\n “Gotta remember, real dogmen, they don’t see what they’re doing as a brutal, cruel activity. They view dogfighting as a legitimate sport— they trace its roots back to seventeenth-century En gland. They’re very traditional. They have a code. Rules. Protocols. You break them… It’s hard to get into the club if you break the rules, and Dogman-G breaks the rules.”\\n\\n “The other children won’t play with him?” Schroeder asked.\\n\\n “Nope.”\\n\\n “How sad.”\\n\\n “Brings tears to your eyes, doesn’t it?” Buckman said.\\n\\n “Where can we find Dogman-G?” I asked.\\n\\n “I have no idea,” Buckman said. “You might try… There’s a dogman up in East Bethel. Dogman-G’s been spending a lot of time with him these days. I think he’s trying to rehab his rep, get in with the right crowd.”\\n\\n “Where in East Bethel?”\\n\\n Buckman gave us directions to an isolated farm house that were obscure at best. “I’ve been trying to get enough for a search warrant. No luck so far,” he said. “If you guys stumble upon anything interesting, you’ll let me know?”\\n\\n Schroeder promised that we would. “In the meantime, you can go back to rescuing frightened kittens from trees,” he said.\\n\\n “Hey, don’t knock it,” Buckman said. “A lot of those frightened kittens have grateful women as owners.”\\n\\n “I hear that,” Schroeder said, and they slapped hands yet again.\\n\\n Oh, brother, my inner voice said. \\n\\n","sourceLink":"https://allnovel.net/madman-on-a-drum-mac-mckenzie-5/page-72.html","bookId":2221,"book":{"id":2221,"title":"Madman on a Drum (Mac McKenzie #5)","description":"Storyline: Homicide cop Bobby Dunston\u0027s daughter has been kidnapped, taken in broad daylight on a city street in the middle of September. The kidnappers demand a million dollars and force Dunston to get the ransom from his friend McKenzie. It soon becomes apparent to the two of them that one of the kidnappers is childhood pal Scottie, a once aspiring drummer now gone astray, and that the kidnapping is payback for \"crimes\" committed in their past. \\n McKenzie, former cop and now unlicensed P.I., handles the ransom drop-off and the child is returned safely. But Scottie is found dead - brutally murdered - and someone has taken out an open contract on McKenzie, using his own money to pay for it. Dodging attempts on his life from assassins of all shapes and sizes, McKenzie now has precious little time to uncover the mastermind behind it all if he\u0027s going to survive.\\n","cover":"https://allnovel.net/images/madman-on-a-drum-mac-mckenzie-5.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/madman-on-a-drum-mac-mckenzie-5.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:41:35 PM"}}
