{"id":110430,"no":23,"title":"Page 23","content":"\"Where\u0027ve you been?\" asked Roman. I hadn\u0027t landed in Seattle until later the next day. Turns out getting flights from Mexico to the Pacific Northwest can take a little longer than immortal teleportation, particularly on short notice. \"To the edge of the known world and back,\" I said, falling onto the couch. Both cats came to me, which I took with some smugness, seeing as they usually fawned all over Roman. \"So, what, South Dakota?\" I made a face and covered my eyes with one arm. My trip to locate Seth had only taken twenty-four hours, but really, that was a lot to endure in so short a time. \"I found Seth.\" \"Oh.\" Roman\u0027s enthusiasm dimmed considerably. \"I guess his disappearance wasn\u0027t as milk carton¨Cworthy as Maddie made it sound.\" \"Well, I had to - literally - call in a demonic favor to hunt him down.\" \"And? Are you guys running into the sunset together now that he\u0027s free?\" The mention of sunset made me flinch, recalling how Seth and I had held each other on the beach. \"Not quite. I...left him.\" \"What\u0027s that mean exactly?\" I tried to explain all that had gone down with Seth, but it wasn\u0027t easy. It was almost too much for my brain to wade through, let alone articulate to someone else. When I finished, I felt even more exhausted than before. \"So that\u0027s it? You\u0027re never going to see each other again?\" Roman\u0027s voice was skeptical. \"He said he\u0027s not coming back, and I didn\u0027t stick around. So, yeah.\" \"I have a hard time believing that. Is he just going to live at that hotel permanently? Even he can\u0027t make that much money.\" \"No, he mentioned at dinner that he\u0027d be settling down somewhere else. He just hasn\u0027t decided where.\" All was quiet between us for a minute or so. The only sounds were the traffic outside and Aubrey purring near my ear. At last, Roman asked, \"Are you okay?\" I glanced over at him in surprise. \"What do you mean?\" \"Exactly what I said. This can\u0027t be easy on you. I mean, you haven\u0027t even had any downtime since the Oneroi.\" I don\u0027t know why his words caught me by surprise. I guess it was because amidst all the woes that were always going on in my life, few people ever asked if I was okay. Maybe they\u0027d given up asking because depressing things were so commonplace for me. How weird, I thought, that Roman had swung from sociopathic to compassionate while Seth had fallen down a darker path. Of course, I had no hard evidence that Roman wasn\u0027t actually a compassionate sociopath. Still, I gave him a smile of gratitude. \"I am okay - or will be eventually. Thanks.\" There must have been something in my smile that gave him hope or just made him feel inspired because his own smile grew radiant. I\u0027d forgotten just how beautiful it was, the way it could light up his face. We left dangerous topics alone after that but spent the rest of the night hanging out together. I wasn\u0027t totally okay by any means, but it was nice to simply be ordinary for a while and free of drama. I wondered if that\u0027s what my life would be like now - and what role Roman would play. Still, adjusting to a world without Seth wasn\u0027t easy over the next few days. Even when he\u0027d been with Maddie, even when the sight of him had caused me pain, he\u0027d still been there. And I\u0027d known he was there. Now, the knowledge that he was gone and that he wasn\u0027t coming back left a strange emptiness in my heart, even as the rest of my life began to stabilize. I returned to work, a good thing for the store because Maddie had taken some much-needed time off. I checked on her via Doug and offered to go to her if needed, despite knowing I wouldn\u0027t enjoy listening to her mourn for Seth. Of course, since I was doing the same thing, maybe I shouldn\u0027t have been so quick to turn down commiseration. \"She just wants to be alone right now,\" Doug said, leaning in my doorway. He had no joke today, none of his usual wackiness. \"Still upset - but she\u0027s a trouper. I\u0027ll let you know when she\u0027s ready to see anyone.\" \"Okay.\" My heart went out to her. \"Keep me posted.\" It was nearing closing time, and I went out to the store\u0027s main part to help with some of the evening tasks. A few of the staff members were already going home. One of them was Gabrielle. And she was leaving with Cody. \"What\u0027s going on?\" I whispered to him while she went to get her purse. He wasn\u0027t even wearing black. \"We\u0027ve gone out a couple times since...well, while you\u0027ve been distracted.\" He sounded apologetic for his happiness. \"That\u0027s fantastic,\" I said. Love was managing to survive somewhere in this world. \"What changed her mind? The concert?\" \"A little. I think that opened the door. She\u0027s really excited that I\u0027ll only hang out at night. And that I can show her real vampires.\" \"What? You managed to convince her Peter was a vampire?\" To the average human, that would be even less likely than Cody being a vampire. \"No, of course not.\" His lovesick expression hardened a little. \"But Milton - you know that vampire from Eugene? - he\u0027s been in town this week. Claims he\u0027s visiting friends.\" Vampires were very territorial about their hunting grounds, even ones like Peter and Cody who rarely took victims and didn\u0027t kill when they did. \"He hasn\u0027t caused any trouble, but I don\u0027t buy that vacation thing. It\u0027s as ridiculous as Simone just visiting.\" \"She is gone, right?\" That had been the rumor, and seeing as there\u0027d been no wacky mishaps with two Georginas, I had to believe it was true. I\u0027d never know what her motivation had been. \"Yup, as far as I know. Anyway. Milton. He sure does look like a vampire. Have you seen him? He\u0027s like a modern-day Nosferatu. I took Gabrielle when I went to spy on him at a dance club, and she got really excited. She thinks I have some special knack for finding vampires - at least wannabe ones.\" \"Huh,\" I said. \"That\u0027s somehow bizarre, funny, and cute all at the same time. Maybe a little disturbing.\" He grinned at that, showing his fangs. \"What\u0027s she think of the teeth? You can\u0027t hide those if you\u0027re up close and personal all the time.\" \"Told her I had them cosmetically done.\" He looked very pleased. \"She thinks it\u0027s hot.\" His new romance left me in a good mood when I finally took off. I stepped outside into the chilly night, surprised I didn\u0027t mind it so much. Something about the clean, brisk air seemed refreshing to me, and for the first time in a while, I regretted moving out of Queen Anne. It would have been nice to walk home on this early winter evening, instead of climbing into the plastic and metal of my car. There was nothing to be done for it, though. I turned the ignition and checked my cell phone before heading out of the parking lot. I often left the ringer off while working, and three calls had come in for me. I had a voice mail for each. The first was from a few hours ago, from Erik. He spoke in his usual genteel tones, but I could hear some urgency underneath. He told me he\u0027d come up with some theories about my contract and wanted to talk to me soon. The next message was from Roman, from about an hour ago. He knew my work schedule perfectly and was calling to see what kind of takeout I wanted. If I called as I was leaving, he said, he\u0027d probably have food by the time I walked in. I felt my lips turn into a smile at that - one that promptly dropped when I heard the last message. It had come in five minutes ago and was from Erik again. \"Georgina - \" That was it. Just my name, tense and strangled. After that came static, what sounded like the phone dropping, and then the voice mail ended. I stared at my phone as though it were a totally foreign object. I had never, ever heard Erik call me by my first name. My car was already headed toward his store when I dialed him back. It was too late for the store to be open, but that was the number my cell phone had logged. No answer came. I tried his home number, just to be safe, and received no answer there either. My fear increased, as did my speed. Easy traffic moved me along, but I still felt like his store might as well be hundreds of miles away. I made it there in fifteen minutes, which was actually pretty remarkable. The store\u0027s lights were on, though everything else in the strip mall and its lot was dark. I parked right in front, in a handicapped spot, and tore out of my car, nearly coming to a halt at what I found. The glass of the door and window were smashed, with glittering shards covering the sidewalk. Even if the door had been locked, I could have reached right in to open it. I pushed through, stepping inside to find more destruction. Fountains still tinkled, music still played, but everything else was in shambles. Bookshelves knocked over. Statuary in pieces. Jewelry cases broken - and empty. \"Erik?\" I called, hurrying through the store. There was no answer. I passed the register, saw the drawer hanging open, and suspected I\u0027d find it as empty as the cases. I was heading for the store\u0027s back room when I heard a small noise. Turning, I peered around wildly and caught a glimpse of a hand, behind the checkout counter. There, I found Erik sprawled on the floor, pale despite his dusky skin. A hand lay over his stomach, which was a pool of dark blood. His eyes were glassy, and for a moment, I thought he was dead. Then the lids twitched, and his eyes focused on me. \"Miss Kincaid...\" I dialed 911 while simultaneously trying to rip my coat off. I screamed at them to send an ambulance and pressed the light fabric of the trench coat into his stomach. The effort was futile. A red strain promptly began spreading through the cloth. \"Don\u0027t say anything,\" I pleaded when I saw his lips move. They were blue-tinged. \"Someone\u0027s coming. You\u0027ll be okay.\" I wanted to ask a hundred questions: what had happened, who had done this. None mattered. Only saving him did - and besides, the scenario seemed painfully clear. A break-in, one in which he must have interfered. Two bullet holes on the wall revealed what had happened to his stomach. The third shot had hit. \"Miss Kincaid...\" His voice was so small, barely a croak. \"Shh. We\u0027ll talk later, after the paramedics come. Save your strength.\" \"There won\u0027t be a later,\" he gasped. I swear, he tried to smile. \"Not...for...me...\" \"They\u0027ll be here in, like, five minutes,\" I countered. \"Doesn\u0027t matter. Too weak. Too much blood.\" \"No,\" I said desperately. \"No.\" Even as I begged, my hysteria growing, I knew he was right. He had lost too much blood. He was only alive now because this was a slow-killing wound. Even if paramedics walked in right now, they wouldn\u0027t get him away in time to save him. With his age and recent illness, he wouldn\u0027t come back from this. Still, I denied it. \"You\u0027ll be okay. Listen - \" \"You listen.\" There was no real force behind the command, but I shut up. One of his hands clung to me. \"It\u0027s not...your contract.\" I was confused, my mind still on his condition and the store. Then, I caught the context. \"Let the contract go. We\u0027ll worry about it later.\" His grip tightened. \"There must be another. Two contracts.\" \"There...what? No. That\u0027s not how it works. I know that for sure. One contract per soul. I signed one. Now, please. Don\u0027t say anything else.\" \"Find it,\" he coughed. There was blood on his lips. \"Find...it.\" \"I will, I will.\" I would have agreed to anything, though what he was saying made no sense. My words must have comforted him because he relaxed ever so slightly. There was still no question that he must be in agonizing pain, though. I glanced up at the front of the store, willing myself to hear sirens. \"They\u0027ll be here,\" I said. \"Too...late. You...you can stop the pain.\" He was so hard to hear now, I had to lean close. Even then, I didn\u0027t fully parse his words until a few moments later. \"I\u0027m trying.\" I shifted the coat a little, which was proving totally ineffectual. \"A kiss...one kiss...\" \"I...\" My eyes went wide. \"No. No. It\u0027ll kill you...\" Even as I said the words, I realized how stupid they were. This gunshot was already going to kill him. He was going to die. One kiss. He wanted a kiss to speed his dying, just as I\u0027d given Luc. I\u0027d never performed that deed again, nor had I wanted to. Maybe it had been mercy, but I\u0027d felt like a killer. And yet, just like I had then, I knew it would ease the passing.... I shook my head. \"No.\" \"Nyx...showed me. Showed me my death: you.\" He coughed again and could speak no more. Still, he clung to life, with pain on his face and pleading in his eyes. Nyx? Nyx had shown him his death.... In the far reaches of my mind, I remembered finding him one day, right after Nyx had visited him and shown him a vision. He\u0027d recoiled from me at first and then later shrugged it off, laughing it away as the remnants of a nightmare. But I understood now. He\u0027d seen his death - seen me causing it. He\u0027d been afraid of me in those moments. My man in the dream had been a lie, but all the other visions she\u0027d shown had been true. My role in Erik\u0027s death had been destined...just not in any malicious way. That was how her dreams often worked. Never quite what you expected. And so, for the second time, I became an angel of mercy...an angel of death...whatever. I hunched down and kissed him, ignoring the blood on his mouth. Just like with Luc, there was only a breath of life left. Five more minutes, and Erik would have been gone without me. That tiny bit of life was as pure and good as I\u0027d known it would be. Erik would be rewarded in the afterlife. As I lifted my head and watched peace settle over his features, faint feelings flitted through me, as sometimes happened when I took energy. There was affection for me. It wasn\u0027t romantic love. More like fatherly love. Friendship. Fondness. And underneath it was a warning, a warning for me he never got to convey. I was so caught up in those last bursts of life, that I was only distantly aware when the lights and sirens came. Someone lifted me away, and I saw people huddling around him - too late. I stared at the commotion that followed - paramedics, police. I saw it without seeing it, answered questions without even knowing what I said. A policeman with kind eyes took it all down and spoke to me gently, often repeating himself. I don\u0027t know how long it all took. Maybe an hour, maybe more. I only remember assuring them over and over that I was okay, that I was going home, and that I would answer any other questions that came up. But when I drove away, still in shock, still barely grasping what had happened, I didn\u0027t go to West Seattle. I went to Pioneer Square, parking in a lucky street spot and then winding my way through the partying crowds. A few people gave me curious looks when I walked into the Cellar, looks I gave no heed to as I honed in on Jerome\u0027s table. He drank alone tonight, his dark eyes watching me intently as I approached. \"Georgie,\" he said when I came to a stop in front of him, \"what\u0027s the point of shape-shifting if you\u0027re going to walk around with blood on you?\" I looked down, only then registering the stains on my shirt. I turned back to him, ignoring the shape-shifting suggestion. \"Erik\u0027s dead,\" I told him, my voice flat. Jerome\u0027s face displayed no reaction. \"How?\" \"A break-in. Somebody shot him.\" Jerome sipped his bourbon and remained silent. \"Well? Don\u0027t you have anything to say?\" He scowled. \"What do you expect me to say? Should I cry? Put on sackcloth and ashes? Humans die all the time, Georgie. You\u0027re the one who mourns them - not me. I have no sentiment for any of them. You know that. And certainly not for him.\" I did know that. When Duane - one of Jerome\u0027s former employees - had been killed, the demon\u0027s only reaction had been annoyance. \"What\u0027s weird...\" I paused, putting to words what had been coalescing in the back of my mind this whole time. \"What\u0027s weird is that someone would break into a New Age store at all. It\u0027s not a good place for a robbery.\" \"If it has money, it\u0027s a good place for a robbery. If it\u0027s in a deserted strip mall, with only an old man there, it\u0027s even a better place for a robbery. Were the valuables gone?\" \"Yes,\" I admitted. \"Then why are you here wasting my time?\" \"The glass.\" \"The glass?\" \"The glass was broken from the inside,\" I said. \"The pieces were scattered on the sidewalk. Whoever did it didn\u0027t break the glass to get in. It just looked that way.\" Jerome sighed irritably. \"After everything you\u0027ve seen, can you honestly question the behaviors of humans?\" \"It just seems strange that someone like Erik - someone who deals in the supernatural and who had - \" I hesitated, about to say that he\u0027d been pondering my contract. Instead, I said, \"Who had just been involved with a big immortal blowout would be the victim of this by coincidence.\" \"Coincidences happen.\" \"I don\u0027t believe in coincidences anymore.\" \"Then replay your own words. Your \u0027big immortal blowout\u0027 is the answer. They might not live in our world, but do you think dream creatures don\u0027t have connections here?\" I frowned. \"What are you saying?\" \"That I thought it was too convenient for the Oneroi\u0027s overlord to walk away. He knew he couldn\u0027t touch me or any other immortal. But a human? One who had been actively involved with thwarting him?\" Jerome shrugged. \"It\u0027s revenge. He could arrange for that. We can\u0027t prove it - and we can\u0027t do anything. Make sure you understand that. I\u0027m not going to avenge your friend, if that\u0027s what you\u0027re asking for.\" I hadn\u0027t expected him to. In fact, I really wasn\u0027t sure what I\u0027d expected of him at all. Why had I come here? Because I was in shock. Because what had happened to Erik didn\u0027t make sense. Because Jerome often had answers for me. This time, he did too...but I wasn\u0027t sure that I believed them. The old adage came back: How do you know if a demon is lying? His lips are moving. \"Okay,\" I said with a small nod. His eyes narrowed a little. I think he was surprised I\u0027d given in so quickly. Glancing down, I shape-shifted the blood away. \"I\u0027m going to go home and...I don\u0027t know. I don\u0027t know what I\u0027m going to do.\" My confusion wasn\u0027t faked, and I hoped it would be enough to clear any suspicion. And really, what did he have to be suspicious of? I didn\u0027t even know. Two contracts. Jerome didn\u0027t try to stop me. I drove home with almost no realization of what I was doing until I pulled into the parking lot under my building. As soon as I opened my condo\u0027s door, I caught the faint smell of Chinese food. It smelled delicious, yet at the same time, it had that slight twinge of food that had been sitting around for a while. Roman sprawled on the couch, staring at nothing as far as I could tell. The TV was off. The cats remained unpetted. \"I\u0027m sorry I didn\u0027t call,\" I said. \"You won\u0027t believe what - \" \"I\u0027ve got something for you,\" he said. \"Two somethings, actually.\" The odd tone of his voice was about the only thing that could have stopped me from gushing about what had gone down at Erik\u0027s tonight. Even now, the events in the store were so surreal that it hardly seemed like something that had happened to me. Surely it was something I\u0027d seen in a movie. I sat down in the armchair near Roman, the queasy feeling in my stomach growing as I wondered what else could possibly happen tonight. \"What is it?\" He handed me a piece of paper. \"This was under the door when I got back with the food. I didn\u0027t mean to read it, but...well, it wasn\u0027t in an envelope or anything.\" I took it wordlessly, immediately recognizing the scrawled writing. Seth\u0027s. To a lot of people it would be undecipherable, but I\u0027d had a lot of practice in decoding his sloppy penmanship. Georgina, When I woke up without you in Mazatl¨¢n, I was so angry. I felt betrayed and abandoned and wondered if you\u0027d been playing me the entire time. Then, the more I thought about your words, the more my life began to come into focus. I still don\u0027t want to deal with the mess here in Seattle. I don\u0027t want to face Maddie. I don\u0027t want to face myself. But, I realized, I do want you to be proud of me. Maybe \"proud\" isn\u0027t the right word. Respect? Like? Love? I\u0027m not sure, but the events at Erik\u0027s have still left an impression. Really, lying in your arms has left an impression. I meant what I said: I\u0027d rather be alone than not be with you. Even apart, though, I can\u0027t stand the thought of you being disappointed in me. To regain your good opinion, I would risk almost anything. I\u0027d even come back here to face my demons. And I have come back here, despite how much I wish I could run away. Disappearing won\u0027t erase the bad things around me, however. Maybe you\u0027re a messenger of some sort, some agent of destiny. If not for you, I almost certainly wouldn\u0027t have returned, but it turns out I needed to. Terry and Andrea received their results yesterday. She only has months to live, something that I\u0027d almost swear was the doctor\u0027s joke. Only a few weeks ago, she seemed perfectly fine. I don\u0027t want to face that, any more than I want to face everything else. But they need me more than ever now, and I love them. I love them so much that I realize my own life and wants don\u0027t matter. As soon as I finish this book, I\u0027m putting everything else - even the new series - on hold. None of it matters. Only they do. They\u0027ll need me in the next few months. They\u0027ll need me more in the months after that. I don\u0027t know when we\u0027ll see each other again - though you\u0027ll notice I say \"when\" and not \"if.\" Like I mentioned in Mexico, I know better than to think the universe will keep us apart. Regardless, I want you to be happy wherever your life takes you - and I hope someday I can be worthy of your respect again. I also want you to know that in returning, I don\u0027t expect anything from you. I just wanted to make sure you understood what I did...and how you\u0027ve affected me. - Seth I looked up at Roman, who had been studying me while I read. I didn\u0027t know what astonished me more: Seth returning - because of me - or the god-awful news about Andrea. Both were monumental in their own ways. One was a tragedy of epic proportions. I swallowed, afraid if I fully processed it all, I\u0027d start crying. \"I\u0027m not sure how much more I can handle tonight,\" I said in a small voice. Roman\u0027s face was a mixture of sympathy and cynicism. \"Well, you\u0027ve got one more thing.\" He handed me a magazine. It was a trashy celebrity gossip one that was a popular source of mockery over at the bookstore. I couldn\u0027t imagine why he was giving something so trivial to me, in light of everything else that had gone on. One page was marked with a Post-it, and I flipped to it. It was a spread of assorted celebrity shots, the kind of candids that paparazzi delighted in: actors out with their children, pop stars spotted in Las Vegas nightclubs. I skimmed over the two pages, feeling a frown grow on my face as I tried to figure out why on earth I\u0027d care about this right now. Then, I found it. It was a small picture, shoved off to the side between much more interesting and larger ones of badly dressed actors. The caption read: Best-selling author Seth Mortensen enjoys some natural beauty in Mazatl¨¢n. And it showed Seth and me kissing on the beach.","sourceLink":"https://allnovel.net/succubus-shadows-georgina-kincaid-5/page-23.html","bookId":2058,"book":{"id":2058,"title":"Succubus Shadows (Georgina Kincaid #5)","description":"Storyline: Georgina Kincaid Book 5: Succubus Shadows Something ominous is tracking reluctant succubus Georgina Kincaid through her effervescent fifth urban fantasy adventure (after 2009\u0027s Succubus Heat). An elusive entity that Georgina can\u0027t name or fight invades her thoughts and nearly persuades her to kill herself. Georgina\u0027s boss, archdemon Jerome, and her angel friend Carter can\u0027t even detect the phenomenon, much less figure out how to stop it. Georgina\u0027s ex-boyfriend, Seth, is about to marry her friend Maddie, and what with pining after Seth, trying to protect him from another succubus, and being one of Maddie\u0027s bridesmaids, Georgia finds that suicide is starting to sound very tempting. Mead\u0027s lighthearted romp is plenty of fun on the surface; Georgina\u0027s struggles with the gray areas between good and evil provide a powerful undercurrent.","cover":"https://allnovel.net/images/succubus-shadows-georgina-kincaid-5.jpg","author":"Richelle Mead","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/succubus-shadows-georgina-kincaid-5.html","creation":"Oct 5, 2019 8:58:18 AM","modification":"Oct 5, 2019 11:58:01 PM"}}
