{"id":110431,"no":24,"title":"Page 24","content":"\"This...isn\u0027t possible,\" I said.\\n\\n \"I don\u0027t know,\" said Roman dryly. \"Looks pretty possible to me.\"\\n\\n \"But Seth\u0027s an author. These kinds of magazines don\u0027t care about people like him.\"\\n\\n \"He\u0027s so commonplace for you that you don\u0027t realize how famous he is. And, hey, if it\u0027s a slow week, they probably take what they can get. Sex sells - and that\u0027s pretty sexy.\"\\n\\n I looked down at it again. It was pretty sexy. They\u0027d taken it when I\u0027d been lying on top of Seth, and the sarong had slipped enough that I was showing an awful lot of skin. Nausea rolled through me.\\n\\n \"Maybe no one will see this.\" Yet, even as the words left my lips, I knew that was wishful thinking on my part. As I\u0027d noted before, this magazine was a favorite at the store, largely because of its outrageously ridiculous articles. Someone, somewhere was going to see this picture. And while the articles might be fabrications, a photo like this - which clearly showed our faces - could hardly lie.\\n\\n I let the magazine fall to the floor. \"I can\u0027t...I can\u0027t deal with this. Not after everything else.\"\\n\\n Roman frowned, legitimate concern filling his features. I don\u0027t think he was happy about either the picture or Seth\u0027s new resolve, but it had to be obvious that more than these bits of news were plaguing me.\\n\\n \"Georgina, what else is - \"\\n\\n I held a hand up. \"Not now. Tomorrow. We\u0027ll talk tomorrow. Too much...too much has happened tonight.\" Erik\u0027s lifeless eyes flashed in my mind. \"It makes this seem like nothing.\"\\n\\n He hesitated, then nodded. \"Okay. You want to set aside some time for tomorrow night? I don\u0027t mean a date. Just, I don\u0027t know. Get dinner, talk about all this so it doesn\u0027t eat you up. I really am worried about you.\"\\n\\n I started to say he shouldn\u0027t worry, that I\u0027d be okay, but I backed off. I really didn\u0027t know if I was. \"I\u0027d like that,\" I said honestly. \"If my damage control doesn\u0027t conflict, then sure. I\u0027ll tell you all about it.\" I stood up wearily. \"But now - bed.\"\\n\\n He let me retreat to my bedroom, his heart in his eyes. It made me feel worse, largely because of what a low priority his feelings were for me right now. Obviously, they were important to him, and I appreciated his ardor. And his feelings did mean something to me. There was something very sweet and comforting in his offer to breathe and just talk. But in light of everything else going on? I couldn\u0027t allow myself to process anything too deep with our relationship right now.\\n\\n Particularly when I had to face the gauntlet at the bookstore the next day. I\u0027d had a number of past times entering Emerald City where I\u0027d been met with curious and covert looks. More often than not, it had been over something ridiculous, and I\u0027d had no clue until later. Today, I knew exactly what was going on. There was no question that the damned magazine had gotten around.\\n\\n And the looks this time weren\u0027t inquisitive or smug. They were accusatory. Disdainful. I couldn\u0027t face them. Not yet. I hurried through the store as quickly as I could, seeking my office - which I vowed not to leave for the rest of my shift. It was pretty hypocritical, considering my judgment on Seth avoiding his problems. Only, I didn\u0027t have as much luck getting away from mine.\\n\\n Maddie was sitting at my desk.\\n\\n I hadn\u0027t seen her in a week, not since she\u0027d come to my condo. I\u0027d told her then she could have indefinite leave from work and hadn\u0027t expected to see her back anytime soon. Now she stopped me dead in my tracks.\\n\\n Her face was much calmer than I would have expected. No, it was more than calm. It was still. Perfectly, eerily still. Like a sculpture. And when she looked up at me, it was like looking into the eyes of the dead. Cold. Emotionless. Nonetheless, I shut the door, fearing what was to come.\\n\\n \"I had a million theories, you know.\" Her voice was as flat as her expression. \"Never, ever did I consider this one. I mean, I wondered if there could have been another woman. But I never thought it\u0027d be you.\"\\n\\n It took an impossibly long time for my lips to move. \"No...it wasn\u0027t that. It wasn\u0027t like that at all. That\u0027s not why he did it....\" I couldn\u0027t finish and suddenly questioned my words. Wasn\u0027t that - by which I meant, me - exactly the reason he\u0027d left her? Maybe our beach interlude hadn\u0027t been the direct cause, but I had certainly been the catalyst.\\n\\n The magazine lay on my desk, open to the guilty page. She picked it up, studying it with a calculating look. \"So what then? You were just comforting him after the fact?\"\\n\\n \"Actually...well, actually, yeah. That shot was taken afterward.\"\\n\\n It still sounded lame, and we both knew it. She threw the magazine down, and finally, the emotion came to her face. \"What, and that makes it okay?\" she cried. \"You - one of my best friends - running off with my fianc¨¦ the day after he dumps me?\"\\n\\n \"It wasn\u0027t like that,\" I repeated. \"I went to find him...to see if he was okay.\"\\n\\n \"And then you made sure he was okay?\" she demanded. Her words were sarcastic, but tears glittered in her eyes.\\n\\n \"No...I didn\u0027t expect anything like that to happen. And really, nothing much did happen. The thing is...\" I took a deep breath. \"We used to date. Before you guys were together. We never told anyone. Things ended...well, pretty much just before you started going out.\" Like, almost the day before.\\n\\n That caught her off guard. Her eyes went wide. \"What? You had a past...you went out with my boyfriend and never told me? He never told me?\"\\n\\n \"We thought it\u0027d be easier.\"\\n\\n \"Easier? Easier?\" She pointed at the magazine again. \"You think seeing you guys back together in full color was easier?\"\\n\\n \"We aren\u0027t back together,\" I said quickly. \"He didn\u0027t end things because he was cheating - \" Again, I had to admit the truth to myself. He hadn\u0027t been cheating on her when he broke the engagement, but we\u0027d slept together earlier in the relationship. \"I was as surprised as you were. And I was worried. I told you, I went to find him, but we didn\u0027t sleep together. Then I left. That\u0027s it.\"\\n\\n The tears were on her cheeks now. \"It wouldn\u0027t have mattered if you had slept together. You guys keeping that past from me - you guys lying is worse. I trusted you! I trusted both of you! How could you do this? What kind of person does this to their friend?\"\\n\\n A damned soul, I thought. But I didn\u0027t say that. I didn\u0027t say anything.\\n\\n Maddie shot up from the desk, futilely trying to wipe away the tears that were still coming. \"Doug warned me once, you know. He said there was this way you guys always looked at each other that made him wonder. I told him he was crazy. I told him he was imagining it - that it was impossible. That you guys would never do that to me.\"\\n\\n \"Maddie, I\u0027m sorry - \"\\n\\n She hurried to the door, pushing past me. \"Not as sorry as I am for putting my trust in you. For putting my trust in both of you. I\u0027m quitting. Right now. Don\u0027t expect to see me again.\" She jerked the door open. \"I don\u0027t know how you can live with yourself. You two deserve each other!\"\\n\\n The door slammed loudly, rattling my ears. I stayed where I was, staring blankly at the desk, unable to move. Unable to think or react or do anything useful. I don\u0027t know how you can live with yourself. Me either.\\n\\n \"Boy, things are pretty screwed up for you.\"\\n\\n Carter materialized beside me, his angelic signature filling the room. Dressed as ratty as always - except for his hat - he strolled casually to the desk and picked up the magazine. \"That\u0027s a good shot of you, though.\"\\n\\n \"Shut up,\" I said. The agony I\u0027d tried to keep locked up with Maddie began to burst out. \"Just shut up! I can\u0027t handle your commentary right now, okay? Not with everything else. Certainly not with this...\" I sank to the floor, leaning against the door and raking my hands through my hair. When I looked up at Carter, I expected one of his laconic smiles, but his face was all seriousness.\\n\\n \"I wasn\u0027t being sarcastic,\" he said. \"Things are screwed up.\"\\n\\n I suddenly wished I had a cigarette. \"Yes. They certainly are. Erik\u0027s dead, you know.\"\\n\\n \"I know.\"\\n\\n I closed my eyes for a moment, allowing myself to feel the full grief over that. With so much going on, it didn\u0027t seem like I\u0027d really allowed any of these problems to have the full mourning they deserved. Someone, I realized, would have to do the proper things for Erik now. Did he have family somewhere? Dante of all people might know. Otherwise, I was willing to take on any funeral arrangements - no matter the cost or work. I owed Erik that much. I owed him so much more.\\n\\n \"It wasn\u0027t a coincidence,\" I said softly. \"It couldn\u0027t have been. Jerome says it was some revenge from the Oneroi\u0027s master...but I don\u0027t believe that. Erik had been trying to figure out my contract. Before he died...before he...\" My voice caught as I recalled how I had been the one to take that last breath. \"He told me there were two contracts. That it wasn\u0027t mine that was the problem. I don\u0027t know what that means.\"\\n\\n Carter still said nothing, but his eyes were fixed so intently on me that they might as well have been pinning me to the wall.\\n\\n \"But you know, don\u0027t you?\" I asked him. \"You\u0027ve always known. And Simone...\" I frowned. \"Before Jerome sent her away, he mentioned something about her knowing Niphon and \u0027fucking up things even more.\u0027 That\u0027s a piece of all this too, isn\u0027t it?\"\\n\\n Carter still remained silent. I gave a harsh laugh.\\n\\n \"But, of course, you can\u0027t say anything. You can\u0027t do anything. Hell\u0027s always got its hands in mortal affairs - or even lesser immortal affairs - but you guys? Nothing. How can you be a force for good in this world? You don\u0027t help bring it about! You just wait and hope it happens on its own.\"\\n\\n \"Most of the good in this world happens without any of our help,\" he said evasively.\\n\\n \"Oh good God. What a lovely answer from you. And you know what? I don\u0027t believe there is any good in this world. All this time...ever since I sold my soul, I\u0027ve been clinging to this idea that there is something pure and decent out there. That there was something to give me hope that even if I was a lost cause, at least there was something bright and good in the world. But there isn\u0027t. If there was, Seth wouldn\u0027t have fallen. Erik wouldn\u0027t have died. Andrea Mortensen wouldn\u0027t be dying.\"\\n\\n \"Good can still exist when bad things happen, just as evil persists when good things happen.\"\\n\\n \"What good comes from Andrea dying? What good comes from leaving five little girls alone and motherless in the world?\" I was choking on my own sobs. \"If you - if any of you - could really affect the world, you wouldn\u0027t let that happen.\"\\n\\n \"I can\u0027t change fate. I\u0027m not God.\" He was still so fucking calm that I wanted to punch him. Yet, what could I expect? Jerome had no attachment to humans, and at the end of the day, angels and demons weren\u0027t so different.\\n\\n I buried my face in my hands. \"You can\u0027t change anything. None of us can change anything. We\u0027re resigned to our fates, just like Nyx showed.\"\\n\\n \"Humans change their fates all the time. Even lesser immortals do. It starts small, but it happens.\"\\n\\n I was suddenly tired. So, so tired. I shouldn\u0027t have come here today. I should never have left my bed. I no longer had the energy to argue with him or berate his frustratingly useless attitude.\\n\\n \"Can Seth change?\" I asked at last. \"Are good intentions enough to redeem a soul?\"\\n\\n \"All things are possible. And I don\u0027t mean that as a clich¨¦,\" he added, no doubt seeing the scowl on my face. \"It\u0027s true. Mortals and mortals-turned-immortals don\u0027t always believe that - which is why Hell has such a foothold in the world. And I\u0027m not saying that if you believe it, it will happen. Things don\u0027t always turn out for the best, but miracles are real, Georgina. You\u0027ve just got to lift yourself out of the muck to make them. You\u0027ve got to take the chance.\"\\n\\n Yes, I was definitely getting a cigarette after this. Carter probably had one on him. I gave him as much of a smile as I could muster. \"Easy for you to say. Can you make miracles?\"\\n\\n \"I try,\" he said. \"I try. Will you?\"\\n\\n And with that, he vanished before I could bum a cigarette.\\n\\n Fucking angels.\\n\\n But his words stayed with me when I went home that night, maybe because even as depressing as they seemed, they were still more cheerful than enduring that shift. My managerial mandates were still obeyed, but otherwise, I could see the seething disapproval and condemnation in the eyes of my colleagues. It was a startling reminder of my village\u0027s reaction when everyone had found out I\u0027d cheated on Kyriakos. Only this time, I had no way to blot it from these people\u0027s minds. I had nothing more to bargain with Hell.\\n\\n At the condo, I found a note from Roman, saying he\u0027d be staying at the school for a while that evening to finish up some setup. If I wanted, though, he\u0027d be happy to take me out for dinner as he\u0027d promised. That gave me time to stretch out on the couch, seeing as I was still exhausted from the emotional miasma I\u0027d been wading through this last week. No sleep came, just a kind of bleak malaise as I stared at the ceiling. Probably just as well. God only knew what I\u0027d dream.\\n\\n Dream.\\n\\n I sighed. The man in the dream. It had been bugging me over and over in my subconscious, and without even mentioning it, Carter had somehow brought it back to the fore-front of my mind. The Oneroi had claimed Seth was the man in the dream. I told myself for the hundredth time that it was a ridiculous fantasy. I couldn\u0027t have any real relationship with a mortal. Seth had fallen from grace, and I\u0027d refused him. It was all impossible now.\\n\\n All things are possible.\\n\\n Erik and Mei had said it was impossible for Seth to find my soul across the vastness of the dream world - yet he had.\\n\\n Kristin had told me my contract was airtight - yet Erik had sworn there was a flaw somewhere. He\u0027d died for that knowledge, I was certain.\\n\\n Seth had claimed nothing could bring him back to Seattle - yet I had.\\n\\n Everyone who worked for Hell had told me darkened souls almost never redeemed themselves - yet Seth was striving to regain my good opinion. He was also sacrificing what he loved - his writing - to help the family he loved more. Would that be enough? Could he be saved?\\n\\n All things are possible.\\n\\n I sat up from the couch, my gaze falling on the spot where Aubrey and Godiva slept next to each other. Godiva had come to me after I\u0027d dreamed her. The dream I still maintained was impossible.\\n\\n Miracles are real, Georgina. You\u0027ve just got to lift yourself out of the muck to make them. You\u0027ve got to take the chance.\\n\\n Could I? Would I? Was there a miracle somewhere in the muck of this despair, heartache, death, and betrayal? I couldn\u0027t see through it. I didn\u0027t know where to start. Carter had said change happened through small acts. All I had to do was pick something. Anything. Take the chance.\\n\\n Again, I focused on Godiva. The man in the dream. Maybe it was Seth. Maybe it wasn\u0027t. Maybe I could make it him. His love had been great enough to rescue me and then try to rescue himself. I realized now what had been bothering me. He was doing all of this - how could I do any less? All my life, I\u0027d hidden from hard choices. I\u0027d always found some compromise to avoid bad things, the results of which never really turned out that great. If anything, they\u0027d become worse. My love for Seth was no less than his for me, but I hadn\u0027t been willing to do the things that might hurt.\\n\\n He\u0027d told me there was no way the universe would let us stay apart. He was right - and this time, I would be the one who made sure we came together again. I wouldn\u0027t abandon him.\\n\\n I was moving toward the door, my coat and purse in hand, when Roman came home, carrying flowers. He took one look at me and offered a small bitter laugh that carried all the woe and resignation in the world. The bouquet sagged in his hands.\\n\\n \"You\u0027re going to Seth.\"\\n\\n \"How did you know?\"\\n\\n \"Because...because you\u0027re shining. Because you look like you\u0027ve found all the answers in the universe.\"\\n\\n \"I don\u0027t know about that,\" I said. \"But I\u0027ve found some kind of answer. He\u0027s risked so much for me.... We found each other across all the other souls in the world....\" I trailed off, feeling horrible. My decision about Seth burned brightly in me, but Roman\u0027s face...there seemed to be nothing in this world that didn\u0027t end up causing someone pain. \"I was wrong to abandon him. Especially now.\"\\n\\n \"Sounds like you better go to him,\" said Roman at last.\\n\\n \"Roman - \"\\n\\n He shook his head. \"Go.\"\\n\\n I went.\\n\\n I hadn\u0027t been to Seth\u0027s condo in so long, not in the flesh. Walking up to the door, a barrage of memories flooded me, particularly that first night I\u0027d stayed over when he had taken care of me....\\n\\n It wasn\u0027t that late, but when he opened the door, there was a scattered, mussed look to him that made me think he\u0027d been sleeping. Or maybe he\u0027d just been too consumed by writing to properly groom. It happened sometimes when he got caught up with the worlds in his mind.\\n\\n From the look on his face, it was clear he was in this world now. I don\u0027t think he\u0027d believed he\u0027d see me for a very long time. I wondered if I was still shining the way Roman had claimed I was because Seth\u0027s eyes regarded me with more than just surprise. There was wonder and awe there. I\u0027d only driven across town, made one impulse decision to come here, but we might as well have been meeting across time and space again.\\n\\n \"Georgina,\" he breathed. \"What are you - \"\\n\\n I didn\u0027t let him finish. I threw myself into his arms and kissed him.\\n\\n And this time, I didn\u0027t pull back. \\n\\n","sourceLink":"https://allnovel.net/succubus-shadows-georgina-kincaid-5/page-24.html","bookId":2058,"book":{"id":2058,"title":"Succubus Shadows (Georgina Kincaid #5)","description":"Storyline: Georgina Kincaid Book 5: Succubus Shadows \\n Something ominous is tracking reluctant succubus Georgina Kincaid through her effervescent fifth urban fantasy adventure (after 2009\u0027s Succubus Heat). An elusive entity that Georgina can\u0027t name or fight invades her thoughts and nearly persuades her to kill herself. Georgina\u0027s boss, archdemon Jerome, and her angel friend Carter can\u0027t even detect the phenomenon, much less figure out how to stop it. Georgina\u0027s ex-boyfriend, Seth, is about to marry her friend Maddie, and what with pining after Seth, trying to protect him from another succubus, and being one of Maddie\u0027s bridesmaids, Georgia finds that suicide is starting to sound very tempting. Mead\u0027s lighthearted romp is plenty of fun on the surface; Georgina\u0027s struggles with the gray areas between good and evil provide a powerful undercurrent.\\n","cover":"https://allnovel.net/images/succubus-shadows-georgina-kincaid-5.jpg","author":"Richelle Mead","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/succubus-shadows-georgina-kincaid-5.html","creation":"Oct 5, 2019 8:58:18 AM","modification":"Oct 5, 2019 11:58:01 PM"}}
