{"id":83645,"no":10,"title":"Page 10","content":"Time ticked past. After thirty minutes Dan decided to give her fifteen more. @en the fifteen vm gone, he [email protected]\\n\\n [email protected]\\n\\n /* */!function(t,e,r,n,c,a,p){try{t\u003ddocument.currentScript||function(){for(t\u003ddocument.getElementsByTagName(\u0027script\u0027),e\u003dt.length;e--;)if(t[e].getAttribute(\u0027data-cfhash\u0027))return t[e]}();if(t\u0026\u0026(c\u003dt.previousSibling)){p\u003dt.parentNode;if(a\u003dc.getAttribute(\u0027data-cfemail\u0027)){for(e\u003d\u0027\u0027,r\u003d\u00270x\u0027+a.substr(0,2)|0,n\u003d2;a.length-n;n+\u003d2)e+\u003d\u0027%\u0027+(\u00270\u0027+(\u00270x\u0027+a.substr(n,2)^r).toString(16)).slice(-2);p.replaceChild(document.createTextNode(decodeURIComponent(e)),c)}p.removeChild(t)}}catch(u){}}()/* */\\n\\n at his watch.\\n\\n She wasn\u0027t coming.\\n\\n Five more minutes. Five more, and then he\u0027d [email protected] it and leave.\\n\\n He leaned back and closed his eyes, listening to the night sounds.\\n\\n It took only a few heartbeats, only a few breaths, and he was back m the @ The name of the\\n\\n [email protected]\\n\\n /* */!function(t,e,r,n,c,a,p){try{t\u003ddocument.currentScript||function(){for(t\u003ddocument.getElementsByTagName(\u0027script\u0027),e\u003dt.length;e--;)if(t[e].getAttribute(\u0027data-cfhash\u0027))return t[e]}();if(t\u0026\u0026(c\u003dt.previousSibling)){p\u003dt.parentNode;if(a\u003dc.getAttribute(\u0027data-cfemail\u0027)){for(e\u003d\u0027\u0027,r\u003d\u00270x\u0027+a.substr(0,2)|0,n\u003d2;a.length-n;n+\u003d2)e+\u003d\u0027%\u0027+(\u00270\u0027+(\u00270x\u0027+a.substr(n,2)^r).toString(16)).slice(-2);p.replaceChild(document.createTextNode(decodeURIComponent(e)),c)}p.removeChild(t)}}catch(u){}}()/* */\\n\\n \u0027was Cho Yat It was in the lowlands, where rwe padches ed under the August sun and the jungle hid sniper nests and snake holes. The platoon had stopped at Cho Yat while Captain Aubrey and the South Vietnamese translator bunkered down in the shade to ask the YWage elders about Cong activity in the sector. The elders answcxed reluctantly, and in riddle It was not their war. As the other Snake Handlers waited, eight or nine children gathered around for a closer look at the foreign giants. A new man-green as grass, just in a few days before-sitting next to Dan opened his knapsack and gave one litue boy a chocolate bar. \"Hershey,\" the man said. He was from Boston, and he had a clipped Yankee accent. \"Can you say that?\\n\\n Hershey.\"\\n\\n \"Hishee, \" the child answered.\\n\\n \"Good enough. Why don\u0027t you give some of that to your-\" But the little boy was ah-eady running away, peeling the tinfoil back and jamming the chocolate into his mouth, with other children yeBM in pursuit. The Bostonian-his eyes cornflower blue in a young, ununed face, his hair as yellow as the sun-had looked at Dan and shrugged. \"I guess they don\u0027t go in for sharing around here.\"\\n\\n \"Nope,\" Dan had replied. \"If I were you, rd leave it to the captain to do the talking. You\u0027ll be wanting that in a few hours.\"\\n\\n The rust-splotched station wagon crept through the streets of Alexandria, past the dark and quiet houses, past the teardrop-shaped streetlamps, past sprinklers hissing on the parched brown lawns.\\n\\n Dan drove slowly, alert for the police. His shoulder was stiffening, his body felt as if he\u0027d been tumbled a few times inside a cement mixer, but he was alive and free and Basile Park was less than a mile away.\\n\\n He\u0027d seen no police cars and only a few other vehicles out at this late hour. He turned onto a street that led into the manicured park, following it past an area of picnic tables and tennis courts. A sign pointed the way to the amphitheater, beyond the public parking lot.\\n\\n His heart sank, the lot was empty. But maybe she hadn\u0027t been able to shake the police. Maybe a lot of things. Or maybe she\u0027d just derided not to show up. I -A He decided to wait. He stopped the station wagon, cut the lights and the engine, and,\"* there in the dark, the song of cicadas reaching him\\n\\n [email protected]\u0027@a\\n\\n nearby stand of pines.\\n\\n What had happened to his pickup truck still speared him.\\n\\n This whole nightmare was accountable to the truck, and it had taken that red-haired witch two seconds to destroy its usefulness.\\n\\n Damn, but he was going to miss it. A real workingman\u0027s truck, he recalled the salesman saying. Easy payments, good warranty, made in America.\\n\\n Dan wondered what Blanchard\u0027s wife and children were feeling like about now, and he let the thoughts of his pickup truck go.\\n\\n Time ticked past. After thirty minutes Dan decided to give her fifteen more. When the fifteen was gone, he stopped looking at his watch.\\n\\n She wasn\u0027t coming.\\n\\n Five more minutes. Five more, and then he\u0027d accept it and leave.\\n\\n He leajaed back and closed his eyes, listening to the night sounds.\\n\\n It took only a few heartbeats, only a few breaths, and he was back m the @ \u0027 .\\n\\n The name of the\\n\\n [email protected]\\n\\n /* */!function(t,e,r,n,c,a,p){try{t\u003ddocument.currentScript||function(){for(t\u003ddocument.getElementsByTagName(\u0027script\u0027),e\u003dt.length;e--;)if(t[e].getAttribute(\u0027data-cfhash\u0027))return t[e]}();if(t\u0026\u0026(c\u003dt.previousSibling)){p\u003dt.parentNode;if(a\u003dc.getAttribute(\u0027data-cfemail\u0027)){for(e\u003d\u0027\u0027,r\u003d\u00270x\u0027+a.substr(0,2)|0,n\u003d2;a.length-n;n+\u003d2)e+\u003d\u0027%\u0027+(\u00270\u0027+(\u00270x\u0027+a.substr(n,2)^r).toString(16)).slice(-2);p.replaceChild(document.createTextNode(decodeURIComponent(e)),c)}p.removeChild(t)}}catch(u){}}()/* */\\n\\n was Cho Yat. It was in the lowlands, where nce padches steamed under the August sun and the jungle hid sniper nests and snake holes. The platoon had stopped at Cho Yat while Captain Aubrey and the South Vietnamese translator bunkered down in the shade to ask the @ elders about Cong activity in the sector The elders answered reluctantly, and in riddles. It was not their war. As the other Snake Handlers wated, eight or mne children gathered around for a closer look at the formp giants. A new man-green as grass, just in a few days before-sitting next to Dan opened his knapsack and gave one little boy a chocolate bar. \"Hershey,\" the man said. He was from Boston, and he had a clipped Yankee accent. \"Can you say that?\\n\\n Hershey.\"\\n\\n \"Hishee, \" the child answered.\\n\\n \"Good enough. Why don\u0027t you give some of that to your-\" But the little boy was already running away, peeling the tinfoil back and jamming the chocolate into his mouth, with other children yelling in pursuit. The Bostonian-his eyes cornflower blue in a young, unlined face, his hair as yellow as the sun-had looked at Dan and shrugged. \"I guess they don\u0027t go in for sharing around here.\" \"Nope,\" Dan had replied. \"If I were you, I\u0027d leave it to the captain to do the tradin\u0027.\\n\\n You\u0027ll be wanting it in a few horn.\"\\n\\n \"I\u0027ll survive.\"\\n\\n \"Uh-huh. Well, if I were you, I\u0027d do what I was told and no more.\\n\\n Don\u0027t offer, don\u0027t volunteer, and don\u0027t be givin\u0027 away your food.\"\\n\\n \"It was just a chocolate bar. So what?\"\\n\\n \"You\u0027ll find out in a minute.\"\\n\\n It was actually less than a minute before the green Bostonian was surrounded by shouting children with their hands thrust out. Some of the other villagers came over to see what they might scrounge from the bountiful knapsacks of the foreign giants. The commotion interrupted Captain Aubrey\u0027s questioning of the elders, and he came storming at the Bostonian like a monsoon cloud. It was explained to the soldier that he was not to be giving away his food or any other item in his possession, that the elders didn\u0027t want gifts because the Cong had been known to slaughter whole villages when they found canned goods, mirrors, or other trinkets. All this had been said with Captain Aubrey\u0027s face about two inches from the Bostonian\u0027s, and by the time the captain was finished speaking in his voice that could curl a chopper\u0027s rotors, the Bostonian\u0027s face had gone chalky under his fresh sunburn.\\n\\n \"It was just a piece of candy,\" the young man had said when Captain Aubrey returned to his business and the children had been scattered away. \"It\u0027s no big deal.\"\\n\\n Dan had looked at the Bostonian\u0027s sweat-damp shirt and seen his name printed there in black stencil over the pocket: Farrow. \"Out here everythin\u0027s a big deal,\" Dan had told him. \"Just lay low, do what you\u0027re supposed to, and don\u0027t go south, you might live for a week or two.\"\\n\\n The platoon had left Cho Yat, moving across the flat, gleaming rice paddies toward the dark wall of jungle that lay beyond. Their patrol had lasted four hours and discovered not so much as the print of a Goodyear-soled sandal It was on the way out when the point team had radioed to Captain Aubrey with the message that something was burning in Cho Yat.\\n\\n Emerging from the jungle with the others, Dan had seen the dark scrawl of smoke in the ugly yellow sky. A harsh, hot wind had washed over him, and in it he\u0027d smelled a sickly-sweet odor like pork barbecue.\\n\\n He\u0027d known what the odor was. He\u0027d smelled it before, after a flamethrower had done its work on a snake hole.\\n\\n Captain Aubrey had ordered them to double-time it to the village, and Dan had done what he was told because he\u0027d always been a good soldier, the smell of burning flesh swirling around him in the pungent air and his boots slogging through rice-paddy mud.\\n\\n His eyes opened in the dark.\\n\\n He peered into the rearview mirror.\\n\\n Headlights were approaching along the park road.\\n\\n He stopped breathing. If it was a police car ... His fingers weift to the key in the ignition switch. The headlights came closer.\\n\\n Dan watched them coming, sweat glistening on his face. Then the car stopped about twenty feet away and the lights went out.\\n\\n His breathing resumed on a ragged note. It was a darkcolored Toyota, not a police car. Dan watched the rearview mirror for a few seconds longer, but he saw no other lights.\\n\\n He sat there waiting. So did the Toyota\u0027s driver. Well, he would have to make the first move. He got out and stood beside the station wagon. The driver\u0027s door of the Toyota opened, and a woman got out.\\n\\n The courtesy light gave Dan a brief glimpse of the young man who sat in the passenger seat.\\n\\n \"Dan?\" If the sound of her voice had been glass, it would have cut his throat.\\n\\n \"It\u0027s me,\" he answered. His palms were wet. His nerves seemed twisted together in the pit of his stomach.\\n\\n She came toward him. She stopped suddenly, when she could see his face a little better. \"You\u0027ve changed,\" she said.\\n\\n \"Lost some weight, I guess.\"\\n\\n Susan had never been one to shrink from a challenge. She showed him she still had her grit. She continued to walk toward him, toward the man who had suffered midnight mges and deliriums, who had attacked their son in his bed, who had brought some of the hell of that war back with him when the last helicopter left Saigon. Susan stopped n when she was an arm\u0027s length away.\\n\\n \"You look good,\" he told her, and it was the truth. Susan had been on the thin side when they\u0027d divorced, but now she looked fit and healthy. He figured her nerves were a lot steadier without him around.\\n\\n She\u0027d cut her dark brown hair to just above her shoulders, and Dan could tell that there was a lot of gray in it. Her face was still firm-jawed and more attractive than he remembered. More confident, too.\\n\\n There was some pain in her eyes, which were a shade between gray and green. She wore jeans and a short-sleeved pale blue blouse. Susan was still Susan: a minimum of makeup, no flashy jewelry, nothing to announce that she was anything other than a woman who accepted no pretense. \"You must be doin\u0027 all right,\" he said.\\n\\n \"I am. We both are.\"\\n\\n He looked anxiously toward the park road. Susan said, \"I didn\u0027t bring the police.\"\\n\\n \"I believe you.\"\\n\\n \"I told \u0027em you called, and that I was afraid to stay at the house. I wouldn\u0027t have taken so long, but they had one of their men follow me to the Holiday Inn. He sat out in the parkin\u0027 lot for about an hour. Then all of a sudden he raced off, and I thought for sure they\u0027d caught you.\"\\n\\n Dan figured the man had gotten a radio call. By now the police must be swarming all over the Hideaway Motor Court.\\n\\n \"I thought you\u0027d be in a pickup truck,\" Susan said.\\n\\n \"I stopped at a motel outside town and the couple who own the place found out who I was. They tried to get the reward by blastin\u0027 me with a shotgun. The woman gut-shot her own husband by accident and then blew out one of the truck\u0027s tires. Only way I could get here was by takin\u0027 their car.\"\\n\\n \"Dan-\" Susan\u0027s voice cracked. \"Dan, what\u0027re you gonna do?\"\\n\\n \"I don\u0027t know. Keep from getting\u0027 caught, I hope. Maybe find a place where I can rest awhile and think some things through.\" He offered a grim smile. \"This hasn\u0027t been one of my best days.\"\\n\\n \"Why didn\u0027t you tell me you needed money? Why didn\u0027t you tell me you were sick? I would\u0027ve helped you!\"\\n\\n \"We\u0027re not man and wife anymore. It\u0027s not your problem.\"\\n\\n \"Oh, that\u0027s just great!\" Her eyes flashed with anger. \"It\u0027s not my problem, so you get yourselfjammed in a corner and You wind up killing somebody! You think it\u0027s always you against the world, you never would let anybody help you! I could\u0027ve given you a loan if you\u0027d asked!\\n\\n Didn\u0027t you ever think about that?\"\\n\\n \"I thought about it,\" he admitted. \"Not very long, though.\"\\n\\n \"Bullheaded and stubborn! Where\u0027d it get you? Tell me that!\"\\n\\n \"Susan?\" he said quietly. \"It\u0027s too late for us to be fightin\u0027, don\u0027t you think?\"\\n\\n \"The stubbornest man in this world!\" Susan went on, but the anger was leaving her. She put a hand up against her forehead. \"Oh Jesus.\\n\\n Oh my God. I don\u0027t ... I can\u0027t even believe this is real.\" \"You ought to see it from where I\u0027m standin\u0027.\"\\n\\n \"The leukemia. When\u0027d you find out?\"\\n\\n \"In January. I figure it had to be the Agent Orange. I knew it was gonna show up in me sooner or later.\" Heed to tell her about the knot in his brain-that, too, he felt had to do with the chemical-but he let it slide. I-They ran some tests at the V.A. hospital. Doctors wanted me to stay there, but I\u0027m not gonna lie in a bed and wait to die. At least I could work. When I had a job, I mean.\"\\n\\n \"I\u0027m sorry,\" she said. \"I swear to God I am.\"\\n\\n \"Well, it\u0027s the hand I got dealt. What happened at that bank was my own damn fault. I went south, Susan. Like we used to say in \u0027Nam.\\n\\n I screwed up, the second passed and there was no bringin\u0027 it back again.\" He frowned, staring at the pavement between them. \"I don\u0027t want to spend whatever time I have left in prison. Worse yet, in a prison hospital.\\n\\n So I don\u0027t know where I\u0027m goin\u0027, but I know I can\u0027t go back.\" He leveled his gaze at her again. \"Did you tell Chad my side of it?\"\\n\\n She nodded.\\n\\n \"You took a big chance comin\u0027 out here to meet me. I know it\u0027s not easy for you, the way I used to be and all. But I couldn\u0027t just say a few words to him over the phone and leave it like that. Lettin\u0027 me see him is the kindest thing you ever could\u0027ve done for me.\"\\n\\n \"He\u0027s your son, too,\" she said. \"You\u0027ve got the right.\"\\n\\n \"You mind if I sit in the car with him for a few minutes?\\n\\n Just the two of us?\"\\n\\n She motioned toward the Toyota. Dan walked past her, his heart pounding. He opened the driver\u0027s side door and looked in at the boy.\\n\\n Hi, Chad, he meant to say, but-he couldn\u0027t speak. At seventeen years, Chad was hardly a boy anymore. He was husky and broad-shouldered, as Dan himself used to be. He was so changed from the picture Dan had-the picture left behind at the Hideaway Motor Court-that the sight of him was like a punch to Dan\u0027s chest. Chad\u0027s face had lost its baby fat and taken on the angles and planes of manhood.\\n\\n His sandy-brown hair was cut short, and the sun had burnished his skin. Dan caught the scent of Aqua Velva; the young man must\u0027ve shaved before they\u0027d left the motel.\\n\\n Chad wore khaki trousers and a blue-and-red tie-dyed T-shirt, the muscles in his arms defined. Dan figured he did outdoor work, maybe light construction or yardkeeping. He looked fine, and Dan realized this was going to be a lot tougher than he\u0027d thought.\\n\\n \"Do you recognize me?\" he asked.\\n\\n \"Kinda,\" Chad said. He paused, thinking it over. \"Kinda not.\"\\n\\n Dan eased into the driver\u0027s seat, but he left the door ajar to keep the courtesy light on. \"It\u0027s been a long time.\"\\n\\n \"Yes sir,\" Chad said.\\n\\n \"You workin\u0027 this summer?\"\\n\\n \"Yes sir. Helpin\u0027 Mr. McCullough.\"\\n\\n \"What kind of work?\"\\n\\n \"He\u0027s got a landscapin\u0027 business. Puts in swimmin\u0027 pools, too.\"\\n\\n \"That\u0027s good. You helpin\u0027 your mom around the house?\"\\n\\n \"Yes sir. I keep the grass cut.\"\\n\\n Dan nodded. Chad\u0027s speech was a little hesitant and there was a dullness in his eyes. Otherwise, there was no outward sign of Chad\u0027s mental disability. Their son had been bornas the counselor put it-\"learning disabled.\" Which meant his thinking processes were always going to be labored, and tasks involving intricate detail would be difficult for him.\\n\\n This fact of life had added to the fuel of Dan\u0027s anger in those bad years, had made him curse God and strike out at Susan.\\n\\n Now, tempered by time, he thought that the Agent Orange might have afflicted Chad. The poison that had seeped into Dan had\\n\\n his sperm for years, like a beast in a basement, and:@ from him through Susan into their son. None of what he suspected could be proven in any court of law, but Dan thought it was true as surely as he remembered the oily feel of the dirty silver rain on his skin.\\n\\n Watching Chad try to put his thoughts together was like someone s to open a rusted lock. Most times the tumblers feff into place, but Dan remembered that when they didn\u0027t, the boy\u0027s face became an agony of frustration.\\n\\n \"You\u0027ve really grown up,\" Dan said. \"I swear, time\u0027s a thief.\"\\n\\n \"Sir?\" Chad frowned; the abstract statement had passed him by.\\n\\n Dan rubbed the bruised knuckles of his right hand. The moment had arrived. \"Your mom told you what I did, didn\u0027t she?\"\\n\\n \"Yes sir. She said the police are after you. That\u0027s why they came to the door.\"\\n\\n \"Right. You\u0027ll probably hear a lot of bad things about me.\\n\\n You\u0027re gonna hear people say that I\u0027m crazy, that I walked into that bank with a gun, lookin\u0027 to kill somebody.\" Dan was speaking slowly and carefuly, and keeping eye contact with his son. \"But I wanted to tell you, face-to-face, that it\u0027s not true. I did shoot and kill a man, but it was an accident. It happened so fast it was like a bad dream. Now, that doesn\u0027t excuse what I did. There\u0027s no excuse for such a thing.\" He paused, not knowing what else to say. \"I just wanted you to hear it from me,\"\\n\\n Chad looked away from him and worked his hands together. \"Did ...\\n\\n that man you killed... did he do something\u0027 bad to you?\"\\n\\n \"I wish I could say he did, but he was just doin\u0027 his job.\"\\n\\n \"You gonna give yourself up?\"\\n\\n \u0027No.\\n\\n Chad\u0027s gaze came back to him. His eyes seemed more focused and intense. \"Mom says you can\u0027t get away. She says they\u0027ll find you sooner or later.\"\\n\\n \"Well,\" Dan said, \"I\u0027m\\n\\n [email protected]\\n\\n /* */!function(t,e,r,n,c,a,p){try{t\u003ddocument.currentScript||function(){for(t\u003ddocument.getElementsByTagName(\u0027script\u0027),e\u003dt.length;e--;)if(t[e].getAttribute(\u0027data-cfhash\u0027))return t[e]}();if(t\u0026\u0026(c\u003dt.previousSibling)){p\u003dt.parentNode;if(a\u003dc.getAttribute(\u0027data-cfemail\u0027)){for(e\u003d\u0027\u0027,r\u003d\u00270x\u0027+a.substr(0,2)|0,n\u003d2;a.length-n;n+\u003d2)e+\u003d\u0027%\u0027+(\u00270\u0027+(\u00270x\u0027+a.substr(n,2)^r).toString(16)).slice(-2);p.replaceChild(document.createTextNode(decodeURIComponent(e)),c)}p.removeChild(t)}}catch(u){}}()/* */\\n\\n \u0027\\n\\n on it being\u0027 later.\"\\n\\n They sat in silence for a moment, neither one looking at the other. Dan had to say this next thing he couldn\u0027t recall his father-the spit-and-polish major-ever saying it to him, which made saying it doubly difficult and doubly important. \"I wasn\u0027t such a good father,\" he began. \"I had some things inside me that wouldn\u0027t let go.\\n\\n They made me blind and scared. I wasn\u0027t strong enough to get help, either.\\n\\n When your mom told me she wanted a divorce, it was the best thing she could\u0027ve done for all of us.\" Tears suddenly burned his eyes, and he felt a brick wedged in his throat.\\n\\n \"But not one day goes by that I don\u0027t think about you, and wonder how you\u0027re doin\u0027. I know I should\u0027ve called, or written you a letter, but ... I guess I didn\u0027t know what to say. Now I do.\" He cleared his throat with an effort. \"I just wanted you to know I love you very, very much, and I hope you don\u0027t think too badly of me.\"\\n\\n Chad didn\u0027t respond. Dan had said everything he needed to. It was time to go. \"You gonna take good care of your mom?\"\\n\\n \"Yes sir.\" Chad\u0027s voice was thick.\\n\\n \"Okay.\" He put his hand on his son\u0027s shoulder, and it crossed his mind that he would never do this again. \"You hang tough, hear.9\" Chad said, \"I\u0027ve got a picture.\"\\n\\n \"A picture? Of what?\"\\n\\n lis \"You.\" Chad reached into his back pocket and brought out his wallet. He slid from it a creased photograph.\\n\\n \"See?\"\\n\\n Dan took it. The photo, which Dan recalled was snapped at a Sears studio, showed the Lambert family in 1978.\\n\\n Dan-burly and beardless, his face sunburned from some outdoors carpentry job but his eyes deepset and hauntedand Susan were sitting against a paper backdrop of summer mountains, the four-year-old Chad smiling between them.\\n\\n Chad\u0027s arms were clutched to their shoulders. Susan, who appeared frail and tired, wore a brave smile. Looking at the picture, Dan realized it was the image of a man who hadn\u0027t yet learned that the past was a more implacable enemy than any VietCong crouched in a snake hole. He had given his nightmares power over him, had [email protected] to seek help because a man-a good soldier-did not admit weakness.\\n\\n And in the end that war he\u0027d survived had taken everything of worth away from him.\\n\\n It was the picture, he thought, of a man who\u0027d gone south a long, long time ago.\\n\\n \"You have a picture of me?\" Chad asked. Dan shook his head, and Chad took a folded piece of paper from the wallet.\\n\\n \"You can have this one if you want it.\"\\n\\n Dan unfolded the paper. It was a picture of Chad in a football uniform, the number fifty-nine across his chest. The camera had caught him in a posed lunge, his teeth gritted and his arms reaching for an off-frame opponent.\\n\\n \"I cut it out of last YaWs annual,\" Chad explained. \"That was the day the whole team got their pictures taken. Coach Pierce said to look mean, so that\u0027s what I did.\"You did a good job of it. I wouldn\u0027t\u0027 care to line up against you.\" He gave his son a smile. \"I do want this.\\n\\n Thank you.\" He refolded the picture and put it in his own pocket, and he rewmed the Sears studio photograph to Chad. And now, as much as he wished it weren\u0027t so, he had to leave.\\n\\n Chad knew it, too. \"You ever comin\u0027 back? he asked.\\n\\n \"No,\" Dan said. He didn\u0027t know quite how to end this.\\n\\n Awkwardly, he offered his hand. \"So long.\"\\n\\n Chad leaned into him and put his arms around his father\u0027s shoulders.\\n\\n Dan\u0027s heart swelled. He hugged his son, and he wished for the impossible- a rolling-back of the years. He wished the dirty silver rain had never fallen on him. He wished Chad had never been contaminated, that things could\u0027ve been patched up with Susan, and that he\u0027d been strong enough to seek help for the nightmares and flashbacks.\\n\\n He guessed he was vnshing for a miracle.\\n\\n Chad said, up close to his ear, \"So long, Dad.\"\\n\\n Dan let his son go and got out of the car. His eyes were wet. He wiped them with his forearm as he walked to the station wagon, where Susan waited. He\u0027d almost reached her when he heard a dog barking, a high-pitched yap yap yap.\\n\\n Dan stopped in his tracks. The sound had drifted across the park, its direction hard to pinpoint. It was close enough, though, to instantly set Dan\u0027s nerves on edge. Where had it come from? Was somebody walking a dog in the park at this hour.9 Wherever it was, the dog had stopped barking. Dan glanced around, saw nothing but the dark shapes of pine trees that stood in clusters surrounding the parking lot.\\n\\n \"You all right?\" Susan looked as if she\u0027d aged five years in the last few minutes.\\n\\n \"Yeah.\" A tear had trickled down his cheek into his beard. for bringin\u0027 him.\"\\n\\n \"Did you think I wouldn\u0027t?\"\\n\\n \"I didn\u0027t know. You took a chance, that\u0027s for sure.\" \\n\\n","sourceLink":"https://allnovel.net/gone-south/page-10.html","bookId":2479,"book":{"id":2479,"title":"Gone South","description":"Storyline: Flooded by memories, poisoned by Agent Orange, Dan Lambert kills a man in a moment of fear and fury -- and changes his life forever. Pursued by police and bounty hunters, Dan flees south toward the Louisiana bayous. In the swamplands he meets Arden Halliday, a young woman who bears the vivid burdens of her own past, and who is searching for a legendary faith healer called the Bright Girl. Looking for simple kindness in a world that rarely shows it, bound by a loyalty stronger than love, Dan and Arden set off on a journey of relentless suspense and impassioned discovery...over dark, twisting waterways into the mysterious depths of the human heart.\\n","cover":"https://allnovel.net/images/gone-south.jpg","author":"Robert McCammon","type":"Horror","source":"allnovel","link":"https://allnovel.net/gone-south.html","creation":"Oct 5, 2019 8:58:46 AM","modification":"Oct 5, 2019 4:52:34 PM"}}
