{"id":83649,"no":14,"title":"Page 14","content":"\"Yeah, I guru so.\" He figured he could\u0027ve slept in a cement mixer, but the sofa would be kinder to his bones. He fired up the engine, which sounded as rugged as he felt. \"I\u0027H pull around to the side and come on in.\" The security guard moved away and Dan parked the station wagon in a small lot next to the Twin Oaks. It was a tribulation to walk the distance back to the front door. Inside, though, the airconditioning was a breath from heaven. A thin, middle-aged woman with a hairdo like a double-dip of vanilla ice cream sat behind a reception desk, her lips pursed as she absorbed the contents of a paperback romance. Arden was sitting nearby in a waiting area that held a number of overstuffed chairs, brass reading lamps, and a magazine rack, and there was the full-length sofa as pretty as a vision of the Promised Land.\n Dan eased himself down, took off his shoes, and stretched out.\n Arden had a dog-eared National Geographic in her lap, but she looked needful of some sleep, too. The place was quiet, the corridors only dimly lit. From somewhere came the sound of a low, muffled coughing. Dan had the thought that no policeman in Louisiana would think to look for him at a Lafayette nursing home. Then his mind and body relaxed, as much as was possible, and he slept a dreamless sleep.\n Voices brought him back to the land of the living.\n \"Ma\u0027am? I believe Mr. Krenshaw\u0027s awake by now. Can I tell him who you are?\"\n \"Just tell him Arden. He\u0027ll know.\"\n \"Yes ma\u0027am.\" There was the sound of rubber-soled shoes squeaking on the linoleum.\n Dan opened his eyes and looked out the nearest window.\n Violet light was showing at the horizon. Nearing six o\u0027clock, he figured. His mouth was as dry as a dust bowl. He saw a water fountain a few steps away, and he summoned his strength and sat up, his joints as stiff as rusty hinges. The girl was still sitting in the chair, her face turned toward a corridor that went off past the reception desk.\n She\u0027d opened her purse, Dan noted, and she had removed the small pink drawstring bag from it. The bag was in her lap, both her hands clutched together around it in an attitude that struck Dan as being either of protection or prayer. As he stood up to walk to the water fountain, he saw her pull the drawstring tight and push it into her purse again.\n Then she rose to her feet as well, because someone was coming along the corridor.\n There were two people, one standing and one sitting. A brown-haired woman in a white uniform was pushing a wheelchair, her shoes squeaking with every step, and in the wheelchair sat a frail-looking black man wearing a redchecked robe and slippers with\n [email protected]\n /* */!function(t,e,r,n,c,a,p){try{t\u003ddocument.currentScript||function(){for(t\u003ddocument.getElementsByTagName(\u0027script\u0027),e\u003dt.length;e--;)if(t[e].getAttribute(\u0027data-cfhash\u0027))return t[e]}();if(t\u0026\u0026(c\u003dt.previousSibling)){p\u003dt.parentNode;if(a\u003dc.getAttribute(\u0027data-cfemail\u0027)){for(e\u003d\u0027\u0027,r\u003d\u00270x\u0027+a.substr(0,2)|0,n\u003d2;a.length-n;n+\u003d2)e+\u003d\u0027%\u0027+(\u00270\u0027+(\u00270x\u0027+a.substr(n,2)^r).toString(16)).slice(-2);p.replaceChild(document.createTextNode(decodeURIComponent(e)),c)}p.removeChild(t)}}catch(u){}}()/* */\n argyle socks. Dan took a drink of water and watched Arden walk forward to meet the man she\u0027d come so far to see.\n Jupiter was seventy-eight years old now, his face was a cracked riverbed of wrinkles, and his white hair had dwindled to a few remaining tufts. Arden was sure she\u0027d changed just as much, but he would have to be blind not to know her, and the stroke he\u0027d suffered two years before had not robbed him of his eyes. They were ashine, and their excitement jumped into Arden like an electric\u0027sparklEs nephew had told Arden about the stroke, which had happened just five months after the death of Jupiter\u0027s wife, and so Arden had been prepared for the palsy of his head and hands and the severe downturn of the right side of his mouth. Still, it was hard because she remembered how he used to be, and ten years could do a lot of damage. She took the few last @ to meet him, grasped one of his palsied hands as he reached up tar her, and with an effort he opened his mouth to speak.\n \"Miz Arden,\" he said. His voice was @ a gill, almost painful to\n \"Done growed up.\"\n She Pve him the best smile she had. \"Hello, Jupiter.\n How\u0027re they treatin\u0027 you?\"\n \"Like I\u0027m worn out. Which I ain\u0027t. Gone be back to work again soon as I get on my feet.\" He shook his head with wonder, his hand still gripping Arden\u0027s. \"My, my! you have surely become a young lady!\n Doreen would be so proud to see you!\"\n \"I heard what happened. I\u0027m sorry.\"\n \"I was awful down at first. Awful down. But Doreen\u0027s the pride of the angels now, and I\u0027m happy for her. Gone get on my feet again.\n Louis thinks I\u0027m worn out can\u0027t do a thing for m\u0027self.\" He snorted.\n \"I said you gimme the money they chargin\u0027 you, I\u0027ll show you how a man can pull hiswif up. I ain\u0027t through, no ma\u0027am.\" Jupiters rheumy eyes slid toward Dan. \"WhO is that there? I can\u0027t-\" He caught his breath.\n \"Lord have mercy! Is that ... is that Mr. Richards?\"\n \"That\u0027s the man who brought me-\" \"Mr. Richards!\" The old man let go of Arden and wheeled himself toward Dan before the nurse could stop him. Dan stePPed back, but the wheelchair was suddenly right there in front of him and the old man\u0027s crooked mouth was split by an ecstatic grin. \"You come to see me, too?\"\n \"Uh ... I think you\u0027ve got me mixed up with some-\" \"Don\u0027t you worry, now I know I\u0027m gone get up out this thing! My, my, this is a happy day! Mr. Richards, you still got that horse eats oranges skin and all? I was th *nkin\"bout that horse th\u0027other day. Name right on the tip of my tongue, right there it was but I couldn\u0027t spit it out. What was that horse\u0027s name?\"\n \"Jupiter.9\" Arden said quietly, coming up behind him.\n She put a hand on one of his thin shoulders. \"That\u0027s not Mr.\n Richards.\n \"Well, sure it is! Right here he is, flesh and bone! I may be down, but I ain\u0027t out! Mr. Richards, what was the name of that horse eats oranges skin and all?\"\n Dan looked into Arden\u0027s face, seeking help. It was obvious the old man had decided he was someone else, and to him the matter was settled. Arden said, \"I think the horse\u0027s name was Fortune.\"\n \"Fortune! That\u0027s it!\" Jupiter nodded, his eyes fixed on Dan.\n \"You still got that al\u0027 wicked horse?\"\n \"I\u0027m not who you-\" But Dan paused before he went any further.\n There seemed to be no point in it. \"Yeah,\" he said.\n \"I guess I do.\"\n \"I\u0027ll teach him some manners\u0027 God may make the horse, but I\u0027m the one takes off the rough edges, ain\u0027t that right, Miz Arden?\"\n \"That\u0027s right,\" she said.\n Jupiter grunted, satisfied with the answer. He turned his attention away from Dan and stared out the window. \"Sun\u0027s comin\u0027 up directly. Be dry and hot. Horses need extra water today, can\u0027t work \u0027em too hard.\"\n Arden motioned the nurse aside for a moment and spoke to her, and the nurse nodded agreement and withdrew to give them privacy. Dan started to move away, too, but the old man reached out with steely fingers and caught his wrist.\n \"Louis don\u0027t think I\u0027m worth a damn no more,\" he confided. \"You talk to Louis?\"\n \"No, I didn\u0027t.\"\n \"MY nephew. Put me in here. I said Louis, you gimme the money they\u0027re chargin\u0027 you, I\u0027ll show you how a man can pull himself up.\"\n Arden drew up a chair beside the old man and sat down.\n Through the window the sky was becoming streaked with pink. \"You always did like to watch the sun rise, didn\u0027t [email protected], \"Got to get an early start, you want to make something\u0027 of you\u0027self. Mr. Richards kngws that\u0027s gospel. Water them horses good @, yessir.\"\n \"You want me to step outside?\" Dan asked the girl . But Jupiter didn\u0027t let go of him, and Arden shook her head. Dan frowned; he felt as if he\u0027d walked on stage in the middle of a play without knowing the title or what the damn thing was about.\n .41 gain SO\n [email protected]\"\n Jupiter said, \"that you both come to see me. I think a lot \u0027bout them days. I dream \u0027bout em. I close my eyes and I can see everythin\u0027, just like it was. It was a golden time, that\u0027s what I believe. A golden time. He drew a long, ragged breath.\n \"Well, I ain\u0027t done yet. I may be down, but I ain\u0027t out!\"\n Arden took Jupitet\u0027s other hand. \"I came to see you,\" she said, \"because I need your help-\"\n He didn\u0027t respond for a moment, and Arden thought he hadn\u0027t heard. But then Jupiter\u0027s head turn d he bin ea ed an quizzically at her. \"My help?\"\n She nodded. \"I\u0027m goin\u0027 to find the Bright Girl.\"\n Jupiter\u0027s mouth slowly opened, as if he were about to speak, but nothing came out.\n \"I remember the stories you used to tell me,\" Arden went on. \"I never forgot\u0027em, all this time. Instead of ladin, away, they kept getting\u0027 more and more real. Especially what you told me about the Bright Girl. Jupiter, I need to find her.\n YOU remember, YOu told me what she could do for me? You used to say she could touch my face and the mark would come off on her hands.\n Then she\u0027d wash her hands with water and it\u0027d be gone forever and ever.\"\n The birthmark, Dan realized she was talking about. He stared at Arden, but her whole being seemed to be focused on the old roan.\n \"Where is sher, Arden urged.\n \"Where she always was,\" Jupiter answered. Iwhere she always will be. Road runs Out, meets the swamp. Bfiot e Girl\u0027s in ther,.\u0027) \"I remember YOU used to tell me about growin, up in LaPierre- Is that where I need to start from? \"LaPierre,\" he Minted, and he nodded. \"That\u0027s right.\n Start from LaPierre- They know \u0027bout the Bright Girl there, they\u0027ll tell you.\n \"Beg pardon,\" Dan said, \"but can I ask who ya\u0027ll are talkin\u0027 about?\"\n \"The Bright Girl\u0027s a faith healer,\" Arden told him- \"She lives in the swamp south of where Jupiter grew up.\"\n It came clear to Dan. Arden was searching for a faith healer to take the birthmark off her face, and she\u0027d come to see this old man to help point the way. Dan was tired and cranky, his joints hurt, and his head was throbbing; it it-ankly pissed him off that he\u0027d taken a detour and risked traveling on the interstate because of such no . \u0027What is she, some kind of voodoo woman lights incense and throws bones around?\"\n \"It\u0027s not voodoo,\" Arden said testily. \"She\u0027s a holy woman.\"\n \"Holy, yes she is. Carries the lamp of God,\" Jupiter said to no one in particular.\n \u0027I had you figwred for a sensible person. There\u0027s no such thing as a faith healer.\" A thought struck Dan like an ax between the eyes.\n \"Is that why Joey left you? \u0027Cause he figured out you were chasin\u0027 a fairy tale?\"\n \"Oh, Mr. Richards sir!\" Jupiters hand squeezed Dan\u0027s harder.\n \"Bright Girl ain\u0027t no fairy tale! She\u0027s as real as you and me! Been livin\u0027in that swamp long \u0027fore my daddy was a little boy, and she\u0027ll be there long after my bones done Mowed away. I seen her when I was eight year old. Here come the Bright Girl down the street!\" He smiled at the memory, the warm pink light of the early sun seaped into the lines of his face. \"Young white girl, pretty as you please. That\u0027s why she called bright. But she carries a lamp, too. Carries a lamp from God that burns inside her, and that\u0027s how she gets her healin\u0027 touch.\n Yessir, here come the Bright Girl down the street and a crowd of people followin\u0027her. She on the way to Miz Wardell\u0027s house, Miz Warden so sick with cancer she just lyin\u0027 in bed, waitin\u0027 to die. She see me standin\u0027 there and she smile under her big purple hat and I know who she is, \u0027cause my mama say Bright Girl was comin\u0027. I sing out Bright Girl! Bright Girl! and she touch my hand when I reach for her. I feel that lamp she carryin\u0027 in her, that healin\u0027 lamp from God.\" He lifted his eyes to Dan\u0027s face. I never felt r-uch light before, Mr. Richards. Never felt it since.\n said the Bright Girl laid her hands on Miz Warden and up come the black bile, all that cancer flowin\u0027 out. Said it took twO days and two nights, and when it was done the Bright Girl was so tired she had to be carried back to her boat. But Miz Warden outlived two husbands and was dancin, when she was ninety. And that ain\u0027t all the Bright Girl did for people \u0027round LaPierre, neither. You ask \u0027em down there, they\u0027ll tell you \u0027bout all the folks she healed of [email protected] tumors, and sicknesses.\n So nosir, all due respect, but Bright Girl ain\u0027t nO fair\u0027 tale \u0027cause I seen her with my own iivin, eyes.\"\n \"I believe you,\" Arden said. \"I always did.\"\n \"That\u0027s the first step,\" he answered. \"You go to Lapie rre.\n GO south, You\u0027ll find her. She\u0027ll touch your face and make things right. You won\u0027t never see that mark no more.\n \"I want things made right. More than anythin\u0027 in this world, I do.\"\n \"Miz Arden,\" Jupiter said , \"I \u0027member how you used to fret \u0027bout you\u0027self, and how them others treated you. I member them names they called you, them nanes that made You cry. Then you\u0027d wipe your eyes, stick your chin Out again, and keep on goin\u0027. But it seems to me you might still be cryin\u0027on the inside.\" He looked earnestly up at DalL \"You gone take care of Miz Arden?\"\n \"No\" Dan said. \"I\u0027m not who you think I am.\"\n \"I know who You are,\" Jupiter replied. \"You the man God sent Miz Arden.\"\n \"Come again?\"\n \"That\u0027s right. You the man God provided to @ miz Arden to the Bright Girl. You His hands, you gone have to steer her the right direction.\"\n Dan didn\u0027t know what to ray, but he\u0027d had enough of this.\n He pulled loose from the old man\u0027s spidery fingers. \"I\u0027n be waitin\u0027outside,\" he growled at Arden, and he turned toward the door.\n \"GOOd-bYe!\" Jupiter called after him. \"You heed what I say now, hear?\"\n Outside, the eW\u003d horizon was the color of burnished copper. Akeady the air smelled of wet, agonizing heat. Dan stalked to the station wagon, got behind the wheel, and sat there while the sweat began to bloom from his pores. Apin the road, but the heat chased such thoughts away; in his present condition he wouldn\u0027t get more than a few miles before he fell asleep at the wheel. He was nodding off when the girl opened the passenger door. \"You look pretty bad,\" she said. \"Want me to drive?\"\n \"No,\" he said. Don\u0027t be stupid, he told himself. Weaving all over the road was a sure way to get stopped by a police car. \"Wait,\"\n he said as she started to climb in. \"Yeah, I think you\u0027d better drive.\"\n They started off, Arden retracing the way they\u0027d come. To Dan\u0027s aching bones the pitch and sway of the station wagon\u0027s creaking frame was pure torture. \"Gonna have to pull over,\" he said when they were back on Darcy Avenue.\n He made out a small motel coming up on the right; its sign proclaimed it the Rest Well Inn, which sounded mighty good to him.\n \"Turn in there.\"\n She did as he said, and she drove up under a green awning in front of the motel\u0027s office. A sign in the window said that all rooms were ten dollars a night, there were phones in all of them, and the cable TV was free. \"You want me to check us in?\"\n Dan narrowed his eyes at her. \"What do you mean, check us in? We ain\u0027t a couple .\n \"I meant separate rooms. I could do with some sleep, too.\"\n \"Oh. Yeah, okay. Fine with me.\"\n She cut the engine and got out. \"What\u0027s your last name?\"\n \u0027Huh?\"\n \"Your last name. They\u0027ll want it on the register.\"\n \"Farrow,\" he said. \"From Shreveport, if they need that, too.\"\n \"Back in a couple of minutes.\"\n Dan leaned his head back and waited. Stopping here seemed the only thing to do; he wouldn\u0027t have driven the rest of the way to Vermilion in daylight even if he\u0027d felt able.\n tting he pondered ditching her suitcase and his He was fading fast. That crazy old man, he thought. Here come the Bright Girl down the street. Laid her hands on miz Wardell. All that cancer flowin\u0027 out. I never felt such light before, Mr.\n Rich\"Here\u0027s your key.\"\n Dan got his eyes open and took the key Arden offered. The sun had gotten brighter. Arden drove them a short dice, and then somehow he was fitting the key into a door and waking into\u0027a small but clean room with beige-painted cinder-block waus- He locked the door behind him, [email protected] right to the bed, and climbed onto it without removing his cap or shoes. If the Police were to suddenly burst into the room, they would\u0027ve had to pour him into handcuffs.\n Pain was throbbing through his body. He had pushed himself too far. But there was still a distance to go, and he couldn\u0027t give up.\n Get seven or eight hours of sleep, he\u0027d feel better. Drive after dark, down into the swampland. They know \u0027bout the Bright Girl there. Go south, you,U find her.\n You His hands, you gone have to steer her the right direction.\n Crazy old man. I\u0027m a killer, that\u0027s what I am.\n Dan turned over onto his side and curled his knees up toward his chest.\n You His hands.\n And with that thought he slipped away into merciful and silent darkness.\n Satan\u0027s Paradise \"You know, Elvis almost gave up singing , when he was a young boy.\n Signed on as a truck driver, and that\u0027s what he figured on being\u0027. Did I tell you I used to be a truck driver?\"\n \"Yes, Eisley,\" Flint said wearily. \"TWo hours ago.\"\n ,-Well, what I was meanin\u0027 is that you never know where you,re goin\u0027 in this Ufe- Elvis thought he was gonna be a truck driver, and look where he went. Same with me. Only I guess I ain\u0027t got to where I\u0027m goin\u0027 yet.\"\n Um,\" Flint said, and he let his eyes slide shut againThe sun was hot enough to make a shadow melt. The ElDorado\u0027s windows were down but the air was calm, not a whisper of a breeze. The car was parked on a side road under the shade of weeping willow trees, otherwise they couldn\u0027t have stayed in it as they had for almost twelve hours. Even so, Flint had been forced to take off his coat and unbutton his shirt, and Clint\u0027s arm dangled from its rOOt just below the conjunction of Flint\u0027s rib cage, the hand clenching every so often as if in lethargic Protest of the heat.\n The reflexes of Clint\u0027s hand had kept Mama entertained fOr a while, but now she lay asleep in the backseat, her pink tongue flopped out and a little puddle of drool forming On the black vinyl.\n There was one cracked and potholed highway from Houma to Vermilion, no other road in or out. It had brought Flint and Pelvis along its winding spine south through the s.t..\u0027s P.\u0027. dise bayou country in the predawn darkness, and though hadn\u0027t been able to see much but the occasional glimmer of an early morning fisherman\u0027s lamp upon the water, they could smell the swamp itself, a heavy, pungent odor of intermingled sweet blossoms and sickly wet decay. They had crossed a long, concrete bridge and come through the town of Vermilion, which was a shuttered cluster of ramshackle stores and clapboard houses. Three miles past the bridge, on the left, was a dirt road that led through a forest of stimted pines and needle-tipped palmettos to a gray-painted cabin with a screened-in porch. The cabin had been dark, Lambert\u0027s car nowhere around. While Pelvis and Mama had peed in the woods, Flint had walked behind the cabin and found a pier that went out over a lake, but of the darkness he couldn\u0027t tell how large or small the @ was. A boathouse stood nearby, its doors secured by a padlocl Lambert might or might not be on his way here, Flint decided, but it was fairly certain he hadn\u0027t shown up yet.\n Which was for the best, because Pelvis let out a loud yelp when a palmetto pricked him in a tender spot and then Mama started rapid-M those ingh-pitched yips and yaps that made Flint\u0027s skin crawl.\n They\u0027d driven back to Vermilion and Flint had used the phone booth in front of a bait-and-tackle shop. He\u0027d called Smoates\u0027s answering service and been told by the operator on duty that the light was still green, which meant that so far as Smoates imew, Lambert hadn\u0027t been caught. Flint had found a dirt side road about fifty yards south of the tumor to the cabin that he could back the Cadillac onto and still have a view through the woods. It was here that they\u0027d been sitting since four o\u0027clock, alternately keeping watch, sleeping, or eating the 9WW doughnuts, Oreo cookies, Slim Jims, and other deadly snacks from Eisley\u0027s grocery sacil They had shipped at a gas station just south of Lafayette to fLU up and get something to drink, and there Flint had bought a plastic jug of water while Pelvis had opened his wallet for a six-pack of canned Yoo-Hoos.\n \"I swear,\" Pelvis said between sips from the can, Flint\u0027s an Flint remained silent; he was wise to Eisley\u0027s methods of drawing him into pointless talk.\n \"I swear it is,\" Pelvis tried again. \"That little fella inside you, I mean. You know, I went to a freak show one time and saw a two-headed bull, but you take the cake.\"\n Flint pressed his lips together tightly.\n \"Yessir.\" Slilurrrrp went the final swallow of the Yoo-Hoo.\n \"Peopled pay to see you, they surely would. I know I would.\n I mean, if I couldn\u0027t see you for free.\n [email protected]\u0027YOU\n some money that way. You ever want to give up bounty-huntin\u0027 and go into show business, I\u0027ll tell you everythin\u0027 you need to-\" \"Shut-your-mouth.\"\n Flint had whispered it, and instantly he regretted it because Eisley had worn him down yet again.\n Pelvis dug down into the bottom of the sack and came up with the last three Oreos. Three bites and they were history.\n He wiped his lips with the back of his hand. \"Really, now.\n You ever think about show business? All jokin\u0027 aside. You could get to be famous.?\u0027 Flint opened his eyes and stared into Pelvis\u0027s sweatbeaded face.\n \"For your information,\" he said coldly, \"I grew up in the carnival life. I had a stomach full of \u0027show I business, so just drop it, understand?\"\n \"You was with the carnival? You mean a freak show, is that right?\"\n Flint lifted a hand to his face and pressed index finger and thumb against his temples. \"Oh, Jesus, what have I done to deserve this?\"\n \"I\u0027m interested. Really I am. I never met nobody was a real live freak before.\"\n \"Don\u0027t use that word.\"\n \"What word?\"\n \"Freak-I\" Flint snapped, and Mama jumped up, growling.\n \"Don\u0027t use that word!\"\n \"Why not? Nothin\u0027 to be \u0027shamed of, is it?\" Pelvis looked honestly puzzled. \"I reckon there\u0027s worse words, don\u0027t you \"Eisley, you kill me, you know that?\" Flint summoned up a tight smile, but his eyes were fierce. \u0027,I\u0027ve nevey anybody so ... so dense before in my entire life.\"\n \"Dense,\" Pelvis repeated. He nodded thoughtfully. \"How do YOU mean that, exactly?\"\n \"Thick-skulled! Stupid! How do you think I mean it? Flint\u0027s smile had vanished. \"Hell, what\u0027s wrong With you?\n Have you been in solitary confinement for the last five or six Years? Can , t YOU just shut your mouth and keep it shut for two minutes?\"\u0027 \"Course I can,\" Pelvis said petulantly. \"Anybody can do that if they want to.\n \"Do it, then! WO minutes of silence!\"\n Pelvis clamped his mouth shut and stared straight ahead.\n Mama Yawned and sdtled down to sleep again. -,Whose watch we usin\u0027 to time this by?\" Pelvis asked.\n \"Mine! I\u0027ll time it on my watch! Startin\u0027 right now!\"\n Pelvis grunted and rummaged down in the sack, but there was nothing left but wrappers. He upturned the I y ast ooHoo can to try to catch a drop or two on his tongue, then he crumpled the can in a fist.\n \"Kinda silly, I think.\"\n \"There you go!\" Flint said. \"You couldn\u0027t last fifteen seconds!\"\n \"I\u0027m not talkin\u0027 to You! Can\u0027t a man speak what\u0027s on his mind? I swear, Mr. Murtaugh, you\u0027re tryin\u0027 your very best to be hard to get along with!\n \"I dont want You to get along with me, Eisley!\" Flint said.\n \"I want YOu to sit there and zipper your mouth! You and that damn mutt have already messed things up once, you\u0027re not gonna get a chance to do it again! \"Don\u0027t blame that on Mama and me, now! We didn\u0027t have nothin\u0027 to do with it! Flint gripped the steering wheel with both hands.% red splotches on his cheeks. Clint\u0027s hand rose up and clutched at the air before it fell back down again. \n","sourceLink":"https://allnovel.net/gone-south/page-14.html","bookId":2479,"book":{"id":2479,"title":"Gone South","description":"Storyline: \n Flooded by memories, poisoned by Agent Orange, Dan Lambert kills a man in a moment of fear and fury -- and changes his life forever. Pursued by police and bounty hunters, Dan flees south toward the Louisiana bayous. In the swamplands he meets Arden Halliday, a young woman who bears the vivid burdens of her own past, and who is searching for a legendary faith healer called the Bright Girl. Looking for simple kindness in a world that rarely shows it, bound by a loyalty stronger than love, Dan and Arden set off on a journey of relentless suspense and impassioned discovery...over dark, twisting waterways into the mysterious depths of the human heart.\n \n","cover":"https://allnovel.net/images/gone-south.jpg","author":"Robert McCammon","type":"Horror","source":"allnovel","link":"https://allnovel.net/gone-south.html","creation":"Oct 5, 2019 8:58:46 AM","modification":"Oct 5, 2019 4:52:34 PM"}}
