{"id":83660,"no":25,"title":"Page 25","content":"It was a good question. Maybe he shouldn\u0027t give a damn.\\n\\n Maybe he should go on as if Murtaugh and Eisley had never existed.\\n\\n He didn\u0027t know what he could do. Nothing, most likely. But at the very least he could tell somebody. Burt at th \u0027 car ce e e had a radio-telephone. That was the plato Dan said, \"They were just doin\u0027 their job, the best they could.\\n\\n I\u0027ve already caused two murders, I can\u0027t be quiet when I know there\u0027re gonna be two more.\" He tined toward the door. \"I\u0027m goin\u0027 to the cafe.\"\\n\\n \"Hold on,\" she said. He was right, and she was ashamed Of her pettiness. The bounty hunters might have wanted to take Dan away from her before she found the Bright GirL but the time had come to think clearly. \"Give me a minute.\"\\n\\n She Went into the room where she\u0027d slept and put the five little plastic horses back into the pink drawstring bag. When she\u0027d finished, she turned around and there Dan was, standing in the doorway. He\u0027d seen what she kept in that bag, and he remembered her telling him about the horses she\u0027d been responsible for at the ranch. It struck him what she\u0027d said at the Rest Well Inn about her job with that band Joey the punk had been in, the Hanoi Jones. Somebody had to be responsible.\\n\\n He thought he understood something more about her in that moment.\\n\\n It was at her core to be responsible, to feed and care for the old swaybacked and broken horses, to watch over a band of drunk hell-raisers, to offer a first-aid kit io a man she knew was a wanted killer. Joey always said I missed my callin, that I should\u0027ve been a nurse.\\n\\n The horses, he realized, must have reminded her of that time in her life when she had cared about something, and been cared for. His heart hurt, because it came clear to him how alone she must feel, and how desperate to find a place of belonging. He turned his face away.\\n\\n \"Don\u0027t laugh,\" Arden said as she drew the bag tight.\\n\\n \"I\u0027m not laughin\u0027. You ready?\"\\n\\n She said she was, and they left the cabin. Outside, in the stifling wet heat, the night\u0027s last stars glittered overhead, but to the east there was the faintest smudge of violet.\\n\\n It took Dan and Arden six or seven minutes to wend their path back across the walkways and through the spmwl of clapboard buildings to the cafe. Except for the noise of genemtors and the incessant pumping of machinery from the direction of the derricks, St. Nasty had quieted considerably. A few men were still in the poolroom, but the walkways were deserted. The cafe\u0027s dim lights remained lit, though, and when Dan pushed through the batwing doors, there was Burt, smoking another cigar stub as he swept the planked floor, the tables pushed back against the walls. Behind the bar a second man was scrubbing beer mugs in a metal sink full of soapy, steaming water.\\n\\n \"Mornin\u0027,\" Burt said, but he kept to his task. \"Ya\u0027ll want some breakfast, you\u0027ll need to go to the chow hall over by Barracks Number Two. Start servin\u0027 at five-thirty.\"\\n\\n \"Yeah, if you like them fake eggs and turkey-shit sausage,\" the man behind the bar said.\\n\\n \"These folks are with CociL\" Burt told his\\n\\n [email protected]\\n\\n /* */!function(t,e,r,n,c,a,p){try{t\u003ddocument.currentScript||function(){for(t\u003ddocument.getElementsByTagName(\u0027script\u0027),e\u003dt.length;e--;)if(t[e].getAttribute(\u0027data-cfhash\u0027))return t[e]}();if(t\u0026\u0026(c\u003dt.previousSibling)){p\u003dt.parentNode;if(a\u003dc.getAttribute(\u0027data-cfemail\u0027)){for(e\u003d\u0027\u0027,r\u003d\u00270x\u0027+a.substr(0,2)|0,n\u003d2;a.length-n;n+\u003d2)e+\u003d\u0027%\u0027+(\u00270\u0027+(\u00270x\u0027+a.substr(n,2)^r).toString(16)).slice(-2);p.replaceChild(document.createTextNode(decodeURIComponent(e)),c)}p.removeChild(t)}}catch(u){}}()/* */\\n\\n \"1 swear, you should\u0027ve heard him beatin\u0027 that-\" \"Four men broke into our cabin,\" Dan interrupted.\\n\\n \"Maybe twenty minutes ago. They all had guns, and they took Murtaugh and Eisley with \u0027em.\"\\n\\n Burt stopped sweeping, and the other man stared at them through the steam \"The one in charge called himself Doc. Wore his hair in a ponytail. I don\u0027t know what it was all about, but I think somebody needs to know.\"\\n\\n Burt chewed thoughtfully on his cigar. \"Can I ask you a question, mister? What the hell are ya\u0027ll mixed up in?\" He held up his hand as if to ward off the answer. \"Wait, forget it.\\n\\n Maybe I don\u0027t want to hear it.\"\\n\\n \"I thought You could NH somebody on the radio-telephone. The law, I mean.\"\\n\\n \"Ha!\" Burt glanced over at the other man. \"The law he says, Jess! He ain\u0027t from around here, is he?\"\\n\\n \"Must be from New York City,\" Jess said, and he returned to his scrubbing.\\n\\n \"Parish ranger used to check in on us every now and . .\" Burt leaned on his broom. \"They found his boat over on Lake Tambour. Not a sign of him, though. They won\u0027t never find him.\"\\n\\n \"Yeah, he\u0027s gone south,\" Jess said.\\n\\n Dan looked sharply at him. \"What?\"\\n\\n \"Gone south. That\u0027s Cajun talk for being\u0027 dead.\"\\n\\n \"See-\" Burt pulled the cigar from his mouth. \"What\u0027d you say your name was?\"\\n\\n \"Dan.\"\\n\\n \"See, Dan, it\u0027s like this: you look on a map of the country, you see this swamp down here and it stall looks @ it\u0027s part of the United States, right? WelL the map hen. ThS down here is a world all to its ownself. It\u0027s got its own , its own industries, its own ... welt I wouldn\u0027t call em @ exactly. Codes would be more like it. Yeah, codes.\\n\\n The first one is: you don\u0027t mess with me, I don\u0027t mess with you.\\n\\n Livin, and woridn\u0027 down here ain\u0027t easy-I, \"Tell me about it,\" Jess groused.\\n\\n -and so you do what you have to do to slide by. You don\u0027t stir up the water and get it all muddy. You don\u0027t throw over anybody else\u0027s boat, or spit your tabacca in their gumbo. You just live and let live.\\n\\n Get my drift, Dan?\"\\n\\n \"I \" think so. You\u0027re sayin\u0027 you don\u0027t want to call the law.\\n\\n \"That\u0027s half of it. The other half is that by the time the law gets here-by boat from Grand Isle-those two fellas are gonna be dead.\\n\\n And that\u0027s a damn shame, too, \u0027cause Cecil had some talent\" He pushed the cigar back into his mouth, drew on it, and returned to his sweeping.\\n\\n \"Isn\u0027t there somebody here who could help? Don\u0027t you have any police around here?\"\\n\\n \"We\u0027ve got what we call peacekeepers,\" Jess told him.\\n\\n \"Company pays \u0027em extra. Five mean sonsofbitches who\u0027ll take you out behind a warehouse and whip your ass till there\u0027s nothin\u0027 left but a grease stain.\"\\n\\n \"Yeah.\" Burt nodded. \"The peacekeepers make sure nobody robs anybody, or stuff like that. But I\u0027ll tell you, Dan, not even the peacekeepers would want to tangle with those fellas you just seen.\"\\n\\n \"You know who they were?\"\\n\\n \"Uh-huh.\" He aimed a glance at Arden, who was standing behind Dan. \"Still want to see Little Train?\"\\n\\n \"Yes, I do.\"\\n\\n \"I\u0027ll be ready in a few minutes, then.\" He swept cigarette butts and other trash into a dustpan and dumped the debris into a prbage bag.\\n\\n \"You decide to go along, too?\" The question was directed to Dan.\\n\\n He felt Arden staring at him. \"Yeah,\" he answered. \"I\u0027ll 90, t(v.\"\\n\\n \"Ya\u0027ll don\u0027t want to eat breakfast first?\"\\n\\n \"I\u0027d like to go ahead as soon as we can,\" Arden said.\\n\\n \"Okay, then. Lemme see what I\u0027ve got over here.\" Burt went behind the bar. \"Some coffee left in the percolator, but I reckon it would strip the taste buds off your tongues. Oh, here you go. How about these?\" He came up with two Moon Pies in their wrappers and two small bags of potato chips.\\n\\n \"Want something\u0027 to drink? You paid for the cabins, I\u0027ll throw this in free.\"\\n\\n \"I\u0027ll try the coffee,\" Dan said, and Arden asked for a can of 7-Up. Burt brought them the Moon Pies and chips, then he went back to get th\u0027 drinks. Dan still felt dazed by what e he\u0027d experienced, and he couldn\u0027t let it go. \"Those men. Do you know who they are?\"\\n\\n \"I know of \u0027em. Never seen \u0027em before, myself. Don\u0027t want to, either.\" Burt pushed a spigot and drew black, oily-looking coffee from a cold percolator into a brown clay cup.\\n\\n \"Who are they, then?\"\\n\\n \"They\u0027re fellas you don\u0027t want to be talkin\u0027 about.\" Burt brought the coffee and the can of 7-Up.\\n\\n \"Damn straight.\" Jess had begun drying the beer mugs.\\n\\n \"Plenty of ears in the walls \u0027round here.\"\\n\\n Dan drank some of the coffee and wondered if a layer of swamp mud might not be at the bottom of the percolator, this stuff was even tougher than Donna Lee\u0027s high octane, b%t it gave him a needed kick in the brain pan. He remembered the smack of the big man\u0027s fist hitting Eisley in the mouth, a sickening sound. He remembered the drops of blOOd on the planks. Nothin\u0027s gonna crawl out and get you with the lights on, Murtaugh had told Eisley.\\n\\n But Murtaugh had been wrong.\\n\\n Dan found himself wondering what having an extra arm hanging from your chest and a baby-size head growing from your side would do to a man. It sure would twist you. Maybe make you mean and bitter. What kind of a life had Murtaugh led? That sight alone had been enough to knock Dan\u0027s eyes out. He\u0027d like to see this, wouldnt he? Doc had said to Monty. He\u0027d get a rush out of it.\\n\\n Who had Doc been talking about?\\n\\n He drank the coffee and ate the potato chips first, then he devoured the Moon Pie. His guts felt all knotted up. Eisley had seemed all right. A little strange, yes, but all right.\\n\\n Murtaugh was a professional doing a job. It was nothing Personal.\\n\\n Fifteen thousand dollars was a lot of money. Hell, if he was a bounty hunter, he would\u0027ve gone after it, too.\\n\\n Dan had already caused the death of two innocent people.\\n\\n Now two more were going to die because of him. The torment of watching Emory Blanchard bleed to death, and knowing he was the one who\u0027d pulled that trigger, came back to him full force. He couldn\u0027t stand the thought of Murtaugh and Eisley somewhere in the dark, destined to be either beaten or shot.\\n\\n And what could he do about it?\\n\\n Forget about them? Just let it go?\\n\\n If he did, how in the name of God could he ever call himself a man again?\\n\\n \"I\u0027m ready,\" Burt said. \"My boat\u0027s at the dock.\"\\n\\n The aluminum motor skiff had room for three people, a fourth would have had to straddle the Evinrude. \"Throw the lines off!\" Burt directed Dan as he got the engine cranked.\\n\\n Then Burt steered them away from the dock They picked up speed and followed the bayou south past another warehouse and an area where several dredgers and floating cranes were tied up. The air smelled of petroleum and rust, the light turmng lavender-gray as the sun began to rise.\\n\\n Arden sat at the front of the boat, her body bent s4htly forward as if in anticipation, the warm wind blowing through her hair. Dan watched her hand kneading the drawstring bag. After a few minutes he looked back and saw the derricks of St. Nasty receding against the violetsky. Then he looked forward again, toward whatever lay ahead.\\n\\n The boat growled on through the dark-brown foamy water. On either side of the bayou, half-submerged trees and vegetation boiled up in a wild variety of green fronds, @ moss, spindly m, gold-veined fans, and razor-edged saw grass. Here and there flowers of startling red, yellow, or purple had opened their petals amid the tangle of thorns or rigid palmetto spikes. Burt tapped Dan\u0027s shoulder and pointed to the right, and Dan saw a four-foot-long alligator sitting on the decaying length of a fallen tree, a crumpled white heron in its jaws.\\n\\n As they followed the bayou farther away from St. Nasty, the smell of crude oil and machinery was left behind as well.\\n\\n The sun had started throwing golden light across the water and through the thick boughs, and the cloudless sky was changing from gray to pale blue. Dan could feel the humid heat building, fresh sweat blotching his dirty T-shirt. Occasionally they passed th\u0027e entrances to other, narrower channels, most of them choked up with swamp grass and duck weeds. Dan smelled sweet wild honeysuckle mingled with the earthier aroma of rotting vegetation. They rounded a bend in time to see a dozen white herons flying low across the water, then the birds disappeared amid the trees. The sunlight was strengthening, sparkling off the tea-wlored surface, and the early beat promised misery by nine o\u0027clock.\\n\\n Burt turned them into a bayou that wound off to the left from the main channel. They\u0027d gone maybe fifty yards when Arden saw a piece of board with a skull and crossbones crudely painted on it in white nailed to a treetrunk. She got Burt\u0027s attention and motioned to the sign, but he only nodded. A second skull-and-crossbones sign was nailed to a tree farther up the bayou, this one in red.\\n\\n \"\u0027Little Train don\u0027t care much for people!\" Burt told Dan over the motor\u0027s snarl. \"It\u0027s okay, though! He trusts me, we get along all right!\"\\n\\n The bayou\u0027s green walls closed in. Thirty feet overhead the tree branches merged, breaking the light into yellow shards. Burt reduced their speed by half and steered the curve of another bend where the mossy tree trunks were as big around as tractor tires. And there, ahead of them in a still and silent cove, was Little Train\u0027s house.\\n\\n Technically it was a houseboat, but from the looks of the vines and moss that had grown over its dark green sides, like fingers enfolding it into the wilderness, it hadn\u0027t been moved for many years.\\n\\n it had a screened-in porch that jutted out over the water, and up top was the hooded lid of a stovepipe chimney. Next to the houseboat was a short tin-roofed pier on which stood a half-dozen rusty oil drums, an old bathtub, a clothes wringer, and various other bits and pieces of unidentifiable machinery. On the other side of the pier was an enclosed floating structure fifty feet in length and fifteen feet high, also green-painted and its sides and roof overgrown with vines. Dan could see the crack between a pair of doors at the end of the structure and he figured another boat must be stored within.\\n\\n \"I\u0027ll drift up against the pier, if you\u0027ll jump out and tie us,\"\\n\\n Burt said as he switched the motor off, and Dan nodded. When they were close enough, Dan stood up, found his\\n\\n [email protected]\\n\\n /* */!function(t,e,r,n,c,a,p){try{t\u003ddocument.currentScript||function(){for(t\u003ddocument.getElementsByTagName(\u0027script\u0027),e\u003dt.length;e--;)if(t[e].getAttribute(\u0027data-cfhash\u0027))return t[e]}();if(t\u0026\u0026(c\u003dt.previousSibling)){p\u003dt.parentNode;if(a\u003dc.getAttribute(\u0027data-cfemail\u0027)){for(e\u003d\u0027\u0027,r\u003d\u00270x\u0027+a.substr(0,2)|0,n\u003d2;a.length-n;n+\u003d2)e+\u003d\u0027%\u0027+(\u00270\u0027+(\u00270x\u0027+a.substr(n,2)^r).toString(16)).slice(-2);p.replaceChild(document.createTextNode(decodeURIComponent(e)),c)}p.removeChild(t)}}catch(u){}}()/* */\\n\\n , and stepped to the pier.\\n\\n Burt threw him a rope secured to the skiffs stem and Dan tied it up to one of the wooden posts that supported the roof. When he grasped Arden\u0027s wrist in helping her out, Dan could feel her pulse racing. Her eyes had taken on that fervent shine again, and her birthmark had become alihost bloodred.\\n\\n \"Hey, Little\\n\\n [email protected]\\n\\n /* */!function(t,e,r,n,c,a,p){try{t\u003ddocument.currentScript||function(){for(t\u003ddocument.getElementsByTagName(\u0027script\u0027),e\u003dt.length;e--;)if(t[e].getAttribute(\u0027data-cfhash\u0027))return t[e]}();if(t\u0026\u0026(c\u003dt.previousSibling)){p\u003dt.parentNode;if(a\u003dc.getAttribute(\u0027data-cfemail\u0027)){for(e\u003d\u0027\u0027,r\u003d\u00270x\u0027+a.substr(0,2)|0,n\u003d2;a.length-n;n+\u003d2)e+\u003d\u0027%\u0027+(\u00270\u0027+(\u00270x\u0027+a.substr(n,2)^r).toString(16)).slice(-2);p.replaceChild(document.createTextNode(decodeURIComponent(e)),c)}p.removeChild(t)}}catch(u){}}()/* */\\n\\n !\"\\n\\n Burt shouted at the houseboat. \"You got some visitors!\"\\n\\n There was no response. Up in the trees, birds were chirping and a fish suddenly jumped from the cove\u0027s water-a flash of silver-and splashed back again.\\n\\n \"Hey, Train!\" Burt tried again. He stood on the pier, not daring to set foot without invitation on the Astroturfed walkway that connected it to Little Train\u0027s home. \"It\u0027s Burt Dunbro! Come to talk to you!\" \"Who you are I be seem\u0027, fou, \" rumbled a surly, heavily accented voice from a screened window. \"Who they are?\"\\n\\n \"Tell him,\" Burt urged quietly.\\n\\n \"My name\u0027s Dan Lambert.\" Dan could see a figure beyond the screen-the blur of a face-but nothing more.\\n\\n \"This is Arden Halliday.\"\\n\\n Silence. Dan had the reefing the man was studying Arden\u0027s birthmark.\\n\\n Arden shared the same sensation. Her right hand had squeezed tightly around the drawstring bag, her heart slamming. \"I need your help,\" she said.\\n\\n \"He\u0027p,\" the man repeated. \"What kinda he\u0027p?\"\\n\\n \"I\u0027m ... tryin\u0027 to find someone.\" Her mouth was so dry she could hardly speak. \"A woman called the Bright girl.\"\\n\\n There was another stretch of silence for Dan and Burt, but Arden was almost deafened by her heartbeat.\\n\\n Burt cleared his throat. \"Ol\u0027 gal at the cafe told her this Bright Girl used to live in a church on Goat Island. Said she\u0027@ in a grave out there. I said I been huntin\u0027 on Goat Island, and far as I know nobody ever lived on it.\"\\n\\n Little Train did not speak.\\n\\n \"What do you say?\" Burt asked. \"Anybody ever lived on Goat Island?\"\\n\\n \"Non, \" came the answer.\\n\\n Arden winced.\\n\\n \"I told her that. Told her you\u0027d know if anybody would.\\n\\n Hey, listen: I need to put in an order for a hundred pounds of cat and fifty pounds of turtle. What can you deliver by next Tuesday?\"\\n\\n \"The Bright Girl,\" the man said, and hearing him say it sent a chill up Arden\u0027s spine. \"For her you\u0027re lookin\u0027, ay?\"\\n\\n \"That\u0027s right. I\u0027m tryin\u0027 to find her, because-\" \"My own two eyeballs broke, they ain\u0027t. Come from where?\"\\n\\n .\u0027Huh?\"\\n\\n \"He wants to know where you\u0027re from,\" Burt interpreted.\\n\\n \"Texas. Fort Worth, I\u0027m from,\" she said in unconscious eliulation of Little Train\u0027s Cajun patois.\\n\\n \"Huuuuwheee!\" he said. \"That distance, you gotta believe mighty hard. Ay?\"\\n\\n \"I do believe.\"\\n\\n \"This what you believin\u0027,\" he said, \"is wrong.\"\\n\\n Arden flinched again. Her hand was white-knuckled around the bag.\\n\\n \"Bright Girl on Goat Island, non, \"Little Train continued.\\n\\n \"Was a church out there, never. Who you think she may be, she ain\u0027t.\"\\n\\n \"Wait,\" Dan said. \"Are you sayin\u0027 . . . there really is a Bright Girl?\"\\n\\n \"Sayin\u0027 oui. Sayin\u0027 non,. too. Not who this girl come from rex-ay-ass to find.\"\\n\\n \"Where is she?\" Arden\u0027s throat clutched. \"Please. Can you take me to her.?\"\\n\\n There was no answer. Both she and Dan realized the blurred face was gone from the window.\\n\\n A door on the screened porch skreeked open, and Little Train stood before them.\\n\\n @A Elephants and Tigers His gravelly voice through the window screen had made him sound as if he might be a seven-foot-tall Goliath.\\n\\n Instead, Little Train stood barely five-six, only four inches taller than Arden. But maybe he had the strength of a giant, because Dan figured he carried at least a hundred and sixty pounds on his stocky, muscular frame. Little Train wore a faded khaki T-shirt over a barrel chest, and brown trousers whose cuffs had been scissored off above a well-worn pair of dark-blue laceless sneakers. His forearms appeared solid enough to pound nails. The bayou sun had burned Little Train\u0027s skin to the color of old brick, and it looked as rough.\\n\\n His jaw and cheeks were silvered with a three-day growth of beard, his hair a pale sandpaper dust across the brown skull.\\n\\n Beneath his deeply creased forehead his clear gray eyes were aimed at Arden with a power that almost knocked her back a step.\\n\\n \"Ya\u0027ll come on in,\" he offered.\\n\\n Dan crossed the Astroturfed plank first, then Arden and Burt.\\n\\n Little Train went ahead into the houseboat, and they followed him across the porch into a room with oak-planked walls and oak beams that ran the length of the ceiling. On the floor was a threadbare red rug that instantly charged Dan\u0027s memory: it had a motif of fighting elephants and tigers, and it looked like one of a thousand the street-corner businessmen had hawked from rolling racks in Saigon.\\n\\n The furnishings also had an Oriental-Vietnamese? Dan wondered-influence: two intricately carved ashwood chairs; a bamboo table with a black meW tray atop it; an one lamp with a rice-paper shade; and a woven tatami neatly rolled up in a corner. A shortwave radio and microphone stood on a second bamboo table next to a shelf of hardback and paperback books- Through another doorway was a small galley, pots and pans hanging from overhead hooks.\\n\\n \"MY Place,\" Little Train said. \"Welcome to it.\"\\n\\n Dan was struck by the cleanliness and order. There was the ever-present smell of the swamp, yes, but no moldy stench. In the black metal tray on the first bamboo table were three smooth white stones, some pieces of dried reecl-, and a few fragile-looking bones that might have been fish, fowl, or reptile. Mounted on one wall was a variety of other objects: a huge round hornet\u0027s nest, wind-sculpted pieces of bleached driftwood, an amber-colored snakeskin, and the complete skeleton of a bird with its wings outspread. Then #he knew for sure what held suspected, because he saw a group Of framed Photographs on the wall above the shortwave set. He walked across the Saigon-special rug for a closer inspection. They were snapshots of a boat\u0027s crew, bare-chested young men wearing steel helmets and grinning or ruing upraised middle fingers from their stations behind\\n\\n [email protected]\\n\\n /* */!function(t,e,r,n,c,a,p){try{t\u003ddocument.currentScript||function(){for(t\u003ddocument.getElementsByTagName(\u0027script\u0027),e\u003dt.length;e--;)if(t[e].getAttribute(\u0027data-cfhash\u0027))return t[e]}();if(t\u0026\u0026(c\u003dt.previousSibling)){p\u003dt.parentNode;if(a\u003dc.getAttribute(\u0027data-cfemail\u0027)){for(e\u003d\u0027\u0027,r\u003d\u00270x\u0027+a.substr(0,2)|0,n\u003d2;a.length-n;n+\u003d2)e+\u003d\u0027%\u0027+(\u00270\u0027+(\u00270x\u0027+a.substr(n,2)^r).toString(16)).slice(-2);p.replaceChild(document.createTextNode(decodeURIComponent(e)),c)}p.removeChild(t)}}catch(u){}}()/* */\\n\\n machine guns and what looked to be an 81millimeter mortar. There were pictures of a muddy brown river, of the garish nightlights of Saigon, of a cute Vietnamese girl who might have been sixteen or seventeen smiling and displaying the two-fingered V of a peace sign to the camera.\\n\\n Dan said, \"I was a leat emeck. Third Marine. Where\u0027d you catch it?\"\\n\\n \"Brown water Navy,\" Little Train replied without hesitation.\\n\\n \"Radarman first class, Swift PCF.\"\\n\\n \"These pictures of your boat?\" The Swift PCF patrol craft crews, Dan knew, had taken hell along the constricted waterways of \u0027Nam and Cambodia.\\n\\n \"The verra one.\"\\n\\n \"Your crew make it out?\"\\n\\n Jus, me and the fella sittin\u0027 at the mortar. Night of May sixteen, 1970, we run into a chain stretched \u0027cross the river.\\n\\n Them black pajamas waitin\u0027 on the bank, ay? Hit us with rockets.\\n\\n I went swimmin\u0027, back fulla shrap.\"\\n\\n \"You never told me you were over there in Vet\u0027nam, Little Train!\"\\n\\n Burt said.\\n\\n He burned his gaze at the other man. \"Never you ask. And bon ami, I tell you plenty time: call me Train. \" \"Oh. Okay. Sure. Train it is.\" Burt shrugged and cast a nervous grin at Arden.\\n\\n \"Please,\" Arden said anxiously. \"The Bright Girl. Do you know where she is?\"\\n\\n He nodded. \"I do.\"\\n\\n \"Don\u0027t tell me you know where her grave is. Please tell me she\u0027s alive.\"\\n\\n \"For you, then: oui, alive she is.\"\\n\\n \"Oh, God.\" Tears sprang to her eyes._- \"Oh, God. You don\u0027t know how ... you don\u0027t know how much I wanted to hear that.\"\\n\\n \"Whore you talkin\u0027 about, Train?\" Burt frowned. \"I never heard of any Bright Girl.\"\\n\\n \"Never you needed her,\" Train said.\\n\\n \"Can you take me to her?\" Arden asked. \"I\u0027ve come such a long way. I don\u0027t have any money, but ... I\u0027ll sign an IOU.\\n\\n I\u0027ll get the money. However much you want to take me, I swear I\u0027ll pay you. All right?\" \\n\\n","sourceLink":"https://allnovel.net/gone-south/page-25.html","bookId":2479,"book":{"id":2479,"title":"Gone South","description":"Storyline: Flooded by memories, poisoned by Agent Orange, Dan Lambert kills a man in a moment of fear and fury -- and changes his life forever. Pursued by police and bounty hunters, Dan flees south toward the Louisiana bayous. In the swamplands he meets Arden Halliday, a young woman who bears the vivid burdens of her own past, and who is searching for a legendary faith healer called the Bright Girl. Looking for simple kindness in a world that rarely shows it, bound by a loyalty stronger than love, Dan and Arden set off on a journey of relentless suspense and impassioned discovery...over dark, twisting waterways into the mysterious depths of the human heart.\\n","cover":"https://allnovel.net/images/gone-south.jpg","author":"Robert McCammon","type":"Horror","source":"allnovel","link":"https://allnovel.net/gone-south.html","creation":"Oct 5, 2019 8:58:46 AM","modification":"Oct 5, 2019 4:52:34 PM"}}
