{"id":75190,"no":24,"title":"Page 24","content":"Eyeing the older man once more, he saw that Mike was wearing a handsome smoking jacket—a prank gift from Bobbi—and a pair of comfortable slacks. He appeared to be having a relaxing evening in his man cave. Mike Richmond rarely relaxed, so Gabe felt a bit guilty for disturbing him.\n “Something wrong, Gabriel?” the older man asked, refilling a Waterford crystal whiskey glass and lifting the matching decanter questioningly. Gabe nodded and unbuttoned the top two buttons of his shirt. He usually changed into less-restrictive clothing after coming from the office but he was still wearing his crisp shirt and suit trousers—at least he’d lost the tie and jacket somewhere along the way.\n He took the filled whiskey glass from Mike, unbuttoning his cuff at the same time and rolling the sleeve up to his elbow before switching the glass to the other hand and doing the same with the opposite cuff. Mike had dropped down into his easy chair again and was watching him with those astute amber eyes that rarely missed much. Gabe avoided his scrutiny and sat down opposite him, taking a sip of the Glenlivet and leaning back on the leather recliner with a slight sigh.\n “Well?” Mike prompted after a long silence, taking a puff from his cigar.\n “Can I have one of those?” Gabe asked, and Mike waved the blunt cigar at the table between their chairs to the mahogany humidor residing there.\n “Help yourself . . .”\n Gabe grunted a thanks and took his time picking one of the expensive Cubans. When he found one to his liking, he rolled it appreciatively between his thumb and index finger and took a deep whiff before reaching for the cutter and snipping off the end.\n “What are you watching?” Gabe asked around the cigar that he now had clenched between his teeth. He rarely lit the cigars and he wasn’t sure if he’d indulge tonight either.\n “Die Hard,” the older man answered.\n “Aah. One of the good ones.” Gabe grinned.\n “You’re not going to tell me what you’re doing here?”\n “It’ll keep,” Gabe responded, picking up the remote control that was resting beside the humidor. “I’d rather watch John McClane kick butt.”\n It was another half an hour filled with witty one-liners and loud explosions before either of them spoke again.\n “Bobbi not in?” Gabe asked casually, blowing on the end of the cigar that he’d lit ten minutes earlier. “She loves this movie.”\n “I haven’t seen her but Faye told me that she’s gone out with some friends. About damned time, you ask me,” Mike muttered, keeping his eyes on the screen.\n “What do you mean?”\n “I mean the girl seems to forget she’s female half of the time. It will do her a world of good to spend time with other women. And your buddy—De Lucci’s—wife is a damned fine lady.”\n “So she’s not out with that guy?”\n The older man’s gaze sharpened.\n “What guy?”\n “She met him at the pub this afternoon and left with him. I thought she might have gone out with him . . .” And the thought had made him feel close to murderous. Mike continued to inspect him with those shrewd eyes. “Uh . . . anyway, do you know what time she’ll be home?”\n Mike shrugged, shifting that uncomfortable stare to the television screen and wincing as he watched Bruce Willis drag his bare feet through broken glass.\n “Who knows? These things can go on for hours.”\n “Is it safe for her to be out that late?” That pulled Mike’s attention from the on-screen action.\n “It’s none of my business how late she stays out. I’m well aware that she’d be living on her own by now if not for the fact that she opened her shop. I can’t tell her what to do.”\n “You’re not concerned?”\n “She won’t drink and drive, she won’t take risks—she’s perfectly fine.”\n “Anything could happen . . .”\n “What’s this really about, Gabriel?” he asked astutely, and Gabe backed off immediately. How could he answer a question he didn’t know the answer to?\n “Nothing, I was just a bit concerned. You’re a wealthy man, Mike. Have you even considered that Bobbi could be at risk because of that?”\n “Of course I have. When my children were small I had security details on them, you know that. Now that they’re adults, my sons take care of their own security and Bobbi is well aware of the dangers. You know my daughter . . . stubborn to her core, that girl. So I compromised—I provide security at her shop but her personal life is just that. No big, bulky men trailing after her wherever she goes. Now do you mind? I’d like to enjoy my movie without this constant chatter.”\n Gabe shut up but he was starting to feel restless again. How could Mike be so damned sanguine about Bobbi’s safety and security? It wasn’t anything Gabe had even considered until just now and he was suddenly petrified that Bobbi would be kidnapped at any moment. He had lost interest in the movie but kept his eyes pinned to the screen even while his mind raced. Why had he never considered the risks to Bobbi before now?\n It was making him edgy.\n He chewed the end of his cigar and glared at the screen without really seeing the action. As soon as he realized the credits were rolling, he glanced at his watch. Just after ten, too early for her to come home yet.\n “What do you want to watch next?” he asked Mike, and the older man’s brows leapt to his hairline. “One of the sequels?”\n “Since you were barely paying attention to the last movie, I doubt a second one could hold your interest. Do you want to tell me what the hell is going on in that head of yours now, Gabriel? Something at work?” \n","sourceLink":"https://allnovel.net/his-unlikely-lover-unwanted-3/page-24.html","bookId":1836,"book":{"id":1836,"title":"His Unlikely Lover (Unwanted #3)","description":"Storyline: \n Bobbi Richmond has always been in love with her best friend, Gabe Braddock, even if Gabe, who works for her media mogul father, has always treated Bobbi like a kid sister, calling her “Runt.” \n After a tipsy Bobbi kisses Gabe at a party, Gabe is surprised to find “Runt” becoming the object of his fantasies, and Bobbi is shocked to find her advances suddenly reciprocated. When Gabe suggests adding “benefits” to their friendship—while keeping their new arrangement secret from their families, of course—should Bobbi feel flattered, or insulted by his insistence on casual sex? Are they even a match? Slick and conservative Gabe dates coiffed blondes, while the tomboyish Bobbi spends much more time fixing cars than her hair. \n When Gabe’s twin brother, Chase, senses something’s up between the old friends, he forces Gabe to confront his real feelings for Bobbi—and decide whether or not he could live without her.\n \n","cover":"https://allnovel.net/images/his-unlikely-lover-unwanted-3.jpg","author":"Natasha Anders","type":"Romance","source":"allnovel","link":"https://allnovel.net/his-unlikely-lover-unwanted-3.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 10:33:25 AM"}}
