{"id":75169,"no":3,"title":"Page 3","content":"He hesitantly closed his arms around her slight frame while trying to maneuver away from her and force some distance between their bodies, but she’d latched on so tightly they wouldn’t have been able to squeeze a sheet of paper between them. He sighed and moved his hands down to either side of her waist and was surprised to discover that it was curvier than he’d anticipated. There was a definite, defined, nipped-in waist that curved out into gently flared hips. His hands spanned the entire length of her waist, with his thumbs brushing the underside of the slight swell of her breasts and his pinkie fingers resting on the flare of her hips. Before this very moment he had thought—when he’d given any consideration to the matter at all—that Bobbi was straight up and down. He never would have guessed at this perfectly proportioned, petite, hourglass figure.\n Curious, he allowed his hands to explore further, moving one to her back and spreading his fingers so that it covered her entire narrow expanse. He angled his hand until the tips of his fingers just brushed at the swell of her butt and then was immediately besieged with guilt, as he comprehended that he was actually trying to cop a feel off Bobbi! What the hell was wrong with him?\n He tried to move away again, but she moved closer, and he tilted his head to see her face. She was nuzzling at his chest, her breath hot against the naked flesh just above his unbuttoned shirt. Strange, he didn’t quite remember unbuttoning that third button or the second for that matter! He had only loosened his tie and unbuttoned his collar.\n “Hey, hold up there, sweetheart.” He could feel her fingers busily working on the fourth button. “What the hell are you doing, Bobbi?”\n “Dancing.” Her lips brushed against his flesh as she spoke, sending hot darts of pleasure racing from the point of contact all the way down to parts he’d best not be thinking about right now.\n “Okay. Enough, Bobbi. I don’t know what you think you’re doing, but it’s gone far enough.” He moved his arms back up to her shoulders and moved her away from him, using gentle force.\n She kept her face angled down, and he used a thumb and forefinger to slant her chin up and meet her eyes. She possessed enough of her faculties to look embarrassed; a flush stained her delicate cheekbones and made her look somewhat feverish.\n “What’s up, Runt?” She winced at the nickname, and he immediately regretted using it. Not the best timing—not when something was clearly eating at her.\n “I’m such a fool.” Her voice was so low that he had to bend his head a few inches to catch the words.\n “No, you’re not. Why would you say that? Did somebody say something to upset you?”\n She raised a slender, slightly calloused hand to his cheek and stroked the flesh softly. He found the combination of soft and hard on his skin disturbing and unthinkingly dragged his face away from her gentle touch, leaving her small hand hovering in midair. Her eyes immediately filled with pain, and he felt like a complete ass for putting that look on her face. He didn’t know what was going on with her tonight, but he had no doubt that the amount of alcohol she had consumed would have her regretting her actions in the morning.\n She dropped her hand down to her side, and he reached up to cradle her delicate face between both of his hands.\n “What’s wrong, sweetheart?” he murmured, and watched with a perplexed frown as her eyes filled with tears. Bobbi hardly ever cried; in fact he could count on one hand the number of times he had seen her cry over the last twenty years. He didn’t know how to respond to this. He watched as a single tear slid down her smooth cheek, until it collided with one of his thumbs and formed a tiny pool beneath the digit.\n “I’m a fool,” she repeated, her tone numb.\n “Bobbi, I . . .” Every thought fled from his mind when she went up onto her toes and firmly planted her soft, sweet lips on his mouth, catching him in midsentence. The next breath he inhaled was hers. It filled his lungs and he held it in for one long, possessive moment until he had no choice but to relinquish it back to her.\n Oh my God! It was the only coherent thought he had as he found himself taking control of the kiss that she had initiated, sweeping his tongue into the sweet, hot depths of her mouth, relishing the taste of her, the smell, the feel . . . God, she felt good—a small, perfect armful that he couldn’t seem to get close enough to. He moved one hand down to the small of her back, anchoring her to him, bending her backward in an attempt to get even closer.\n Oh my God!\n Every delectable inch of her was plastered to him from chest to thighs, and he wanted her even closer. Some distant part of his mind was making faintly alarmed noises, but most of his higher brain functions had short-circuited the moment her soft lips had touched his. Sure they’d exchanged kisses before, perfunctory pecks that were nothing like this. Where the hell had this come from?\n She tasted like champagne—sweet and tart—and her kiss effervesced through his system, sending his nerve endings tingling with ebullient messages that were hard to ignore.\n He lifted his mouth from her intoxicating lips for a second, needing air, but all he inhaled was Bobbi . . . the heady scent of vanilla and freesias. Why had he never known how good she smelled before now? he wondered absently before angling his mouth to take hers again.\n She murmured his name, and despite the music and noise swirling around them, the fractured sound registered just as he reclaimed her lips, and it was as effective as being doused in ice water. He jerked his head back and shook it to clear his befuddled brain.\n What the hell am I doing?\n He stepped away from her a second after that thought rang through his mind, putting some desperately needed distance between his aroused body and hers. He was still too close to her for his liking—her every gasping breath threatening to bring her chest within touching distance of his ribcage—but the crowd made it difficult to move farther away from her. \n","sourceLink":"https://allnovel.net/his-unlikely-lover-unwanted-3/page-3.html","bookId":1836,"book":{"id":1836,"title":"His Unlikely Lover (Unwanted #3)","description":"Storyline: \n Bobbi Richmond has always been in love with her best friend, Gabe Braddock, even if Gabe, who works for her media mogul father, has always treated Bobbi like a kid sister, calling her “Runt.” \n After a tipsy Bobbi kisses Gabe at a party, Gabe is surprised to find “Runt” becoming the object of his fantasies, and Bobbi is shocked to find her advances suddenly reciprocated. When Gabe suggests adding “benefits” to their friendship—while keeping their new arrangement secret from their families, of course—should Bobbi feel flattered, or insulted by his insistence on casual sex? Are they even a match? Slick and conservative Gabe dates coiffed blondes, while the tomboyish Bobbi spends much more time fixing cars than her hair. \n When Gabe’s twin brother, Chase, senses something’s up between the old friends, he forces Gabe to confront his real feelings for Bobbi—and decide whether or not he could live without her.\n \n","cover":"https://allnovel.net/images/his-unlikely-lover-unwanted-3.jpg","author":"Natasha Anders","type":"Romance","source":"allnovel","link":"https://allnovel.net/his-unlikely-lover-unwanted-3.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 10:33:25 AM"}}
