{"id":75170,"no":4,"title":"Page 4","content":"She had her face tilted up toward his, her heavy-lidded eyes were liquid with longing, her every breath emerged on a hitched sob, and her skin had a flushed, dewy look that immediately betrayed her arousal. It was all he could do to prevent himself from reaching for her again. She was drunk, he reminded himself. He was the one who had to maintain control; he couldn’t take advantage of her. It was unthinkable—this was Bobbi! That thought immediately dampened his arousal and brought his body firmly back under his control.\\n\\n He clung to that: Bobbi. It put things into jarring perspective. He didn’t know what the hell had just happened, but it had to have been a temporary aberration.\\n\\n This was Bobbi.\\n\\n He pushed memories of her as a small girl with a gap-toothed grin and pigtails into his brain, and then as an awkward preadolescent, a gawky teenager, and lastly a permanently disheveled young woman in overalls, with grease smeared on her face, and he immediately felt . . . less. Just less.\\n\\n He forced one of his hands to reach for her elbow and ignored the residual tingling in his fingertips as he latched onto her silky skin. He dragged her to the side of the dance floor and looked around until he found an empty chair in a relatively quiet spot. He led her to it and urged her to sit down. She still looked a bit dazed and thankfully sat down without protest. He sank onto his haunches in front of her.\\n\\n “Wait here,” he ordered, and she blinked up at him, looking totally out of it. “Bobbi, do you hear me? Do not move from this spot! I’ll be right back.”\\n\\n She nodded. He got up and headed for a refreshment table on the opposite side of the room, intending to get her some water. He glanced back and nearly stumbled when she brought one of her hands to her mouth and traced the outline of her lips.\\n\\n Could she still taste him? He could still taste her.\\n\\n He felt like his structured, well-organized world was on an express train to hell, and he needed to find the emergency brake immediately or his life would descend into absolute chaos.\\n\\n Bobbi! He reminded himself sternly before turning and continuing his progress to the refreshment table.\\n\\n Gabe had kissed her!\\n\\n Okay, she was just sober enough to remember that she had kissed him first, but he had kissed her back! He had definitely kissed her back. That hadn’t been her imagination. Had it? She could still feel the pressure of his warm, smooth lips on hers, the scrape of his just emerging stubble against her cheek. And she could taste the whiskey-tinged flavor of his tongue in her mouth.\\n\\n But why had he left her here?\\n\\n She accepted another glass—flute—of champagne from a handsome waiter and contemplated that question. He had left absolute ages ago. She stood up and swayed before moving in the direction she was sure he had gone. Maybe he was with that woman again. Rosalie. Was he kissing her now?\\n\\n She stumbled and bumped into someone.\\n\\n “Roberta?” She didn’t need to see the owner of that dark, accented voice to know to whom it belonged. She grinned up at him.\\n\\n “Aaah, the birthday boy!”\\n\\n “Are you okay?” Alessandro De Lucci asked in concern, and she squinted up at him. He was a handsome man, but his two noses made him look kind of freakish.\\n\\n “You should have that seen to.” She waved her gl— flute at him and he frowned.\\n\\n “What? You’re not making sense, piccola.”\\n\\n “That second nose . . . where did it come from?”\\n\\n “Aaah. Too much champagne for you, I think.” He grinned, snatching her half-full gla— flu— whatever, and latching an arm around her waist when the unexpected move unbalanced her. “Okay, I’ve got you, piccola mia. Let’s find my wife and get you put to bed.” Theresa and Sandro had offered rooms to some of their guests who lived farther away, hoping to eliminate any incidences of drunk driving.\\n\\n “Okay. I am rather sleepy,” she told him.\\n\\n “I’m sure you are,” he agreed.\\n\\n “You’re much nicer than you used to be,” she informed him drowsily, and he chuckled.\\n\\n “So I’ve been told.”\\n\\n Bobbi was gone! Gabe swore softly and frantically looked around for her in the throng of people surrounding him. He hadn’t been gone more than a couple of minutes. Where the hell had she disappeared to?\\n\\n “Shit,” he whispered beneath his breath and pushed his way through the chatting, laughing groups of people. He spotted Max Kinsley, an old university friend standing at the far side of the room. Bobbi may have wandered over to chat with him . . . or dance with him. Would she have kissed him too? The question hit him like a fist to the solar plexus and expelled the breath from his lungs as he visualized Max with Bobbi in his arms, with his mouth on hers and his chest plastered to hers.\\n\\n Hell no!\\n\\n He told himself that the rage he felt at the vision that formed in his mind’s eye was the same protective instinct Sandro felt toward his sister . . . that had to be it.\\n\\n “Where’s Bobbi?” He demanded to know when he eventually managed to reach Max’s side. The other man looked surprised by his question.\\n\\n “No idea. You’re her minder, bro. Not me.” Seeing the truth on his friend’s face, Gabe’s eyes roamed the crowded room again. He couldn’t help picturing her flitting from one guy to the next, bestowing her dances and kisses freely on every one of them like some horny, drunken little fairy. She could get herself into some serious trouble if she ran into the wrong guy.\\n\\n “Lose something?” a deep voice murmured from behind him, and he whirled around to see Sandro smirking at him.\\n\\n “I assume you know where Bobbi is?” he asked. The other man took a lazy sip of whiskey before replying. \\n\\n","sourceLink":"https://allnovel.net/his-unlikely-lover-unwanted-3/page-4.html","bookId":1836,"book":{"id":1836,"title":"His Unlikely Lover (Unwanted #3)","description":"Storyline: Bobbi Richmond has always been in love with her best friend, Gabe Braddock, even if Gabe, who works for her media mogul father, has always treated Bobbi like a kid sister, calling her “Runt.” \\n After a tipsy Bobbi kisses Gabe at a party, Gabe is surprised to find “Runt” becoming the object of his fantasies, and Bobbi is shocked to find her advances suddenly reciprocated. When Gabe suggests adding “benefits” to their friendship—while keeping their new arrangement secret from their families, of course—should Bobbi feel flattered, or insulted by his insistence on casual sex? Are they even a match? Slick and conservative Gabe dates coiffed blondes, while the tomboyish Bobbi spends much more time fixing cars than her hair. \\n When Gabe’s twin brother, Chase, senses something’s up between the old friends, he forces Gabe to confront his real feelings for Bobbi—and decide whether or not he could live without her.\\n","cover":"https://allnovel.net/images/his-unlikely-lover-unwanted-3.jpg","author":"Natasha Anders","type":"Romance","source":"allnovel","link":"https://allnovel.net/his-unlikely-lover-unwanted-3.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 10:33:25 AM"}}
