{"id":66708,"no":22,"title":"Page 22","content":"Jack’s eyes roamed her face, and Lorraine started to tremble at the warmth in his gaze. She made herself return to the task of feeding him, but her hands shook too badly and she had to stop for a moment.\n “When can I have real food?”\n “Soon,” she promised. Without antibiotics to help combat infection, his body required more time to heal. He needed a great deal of sleep, too, and it frustrated him that he only seemed able to stay awake an hour or so before drifting off again.\n Time lagged for her while he slept. In the past few days she’d read every piece of printed material on board. Twice. She’d laundered all his clothes and appropriated a couple of shirts and a pair of drawstring cotton shorts for herself. She’d cleaned, scrubbed and reorganized the entire living quarters. It was apparent from certain things she’d found while cleaning—small gifts, cards she shouldn’t have read but did—that Jack maintained a number of ongoing relationships with women around the Caribbean. This confirmed the decision she’d already made: It would be best to let him continue believing she was married. Besides, she couldn’t come up with an easy way to tell him there really wasn’t a husband. He’d assumed it—she let him—and now she preferred to leave things as they were. And Gary…well, she’d agreed to marry him. She loved Gary, she truly did. She had no business contemplating for even two seconds any kind of liaison with another man. She’d taken to wearing Gary’s engagement necklace outside her shirt. Jack’s shirt.\n Jack would’ve been more comfortable belowdecks in his own bed, but he’d rejected that idea, choosing to soak in the sunshine and fresh salt air. Lorraine made a bed for him on a chair that partially reclined, and he spent his time there.\n “You forgot to untie Scotch on Water from the dock!” He chuckled.\n Lorraine knew it had been a mistake to tell Jack how she’d managed to escape from Pucuro. He’d teased her about it more than once. Those were the only times his face showed signs of color. He’d lost a lot of blood and was still deathly pale and very weak. She supposed she ought to be grateful that Jack seemed to find the tale of their escape so amusing.\n He finished the soup, and Lorraine watched as he fought to keep his eyes open. “Sleep, Jack,” she urged, ready to retire for the night herself. She slept belowdecks in his bed.\n “I want to talk,” he insisted, and clung to her wrist to keep her from leaving.\n “Later,” she promised.\n “Don’t go for a few minutes, okay?”\n “Okay.”\n “I’ll just rest my eyes for a little while and then we can…”\n Whatever he was about to say was lost as he fell asleep. She didn’t know what he wanted to talk about, and in some ways was grateful he’d been too weak. Her fear was that he’d bring up something better left unsaid.\n The subject of her assumed marriage was like a lit fuse thrust between them. At times Lorraine wished she’d set him straight on the first occasion he’d mentioned her “husband.” But then she’d remember Gary, or something would happen to remind her how far removed Jack’s world was from hers. There could be no future for them.\n She should leave now, she realized, and go down below. Still, she stayed at his side, watching the moon’s reflection on the water. She might simply be rationalizing her feelings, but really, it was logical that under these circumstances, she’d be attracted to Jack. He’d saved her life and she’d saved his. Such a bond between two people couldn’t be ignored.\n They’d created a genuine friendship during these past days. Or so Lorraine believed, anyway. They’d talked about many things, and he’d given her glimpses of his life before Scotch on Water. It didn’t surprise her to learn he’d been a mercenary. He’d worked with a group of men who’d called themselves Deliverance Company. Apparently he’d had deep friendships with these men.\n Lorraine did her share of talking, too. She told him about her childhood, growing up without a father, and about her mother. But describing her life with Virginia made her sad, and she quickly changed the subject to her favorite movie plots. He hadn’t seen many movies in the past few years, and she delighted in recalling the ones she treasured and watched again and again. She’d thought about some of them recently, so retelling The African Queen and Casablanca was—admittedly—a chance to show off. His reactions were everything she could have asked for. These movie sessions were the most fun she’d had since before her mother died. She particularly enjoyed narrating the plot of Romancing the Stone, which he’d never seen. It wasn’t hard, somehow, to imagine the two of them in the lead roles….\n There were more personal stories, too. That very afternoon, in fact, she’d asked him about his scars. He explained his injuries from the years he served with Deliverance Company and then wanted to know if she had any. Only one, she’d told him, from a broken arm that had required surgery. She’d been horsing around with friends, demonstrating her skill sliding down a staircase railing. Unfortunately she’d toppled and tumbled down a whole flight, landing on her right arm. That experience had taught her a certain caution.\n Lorraine waited, watching him sleep. His breathing evened out and she started to ease away from his side and slip belowdecks. To her surprise his grip on her wrist tightened.\n “Don’t go,” he whispered, but his eyes remained closed.\n The night, with moonlight glowing on the water, was almost unearthly in its beauty. “Lie with me awhile,” he urged. He slid over to give her space.\n Resting her head against his good shoulder, she lay beside him. Jack placed his right arm around her and she draped hers across his middle.\n This quiet intimacy between them was exquisite. Without speaking of it, they both seemed to recognize that this was time set apart. Even when she was certain Jack had fallen into a deep sleep, she didn’t leave. She hadn’t been this content in days. Weeks. She’d found a haven in this stranger’s arms.\n Except that he wasn’t a stranger anymore….\n Lorraine awoke and the world was dark. The boat pitched aimlessly about the gulf, going wherever the currents took her. Stars glittered in the inky sky—more stars than she’d ever seen.\n She’d lain there for some time, soaking in the beauty and peace of these moments, before she realized Jack was awake, too. His arm was around her and her head was tucked beneath his chin, which he rubbed softly against her hair. It was the kind of thing a lover would do. Tilting her head back, Lorraine looked at Jack. Their eyes met, and the way he stared at her filled her with longing. She wanted him to kiss her.\n He wanted it, too. She saw it in his eyes, in the avid way he studied her mouth. She swallowed, almost groaning with the need to feel his lips on hers. His hand, which lay gently against her ribs, rose slowly until it reached her breast…. He paused. Held his breath. So did Lorraine.\n Neither pretended that touch hadn’t happened. Neither looked coyly away. He did nothing to disguise his own body’s reaction. He wanted her, and her heart rejoiced.\n He lowered his head as if to kiss her, but stopped himself just before their mouths touched.\n “Tell me about your husband,” he whispered.\n Lorraine wasn’t sure how to answer. If she told him the truth now, she feared the temptation would be more than either of them could resist. He’d kiss her and she’d welcome his touch. Before long, they’d be lovers and that would be a mistake she couldn’t afford. There was too much she didn’t know about Jack. Too much she didn’t want to know. He had a wild and dangerous side, like the heroes in her favorite movies. A relationship with Jack could never last. She’d end up being just another of his women. Nor would she betray Gary….\n “What…do you want to know?”\n “His name.”\n She hesitated. “Gary. Gary Franklin.”\n “You kept your maiden name? Dancy?”\n “Yes,” she whispered.\n “Does he call you Lorraine or Raine?”\n “Lorraine.” She didn’t want to discuss Gary. Her fiancé seemed very distant from these weeks with Jack. Out here in the middle of the Gulf of Mexico everything about her life in Louisville, including Gary, seemed unreal.\n “What does he do?”\n “He’s a manager for a medical-supply company.” She recognized what Jack was doing. He was trying to create a sense of Gary as a man, as a real person and not merely a name, in an effort to stem the potency of their attraction. It wasn’t working. Had she offered him her lips just then, he would have kissed her. It was what they both wanted, their hunger so strong it seemed to pulse between them.\n “Does he love you?”\n She had trouble forming the word, and it came out sounding scratchy, uncertain. “Yes.”\n “Enough?”\n It hadn’t been easy for Gary to stand aside and let her search for her father on her own. He’d wanted to travel with her, but she’d discouraged that. As it turned out, she wished he had come, then none of this would have happened.\n “Does he love you enough, Lorraine?”\n “Yes,” she whispered, and her voice broke.\n Jack eased his hand away from her, slowly, as if he knew he’d never touch her again.\n Lorraine worried her lower lip. There was no going back now. Continuing the lie had sealed their future.\n Lorraine refused to make the same mistakes her mother had. In a way, it was that simple. When the time came, she’d return to Louisville and go through with the wedding. She’d have Gary’s children and live a good honest life. It was what she wanted. What she needed. Her mother would have approved.\n Jack awoke to find Lorraine no longer at his side. It was just as well, he acknowledged, but he couldn’t quite make his heart believe it.\n Ever since Marcie, Jack had avoided emotional entanglements. There were a couple of women he saw on an occasional basis, but both were the type who neither wanted nor expected any kind of commitment. Jack was content with his life. He didn’t know why he found it necessary to keep reminding himself of that. Until recently he hadn’t even liked Lorraine. He’d considered her prissy, stubborn and self-righteous. Furthermore, she was married.\n Lorraine hadn’t changed. And she was still married. The difference was in how he viewed her. In the days since they’d left El Mirador, he’d come to know her and realize she was caring, generous, amusing, brave, beautiful—with each day the list grew longer. But she was the same person she’d always been.\n The physical differences were more noticeable. Her fancy linen jacket had been replaced by one of his shirts, the ends tied at her waist, revealing tantalizing glimpses of midriff. The linen pants were gone, too. Instead, she wore a pair of his shorts and walked barefoot. Half the time it was all he could do to keep from staring at her legs.\n Her hair, once so perfect with every strand in place, was gathered into a ponytail. Over the past few days she’d acquired a rich golden tan. Rarely had he seen any woman more physically appealing. \n","sourceLink":"https://allnovel.net/the-sooner-the-better-deliverance-company-3/page-22.html","bookId":2350,"book":{"id":2350,"title":"The Sooner the Better (Deliverance Company #3)","description":"Storyline: \n The Sooner the Better (Deliverance Company #3) \n Lorraine Dancy has just discovered that everything she believes about her father is a lie\u0026#151;starting with the fact that Thomas supposedly died years ago. Now she\u0027s learned that not only is he not dead, he\u0027s living in a small town south of the border. In the process of tracking him down, she manages to get framed for theft and pursued by the real thief, the police and a local crime boss. Her father\u0027s friend Jack Keller agrees to help her escape, although Lorraine\u0027s reluctant to depend on a man like him. \n Jack\u0027s every bit the renegade Lorraine thinks he is\u0026#151;an ex-mercenary and former Deliverance Company operative. He\u0027s also the one person who can guide her to safety. But there are stormy waters ahead, including an attraction neither of them wants to feel. An attraction that\u0027s as risky as it is intense\u0026#151;for both of them. The sooner he can get Lorraine home, the better!\n \n","cover":"https://allnovel.net/images/the-sooner-the-better-deliverance-company-3.jpg","author":"Debbie Macomber","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-sooner-the-better-deliverance-company-3.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:01:38 AM"}}
