{"id":66693,"no":7,"title":"Page 7","content":"“My father lives there,” she said without elaborating.\\n\\n “In El Mirador?” Jason’s eyes widened briefly. “What’s he doing there?”\\n\\n “He’s a teacher.”\\n\\n “The Peace Corps?”\\n\\n Lorraine looked out the window. Considering how nervous she was about meeting her father, she should be grateful for someone to talk to. She’d tell Jason the whole story, she decided impulsively. He’d certainly told her a lot about his own background, and she sensed she could trust him. She took a deep breath. “To be honest, Jason, I don’t really know. I haven’t seen him since I was three—I was told he’d died of leukemia. I only found out a month ago that he’s actually alive, and once I did, I couldn’t stay away. My fiancé thinks I’ve gone off the deep end and maybe I have.” She ended up telling Jason about her mother’s death, the letter she’d discovered with the items from the safe-deposit box and about Gary.\\n\\n Jason took a moment to absorb everything. “Does your father know you’re coming?”\\n\\n “Yes, of course,” she said, struggling not to sound defensive. Then she sighed. “I’m not sure.” Since he hadn’t been in Mérida to meet her, she no longer knew what to expect.\\n\\n “But you’ve been in touch with him?”\\n\\n “Oh, yes.” Lorraine had grown resentful when Gary asked her these same questions. But Jason seemed genuinely interested and concerned about her, while Gary had been so insistent. So overprotective. “I phoned and left a message at the school, but he didn’t return my call. When I didn’t hear back from him, I sent a letter. I was hoping he’d be waiting for me at the airport…but he wasn’t.”\\n\\n “When did you mail the letter?”\\n\\n “Beginning of last week.”\\n\\n Jason shook his head. “I hate to tell you this, but I’ll bet he hasn’t gotten it yet. The mail—” They hit a rut in the road just then. The bus jolted badly and sent both Jason and Lorraine flying upward. Her teeth felt as if they’d been shaken loose, and she heard Jason’s cry of pain as his head slammed into the roof. The pig escaped, squealing as it raced toward the back of the bus. Undisturbed by the commotion, the driver didn’t even slow down.\\n\\n After a few minutes, everything was quiet again, and Jason finished his sentence. “The mail in this part of the world is notoriously slow.”\\n\\n “Oh, dear.”\\n\\n “You should probably assume that your father has no idea you’re coming,” he warned her. “Who knows if he got your phone message—and he definitely won’t have the letter.”\\n\\n His words sobered Lorraine. She’d traveled thirteen hundred miles, the last part under deplorable conditions. Now there was reason to believe that her arrival would take her father completely by surprise.\\n\\n Ever since that night the dream had awakened him, Thomas Dancy hadn’t been able to stop thinking about Ginny. He realized this had more to do with Azucena than Ginny, since his common-law wife was due to deliver their third child any day.\\n\\n He hadn’t meant to love Azucena, hadn’t meant to start this second family. But along with his other faults, he was weak. Too weak to resist a second chance at love—and life. He usually didn’t give in to these occasional bouts of remorse and self-loathing; he was too realistic for that. But occasionally, like now, thoughts of his former life wouldn’t leave him alone.\\n\\n He sat at his desk, his classroom empty, and stared at the test papers he should be grading. Instead, his mind was on Ginny and the daughter he didn’t know. Guilt weighed heavily on him for breaking the vows he’d spoken in love. He’d always intended to remain faithful to Ginny. In the early years, after he’d fled to Mexico, she’d met him at prearranged destinations, in Mexico City or Veracruz. He lived for those few brief days together. Then Raine had started school and Ginny’s visits became less and less frequent until finally they stopped. Still, he’d spoken vows of love and fidelity. Vows he’d written himself.\\n\\n He was burdened by more than guilt and regret. He worried about Azucena and this baby yet to be born. He was fifty now, and he’d been with her for only the past eight years. Sometimes he believed he had a right to take whatever happiness he could, the happiness Azucena offered him; other times he prayed Ginny would never know of his weakness for this woman so much younger than himself.\\n\\n He hadn’t wanted more children, but Azucena was stubborn and she’d yearned for a baby. She had a loving generous heart, and he couldn’t deny her, not when she’d done so much for him. Soon there would be three children. He wondered if this third child would be a son like the first two.\\n\\n He loved his children, doted on them and, according to Azucena, spoiled them. Because of Antonio and Hector, he realized how much he’d missed with his daughter. Raine was an adult now, but in his mind she remained a child. She’d been so young when he left! Ginny had brought him photographs during those infrequent visits; the last one was a school picture of Raine, gap-toothed, pigtailed, eight years old.\\n\\n A knock sounded on his door. “I apologize for disturbing you,” one of the older students said in Spanish on entering his classroom. “A man has asked to see you.”\\n\\n “Did he give his name?”\\n\\n “Jack Keller.”\\n\\n Thomas grinned despite himself. “Tell him I’ll be right out.” He had little in common with the former mercenary, but it was always good to spend time with another American. Jack didn’t visit all that often, but he invariably brought news of home and the world. On the negative side, he tended to have a foul mouth and a quick eye for a pretty face, but both of these faults were easily forgiven. Jack was a good friend to a man who had few.\\n\\n Thomas shoved the test papers into his leather case and headed for the school office. Jack lounged in a broken-down desk chair, flipping the pages of a year-old magazine. He looked terrible. He needed a haircut, but Azucena would probably see to that. His sun-streaked brown hair brushed his shoulders. Apparently he hadn’t shaved in two or three days, either. His jeans were cut off at mid-calf, the ends frayed, and he wore tennis shoes without socks.\\n\\n “Jack.” Thomas greeted him with enthusiasm and held out his hand.\\n\\n “Hey, Thomas.” Jack tossed aside the magazine and vaulted to his feet. He gripped Thomas’s hand for a firm shake, then slapped him on the back in a gesture of fondness.\\n\\n “You’re beginning to look like an old sea dog,” Thomas said.\\n\\n “Yeah, well, you don’t look so bad yourself. Are you a proud papa yet?”\\n\\n “Any day now.” It worried Thomas that there were no medical facilities close to El Mirador, not that Azucena would agree to have this baby anywhere but in their own home with a midwife. Yet he couldn’t help being concerned, despite the ease of the two previous deliveries.\\n\\n “Got time for a beer?” Jack asked.\\n\\n “Of course.” Thomas would send word to Azucena via a student. She would want Jack to come to the house for dinner. Not only did she like Jack a great deal, it was a matter of pride to her that she feed their guests like visiting royalty. She’d have Thomas’s head if he didn’t bring Jack home with him.\\n\\n He left instructions with Alfonso, then he and Jack strolled over to the waterfront cantina. No sooner had they sat down at a table and tasted their beer than Alfonso was back, breathless from running.\\n\\n “Señor Dancy!” he cried. “Señor Dancy!”\\n\\n “What is it?” Thomas’s first thought was of Azucena.\\n\\n “There’s a woman at the school asking for you,” Alfonso blurted.\\n\\n “A woman?” Thomas ignored Jack’s raised eyebrows.\\n\\n “Sí. She says her name is Lorraine Dancy. She says she’s your daughter.”\\n\\n Four\\n\\n Lorraine’s nerves wouldn’t allow her to wait quietly for her father. She couldn’t sit still, and as she paced the school hallway, her heels clicked against the hard stone floor. A framed document on the wall, written in both Spanish and English, stated that the school was financially supported by a group of Texas churches. It listed the headmaster’s name, plus the three teachers. And it explained that the children’s uniforms were sewn by the Women’s Missionary Society. She read the information twice, then paced some more. Lorraine had arrived in El Mirador half an hour ago—it was nearly six now. She’d known her chances of catching Thomas Dancy at the school this late in the afternoon weren’t good. Jason had wanted her to check into the lone hotel with him, but she’d decided to look for her father first.\\n\\n As it turned out, the school building was open, and when she mentioned her father’s name to a young man in a school uniform, he’d nodded vigorously and even managed to ask her a few questions in English. He’d suggested she wait inside while he went to get her father.\\n\\n For a moment Lorraine had felt light-headed with relief—at least her father was there. Then the real anxiety had begun, the jittery nervous fear. The almost sickening excitement.\\n\\n At the sound of footsteps behind her, Lorraine turned. Thomas Dancy stood in the doorway, framed in bright sunlight.\\n\\n “Raine,” he whispered.\\n\\n “Thomas Dancy?” she asked hesitantly, then, “Dad?” He’d called her Raine in his letter, too, but her mother had always insisted her name not be shortened.\\n\\n The look in his eyes was answer enough. Deep blue eyes, the same color as hers. He came slowly toward her and she could see that he was indeed the man in her mother’s photograph. He gazed at her for a full minute, an awed expression on his face. Then he smiled, and his eyes shone with an intensity that hinted at tears.\\n\\n “Raine,” he said again. “If only I’d known…”\\n\\n “You didn’t get my letter?” she asked.\\n\\n “No…no.”\\n\\n “I phoned, too.”\\n\\n He frowned. “I didn’t get the message.”\\n\\n “Then you didn’t know I was coming?”\\n\\n “No…but I thank God you did.”\\n\\n They stood a few feet from each other, and he continued to stare at her. “How like your mother you are,” he whispered. “So beautiful…” Thomas raised his hand as if to touch her face, then apparently changed his mind and let his arm fall. The love in his eyes was unmistakable.\\n\\n At the mention of her mother, Lorraine felt her own eyes fill with tears.\\n\\n “Raine, what is it?” He stopped short of taking her in his arms.\\n\\n “Mom was killed April first,” she told him shakily.\\n\\n His eyes widened with shock and then slowly, as though his legs would no longer support him, he staggered toward a chair. “Killed? How? Dear God in heaven, tell me what happened.”\\n\\n “She was on her way home from work. It’d been raining that day and no one knows exactly why, but her tires lost traction and her brakes locked—and she skidded into oncoming traffic. She was hit by a huge semi… There was nothing he could do to stop. Nothing anyone could do.”\\n\\n Her father closed his eyes. “Did she suffer?” he asked, his voice so low it was an effort to understand him. \\n\\n","sourceLink":"https://allnovel.net/the-sooner-the-better-deliverance-company-3/page-7.html","bookId":2350,"book":{"id":2350,"title":"The Sooner the Better (Deliverance Company #3)","description":"Storyline: The Sooner the Better (Deliverance Company #3) \\n Lorraine Dancy has just discovered that everything she believes about her father is a lie\u0026#151;starting with the fact that Thomas supposedly died years ago. Now she\u0027s learned that not only is he not dead, he\u0027s living in a small town south of the border. In the process of tracking him down, she manages to get framed for theft and pursued by the real thief, the police and a local crime boss. Her father\u0027s friend Jack Keller agrees to help her escape, although Lorraine\u0027s reluctant to depend on a man like him. \\n Jack\u0027s every bit the renegade Lorraine thinks he is\u0026#151;an ex-mercenary and former Deliverance Company operative. He\u0027s also the one person who can guide her to safety. But there are stormy waters ahead, including an attraction neither of them wants to feel. An attraction that\u0027s as risky as it is intense\u0026#151;for both of them. The sooner he can get Lorraine home, the better!\\n","cover":"https://allnovel.net/images/the-sooner-the-better-deliverance-company-3.jpg","author":"Debbie Macomber","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-sooner-the-better-deliverance-company-3.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:01:38 AM"}}
