{"id":23035,"no":12,"title":"CHAPTER XII. GOOD LUCK AFTER MISFORTUNE.","content":"Mark\u0027s spirits were wonderfully improved when he left the hermit\u0027s cabin, and took his way homeward. So far from being injuriously affected by his discharge from the shoe-shop, his income was considerably increased. Not only this, but he had received five dollars for his past week\u0027s services over and above what he had been paid for his work in the shop. \\n\\n \\n\\n \"Now,\" thought he. \"I can tell mother without minding it.\" \\n\\n \\n\\n But his mother had already heard of it. A neighbor, Mrs. Parker, who rather enjoyed telling bad news, had heard of it through her son, who also worked in the work-shop. \\n\\n \\n\\n She at once left her work, and hurried over to Mrs. Manning\u0027s. \\n\\n \\n\\n \"Good morning, Mrs. Parker,\" said the widow, cheerfully. \"Take a chair, do.\" \\n\\n \\n\\n \"Thank you, Mrs. Manning, I can\u0027t stop a minute. I left my kitchen at sixes and sevens, on purpose to condole with you. I declare, it\u0027s really too bad.\" \\n\\n \\n\\n \"What is too bad? I don\u0027t understand you?\" said Mrs. Manning, perplexed. \\n\\n \\n\\n \"About your son Mark, I mean.\" \\n\\n \\n\\n \"What has happened to him? Is he hurt?\" asked the widow, with a pale face. \\n\\n \\n\\n \"No, no; hasn\u0027t he been home?\" \\n\\n \\n\\n \"He is at the shoe-shop, of course.\" \\n\\n \\n\\n \"No, he is not. He was discharged by Squire Collins this morning.\" \\n\\n \\n\\n \"Discharged? What for?\" \\n\\n \\n\\n \"Don\u0027t you know? Some quarrel between Mark and James Collins, I believe.\" \\n\\n \\n\\n \"I am glad he is not hurt.\" \\n\\n \\n\\n \"But hasn\u0027t he been home? I wonder at that.\" \\n\\n \\n\\n \"I have seen nothing of him since he started for the shop.\" \\n\\n \\n\\n \"That\u0027s strange.\" \\n\\n \\n\\n \"Poor boy! I suppose he doesn\u0027t like to tell me he is discharged,\" sighed the widow. \"It will be a serious thing for us, for I don\u0027t know where else he will find work.\" \\n\\n \\n\\n \"O, something will turn up,\" said Mrs. Parker, who could bear the misfortunes of her neighbors very cheerfully. \"But I must run home, or my dinner will be late.\" \\n\\n \\n\\n The more Mrs. Manning thought of Mark\u0027s loss of employment, the more troubled she felt. Three dollars and a half a week was not a large sum, but it was more than half their income, and how they were to make it up she could not conjecture. Perhaps she could induce Mark to apologize to James, in which case the squire might be induced to take him back. While her mind was busy with such thoughts, Mark entered the house whistling. His mother was considerably surprised at this evidence of light-heartedness under the circumstances. \\n\\n \\n\\n He entered the room where his mother was at work. \\n\\n \\n\\n \"Well, mother, is dinner almost ready?\" he asked. \\n\\n \\n\\n \"It will be ready soon. But oh, Mark, what is this I hear about your being discharged from the shoe-shop?\" \\n\\n \\n\\n \"It is all true, mother, but you needn\u0027t worry over it. We shall get along just as well.\" \\n\\n \\n\\n \"I don\u0027t see how. There is no other shop in the village.\" \\n\\n \\n\\n \"I have another job already, and a better one.\" \\n\\n \\n\\n Mrs. Manning opened her eyes in astonishment. \\n\\n \\n\\n \"What can it be?\" she asked. \\n\\n \\n\\n \"Old Anthony has hired me to do his errands.\" \\n\\n \\n\\n \"I am afraid, Mark, that will amount to very little.\" \\n\\n \\n\\n \"I am to receive five dollars a week.\" \\n\\n \\n\\n \"Do you really mean this? I thought he was very poor.\" \\n\\n \\n\\n \"Quite the contrary, mother, but we mustn\u0027t say that to others. Let people think he is poor. Here are five dollars which he has paid me for the last week, though I have worked in the shop, and done very little for it. Take it, mother, and use as you need it.\" \\n\\n \\n\\n \"Will this last, Mark?\" asked his mother, almost incredulously. \\n\\n \\n\\n \"I think it will. The hermit seems to have taken a special fancy to me, and he says he can well afford to pay me this sum. I say, mother, suppose I invite him to take dinner with us next Sunday?\" \\n\\n \\n\\n \"With all my heart, Mark. He seems to me like a good Providence who has come to our help at this juncture.\" \\n\\n \\n\\n \"Do you need anything at the store this afternoon?\" \\n\\n \\n\\n \"The butter and sugar are out, Mark.\" \\n\\n \\n\\n \"Give me the five-dollar bill, then, mother, and I will buy some.\" \\n\\n \\n\\n Shortly after dinner Mark started for the store. On the way he met several persons who condoled with him on his loss of place. They were surprised to find that Mark looked cheerful, and even gay. \\n\\n \\n\\n \"Yes,\" he said, \"I\u0027ve retired from the shoe business on a fortune.\" \\n\\n \\n\\n \"You don\u0027t seem to mind it!\" \\n\\n \\n\\n \"No, I can stand it well enough, but I pity Squire Collins for losing my valuable services.\" \\n\\n \\n\\n \"I thought you\u0027d be down in the mouth. You don\u0027t seem to care.\" \\n\\n \\n\\n \"Why should I? Care killed a cat.\" \\n\\n \\n\\n Arrived at the store, Mark stepped up to the counter and called for two pounds of sugar and two pounds of butter. \\n\\n \\n\\n Mr. Palmer, the grocer, had heard of Mark\u0027s dismissal, and being a cautious man, inquired: \\n\\n \\n\\n \"Are you going to pay cash?\" \\n\\n \\n\\n \"Certainly.\" \\n\\n \\n\\n \"I heard you had lost your place at the shop.\" \\n\\n \\n\\n \"Yes,\" answered Mark, smiling, \"I discharged Squire Collins.\" \\n\\n \\n\\n \"It\u0027ll be rather hard on you, won\u0027t it?\" \\n\\n \\n\\n \"I guess I can pay my bills, Mr. Palmer. At any rate I can pay for what I am buying now.\" \\n\\n \\n\\n The grocer put up the packages, and was surprised when Mark handed him a five-dollar bill in payment. \\n\\n \\n\\n \"Seems to me you\u0027re flush,\" he said. \\n\\n \\n\\n \"So it seems,\" answered Mark, but he volunteered no information. \\n\\n \\n\\n \"I can\u0027t make out that boy,\" said the grocer to his assistant, after Mark had gone out. \"He looks as if he had got a good place instead of losing it. I wonder if the widder\u0027s got any money?\" \\n\\n \\n\\n \"Not much, except what Mark brings in.\" \\n\\n \\n\\n \"They\u0027ll be asking credit soon, Enoch. Don\u0027t trust them till you\u0027ve referred to me.\" \\n\\n \\n\\n \"No, sir, I won\u0027t.\" \\n\\n \\n\\n On his way home Mark met the cause of his discharge, James Collins, accompanied as usual by his friend, Tom Wyman. \\n\\n \\n\\n \"Hallo!\" said James, eying Mark, triumphantly. \\n\\n \\n\\n \"Hallo!\" \\n\\n \\n\\n \"Why ain\u0027t you at the shop?\" \\n\\n \\n\\n \"Probably you know.\" \\n\\n \\n\\n \"Yes, I do know. You\u0027ve been discharged.\" \\n\\n \\n\\n \"I suppose I am indebted to your kindness for that.\" \\n\\n \\n\\n \"Yes, you are. Perhaps now you will be sorry for your impertinence to me in the pasture.\" \\n\\n \\n\\n \"When I am I\u0027ll tell you so. At present I am glad, and would do the same thing again.\" \\n\\n \\n\\n \"How do you expect to live?\" \\n\\n \\n\\n \"On victuals and drink, thank you.\" \\n\\n \\n\\n \"If you have money to buy them,\" supplemented James, with a malicious smile. \\n\\n \\n\\n \"I\u0027ve got a little money left,\" and Mark drew out not only his own but the hermit\u0027s money. \"You see I don\u0027t depend on work in the shoe-shop.\" \\n\\n \\n\\n James was both amazed and annoyed. \\n\\n \\n\\n \"Where did you get that money?\" he asked abruptly. \\n\\n \\n\\n \"I am afraid I must leave your curiosity ungratified. I\u0027ll tell you, as it may interest you, that I should have resigned my place in the shop at the end of the week, even if you hadn\u0027t kindly got me discharged.\" \\n\\n \\n\\n So saying, Mark walked away. \\n\\n \\n\\n \"Where do you think he got that money, Tom?\" said James. \\n\\n \\n\\n \"Blamed if I know!\" \\n\\n \\n\\n The next morning Mark walked to the depot to meet the morning train. \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1828/53034.html","bookId":1019,"book":{"id":1019,"title":"Mark Manning\u0027s Mission","description":"简介： Two boys, with guns on their shoulders, were crossing a meadow towards the Pecasset woods. These were situated about a mile from the village, and were quite extensive. The two boys were James Collins and Tom Wyman, the first, the son of a large shoe...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1828","creation":"Aug 1, 2019 12:24:09 AM","modification":"Aug 1, 2019 12:24:09 AM"}}
