{"id":23057,"no":34,"title":"CHAPTER XXXIV. MRS. MANNING\u0027S HOUSE IS SOLD.","content":"It is now time to return to Pocasset and inquire how our old acquaintances are prospering. \\n\\n \\n\\n It was still a matter of wonder what had become of Mark. Mrs. Manning gave no information, and no letters were received at the post-office which would throw light on the mystery. Mark, by arrangement, directed all his letters to Mr. Hardy, who inclosed and forwarded them to the Pocasset office. Tom Wyman, the postmaster\u0027s son, was puzzled to account for the letters received from New York by Mrs. Manning. \\n\\n \\n\\n \"They must be from Mark,\" said James Collins. \\n\\n \\n\\n \"They don\u0027t seem to be in Mark\u0027s hand-writing.\" \\n\\n \\n\\n \"He probably gets some one to direct them for him, so as to throw dust in our eyes.\" \\n\\n \\n\\n This was the conclusion upon which the two boys finally settled. \\n\\n \\n\\n Another cause of wonder was the hermit\u0027s visits to the city. Since he had heard that his grandson was living, he went up often to consult with Mr. Hardy. Family affection in him had not died out. It had only been dormant, and now it was thoroughly reawakened. \\n\\n \\n\\n \"I long to see my daughter\u0027s boy,\" he said. \"It will give me something to live for. I tremble lest the cup of happiness should be dashed from my lips, just as my hopes are awakened.\" \\n\\n \\n\\n \"Don\u0027t be anxious, old friend. Your affairs are in good hands. Mark is only a boy, but he has far more discretion and fidelity than most men. Do you know what I have in view?\" \\n\\n \\n\\n \"Well?\" \\n\\n \\n\\n \"If he succeeds in this enterprise I propose, with his mother\u0027s permission, to take him into my office, and train him up in my business. I have hitherto employed boys simply as boys, but Mark is one whom I can train up for a responsible position. I am getting older every year, and when I am really old, I shall be glad to have a young man at my side upon whom I can shift the burden of my business. Do you think his mother would object?\" \\n\\n \\n\\n \"Mrs. Manning is a sensible woman. I think she will be glad to have her son so well provided for. If it is necessary I will myself advise her to commit him to your charge.\" \\n\\n \\n\\n At length a telegram came from Mark, and by good luck when Mr. Taylor was in the office of his agent. It ran thus: \\n\\n \\n\\n \"John Hardy, New York. \\n\\n \\n\\n \"I am on my way to New York with little Jack. Particulars when we meet. \\n\\n \"Mark Manning.\" \\n\\n \\n\\n \"There, old friend, what do you say to that?\" asked John Hardy, triumphantly. \"Didn\u0027t I tell you the boy would succeed? Was my confidence misplaced?\" \\n\\n \\n\\n \"He had my confidence from the first,\" said Anthony, his face luminous with happiness, \"but I knew he had an adroit enemy in my nephew Lyman. I didn\u0027t dare to expect that a country boy would be equal to the emergency.\" \\n\\n \\n\\n \"Now, you can go home with a light heart. In a day or two, your grandson will be with you. What are your plans respecting him? Shall you take him to Pocasset?\" \\n\\n \\n\\n \"I don\u0027t think I can do better. He will need a woman\u0027s care, and I know of no one who will prove kinder than Mrs. Manning.\" \\n\\n \\n\\n \"She has this in her favor at any rate. She has brought up her own boy well. But will the house be large or comfortable enough?\" \\n\\n \\n\\n \"I am not very particular for myself. You will judge that when you remember the cabin in the woods, where I spent several years. The house is small, however, but there is another vacant, much larger and handsomer, which I can buy or rent, already furnished. The owner and occupant died recently, and his heirs, living in a distant state, want to sell it. It has a handsome lawn and a garden attached. It stands near the house of Mr. Collins.\" \\n\\n \\n\\n \"Well, you are able to gratify your own taste in the matter. I will send Mark down as soon as he arrives.\" \\n\\n \\n\\n When Anthony reached home, he found Mrs. Manning anxious and perturbed. The cause will require some explanation. \\n\\n \\n\\n The small cottage in which Mark and his mother lived did not belong to them. They rented it from Deacon Brooks, an old farmer living just out of the village, at five-dollars monthly rental. For a special reason Squire Collins desired to possess it. He owned the lot adjoining, and it occurred to him that the two combined would make a desirable property. The house, which was a cottage, could be raised one story, and made much more commodious. In that case, it would easily command more than twice the rent. The foreman of the shoe-shop stood prepared to rent it of him, as soon as the alteration was made. \\n\\n \\n\\n He therefore approached Deacon Brooks, with a proposition to purchase it. \\n\\n \\n\\n \"I don\u0027t know,\" said the deacon. \"I never thought of sellin\u0027, but I can\u0027t say I\u0027m opposed to it. I\u0027m getting good rent from the widder Manning.\" \\n\\n \\n\\n \"There\u0027s no knowing, deacon, how long she\u0027ll be able to pay her rent,\" said the squire, nodding with a meaning look. \\n\\n \\n\\n \"Sho! you don\u0027t say! She ain\u0027t lost any money, has she?\" \\n\\n \\n\\n \"She had none to lose. Her boy Mark has about supported her with his small earnings in the shop. But he isn\u0027t employed there any longer.\" \\n\\n \\n\\n \"I heard something of that. Did you discharge him?\" \\n\\n \\n\\n \"Yes; he got too uppish—wasn\u0027t willing to obey orders. I was sorry to discharge him on his mother\u0027s account, but it was his own fault.\" \\n\\n \\n\\n \"Seems to me I haven\u0027t seen him round the village lately?\" \\n\\n \\n\\n \"No; he has gone to the city on some wild-goose expedition. My boy James thinks he is blacking boots or selling papers. As to that I can\u0027t say, but it isn\u0027t likely he is able to help his mother much.\" \\n\\n \\n\\n \"I hear Mrs. Manning has a boarder?\" \\n\\n \\n\\n \"Yes; it\u0027s the old hermit that lived in the woods. I believe he has a small pension from some relations, but it doesn\u0027t amount to much. Probably he doesn\u0027t pay more than two or three dollars a week board. That won\u0027t go far, eh, deacon?\" \\n\\n \\n\\n \"You\u0027re right there, squire. It costs a sight to live. How much do you think my grocery bill came to last month?\" \\n\\n \\n\\n \"I don\u0027t know,\" answered the squire, with a curious smile. The deacon had the reputation of being very close-fisted, and it was rather amusing to hear him speak of the cost of living. \\n\\n \\n\\n \"Fifteen dollars and sixty-seven cents,\" said the deacon, with the air of one who hardly expected to be believed. \\n\\n \\n\\n \"I believe you have six in family,\" said Squire Collins, with a smile. \\n\\n \\n\\n \"Yes, six, including the hired man.\" \\n\\n \\n\\n \"I pity your family,\" thought the squire, who, at all events, kept a liberal table. \\n\\n \\n\\n \"Yes, it costs a great deal to live,\" he added, \"and, of course, the Widow Manning, though her family is small, can\u0027t live on nothing. When she finds she can\u0027t pay all her bills, she will probably begin by being remiss in her rent.\" \\n\\n \\n\\n \"That\u0027s so, squire! She\u0027s allus paid so far right up to the handle, though.\" \\n\\n \\n\\n \"When she had Mark\u0027s help; but as I told you he is not now in a condition to help his mother. Well, what do you say? Shall I have the house?\" \\n\\n \\n\\n Then commenced the bargaining. Both parties were sharp, but at length a conclusion was reached. Squire Collins agreed to pay eight hundred and fifty dollars for the cottage, five hundred to remain on bond and mortgage, at six per cent. In a day or two the necessary papers were made out, and then Squire Collins took a walk over to the cottage, to inform Mrs. Manning that the house had passed into his possession, and it would be necessary for her to find another home. \\n\\n \\n\\n It might have been supposed he would feel some compunction, but he did not have much feeling or sympathy for the widow. The ill-feeling between Mark and his son had its effect upon him also. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1828/53056.html","bookId":1019,"book":{"id":1019,"title":"Mark Manning\u0027s Mission","description":"简介： Two boys, with guns on their shoulders, were crossing a meadow towards the Pecasset woods. These were situated about a mile from the village, and were quite extensive. The two boys were James Collins and Tom Wyman, the first, the son of a large shoe...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1828","creation":"Aug 1, 2019 12:24:09 AM","modification":"Aug 1, 2019 12:24:09 AM"}}
