{"id":23032,"no":9,"title":"CHAPTER IX. THE DEACON\u0027S MISSION.","content":"Ordinarily James would not have considered Deacon Miller worth any polite attention, but the knowledge of what had happened in the pasture had its effect upon him. He thought it necessary by a little attention to disarm the deacon\u0027s suspicions if he had any. \"Good evening, Deacon Miller,\" he said politely. \"Did you wish to see father?\" \"Wal,\" said the deacon deliberately. \"I have a little business with him. Is he at home?\" \"I am pretty sure he is,\" answered James. \"Come in with me, and I\u0027ll see.\" The deacon smiled—an inscrutable smile—and followed James, who opened the front door and led him into the parlor. \"You\u0027re very obligin\u0027,\" he said. \"I had no idea you was so polite.\" \"It is the duty of a gentleman to be polite!\" said James loftily. \"So \u0027tis, so \u0027tis!\" returned the old man chuckling in an unaccountable manner. \"I\u0027m glad you think so. It\u0027s a great thing to be a boy, I had lots of fun when I was a boy. So do you, hey?\" \"Oh yes,\" answered James indifferently. \"But not as much as I could have in the city.\" \"But you couldn\u0027t go huntin\u0027 and fishin\u0027 in the city,\" said the deacon slyly. James\u0027 heart gave a bound. What did the disagreeable old man mean? was it possible that he suspected? \"I don\u0027t care much for either,\" he said. \"But I\u0027ll go and call father.\" Presently the squire appeared and invited Deacon Miller into the back room, which was used as the family dining and sitting-room. \"Glad to see, you, deacon,\" said Mr. Collins, who, having political aspirations, thought it worth while to be polite to his neighbors. \"I ain\u0027t so sure of that, squire, when you know what I come about,\" returned the deacon with a crafty smile. \"No bad news, I hope, deacon.\" \"Wal, it ain\u0027t good news. You know my cow, old Whitey?\" \"Well?\" interrogated the squire, looking puzzled. He had heard nothing as yet of the accident in the pasture. \"She was shot in the face this afternoon—her eyes totally destroyed. I shall have to kill her.\" \"That\u0027s a pity! I sympathize with you, deacon. It must be a great disappointment to you. She was a good milker, wasn\u0027t she?\" \"Fust-rate! I never had a cow that could beat her. She was worth fifty dollars easy.\" \"Very likely,\" said the squire, innocently, quite unaware of the trap which the wily deacon was preparing for him. It will be observed that the deacon, finding he had a case against a rich man, had concluded to raise the value of the cow by five dollars. \"Fifty dollars is a considerable loss.\" \"So \u0027tis, but I haven\u0027t got to lose it. The one that shot old Whitey is responsible.\" \"Who did shoot her?\" asked Squire Collins. \"Your boy, James,\" answered the deacon, slowly. Squire Collins was very disagreeably surprised. He was not a man who liked to part with money, and he saw how he had been trapped. \"Did you see James shoot the cow?\" he demanded sharply. \"N—o; I can\u0027t say I did,\" replied the deacon, cautiously. \"I don\u0027t believe he did it then. Did he admit it to you?\" \"N—o. I didn\u0027t ask him about it.\" \"Then, Deacon Miller, permit me to say that you have no case against him, and I am not responsible for your unfortunate loss. \"Somebody else saw it!\" remarked the deacon triumphantly. \"Who was it?\" \"John Downie.\" \"John Downie! Pooh, he is a mere boy,\" said the squire, contemptuously. \"He\u0027s got as many eyes as you or I, squire,\" said the deacon, shrewdly. This was unquestionably true, and the squire felt that he had made a foolish objection. \"John Downie may not tell the truth,\" he said, angrily. \"I\u0027m willin\u0027 it should come before the court,\" said the deacon. \"Wouldn\u0027t it be jest as well to ask your boy about it; he\u0027s out in the yard.\" James was still in the yard. He had half a mind to go away, but was anxious about the deacon\u0027s errand. When he heard his father\u0027s voice calling him he turned pale. \"Wait for me, Tom,\" he said. \"If you\u0027re asked, don\u0027t say I did it.\" Tom looked disturbed and uneasy, and did not reply. James entered his father\u0027s presence with a perturbed spirit. He stole a glance at the deacon, who sat with his wizened face calm and imperturbable. \"Did you want me, father?\" asked James. \"James,\" said his father, abruptly, \"Deacon Miller tells me that some one has shot his cow, old Whitey, this afternoon, and injured her so seriously that she will have to be killed.\" \"I am sorry to hear it,\" said James, nervously. \"Do you know who did it?\" \"How should I?\" asked James, after a pause. \"Wer\u0027n\u0027t you out in the pastur\u0027 this afternoon?\" asked the deacon, pointedly. \"Yes,\" answered James, \"Tom Wyman and I crossed the pasture.\" \"With guns on your shoulders?\" \"Ye—es,\" admitted James. \"Did you see anything of old Whitey?\" continued the deacon, persevering in his pointed interrogations. \"There were some cows there I remember; I suppose old Whitey was among them.\" \"Did your gun go off while you were in the pasture?\" \"Ye—es, I believe it did. It went off accidentally.\" \"And hit old Whitey?\" \"I don\u0027t know about that. It may not have hit anything.\" \"Then you don\u0027t know that you hit my cow?\" \"I wasn\u0027t the only boy in the pasture this afternoon,\" said James, evasively. \"I know all about that. Tom Wyman was with you.\" \"Yes, and so was Mark Manning. He was out gunning most all the afternoon. Have you asked him whether he hit the cow?\" \"Yes,\" answered the deacon; \"he says he didn\u0027t.\" \"Of course he would say so,\" sneered James, more confidently. \"He\u0027s just as likely to have done it as I.\" \"That\u0027s what I thought myself,\" returned the deacon; \"though Mark\u0027s a middlin\u0027 keerful boy. But I changed my mind.\" \"Because he denied it?\" asked James, with a return of the sneer. \"Not exactly. There was a boy saw it done, and he told me who did it.\" \"What boy saw it done?\" asked James, all his apprehensions reviving. \"John Downie.\" This was startling news to James. \"And who does he say did it,\" he forced himself to ask. \"You!\" answered Deacon Miller, laconically. \"I don\u0027t believe I did it,\" said James, wavering. \"He says after you shot the cow, you and Tom Wyman ran away as fast as your legs could carry you,\" added the deacon, chuckling. James turned as red as scarlet, but said nothing. It was clear enough that he was guilty, and knew it. \"Deacon Miller,\" said Squire Collins, \"I will look into this matter, and if I find James shot your cow, we will make some arrangement about payment. Understand clearly, however, that I won\u0027t pay any fancy price, such as fifty dollars.\" \"I won\u0027t argy the matter now, squire,\" said the deacon. \"Good-evenin\u0027.\" \"James,\" said his father, \"I won\u0027t scold you for a piece of carelessness, but whatever compensation is paid to the deacon must come from your account in the savings\u0027 bank.\" This was a sad blow to James, he had a hundred and fifty dollars in the bank, and this would make a heavy draft upon it. He went out into the yard without a word. \"It\u0027s all up, Tom,\" he said. \"John Downie has been telling tales about me. The first time I see him I\u0027ll give him a licking.\" \"And serve him right, too, little tell-tale!\" said Tom. Johnny did not expect what was in store for him, but he was soon to be enlightened.","sourceLink":"http://novel.tingroom.com/jingdian/1828/53031.html","bookId":1019,"book":{"id":1019,"title":"Mark Manning\u0027s Mission","description":"简介： Two boys, with guns on their shoulders, were crossing a meadow towards the Pecasset woods. These were situated about a mile from the village, and were quite extensive. The two boys were James Collins and Tom Wyman, the first, the son of a large shoe...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1828","creation":"Aug 1, 2019 12:24:09 AM","modification":"Aug 1, 2019 12:24:09 AM"}}
