{"id":110892,"no":18,"title":"Page 18","content":"“I fear we may be too late,” he said.\\n\\n “Who…,” moaned the ancient mariner, as if to disprove him. “Who has come?”\\n\\n “Warthrop,” the monstrumologist answered. “My name is Warthrop.”\\n\\n “Warthrop!” cried the captain. The eyes, as if loosed by the mention of the name, became as unsettled as his tongue, sliding back and forth in their sockets but refusing to focus upon the doctor’s face. They tirelessly traversed the ceiling, where Warthrop’s distorted shadow danced, thrown there by the lamp on the floor and looming over Varner like a demon spirit, dark, grotesque, huge.\\n\\n “You know the name,” said the doctor.\\n\\n The enormous head gave the barest of nods.\\n\\n “God pity me, I do. I know the name Warthrop,” issued the guttural reply, choked in spittle. “’Twas all Warthrop’s doing, the devil curse him and all his kin!”\\n\\n “A curse is one explanation,” said the doctor dryly. “Though I lean more toward Darwin ’s. The evidence is on my side, but time may yet prove me wrong and you right, Hezekiah Varner. Alistair Warthrop was my father.”\\n\\n There was no response but for the odd, strangled, wheezing moans.\\n\\n “My father,” continued the monstrumologist, “who commissioned you sometime in late ’63 or early ’64, I would guess, to sail to West Africa, perhaps Senegambia or lower Guinea, and return with a special cargo of particular interest to him. Yes? Did he not?”\\n\\n “No…,” murmured the old man.\\n\\n “No?” echoed the doctor, frowning.\\n\\n “Not Senegambia or Guinea. Benin,” groaned he. “The kingdom of Benin! Home to that godless mockery of royalty, the accursed ruler of that accursed land, the Oba, and I vow there is not to be found a heathen more foul or a libertine more loathsome in the four corners of the world!”\\n\\n “The Oba of Benin had captured living specimens of Anthropophagi?” asked the doctor. He seemed startled by the notion.\\n\\n “He houses a whole troop of the horrible beasts in a chamber beneath his palace.”\\n\\n “But Anthropophagi cannot survive in captivity. They starve to death.”\\n\\n “Not these, Warthrop,” gasped the old smuggler. “These monsters were quite fat and happy, thank you! I saw it with my own two eyes, and if I were a braver man, I would pluck them out for the offense!”\\n\\n “They were fed?” The doctor’s tone was incredulous. “How?”\\n\\n “Children, mostly. Twelve- or thirteen-year-old girls. Girls in the prime of their budding womanhood. Sometimes infants, though, squealing babes hurled naked into the hole. For in the center of the temple is a pit connected by a tunnel to the holding chamber. Into the pit the priests throw her; I have seen this, Warthrop; I have seen it! Cast down twenty feet to the bottom, whereupon she hurls herself against the smooth sides of the sacrificial abyss, scratching and clawing for a handhold, but of course there is none. There is no escape! The head priest gives the signal; the great wooden door rolls up; and they come. You smell it first, a rotten stench like death’s decay, then the loud huffing and sharp clicks of their fangs snapping, as the doomed innocent erupts into frenzied screams, crying to her insensible judges above to have mercy. Mercy, Warthrop! They stare down at her with faces set in stone, and, as the beasts burst into the pit, her terror robs her of her last shred of dignity: Her bladder empties; her bowels let go. She collapses into the dirt, covered in her own filth, as they descend upon her in a mad rush, the bigger brutes leaping thirty feet from the tunnel’s mouth to where she lays, the sacrificial lamb beneath those pagan lords whose mad whimsy condemned her to a fate unfit for even the most egregious malefactor. But their bloodthirsty gods demand; and so they supply.\\n\\n “The head is the most coveted prize. The first to reach her seizes it and wrenches it from her neck, and her still-beating heart flushes her blood through that makeshift orifice; a steaming geyser shoots into the air and paints crimson their teeming alabaster bodies. They snarl and snap for a piece of the meat, for meat she be now; human she is no more. Shredded bits of her are flung far over the rim of the pit, spattering the spectators with the bloody remnants of her maidenly form. I lost sight of her in the melee, but ’twas a blindness blessed after the curse of sight. No vision of hell could surpass it, Warthrop. No image or word born in the mind of man could equal what I saw that day!”\\n\\n (Though I have faithfully recorded here the old man’s words, true to my memory of them, they did not flow with any grace, as a casual reading might lead one to believe. Punctuated with the same moans and grunts and unintelligible asides that peppered the entire interview, the foregoing soliloquy lasted nearly half an hour, with some prodding from the doctor, after many a breathy pause and phlegmy snuffle. At times the words were voiced so softly that the doctor was forced to bend low with his ear nearly touching the grayish lips. I have decided, for mercy’s sake, to spare the reader these somewhat tiresome and frustrating divagations.)\\n\\n “Or so I thought,” moaned Varner after a moment of ill-settled silence that only the buzzing of the flies disturbed.\\n\\n “So you thought? What do you mean, so you thought?”\\n\\n “The king was loath to part with them, for what price do you put upon the heads of your gods?”\\n\\n “But sell them to you the Oba did,” observed the doctor. “He must have.”\\n\\n “Yes, yes, of course. After a fortnight of hard bargaining, he did, but not the number Warthrop desired. He wanted four, a mature pair and two of their infernal offspring. But we sailed with only three in our hold: a two-year-old cub, a young male, and the last…” He closed his eyes and took a deep, quivering breath. “The she-devil, the largest of her ferocious troop-larger than the biggest male, and he was near eight feet tall-the one the Benin feared more than any other. We took that one. We took her.” Appalled by the thought after more than twenty years, mortified still, he shuddered beneath the snuggly tucked sheets.\\n\\n “But why did he want four? Did he say?”\\n\\n “Dear God, man, he did not say, and I did not ask! I did not even know when I sailed for that damnable country what the bloody things were. Warthrop offered a king’s ransom for the work, and I cared not whether he wanted four or fourscore! The war had brought hard times to the Feronia. I accepted his offer without question, without a second thought!”\\n\\n Warthrop turned away from the bed and in two steps was at the window, hands clasped behind his back, studying, in all appearance and of all things, the windowsill. He carefully picked up one of the dead flies, pinching its delicate wings between his thumb and forefinger, and then held it up as if to examine it for the cause of its demise.\\n\\n The prostrate leviathan on the bed did not watch him. His gaze remained on the ceiling and whatever comfort its yellowed, irregular surface brought him, his enormous body as still as a corpse’s beneath the spotless sheets. How long had he lain thus paralyzed, I wondered, unable to move neither head nor limb, forced to stare hour after hour, day after day, upon that blank canvas, and what terrible scenes of hell unleashed, unbounded by the dictates of our Victorian sensibilities, had his imagination painted there in the vibrant colors supplied by his merciless memory? Poor paralyzed creature, no wonder Warthrop’s father abandoned thee! What succor could he offer to one whose very mind had betrayed the body that sustained it? Even if it so willed, could any intellect be stronger than the horror that freezes the marrow and locks the limbs? Stronger than the thickest dungeon chain is the metaphorical ropes that bound thee, Hezekiah Varner!\\n\\n “Or so you thought,” murmured the doctor, turning the fly in his hand. “Nothing could equal the vision of hell you saw that day… or so you thought.”\\n\\n Varner laughed, a sound as thin and crackling as autumn leaves beneath a heavy man’s tread.\\n\\n “Something went terribly wrong on your return passage to America, didn’t it?” pressed the monstrumologist.\\n\\n “He tried to warn me,” was the wheezing reply.\\n\\n “Who? Who tried to warn you?”\\n\\n “The Oba! The old devil, on the morning we set sail, with a twinkle in his eye and a bright smile lighting his raven cheeks, asked what provisions we had made for them. He told me they can get quite ‘tetchy’ after several days without their ‘victuals,’ and offered two of his slaves to tide them over on the voyage. I rebuked the repulsive savage, for king though he called himself, that is what he was, a godless heathen. I am a Christian, I told him. I fear God and his judgment!”\\n\\n “But you came to regret your rebuke,” observed Warthrop.\\n\\n “I had had assurances,” Varner muttered. “I had had strict instructions from the monstrumologist. We reinforced the hold, welded iron bars across the portholes, fastened double locks upon the doors. Two hundred pounds of salt pork we had on board, and in Sapele we took on the livestock in kind and quantity precisely as Warthrop prescribed: twelve goats, five young calves, and seven chimps. ‘Try the chimps if all else fails,’ he told me. ‘They are the closest relative to their preferred prey.’ The closest relative! Heaven help us!”\\n\\n Warthrop let fall the dead fly from his fingertips. It fluttered to the floor, and he pressed the tip of his boot down upon its desiccated carcass.\\n\\n “Flies,” he murmured pensively. “What of the flies?” He watched them for a moment bumping and fussing against the smeared pane before he turned to face Varner. “They refused to feed,” he said. It was not a question.\\n\\n “Aye, refuse they did, as you know, as you know all the rest, and so I will speak no more of it. I know not why you have come here in the dead of night, asking questions the answers to which you already know. I know not why you’ve come except to torment a sick and dying old man. I know not what pleasure my pain brings you, Warthrop, except it be God’s truth you are your father’s son! You know already what special order your father had filled and what fate befell the crew of the Feronia. What sadistic cause brings you here to my deathbed? To remind me of those awful days of death and the dread thereof, to give the knife your father sank a final twist before I am taken down by the dark angel’s last embrace? Have mercy on me! Have mercy on me, Warthrop. Have mercy.”\\n\\n The doctor ignored this diatribe, this anguished plea punctuated by moans and whines. He ignored it and said, “They would kill immediately what you gave them-they are fiercely territorial-but they would not eat it. In a matter of days the ship’s hold would reek worse than a slaughterhouse.”\\n\\n “No,” whispered Varner, closing his eyes. “No more. I beg you.”\\n\\n “So they managed to escape somehow. There is nothing in the literature to suggest they can swim, so they broke into the ship, not out of it. And at least two survived until the grounding of the vessel at Swampscott. The adults, I would guess.”\\n\\n Varner sighed, a gravelly exhalation, like a shoe scraping over pebbles. The eyes came open, the mouth yawned, the tongue protruded, the voice escaped. “They ate the little one. It was her own cub, or so the Oba told me. The she-beast ripped him to shreds. With my own eyes-ah, these accursed eyes!-I saw her stuff his beating heart into her damnable mouth. The slender pickings that remained she left for her partner.” \\n\\n","sourceLink":"https://allnovel.net/the-monstrumologist-the-monstrumologist-1/page-18.html","bookId":2546,"book":{"id":2546,"title":"The Monstrumologist (The Monstrumologist #1)","description":"Storyline: The Monstrumologist (The Monstrumologist #1) \\n These are the secrets I have kept. This is the trust I never betrayed. But he is dead now and has been for more than forty years, the one who gave me his trust, the one for whom I kept these secrets. The one who saved me . . . and the one who cursed me. \\n So starts the diary of Will Henry, orphaned assistant to Dr. Pellinore Warthorpe, a man with a most unusual specialty: monstrumology, the study of monsters. In his time with the doctor, Will has met many a mysterious late-night visitor, and seen things he never imagined were real. But when a grave robber comes calling in the middle of the night with a gruesome find, he brings with him their most deadly case yet. \\n A gothic tour de force that explores the darkest heart of man and monster and asks the question: When does man become the very thing he hunts?\\n","cover":"https://allnovel.net/images/the-monstrumologist-the-monstrumologist-1.jpg","author":"Rick Yancey","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-monstrumologist-the-monstrumologist-1.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 6, 2019 12:09:38 AM"}}
