{"id":96390,"no":21,"title":"Page 21","content":"I spent many hours listening to a smal , slightly dotty ancil a devoted to cataloging and researching the historical consequences of my family’s mil ions of contracts and constructions. A diminutive, fading sapphire figure whose edges barely cohered, her resources had not been updated or renewed for the last three thousand years, yet she remained on duty, ever-hopeful of serving, faithful beyond reason but increasingly eccentric. She toured me through the records of more than a thousand worlds transformed by my father and his Builder cohorts, and then unveiled with obvious pride even greater contracts: dozens of stars harnessed by containment and col ection fields, including, it seemed, the ingenious quarantine around the San’Shyuum system. In these records, to my great interest, were hints of large-scale weapons. Under the old name of Faber, the Master Builder had partnered with my father in creating and offering up these designs to the Council. Expunged from the records were any indications of Council approval or denial of these weapons. None took on the final, ring-shaped aspect of the great Halos, however. A thousand years of politics and progress. My father had never bragged about his works and influence, of course, and as a Manipular, I had never shown much interest. But I understood now how he had been able to secure my return. Yet this was not explicitly what I was seeking. My restlessness had its own motives. What I was becoming—who I was becoming—had a separate set of curiosities, and I indulged them. The problem with being potential is that one contains multitudes of outcomes, candidates vying to become final personalities, and as the hours and days passed, the strongest ruled for a time until toppled by others even stronger.… Matters would be coming to a head soon enough. One of me would suffice and rule, supplemented by the unfolding wisdom of the Didact. During one long repose, two hundred domestic days after my return, I came upon my father and a visitor under a seldom-used nave-and-cupola reception chamber, halfway across the main length of our household, about ten kilometers from my own tower chambers. I happened to be crossing a skybridge connecting two higher floors in that wing, beneath the cupola, when I heard voices echoing from a hundred meters below. One voice was that of my father, clear and precise—but not at al commanding; rather, unexpectedly subservient. I cautiously leaned over the railing. My father and another Builder, both free of armor, were engaged in a heated conversation they obviously did not wish audited or recorded. The local support services had been shut down, leaving floors and wal s frosted with cold. The other Builder was much younger than my father, a first-form much as I would have been had my mutation proceeded normal y. Despite his youth, he seemed to speak with considerable authority. Curious indeed, that one so young could command an audience with my father. I managed to catch little more than half of what was being said. “More incidents in the outer reaches … twelve systems lost in the last three hundred years…” And: “… traces remain of the test bed near Charum Hakkor, even after forty- three years … decimation of San’Shyuum … uprising insufficient cause…” “… trial pending … charges of gross violation of the principles of the Mantle…” Was he referring to the Master Builder? “… A metarch-level ancil a’s assigned to the test-bed device sent to Charum Hakkor. Both went missing after the action against the San’Shyuum…” “… vote of no confidence in the Master Builder’s leadership…” And then my father, his voice rising loud and clear in the vast space as the air currents blew my way: “How could they be used in such a way? Tuned so broadly and without safeguards … It goes against al the designers had planned and hoped for, not as final defense, but as brutal punishments.…” “It was your science that al owed them, Builder. The opposing faction in the Council never authorized such a use, but that is secondary to the blame of building and enabling.” I drew back, shivering not just with the chil . I knew what they were talking about. It seemed that the forces of the Master builder had used the Halo tested at Charum Hakkor to finish what they had begun with the San’Shyuum. I had been there. I had survived the cruelties of the Master Builder. But what of the Didact and the humans? And what of a missing metarch-level ancil a? These great artificial minds, far more powerful than any personal or shipboard ancil a, usual y administered the most complicated construction projects and were tightly constrained by law. There were fewer than five in existence, and they were never al owed to serve any entity but the Council. My other memory flared with its own anguish and anger. A metarch-level ancilla—assigned to defense—commanding a Halo! “… has been recal ed for debriefing. Al but one of the instal ations have been returned to a parking star, guarded by my own myrmidons. I am requesting their destruction. As wel , on Zero-Zero…” All but one. A moment of crisis approaches. Days at most, perhaps sooner. The Didact’s wisdom again, this time cold and concise. Here the momentary clarity of sound faded and I found myself listening to noises from elsewhere under the cupola, like distant whispers. But we were the only living Forerunners in this wing of our ancient home. What I heard had to be mere currents of air in the great volume. And soon enough, snow begin to fal and the cupola’s reactivated lighting systems, taking an interest in the potential beauty of the internal weather, began to highlight the swirling flakes. The building was rousing again from its temporary stupor, showing off, I thought perhaps for my father and his visitor, but when I leaned forward again, they had both departed. Tell him. Tell him now. He needs to know. I descended from my tower to the veranda to join my family for the first glow of morning. They wore only white shifts, al owing their armor to be polished and meticulously checked, and were taking a first meal of fruits and nuts, which with a pang I realized would meet with Riser’s ful approval. Though the Florian might also bring along little meats and disrupt my mother’s peace of mind. My father stood by the ledge, looking out over our disk-sea and the vast fields of lilies. Once, he had seemed impossibly large, forbidding and cold. Now he simply looked tired, stretched too thin even to join in the smal talk of my sister and mother, which had once offered him diversion and relief. Now. Words came to me suddenly. “I think I bear a message,” I said, before I could stop myself. “But I don’t know whom it’s for.” My father turned slowly and looked at me. “Not unexpected,” he said. “I’m listening.” “A Halo released something that was kept by both Precursors and humans at Charum Hakkor.” My father put his arm around my mother as if to protect her, the first time I had seen them engage in physical contact without armor. I found the gesture both reassuring and disturbing. “I know nothing of a Halo at Charum Hakkor,” he said. “This is not the time for lies, Father.” My sister flinched, but both my mother and father remained stil , perhaps shocked into silence by my insubordination. “Your visitor from the Council informed you. There was also a Halo in the San’Shyuum quarantine system,” I said. “I saw it.” Father released my mother, turned, and swept out his arm. “I need my ancil a.” His armor floated forward. He watched impatiently as it rotated for his approval. Final y, he shoved it aside, straightened, and with an effort, his voice choked, said, “I have done al I can to protect you. But they—this— this has taken you away from our family, our rate, our shield of society and law. And now you question my judgment. Is this truly you speaking?” “What is the Flood?” my sister asked again. Father turned on her swiftly, as if to reprimand her, but his voice choked off. “We meant to protect the entire galaxy,” he final y managed. “Builders have been designing and planning for this since before I was born. Many have failed and been demoted. After three thousand years, my team and I succeeded. Our Master Builder took that work and advanced it to field-testing … in a way that apparently has met with the disapproval of the Council.” My mother looked between us, dismay turning slowly to horrified realization that a turning point had been reached. “What did he do to the San’Shyuum?” I asked. “What’s a Halo?” my sister asked. “It’s a giant ring,” I said, “a horrible weapon that destroys al life—” “Enough about that has already been said,” my father proclaimed. His look was both sad and chal enging. “Charum Hakkor seems to be a matter of grave concern to the Council. So, messenger, what did you find there?” “A cage built by Precursors, maintained and strengthened by humans before our war with them,” I said. “But a Halo destroyed those protections—I think—and the captive it held was released.” My father lifted his hands in dismay, then turned away. His armor attempted to fol ow. “That was never a possibility in my design. They changed its tuning. It’s the negation of neural physics, far beyond…” His voice trailed off. “What is a Halo? ” This time it was my mother who almost screamed the question. She removed herself from his grasp and stood apart. “A final defense,” my father said. “I designed them. The Master Builder commissioned twelve. Our guild built them.” He turned back to me. “Is it the Didact who sends me a message?” I made contradictory motions, but said, “Yes.” “Have you information about this captive? Have you seen it?” I shook my head, then nodded—again confused by an upwel ing of memories not my own. “I’m not sure. The Didact might have communicated with the captive once. I think it was original y preserved by humans and San’Shyuum as a threat to be exercised in case of their imminent defeat—an ultimate weapon, like your Halos.” I firmly met my father’s defeated gaze, feeling a deep familial pain that would never heal. At this moment, I hated the Didact beyond al reason. “Wel , messenger, here is a message for you. A request has come from first- forms serving on the Council,” Father said. “First-forms? That young?” Mother asked, astonished. My father said it was the way now in the Council, as many elders had resigned in protest or disgrace. “They want you to return with them to the capital. I denied that request, as is my right as your father. I had hoped we might find a way to reclaim you, rework you … return you to being our son. But I see now that that is impossible. I hardly see any remaining son at al , only a mouthpiece for the Warrior-Servants.” “Who made these requests?” Mother asked. “After an exile of a thousand years, the Didact has apparently once again been placed in charge of Forerunner defenses,” my father said. “He asks for Bornstel ar. And from far outside the galaxy, a Lifeworker cal ed the Librarian has also requested our son. They seem to work in col usion. I no longer have the standing to deny them. I myself may soon be indicted by the Council.” Both my sister and my mother looked at him in dismay. “But you assist the Master Builder!” my mother said. “His time of power is finished, I’m afraid.” My father stooped to one knee, a posture I had never seen him assume before, and faced me ful y, his eyes narrow and dimming with inner pain. “I am ashamed not to have been with you to serve as your mentor.” “It was not our choice, Father,” I said. “That does not diminish my shame. There are great changes to be made, long past due. My generation and generations before me have made serious mistakes, and so it is right for our traditions to pass. But I would have liked to have my son bear our family’s deepest and most precious patterns. Perhaps when you return, with your permission, I can remedy that.” “The honor would be mine, Father.” “Stil and al , it’s likely our son wil soon understand more of what happens in the Council than do I. Our guild itself faces interdiction.” My mother stood again beside my father and clasped his arm. My sister took a position closer to me. “ ‘Al but one,’ ” I quoted. “What does that mean?” “We have only eleven Halos accounted for. One is missing.” “Along with a metarch-level ancil a?” “Apparently. Al part of the Master Builder’s indictment. You are scheduled to testify against him. The Council wil send its own vessel to pick you up.” “When do I leave?” I asked. “Very soon,” my father said. “Our time grows perilously short.” THIRTY-ONE THERE’S FOOLISHNESS, THEN there’s recklessness, and soon after fol ows madness. My father’s words seemed to set off sparks throughout my brain and body. I had worried that the Didact might have been executed. Now … he was in power! Not in exile, but restored. They would not do this except in the worst possible circumstances. A missing Halo. I bid farewel to my mother and sister, then sought out my father in his north-facing studio, where he was surrounded by project models both virtual and physical. They now brought him no comfort, that much was obvious. He accepted my embrace. We rubbed cheeks as of old. Once, my skin had been softer than his—now it was rougher. “You are the bastion of our family,” he told me. “You wil redeem al . You go with my hopes, my dreams, and my love.” “I go proud of my family—and of my father,” I said. A streak shot across our sky, and our planet’s protective shields opened a glittering gate, like a ring of precious stones, through which that streak now passed, slowed, turned upright … Hovered above the nearest disk-sea: a Council ship, ornate and supremely fast and powerful, its shape like a double upsweep of winds cast in gold and bronze. I had not seen one in five years, and had never traveled in one.","sourceLink":"https://allnovel.net/halo-cryptum-halo-7/page-21.html","bookId":1631,"book":{"id":1631,"title":"Halo: Cryptum (Halo #7)","description":"Storyline: Halo: Cryptum (Halo #7) Bornstellar Makes Eternal Lasting is a young rebellious Forerunner. He is a Manipular, untried--yet to become part of the adult Forerunner society, where vast knowledge and duty waits. He comes from a family of Builders, the Forerunners’ highest and most politically powerful rate. It is the Builders who create the grand technology that facilitates Forerunner dominance over the known universe. It is the Builders who believe they must shoulder the greatest burden of the Mantle--as shepherds and guardians of all life. Bornstellar is marked to become a great Builder just like his father. But this Manipular has other plans. He is obsessed with lost treasures of the past. His reckless passion to seek out the marvelous artifacts left behind by the Precursors--long-vanished superbeings of unknowable power and intent---forces his father’s hand. Bornstellar is sent to live among the Miners, where he must come to terms with where his duty truly lies. But powerful forces are at play. Forerunner society is at a major crux. Past threats are once again proving relentless. Dire solutions--machines and strategies never before contemplated--are being called up, and fissures in Forerunner power are leading to chaos. On a Lifeworker’s experimental planet, Bornstellar’s rebellious course crosses the paths of two humans, and the long lifeline of a great military leader, forever changing Bornstellar’s destiny …and the fate of the entire galaxy.","cover":"https://allnovel.net/images/halo-cryptum-halo-7.jpg","author":"Greg Bear","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/halo-cryptum-halo-7.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:20:38 PM"}}
