{"id":86738,"no":11,"title":"Page 11","content":"\\n\\n “Let me go get my clothes.” Tucker went over to the bed to find them on the floor and put them on, an irrational fear overcoming him that if he took his eyes off Gavin, he wouldn’t be there when he got back. He didn’t really want to fight with him, but he needed to make clear what he wanted before they went any further, though even the idea of not seeing him again made his stomach clench. Lighten up, damn it. Let him call you whatever he wants to. Why are you being such an ass?\\n\\n When he turned around, Gavin was still sitting quietly on the small sofa, sipping his coffee. He looked up as Tucker returned and swept him with another warm gaze that made Tucker’s heart beat a little faster. He eased himself into chair across from Gavin and took a sip of his own coffee before launching into his questions.\\n\\n “Why did you go to the club last night? Do you go there very often?” The questions were a bit of a test. Feeling a little like a jerk for trying to trap him, he asked anyway, leaning forward a little anxiously for his answer. The club, Nightstick, was one Tucker visited with some regularity. He’d never seen Gavin there before, and he definitely would have noticed.\\n\\n “No,” Gavin said smoothly, his eyes flickering over his face. “The night I met you was my first time, but you knew that, didn’t you, Tucker?” He set his coffee cup down on the small table in front of him. “I went there because I was tracking the killer that night, and he’d been there recently. Right in the room where I first saw you, Tucker.”\\n\\n Tucker inhaled a quick breath. Narrowing his eyes, he focused all his attention on the calm, handsome face across from him. “You knew who the killer was? Even before you say you killed him?”\\n\\n “Yes. His name was Tommy.”\\n\\n “What? So you knew what he looked like? Where he lived? You said you tracked him there. Gavin, this was—is—a murder investigation. You can’t withhold information on an active case!” Tucker’s questions were rapid fire, and his tone had slipped into interrogation.\\n\\n “Yes, I knew him since he was just a small child. But Ididn’t track him there, exactly. I just uh…sort of discovered that he was there once I got inside. I noticed his strong smell in the room.”\\n\\n “His smell? What the hell, Gavin? Stop talking nonsense! Did you know who the killer is or not?”\\n\\n Gavin slammed down his hand. “Damn it! Yes, I knew who he was, Tucker. He was the son of a friend of mine. He was a good kid, too, and didn’t deserve what happened to him. He’d been turned into a monster, a killer with supernatural strength. We tracked him here and after we discovered he had settled here to make this place a killing field. He wouldn’t have stopped—he never would have stopped. The murders would only have gotten worse, and more violent. Whatever sanity he may once have had completely burned away by whatever they shot into him. He wasn’t the boy I knew anymore, Tucker. He tried his best to kill me on that beach.” As Tucker stared at him in shock, Gavin reached for his cup again and drained his coffee, then stood up. “I’m sorry, Tucker, but I need to take you back home with me. Back to Tennessee. I can take you to your place to pack a quick bag, but I’m afraid you’ll have to leave most everything else behind.”\\n\\n Tucker caught hold of his hand and pulled him back down beside him again. He searched Gavin’s face carefully for any sign that he was teasing or joking. Finding none, fear gripped him. He must be delusional. Could this beautiful, sexy man be psychotic? He was so surprised he couldn’t speak for a moment, just hold tightly to his sleeve. When he managed to speak, his voice came out shaky and thin. “Um, okay honey. Whatever you say—just calm down, okay?”\\n\\n Gavin sighed and regarded him with sadness. “I’m not excited. I’ve frightened you, baby, and I didn’t mean to. I was trying to avoid talking with you about all this until I’d taken care of Tommy and come back for you. Then I could have taken my time and explained everything to you without this distraction. His coming after you last night pretty much decided everything, though.” He tilted his head as if thinking about it for a moment. “Though with you, Tucker, I might always have had problems making you understand. No, you’re analytical, like your father and pretty stubborn on top of it, I think.”\\n\\n “Like my father? What the fuck do you know about my father? What the hell are you talking about?” Tucker pushed hard on Gavin’s arm, trying to move him away from him, so he could think. Gavin was saying too much crazy shit, and it was messing with his own mind now. Tucker had never even known his father. His mother died when he was a baby, and so far as he knew, his father had hauled ass, not sticking around to care for him. His grandparents had raised him, and he’d never had any interest in finding out more about the bastard who’d abandoned him. Gavin was saying things that made no sense. That had to be all it was, but it was oddly specific and fucking weird to mention Tucker’s father. What was going on here?\\n\\n Gavin leaned in toward Tucker. Tucker had an insane impulse to dodge away or try to run, but was trying desperately to stifle it. He couldn’t stop himself from jumping to his feet and taking a step backward though, and he kept backing up as Gavin came closer until he hit the wall. He gazed up at his handsome lover, praying he would start to smile and this would all be some kind of crazy joke. “Gavin, stop this, please. Tell me the truth. Did you take something? Some drug? I didn’t see you take anything, but… He looked up at Gavin and tilted his head. “That must be it. You slipped me something last night to make me hallucinate. That whole thing on the beach was some kind of weird acid trip, wasn’t it?”\\n\\n “No, Tucker. There weren’t any drugs and I’m not crazy. Maybe I should just tell you everything now, butyou’re not going to like it much. It’s going to be hard for you, but you have to try to trust me. I’ve got you,and I won’t let anything hurt you.” Gavin stood in front of him and put both hands on the wall on either side of him, boxing him in. He peered down into his face and smiled. “Though I suppose right now you’re mostly scared of me. I think I have no choice but to claim you as my mate and then tell you everything.”\\n\\n Tucker tried hard not to tremble as he stood indecisively in front of Gavin, looking down at the hands blocking him in. He needed to get a grip. What the fuck was he talking about? Claim him as his mate? What the fuck? He knew he probably should be more frightened. Gavin was talking crazy, and Tuckerdidn’t exactly know how to deal with it. He could easily break away from Gavin’s arms if he wanted to—probably—but if he was sick or on some kind of drug, he didn’t want to hurt him. Maybe if he just played along…\\n\\n He glanced up at Gavin. “Okay, honey. You can do whatever you need to do. Why don’t we go over here and sit down for a few minutes?”\\n\\n Gavin looked down at him, beautiful and bright and a little stern. “You need to listen to me, Tucker. Really listen to what I have to tell you,and don’t be scared of me. It’s not what you’re thinking. I’ll try to make it all clear.” His voice was deep, soothing, and almost hypnotic. “Just remember that you’re my mate and trust me—can you do that?”\\n\\n Even as he tried to figure out what to do to contain the situation, one idea after another racing through his brain, he knew he was still willing to play along. He held Gavin’s gaze.\\n\\n “Okay. Whatever you say. What do you want to tell me? Just be calm, honey.”\\n\\n Gavin smiled. “I’m perfectly calm, Tucker. I need to tell you who I really am, and who you really are, but first I need you to suspend that rigid logic and control of yours for just a few minutes.” He stared down at him for a long moment, as if gauging his responses. Taking a deep breath, he leaned in, forcing Tucker to allow him even deeper into his personal space, so he felt a little off-balance. Gavin’s body was touching Tucker’s from his knees to his chest.\\n\\n “Please, Gavin…” Tucker said.\\n\\n “Please what, baby?”\\n\\n “Please stop this,and let’s just drink some more coffee and calm down.”\\n\\n “I keep telling youI’m perfectly calm, Tucker. I’m just trying to decide how best to do this. I’ve never had to explain who I am before. I don’t know how much you saw last night, or how much you dismissed as just a dream. I could just show you—I don’t want to scare you to death though.” Gavin frowned, obviously thinking hard of what to do next. “Okay, let’s go back and sit down and I’ll tell you some things, and you have to promise to just listen and not get upset. Okay?”\\n\\n Tucker decided that when he moved, he’d try to make it to the door. Just get outside and then call for help. He needed to get Gavin to a hospital—somewhere he could get him some medical attention. He tensed his body to run, and then Gavin smiled down at him, running a finger down the side of his face. “Okay, baby?”\\n\\n Tucker found himself nodding and taking the hand held out to him. He followed Gavin over to the sofa and sat down tensely on the edge of the seat.\\n\\n “How much do you remember about your parents, Tucker?” Gavin asked softly.\\n\\n “My parents?” Tucker said blankly, his face registering surprise. “Why do you keep talking about my parents? What do you know about them? Why are you asking…?”\\n\\n “Just answer the question, baby.” Gavin broke in. “Tell me what you know about them.”\\n\\n Tucker wrinkled his forehead. “M-my mother was killed in a car accident years ago. I don’t remember her at all, really. I was very young. My grandparents raised me.”\\n\\n “What about your dad?”\\n\\n “My dad?” He shrugged. “I don’t know—the bastardwasn’t in the picture. I never knew him, so I never had much interest in the asshole. Never knew the difference, and I don’t give a damn now. My grandparents said he didn’t want me, so they took me in.”\\n\\n “I’m sorry, Tucker, but that was a lie. He wanted you very much. As a matter of fact, he’s been searching for you for years.” \\n\\n","sourceLink":"https://allnovel.net/bad-moon-on-the-rise-dark-hollow-wolf-pack-7/page-11.html","bookId":2259,"book":{"id":2259,"title":"Bad Moon on the Rise (Dark Hollow Wolf Pack #7)","description":"Storyline: Bad Moon on the Rise (Dark Hollow Wolf Pack #7) \\n Living on the Gulf coast of Florida, Detective Tucker is investigating a series of strange, violent murders. Encountering a gorgeous stranger named Gavin in a bar, his attraction is powerful and immediate, but he learns the man is somehow involved in the savage killings that have already taken three lives. After an argument with Gavin sends Tucker to the beach to figure things out, he is attacked by a savage creature, and almost killed except for the intervention of a fierce animal that looks like a wolf. When he wakes up in Gavin’s hotel room he’s told that he’s not who he thought he was all his life, but a natural pet of the Dark Hollow Wolf pack. He wants to run, but if Gavin catches him, he’ll be taken away from everything he’s ever known and thrust into an alien world to become the mate of a powerful alpha.\\n","cover":"https://allnovel.net/images/bad-moon-on-the-rise-dark-hollow-wolf-pack-7.jpg","author":"Shannon West","type":"Mystery","source":"allnovel","link":"https://allnovel.net/bad-moon-on-the-rise-dark-hollow-wolf-pack-7.html","creation":"Oct 5, 2019 8:58:31 AM","modification":"Oct 5, 2019 5:17:16 PM"}}
