{"id":86745,"no":19,"title":"Page 19","content":"\\n\\n “Oh,” Richard blushed as he took a seat on the sofa. “I’m not as young as I look, James. Wolf metabolism,” he said with a shrug. “But you. I don’t mean to embarrass you, but you’re so nice-looking. You remind me of your beautiful mother.” His brown eyes filled with tears for a second or two before he blinked them rapidly away.\\n\\n Tucker sat down beside him, and on impulse, put a hand on his leg. “I don’t go by James. Ever since I was a kid, my friends have called me Tucker. And I don’t remember my mother, of course, but I’ve seen a lot of pictures my grandparents had of her. She was beautiful.”\\n\\n Richard turned to him with a brilliant smile, and a little silence fell between them, but it wasn’t an awkward one. The idea that this young, handsome stranger was his father was odd, but for the first time, Tucker thought he might be able to get used to the idea if he stayed here. Tucker was reminded it was the second time that morning the idea of staying there had come to him. Was that a good thing or not?\\n\\n “If you two are ready, we should go down and have some breakfast. I’m starving,” Gavin said, and Richard looked over at him with affection.\\n\\n “You’re always starving. How about it, Tucker? Would you like to go down and get something to eat?”\\n\\n “Sure,” he said, standing up. Both men stood up on either side of him and reached for his arm at the same time. A pink blush settled on Richard’s cheeks and he dropped his hand, taking a step backward while lowering his gaze. It was such a subservient gesture that it took Tucker by surprise.\\n\\n “I’m sorry, Alpha. I should have realized…”\\n\\n “No, Richard, it’s fine. You take him downstairs. I need to make a quick phone call anyway, and I’ll be down in a moment.” He smiled encouragingly at Tucker. “Is that okay, Tucker?”\\n\\n “Yeah, sure,” Tucker said with a shrug, “if the two of you are through playing tug-of-war with me.” Richard stepped forward again with a smile and offered his arm to Tucker. Feeling weird, but deciding it was some kind of wolf thing, Tucker took his arm and let him guide him through the door and down the hall, but once outside the room, he glanced over at his father. “Exactly what was all that about?”\\n\\n “Hmm? Oh, I forgot you and the alpha are mates for a moment in all the excitement, that’s all. As your intended mate, it’s his right to escort you. A male relative usually escorts unmated natural petsif possible, once they’re past puberty. At least the children of the alphas and betas, that is. The human pets are, of course, mated when they come to us, so it’s not a big deal with them. But the natural pets of the alphas or betas are a different story. It’s not such an absolute rule anymore, but it used to be adhered to very strictly. I guess I’m just a little old-fashioned.”\\n\\n “But I’m a man—why would I need an escort?”\\n\\n Richard looked at him in confusion. “To protect your honor.”\\n\\n Tucker laughed. “Yeah, well, I think that ship sailed a long time ago.” Richard blushed and frowned, and Tucker decided to stop teasing him. If he wanted to play protective father, why fight it? Dorothy, you’re not in Kansas anymore.\\n\\n “So Gavin’s the alpha? Is that what you call him?” Tucker asked, changing the subject. “Yes , mostly. It’s his title and he’s been a very good alpha for our pack. He’s highly respected, and it’s an honor you’ve been chosen as his mate.”\\n\\n “Well, about that. Ithasn’t been exactly decided yet. I mean, he keeps telling me that, but I haven’t agreed to the ‘honor’ yet.”\\n\\n “But he’s your bloodmate,” Richard said, looking at him like he’d lost his mind. “I guess you don’t understand fully yet, but you can’t ignore the bloodmatch. I mean, you could, but it would make you really unhappy. Besides, the alpha will make you a wonderful mate.”\\n\\n “We’ll see,” Tucker said mostly under his breath. They were walking down the wide staircase now, and getting more than a few interested looks. About twenty or more of the pack members were moving around the common area as they came down the stairs, some at the tables, eating breakfast, and others standing or sitting in small groups on the other side of the stairway.\\n\\n They were by and large a handsome group of people, most with dark coloring, but a few of the pets, as Gavin called them, had all different shades of hair and eyes. You could see that they were much smaller than the wolves and mostly quieter. A group of males, wolves by the size of them, were sitting at one of the tables, laughing and talking boisterously. All of them looked up when Tucker and Richard came down the stairs and into the dining room. They nodded respectfully at Richard, but a couple of them almost seemed to be assessing Tucker, their gazes roaming over his body as they passed by them. In contrast, some smaller men at a nearby table were having a much quieter conversation and nodded first at Richard and then at him as they took a seat near their table. Tucker decided the second group must be pets.\\n\\n “The food is good, Tucker,” his father said. “I hope you’re hungry.”\\n\\n “Oh, yes, uh…I’m not sure what to call you.”\\n\\n Richard looked up in surprise. “I’d love it if you called me Dad. I mean, if you feel comfortable with it.”\\n\\n Tucker smiled at him. “It seems a little weird, since you look more like my brother, but I’ll get used to it, I guess.”\\n\\n A young woman of around twenty stepped over to their table and gave Richard a nod and a smile. “Hello, sir. May I get you the usual?”\\n\\n “Hi,Emily,” Richard said with a smile. “That would be wonderful, thank you. Oh,Emily, I’d like you to meet my son, Tucker. Emily is one of our servers. Many of our young people work here in the lodge for us for wages, and Emily does a wonderful job.”\\n\\n “Thank you, sir,” she said shyly. She glanced over at Tucker warmly. “So nice to meet you, Tucker. We’re all so happy for Richard that he found you at last.”\\n\\n “Nice to meet you too, Emily.” Tucker extended his hand, but Emily simply blushed and pointed to her shiny wedding band.\\n\\n “Can I bring you some bacon and scrambled eggs? Or pancakes?”\\n\\n Tucker pulled back his hand, glancing at his father to see if he’d broken some rule by offering to shake her hand. “Bacon and eggs sounds great, thanks.”\\n\\n Emily nodded and hurried away, disappearing through a side door that presumably led to the kitchens. “Emily is a sweet girl. She’s like you, the daughter of a wolf and his human mate. She’s also the new mate of one of the men who brought you home—Todd?” At Tucker’s nod, he continued. “She couldn’t shake your hand because Todd is a little old-fashioned. He doesn’t like any unmated wolves or male pets touching Emily. Some of the wolves still feel that way, though most are changing the old ways now. The alpha’s pet over in North Carolina has been instrumental in bringing a lot of relaxations of the old rules. Did Gavin tell you about Nicky?”\\n\\n “A little, yeah.”\\n\\n A loud female laugh nearby drew their attention, and Tucker’s eyes widened at the sight of Gavin being practically molested by a tall, attractive woman with gleaming, straight black hair streaming down her back. He was at the foot of the stairs, and as Tucker watched, the woman threw her arms around Gavin’s neck and kissed him right on the lips, moving her body way too suggestively against him. What really pissed Tucker off the most, however, was the way Gavin was kissing her back.\\n\\n “What the hell? She obviously has no problems with touching,” Tucker said irritably.\\n\\n Richard followed Tucker’s surprised gaze. “That’s Marissa. She and Gavin are very close…uh…friends.”\\n\\n “Yeah? What happened to the no touching rule? It doesn’t seem to apply to her.”\\n\\n “Well,” Richard said, clearing his throat in embarrassment. “No, the rule doesn’t apply to her. Marissa’s a wolf.”\\n\\n “Oh really?” Tucker said, surprised by how much it bothered him to see Gavin holding her in his arms, his head lowered to whisper something in her ear. “Okay,” Tucker said. “That shit’s about to change.”\\n\\n Tucker stood up and walked over to where they were standing, a little mollified to see how quickly Gavin pushed her away, pulling her arms down from where they draped around his neck. “Tucker! Hi, honey. I was just saying hello to a friend of mine. Marissa, this is Tucker, Richard’s son.”\\n\\n Tucker raised an eyebrow at the introduction. Richard’s son? Oh,we’re having a talk about that soon. Up closer to her, Tucker could see that she was a little older than he’d first thought, looking to be in her late twenties, but with the wolves, who could tell? She had to be at least six feet one or so, with a muscular frame, but she was beautiful, turning to regard him with cold dark eyes. God knew Gavin was fucking beautiful too, and it would be hard to keep your hands away from him, especially if they’d had a fling or whatever in the past. And maybe she didn’t know that Gavin had found his bloodmate. He turned toward the woman with an outstretched hand, determined to try to be polite and give her the benefit of the doubt. She glanced down at his hand pointedly and took a step back from him, settling herself firmly against Gavin’s side and leaning into him.\\n\\n “Didn’t your father explain about pets touching unmated wolves, little man?”\\n\\n Little Man? Really? Oh hell no.\\n\\n Dropping his hand, he gave her a winning, totally fake smile. “Why yes, he did tell me, but I figured that at your age, you had to be mated to someone. I mean, you look as though you’ve been around for a long time—that broken-in look, you know? Sorry, my mistake.”\\n\\n Marissa tightened her lips and almost snarled at him. “It seems this boy has a lot to learn, Gavin, but then Richard’s a good teacher. He’ll have you whipped into shape in no time, I’m sure. If he needs any help finishing your behavior training, though, please let me know. I’ll be glad to lend a hand.” \\n\\n","sourceLink":"https://allnovel.net/bad-moon-on-the-rise-dark-hollow-wolf-pack-7/page-19.html","bookId":2259,"book":{"id":2259,"title":"Bad Moon on the Rise (Dark Hollow Wolf Pack #7)","description":"Storyline: Bad Moon on the Rise (Dark Hollow Wolf Pack #7) \\n Living on the Gulf coast of Florida, Detective Tucker is investigating a series of strange, violent murders. Encountering a gorgeous stranger named Gavin in a bar, his attraction is powerful and immediate, but he learns the man is somehow involved in the savage killings that have already taken three lives. After an argument with Gavin sends Tucker to the beach to figure things out, he is attacked by a savage creature, and almost killed except for the intervention of a fierce animal that looks like a wolf. When he wakes up in Gavin’s hotel room he’s told that he’s not who he thought he was all his life, but a natural pet of the Dark Hollow Wolf pack. He wants to run, but if Gavin catches him, he’ll be taken away from everything he’s ever known and thrust into an alien world to become the mate of a powerful alpha.\\n","cover":"https://allnovel.net/images/bad-moon-on-the-rise-dark-hollow-wolf-pack-7.jpg","author":"Shannon West","type":"Mystery","source":"allnovel","link":"https://allnovel.net/bad-moon-on-the-rise-dark-hollow-wolf-pack-7.html","creation":"Oct 5, 2019 8:58:31 AM","modification":"Oct 5, 2019 5:17:16 PM"}}
