{"id":75728,"no":93,"title":"Page 93","content":"“But you didn’t—”\n “It’s what’s on my record. I’m considered a sexual predator, whether I like it not, whether I forced you or not. And let’s not forget the murder part. I killed two people.” When she winced, I went on, pushing harder. “With my bare hands. There’s no technicality about that. I killed them. And it changed me. No matter what either of us want, I’m never going to be that innocent boy you fell in love with.” Shaking my head, I thumped my hands against my chest. “There’s nothing here for you any longer, City.”\n She sniffed and wiped at her face as her eyes filled with tears. “See, I listen to everything you say, but all I heard was you calling me City. I didn’t think I’d ever hear you call me that again. And yet, here you stand, and I...I just can’t believe you’re really here. It’s really you, yet you keep pushing me away.”\n “Christ,” I muttered, wiping my face. I glanced away, unable to watch the tears glistening from her cheeks. I wouldn’t be able to watch much more of this. She was shredding my willpower. “Don’t do this.”\n Her shoulders shuddered and her throat shifted as she swallowed. “But I don’t know if I can stop.” Her voice was soft, raspy. Tormented.\n I had to shut this shit down—now—before she broke me. “Then you’d better get a fucking clue,” I snapped. “My entire family is dead or gone to who knows where. I had to get my high school diploma in prison. I’m starting over with nothing but a goddamn criminal record under my belt. I don’t have a need or desire to reminisce about the old times. Getting tangled up with you once ruined me; I’m not going there again. I just want to put it all behind me and get on with living the rest of my life. Okay?”\n She stared at me, her eyes swimming in tears. I had to be the biggest bastard ever. The urge to yank her into my arms suffocated me. I couldn’t breathe past the yearning to hold her and apologize.\n Why did I still have to feel that all-consuming need to protect and soothe her?\n I drew in a tight breath. When I exhaled, I knew I was going to reach for her and apologize. But she nodded.\n “I know you said you’ve changed, and you’re not the same Knox. I can see that for myself. Quite clearly. But there still has to be something in your heart. I know what’s deep inside you. I don’t think a person’s core—their true nature—can change this much.”\n Damn it, we’d gotten way too close all those years ago. Even though I knew I’d never be able to lie to her, I still tried. “Well, I disagree.”\n “My heart hasn’t changed.” Her voice broke, and more tears collected in her eyelashes. “I grew up and tried to move on, but right here...” She pummeled her chest with her fist. “This is still the same, and since the moment you ran into me in the woods...it has beaten for you.”\n Fuuuuuck. I fisted my hands and stared up at the ceiling, vibrating with the need to reach for her.\n I needed to tune her out, resist, but she kept talking, and I just kept soaking it in.\n “I can’t live like this anymore, Knox. These last six years have been hell. Because being without you is like an open wound that bleeds and festers every day. It hurts and it’s miserable, and now you’re right here, yet you keep pushing me away.” She set her hands on my chest and pushed me. “You can’t hate me that much if you can react the way you did when I told Asher that joke?”\n I blew out a breath, wanting out of this conversation almost as much as I wanted to crawl out of my own skin and just be...someone else. “I didn’t say I ever hated you.”\n “So you love me?” Her voice was soft as she stepped closer.\n Dropping my gaze to her, I could do nothing but stare into her penetrating eyes. Panic filled my chest. But I kept facing her directly, afraid to show just how much this slip of a woman intimidated me.\n She moved even closer. “All you have to do is say you don’t love me anymore, and I’ll turn around right now, and walk out. I’ll never bother you again.”\n This was my chance. My golden opportunity to save her from me. And I couldn’t take it.\n Gritting my teeth, I clutched my head in my hands and felt my face go red as I bit out, “God...damn you.”\n Her lips fluttered up with accomplishment. “I love you, too,” she said simply. “After all this, I still love you.”\n Something powerful and painful jarred through my system. I drew in a sharp breath.\n City kept watching me, her eyes steady and challenging. “I’ve never loved anyone the way I love you. I’ve tried. Believe me, I tried so hard to get over you. I tried to move on...with different guys. But all I ever thought about was you.” \n","sourceLink":"https://allnovel.net/worth-it-forbidden-men-6/page-93.html","bookId":2715,"book":{"id":2715,"title":"Worth It (Forbidden Men #6)","description":"Storyline: \n I fell in love once. \n It was amazing. She was amazing. Life was amazing. \n I lived for each time I could see her, and nothing else mattered, not that our families were enemies, our time together was forbidden, or we had to meet in secret. \n Our love could conquer all. \n Until it didn\u0027t. \n So I was ripped away from the love of my life and shoved into hell, forced to continue without her. \n It shattered me, broke the best parts of me, left me permanently damaged. \n Or so I thought. \n Years later, I swear history’s trying to repeat itself because she’s back in my life, and I’m just as drawn to her as I was before. But I\u0027m older and wiser now, and I know she should stay away from a worthless ex-con like me. \n So, I will not let her in. I absolutely refuse to hurt her. I will keep her away. \n Then again, sometimes risking your greatest fear to get to a smile makes everything worth it, and besides, I’m not sure I can resist her, anyway. \n This is the story of how Felicity Bainbridge changed my life forever, starting one summer day long ago after I was forced to change a dirty diaper... \n --Knox Parker\n \n","cover":"https://allnovel.net/images/worth-it-forbidden-men-6.jpg","author":"Linda Kage","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/worth-it-forbidden-men-6.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 10:34:14 AM"}}
