{"id":81701,"no":15,"title":"Page 15","content":"They filled the street ahead of us, a shambling horde with gaping jaws and rolling eyes. Some looked human except for a few sores or open wounds on their exposed faces and hands. Others lacked limbs or skin or sensory organs. Their clothes hung in tatters or in perfectly-creased folds and all of them, all of them, were coming for us and they wouldn\u0027t stop until we were torn to pieces. \"We\u0027ve got to go,\" I shouted at Ifiyah. I tried to grab her arm but she shrugged me off. With short clipped words she ordered her girl soldiers into a firing formation - the same one she\u0027d used back on the docks. There were a lot more of them this time and their movements were less constrained. I just didn\u0027t know if we could survive this. \"We can outrun them, head down a side street,\" I suggested. The dead took another step toward us. And another. They would never slow down. \"Ifiyah...\" \"They have no guns, Dekalb,\" the commander said as if she were brushing off an insect. \"They are so stupid, to lie for us in wait here and they even have no guns.\" \"This isn\u0027t an ambush - they\u0027re not capable of that level of planning,\" I insisted. I looked at Gary, the smartest dead man in the world, and he nodded a confirmation. Ifiyah waved me away. I turned to Ayaan, thinking she would understand that this was not a traditional military skirmish. But Ayaan ignored me studiously. Unlike the others she had to know what was about to happen. She\u0027d been there, in the hospital, when the girls died. I could see her breathing hard through her nose, her jaw clamped shut but she didn\u0027t move from her firing crouch. Orders are orders, I guess. The girls opened up with their rifles, going for head shots only - just like they\u0027d done back at the dock. Maybe, I thought, maybe Ifiyah was right. Maybe I was just a coward. The girls were trained soldiers and they weren\u0027t panicking. Maybe making a stand here was exactly the right thing to do. \"We\u0027re fucked,\" Gary moaned, tugging at his leash. The other end had been securely tied to a fire hydrant. The dead fell one by one without a sound but others merely crawled over the inert bodies and continued with the advance. Ayaan and Fathia knelt together and spotted for one another, thinning out the ranks of those closest to us but even as their rifles snapped and spat more of the dead spilled out into the street. I could remember this place in happier times and just how crowded it had been then but it was nothing like this. The noise we made must have been drawing every animated corpse in the Village. \"If I kill enough,\" Ifiyah shouted, \"they can learn, and inshallah they will runaway!\" I don\u0027t know who she was talking to - she certainly wasn\u0027t looking at me. I moved back just to scout the side streets and saw that they were blocked as well - not with the solid wall of the dead that stood between us and the river but with dozens of straggling corpses moving toward us from every direction. To the east - away from the river and therefore farther from safety - the street looked relatively clear but who could know what we would find even if we ran now? Right next to me one of the girl soldiers - a skinny one with scrapes on her kneecaps - switched her rifle over to full auto and sprayed bullets at the oncoming horde. Panic had gripped her - at this range it would be impossible to get accurate head shots firing that quickly - and Ifiyah moved quickly to smack at her hands and make her stop. She was wasting bullets if nothing else. I could see the girl\u0027s eyes as she felt the cold intensity of her commanding officer\u0027s anger suffuse her. I had expected to see fear there but instead I found only shame. The soldiers were ready to die here if Ifiyah ordered it, certain that to die for a noble cause is better than to live without honor. They had never known anything else but this perfect discipline, this unquestioing subservience. They weren\u0027t old enough to understand that authority figures can be wrong, too. Personally I\u0027d rather live even if it meant having the word COWARD tattooed on my forehead. When the dead emerged from the side streets and began to flank us I snatched at Ayaan\u0027s arm and howled into her ear our need to retreat. I figured if anyone could talk some sense into Ifiyah it would be her. The air went out of me as the stock of her AK-47 slammed into my stomach. \"You don\u0027t give me my orders!\" she shrieked over the noise of the company\u0027s rifles. \"You give no orders at all, gaal we\u0027el! Sedex goor I tell you this, and still you chirp like a baby bird at me! Waad walantahay!\" The dead came at us thick and fast while I tried to get my wind back. They came right for us, never deviating, never turning aside. The bullets weren\u0027t even slowing them down. Ifiyah ran back and forth shouting encouragement or abuse at one or another of her kumayo sisters. A dead woman in a green cardigan and wingtip shoes came up on her left, somehow having slipped through the cracks in the girls\u0027 defense. She reached for Ifiyah trying to get a handful of her jacket, her headscarf, her flesh and she cut the dead woman in half with automatic fire, literally separating her torso from her legs in a roiling haze of torn skin and bone fragments. \"Sharmutaada ayaa ku dhashay was!\" Ifiyah howled, her face lit up with exultation. The dead woman didn\u0027t even pause. The second she hit the ground she began crawling toward Ifiyah again. The commander emptied the rest of her cartridge into the body but somehow missed the head. Before she had a chance to reload two skeletal arms were wrapped around her calf and broken teeth sank deep into her thigh. Two of the girl soldiers pulled the corpse free from Ifiyah\u0027s leg. They stomped on the dead woman\u0027s head with the heels of their combat boots until there was nothing left but grey pulp. It was too late, though. Ifiyah clutched at her wound, her rifle forgotten, and gazed up at her charges as if looking for ideas. Her authority was gone. Her certainty had evaporated the moment those broken teeth broke her skin. For a long sickening minute nobody fired a weapon and nobody moved, except the dead, who kept stepping closer. \"We need to find a secure CCP,\" Ayaan finally said to me, breaking the spell, \"and you\u0027re our regional specialist.\" So engrossed with what had happened to Ifiyah I didn\u0027t see her come up and I yelped with startlement. \"Get us out of here, Dekalb!\" I nodded and stared east on Fourteenth. Only a few of the dead staggered toward us from that direction. \"Somebody untie him,\" I said, pointing at Gary. \"He\u0027s a doctor. A takhtar. We need him.\" They did as I said. The dead man claimed he couldn\u0027t run so I detailed two of the girls to carry him. If they disliked this duty they were too well-trained to say so. I picked up Ifiyah myself - I was disturbed to find she weighed only a little more than my seven year old daughter Sarah - and then we were running, tearing down Fourteenth, our weapons clattering against our backs. We dodged around the dead there as they clawed at us. One of the girls got snared by a particularly dextrous corpse but she kicked him in the face and got free again. Out of breath before we\u0027d covered one avenue block I didn\u0027t let myself slow down until we ran past a building covered in scaffolding and the street opened up into the tree-lined expanse of Union Square. I realized then I had no idea where I was going. We were headed away from the river and the safety of the ship. What kind of shelter could we possibly find from the dead? I stopped and set Ifiyah down very carefully. Her eyes were wide as she stared up at me. I panted for air, oxygen bludgeoning my lungs as I stared at the storefronts and the trees and the statues all around me. There was no sound at all.","sourceLink":"https://allnovel.net/monster-island-zombies-1/page-15.html","bookId":2464,"book":{"id":2464,"title":"Monster Island (Zombies #1)","description":"Storyline: Monster Island (Zombies #1) It\u0027s one month after a global disaster. The most \"developed\" nations of the world have fallen to the shambling zombie masses. Only a few pockets of humanity survive — in places rife with high-powered weaponry, such as Somalia. In New York City, the dead walk the streets, driven by an insatiable hunger for all things living. One amongst them is different; though he shares their appetites he has retained his human intelligence. Alone among the mindless zombies, Gary Fleck is an eyewitness to the end of the world — and perhaps the evil genius behind it all. From the other side of the planet, a small but heavily-armed group of schoolgirls-turned-soldiers has come in search of desperately needed medicine. Dekalb, a former United Nations weapons inspector, leads them as their local guide. Ayaan, a crack shot at the age of sixteen, will stop at nothing to complete her mission. They think they are prepared for anything. On Monster Island they will find that there is something worse even than being undead, as Gary learns the true price of survival.","cover":"https://allnovel.net/images/monster-island-zombies-1.jpg","author":"David Wellington","type":"Horror","source":"allnovel","link":"https://allnovel.net/monster-island-zombies-1.html","creation":"Oct 5, 2019 8:58:44 AM","modification":"Oct 5, 2019 4:35:41 PM"}}
