{"id":81708,"no":23,"title":"Page 23","content":"Fine blue tattoos covered him from head to toe. A rope tied tight around his neck and an armband made of fur were his only clothing but he stood there unashamed and looked down at Gary with a kind of haughty pride. A particularly stuck up teacher staring down at his best pupil.\n \"Come to me,\" he said again, and then he was gone. In his place was an image of a temple or a library or something. Lots of steps leading up to a facade of columns. Gary knew the place but its name wouldn\u0027t come to him.\n Climbing the escalator took a couple of tries. Gary\u0027s brain continued to heal itself but his motor control was the slowest in coming back. Lucidity had returned like walking into air conditioning on a scorcher of a day but the simple act of putting one foot in front of the other was still mostly beyond him. The seizures that racked his body and left his brain fizzing like a well-shaken seltzer bottle didn\u0027t help either. He would progress a few yards only to find himself lying on the floor with no explanation how he\u0027d gotten there, his hands clenched like claws and his ankles twisted beneath him.\n In time he reached the ground floor of the megastore, taking the last few steps on his hands and knees. He rose shakily and lurched for the door only to be stricken by the sight of what lay outside.\n Bodies - hundreds of bodies - in an advanced state of decay, clogging up the sidewalks and slumped at random over the abandoned cars. Putrefying flesh lay in heaps under the mid-morning sun, not all of it recognizably human anymore.\n Jesus, Gary thought. Had he really done all this damage himself?\n These weren\u0027t like the undead he\u0027d seen before. These were just... rotting meat, yellow bones pointing out of deliquescing flesh with the consistency of runny cheese.\n Something stirred in the Square to the north and he dodged behind a Jeep, not wanting to get shot in the head again. He needn\u0027t have worried, though. It was one of the dead. A dead woman in a print dress stained with old blood and darker fluids. She came closer, waddling as if she couldn\u0027t bend at the knees and he saw she was badly damaged. Most of the skin was gone from her face and a clump of maggots perched in the hollow of her clavicles like a writhing scarf. Good god, how could she let that happen? Disgusting as they might be the maggots were alive. They could have given her the energy to repair her body. Instead they were feeding on her.\n Two others appeared behind her, both of them men. They too had seen better days. The walking dead of New York tended to have a few wounds on their bodies, sure, and maybe their skin tone was a shade paler and bluer than necessary - Gary thought furthermore of the dead veins that lined his own face - but never had they let themselves go this badly. One of these newcomers had no nose at all, just a dark inverted V in the middle of his face. The other had lost his eyelids so he seemed to be constantly staring in horrified wonder.\n Gary reached out across the network of death that connected him to these shambling messes. The effort made his brain wriggle in his head and a searing white pain flashed down his back but the contact was made. He could feel the dark energy fuming out of these wretches and he understood a little of what must have happened. In his desperation he had sucked the energy out of the crowd around the megastore to save his own unlife and in the process had accelerated the decay of his victims. In the new order of things the dead ate the living in a vain attempt to prop up their own sagging existence, to fuel their unlife. Gary had undone all that striving and hard work and now the rotting piles of corpses outside looked like they had been dead all along, dead and decomposing since the Epidemic began. There was no cheating death, Gary realized, only delaying it - and when it finally caught up it did so with a vengeance.\n The noseless one reached out and touched Gary\u0027s face with an unfeeling hand. The fingers draped lifelessly across his cheek. Gary didn\u0027t flinch. How could he? There was no malice in the gesture. It had all the emotional resonance of a muscular twitch.\n Most of the undead had lost the battle with death when Gary stole their essence. Those few strong enough to survive were left with only the barest tatters of energy remaining. Hence the broken and rigid undead he saw before him. Perhaps worse than their physical condition was their mental state. He had stolen from them the remnant of intellect that kept them hunting for food. Their hunger remained - he could feel it yawning inside of them, burning more fiercely than ever - but he had stolen from them the knowledge (no matter how vestigial) of how to slake it. He had taken what little mind they had so now they no longer remembered how to eat. They could only wander aimlessly as their bodies fell to pieces.\n Gary felt no guilt. It had been necessary. He had been dying for a second and final time and only their stolen energy had been able to keep his consciousness going. Why, then, did he identify so strongly with them, why did he feel so much empathy? He was tied to them, he realized. He was one of them. He was part of the network of death. His ability to reach out and steal their energy defined him. There was no real line of division, no watershed between himself and these near-lifeless hulks that wobbled without purpose up and down Fourteenth street. If he missed a few meals, if he didn\u0027t keep feeding himself he would become just like them.\n He sank to his knees with the realization of his true nature. The ravaged dead came, drawn by some flickering instinct to gather together, and stood around him until their corrupted faces swam in his vision. They did not frighten him anymore.\n He was undead. He was one of them. As their hands reached for him he knew they weren\u0027t attacking him - they no longer possessed the brainpower necessary for aggression. They were reaching for him as a gesture of solidarity. They knew what he was.\n Gary was a monster, too.\n The dead man with no eyelids stared at him with an openness, an innocence that Gary was astounded he\u0027d never seen before. There was no evil there, no horror. Just simple need. Their faces were no more than inches away from each other. Gary leaned his head forward and touched his forehead to the slack, papery skin of the other\u0027s cheek.\n When he had recovered himself he commanded the faceless woman to help him to his feet, and she did. Come, he told them, summoning them just as his mysterious benefactor had summoned him. Together the small band of them, Gary and the mindless dead, headed north toward Midtown. It felt so very good, Gary decided, not to be alone anymore.\n Gary had life once more, and now he also had a purpose. He would find this strange tattooed man and learn what he knew. Gary had so many questions and for some reason he was convinced the benefactor would have some answers. He kept his little band heading resolutely northward, up into Midtown. They would enter the park soon enough. Was that their destination? In a way it didn\u0027t matter. In some zen fashion the journey was enough.\n When he saw the vision again the benefactor\u0027s face was furrowed with concern. \"You\u0027re getting closer but be careful. I think you are about to be attacked.\"\n \"Huh?\" Gary asked but the blue tattooed man was gone. Gary turned to look at the noseless man on his right, wondering if the other dead had seen the apparition or if it was just some glitch in Gary\u0027s personal nervous system.\n The man with no eyelids stared hard at something in the middle distance. Before Gary could speak he slumped lifelessly to the ground. Gary looked down and saw the bullet wound in the back of the dead man\u0027s head long before he heard the gunshot.\n The next round hit the sidewalk and sent chips of concrete rolling across Gary\u0027s feet. He was being shot at. \"Not fucking again,\" he whined.\n","sourceLink":"https://allnovel.net/monster-island-zombies-1/page-23.html","bookId":2464,"book":{"id":2464,"title":"Monster Island (Zombies #1)","description":"Storyline: \n Monster Island (Zombies #1) \n It\u0027s one month after a global disaster. The most \"developed\" nations of the world have fallen to the shambling zombie masses. Only a few pockets of humanity survive — in places rife with high-powered weaponry, such as Somalia. In New York City, the dead walk the streets, driven by an insatiable hunger for all things living. One amongst them is different; though he shares their appetites he has retained his human intelligence. Alone among the mindless zombies, Gary Fleck is an eyewitness to the end of the world — and perhaps the evil genius behind it all. From the other side of the planet, a small but heavily-armed group of schoolgirls-turned-soldiers has come in search of desperately needed medicine. Dekalb, a former United Nations weapons inspector, leads them as their local guide. Ayaan, a crack shot at the age of sixteen, will stop at nothing to complete her mission. They think they are prepared for anything. On Monster Island they will find that there is something worse even than being undead, as Gary learns the true price of survival.\n \n","cover":"https://allnovel.net/images/monster-island-zombies-1.jpg","author":"David Wellington","type":"Horror","source":"allnovel","link":"https://allnovel.net/monster-island-zombies-1.html","creation":"Oct 5, 2019 8:58:44 AM","modification":"Oct 5, 2019 4:35:41 PM"}}
