{"id":81731,"no":46,"title":"Page 46","content":"The controls for the Predator RQ-1A Unmanned Aerial Vehicle were simple enough. They\u0027d been designed for the average 21st Century soldier and were a near replica of the gamepad for the Sony Playstation. You used one thumbstick for the throttle and the other to steer while vehicle systems were mapped to the face and shoulder buttons - raising the landing gear, moving the nose-mounted cameras and so on. Child\u0027s play, I figured. I had studied the weapon system back in the old days, back when I had a life and a career. I felt confident and alert as my little plane leapt into the air off Governors Island and streaked toward Manhattan.\n \"Watch out for sudden updrafts,\" Kreutzer said. \"They can be a real bitch.\" He had the second seat in the cramped, overheated trailer. As systems specialist he had to keep the aircraft\u0027s avionics and telemetry streams coming in clear and legible. He faced three big monitors where he could display and manipulate his \"product.\"\n The Standard Oil Building came up on my right and I slewed over a little to avoid its spire and then something went wrong. The Predator kept trying to flip itself over, its right wingtip popping up again every time I tried to bring it down. I poured on a little more throttle to try to break free of what I thought was mild turbulence and suddenly a wall of wind slapped the vehicle across the nose, sucking it down into a superfast spiraling descent that could more rightly be called \"falling out of the sky\".\n The UAV smacked Broadway at an angle and skipped like a stone across the roofs of several parked cars, finally skittering to a halt in the middle of Bowling Green on its back. The camera showed us a shaky view of the Charging Bull statue and a partially cloudy sky.\n Kreutzer\u0027s face curled into a look of infinite smugness as he showed me what I\u0027d done wrong. On his product screen he show me the last few seconds of the Predator\u0027s flight as a PowerPoint slideshow. I saw the spire on the Standard Oil Building and the column of air beyond where Morris Street butted up against Broadway. Then he maximized the infrared view of the same scene and showed me a false color vortex spinning madly at the corner of the two streets - wind shear generated by the difference in temperature between the sunny and shaded sides of the buildings.\n \"Okay. Lesson learned,\" I said. My heart was still racing a little from the excitement of piloting the Predator. When Jack came in to find out what was going on I let Kreutzer explain. They both turned and stared at me when I shrieked.\n A dead man with no skin on the top of his head had come to investigate the Predator where it lay in Bowling Green. His inverted nose wrinkled as he sniffed the downed plane\u0027s optics. I had become so immersed in flying the UAV that I\u0027d forgotten it was half a mile away and the walking corpse couldn\u0027t get me through the screen.\n I switched off the view and rubbed my hands together. \"Let\u0027s get another one assembled,\" I said. \"I\u0027m ready to go again.\"\n An hour later Ayaan\u0027s crew had Vehicle Two ready to go. It had a wingspan of fifty feet and its nose instrument package looked like the head of one of the aliens Sigourney Weaver used to fight in the movies. I ran through my pre-flight and initialized the optics. I hit the throttle hard - we were using a shorter-than-regulation airstrip - and let the Predator race down the lawn, the view on my screen bouncing as it picked up speed. At just the right time I yanked back on the yoke and the nose jerked up into the air. The UAV surged up into the sky and easily cleared the top of Liggett Hall. I remembered to retract the landing gear and we were on our way.\n I brought the UAV up to cruising speed and let it fly itself, mostly, only banking a bit to bring it in over Castle Clinton in Battery Park. I kept my altitude low, balancing the possibility of one or two undead spies hearing the propeller against flying high and letting millions of them see it. That meant flying between buildings - something the Predator was built to do, although it was also supposed to have a highly trained pilot at the controls. When faced with the brick wall of Lower Manhattan I aimed for a narrow funnel at the top of the Battery where Bowling Green opened up the wide canyon of Broadway.\n \"Easy this time - don\u0027t try to force her.\" Kreutzer leaned toward me and I could smell his breath as I neared the vortex that had brought me down before. This time I just let go of the throttle at the crucial moment and the Predator shot through, yanked along by the edge of the wind shear instead of trying to punch through it. I was leveling out over the abandoned cars of Broadway when the Iridium cell phone started chirping.\n \"What do I do?\" I asked, \"what do I do?\" Jack rushed into the trailer and booted up a secondary pilot\u0027s terminal. He knew only one person had the phone number. He took control of the vehicle and I rushed outside into the sunlight and the green grass and answered the call.\n \"You\u0027re spying on me now?\" Gary asked.\n I was stunned. \"What are you talking about?\"\n The dead man laughed in my ear. \"I see all, Dekalb. Every walking corpse in Manhattan can be my eyes or my ears. I assume it was you who just dropped an airplane on my perfectly good island. You\u0027re getting some bright ideas, aren\u0027t you? You\u0027re planning to come up here and rescue the prisoners. It won\u0027t work.\"\n I tried to bluff. \"We were just looking for the drugs. Scoping out hospitals, looking for a way in to complete the original mission.\"\n \"Nice try. My brain is dead, not damaged. You want to kill me. I know I would do the same thing in your place. I\u0027m a threat, a serious threat, and you want to neutralize me. Obviously I don\u0027t want that. I\u0027m willing to make a deal.\"\n I sat down hard on the lawn. \"Talk to me. The survivors - \"\n \"Are mine now,\" he interrupted. \"There\u0027s no room for negotiation there. What I will give you is safe passage. I know you had some trouble with pigeons the other day. They\u0027re gone now. I\u0027m going to let you enter Manhattan just long enough to get to the UN building, get your pills, and leave. Nobody will come close to you - I can keep them back. I can protect you. You do this and then you get on your boat and you leave here forever. Sound doable?\"\n \"And if we try to take back the prisoners anyway?\"\n \"Then you get to find out why a million dead men can\u0027t all be wrong. This is what I\u0027m offering, Dekalb, and nothing else. Get the drugs and leave. Oh, and one other thing. Ayaan.\"\n I looked over at the girl in question. She was posing for pictures - Fathia had found a Polaroid camera in one of the barracks and all the girls wanted a souvenir of their visit to New York City. She turned to look at me and smiled.\n Gary purred in my ear. \"Ayaan stays here. I want to cut the skin off her in little pieces and eat them one by one. I want to have some quality time with her viscera. She shot me in the head. Nobody gets a free ride after that.\"\n I put a hand over my mouth to hold in what I wanted to say to that. Not going to fucking happen, asshole. Instead I waited a moment and said \"I\u0027ll have to get back to you.\" I hit END and put away the phone.\n \"Dekalb,\" Kreutzer said from the door of the trailer. \"We\u0027ve got image.\" I followed him back into the stuffy enclosed space to see what Jack had found. \n","sourceLink":"https://allnovel.net/monster-island-zombies-1/page-46.html","bookId":2464,"book":{"id":2464,"title":"Monster Island (Zombies #1)","description":"Storyline: \n Monster Island (Zombies #1) \n It\u0027s one month after a global disaster. The most \"developed\" nations of the world have fallen to the shambling zombie masses. Only a few pockets of humanity survive — in places rife with high-powered weaponry, such as Somalia. In New York City, the dead walk the streets, driven by an insatiable hunger for all things living. One amongst them is different; though he shares their appetites he has retained his human intelligence. Alone among the mindless zombies, Gary Fleck is an eyewitness to the end of the world — and perhaps the evil genius behind it all. From the other side of the planet, a small but heavily-armed group of schoolgirls-turned-soldiers has come in search of desperately needed medicine. Dekalb, a former United Nations weapons inspector, leads them as their local guide. Ayaan, a crack shot at the age of sixteen, will stop at nothing to complete her mission. They think they are prepared for anything. On Monster Island they will find that there is something worse even than being undead, as Gary learns the true price of survival.\n \n","cover":"https://allnovel.net/images/monster-island-zombies-1.jpg","author":"David Wellington","type":"Horror","source":"allnovel","link":"https://allnovel.net/monster-island-zombies-1.html","creation":"Oct 5, 2019 8:58:44 AM","modification":"Oct 5, 2019 4:35:41 PM"}}
