{"id":99688,"no":10,"title":"Page 10","content":"\n \"You know about the Demonata,\" Dervish begins. \"You\u0027ve seen them at work. You know of their powers, their magic, how destructive they are. You know that some, like Lord Loss, can cross between their universe and ours.\"\n \"Does this have anything to do with him?\" I croak.\n \"No. He doesn\u0027t need the cave, and from what I know of him he isn\u0027t interested in it.\" Dervish stops for a moment, thinking about the best way to proceed. \"Lord Loss is an exception. Most demons can\u0027t cross readily between universes. If they could, this world would be awash with the Demonata and humans would be their playthings and slaves.\n \"Many demons hunger for that. They spend a large portion of their time trying to open windows between the two universes. They find weak points where crossing is easier and work on them, assisted by power-crazed mages on this side. The Disciples try to stop them. We look for focal points, prevent crossings where we can, deal with the aftermath when we can\u0027t.\"\n \"Like in Slawter,\" I nod. \"You explained all that to me before. But what about the cave?\"\n Dervish puffs his cheeks up, then blows out air. \"More than a millennium and a half ago, the Demonata invaded. Normally they cross singly or in small groups. The demons hate each other almost as much as they hate humans-infighting is rife. But in this case thousands banded together to launch an all-out assault. They set out to create a large, permanent opening-a tunnel instead of a temporary window. The cave was the focus for their attempt.\n \"They were helped by a twisted druid. Our world was more magical then. Magic is an energy and like any form of energy it can ebb and flow over the course of time. Back then it flowed strongly through this world. There were many more magicians and mages than there are now, though they called themselves druids and priestesses. It\u0027s a source of debate as to why there\u0027s so little magic in the world these days. I guess-\"\n \"You\u0027re rambling.\"\n Dervish grins sheepishly. \"Sorry. Keeping it simple, the Demonata tried to open a tunnel through the cave. They nearly succeeded. From what we know, many did cross over, but only lesser demons. The tunnel was shattered before the masters could cross and the cave entrance was later filled in and hidden from the world, so nobody could make an attempt there again.\n \"Since that time a watch has been kept on this area. There\u0027s always been a watcher here-even before the Disciples were formed-monitoring the situation, making sure the cave isn\u0027t reopened. I\u0027m the latest in a long line of watchmen. That\u0027s why I don\u0027t wander the world like most Disciples. I get away to deal with other matters occasionally but the cave is my main priority.\"\n \"But you said you didn\u0027t know where it was. How could you keep people away from it if you didn\u0027t know its location?\"\n \"Powerful spells were cast when the cave was filled in. As watcher, I would have known instantly if anyone tried to gain access. The spells would have led me straight to the cave.\"\n \"Then why didn\u0027t you come as soon as we started digging?\" I frown.\n Dervish\u0027s left eye tics. \"The spells didn\u0027t work.\"\n \"But you said-\"\n \"Something went wrong,\" he snaps. \"That\u0027s why I was so worried. I thought a powerful mage must be at work, one with the ability to override the protective spells. When you told me Loch was dead, worry turned to outright panic. Before the tunnel can be reopened, a sacrifice must be made. If Loch had been murdered, the magical potential of the cave would have been reactivated, allowing the Demonata to start building a new tunnel.\"\n \"That\u0027s why you wanted to know if there was anybody else in the cave,\" I note.\n Dervish nods and licks his lips. \"I\u0027m still concerned. Those spells were cast by a magician-they should have worked. You didn\u0027t see Loch slip, did you?\"\n \"No.\"\n \"So you can\u0027t be certain there wasn\u0027t somebody else present, that he wasn\u0027t deliberately killed.\"\n \"Bill-E was with him. He would have seen if there\u0027d been anyone else up there.\"\n \"Maybe,\" Dervish says dubiously. \"But if there was somebody, and they were powerful enough to mute the warning spells when the cave was reopened, they might have been invisible, or used magic to wipe their presence from Billy\u0027s memory.\"\n I smile weakly. \"You\u0027re seeing phantoms where there aren\u0027t any. We only broke through to the cave today-yesterday, I mean. We went down by ourselves as soon as we discovered the entrance. There can\u0027t have been anybody else.\"\n \"You\u0027re right,\" Dervish sighs. \"I\u0027m jumping at shadows. But I\u0027m so wired! Back when the tunnel was open, only lesser demons were able to cross. But the core of the tunnel was widening all the time. It had almost got to the point where the masters could cross. The shell of that core remains intact. If the Demonata ever restored it, thousands could cross in a matter of days, masters and all.\"\n \"Couldn\u0027t you force them back again, close it like before?\" I ask.\n Dervish pulls a face. \"Humans are far less magical than they were the last time it was open. And back then they only had to deal with weaker demons. We could stop it happening if we caught wind of it in advance, but if they opened it without our knowing...\"\n He trails off into silence. It\u0027s hotter than normal in here. Dervish doesn\u0027t usually have the heating on this late. The temperature reminds me of the time we fought Lord Loss in the cellar, the unnatural heat of the Demonata\u0027s universe. I feel highly uncomfortable and shift around edgily on my seat.\n \"What happens now?\" I ask quietly.\n \"The cave will need to be hidden again. Fresh spells will have to be cast and we\u0027ll try to find out why those in place before didn\u0027t work. But that\u0027s a job for a magician. I\u0027ll put out the call and we\u0027ll wait.\"\n \"I thought there weren\u0027t magicians anymore, only mages.\"\n Dervish shakes his head. \"There\u0027s one. He\u0027s the head of the Disciples, though we don\u0027t have much to do with him personally-he fights most of his battles in the Demonata\u0027s universe. I fought alongside him once, a long time ago. He set me the task of guarding this area a few years later. I don\u0027t know how long it will take him to come, but hopefully it won\u0027t be more than a month or two.\"\n \"Are we safe while we wait?\" I ask edgily. \"What if an evil mage finds the cave and makes a sacrifice?\"\n \"It\u0027s not that simple,\" Dervish says. \"The tunnel can\u0027t be opened instantly. A sacrifice would have to be made to start the process, then over the next few weeks the entrances would fuse with the core. At that point someone would need to conduct a lengthy, complicated ritual in the cave. I\u0027d feel that magic at work-it would be impossible to mask-and I\u0027d move heaven and hell to stop it. But I don\u0027t think we\u0027ve anything to fear. Since I wasn\u0027t warned by the spells when you broke through to the cave, nobody else can have been. The Demonata don\u0027t know the entrance to the cave has been cleared, so they have no reason to move on it.\"\n \"Then we\u0027re safe?\" I watch his face closely in case he tries to lie.\n \"As safe as we\u0027ve ever been,\" Dervish says calmly and there\u0027s no hint of deception in his features. I start to relax slightly. He raises a finger. \"But regardless of how safe it is, I don\u0027t want you going back to the cave.\"\n \"As if!\" I lick my lips. \"What happens when you block it off again?\"\n Dervish shrugs. \"Life will go on as normal. I\u0027ll stay here, keeping watch, and another Disciple will replace me when I\u0027m old and grey and of no use anymore.\"\n \"What about Bill-E? Are you going to tell him what you told me?\"\n \"Yes. As soon as Ma and Pa Spleen let him out of the house-which might not be any time soon.\" Dervish stands and stretches. \"What a night. I\u0027ll be glad to see dawn.\"\n \"Loch won\u0027t ever see dawn again,\" I mumble. It\u0027s not fair, that I\u0027m having to think about the cave, demons and magic, when I should only be thinking about my poor dead friend.\n Dervish smiles helplessly and comes around the desk. Lays a comforting hand on my shoulder. \"You can talk with me about him if you want. I know what it\u0027s like to lose a friend. I can help.\"\n \"Yeah. Maybe. Thanks.\" I take a deep breath and look up. The fear grows in my chest. It tries to grab my tongue and hold it still. It whispers caution. Screams for silence. But I have to tell him. I can\u0027t keep it secret any longer.\n \"There\u0027s more than Loch and the cave that we need to discuss.\"\n \"Oh?\" A puzzled little smile, not expecting anything major.\n \"I think I have the family curse.\" His smile freezes. I push the fear down deep and spit out the words I never wanted to voice. \"I think I\u0027m turning into a werewolf.\"\n I tell Dervish everything-the sickness, the party, the bottle, the magic that\u0027s been growing within me since Slawter. Waking to find myself at the entrance of the cave, digging as if my life depended on it. The whispers, the face in the rock, splitting the wall with my scream.\n Dervish listens silently for the most part, eyes dark, chewing his nails or stroking his beard. Occasionally he\u0027ll ask me to elaborate, to describe the sickness and whispers in more detail. But most of the time he just watches me, his expression impossible to read, head cocked slightly, like a priest hearing confession.\n A long pause when I finish. Then Dervish tuts like a teacher. \"You should have called me back on Saturday or told me as soon as I got home.\"\n \"I know what I should have done,\" I snap. \"But I didn\u0027t. I was afraid you\u0027d make me become a Disciple if you knew about the magic. And I hoped I was wrong about turning into a werewolf. Keeping quiet was dumb, but I never claimed to be an Einstein. So cut me some slack.\" I glare at him but he only stares back calmly. \"Well?\" I grunt when he doesn\u0027t say anything. \"Am I turning or not?\"\n \"I don\u0027t know. The signs you describe suggest it, but...\"\n \"What?\" I hiss.\n \"Victims don\u0027t realise,\" he says quietly. \"Nobody turns into a werewolf overnight. It\u0027s a gradual process, spread out over three or four months. The kids often know things aren\u0027t right-if they wake covered in blood, or lying naked outdoors-but I\u0027ve never heard of anyone being conscious of the change or actively fighting it. When they start to turn, their minds blank out. They can\u0027t remember changing or do anything to stop it. What you describe is unlike anything any other member of the family has ever reported. And we\u0027ve been dealing with this for a long time.\"\n \"You\u0027re saying maybe it isn\u0027t...?\" I feel hope blossom in my chest.\n \"I don\u0027t know,\" Dervish says again. \"The signs all point to lycanthropy-the distorted face, the hands clenching, the howling. If somebody else had seen it happening to you, I\u0027d say you were definitely damned. But you shouldn\u0027t be able to note these things yourself. It...\"\n He goes quiet again. His forehead\u0027s a landscape of worry lines. I\u0027ve thrown him big time. He looks even more perturbed than he did in the cave. At least he knew where he stood with that and what he had to deal with.\n \"Tell me about the magic again,\" Dervish says. \"Everything you can recall.\"\n I go through the weirdness one chunk at a time. Waking to find myself levitating above the bed. Reversing the flow of water down the sink. Moving things with my mind. Making the bottle rise, explode and transform into flowers and butterflies.\n \"Everybody saw that?\" Dervish asks. \"Bill-E will confirm it?\"\n \"Of course.\" I frown. \"Why?\"\n Dervish grunts. \"If we\u0027re lucky, you\u0027re losing your mind, imagining the magic and the change. You\u0027ve had a hard few years, been through a lot-more than just about any kid in the world. Maybe it\u0027s caught up with you. Maybe you\u0027re going...\" He twirls a finger around in the air at the side of his head.\n \"Know what I like most about you, uncle?\" I ask waspishly. \"Your subtle tact.\"\n \"Stuff that! This is no time to be soft. If you were going mad, I\u0027d be delighted, because we could deal with it, seek help, fix what\u0027s wrong. Nobody\u0027s seen most of this magic you say you\u0027ve been working. It could all be in your head. But if you really did those tricks with the bottle and there are witnesses...\"\n \"There are,\" I say stiffly. \"And there\u0027s the cave. We found it on Sunday. We only dug down a small bit, but when we returned yesterday it had been excavated. Rocks and earth everywhere. Bill-E will confirm that too. I did it, Dervish. I went there, not entirely human, and burrowed down.\"\n \"Any idea why?\" Dervish asks.\n \"No. Unless it was the whispers... the face...\"\n Dervish makes a long humming sound. \"If you\u0027re not mad-and much as I hate to admit it, I don\u0027t think you are-I\u0027ve no idea what the face means. Unless some spell was cast upon the cave long ago, one I don\u0027t know about.\" He scratches his left ear, then the right. \"You couldn\u0027t recognise anything the girl was saying?\"\n \"No.\"\n \"Did the whispers seem to be drawing you to the cave or warning you off?\"\n I think about it. \"Warning me off. But if that was the case, why was I there? What made me return and dig? Could it have been the Demonata? Calling to the beast I\u0027m becoming? Using me to open a tunnel between universes, so they could cross?\"\n \"Possibly,\" Dervish says. \"I wouldn\u0027t have thought they had that kind of power, but if it\u0027s true that you\u0027re turning, and if there\u0027s magic involved...\" He frowns and trails off into a very troubled silence. I let him brood for five minutes... ten... twelve. Then I can\u0027t stand it any longer.\n \"What are we going to do?\" I cry. \"I don\u0027t want to turn into a werewolf. I don\u0027t want to hurt anyone. But-\"\n \"Quiet,\" he shushes me. \"Let\u0027s not jump to conclusions. There\u0027s a lot going on that\u0027s queer to us. But I can ask around, seek advice, search for answers. You haven\u0027t turned and you haven\u0027t hurt anybody, so don\u0027t work yourself up into a state. That won\u0027t help.\"\n He takes a sheet of paper off a pile on the desk, balls it up and tosses it from one hand to the other, thinking. \"First, I mount a watch of you every night. If you feel the sickness returning-or anything that doesn\u0027t feel right-you tell me instantly. If you feel magic forming, tell me that too.\" He hesitates. \"Can you do anything now? A small spell?\"\n I shake my head, scared of even trying.\n \"If I could see you in action... pinpoint the source you tap into... it might help establish what we\u0027re dealing with.\"\n I shudder, then nod and focus. I stare at the ball of paper which Dervish is still throwing from hand to hand. I try using magic to knock it off course, so it falls to the floor. But nothing happens.\n \"I can\u0027t do it,\" I say after a minute. \"It isn\u0027t there now. It comes and goes.\"\n \"OK,\" Dervish smiles. \"Don\u0027t knock yourself out. Now, it\u0027s been a long, tiring night. Let\u0027s get you to bed and I\u0027ll keep an eye on you.\"\n \"But the change... the magic... that\u0027s it? We\u0027re just going to leave it?\"\n \"Sure,\" Dervish says, then smiles reassuringly. \"We\u0027re not going to sort this out tonight. There\u0027s not much I can do until I see evidence of your transformation or magical prowess. When that happens, I should have a clearer idea of what you\u0027re going through and we can take it from there. Right now the best thing you can do is hit the sack and get some sleep. The problems will still be there tomorrow but we\u0027ll be in a better state of mind to deal with them.\"\n Since that\u0027s all there really is to do, I take Dervish\u0027s advice, get ready for bed, then slip beneath the covers. Dervish sits in a chair by the circular window, keeping watch, protecting me, just as he did when I first moved into this house. Maybe it\u0027s his calming presence, or maybe it\u0027s simple exhaustion, but within minutes, despite everything, my eyes droop and I slip into unconsciousness.\n Just before I go under completely, I remember the one thing I didn\u0027t tell Dervish about-the blood disappearing from beneath Loch\u0027s head. I don\u0027t think it\u0027s important, but he should be told just in case I\u0027m wrong. I try to rise but it\u0027s too late, I\u0027m too far gone.\n Dreams.\n I jolt awake. My eyes snap open and I lurch upright in bed. But it\u0027s not like waking from a nightmare. No racing heart or after-images of a bad dream. It\u0027s more like somebody jabbed me with a blunt knife and stung me out of sleep.\n I stare around, confused, not sure why I woke so quickly. Then I see that Dervish is gone. That\u0027s probably what disturbed me-he slipped out for a few minutes, to fetch something, go to the toilet, change clothes or whatever, and I sensed him leave. It alarmed me and I jerked awake. Simple.\n I start to lean back, half-smiling, then stop. There\u0027s more to it than that. Something\u0027s wrong. I have the sense of being in danger.\n I get out of bed warily and pad to the doorway. There\u0027s a light in the corridor at the top of the staircase. I slip out of my room and make for the light. The house is warm-Dervish hasn\u0027t turned the heating off.\n I think of calling Dervish\u0027s name but don\u0027t. If we\u0027re not alone, if we\u0027re under attack, I don\u0027t want to tip off our enemies. I don\u0027t think the situation is that grave-the sense of danger isn\u0027t overbearing-but it pays to be cautious.\n I reach the wide, ornate staircase which links the three floors of the mansion. Darkness below. A dim light above, coming from the direction of Dervish\u0027s study. I home in on it.\n Moments later I\u0027m standing outside the study door, which is ajar. Dervish normally shuts the door, but tonight he left it open, probably because of the heat. He\u0027s talking on the phone. If the door had been shut, I couldn\u0027t have heard what he was saying. Open like this, I can hear him perfectly.\n \"Yeah,\" he grunts softly, \"I know.\" A pause. \"I don\u0027t think so. I didn\u0027t explore it fully, but...\" Another pause. \"That\u0027s why I said I don\u0027t think so. I\u0027ll go back tomorrow, check it properly and... Yes. No. No. They said there was definitely no one else there.\" A pause. \"Of course I can\u0027t be certain. I wasn\u0027t there. But I trust them. We\u0027re safe. I\u0027m as sure as I can be, without being one hundred per cent.\"\n Dervish fidgets on his chair. I think he\u0027s maybe heard a sound and is coming to check. I start to back away but then he speaks again.\n \"Just let him know what happened.\" A pause. \"Yes, I know the consequences if... Yes!\" Snappish now. \"I\u0027m not a fool and I\u0027m not new to this. In my opinion we\u0027re safe. But only one person can confirm that. And he will when he comes. But he can only do that once you get off the phone to me and pass on the message.\" A pause. \"I know he\u0027s not easy to get in touch with. I know I\u0027ll have to wait. But the sooner you start, the...\"\n Silence. A long pause this time. I hear Dervish tapping the desk with his fingers. Finally, softly, he says, \"He\u0027s like my son.\" I stiffen and move forward a few centimetres. \"Of course, if the worst comes to... Yes, I know. I know. But I\u0027m hoping...\" Dervish sighs. Another long silence.\n If I lean forward I can see him. There\u0027s a black folder on the desk close to his hand.\n \"I have the numbers,\" he says quietly. He stops tapping and draws the black folder closer to him. Doesn\u0027t open it. \"Yes, I can do it. I have the strength. If there\u0027s no other... if it comes to it.\"\n Another silence, which Dervish breaks curtly with, \"Just tell him. You do your job, leave me to worry about mine.\"\n He slams the phone down and gets up.\n I race back to my room. Dive under the covers. Pull them up over my chest. Try to look like I\u0027m sleeping.\n Dervish returns. Checks that I\u0027m OK. Sits in the chair again. I lie very still, eyes closed, listening intently. Finally, after several long minutes, there\u0027s the sound of light snoring.\n I sneak out of bed. Tiptoe past the dozing Dervish. Head back upstairs in the dark, not turning any lights on. I think I know what was in that black folder and why I woke with the sense of danger. But I want to make sure. I couldn\u0027t see clearly. There\u0027s a slim chance it was something else.\n The study. The door\u0027s still open. I slip inside, gently shut the door, find the desk in the dark and turn on one of the smaller lamps. The desktop lights up. The folder\u0027s still there, close to the phone, black as the cave was.\n I pick it up and cradle it in my hands, staring at the blank cover, knowing what I\u0027ll find when I open it, praying to whatever gods there are that I\u0027m wrong.\n Then, with a snap, I flick the cover back. I find several pages, a handful of names, addresses, phone numbers and e-mail addresses on each. And at the top of the first page, not in large letters, bold print or underlined, but standing out anyway, as if they\u0027d been burnt into the paper and were still aflame, the two words which confirm all that I feared.\n The Lambs. \n","sourceLink":"https://allnovel.net/blood-beast-the-demonata-5/page-10.html","bookId":2179,"book":{"id":2179,"title":"Blood Beast (The Demonata #5)","description":"Storyline: \n Blood Beast (The Demonata #5) \n \"Locked inside Dervish\u0027s study. Breath coming quickly, raggedly. Trembling wildly. I still feel sick and dizzy, but maybe that\u0027s fear. I force myself to breathe normally, evenly. When I\u0027m in control, I study my reflection, looking for telltale signs. Am I turning into a werewolf? I don\u0027t know...\" \n Grubbs Grady has so far escaped the family curse, but when he begins to experience alarming symptoms at the onset of the full moon, he is scared that the jaws of fate are opening and about to swallow him whole. \n He has cheated death, defeated demons, moved on with his life. But Grubbs is torn between the world of magic and his wolfen genes. Can he fight the beast inside or will he fall victim to his tainted blood?\n \n","cover":"https://allnovel.net/images/blood-beast-the-demonata-5.jpg","author":"Darren Shan","type":"Horror","source":"allnovel","link":"https://allnovel.net/blood-beast-the-demonata-5.html","creation":"Oct 5, 2019 8:58:25 AM","modification":"Oct 5, 2019 6:45:43 PM"}}
