{"id":99693,"no":15,"title":"Page 15","content":"The shakes. Bad. Dervish and Juni keep me pressed down on the bed, talking constantly, wiping sweat from my face with a series of fresh towels, Juni muttering calming spells which don\u0027t make the slightest difference. Friday. The night before the full moon. The sickness struck at school, in the middle of physics. I had to rush for the toilet. Didn\u0027t make it. Was violently sick against the classroom door. Lots of cheers from the boys, gasps of disgust from the girls. Didn\u0027t stop to catch an earful from Mr. Clifford. Bolted for the toilet and spent the next ten minutes hugging a hard plastic seat. Juni drove me home. I threw up twice into a bag along the way. I\u0027ve had the dry heaves since then, though Juni makes me drink lots of water, so sometimes I vomit clear, acidic liquid. \"You\u0027re going to be OK,\" Dervish lies, grasping my shoulders as I cry out in pain. It feels as if there\u0027s a second body growing within mine, forcing its way out. \"I could try a sleeping spell,\" Juni says. \"Don\u0027t be stupid,\" Dervish barks. \"The only reason he hasn\u0027t turned is because he\u0027s fighting so damn hard. He can\u0027t fight if he\u0027s asleep.\" \"Sorry. I wasn\u0027t thinking. I just hate to see him in so much agony.\" I scream hoarsely, sure my head is about to split down the middle. Dimly aware of a heat in my stomach, the magical heat which was there last month. It\u0027s battling the wolfen change, keeping me human, denying the demands of the beast. Unable to tell Dervish and Juni about it. Incapable of speech. Only screams. Later. The moon starting to dip. Moments of quiet after hours of madness. The sheets of the bed are ripped in many places. Dervish is cut above his left eye and both his cheeks are bruised. \"Did... I do... that?\" I groan. \"No,\" he deadpans, carefully pouring water down my throat. \"I walked into a wardrobe.\" \"We thought we\u0027d lost you,\" Juni says, squeezing my hand. I\u0027ve scratched her forehead but it\u0027s not a deep cut. \"The... magic,\" I gasp. Both of them pause. \"Did you... feel it?\" \"No,\" Dervish says. \"It was... there. That\u0027s how... I fought. Would have... turned... otherwise.\" \"Juni?\" Dervish asks. \"I sensed something,\" she says hesitantly. \"I wasn\u0027t sure if it was magic or the energy generated by the... the alteration.\" \"The werewolf,\" I grin weakly. \"Go on, say it, just once.\" \"There\u0027s no such creature,\" Juni huffs. I start to reply but pain strikes again, deep in my gut. I double over. The water comes up almost as quickly as it went down. Hits Dervish hot in the face. He ignores it and pins me to the bed, talking fast again, trying to comfort me, his words only a dim murmur above my endless, wretched screams. The beast snarls and claws at my skin from the inside. It can\u0027t speak-it\u0027s a wild animal-but I can sense its feelings and translate them into words. Release me, it would demand if it could. End the pain. Set me free. Become what you must. We can run as one and take the night. \"No!\" I howl back, clubbing it down with fists of a magic I don\u0027t understand. You can\u0027t deny me. \"Get stuffed!\" is my eloquent response. The internal battle rages on but I have the sense that I\u0027m winning. The pull of the moon is fading. The creature has lost the fight. But there\u0027s another night to come and it will be stronger then. Perhaps too strong. You can\u0027t deny me, the beast hisses again from somewhere deep inside me, deeper than it should be. This is what we are. It\u0027s our fate. \"I\u0027ll choose my own fate,\" I mutter, staying on guard, ready to fight again if it launches a last-minute attack. But it doesn\u0027t. The sun is rising. The moon\u0027s losing its lustre. I\u0027ve won-for now. Wearily sitting up. Dervish and Juni regard me suspiciously. Both exhausted. Cut, bruised and scratched in many places. \"What happened to you two?\" I quip. \"Now he gets cocky,\" Dervish growls. \"For the last eight or nine hours it\u0027s been screams and agony, hell on Earth. But now, with the sun rising, you feel like you can joke, regardless of the agony you\u0027ve put us through.\" We regard each other coolly-then laugh. \"We survived!\" I shout. \"You beat it!\" Dervish chortles, hugging me tight. Juni just smiles tiredly, watching us. When Dervish releases me, I collapse backwards and stare at the ceiling. \"How do you feel?\" Dervish asks. \"Or is that a stupid question?\" \"No,\" I sigh. \"I don\u0027t feel so bad. Tired, but not as beat as you or Juni look. To tell the truth, I\u0027m hungry.\" \"If you\u0027re expecting breakfast in bed, you\u0027re in for a nasty surprise,\" Juni snaps. Dervish and I giggle. \"It was strange,\" I mumble, recalling my battle, especially the end when I imagined the beast speaking to me. \"Like I was wrestling with another person-a thing-inside myself. But really wrestling. Like it was there physically. My body was a ring and there were two of us inside the ropes. It was the hardest fight of my life.\" \"No piece of cake for us on the outside either,\" Dervish says, touching his bruised cheeks. \"You put us through the wringer. I know you\u0027re a colossus in the making, but I wouldn\u0027t have credited you with that much strength.\" \"It would have been worse if the beast had won,\" I tell him quietly. \"I could feel it. So strong. Without the magic, it would have walked all over me, burst loose, torn into you. Tonight... when the moon\u0027s full...\" \"Don\u0027t think about that. We\u0027ll take this one fight at a time. Focus on the victory now. Deal with the next bout when we\u0027re faced with it.\" He stands, stretches and groans. \"Go to bed.\" Juni smiles. \"You worked hard and took most of the blows. We both need to get a lot of sleep today, but you more than me.\" \"I\u0027ll be fine,\" Dervish says, then wobbles on his feet and almost falls. Juni steadies him, then says firmly, \"Bed!\" \"Yes, miss,\" Dervish sighs. \"You coming?\" \"Soon. I want to sit with Grubbs a while longer.\" Dervish leaves, rubbing the small of his back and groaning. Juni watches him go, then examines her wounds. Murmuring spells, she brushes her fingers over the light cuts on her arms. They heal swiftly, the flesh closing neatly, only the slightest lines of red giving away the fact that she\u0027d been scratched at all. \"Neat trick.\" \"A useful spell.\" She works on her neck and face. \"It\u0027s no good on deep gashes but it\u0027s perfect for little rips like these. Better than plasters or bandages. I\u0027ll tidy Dervish up later.\" Finishing, she turns her attention to me. Wipes hair back from my eyes. Heals the scratch on my forehead. Rubs the flesh to make sure it\u0027s OK, then says softly, \"He was terrified. I was too, but not as much as Dervish. He really loves you.\" \"I know.\" \"He\u0027d give his life for you if it would change anything.\" I stare at her silently. There are tears in her eyes. I instinctively know why she\u0027s saying this, defending him when there\u0027s no apparent need. \"He called the Lambs,\" I whisper. She nods miserably. \"I got him to admit it. He didn\u0027t want to involve them. But if you turn, you have to be killed. He can\u0027t do that, not kill his own nephew. So, as much as he hates them...\" \"It\u0027s OK,\" I tell her, forcing a weak smile. \"He didn\u0027t have a choice.\" \"I suppose.\" She sighs, lowering her gaze. \"I had a son once.\" I blink, not sure how to respond to this startling, unexpected confession. \"A darling boy. He was my world. Died in his sleep a few months before his second birthday. A brain defect. There were no warning signs. Nothing anybody could have done about it.\" She breaks down in tears. I pat her back clumsily, wishing I could wash her hurt away with words, feeling as useless as I\u0027ve ever felt. Finally she regains control and wipes her cheeks dry. \"It almost destroyed me,\" she croaks. \"I survived, but only just. Became a child psychologist so I could be close to other children, ease my pain by helping them with theirs.\" She laughs hoarsely. \"I once said you were psychologically plain. Well, I\u0027m an open book too. Whenever anything goes wrong in my life, I hide behind work, use it to haul myself out of whatever dark hole I\u0027ve fallen into.\" She takes hold of both my hands and squeezes, stronger than I imagined. \"When Dervish asked me to move in, I was delighted, not just because I love him, but because it meant I could become a mother to you.\" She lets go of my left hand and strokes my cheek, smiling warmly. \"I\u0027ve always wanted another son to mother but it never quite worked out until now.\" The smile fades. She lets go of my other hand and stands. \"I won\u0027t abandon you,\" she says, her voice throbbing with surprising menace. \"I won\u0027t give you over to the Lambs, not unless there\u0027s no hope at all. I\u0027ll stand by you until the very, very end. Even if Dervish doesn\u0027t.\" Then she\u0027s gone, leaving me to stare after her, jaw slack, senses whirring, not quite sure what to make of her fiercely supportive vow. A day of rest. We all sleep until early afternoon and lounge around after that. Juni\u0027s oddly distant, withdrawn and quiet. Doesn\u0027t look at me straight. Or Dervish. Almost as if she\u0027s ashamed of what she said. Or is planning something and doesn\u0027t want us to know. Evening. The shakes again. Throwing up everything I\u0027ve eaten. I fight my vomitous body, sitting on the grass out back, taking the warm evening sun, determined to enjoy what might be my final sunset. Dervish and Juni are close by. Dervish asks if I want to go in. I shake my head. Don\u0027t want to abandon the outside world. Afraid that once I do, that\u0027s it, game on... game over... doomed. Bill-E rang earlier. Wanted to come and hang out. Dervish made my excuses. Said I\u0027d caught a nasty bug. Told Bill-E to stay away in case it was contagious. Bill-E wasn\u0027t suspicious. Why should he be? Thinking about my brother. Wishing I\u0027d told him about us. Dervish was right-I waited too long. I wanted to spare him the emotional roller-coaster ride of the truth, but I was wrong to stall. If I change tonight and the Lambs exterminate me, he\u0027ll only think he lost a friend. He\u0027ll never know how close we really were. I consider phoning him, telling him the truth while I\u0027m still capable of speech. But that would be lunacy. If I survive, beat this thing or at least delay my transformation for a month, I can tell him then. Phoning now would be pointless. Worse-dangerous. He might come over. Get in the way. Fall victim to the blood-crazed beast I might by that stage have become. \"Do you still have the cage?\" I ask suddenly. Dervish stops talking to Juni and stares at me. \"The cage in the secret cellar. Is it still there?\" He nods slowly. \"Put me in it.\" I thought my voice might quaver but it holds firm. I stare at him unflinchingly. \"If you start to change, we can-\" he begins. \"No,\" I interrupt. \"Do it now. Before I turn. I made a mess of you last night. I hurt Juni too. She was able to fix us up, but I\u0027ll be stronger tonight. Wilder. Maybe I\u0027ll inflict damage she can\u0027t cure.\" Dervish is silent. He exchanges a look with Juni. \"That could be detrimental,\" Juni says softly. \"You believed in yourself last night. That belief gave you the strength to fight. If you allow yourself to be caged like an animal, perhaps you\u0027ll start thinking of yourself as one. You might stop believing... stop fighting.\" \"I won\u0027t.\" \"It might be for the best,\" Dervish mutters. \"If he does turn, I\u0027m not sure we can control him.\" \"You have drugs,\" Juni says. \"You can subdue him if you have to.\" \"Remember Meera?\" I say before Dervish can answer. \"When Bill-E changed, he got to her. Knocked her out before you could inject him. Almost killed her. If that happens to Juni...\" Dervish\u0027s jaw stiffens. \"You\u0027re right. It has to be the cage.\" He takes Juni\u0027s hand. \"It doesn\u0027t mean we\u0027re giving up. We\u0027re just being safe.\" She nods reluctantly and looks at me. Her expression communicates the same thing that she promised earlier-\"Trust me. I\u0027ll stand by you. Even if Dervish doesn\u0027t.\" I rise quickly. \"Best do it now.\" I take one last look at the sun. \"The moon will be up soon.\" I put my hands on my growling stomach. \"I can feel it.\" The cage. Howling. Screaming. Battering the bars. Dervish and Juni on the other side, roaring encouragement, telling me I\u0027m winning, calling to the human within, the one who\u0027s rapidly disappearing, giving way to something new, deadly, beastly. I fight but it\u0027s much harder than last night. The beast is stronger. It assaults me without pause, snapping and growling, hurling itself against the ball of magic that is my only protection, ripping into it, howling bloody murder, hell-bent on breaking free to run wild and kill. I grip my head between my hands and scream, veins in my neck stretched, fingers curling inward into claws. I keep shouting my name, trying to hold on to my voice, but all that comes out is a jumbled snarl. And the light around me is changing, becoming darker, the shades more limited, colours fading to grey. \"Not... going... to... turn!\" I bellow, having to fight for each word. I let go of my head. Clutch the bars of the cage. Lock gazes with Dervish, then Juni. \"Not... going... to...\" The last word becomes an inhuman shriek. \"That\u0027s right,\" Dervish shouts desperately. \"You won\u0027t turn. You\u0027re Grubbs Grady. You\u0027ll win this fight. Gradys never lose.\" \"Keep fighting,\" Juni pleads. She puts her hands over mine. \"You can do it. I know you can.\" I fall away from the bars, shaking my head, roaring with pain. The beast cackles. The battle continues. Torment claims me whole. I\u0027ve been fighting for hours. At least I think it\u0027s hours. Maybe it\u0027s just been minutes. Maybe I\u0027m so far gone that I\u0027ve lost track of time. Perhaps, for me, this night will last an age, never-ending, an eternal fight between humanity and a force of wolfen evil. I slump on the floor, leaning against the bars of the cage, staring around with wide, wild eyes, seeing the main desk, the key to this cage, candles, books, a chess piece in one corner, left over from my last fight here. My skin feels like it\u0027s rippling. I want to let it. I\u0027m tired. I can\u0027t go on. You must. A new voice. Not my own and not the imagined voice of the beast. The voice of magic. It speaks quickly, softly, telling me we can beat this thing if we work together. It starts to explain how I can use it, the spells I need to cast, the words I must chant-but the beast picks that moment to yowl violently, filling my head with white noise, causing me to jam my hands over my ears and scream. When the noise passes and I lower my hands, the voice of the magic is gone, or is so quiet I can\u0027t hear it. I\u0027m not alone. I still sense it there. But I no longer feel like it can help me. I\u0027m losing this battle. Maybe I\u0027ve already lost and just don\u0027t know it yet. More fighting. Pain. Terror. Another rare moment of rest and understanding. On the opposite side of the cage this time, but in the same slumped position as before. Dervish and Juni are crouched close by, telling me how well I\u0027m doing, how proud they are, I\u0027m going to win, I just have to ride it out. I turn my head a fraction and smile sadly at Dervish. \"Sorry,\" I croak. \"No,\" he snaps. \"You can\u0027t give up. You have to beat this thing.\" \"Sorry,\" I mutter again, head dropping, panting hard, crying, tears hot on my cheeks, not feeling like they\u0027re mine. \"He\u0027s slipping from us,\" Juni says. She sounds much calmer than my uncle. \"No!\" Dervish barks. \"I won\u0027t let him. We have to-\" \"Quiet,\" Juni commands. \"But we can\u0027t-\" \"We won\u0027t.\" She reaches in and tilts my head back. It takes a few seconds but my eyes finally focus. She\u0027s studying me coolly. \"He\u0027s losing concentration. We have to help him regain it. Jolt him back into action and spur him on to fight.\" \"How?\" Dervish asks tightly. \"A spell. One to act on the magic within him. It will be like injecting him with adrenaline-only it\u0027s magic we\u0027ll inject into, not flesh.\" \"What spell?\" Dervish growls. \"I don\u0027t know any-\" \"I\u0027ve been preparing one,\" Juni cuts in. \"Just in case.\" She looks away from me and trades gazes with Dervish. \"It\u0027s dangerous. If it doesn\u0027t cure him, it will kill him. I didn\u0027t want to use it unless absolutely necessary. I still won\u0027t, not unless he slips further and concedes more ground to the... werewolf.\" She smiles fleetingly as she says it. Then her expression firms again. \"I won\u0027t do it if you object, but I want you to know it\u0027s there if we need it. And I have to know if you\u0027ll consider letting me use it, so I can finish preparing.\" Dervish looks lost, like he wants to cry. For a moment I don\u0027t think he\u0027s going to respond. But then, with a wrenching effort, he nods stiffly. \"But only if there\u0027s no other choice,\" he wheezes. \"Of course.\" Juni touches his cheek lovingly. \"You\u0027ll need to go to the house. If I proceed with the spell, there are things I\u0027ll need.\" \"What?\" Juni closes her eyes. A couple of seconds pass. She opens them again. \"Got it?\" \"Yes.\" Dervish laughs crazily. \"You\u0027ll have to teach me how to do that.\" Then he stumbles for the door leading to the wine cellar. Juni waits till he\u0027s gone, then hurries to the desk, grabs the key to the cage and inserts it in the lock. \"What are you doing?\" I mumble, backing away from her as she opens the door and enters my lair. \"Get out. It\u0027s not safe. I could-\" \"The Lambs are outside,\" Juni says, stooping beside me, taking my hands, helping me to my feet. \"Dervish was in contact with them earlier. They have the house surrounded. Ready to finish you off when Dervish gives the word.\" I shrug wearily. \"Maybe it\u0027s for the best. I can\u0027t be helped. They-\" \"No!\" Juni hisses and slaps my face. \"I won\u0027t let you sacrifice yourself. I don\u0027t believe you\u0027re lost. We can get through this but only by thinking positively, only if you fight. Dervish doesn\u0027t understand. He called this wrong. He loves you but he underestimates you. He doesn\u0027t know how strong you are.\" \"No. I\u0027m weak. I can\u0027t fight anymore. I just want to let it happen. Simpler that way. I\u0027m sick of all the pain.\" \"I don\u0027t care how sick you are!\" Juni snaps. Then her voice changes. \"I\u0027m not doing this just for you. I want you to live for me too.\" She grabs me by the front of my jumper, pulls me in close and kisses me. It starts innocently, the way my Mum used to kiss me when I was little and woke up scared in the middle of the night. But then it changes into something deeper and I kiss her back, the way I kissed Reni when we played spin the bottle. The beast within me howls as we kiss. The magic surges and seethes. Around us the bars of the cage turn red, then crack and melt, tumbling away. The roof of the cage falls upon us. I swat it aside with a single powerful hand. Juni releases me. She\u0027s breathing hard. \"Run, Grubbs,\" she says, eyes bright, cheeks flushed. \"Get away from the Lambs. Go the cave. Wait for me there.\" \"The cave? But... if I turn...\" \"You won\u0027t,\" she vows and kisses me again, quickly this time. \"Go!\" Without thinking, I bolt. Leaping over the bubbling bars of the cage, I race to the other exit, the one that leads away from the house. I tear the door open and flee up the stairs. Juni cheers encouragingly behind me, then laughs, her laughter trailing me, staying with me, comforting me, urging me on. The top of the stairs. The way ahead blocked by a pair of doors, locked from the other side by chains, covered by a sheet of corrugated iron. I pause for the briefest of seconds, then set my right shoulder to the doors and thrust sharply. The chains snap. The doors explode open. The sheet of iron flies clear. I emerge into moonlight. Standing in the open, chest rising and falling rapidly, staring around, seeing the world with eyes one third human, one third animal, one third magic. Picking out shapes, even if they\u0027re hidden from direct sight by trees or the house. Nine... ten... eleven... twelve. The dirty dozen. But not dirty enough to hold Grubbs Grady-��ber-escapee! The beast in me wants to attack, rip them open, teach them not to mess with the Grubbster. But tempting as that thought is, I push it away and break for the forest instead. There are three members of the Lambs back here. The unexpected shattering of the doors stunned them. But they recover quickly. Their training kicks in and they move to intercept me. Large men with clubs, stun guns, nets, rifles. \"Halt!\" one of them shouts, aiming a rifle. I snarl at his gun and it turns bright red. He screams and tries to throw it away. Fails, because it\u0027s burnt into his flesh and welded itself to the bones in his hand. The second Lamb rushes me, tries to bring me down with a rugby tackle. I grab him as he leaps, spin him round in the air, then slam him down hard, knocking him out-a perfect wrestling move. Loch would be proud. If I had time, I\u0027d pin him for a three count. But as powerful and playful as I feel, I can\u0027t linger. If the rest of the Lambs converge, things might not go so smoothly. I think I could take them all on and beat them but it would be stupid to put myself to the test. The third of the rearguard has fumbled out a walkie-talkie and is barking into it. I growl in his direction. Metallic claws sprout from the hard plastic and dig into the flesh and bones of the Lamb\u0027s face. Roaring with shock and pain, he tries jerking the walkie-talkie loose but the claws have dug in too deep, wiring the device to his jaw. I leave the Lamb stumbling around, screaming, tugging at the walkie-talkie, blood pouring from his ear and cheek. I race for the cover of the trees, moving swiftly, surely, feeling more alive than ever before. As I reach the forest I spot the tramp standing nearby, watching me. I laugh at him-he saw what happened to the others and is too scared to tackle me. I think about turning his legs to jelly or setting his clothes on fire, but since he\u0027s not interfering with my escape, why bother? The spineless creep isn\u0027t worth the effort. I want to shout, \"So long, sucker!\" but my vocal cords are twisted and words won\u0027t form. I settle for a mock salute instead. He stares back silently, face impassive. Then I\u0027m gone, sheltered from the moon and hidden from the remaining Lambs by the trees. Running with the ease of a wolf. Fast and slick, leaving no trail for anyone to follow. Heading for the cave and my reunion with Juni.","sourceLink":"https://allnovel.net/blood-beast-the-demonata-5/page-15.html","bookId":2179,"book":{"id":2179,"title":"Blood Beast (The Demonata #5)","description":"Storyline: Blood Beast (The Demonata #5) \"Locked inside Dervish\u0027s study. Breath coming quickly, raggedly. Trembling wildly. I still feel sick and dizzy, but maybe that\u0027s fear. I force myself to breathe normally, evenly. When I\u0027m in control, I study my reflection, looking for telltale signs. Am I turning into a werewolf? I don\u0027t know...\" Grubbs Grady has so far escaped the family curse, but when he begins to experience alarming symptoms at the onset of the full moon, he is scared that the jaws of fate are opening and about to swallow him whole. He has cheated death, defeated demons, moved on with his life. But Grubbs is torn between the world of magic and his wolfen genes. Can he fight the beast inside or will he fall victim to his tainted blood?","cover":"https://allnovel.net/images/blood-beast-the-demonata-5.jpg","author":"Darren Shan","type":"Horror","source":"allnovel","link":"https://allnovel.net/blood-beast-the-demonata-5.html","creation":"Oct 5, 2019 8:58:25 AM","modification":"Oct 5, 2019 6:45:43 PM"}}
