{"id":44244,"no":18,"title":"CHAPTER II","content":"HURRYING down through the grounds, and vaulting over the low boundary fence, Dearing approached the gate of the Barry cottage just as Dora came out. Pretty as she had been in girlhood, she was rarely beautiful as a fully developed woman. And to-day, as ever, Dearing stood before her in absolute awe of her rare, exquisite, and appealing personality. “She’s had another attack, Wynn!” Dora said, with a brave effort to steady her faltering voice. “I really thought she was dying, and I suppose I screamed. She looked so bad for a few moments! Her face turned purple, and she lost consciousness. She came to herself a moment ago, and is still awake. Will you see her?” He went to the sick woman’s room on tiptoe. Seated in a chair at the head of the bed, and waving a palm-leaf fan to and fro, to keep the flies from his grandmother’s face, was Lionel, his great, serious eyes, so like his mother’s, filled with anxiety. He rose as Dearing entered, and moved round to the other side of the bed, but he still waved the fan and stood staring anxiously. “I thought I was gone that time, Doctor Wynn,” Mrs. Barry said, with a wan smile, as he took her hand to test her pulse. “Well, you certainly are far from it now,” he laughed, reassuringly. “I believe it would take a regiment of soldiers to put you out of business. That was only a fainting spell brought on by too close confinement to the house. You must get out more; that’s all you need. Now, take a good nap and you will be all right.” He nodded and smiled reassuringly at Dora, who stood at the foot of the bed. She followed him from the room, seeing that he wished to speak to her. “She is all right now,” he told her. “She is doing very well. It is only a sluggish liver, due to lack of exercise. Let her sleep as long as she will now, and I’ll send you a tonic which will brace her up. There is nothing really to fear. She has a splendid constitution in all other respects.” Dora sank into a chair as if utterly overcome with relief, and he stood looking at her in blended admiration and sympathy. Aside from her beauty of face and form, there was a ripeness of intellect and character in her face, which had come to her from the years of isolated suffering which she had undergone. “You are so kind to me, Wynn,” she said, with a faint, sad smile. “You have always been the best friend we ever had.” “Why, what are you talking about?” Dearing said, lightly and with a flush. “Any other jack-leg country doctor would have taken care of you fully as well.” “You have done hundreds of thoughtful things,” she cried. “You have left nothing undone that could possibly help us. Oh, you are too good! You haven’t allowed my poor mother to pay you one penny for your services in all these years. She has tried and tried to make you take it till she has almost given up in despair.” “I haven’t done anything really worth while, Dora,” he said, lightly. “You see, you live right at hand, too, and it is no trouble at all to jump over your fence and mine. I couldn’t take money from a next-door neighbor under those circumstances. You just wait until you really need a doctor, and then I’ll send in a bill as long as my arm.” “You can’t help being good,” Dora said, feelingly, her wonderful violet eyes filling. “Your great heart simply went out to us in our trouble, and you have determined to help us in every way possible. Mother thinks all the world of you, and Lionel actually believes you are some sort of god.” “Well, he’s badly fooled, I tell you!” Dearing laughed. “But speaking of him, I must lecture you good and hard. You are not treating the child at all right. He oughtn’t to be cooped up here in this little yard like he is. It is too small. A growing boy like that needs room, and plenty of it.” “Oh, you don’t understand!” Dora sighed, while a look of deepest pain tortured her mobile face. “I couldn’t bear to have him running around a neighborhood as—as heartless as this one is. He is so observant, and has such an inquiring mind, and people are so—so cruel, so utterly unforgiving. But you are trying to change the subject. You think I have no money with which to pay a doctor’s bill.” She laughed suddenly and mysteriously as she went on: “I believe I’ll let you into a secret. I’ll show you something. Come into the parlor.” She led him, with graceful step and bearing, through the little central passage of the cottage to the parlor door, and they entered together. She laughed like a merry child; it was the sweet, rippling laugh he remembered so well as belonging to his youth and hers, as she pointed to the easel before a window. On it was a good water-color picture of a child at play on the grass near a stream, with a pastoral scene sketched in the background. “Oh,” he exclaimed, admiringly, “that’s the best you’ve shown me! It is very, very good.” “That’s only one of many,” she said, shrugging her shoulders. “I wanted something to occupy my mind after I gave up music, and I began these studies merely as an experiment. I worked for a year while Lionel was a baby just to—you know, Wynn—just to forget!” He was silent, being unable to formulate any reply that was appropriate to the delicate situation, and she went on simply, and still in the winsome tone which had always appealed to him so strongly. “Then—now comes the best part—one day I happened to read the advertisement of an Atlanta dealer who was in need of such things, and I forwarded some sketches I had done. They were bad—oh, so bad—and he wrote that he would not offer them to his customers, but he encouraged me to keep on. Then I worked harder, and finally I sent him some pictures of children—little pickaninnies, brown as chestnuts, little white ragamuffins, babies in old-fashioned, crude, box-cradles like the mountain people have, and he sold them. Think of that! He actually sold them! I have not signed any of them. He has written me several times begging that I should do so, but I have always refused. He has agreed not to use my name at all, and I believe he has kept his word. The whole thing has made me—almost happy. Wynn, I saw your face after your first successful operation, and didn’t understand then what it meant to you, but I do now. The day that dealer’s letter came, and his money followed by express, in a big wax-sealed envelope—well, it was the happiest moment of my life-I sang; I talked to myself; I danced. I told Baby all about it as I hugged him in my arms. I had, as they say, discovered myself. Here I was, cut off from intercourse with everybody in my home town, but God hadn’t wholly forsaken me. He had given me something to make up for what I’d lost—a way of speaking to the big outer world.” “I see, and I congratulate you with all my heart,” Dearing said, as he stood watching the shifting tones in her expressive face. “I understand you better now. I got in the habit of listening for your piano at night, when everything was still, and I fancied I could read your various moods. A long time ago you played too sadly; really it used to get next to me, and make me worry about you; but of late there has been more hope and cheerfulness in your music, and it did me a lot of good. I understand you better now. I have always thought that creative work was the most satisfying and uplifting occupation possible, and now I am sure of it.” “And I am getting better and better prices, too,” Dora said, modestly. “My agent sends my things everywhere, even to far-off New York and Boston. I don’t do them so fast now, for I try harder and I think they are better. Now, you will send me your bill, won’t you?” “I shall certainly be hoping that somebody will get really sick under this roof,” he laughed, evasively, “for I’d like to get a whack at your roll of cash, but so far my dealings have been only with your mother, and she doesn’t make it interesting. She was good to me when I was a boy. I used to crawl over the back fence when she was making jelly and jam in the kitchen, and I collected some fees then that did me more good than any I have since received. She performed the first surgical operation on me, too, that I ever had. I was barefoot, and while trying to hide from some other boys I stuck a rusty nail through my big toe. She heard me yelling and came to my assistance. She extracted the nail, washed out my wound, filled it with turpentine—the only household antiseptic used in that day—and bound it up for me. I have always believed that she saved me from lockjaw.” “The opportunity to earn money means more to me than you might think, Wynn,” she said, her eyes lighting up. “Do you know what my dream of dreams is? It is to be able to go to Paris, and take Lionel and my mother. She has always wanted to go, because papa was buried there. Do you know, I feel that away off in a free, art-loving country like France I could rear my child to manhood without his ever knowing about his—his history. It seems to me that God has given me this talent for that particular purpose. The only trouble is the delay. You see, it may be years before I can save enough, and then it might be too late.” “I see, I understand,” Dearing said, gravely; “and you’d never come back to old Stafford again, I suppose?” “Oh no,” she answered; “all this would have to be laid aside forever.” “I shouldn’t like to see you go,” he said. “I have—you see, I have become attached to Lionel—he and I are great chums. But if you have decided, and wish it so very much, why not? Look here, Dora, I have money lying idle in the bank. I have absolutely no need for it, and—” “Oh no!” she cried. “It is lovely of you to offer it, but I couldn’t think of taking it. I couldn’t—I really-couldn’t!” “Not from your big brother?” he asked, his pleading eyes on her. “No, not even from you, you dear boy. It is my problem, Wynn, and I must work it out alone—all alone.” They had gone back to the porch, and the sight of the extensive grounds around his house prompted him to say: “I know now why you don’t realize Lionel’s need for more fresh air. You have that absorbing occupation, and it keeps you from putting yourself in the boy’s place, as you might otherwise do.” “Do you think so?” she asked, quite gravely. “It may be true, Wynn, and yet what am I to do? I really can’t bear to have him running about, meeting other children. I could never answer his questions—never, never! Some one would have to watch him, and mother and I both shrink from going out in—in public.” “I was thinking of that, too,” Dearing replied, “and that is why a certain plan occurred to me. There is that big lot of mine right over the fence. Nothing could possibly happen to him there. It is quiet, and there are many things he could amuse himself with. It is really like a little farm, you know. We have chickens, ducks, turkeys, puppies, kittens, pigs, and horses, and even a cow and a calf about the barn, to say nothing of the pigeons that nest in the hay-loft. To a child, judging by my own memory of boyhood, it would be a regular paradise.” “You don’t mean that you would allow—that you would—” There was a catch in the young mother’s voice; a tinge of anxious pallor crept into her appealing face. “Oh, Wynn, you are too kind! You are thinking only of helping me. There is your uncle and your sister—I could not bear to trust my darling where he might not be—wanted.” “I know my uncle and sister better than you do,” Dearing said. “Margaret has never seen Lionel that I know of, but she would love to make him happy. As for my uncle, he greatly admires the little fellow, and would be delighted to have him come and romp over the place to his heart’s content.” “Oh, how you tempt me!” Dora cried, covering her face with her shapely hands. “Of all things, I can think of nothing right now that I’d like better than that. I have been trying to forget Lionel’s confinement in this little yard and house—trying to convince myself that he is wholly happy only with mother and me, but it is no use. It is really pitiful to think of. He has a wonderful imagination, and he sometimes sits here on the porch and tries to picture to himself what the inside of a big house like yours is. He thinks you all must be kings and princes like those in the fairy-tales we read to him. He asked me one day if we’d ever have a home like yours, and when I told him I didn’t think so, he answered, ‘Then God isn’t so very good, after all, is He?’ I tried to get him to explain what he meant, but he only shook his head and went to play in the yard.” At this moment the boy himself came from his grandmother’s room, along the passage, and out to them. “She is still asleep,” he announced, gravely. “I drew the netting over her face, so that the flies won’t wake her.” “That’s right—that’s a good boy.” Dearing rested his strong hand on the golden head and looked down into the child’s face, and then he laughed as he caught the boy’s arm and taught him how to contract his muscles. “You’ll be able to protect yourself, young man,” he said. “You have a splendid arm and fist already. I’d hate to have those knuckles try to knock a fly off my nose and miss the fly. Say, kid, do you see that big lot of mine beyond the fence? Well, you are going to play over there from morning to night: climb the trees, build houses out of that pile of old bricks. I’m going to have a swing put up for you to the highest limb of that big oak, and I’ll make you a see-saw and a flying-jinny, and you may feed my puppies and cats.” The boy’s eyes danced as he stared eagerly. Dora was looking away, her handkerchief pressed to her face. Dearing saw a wave of emotion pass through her, but she remained silent. “But I couldn’t go over there!” Lionel sighed. “You are very kind, but my mother always wants me to stay at home.” “She is going to let you come, because I asked it as a special favor to me,” Dearing answered. “I’m the doctor, you know, and my orders go on this ranch.” Wonderingly, the boy leaned across his mother’s lap, and put his arm around her neck. “Is he joking, mother dear?” he inquired, and he held his breath in visible suspense. “Does he really mean that I may play over there?” “Would you like it, darling boy?” Dora asked. There was a tremolo in her voice, and she kept her handkerchief to her eyes. The child started, looked suspiciously at Dearing, and then, leaning toward his mother, he firmly uncovered her face. He saw traces of tears, and stood erect. There was a fierce, angry flare in his eyes, his lower lip quivered, as he turned upon Dearing and blurted out: “She is crying! What did you say to her?” “Oh, I see!” Dearing jested. “You want to have it out with me, do you? Well, you pick your weapons, old chap, and I’ll be your man. I won’t take a dare from you or anybody else.” Dora’s arms enfolded her child and pressed his hot cheek passionately to hers. “Yes, I was crying, my baby,” she gulped, “but it is because I am so happy. It is very good of Doctor Wynn to ask you to go. Would you like it?” “If you wished me to,” the boy replied, slowly, as he still uneasily studied her face. “I should like it very much,” Dora said—“very, very much! You could have such a splendid time over there.” “Would you love me just the same—just exactly the same—if I went?” the boy asked, anxiously. “Just exactly the same.” Dora laughed as she caught Dearing’s glance, and remarked to him, in an undertone: “He is such a strange child! Mother says she has never seen one so peculiarly sensitive and concerned over trifles. He often comes in from his play for nothing else than to ask me if I still love him. The slightest change in my manner or tone of voice always brings out that one question. It is the last thing at night and the first thing in the morning. If I am at all impatient with him, when I am absorbed in my work, he will come and sit on the floor at my feet, and nothing will satisfy him till I have taken him in my arms and said over and over again that I love him.” “It is his nature,” Dearing said, as he was turning to leave. “Well, remember, my boy, that my gate is not locked, and if you don’t come over in my big lot, I’ll come and ride you there on my back, like a two-legged horse; and I might get scared and kick up my heels and dump you over on your head.”","sourceLink":"http://novel.tingroom.com/jingdian/1728/50703.html","bookId":1132,"book":{"id":1132,"title":"The Redemption Of Kenneth Galt","description":"简介： YOUNG Doctor Dearing sat in the little church at an open window through which he had a partial view of that portion of old Stafford which stretched out desultorily toward the east. Immediately in front was a common fairly well covered with grass and...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1728","creation":"Aug 1, 2019 12:24:25 AM","modification":"Aug 1, 2019 12:24:25 AM"}}
