{"id":44258,"no":32,"title":"CHAPTER XVI","content":"TOBY LASSITER returned from the West one sultry evening at dusk, and went straight to the house of his employer. He found the banker seated on the front porch without his coat, and cooling himself with a big palm-leaf fan. “So you are back?” he said, casting a furtive glance over his shoulder into the unlighted hall. “Get that chair and pull it up close. If my wife happens to come out while you are talking, sort o’ switch off to something else—the market reports—anything under high heavens except what you went off for. She never took to Fred noway, and anything in his favor or otherwise sets her tongue going. She thinks he is plumb out of my present calculations, and any hint that he was getting on his feet would give her tantrums. She is back in the kitchen, seeing to the supper things. She is as close as the bark of a tree, and is afraid that nigger woman will lug off supplies. I took her because she was stingy. I sort o’ admired it at first, but it ain’t as becoming in a woman as it is in a man. I don’t know why, but it ain’t. Well, fire away. What did you do?” \n \n “I went straight out to Gate City, Mr. Walton,” the clerk began, in the tone of a man full of an experience. “I would have written home, but I didn’t get on to much of importance the first three days, and then I knew I could get back about as quick as a letter could.” \n \n “Yes, of course,” Walton said. “Well?” \n \n “I found it about the most hustling town I ever struck, Mr. Walton. It is wide open, I tell you. Of course, it isn’t anything like as big, but it was as busylooking on the main streets as Atlanta or Nashville. I thought best not to be seen about the very centre, you know, so I took board in a little hotel in what they call ‘Railroad Town,’ on the east side, among the machine-shops. I pretended to be looking for a job.” \n \n “You did, eh? You say you did?” \n \n “Yes, sir; and I found that it was a pretty good trick, for it set folks to chatting about the different enterprises in town. You may think it is funny,” Toby laughed, impulsively—“I know I did when I finally got the key to it—but I could hardly start any sort of talk with anybody who didn’t sooner or later ring in the wonderful rise of a certain fellow by the name of ‘Spencer,’ who was in this same Whipple’s employ. They all said he’d come there without a cent—a ragged tramp, in fact; but that he had taken hold in Whipple’s big store, and forged ahead till he was the old man’s mainstay and chief manager. They told about all sorts of deals that this ‘Spencer’ had helped Whipple put through. I got kind o’ tired of it all, and would every now and then ask if there wasn’t a young fellow by the name of ‘Walton’ working there; but they said if there was they had never heard of him, and went on about Spencer. I was beginning to think there might be something crooked in that fat man’s tale to you, and at one time I laid awake all night troubled powerfully. You see, the fellow who called here and paid the three thousand might have been just using Whipple’s name and reputation to help him work some scheme.” \n \n “Oh, you thought that!” and Walton drew his brows together and bit his lip. \n \n “Yes; but not for long, Mr. Walton. The next day I ventured closer in to the centre of the town, and was looking about on the main street at the up-to-date improvements on all sides, when I saw a fellow thumping along the sidewalk that looked so much like our man that I dodged into the front part of a bar-room and waited till he went by. Then I pointed him out to a policeman, and asked him who it was. \n \n “‘Why, that,’ said the cop—‘that is our big grocery king, Stephen Whipple. He is a self-made man, and as rich as goose-grease. He built us a fine church, a library out of white marble, and donated the land for a city park, and done a lot of other things.’” \n \n “Oh, he was all right, then!” \n \n “Yes, sir, as I substantiated later,” Toby ran on, enthusiastically. “But the best thing is to be told, Mr. Walton. A few minutes after that who should I see but Fred himself rushing along the street with some account-books under his arm, as if he was in a great hurry. He was dressed as fine as a fiddle, and folks all along the street was bowing to him as if he owned the town. I dodged back into the bar and let him pass, and when I slipped out a minute later the same policeman nabbed me and pointed Fred out as he was walking on. ‘That,’ said the policeman, ‘is Mr. Spencer, the old man’s adopted son—the young man he has just taken into partnership. They are hanging a new sign down at the store now.’” \n \n “Adopted son!” fell from the-banker’s lips. “Spencer was Fred’s middle name. Great Lord, Toby, do you reckon it’s true?” \n \n “True as gospel, Mr. Walton. I heard a lot about it on all sides, but I saw enough with my own eyes to convince me that there was no mistake. I went out to where the Whipples live one dark, cloudy night, and walked clean round the house. I could see into the sitting-room, for it was lighted up bright. Whipple was there, and a gray-haired, kind-looking old lady that was his wife, I reckon, and Fred. They were all sitting round a green lamp on a table. From where I stood, of course, I couldn’t hear a word that was said, but it seemed like Fred was telling some funny yarn or other, like he used to do here at home, you know, and both the old folks were laughing. I don’t know when anything ever has affected me as much as that sight did. I reckon I was homesick myself, away out there playing the sneak, like I was, and it made me awful blue. You know, sir, I always did like Fred, and I don’t believe many folks ever knew how much he missed his mother. And somehow, when I saw him in an entirely new home like that, away off from old ties, why—well—it sort o’ got the best of me. Maybe, as I say, it was because I was homesick, but I never wanted to speak to anybody in all my life as much as I did to him at that minute.” \n \n The head of the banker went down, his chin rested on his breast, and he was silent for a few minutes. Then he looked up, threw a cautious, half-fearful glance back into the house, and rose to his feet. \n \n “Let’s walk down to the gate,” he said, in a low, unsteady voice. “I want to talk, Toby, and yet I don’t hardly know what a body could say. I have faced lots of criticism and slurs in my day and time, and never cared much what was said; but, between me and you, this thing strikes me down deep. You see, it is pretty tough the way it turned out—this having other folks give a body’s son a home, and all that, and I hate to think that folks here in Stafford will get onto it and chatter. I understand ‘em well enough to know, in advance, what they will say. I don’t care what they think about me losing money, and the like, for that’s just business. But the other thing cuts—it cuts deep. I reckon the boy didn’t get any too much attention at home after I married the last time, and I reckon, if the truth was known, I was influenced against him some by his stepmother’s constant nagging about his ways. I say I reckon I was influenced, for I hardly think I’d have been quite as tight on the boy if there had been just me and him left at home after his mother died. My first wife was a good woman, Toby. I never knew how good and loving she was till she was put away forever. But the town will talk now good fashion. They will say Fred served me’ right to go off and get appreciated and loved by folks that was no blood kin, but who simply took him on merits I was too mean to see. They will have the laugh on me. They will call me an old hog, and I reckon I deserve it. You know, yourself, that I come within an inch of clapping handcuffs on him. I’d actually have done it if you hadn’t shown me that it would go against my pocket.” \n \n “I think you look at it too seriously, Mr. Walton,” Toby ventured to say, as the two leaned on the gate and looked down the gas-lighted street. “You mustn’t forget that Fred has been longing for your forgiveness all these years. What he did was wrong, it is true, and at present it may be the chief bar to his content. Besides, me and you are the only persons who know about his shortage. You have never been a man to talk of your private affairs, and, for all this town knows or ever need know, you may have been in touch with Fred all these years. In fact, they may not know but what the—the other matter was the only cause of Fred’s leaving.” \n \n “Toby, you are a good un! You’ll do, you’ll do! Of course, the woman business is bad, but the world somehow don’t condemn it as heavy as some other things. No, you are right; this blasted town needn’t know about the trouble between me and him. He won’t want to come back here nohow till the other matter is arranged some way, and, between me and you, we can sort o’ spring his big success on the town—kind o’ off-hand, you know, as if it ain’t nothing to wonder at.” \n \n “A good idea, Mr. Walton!” Toby declared, enthusiastically. “It will set ‘em wild.” \n \n “But we’ll leave the adopted-son part out, Toby.” \n \n “Of course, sir; oh yes, sir; that needn’t go in!” \n \n “We might just tell about his being a partner in the business, or something along that line.” \n \n “Of course, sir.” \n \n “And I’ll go out there, Toby. It will be like pulling eye-teeth, but I’ll go. I’ll knuckle, too, I reckon, to that fat chump. I’ll make my will in the boy’s favor and show it to Whipple, with an itemized list of my holdings, here and there. He won’t sneer then, I reckon. Besides, Fred won’t go back on me. Blood’s thicker than water, and if I have been harsh—well, even if I have, my money will be as acceptable as that old skunk’s. Yes, I’ll run out in a day or so. And, Toby, I’ll not even touch on the woman-and-child affair. He may think it never got out; he may believe she’s kept it quiet. In the letters he wrote me, he never once alluded to it, and that shows he is not ready to admit it, anyway. No, we won’t push that on him at such a time; he never would want to come home if he knew there had been such an uproar.” \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1728/50717.html","bookId":1132,"book":{"id":1132,"title":"The Redemption Of Kenneth Galt","description":"简介： YOUNG Doctor Dearing sat in the little church at an open window through which he had a partial view of that portion of old Stafford which stretched out desultorily toward the east. Immediately in front was a common fairly well covered with grass and...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1728","creation":"Aug 1, 2019 12:24:25 AM","modification":"Aug 1, 2019 12:24:25 AM"}}
