{"id":44265,"no":39,"title":"CHAPTER XXIII","content":"WHEN Kenneth Galt waked the next morning it was with the new sense of having slept long and restfully for the first time in years. The sun was streaming into his windows from the golden east; the cool air seemed crisp and invigorating; in the boughs of the trees close by birds were flitting about and singing merrily. The dew-wet sward, bespangled with a myriad of sun-born gems, stretched away into the gauzy mist which hung over the town. \\n\\n \\n\\n “It is glorious—glorious!” he cried, in ecstasy. “She may refuse, but I shall never desist till I have won her forgiveness.” \\n\\n \\n\\n After he had breakfasted in the big dining-room, now no longer solitary, sombre, or accusing, he went directly down to Mrs. Barry’s cottage. With a strange, buoyant lightness of step he entered the little gate, fastened the latch with a calm hand, and went up the steps and rapped on the closed door, seeing, as he stood waiting, the face of Mrs. Chumley, as the washerwoman peered curiously over the fence at him from her wood-pile, where she was wielding a gapped and dull-edged axe. The door was opened by Mrs. Barry, who could not disguise her surprise. \\n\\n \\n\\n “I have come to see your daughter, Mrs. Barry,” he said, humbly, as he stood uncovered before her. “I hope she will receive me; I have something important to say.” \\n\\n \\n\\n “She’s not here. But don’t stand there,” the old woman said; “somebody might see you and wonder. Come into the parlor.” \\n\\n \\n\\n She led the way, and he followed. \\n\\n \\n\\n “No, she is not here,” she repeated, when they were in the simply furnished room. “She and Lionel went very early to the swamp over the hill near the river. She had some sketching to do, and he wished to go along. You say you want to see her. Of course, you understand that such a request is unexpected, to say the least, and, as I am her mother—” The speaker seemed at a loss for words to express her meaning, and paused helplessly. \\n\\n \\n\\n “I am glad of this opportunity to see you first,” Galt said, humbly. “Mrs. Barry, I’ve come to beg her, on my knees if need be, to be my wife. Perhaps you may understand; I hope you do.” \\n\\n \\n\\n “Oh!” And the old woman sank into a rocking-chair and stared up at him. “Oh!” she exclaimed again, her wrinkled hand pressed against her thin breast. “You mean that, do you, Kenneth Galt? Well, I have never mentioned it to her, but I thought it might come. I read faces fairly well, and I saw, even at a distance, the spiritual despair in yours. Knowing what you were responsible for, I felt that your solitary life in your lonely house would bring results, for good or bad. At first I thought you might resume—might make dishonorable proposals; but when I saw you and Lionel together so often I began to count on other things—I began to pray for other things. You don’t look like a mean man, Kenneth Galt; and I can’t find it in my heart to reproach you. Besides, it is pitiful to think about, considering the child’s future; but she may have you now right where you had her once.” \\n\\n \\n\\n “You mean—you mean!” he exclaimed, aghast, as he bent over her chair and stared into her calm face. “You mean that—” \\n\\n \\n\\n “I mean that it may be too late,” she interrupted him. \\n\\n \\n\\n “Too late?” He sank into a chair in front of her, and, pale and quivering in every limb, swung his hat between his knees. \\n\\n \\n\\n “Yes; she is my daughter, but she is above me in a thousand ways. She suffered untold agonies after you desert—after you left Stafford, and all through her trouble; but when the baby came, and we were all shut up here away from human sight, the choicest blessings from on high seemed to fall on her. With her close work in her studio, and her devotion to the child, she grew into something more of heaven than of earth. I suppose there is such a thing as rising too high to love, in a human sort of way, and I tremble when I think of how she may now take your proposal. I want her to be sensible and think of the boy’s interests, but the idea of helping him in just that way may be—be repulsive to her. She’s done without your aid all these years, you see, Kenneth Galt. She has leaned on a Higher Power than any earthly one, and has already received her reward. You knew her as she was once, but not as she is now. She was hardly more than a child then. Her father used to say she would be a great genius, and I think she really is. Her isolation from mankind has done her more good in one way than harm. It has put something into her work that couldn’t have got there any other way. Only yesterday a letter came from a high authority on art—But I have no right to speak of her private affairs. If she sees fit to tell you about it she may. That’s another matter. She has never been ashamed, as this town, no doubt, thinks she is. She looked on what passed between you and her before the trouble as a true marriage in the sight of God. It wasn’t the way persons generally look at such matters, but she wasn’t a common, ordinary person, and she didn’t think the man she loved was—that is, I mean she thought you looked at it exactly as she did. She took you at your word. If what I say pains you, I’m sorry. I must be blunt to express what is in me, for I have long ago justified her. If she had been worldly minded, back there when she was glorying in the secret between you and her, she would have had worldly caution and forethought. You may get forgiveness even from her, Kenneth Galt, in time, but there can be nothing quite as unforgivable in the sight of God, it seems to me, as taking advantage of just that sort of faith.” \\n\\n \\n\\n The light of hope had died out of Galt’s parchment-like face. He dropped his horrified gaze to the floor. \\n\\n \\n\\n “I see,” he groaned. “I am too late!” and sat as if stunned. “I was never up to her level. It was only her girlish fancy that told her I was.” \\n\\n \\n\\n “Oh, I don’t know!” Mrs. Barry said, almost sympathetically. “Now that you feel as you do, her old trust might come back. There is one thing that has touched her, I’ll tell you that much, for certain, and that has been your love for Lionel. One day I caught her shedding tears over it as she stood concealed by the window-curtain watching you play with him in the swing. If anything ever brings her back to you, it will be that one thing. He loves you, too; he is always talking of you, and, if I am any judge, she rather likes to hear it. It may be that—it may not; I never can be sure I am reading her right.” \\n\\n \\n\\n He rose. “I am going to find her now,” he said. “At any rate, she shall know how I feel. She may spurn me, but from this day on I shall devote my life to her interests and those of our child.” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1728/50724.html","bookId":1132,"book":{"id":1132,"title":"The Redemption Of Kenneth Galt","description":"简介： YOUNG Doctor Dearing sat in the little church at an open window through which he had a partial view of that portion of old Stafford which stretched out desultorily toward the east. Immediately in front was a common fairly well covered with grass and...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1728","creation":"Aug 1, 2019 12:24:25 AM","modification":"Aug 1, 2019 12:24:25 AM"}}
