{"id":44269,"no":43,"title":"CONCLUSION","content":"ONE of the great ocean bound steamships was ready for sailing from the New York harbor. On the deck, near the stern, somewhat removed from the others and leaning against the railing, stood a man and a child and a young woman so beautiful and so richly clad that the eyes of many of the passengers and their friends, who had massed themselves on the pier below, were fixed upon her admiringly. \n \n “It is going to be a glorious voyage, darling,” Kenneth Galt said, as he stroked the golden hair of the child. “The bay is as smooth as glass. Look how the people are staring at you! You cannot dream how beautiful you are. Are you happy, Dora?” \n \n She looked down at the water, put her hand against the cheek of the child, and smiled, a far-off look in her eyes. “Think, oh, think of what it means to him!” Just then Mrs. Barry came from the luxurious suite of state-rooms Galt had secured. \n \n “Some one has sent a great bunch of flowers,” she said to her daughter. “They were addressed to you. I asked the florist’s man who sent them. He said he didn’t know, but that it was a telegraphic order from somewhere. Go see them; they are simply beautiful. They perfume the whole place.” \n \n Leaving the three together, Dora went to the suite of rooms. In the one reserved for her, on a table, she found a great mass of damp, fresh roses. The card accompanying the gift had slipped down between the stems. She drew it out and read: \n \n “Bon voyage!” \n \n That was all. She sat down at the table, gathered a bunch of the flowers in her hands, and buried her flushed face in them. \n \n “Oh!” she cried, and then she burst into tears. “Bon voyage! bon voyage! From you—dear, dear, dear Wynn! I know. I understand. I have known and understood for years. I shall know and understand—always!” \n \n The signal for leaving had sounded. She felt the ponderous throb of the ship under her. She dried her eyes and walked out on the deck. Her husband came to meet her. He took her arm, and they leaned over the railing and looked down into the multitude of waving hats and handkerchiefs. \n \n “Who sent the flowers, darling?” Galt asked. \n \n “There was no name attached,” she answered. “Look, Kenneth! Lionel is trying to climb the railing—don’t let him!” \n \n Galt hurried away to do her bidding, and she gazed down into the water, which was being churned into white foam. \n \n “Bon voyage!” she said, bitterly. “Bon voyage!” \n \n The End \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1728/50728.html","bookId":1132,"book":{"id":1132,"title":"The Redemption Of Kenneth Galt","description":"简介： YOUNG Doctor Dearing sat in the little church at an open window through which he had a partial view of that portion of old Stafford which stretched out desultorily toward the east. Immediately in front was a common fairly well covered with grass and...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1728","creation":"Aug 1, 2019 12:24:25 AM","modification":"Aug 1, 2019 12:24:25 AM"}}
