{"id":101069,"no":17,"title":"Page 17","content":"“Our own slice of heaven, huh, Jax?”\n As the rain plasters my hair to my head, I sigh and shoulder my pack. “Right.”\n Guess this might have been paradise for the amphibians. Part of me aches, like this is my fault, like I’m the butterfly whose wings create hurricanes. I try to push it back. But it’s hard to escape the feeling that my life has become a curse, a thread that ought to have been snipped at Matins IV, and that I’m only going to keep causing pain until I have the good sense to die. But even if that’s the case, I’m just not selfless enough to fix it.\n He fiddles with a handheld nav device, getting a fix on our location as opposed to the settlement. I’m almost surprised not to be chided for my thoughts, but then he can’t live inside my head, can he? I suppose I’ve gotten used to the idea that he might, that he’s privy to everything about me.\n Realizing he doesn’t and he isn’t, now…I feel lonely.\n “Let’s go. Sooner we get moving, sooner we get there. See if we can make sense of what happened here.”\n Nodding, I fall in behind March, not because I acknowledge his authority in any fashion but because if by some chance we were wrong, and there’s something big and ugly left in these wetlands, I really prefer it eats him first. Give me a chance to run.\n “Nice,” he says, sparing a glance over his shoulder. “Really nice.”\n Oh sure, that he hears.\n For the first time it occurs to me, as we’re walking, maybe it’s not entirely March. Maybe it’s something I’m doing, something I didn’t even know I could do. I think back over the times where he’s tuned to my frequency, and it’s often when I was thinking something I knew would needle him. This last time, I heard him back, without effort, without equipment. What that means, exactly, I have no idea.\n “It means our theta waves are compatible,” he answers, surprising me. “It’s almost always a one-way feed. I get impressions from other people, what kind and how deep depends on how disciplined their minds are and how much I want to know. Used to be uncontrollable, couldn’t shut it off.”\n “How did you—”\n “Mair. She wouldn’t teach me the higher forms, but she saw what a mess I was and taught me how to quiet my mind. Shut out the noise through meditation.”\n Well, that explains a hell of a lot. “I’m sorry. I didn’t know.”\n His next words come out strained. “Before she took me in hand, I wasn’t even human, Jax. You have no idea how many people I’ve ended. Broke minds to set an example, for the hell of it, or just because I needed a quiet kill. I spent years on Nicuan, feeding their endless wars. By the time I stole a ship because they shorted my pay, there was nothing left. Mair rebuilt me, brick by brick.”\n A chill shivers through me, more than the icy rain coursing down my neck. I’ve seen echoes of that darkness in his eyes sometimes, a soulless echo he keeps in check. Am I safe out here with him?\n “Who else have I taken from you?” I probably wouldn’t have the nerve to ask if I could see his face. But looking at his broad back in the battered flight jacket, I can just manage it. “I know about Edaine. And Mair. I didn’t realize she was your mentor…that only makes it worse. But there’s someone else, isn’t there?”\n And it’s part of what he’s been trying to hide from me, each time we jack in. Part of the reason he wants to hate me. I know her name. Svet. Dina said it weeks ago. But who was she to him?\n I hold my breath as we walk, ducking beneath low-hanging vines and ferny fronds that clutch at my clothes as we pass by. The sounds seem louder around us, insects buzzing and chirping, a small symphony fusing with the slurp of ooze around our shoes.\n “I’m not having this conversation with you, Jax. Not now.”\n “Why not?” Second time he’s given me that answer, almost verbatim.\n At that, he turns to face me. “Because we’re in the middle of nowhere,” he tells me deliberately. “There’s nobody to see, nothing to stop me but my conscience. And I’ve only recently decided you don’t deserve killing.”\n My breath rushes out of me in a sound that can’t rightly be called a sigh. It’s more of a whimper, and I’m embarrassed because I sound like a wounded animal. I don’t know what I thought…that his animosity had become at least partially feigned? That I’d proven myself somehow. I guess I thought because he spirited me away from the brain butchers on Perlas that I could, to some degree, count on him for protection.\n But as it turns out, March is the chief advocate of wanting me dead.\n And what better way to accomplish that than to lead me, trusting as a sacrificial goat, out into the wilderness? No wonder nobody volunteered to come with us. Was there ever anything on this planet? And why wouldn’t he have detected the anomaly in life signs from orbit? I remember Keri giving me the PA; she knew the codes. Maybe she planted all the data about Marakeq. Maybe they realize I don’t know anything, nothing but grimspace, and I’ve been played.\n Maybe March doesn’t give a shit about the grand scheme. I give him points for the thespian performance in the cockpit. I bought into it with all my credits. Believed he was suffering over the fate of these poor bog-runners. I’m so stupid. I should have known there was a reason for his sudden shift, why he came running to help me.\n His assurance, I’ll always come for you, Jax, takes on sinister tones.\n There probably isn’t a grand scheme any longer, and all their hope of an academy died with Mair. Maybe this is their way of righting the wrong on Matins IV. I thought it myself; I shouldn’t have survived where so many other, worthier people died.\n Wonder how far we are from the ship and whether they’d act against me if I came back alone. Do they know? I can’t believe Doc and Loras do. Saul has been the essence of kindness from the beginning, and Loras, oh shit, Loras will die without me. Those two can’t possibly be involved.\n Does he plan to return without me? Report a tragic accident and move out? The Corp would probably stop hunting them with confirmation of my death. Neat and tidy, isn’t it, March? And then you can wait for someone stable, just like you said.\n Clean slate.\n My face feels like it’s blazing with heat, and I see clearly for the first time, every detail down to the rain trickling down his brown face. I back up a pace, then two, fumbling in my pack for anything like a weapon. Come up empty-handed. I’m not scared so much as angry, mostly at myself for being so fragging gullible, and if he takes a single step toward me, I’m going to kill him with my bare hands or die trying.\n I know which I prefer.\n CHAPTER 21\n “You can’t be serious.”\n But he doesn’t make a move, so I think he knows perfectly well that the time for bullshit is done. He fooled me once, shame on him, but I’m not falling for it again. Instead, I’m gauging the distance, trying to calculate an approach where I can prevail against his sheer physical strength.\n I have to be honest with myself, though. The odds don’t look good. I probably have a better shot running away from him, and I possess too much self-preservation to cavil. Survival is survival, and he’s just said he wants me dead. So I feint left and dive right, but before I can tumble past him and hit the ground running, he catches me around the waist, easily, as if I were a recalcitrant child trying to avoid chores.\n “Jax.” He pitches his voice soft, soothing. “You’re losing it again. Maybe not a full break, but you’re not rational. If I intended to hurt you, why announce it?”\n I don’t respond except to struggle with fists and feet, my heart pounding in my chest fit to explode. It’s something else now, and I’m trapped. He’s a wall as I pummel him, managing to do nothing but bounce off him like he’s the ultimate immovable object. And he doesn’t react except to leave his arm around my waist, keeping me from falling, even when I collapse.\n Because he’s right—I’m fragging insane. I hate feeling like this. For the first time since I left Perlas, the tears come, and I can’t stop them, sobbing as the rains wash over us, heavier now. As if from beneath a blanket, I hear the rumble of thunder in the distance.\n Afterward, the only reason I can look him in the eyes is because he doesn’t comfort me. He doesn’t murmur soft words or stroke my back; he just keeps me upright, out of the mud, and the moment it seems like I can stand on my own, he lets me go.\n “I’m so sorry,” I say, low. “Don’t know if it was the crash or something the Corp did to me afterward, but—”\n “Shut up and let’s go,” he says brusquely.\n For some reason, that makes me smile, but he doesn’t wait around for my reaction. I’m left staring at his back as he heads down what passes for a trail, a clearish patch between the trunks of bloated trees. Oddly, I feel lighter. I have no idea what my Unit Psychs did to me, but I think my head’s a minefield strewn with triggers, and maybe if I survive each explosion, what emerges from the wreckage will be me, really, truly me.\n At that he spins, spearing me with a look. There’s such heat in his eyes, never seen this expression, not from anyone. It’s not desire, but something deeper, darker. Instinctively I fall back a step.\n “Not ‘if,’” he growls. “I’m tired of catching glimpses where you’re thinking about dying. Yeah, before we met, I wanted you dead, not because I felt sure you were to blame for Matins IV. Because you walked away. But get it through your head, Jax. I will never let anything happen to you, not now. You’re one of mine, whether I like it or not.”\n My legs won’t hold me. Or maybe my feet are simply swept out from under me by the wash running between gnarled roots. I wind up on my knees in the mud, face upturned, not to him, but for the rain, almost praying to be made clean. The fabric of our coveralls is supposed to be waterproof, but nothing can withstand the saturation found on Marakeq in monsoon season. We’re both soaked through, and I feel as though I’ll never be warm again.\n “March, please,” I whisper, beneath the sound of the water. I don’t know whether he can even hear me. “You have to tell me.”\n I gaze up at him, touching him only with my eyes. And I recognize when he accepts the inevitability of this exchange. For the first time I grasp that bending doesn’t necessarily mean weakness. Defiance doesn’t always equate to strength. And before he replies, I know he’s not going to deny me a third time before sundown.\n Raindrops spatter his hard face like tears, and when he reaches for me, I let him draw me up. We stand joined only by our twined fingers, as he answers in a broken voice, a not-March voice, “All right. All right, Jax. You win.”\n “I don’t want to win. I just need to understand.”\n “How much do you remember about the flight before the crash?” His hands tighten on mine, hurting me, but I know he’s not even aware of it.\n I swallow hard around a lump in my throat. “It was uneventful.” This part is rote; I’ve repeated it so often: to the Psychs, to my CO, in the silence of my own head. “We were just coming off R\u0026R, so I was well rested. Kai and I intended”—small inner flinch at speaking of him in past tense, yes, he’s really gone—“to pick a mechanic and a medic from the pool and do a routine exploratory. But somebody got sick, a jumper who was supposed to make a passenger run. There were all kinds of diplomats and dignitaries waiting for the jump-flight off station to Matins IV. My CO asked if I’d mind filling in, more R\u0026R to follow, since he knew passenger flights weren’t my favorite.” \n","sourceLink":"https://allnovel.net/grimspace-sirantha-jax-1/page-17.html","bookId":1646,"book":{"id":1646,"title":"Grimspace (Sirantha Jax #1)","description":"Storyline: \n Grimspace (Sirantha Jax #1) \n As the carrier of a rare gene, Jax has the ability to jump ships through grimspace—a talent which cuts into her life expectancy, but makes her a highly prized navigator for the Corp. But then the ship she’s navigating crash-lands, and she’s accused of killing everyone on board. It’s hard for Jax to defend herself: she has no memory of the crash. \n Now imprisoned and the subject of a ruthless interrogation, Jax is on the verge of madness. Then a mysterious man breaks into her cell, offering her freedom—for a price. March needs Jax to help his small band of rogue fighters break the Corp monopoly on interstellar travel—and establish a new breed of jumper. \n Jax is only good at one thing—grimspace—and it will eventually kill her. So she may as well have some fun in the meantime…\n \n","cover":"https://allnovel.net/images/grimspace-sirantha-jax-1.jpg","author":"Ann Aguirre","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/grimspace-sirantha-jax-1.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:37:52 PM"}}
