{"id":104087,"no":40,"title":"Page 40","content":"\n Russian military assault rifles.\n In the rearview mirror, Gray caught a worried glimpse on Masterson’s face. First an American mercenary team, now Russians…How many people wanted this guy dead? Answers would have to wait for the moment.\n Gray could see that the helicopters, reflected in his mirrors, continued to close the distance. While Gray had succeeded in his plan—getting the team clear of the village and drawing off the assault team—now what?\n “Turn right at the bottom of the next hill!” a voice called behind him with a British accent. Gray glanced back and saw they had a stowaway.\n Abhi Bhanjee.\n Rosauro explained, “He knows a way to shake our tail!”\n Hitting the bottom of the slope with a splash of water, Gray took a hard right and followed the muddy valley.\n “Now left past that next fencerow!” Abe yelled.\n What fencerow?\n Gray leaned forward. Without headlights, it was too dark to see. If only he had more lights…\n A helicopter swept past, its searchlight blazing. It was not exactly what Gray had been hoping for. Still, with the better illumination, he spotted a fence of stacked stones ahead. Unfortunately the beam also spotted them. Brilliant light swamped the SUV.\n A salvo of gunfire erupted, peppering the water, pinging his back end.\n With no time to spare, Gray reached the fence and yanked to the left. Even with the four-wheel drive, the back end fishtailed in the water and mud. But the tires finally gripped, and they fled up a short rise and out of the water.\n The helicopter swept wide. But its spotlight pivoted smoothly and kept fixed to them, tracking their passage below.\n Shooting over the top of the next rise, the SUV lifted into the air for a breath, then struck down hard enough to knock Gray’s teeth together. Cries rose from the rear.\n At the bottom of the slope and to the right, a black sea divided the gray landscape ahead. It was not water, but a vast forest.\n “Mango orchard!” Abe said. “Very old farm. Very old trees. My family has worked many generations there.”\n Gray shot toward that dark orchard.\n The spotlight followed. Gunfire rained at them, but Gray kept a slaloming, unpredictable course. Not a single bullet touched them.\n With a final roar of the engine, they barreled into the orchard. Trees towered in straight rows. Branches arched into a continuous canopy, cutting off the glare of the spotlight. Gray slowed as the light vanished and darkness fell around him. Still, he made several turns, running perpendicular to their original path. The thumping of the helicopter’s blades faded. Gray fled deeper, like an escaped prisoner running through a dark cornfield.\n “How large is this orchard?” he asked, calculating how well they’d be able to hide here.\n “Over ten thousand acres.”\n That’s one big cornfield.\n As the danger ebbed, everyone settled themselves more comfortably into their seats.\n Rosauro leaned forward. “There’s another reason Abe insisted he come along.”\n “Why’s that?”\n She lifted a coin into view. It was the Greek coin with the chakra wheel on the back. She pointed to the temple.\n “He knows where this is.”\n Gray glanced into the rearview mirror. He spotted Abhi Bhanjee seated in the back row next to Luca. Even through the gloom, Gray recognized the man’s terror. He remembered the Hindu man’s description about where Archibald Polk had been headed when he’d vanished.\n A cursed place.\n 13\n September 6, 10:26 P.M.\n Southern Ural Mountains\n Monk kept guard.\n In dry clothes and with his bones warmed by the hearth, Monk circled the cabin. He creaked around as quietly as possible, stepping carefully. He wore his boots, though the laces were untied. He had all the children redress and put on their shoes before curling up in their quilts. If they had to leave suddenly, he didn’t want them fumbling with clothing.\n Konstantin and Kiska huddled together, each cocooned in their blankets. They seemed smaller in sleep, especially Konstantin. His sharp attention and mature speech patterns made him seem older. But with his body relaxed, Monk realized he could be no older than twelve.\n Stepping past them, Monk moved extra softly. By now, he knew which floorboards creaked the loudest and avoided them. Pyotr lay curled in the embrace of the old chimpanzee. She sat on the floor, her head hung to her chest, breathing deeply in sleep. Pyotr had panicked earlier, scared for his twin sister. Monk trusted the boy’s instinct, but there was nothing they could do. It took a full hour to get Pyotr to finally relax, but the day’s trek had worn the boy to a thread. He finally succumbed to his exhaustion and drifted to sleep, guarded over by Marta.\n No matter how softly Monk tread, she would lift her head toward him as he passed. Bleary, warm eyes stared up at him, then the lids drifted down along with her head.\n Keep watching over him, Marta.\n At least someone loved these children.\n Monk returned to his seat beside the door. He had upended the table across the threshold and had positioned a chair in front of that. He sank to it with a sigh.\n He listened to the night noises of the swamp: the gurgle of water, the croaking of frogs, the buzz of crickets, and the occasional soft hooting of a hunting owl. He had been startled earlier by something large moving past the cabin, but a peek through the shutters revealed a muddy boar, grubbing around.\n Monk let the creature roam, serving as a tusked sentinel. But eventually it moved on.\n The rhythms of the swamp lulled him. Before long, his own chin sank toward his chest. He’d only close his eyes for a few minutes.\n —You’re late again, Monk! Get moving!\n His head snapped back up, cracking against the underside of the upended table. Pain lanced through his skull—not from his knock against wood, but from deeper down. For a moment, he tasted…tasted cinnamon, spiced and warm, along with a whispery brush against his lips. A scent filled him, stirred him.\n It faded quickly.\n Just a dream…\n But Monk knew better. He sat straighter as the icy spike of pain melted away. He fingered the sutures behind his ear.\n Who am I?\n Konstantin had described a sinking cruise liner, a weighted net, and his rescue at sea. Had he worked on the ship? Had he been a passenger? There was no answer inside him, only darkness.\n Monk gazed across the room and found a pair of eyes staring back at him. Pyotr hadn’t moved. He just looked at Monk. The knock of his head against the table must have woken the boy.\n Or maybe it was something else.\n Monk met the boy’s gaze. He read a well of sorrow in the child’s eyes, too deep for one so young. It scared Monk a little. It was no simple grief or fear. Hopelessness shone in his tiny face, a despair that had no place in any child’s eyes. The boy shivered, stirring Marta.\n She hooted softly and looked over her shoulder at Monk.\n He stood and crossed to them. The boy’s face gleamed brightly in the firelight. Too brightly. Monk checked his forehead.\n Hot. Feverish.\n That’s all he needed was a sick child.\n Couldn’t he catch even a small break?\n His silent question was answered by a feral scream. Close. It started as a throaty growl, and then pitched into a full scream. It reminded Monk of someone yanking on the cord of a chain saw.\n A second cry answered from the opposite side of the domicile.\n The feral screams jerked both Konstantin and Kiska to their feet.\n There had been no warning.\n Monk had heard no sign of the cats’ approach. Even the boy had remained unaware. Maybe it was the fever or simple exhaustion. Monk had hoped for some notice.\n The cabin was not secure. From what he saw on the riverbank earlier, each tiger weighed around seven hundred pounds, most of it toughened muscle. The cats could tear through the door or claw through the roof in seconds. But for now, they circled, growling, sizing up the place.\n Konstantin had expressed another concern. Even if the tigers didn’t storm the cabin, they were surely being followed by hunters on two legs. They could not let the cats trap them here.\n So with no choice, they moved quickly.\n Monk slipped the spear-point bowie knife they’d found in the cabin from his belt and clenched the wooden handle between his teeth—then he crossed to the stone hearth and pulled a flaming brand out of the fire. Earlier, using the knife, he had chopped a three-foot-long branch from a scraggly pine outside. The resin was highly combustible and had fueled the stick into a fiery torch.\n Monk hurried around the room. He tapped the torch to the underside of the thatch roof. Long neglected, it was as dry as tinder. He had also emptied the kerosene from the rusty lantern into some rags and stuffed them in the roof.\n Flames spread quickly.\n The cats yowled into higher octaves, splitting the night.\n Behind Monk, Konstantin lifted two pine boards from the floor. Monk had already pried out the old nails with the same knife and loosened the boards. Raised on short stilts, the cabin had a low crawl space beneath it, open on all sides. It was too low-roofed for Monk, but not for the children or Marta. He prayed the cats could not shimmy under there also.\n Opposite the door, Kiska unlatched the shutter from the cabin’s window and dropped it open.\n At the same time, Monk kicked the table aside from the door.\n Ready and running out of time, he waved the kids below as smoke filled the upper half of the cabin and heat blazed down.\n Marta helped Pyotr under the floorboards. Kiska went next. Konstantin followed. The older boy nodded to Monk, no longer a boy, but a dour young man again. “Be careful,” Konstantin warned.\n With the dagger between his teeth, Monk returned his nod.\n Konstantin dropped away and vanished.\n Monk had to keep the cats distracted. The roof fire and smoke should confuse them. He had to add to it. With the torch in his hand, he counted to ten—then kicked the warped door with all his strength. Boards cracked, and the door smashed wide.\n A tiger crouched three yards away. Startled, it curled into a long menacing hiss. One claw swiped at the empty air in his direction.\n The feline equivalent of fuck you.\n Monk gaped a half second at its sheer size. Thirteen feet long. Eyes glowed with reflected firelight as the cabin’s roof burned. Lips rippled back, pink tongue arched deep inside a cage of long fangs. \n","sourceLink":"https://allnovel.net/the-last-oracle-sigma-force-5/page-40.html","bookId":1528,"book":{"id":1528,"title":"The Last Oracle (Sigma Force #5)","description":"Storyline: \n The Last Oracle (Sigma Force #5) \n In Washington, D.C., a homeless man dies in Commander Gray Pierce\u0027s arms, shot by an assassin\u0027s bullet. But the death leaves behind a greater mystery: a bloody coin found clutched in the dead man\u0027s hand, an ancient relic that can be traced back to the Greek Oracle of Delphi. As ruthless hunters search for the stolen artifact, Gray Pierce discovers that the coin is the key to unlocking a plot that dates back to the Cold War and threatens the very foundation of humanity. \n An international think tank of scientists known as the Jasons has discovered a way to bioengineer autistic children who show savant talents -- mathematical geniuses, statistical masterminds, brilliant conceptual artists -- into something far greater and far more \"frightening,\" in hopes of creating a world prophet for the new millennium, one to be manipulated to create a new era of global peace... a peace on their own terms. \n Halfway around the world, a man wakes up in a hospital bed with no memory of who he is, knowing only that he\u0027s a prisoner in a subterranean research facility. With the help of three unusual children, he makes his escape across a mountainous and radioactive countryside, pursued by savage hunters bred in the same laboratory. But his goal is not escape, nor even survival. In order to thwart a plot to wipe out a quarter of the world\u0027s population, he must sacrifice all, even the children who rescued him. \n From ancient Greek temples to glittering mausoleums, from the slums of India to the toxic ruins of Russia, two men must race against time to solve a mystery that dates back to the first famous oracle of history -- the Greek Oracle of Delphi. \n But one question remains: \"Will the past be enough to save the future?\"\n \n","cover":"https://allnovel.net/images/the-last-oracle-sigma-force-5.jpg","author":"James Rollins","type":"Adventure","source":"allnovel","link":"https://allnovel.net/the-last-oracle-sigma-force-5.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 10:33:23 PM"}}
