{"id":104053,"no":6,"title":"Page 6","content":"\\n\\n Painter held up a hand. “I’ve answered your question, Gray. So now you answer mine. Will you take the lead on this case?”\\n\\n “After the professor was shot in front of me, I want answers as much as anyone.”\\n\\n “And what about your…extracurricular activities?”\\n\\n A wince of pain narrowed Gray’s eyes. The planes of his face seemed to grow harder as a part of him clenched internally. “I assume you’ve heard, sir.”\\n\\n “Yes. The navy has discontinued its search.”\\n\\n Gray took a deep breath. “I’ve pursued all angles. There’s nothing more I can do. I admit that.”\\n\\n “And do you think Monk is still alive?”\\n\\n “I…I don’t know.”\\n\\n “And you can live with that?”\\n\\n Gray met his gaze, unflinching. “I’ll have to.”\\n\\n Painter nodded, satisfied. “Then let’s talk about this coin.”\\n\\n Gray reached out and took the coin from the desktop. Turning it in his fingers, he examined its freshly cleaned surfaces. “Were you able to determine much about it?”\\n\\n “Quite a bit. It’s a Roman coin minted during the second century. Take a look at the woman’s portrait on the back. That’s Faustina the Elder, wife of the Roman emperor Antoninus Pius. She was a patron of orphaned girls and sponsored many women’s charities. She also had a fascination with a sisterhood of sibyls, prophetic women from a temple in Greece.”\\n\\n Painter waved for Gray to turn the coin over. “That’s the temple on the other side. The temple of Delphi.”\\n\\n “As in the Oracle of Delphi? The female prophets?”\\n\\n “The same.”\\n\\n The coin’s report on Painter’s desk included a historical sheet about the Oracle, detailing how these women would inhale hallucinogenic fumes and answer questions of the future from supplicants. But their prophecies were more than just fortune-telling, for these women had a great impact on the ancient world. Over the course of a millennium, the Oracle’s prophecies played a role in freeing thousands of slaves, setting the seeds of Western democracy, and elevating the sanctity of human life. Some claimed their words were pivotal at lifting Greece out from barbarism and toward modern civilization.\\n\\n “But what about the big E in the center of the temple?” Gray asked. “I assume the letter is Greek, too. Epsilon.”\\n\\n “Yes. That’s also from the Oracle’s temple. There were a couple cryptic inscriptions in the temple: Gnothi seauton, which translates—”\\n\\n “Know thyself,” Gray answered.\\n\\n Painter nodded. He had to remind himself that Gray was well versed in ancient philosophies. When Painter had first recruited him out of Leavenworth prison, Gray had been studying both advanced chemistry and Taoism. It was this very uniqueness of his mind that had intrigued Painter from the start. But such distinctiveness came with a price. Gray did not always play well with others, as he had demonstrated amply these past weeks. It was good to see him focusing on the here and now again.\\n\\n “Then there was that mysterious E,” Painter continued, nodding to the coin. “It lay carved in the temple’s inner sanctum.”\\n\\n “But what does it mean?”\\n\\n Painter shrugged. “No one knows. Not even the Greeks. Historians going all the way back to the ancient Greek scholar Plutarch have speculated at its significance. The current thought among modern historians is that there used to be two letters. A G and an E, representing the Earth goddess, Gaia. The earliest temple at Delphi was built to worship Gaia.”\\n\\n “Still, if the meaning is so mysterious, why depict it on the coin?”\\n\\n Painter slid the report across his desk toward Gray. “You can read more about it in here. Over time, the Oracle’s E became a symbol for a cult of prophecy. It’s depicted in paintings throughout the ages, including Nicolas Poussin’s Ordination, where it’s inscribed above Christ’s head as he hands the keys of heaven to Peter. The symbol is supposed to mark a time of great and fundamental change in the world, usually brought about by a single individual, whether that be the Oracle of Delphi or Jesus of Nazareth.”\\n\\n Gray left the papers on the desk and shook his head. “But what does all this have to do with the dead man?” Gray lifted the silver coin. “Was this valuable? Worth killing over?”\\n\\n Painter shook his head. “Not especially. It’s of moderate value, but nothing spectacular.”\\n\\n “Then what—?”\\n\\n The intercom’s buzz cut him off. “Director Crowe, I’m sorry to interrupt,” his assistant said over the speaker.\\n\\n “What is it, Brant?”\\n\\n “I have an urgent call from Dr. Jennings down in the pathology lab. He’s asking for an immediate teleconference.”\\n\\n “Fine. Queue it up on monitor one.”\\n\\n Gray stood, ready to leave, but Painter waved him down, then swung his chair around. His office, buried in the subterranean bunker, had no windows, but it did have three large wall-mounted plasma screens. His private windows on the world. They were presently dark, but the monitor on the left flickered to life.\\n\\n Painter found himself staring into one of the pathology labs. In the foreground stood Dr. Malcolm Jennings. The sixty-year-old chief of R\u0026D for Sigma was dressed in surgical scrubs and had a clear plastic face-shield tilted atop his head. Behind him spread one of the pathology suites: sealed concrete floor, rows of digital scales, and in the center a body rested on the table, respectfully covered with a sheet.\\n\\n Professor Archibald Polk.\\n\\n It had taken a few calls to get his body released to Sigma versus the city’s morgue, but Malcolm Jennings was a well-regarded forensic pathologist.\\n\\n But from the grim set to the man’s lips, something was wrong.\\n\\n “What is it, Malcolm?”\\n\\n “I had to quarantine the laboratory.”\\n\\n Painter didn’t like the sound of that. “A contagious concern?”\\n\\n “No, but there is definitely a concern. Let me show you.” He stepped out of view of the camera, but his voice carried to them. “From the preliminary physical exam, I was already suspicious. I discovered patches of hair loss, eroded teeth enamel, and burns on his skin. If the man hadn’t been shot, I wager he would’ve been dead in a matter of days.”\\n\\n “What are you saying, Malcolm?” Painter asked.\\n\\n He must not have heard. The pathologist stepped back into view, but now he wore a heavier, weighted apron. He carried a device that trailed a black wand.\\n\\n Gray stood and shifted closer to the monitor.\\n\\n Dr. Jennings waved the black wand over the dead man. The device in his other hand erupted with a furious clicking. The pathologist turned to face the camera.\\n\\n “This body is radioactive.”\\n\\n 2\\n\\n September 5, 5:25 P.M.\\n\\n Washington, D.C.\\n\\n Out in the steaming swelter again, Gray strode down the sidewalk in front of the Smithsonian Castle. The national Mall spread to the left, mostly deserted due to the heat.\\n\\n Behind Gray, crime tape still marked off the site of the afternoon’s murder. The forensics unit had finished its sweep, but the area was still locked down, under the eye of a posted D.C. policeman.\\n\\n Gray walked east along\\n\\n Jefferson Drive\\n\\n . He was shadowed by a large bodyguard, whom he was doing his best to ignore. He had not asked for any protection, especially this man. He touched the mike at his throat and subvocalized into it. “I’ve found a trail.”\\n\\n The fizzle of a reply rasped out of his wireless earpiece. Cocking his head, Gray seated it better. “Say again,” he whispered.\\n\\n “Can you follow the trail?” Painter Crowe asked.\\n\\n “Yes…but I don’t know for how long. The readings are weak.” Gray had suggested his current plan of action. He studied the device in his hand, a Gamma-Scout portable radiation detector. Its halogen-filled Geiger-Müller tube was sensitive enough to pick up trace radiation, especially when attuned to the specific strontium 90 isotope detected in Polk’s body. Gray had hoped that a residual trace signature might have been left behind, the radiological equivalent of a scent trail. And it seemed to be working.\\n\\n “Do your best, Gray. Any information on the professor’s whereabouts these past days could be crucial. I already have a call in to his daughter, but I’ve been unable to reach her.”\\n\\n “I’ll follow this as far as I can.” Gray continued down the sidewalk, monitoring the detector. “I’ll report in if I discover anything.”\\n\\n Gray signed off and continued alongside the national Mall. After another half block, the signal suddenly died on his device. Swearing, he stopped, retreated, and bumped into the bodyguard shadowing him.\\n\\n “Damn it, Pierce,” the man grumbled. “I just polished these shoes.”\\n\\n Gray glanced over a shoulder to the muscled mountain behind him. Joe Kowalski, a former seaman with the navy, was dressed in a sportcoat and slacks. Both fit him poorly. With hair razored to a black stubble and a nose knotted by an old break, he looked more like a shaved gorilla forced into a wrinkled suit.\\n\\n Kowalski bent down and used the cuff of his sportcoat to polish up his shoe. “I paid three hundred bucks for these. They’re chain stitch Chukkas imported from England. I had to special order them in my size.”\\n\\n Cocking an eyebrow, Gray glanced up from his Gamma-Scout reader.\\n\\n Kowalski seemed to realize he might have said too much. His expression turned sheepish. “Okay. I like shoes. So what? I had a date, but…well…she canceled.”\\n\\n Smart lady.\\n\\n “Sorry about that,” Gray offered aloud.\\n\\n “Well…at least they’re not scratched,” Kowalski said.\\n\\n “I meant sorry about being stood up.”\\n\\n “Oh. Yeah.” He shrugged. “Her loss.”\\n\\n Gray didn’t bother arguing. He returned his attention to his handheld reader and turned in a slow circle. A step to the right, he caught the radioactive scent again. It angled away from the sidewalk and trailed across the grassy Mall. “This way.”\\n\\n The professor’s route took them through the Mall’s Sculpture Garden across from the Hirshhorn Museum. Gray followed Polk’s steps into the shady, sunken oasis, and out again. Beyond the garden, Polk’s path continued across the Mall, edging alongside the tents of a Labor Day media event that was still being dismantled. \\n\\n","sourceLink":"https://allnovel.net/the-last-oracle-sigma-force-5/page-6.html","bookId":1528,"book":{"id":1528,"title":"The Last Oracle (Sigma Force #5)","description":"Storyline: The Last Oracle (Sigma Force #5) \\n In Washington, D.C., a homeless man dies in Commander Gray Pierce\u0027s arms, shot by an assassin\u0027s bullet. But the death leaves behind a greater mystery: a bloody coin found clutched in the dead man\u0027s hand, an ancient relic that can be traced back to the Greek Oracle of Delphi. As ruthless hunters search for the stolen artifact, Gray Pierce discovers that the coin is the key to unlocking a plot that dates back to the Cold War and threatens the very foundation of humanity. \\n An international think tank of scientists known as the Jasons has discovered a way to bioengineer autistic children who show savant talents -- mathematical geniuses, statistical masterminds, brilliant conceptual artists -- into something far greater and far more \"frightening,\" in hopes of creating a world prophet for the new millennium, one to be manipulated to create a new era of global peace... a peace on their own terms. \\n Halfway around the world, a man wakes up in a hospital bed with no memory of who he is, knowing only that he\u0027s a prisoner in a subterranean research facility. With the help of three unusual children, he makes his escape across a mountainous and radioactive countryside, pursued by savage hunters bred in the same laboratory. But his goal is not escape, nor even survival. In order to thwart a plot to wipe out a quarter of the world\u0027s population, he must sacrifice all, even the children who rescued him. \\n From ancient Greek temples to glittering mausoleums, from the slums of India to the toxic ruins of Russia, two men must race against time to solve a mystery that dates back to the first famous oracle of history -- the Greek Oracle of Delphi. \\n But one question remains: \"Will the past be enough to save the future?\"\\n","cover":"https://allnovel.net/images/the-last-oracle-sigma-force-5.jpg","author":"James Rollins","type":"Adventure","source":"allnovel","link":"https://allnovel.net/the-last-oracle-sigma-force-5.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 10:33:23 PM"}}
