{"id":104109,"no":62,"title":"Page 62","content":"\\n\\n So in the end, the current plan was deemed efficient, minimally cruel, and offered the children one last bit of joy and frivolity.\\n\\n Still, Savina stood with her arms behind her back. Her hands were clenched together in a white-knuckled grip, necessary to keep from grabbing children and pulling them from the train.\\n\\n But she had saved ten.\\n\\n She had to console herself with this reality.\\n\\n The ten best.\\n\\n They remained in the apartment building behind her, where the control station for Operation Saturn was located. Once done here, the ten Omega subjects would be transported to the new facility in Moscow. It was time for the project to climb out of the darkness and into the sun.\\n\\n It would be her legacy.\\n\\n But such a rise had a cost.\\n\\n Bright laughter and merry calls trailed behind the last of the children. They argued over who would get to ride in the open ore cars and who would be in the front or rear cabs. Only a few older voices wondered why they were going without any of the adults, but even these sounded more excited than concerned.\\n\\n With the last of the children loaded, the train hissed, hydraulic brakes sighed, and with a snap of electricity, it rolled off down the tunnel. Laughter and shouts trailed back to them. A moment later the blast doors slowly sealed over the end of the tunnel, cutting off their happy voices.\\n\\n The four teachers headed away. No one spoke to anyone. They barely made contact. Except for a thick-waisted matron in an ankle-length apron. As she passed, she lifted a consoling hand toward Savina, then thought better of it and lowered it again.\\n\\n “You didn’t have to come,” the woman mumbled.\\n\\n Savina turned away without a word, not trusting her voice.\\n\\n Yes…Yes, I did.\\n\\n 11:16 A.M.\\n\\n Pripyat, Ukraine\\n\\n Gray sat in the back of the limousine. Up front, Rosauro drove, with Luca in the passenger seat. They rocketed past the first checkpoint on their flight out of the city. The Chernobyl Exclusion Zone stretched in a thirty-kilometer radius out from the reactor complex. It had two checkpoints, one at the ten-kilometer mark and one at the thirty.\\n\\n Gray wanted to be outside that second gate before anyone realized something was amiss at the reactor. It would not take long for the dead bodies to be discovered and for the place to be locked down.\\n\\n Earlier, as Gray and Kowalski had fled overland back to Pripyat from the site of the ceremony, he had called Rosauro on the walkie-talkie that Masterson had supplied him. She had reported an inability to reach Sigma command. He had instructed her to keep trying. By the time Gray arrived at the hotel, lines of communication with Washington had reopened. Rosauro had commandeered one of the limousines. She had also stolen the driver’s mobile phone.\\n\\n Gray clutched the phone now, awaiting a call from Director Crowe. Painter had his hands full over in Washington, but at least Mapplethorpe was out of commission and Sasha was safe.\\n\\n Gray shared the back of the limousine with Elizabeth and Kowalski. His partner sat bare-chested as Elizabeth treated the gunshot wound to his shoulder.\\n\\n “Quit wiggling!”\\n\\n “Well, it goddamn hurts.”\\n\\n “It’s just iodine.”\\n\\n “Sooo, it still stings like a son of a—”\\n\\n The woman’s scowl silenced any further expletive.\\n\\n Gray had to give the man credit. Kowalski had saved his life at the hangar by dropping that half-ton steel hook. Though Elena might have done the deed, it had been Kowalski’s sharp eyes that had noted the threat and saved him.\\n\\n Still, they weren’t out of danger yet.\\n\\n Gray turned and stared out at the roll of passing hills, dotted with copses of birches. His heart continued to pound. His mind spun through a hundred different scenarios. As they raced away from Chernobyl, he knew they should be heading somewhere.\\n\\n Nicolas’s last words plagued him: You’ve not won…millions will still die.\\n\\n What did he mean? Gray knew it had not been an idle threat. Something else was scheduled to happen. Even the name of Nicolas’s plan—Operation Uranus—had bothered Gray before. The name was taken from an old Soviet victory during World War II against the Germans. But the victory was not won by the single operation alone. It was accomplished via a perfectly executed tandem of strategies. Two operations: Uranus followed by Saturn.\\n\\n As Gray fled the hangar, Nicolas had hinted as much. Another operation was set to commence, but where and in what form?\\n\\n The phone finally rang.\\n\\n Gray flipped it open and pressed it to his ear. “Director Crowe?”\\n\\n “How are you doing out there?” Painter asked.\\n\\n “As well as can be expected.”\\n\\n “I’ve got transportation arranged for you. There’s a private airstrip a few miles outside the Exclusion Zone, used to accommodate the ceremony’s VIP guests. British intelligence has offered the use of one of their jets. They’re apparently trying to save face for not listening close enough to Professor Masterson, one of their own former agents. By the way, I’ve gone ahead and sounded the alarm. Word is spreading like wildfire through intelligence channels about the aborted attack at Chernobyl. For safety’s sake, evacuations are already under way, but so far you’re ahead of that chaos.”\\n\\n “Very good.” Gray could not discount that the director’s firm voice had helped take the edge off his anxiety. He wasn’t alone in this.\\n\\n “You’ve certainly had a busy day, Commander.”\\n\\n “As have you…but I don’t think it’s over.”\\n\\n “How do you mean?”\\n\\n Gray related what the Russian senator had said and about his own misgivings.\\n\\n “Hold on,” Painter said. “I’ve got Kat Bryant and Malcolm Jennings here. I’m putting you on speaker.”\\n\\n Gray continued, explaining his fears of a second operation, something aimed at a larger number of casualties.\\n\\n Kowalski also listened as Elizabeth packed a bandage over his wound. “Tell them about the jelly beans,” he called over.\\n\\n Gray frowned at him. Back at the hangar, Elena had attempted to warn Kowalski about something before she’d departed to Nicolas’s side, but the man had clearly misunderstood, losing something in the translation.\\n\\n “You know,” Kowalski pressed. “The eighty-eight jelly beans.”\\n\\n Kat’s voice whispered faintly from the phone. “What did he say?”\\n\\n “I don’t think he understood what—”\\n\\n “Did he say chella-bins?”\\n\\n “No, jelly beans!”\\n\\n Kowalski nodded, satisfied. Gray mentally shook his head. He could not believe he was having this conversation.\\n\\n A confusing bit of chatter followed as Painter, Kat, and Malcolm discussed some matter. Gray didn’t follow all of it. He heard Kat say something about the number eighty-eight drawn in blood.\\n\\n Malcolm’s voice spoke louder, excited, directed at both Gray and Kat. “Could what you both have heard been the word Chelyabinsk?”\\n\\n “Chelyabinsk?” Gray asked aloud.\\n\\n Kowalski perked up.\\n\\n Gray rolled his eyes. “That might be it.”\\n\\n Kat agreed.\\n\\n Malcolm spoke quickly, a sure sign the pathologist was excited. “I’ve come across that name. During all the tumult here, I hadn’t had a chance to contemplate its significance.”\\n\\n “What?” Painter pressed.\\n\\n “Dr. Polk’s body. The radiation signature from samples in his lungs matched the specific isotope content of the uranium and plutonium used at Chernobyl. But as you know, subsequent tests clouded this assessment. It wasn’t as clear as I’d initially thought. It was more like his body had been polluted by a mix of radioactive sources, though the strongest still appeared to be the fuel source at Chernobyl.”\\n\\n “Where are you going with all this?” Kat asked.\\n\\n “I based my findings on the International Atomic Energy Agency’s database of hot zones. But one region of the world is so polluted by radioactivity that it’s impossible to define one signature to it. That region is Chelyabinsk, in central Russia. The Soviet Union hid the heart of its uranium mining and plutonium production in the Ural Mountains there. For five decades, the region was off-limits to everyone. Only in the last couple of years has the restriction been lifted.” He paused for emphasis. “It was in Chelyabinsk that the fuel for Chernobyl was mined and stored.”\\n\\n Gray sat straighter. “And you think it was there that Dr. Polk was poisoned—not at the reactor, but where its fuel was produced. In Chelyabinsk.”\\n\\n “I believe so. Even the number eighty-eight. The Soviets built underground mining cities in the Ural Mountains and named them after the local postal codes. Chelyabinsk forty, Chelyabinsk seventy-five.”\\n\\n And Chelyabinsk 88.\\n\\n Gray’s heart pounded harder again. He now knew where they had to go. Even had the postal code.\\n\\n Painter understood, too. “I’ll alert British intelligence. Let them know you’ll be going on a little detour. They should be able to get you to the Ural Mountains in a little over an hour.”\\n\\n Gray prayed they still had enough time.\\n\\n Millions will die.\\n\\n As the limousine reached the second checkpoint and was waved through by a bored-looking guard, Painter continued. “But, Commander, in such a short time, I can’t get you any ground support out there.”\\n\\n Gray spoke as the limousine sailed out of the Exclusion Zone and into the open country. “I think we’ve got that covered.”\\n\\n To either side of the road, older-model trucks had parked in low ditches or pulled into turnouts. A good dozen of them. Men sat in the open beds and crowded the cabs.\\n\\n In the front seat, Luca leaned over to Rosauro and spoke in a rush. She slowed the limousine, and Luca straightened and waved an arm out the passenger window.\\n\\n The signal was plain to read.\\n\\n Follow us.\\n\\n As the limousine continued, the trucks pulled out and trailed after them. Like Director Crowe, Luca Hearn had sounded his own alarm, using the phones back at the hotel after they’d initially failed to raise central command.\\n\\n Gray recalled the man’s words in describing the Romani: We are everywhere. Luca was proven right as his clarion call was answered. \\n\\n","sourceLink":"https://allnovel.net/the-last-oracle-sigma-force-5/page-62.html","bookId":1528,"book":{"id":1528,"title":"The Last Oracle (Sigma Force #5)","description":"Storyline: The Last Oracle (Sigma Force #5) \\n In Washington, D.C., a homeless man dies in Commander Gray Pierce\u0027s arms, shot by an assassin\u0027s bullet. But the death leaves behind a greater mystery: a bloody coin found clutched in the dead man\u0027s hand, an ancient relic that can be traced back to the Greek Oracle of Delphi. As ruthless hunters search for the stolen artifact, Gray Pierce discovers that the coin is the key to unlocking a plot that dates back to the Cold War and threatens the very foundation of humanity. \\n An international think tank of scientists known as the Jasons has discovered a way to bioengineer autistic children who show savant talents -- mathematical geniuses, statistical masterminds, brilliant conceptual artists -- into something far greater and far more \"frightening,\" in hopes of creating a world prophet for the new millennium, one to be manipulated to create a new era of global peace... a peace on their own terms. \\n Halfway around the world, a man wakes up in a hospital bed with no memory of who he is, knowing only that he\u0027s a prisoner in a subterranean research facility. With the help of three unusual children, he makes his escape across a mountainous and radioactive countryside, pursued by savage hunters bred in the same laboratory. But his goal is not escape, nor even survival. In order to thwart a plot to wipe out a quarter of the world\u0027s population, he must sacrifice all, even the children who rescued him. \\n From ancient Greek temples to glittering mausoleums, from the slums of India to the toxic ruins of Russia, two men must race against time to solve a mystery that dates back to the first famous oracle of history -- the Greek Oracle of Delphi. \\n But one question remains: \"Will the past be enough to save the future?\"\\n","cover":"https://allnovel.net/images/the-last-oracle-sigma-force-5.jpg","author":"James Rollins","type":"Adventure","source":"allnovel","link":"https://allnovel.net/the-last-oracle-sigma-force-5.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 10:33:23 PM"}}
