{"id":14581,"no":39,"title":"Chapter 8.","content":"The agitation of Venetia on her return was not unnoticed by her mother; but Lady Annabel ascribed it to a far different cause than the real one. She was rather surprised when the breakfast passed, and Lord Cadurcis did not appear; somewhat perplexed when her daughter seized the earliest opportunity of retiring to her own chamber; but, with that self-restraint of which she was so complete a mistress, Lady Annabel uttered no remark. Once more alone, Venetia could only repeat to herself the wild words that had burst from Plantagenet’s lips in reference to her father. What could they mean? His morals might be misrepresented, his opinions might be misunderstood; stupidity might not comprehend his doctrines, malignity might torture them; the purest sages have been accused of immorality, the most pious philosophers have been denounced as blasphemous: but, ‘a traitor to his king,’ that was a tangible, an intelligible proposition, one with which all might grapple, which could be easily disproved if false, scarcely propounded were it not true. ‘False to his God!’ How false? Where? When? What mystery involved her life? Unhappy girl! in vain she struggled with the overwhelming burden of her sorrows. Now she regretted that she had quarrelled with Cadurcis; it was evident that he knew everything and would have told her all. And then she blamed him for his harsh and unfeeling demeanour, and his total want of sympathy with her cruel and perplexing situation. She had intended, she had struggled to be so kind to him; she thought she had such a plain tale to tell that he would have listened to it in considerate silence, and bowed to her necessary and inevitable decision without a murmur. Amid all these harassing emotions her mind tossed about like a ship without a rudder, until, in her despair, she almost resolved to confess everything to her mother, and to request her to soothe and enlighten her agitated and confounded mind. But what hope was there of solace or information from such a quarter? Lady Annabel’s was not a mind to be diverted from her purpose. Whatever might have been the conduct of her husband, it was evident that Lady Annabel had traced out a course from which she had resolved not to depart. She remembered the earnest and repeated advice of Dr. Masham, that virtuous and intelligent man who never advised anything but for their benefit. How solemnly had he enjoined upon her never to speak to her mother upon the subject, unless she wished to produce misery and distress! And what could her mother tell her? Her father lived, he had abandoned her, he was looked upon as a criminal, and shunned by the society whose laws and prejudices he had alike outraged. Why should she revive, amid the comparative happiness and serenity in which her mother now lived, the bitter recollection of the almost intolerable misfortune of her existence? No! Venetia was resolved to be a solitary victim. In spite of her passionate and romantic devotion to her father she loved her mother with perfect affection, the mother who had dedicated her life to her child, and at least hoped she had spared her any share in their common unhappiness. And this father, whoso image haunted her dreams, whose unknown voice seemed sometimes to float to her quick ear upon the wind, could he be that abandoned being that Cadurcis had described, and that all around her, and all the circumstances of her life, would seem to indicate? Alas! it might be truth; alas! it seemed like truth: and for one so lost, so utterly irredeemable, was she to murmur against that pure and benevolent parent who had cherished her with such devotion, and snatched her perhaps from disgrace, dishonour, and despair! And Cadurcis, would he return? With all his violence, the kind Cadurcis! Never did she need a brother more than now; and now he was absent, and she had parted with him in anger, deep, almost deadly: she, too, who had never before uttered a harsh word to a human being, who had been involved in only one quarrel in her life, and that almost unconsciously, and which had nearly broken her heart. She wept, bitterly she wept, this poor Venetia! By one of those mental efforts which her strange lot often forced her to practise, Venetia at length composed herself, and returned to the room where she believed she would meet her mother, and hoped she should see Cadurcis. He was not there: but Lady Annabel was seated as calm and busied as usual; the Doctor had departed. Even his presence would have proved a relief, however slight, to Venetia, who dreaded at this moment to be alone with her mother. She had no cause, however, for alarm; Lord Cadurcis never appeared, and was absent even from dinner; the day died away, and still he was wanting; and at length Venetia bade her usual good night to Lady Annabel, and received her usual blessing and embrace without his name having been even mentioned. Venetia passed a disturbed night, haunted by painful dreams, in which her father and Cadurcis were both mixed up, and with images of pain, confusion, disgrace, and misery; but the morrow, at least, did not prolong her suspense, for just as she had joined her mother at breakfast, Mistress Pauncefort, who had been despatched on some domestic mission by her mistress, entered with a face of wonder, and began as usual: ‘Only think, my lady; well to be sure, who have thought it? I am quite confident, for my own part, I was quite taken aback when I heard it; and I could not have believed my ears, if John had not told me himself, and he had it from his lordship’s own man.’ ‘Well, Pauncefort, what have you to say?’ inquired Lady Annabel, very calmly. ‘And never to send no note, my lady; at least I have not seen one come up. That makes it so very strange.’ ‘Makes what, Pauncefort?’ ‘Why, my lady, doesn’t your la’ship know his lordship left the abbey yesterday, and never said nothing to nobody; rode off without a word, by your leave or with your leave? To be sure he always was the oddest young gentleman as ever I met with; and, as I said to John: John, says I, I hope his lordship has not gone to join the gipsies again.’ Venetia looked into a teacup, and then touched an egg, and then twirled a spoon; but Lady Annabel seemed quite imperturbable, and only observed, ‘Probably his guardian is ill, and he has been suddenly summoned to town. I wish you would bring my knitting-needles, Pauncefort.’ The autumn passed, and Lord Cadurcis never returned to the abbey, and never wrote to any of his late companions. Lady Annabel never mentioned his name; and although she seemed to have no other object in life but the pleasure and happiness of her child, this strange mother never once consulted Venetia on the probable occasion of his sudden departure, and his strange conduct.","sourceLink":"http://novel.tingroom.com/jingdian/1392/41740.html","bookId":1425,"book":{"id":1425,"title":"Venetia","description":"简介： Some ten years before the revolt of our American colonies, there was situate in one of our midland counties, on the borders of an extensive forest, an ancient hall that belonged to the Herberts, but which, though ever well preserved, had not until th...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1392","creation":"Aug 1, 2019 12:25:05 AM","modification":"Aug 1, 2019 12:25:05 AM"}}
