{"id":14590,"no":48,"title":"Chapter 9.","content":"It was the night after the drawing-room. Lord Cadurcis was at Brookes’ dining at midnight, having risen since only a few hours. Being a malcontent, he had ceased to attend the Court, where his original reception had been most gracious, which he had returned by some factious votes, and a caustic lampoon. A party of young men entered, from the Court Ball, which in those days always terminated at midnight, whence the guests generally proceeded to Ranelagh; one or two of them seated themselves at the table at which Cadurcis was sitting. They were full of a new beauty who had been presented. Their violent and even extravagant encomiums excited his curiosity. Such a creature had never been seen, she was peerless, the most radiant of acknowledged charms had been dimmed before her. Their Majesties had accorded to her the most marked reception. A Prince of the blood had honoured her with his hand. Then they began to expatiate with fresh enthusiasm on her unparalleled loveliness. ‘O Cadurcis,’ said a young noble, who was one of his extreme admirers, ‘she is the only creature I ever beheld worthy of being one of your heroines.’ ‘Whom are you talking about?’ asked Cadurcis in a rather listless tone. ‘The new beauty, of course.’ ‘And who may she be?’ ‘Miss Herbert, to be sure. Who speaks or thinks of any one else?’ ‘What, Ve — — I mean Miss Herbert?’ exclaimed Cadurcis, with no little energy. ‘Yes. Do you know her?’ ‘Do you mean to say —’ and Cadurcis stopped and rose from the table, and joined the party round the fire. ‘What Miss Herbert is it?’ he added, after a short pause. ‘Why the Miss Herbert; Herbert’s daughter, to be sure. She was presented today by her mother. ‘Lady Annabel?’ ‘The same.’ ‘Presented today!’ said Cadurcis audibly, yet speaking as it were to himself. ‘Presented today! Presented! How strange!’ ‘So every one thinks; one of the strangest things that ever happened,’ remarked a bystander. ‘And I did not even know they were in town,’ continued Cadurcis, for, from his irregular hours, he had not seen his cousin since the party of yesterday. He began walking up and down the room, muttering, ‘Masham, Weymouth, London, presented at Court, and I know nothing. How life changes! Venetia at Court, my Venetia!’ Then turning round and addressing the young nobleman who had first spoken to him, he asked ‘if the ball were over.’ ‘Yes; all the world are going to Ranelagh. Are you inclined to take a round?’ ‘I have a strange fancy,’ said Cadurcis, ‘and if you will go with me, I will take you in my vis-à-vis. It is here.’ This was an irresistible invitation, and in a few minutes the companions were on their way; Cadurcis, apparently with no peculiar interest in the subject, leading the conversation very artfully to the presentation of Miss Herbert. His friend was heartily inclined to gratify his curiosity. He gave him ample details of Miss Herbert’s person: even of her costume, and the sensation both produced; how she was presented by her mother, who, after so long an estrangement from the world, scarcely excited less impression, and the remarkable cordiality with which both mother and daughter were greeted by the sovereign and his royal consort. The two young noblemen found Ranelagh crowded, but the presence of Lord Cadurcis occasioned a sensation the moment he was recognised. Everywhere the whisper went round, and many parties crowded near to catch a glimpse of the hero of the day. ‘Which is he? That fair, tall young man? No, the other to be sure. Is it really he? How distinguished! How melancholy! Quite the poet. Do you think he is really so unhappy as he looks? I would sooner see him than the King and Queen. He seems very young, but then he has seen so much of the world! Fine eyes, beautiful hair! I wonder who is his friend? How proud he must be! Who is that lady he bowed to? That is the Duke of —— speaking to him,’ Such were the remarks that might be caught in the vicinity of Lord Cadurcis as he took his round, gazed at by the assembled crowd, of whom many knew him only by fame, for the charm of Ranelagh was that it was rather a popular than a merely fashionable assembly. Society at large blended with the Court, which maintained and renewed its influence by being witnessed under the most graceful auspices. The personal authority of the aristocracy has decreased with the disappearance of Ranelagh and similar places of amusement, where rank was not exclusive, and luxury by the gratification it occasioned others seemed robbed of half its selfism. In his second round, Lord Cadurcis recognised the approach of the Herberts. They formed the portion of a large party. Lady Annabel was leaning on her brother, whom Cadurcis knew by sight; Venetia was at the side of her aunt, and several gentlemen were hovering about them; among them, to his surprise, his cousin, George Cadurcis, in his uniform, for he had been to Court and to the Court Ball. Venetia was talking with animation. She was in her Court dress and in powder. Her appearance was strange to him. He could scarcely recognise the friend of his childhood; but without any doubt in all that assembly, unrivalled in the whole world for beauty, grace, and splendour, she was without a parallel; a cynosure on which all eyes were fixed. So occupied were the ladies of the Herbert party by the conversation of their numerous and brilliant attendants, that the approach of any one else but Lord Cadurcis might have been unnoticed by them, but a hundred tongues before he drew nigh had prepared Venetia for his appearance. She was indeed most anxious to behold him, and though she was aware that her heart fluttered not slightly as the moment was at hand, she commanded her gaze, and her eyes met his, although she was doubtful whether he might choose or care to recognise her. He bowed almost to the ground; and when Venetia had raised her responsive head he had passed by. ‘Why, Cadurcis, you know Miss Herbert?’ said his friend in a tone of some astonishment. ‘Well; but it is a long time since I have seen her.’ ‘Is she not beautiful?’ ‘I never doubted on that subject; I tell you, Scrope, we must contrive to join her party. I wish we had some of our friends among them. Here comes the Monteagle; aid me to escape her.’ The most fascinating smile failed in arresting the progress of Cadurcis; fortunately, the lady was the centre of a brilliant band; all that he had to do, therefore, was boldly to proceed. ‘Do you think my cousin is altered since you knew him?’ inquired George Cadurcis of Venetia. ‘I scarcely had time to observe him,’ she replied. ‘I wish you would let me bring him to you. He did not know until this moment you were in town. I have not seen him since we met yesterday.’ ‘Oh, no,’ said Venetia. ‘Do not disturb him.’ In time, however, Lord Cadurcis was again in sight; and now without any hesitation he stopped, and falling into the line by Miss Herbert, he addressed her: ‘I am proud of being remembered by Miss Herbert,’ he said. ‘I am most happy to meet you,’ replied Venetia, with unaffected sincerity. ‘And Lady Annabel, I have not been able to catch her eye: is she quite well? I was ignorant that you were in London until I heard of your triumph this night.’ The Countess whispered her niece, and Venetia accordingly presented Lord Cadurcis to her aunt. This was a most gratifying circumstance to him. He was anxious, by some means or other, to effect his entrance into her circle; and he had an irresistible suspicion that Lady Annabel no longer looked upon him with eyes of favour. So he resolved to enlist the aunt as his friend. Few persons could be more winning than Cadurcis, when he willed it; and every attempt to please from one whom all emulated to gratify and honour, was sure to be successful. The Countess, who, in spite of politics, was a secret votary of his, was quite prepared to be enchanted. She congratulated herself on forming, as she had long wished, an acquaintance with one so celebrated. She longed to pass Lady Monteagle in triumph. Cadurcis improved his opportunity to the utmost. It was impossible for any one to be more engaging; lively, yet at the same time gentle, and deferential with all his originality. He spoke, indeed, more to the aunt than to Venetia, but when he addressed the latter, there was a melting, almost a mournful tenderness in his tones, that alike affected her heart and charmed her imagination. Nor could she be insensible to the gratification she experienced as she witnessed, every instant, the emotion his presence excited among the passers-by, and of which Cadurcis himself seemed so properly and so utterly unconscious. And this was Plantagenet! Lord Cadurcis spoke of his cousin, who, on his joining the party, had assisted the arrangement by moving to the other side; and he spoke of him with a regard which pleased Venetia, though Cadurcis envied him his good fortune in having the advantage of a prior acquaintance with Miss Herbert in town; ‘but then we are old acquaintances in the country,’ he added, half in a playful, half in a melancholy tone, ‘are we not?’ ‘It is a long time that we have known each other, and it is a long time since we have met,’ replied Venetia. ‘A delicate reproach,’ said Cadurcis; ‘but perhaps rather my misfortune than my fault. My thoughts have been often, I might say ever, at Cherbury.’ ‘And the abbey; have you forgotten the abbey?’ ‘I have never been near it since a morning you perhaps remember,’ said his lordship in a low voice. ‘Ah! Miss Herbert,’ he continued, with a sigh, ‘I was young then; I have lived to change many opinions, and some of which you then disapproved.’ The party stopped at a box just vacant, and in which the ladies seated themselves while their carriages were inquired for. Lord Cadurcis, with a rather faltering heart, went up to pay his respects to Venetia’s mother. Lady Annabel received him with a courtesy, that however was scarcely cordial, but the Countess instantly presented him to her husband with an unction which a little astonished her sister-in-law. Then a whisper, but unobserved, passed between the Earl and his lady, and in a minute Lord Cadurcis had been invited to dine with them on the next day, and meet his old friends from the country. Cadurcis was previously engaged, but hesitated not a moment in accepting the invitation. The Monteagle party now passed by; the lady looked a little surprised at the company in which she found her favourite, and not a little mortified by his neglect. What business had Cadurcis to be speaking to that Miss Herbert? Was it not enough that the whole day not another name had scarcely crossed her ear, but the night must even witness the conquest of Lord Cadurcis by the new beauty? It was such bad ton, it was so unlike him, it was so underbred, for a person of his position immediately to bow before the new idol of the hour, and a Tory girl too! It was the last thing she could have expected from him. She should, on the contrary, have thought that the universal admiration which this Miss Herbert commanded, would have been exactly the reason why a man like Cadurcis would have seemed almost unconscious of her existence. She determined to remonstrate with him; and she was sure of a speedy opportunity, for he was to dine with her on the morrow.","sourceLink":"http://novel.tingroom.com/jingdian/1392/42307.html","bookId":1425,"book":{"id":1425,"title":"Venetia","description":"简介： Some ten years before the revolt of our American colonies, there was situate in one of our midland counties, on the borders of an extensive forest, an ancient hall that belonged to the Herberts, but which, though ever well preserved, had not until th...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1392","creation":"Aug 1, 2019 12:25:05 AM","modification":"Aug 1, 2019 12:25:05 AM"}}
