{"id":14605,"no":63,"title":"Chapter 5.","content":"The waiter threw open the door of Mr. Herbert’s chamber, and Lady Annabel swept in with a majesty she generally assumed when about to meet strangers. The first thing she beheld was her daughter in the arms of a man whose head was bent, and who was embracing her. Notwithstanding this astounding spectacle, Lady Annabel neither started nor screamed; she only said in an audible tone, and one rather expressing astonishment than agitation, ‘Venetia!’ \n \n Immediately the stranger looked up, and Lady Annabel beheld her husband! \n \n She was rooted to the earth. She turned deadly pale; for a moment her countenance expressed only terror, but the terror quickly changed into aversion. Suddenly she rushed forward, and exclaimed in a tone in which decision conquered dismay, ‘Restore me my child!’ \n \n The moment Herbert had recognised his wife he had dexterously disengaged himself from the grasp of Venetia, whom he left on the chair, and meeting Lady Annabel with extended arms, that seemed to deprecate her wrath, he said, ‘I seek not to deprive you of her; she is yours, and she is worthy of you; but respect, for a few moments, the feelings of a father who has met his only child in a manner so unforeseen.’ \n \n The presence of her mother instantaneously restored Venetia to herself. Her mind was in a moment cleared and settled. Her past and peculiar life, and all its incidents, recurred to her with their accustomed order, vividness, and truth. She thoroughly comprehended her present situation. Actuated by long-cherished feelings and the necessity of the occasion, she rose and threw herself at her mother’s feet and exclaimed, ‘O mother! he is my father, love him!’ \n \n Lady Annabel stood with an averted countenance, Venetia clinging to her hand, which she had caught when she rushed forward, and which now fell passive by Lady Annabel’s side, giving no sign, by any pressure or motion, of the slightest sympathy with her daughter, or feeling for the strange and agonising situation in which they were both placed. \n \n ‘Annabel,’ said Herbert, in a voice that trembled, though the speaker struggled to appear calm, ‘be charitable! I have never intruded upon your privacy; I will not now outrage it. Accident, or some diviner motive, has brought us together this day. If you will not treat me with kindness, look not upon me with aversion before our child.’ \n \n Still she was silent and motionless, her countenance hidden from her husband and her daughter, but her erect and haughty form betokening her inexorable mind. ‘Annabel,’ said Herbert, who had now withdrawn to some distance, and leant against a pillar, ‘will not then nearly twenty years of desolation purchase one moment of intercourse? I have injured you. Be it so. This is not the moment I will defend myself. But have I not suffered? Is not this meeting a punishment deeper even than your vengeance could devise? Is it nothing to behold this beautiful child, and feel that she is only yours? Annabel, look on me, look on me only one moment! My frame is bowed, my hair is grey, my heart is withered; the principle of existence waxes faint and slack in this attenuated frame. I am no longer that Herbert on whom you once smiled, but a man stricken with many sorrows. The odious conviction of my life cannot long haunt you; yet a little while, and my memory will alone remain. Think of this, Annabel; I beseech you, think of it. Oh! believe me, when the speedy hour arrives that will consign me to the grave, where I shall at least find peace, it will not be utterly without satisfaction that you will remember that we met if even by accident, and parted at least not with harshness!’ \n \n ‘Mother, dearest mother!’ murmured Venetia, ‘speak to him, look on him!’ \n \n ‘Venetia,’ said her mother, without turning her head, but in a calm, firm tone, ‘your father has seen you, has conversed with you. Between your father and myself there can be nothing to communicate, either of fact or feeling. Now let us depart.’ \n \n ‘No, no, not depart!’ said Venetia franticly. ‘You did not say depart, dear mother! I cannot go,’ she added in a low and half-hysterical voice. \n \n ‘Desert me, then,’ said the mother. ‘A fitting consequence of your private communications with your father,’ she added in a tone of bitter scorn; and Lady Annabel moved to depart, but Venetia, still kneeling, clung to her convulsively. \n \n ‘Mother, mother, you shall not go; you shall not leave me; we will never part, mother,’ continued Venetia, in a tone almost of violence, as she perceived her mother give no indication of yielding to her wish. ‘Are my feelings then nothing?’ she then exclaimed. ‘Is this your sense of my fidelity? Am I for ever to be a victim?’ She loosened her hold of her mother’s hand, her mother moved on, Venetia fell upon her forehead and uttered a faint scream. The heart of Lady Annabel relented when she fancied her daughter suffered physical pain, however slight; she hesitated, she turned, she hastened to her child; her husband had simultaneously advanced; in the rapid movement and confusion her hand touched that of Herbert. \n \n ‘I yield her to you, Annabel,’ said Herbert, placing Venetia in her mother’s arms. ‘You mistake me, as you have often mistaken me, if you think I seek to practise on the feelings of this angelic child. She is yours; may she compensate you for the misery I have caused you, but never sought to occasion!’ \n \n ‘I am not hurt, dear mother,’ said Venetia, as her mother tenderly examined her forehead. ‘Dear, dear mother, why did you reproach me?’ \n \n ‘Forget it,’ said Lady Annabel, in a softened tone; ‘for indeed you are irreproachable.’ \n \n ‘O Annabel!’ said Herbert, ‘may not this child be some atonement, this child, of whom I solemnly declare I would not deprive you, though I would willingly forfeit my life for a year of her affection; and your, your sufferance,’ he added. \n \n ‘Mother! speak to him,’ said Venetia, with her head on her mother’s bosom, who still, however, remained rigidly standing. But Lady Annabel was silent. \n \n ‘Your mother was ever stern and cold, Venetia,’ said Herbert, the bitterness of his heart at length expressing itself. \n \n ‘Never,’ said Venetia, with great energy; ‘never; you know not my mother. Was she stern and cold when she visited each night in secret your portrait?’ said Venetia, looking round upon her astonished father, with her bright grey eye. ‘Was she stern and cold when she wept over your poems, those poems whose characters your own hand had traced? Was she stern and cold when she hung a withered wreath on your bridal bed, the bed to which I owe my miserable being? Oh, no, my father! sad was the hour of separation for my mother and yourself. It may have dimmed the lustre of her eye, and shaded your locks with premature grey; but whatever may have been its inscrutable cause, there was one victim of that dark hour, less thought of than yourselves, and yet a greater sufferer than both, the being in whose heart you implanted affections, whose unfulfilled tenderness has made that wretched thing they call your daughter.’ \n \n ‘Annabel!’ exclaimed Herbert, rapidly advancing, with an imploring gesture, and speaking in a tone of infinite anguish, ‘Annabel, Annabel, even now we can be happy!’ \n \n The countenance of his wife was troubled, but its stern expression had disappeared. The long-concealed, yet at length irrepressible, emotion of Venetia had touched her heart. In the conflict of affection between the claims of her two parents, Lady Annabel had observed with a sentiment of sweet emotion, in spite of all the fearfulness of the meeting, that Venetia had not faltered in her devotion to her mother. The mental torture of her child touched her to the quick. In the excitement of her anguish, Venetia had expressed a profound sentiment, the irresistible truth of which Lady Annabel could no longer withstand. She had too long and too fondly schooled herself to look upon the outraged wife as the only victim. There was then, at length it appeared to this stern-minded woman, another. She had laboured in the flattering delusion that the devotion of a mother’s love might compensate to Venetia for the loss of that other parent, which in some degree Lady Annabel had occasioned her; for the worthless husband, had she chosen to tolerate the degrading connection, might nevertheless have proved a tender father. But Nature, it seemed, had shrunk from the vain effort of the isolated mother. The seeds of affection for the father of her being were mystically implanted in the bosom of his child. Lady Annabel recalled the harrowing hours that this attempt by her to curb and control the natural course and rising sympathies of filial love had cost her child, on whom she had so vigilantly practised it. She recalled her strange aspirations, her inspired curiosity, her brooding reveries, her fitful melancholy, her terrible illness, her resignation, her fidelity, her sacrifices: there came across the mind of Lady Annabel a mortifying conviction that the devotion to her child, on which she had so rated herself, might after all only prove a subtle form of profound selfishness; and that Venetia, instead of being the idol of her love, might eventually be the martyr of her pride. And, thinking of these things, she wept. \n \n This evidence of emotion, which in such a spirit Herbert knew how to estimate, emboldened him to advance; he fell on one knee before her and her daughter; gently he stole her hand, and pressed it to his lips. It was not withdrawn, and Venetia laid her hand upon theirs, and would have bound them together had her mother been relentless. It seemed to Venetia that she was at length happy, but she would not speak, she would not disturb the still and silent bliss of the impending reconciliation. Was it then indeed at hand? In truth, the deportment of Herbert throughout the whole interview, so delicate, so subdued, so studiously avoiding the slightest rivaly with his wife in the affections of their child, and so carefully abstaining from attempting in the slightest degree to control the feelings of Venetia, had not been lost upon Lady Annabel. And when she thought of him, so changed from what he had been, grey, bent, and careworn, with all the lustre that had once so fascinated her, faded, and talking of that impending fate which his wan though spiritual countenance too clearly intimated, her heart melted. \n \n Suddenly the door burst open, and there stalked into the room a woman of eminent but most graceful stature, and of a most sovereign and voluptuous beauty. She was habited in the Venetian dress; her dark eyes glittered with fire, her cheek was inflamed with no amiable emotion, and her long black hair was disordered by the violence of her gesture. \n \n ‘And who are these?’ she exclaimed in a shrill voice. \n \n All started; Herbert sprang up from his position with a glance of withering rage. Venetia was perplexed, Lady Annabel looked round, and recognised the identical face, however distorted by passion, that she had admired in the portrait at Arqua. \n \n ‘And who are these?’ exclaimed the intruder, advancing. ‘Perfidious Marmion! to whom do you dare to kneel?’ \n \n Lady Annabel drew herself up to a height that seemed to look down even upon this tall stranger. The expression of majestic scorn that she cast upon the intruder made her, in spite of all her violence and excitement, tremble and be silent: she felt cowed she knew not why. \n \n ‘Come, Venetia,’ said Lady Annabel with all her usual composure, ‘let me save my daughter at least from this profanation,’ \n \n ‘Annabel!’ said Herbert, rushing after them, ‘be charitable, be just!’ He followed them to the threshold of the door; Venetia was silent, for she was alarmed. \n \n ‘Adieu, Marmion!’ said Lady Annabel, looking over her shoulder with a bitter smile, but placing her daughter before her, as if to guard her. ‘Adieu, Marmion! adieu for ever!’ \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1392/42322.html","bookId":1425,"book":{"id":1425,"title":"Venetia","description":"简介： Some ten years before the revolt of our American colonies, there was situate in one of our midland counties, on the borders of an extensive forest, an ancient hall that belonged to the Herberts, but which, though ever well preserved, had not until th...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1392","creation":"Aug 1, 2019 12:25:05 AM","modification":"Aug 1, 2019 12:25:05 AM"}}
