{"id":14607,"no":65,"title":"Chapter 7.","content":"The moment that the wife of Marmion Herbert reentered her saloon, she sent for her courier and ordered horses to her carriage instantly. Until they were announced as ready, Lady Annabel walked up and down the room with an impatient step, but was as completely silent as the miserable Venetia, who remained weeping on the sofa. The confusion and curiosity of Mistress Pauncefort were extraordinary. She still had a lurking suspicion that the gentleman was Lord Cadurcis and she seized the first opportunity of leaving the room, and flouncing into that of the stranger, as if by mistake, determined to catch a glimpse of him; but all her notable skill was baffled, for she had scarcely opened the door before she was met by the Italian lady, who received Mistress Pauncefort’s ready-made apology, and bowed her away. The faithful attendant then hurried downstairs to crossexamine the waiter, but, though she gained considerable information from that functionary, it was of a perplexing nature; for from him she only learnt that the stranger lived at Arqua. ‘The German gentleman!’ soliloquised Mistress Pauncefort; ‘and what could he have to say to Miss Venetia! and a married man, too! Well, to be sure, there is nothing like travelling for adventures! And I must say, considering all that I know, and how I have held my tongue for nearly twenty years, I think it is very strange indeed of my lady to have any secrets from me. Secrets, indeed! Poh!’ and Mistress Pauncefort flounced again into Lady Annabel’s room, with a face of offended pride, knocking the books about, dashing down writing cases, tossing about work, and making as much noise and disturbance as if she had a separate quarrel with every single article under her superintendence. \n \n In the meantime the carriage was prepared, to which they were obliged almost to carry Venetia, feeble and stupefied with grief. Uncertain of her course, but anxious, in the present state of her daughter, for rest and quiet, Lady Annabel ordered the courier to proceed to Padua, at which city they arrived late at night, scarcely a word having been interchanged during the whole journey between Lady Annabel and her child, though infinite were the soft and soothing attentions which the mother lavished upon her. Night, however, brought no rest to Venetia; and the next day, her state appeared so alarming to Lady Annabel, that she would have instantly summoned medical assistance, had it not been for Venetia’s strong objections. ‘Indeed, dear mother,’ she said, ‘it is not physicians that I require. They cannot cure me. Let me be quiet.’ \n \n The same cause, indeed, which during the last five years had at intervals so seriously menaced the existence of this unhappy girl, was now at work with renovated and even irresistible influence. Her frame could no longer endure the fatal action of her over-excited nerves. Her first illness, however alarming, had been baffled by time, skill, and principally by the vigour of an extremely youthful frame, then a stranger to any serious indisposition. At a later period, the change of life induced by their residence at Weymouth had permitted her again to rally. She had quitted England with renewed symptoms of her former attack, but a still more powerful change, not only of scene, but of climate and country, and the regular and peaceful life she had led on the Lago Maggiore, had again reassured the mind of her anxious mother. This last adventure at Rovigo, however, prostrated her. The strange surprise, the violent development of feeling, the agonising doubts and hopes, the terrible suspense the profound and bitter and overwhelming disappointment, all combined to shake her mind to its very foundations. She felt for the first time, that she could no longer bear up against the torture of her singular position. Her energy was entirely exhausted; she was no longer capable of making the slightest exertion; she took refuge in that torpid resignation that results from utter hopelessness. \n \n Lying on her sofa with her eyes fixed in listless abstraction, the scene at Rovigo flitted unceasingly before her languid vision. At length she had seen that father, that unknown and mysterious father, whose idea had haunted her infancy as if by inspiration; to gain the slightest knowledge of whom had cost her many long and acute suffering; and round whose image for so many years every thought of her intelligence, and every feeling of her heart, had clustered like spirits round some dim and mystical altar, At length she had beheld him; she had gazed on that spiritual countenance; she had listened to the tender accents of that musical voice; within his arms she had been folded with rapture, and pressed to a heart that seemed to beat only for her felicity. The blessing of her father, uttered by his long-loved lips, had descended on her brow, and been sealed with his passionate embrace. \n \n The entrance of her mother, that terrible contest of her lacerated heart, when her two parents, as it were, appealed to her love, which they would not share; the inspiration of her despair, that so suddenly had removed the barriers of long years, before whose irresistible pathos her father had bent a penitent, and her mother’s inexorable pride had melted; the ravishing bliss that for a moment had thrilled through her, being experienced too for the first time, when she felt that her parents were again united and bound by the sweet tie of her now happy existence; this was the drama acted before her with an almost ceaseless repetition of its transporting incidents; and when she looked round, and beheld her mother sitting alone, and watching her with a countenance almost of anguish, it was indeed with extreme difficulty that Venetia could persuade herself that all had not been a reverie; and she was only convinced of the contrary by that heaviness of the heart which too quickly assures us of the reality of those sorrows of which fancy for a moment may cheat us into scepticism. \n \n And indeed her mother was scarcely less miserable. The sight of Herbert, so changed from the form that she remembered; those tones of heart-rending sincerity, in which he had mournfully appealed to the influence of time and sorrow on his life, still greatly affected her. She had indulged for a moment in a dream of domestic love, she had cast to the winds the inexorable determination of a life, and had mingled her tears with those of her husband and her child. And how had she been repaid? By a degrading catastrophe, from whose revolting associations her mind recoiled with indignation and disgust. But her lingering feeling for her husband, her own mortification, were as nothing compared with the harrowing anxiety she now entertained for her daughter. To converse with Venetia on the recent occurrence was impossible. It was a subject which admitted of no discussion. They had passed a week at Padua, and the slightest allusion to what had happened had never been made by either Lady Annabel or her child. It was only by her lavish testimonies of affection that Lady Annabel conveyed to Venetia how deeply she sympathised with her, and how unhappy she was herself. She had, indeed, never quitted for a moment the side of her daughter, and witnessed each day, with renewed anguish, her deplorable condition; for Venetia continued in a state which, to those unacquainted with her, might have been mistaken for insensibility, but her mother knew too well that it was despair. She never moved, she never sighed, nor wept; she took no notice of anything that occurred; she sought relief in no resources. Books, and drawings, and music, were quite forgotten by her; nothing amused, and nothing annoyed her; she was not even fretful; she had, apparently, no physical ailment; she remained pale and silent, plunged in an absorbing paroxysm of overwhelming woe. \n \n The unhappy Lady Annabel, at a loss how to act, at length thought it might be advisable to cross over to Venice. She felt assured now, that it would be a long time, if ever, before her child could again endure the fatigue of travel; and she thought that for every reason, whether for domestic comfort or medical advice, or those multifarious considerations which interest the invalid, a capital was by far the most desirable residence for them. There was a time when a visit to the city that had given her a name had been a favourite dream of Venetia; she had often sighed to be within \n \n The sea-born city’s walls; the graceful towers \n \n Loved by the bard. \n \n Those lines of her father had long echoed in her ear; but now the proposition called no light to her glazed eye, nor summoned for an instant the colour back to her cheek. She listened to her mother’s suggestion, and expressed her willingness to do whatever she desired. Venice to her was now only a name; for, without the presence and the united love of both her parents, no spot on earth could interest, and no combination of circumstances affect her. To Venice, however, they departed, having previously taken care that every arrangement should be made for their reception. The English ambassador at the Ducal court was a relative of Lady Annabel, and therefore no means or exertions were spared to study and secure the convenience and accommodation of the invalid. The barge of the ambassador met them at Fusina; and when Venetia beheld the towers and cupolas of Venice, suffused with a golden light and rising out of the bright blue waters, for a moment her spirit seemed to lighten. It is indeed a spectacle as beautiful as rare, and one to which the world offers few, if any, rivals. Gliding over the great Lagune, the buildings, with which the pictures at Cherbury had already made her familiar, gradually rose up before her: the mosque-like Church of St. Marc, the tall Campanile red in the sun, the Moresco Palace of the Doges, the deadly Bridge of Sighs, and the dark structure to which it leads. \n \n Venice had not then fallen. The gorgeous standards of the sovereign republic, and its tributary kingdoms, still waved in the Place of St. Marc; the Bucentaur was not rotting in the Arsenal, and the warlike galleys of the state cruised without the Lagune; a busy and picturesque population swarmed in all directions; and the Venetian noble, the haughtiest of men, might still be seen proudly moving from the council of state, or stepping into a gondola amid a bowing crowd. All was stirring life, yet all was silent; the fantastic architecture, the glowing sky, the flitting gondolas, and the brilliant crowd gliding about with noiseless step, this city without sound, it seemed a dream! \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1392/42324.html","bookId":1425,"book":{"id":1425,"title":"Venetia","description":"简介： Some ten years before the revolt of our American colonies, there was situate in one of our midland counties, on the borders of an extensive forest, an ancient hall that belonged to the Herberts, but which, though ever well preserved, had not until th...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1392","creation":"Aug 1, 2019 12:25:05 AM","modification":"Aug 1, 2019 12:25:05 AM"}}
