{"id":7817,"no":24,"title":"CHAPTER XXIII WALTER AND THE HIGHWAYMAN","content":"The professor was startled at the exclamation, but was unwilling to believe that the man before him was a highwayman. “My friend,” he said, “won\u0027t you move to one side? You are in my path.” “We have a little business together,” said the horseman, grimly, as he drew out and presented a revolver, “that must be attended to first.” “Do you wish a bottle of balm?” inquired Professor Robinson, in a tremulous voice. “No; you may need one yourself unless we come to terms.” “What do you mean?” “Hand over your pocketbook, old man, and be quick about it.” “I presume you are joking,” said the professor nervously. “You won\u0027t find it much of a joke!” “Are you a—highwayman?” gasped the professor. The other gave a quick, short laugh. “You may call me that if you like,” he said. Now, Professor Robinson had, as was natural, a decided objection to surrendering his money, and, though there seemed little chance of producing an effect on the mind of the outlaw, ventured to remonstrate. “My friend,” he said, “if you are in want, I will lend, nay, give you five dollars, out of a spirit of humanity; but I trust you will not jeopardize your liberty by descending to robbery.” “Five dollars won\u0027t do, old man! Hand over your wallet, with all there is in it, and dry up that Sunday-school talk.” “What shall I do, Walter?” asked the poor professor. “I am afraid you will have to let him have it, professor.” “That\u0027s where your head is level, boy!” said the highwayman approvingly. “Just fling over your wallet, and be quick about it.” “Tell him to ride up and get it,” said Walter, in an undertone. Though the professor did not understand Walter\u0027s object in suggesting this, he was in a mood to be guided by any one, and repeated Walter\u0027s words. “Anything to oblige,” said the stranger. “Don\u0027t give it to him till I say the word,” whispered Walter. The highwayman, lowering his revolver, rode up alongside of the wagon and held out his hand for the wallet. Walter had conceived a bold scheme for disarming him and rendering him harmless. “Give the wallet to me, professor,” he said. His employer meekly obeyed. Then Walter, rising, dropped the wallet on the floor of the wagon, and reaching over suddenly grasped the revolver from the unsuspecting robber, and before he recovered from his amazement brought down the whip with terrible force on the flanks of his horse. The startled animal gave a spring that nearly unseated his rider and dashed madly down the road. The robber was furious. As soon as he could he regained control of his steed and galloped back. “Give me that revolver!” he shouted, in a rage. Walter held the weapon in his hand and steadily pointed it at its late owner. “I\u0027ll give you the contents if you don\u0027t ride off.” “Confound you, you young rascal! If you don\u0027t give me back my weapon I\u0027ll kill you!” It was an empty threat, as Walter well knew. “Do you hear me?” he said quietly. The robber scanned him curiously. He had thought him a mere boy, without spirit or courage. Now he was compelled to revise his opinion of him. Threats would not answer. He must have recourse to strategy. “You\u0027re smart, youngster. I\u0027ll give you credit for that,” he said, in a milder tone. “You\u0027ve got the best of me, I admit.” “Yes,” answered Walter, “I have the advantage of you.” “I meant to take your money, but I won\u0027t do it now.” “Thank you!” said Walter, with an ironical smile. “Just give me back that weapon of mine, and I\u0027ll ride off and let you alone.” “I don\u0027t think it would be wise.” The highwayman frowned. “Don\u0027t be a fool, youngster!” he said. “Do you doubt my word?” “I don\u0027t know you well enough to decide whether you are to be trusted, but I guess I\u0027ll keep the revolver.” “Then you will have robbed me.” “Walter,” said the professor nervously, “perhaps you had better give him back his weapon. He has promised not to molest us further.” “That\u0027s where you talk sense, old man,” said the robber approvingly. “You\u0027re a gentleman, you are.” “You hear, Walter?” “Yes, youngster, you hear? Give me back my weapon and we\u0027ll part friends.” “And I trust, my friend, you will see the error of your ways and adopt some honest business.” “I will, old man, believe me!” said the robber, in a melodramatic tone. “I was not always thus.” “You will have my best wishes for your prosperity, and if you are in need I will give you five dollars.” “No, I will not take advantage of your liberal offer. Only give me the revolver and I will ride away.” “Come, Walter, give the man his revolver.” “Professor,” said Walter, quietly, “you must excuse me, I can\u0027t comply with your request. This man is humbugging you. If I give him back the revolver you will have to give him your wallet too.” “Didn\u0027t I promise to ride away?” demanded the outlaw, angrily. “Yes; but I have no confidence in your promise. Now, go at once, or I fire!” Walter pointed the revolver full at the robber\u0027s head. He met the unflinching gaze of Walter\u0027s resolute eyes and saw that our hero was in earnest. “Do you mean to keep my property?” he demanded hoarsely. “No; come round to the hotel in Fremont to-morrow morning and you shall have your weapon.” With an execration the outlaw turned his horse and dashed off at full speed. “There, he is gone!” said Walter, sinking back in his seat with an air of relief. His nerves had been at high tension, though he was outwardly calm, for he knew that he had to deal with a desperate man, and feared a sudden attack, which might have resulted disastrously for him. “I don\u0027t know whether you have done right, Walter,” said the professor, in a tone of mild deprecation. “Surely, professor, you would not have had me give back the revolver?” “He promised to ride off and leave us to ourselves.” “What is the word of such a man worth? He would have ridden off, but he would have carried with him your wallet and mine. Was there much money in yours?” “Two hundred and fifty dollars.” “That\u0027s too much to lose. Take my advice, professor, and put the greater part of the money in one of your pockets. That is what I have done, for I suspected that this gentleman would lie in wait for us.” “What put it into your head to seize the pistol, Walter? If your attempt had miscarried he might have shot you.” “I don\u0027t propose to give up my money without a struggle. When the time came to act I moved suddenly upon the enemy. I did not propose to fail.” “You were very quick. You were like a flash of lightning.” “I meant to be,” said Walter, smiling. “I haven\u0027t attended a gymnasium for nothing.” “Do you think he will attack us again?” asked the professor timidly. “No; he has no revolver and I have. Besides, I don\u0027t mean to be taken at a disadvantage. If you will drive, I will hold the revolver ready for instant use.” There was no further interruption during their ride, and about ten o\u0027clock they drew up in front of the hotel in Fremont. Rooms were secured, and both Walter and the professor retired to rest. About seven o\u0027clock the next morning there was a knock at Walter\u0027s door. He opened it, half dressed, and found a boy of sixteen with a note in his hand. “A gentleman gave me this for you,” he said. Walter opened the note and read these lines, which had been hastily scribbled: “Give the bearer my revolver. I have a long journey before me and shall need it. “YOU KNOW WHO.” “Where is the gentleman who gave you the note?” asked Walter. “Down the road a piece. He asked me to be quick.” “Tell him,” said Walter, putting the note in his vest pocket, “that he will have to come here himself.” He finished his toilet and went down to breakfast, but the robber did not put in an appearance. He probably thought that Walter was laying a trap for him. \n \n","sourceLink":"http://novel.tingroom.com/ertong/3022/83599.html","bookId":259,"book":{"id":259,"title":"Walter Sherwood\u0027s Probation","description":"简介： Here\u0027s a letter for you, Doctor Mack, said the housekeeper, as she entered the plain room used as a library and sitting-room by her employer, Doctor Ezekiel Mack. It\u0027s from Walter, I surmise. This was a favorite word with Miss Nancy Sprague, who, tho...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/3022","creation":"Aug 1, 2019 12:18:28 AM","modification":"Aug 1, 2019 12:18:28 AM"}}
