{"id":7830,"no":37,"title":"CHAPTER XXXVI COLONEL RICHARD OWEN","content":"At this moment a boy of fifteen made his way from the street to the rear entrance. It was Arthur Waters, the son of a jeweler. \n “Perhaps I can tell you something about it,” he said. \n “Last night I heard a noise in the street, and, getting up, I went to the window. I saw a lot of men filing through the street, all wearing masks.” \n “They must have been in search of the prisoners to lynch them!” said the lawyer, turning pale. \n “And you think they broke open the doors, Mr. Barry?” \n “Yes.” \n “And what would they do with the prisoners?” \n “Hang them, I fear, without judge or jury.” \n “I don\u0027t mind the man, sir, but I hope the boy escaped.” \n “Thank you, constable. I am alive and well, as you see.” \n Both the lawyer and the constable looked up, and there, to their great relief, stood Walter. \n “Where did you come from?” asked the lawyer quickly. \n Walter told his story, adding: “Constable Stokes, I give myself into your hands.” \n “Perhaps, as I am his counsel,” said the lawyer, “I had better take him with me.” \n “Yes, that will be the best way,” said the constable. \n Walter was ushered into the office of the lawyer. \n At this moment the office door opened, and an old gentleman entered. \n The lawyer rose from his seat with alacrity. \n “Colonel Owen,” he exclaimed, “I am glad to see you.” \n “Yes, sir. I received your telegram, and came by the first morning train. So the man who stole my horse has been caught?” \n “The man who is charged with the theft has been caught,” said Mr. Barry. \n “Mr. Barry, you have not introduced me to this young gentleman,” continued Colonel Owen, eyeing Walter with favor. \n “I didn\u0027t know that you would care for an introduction,” said the lawyer demurely. \n “Why not?” asked the old gentleman, opening his eyes in surprise. \n “Because he is the horse thief!” \n \n \n","sourceLink":"http://novel.tingroom.com/ertong/3022/83612.html","bookId":259,"book":{"id":259,"title":"Walter Sherwood\u0027s Probation","description":"简介： Here\u0027s a letter for you, Doctor Mack, said the housekeeper, as she entered the plain room used as a library and sitting-room by her employer, Doctor Ezekiel Mack. It\u0027s from Walter, I surmise. This was a favorite word with Miss Nancy Sprague, who, tho...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/3022","creation":"Aug 1, 2019 12:18:28 AM","modification":"Aug 1, 2019 12:18:28 AM"}}
