{"id":7831,"no":38,"title":"CHAPTER XXXVII WALTER IS VINDICATED","content":"“Bless my soul!” ejaculated the colonel. “Surely you are joking.” \\n\\n “No, I assure you I am not.” \\n\\n “Then how does it happen that Mr. Sherwood is sitting here in your office instead of being—” \\n\\n “In the lockup?” \\n\\n “Yes.” \\n\\n “I was taken to the lockup, Colonel Owen,” said Walter, “but about midnight a lynching party broke it open and took me out. \\n\\n “But I made an appeal to my captors, and was able to prove to them I received a reward not long since for the capture of the famous outlaw, Dick Ranney.” \\n\\n Colonel Owen sank into a chair. \\n\\n “I never heard the like!” he was heard to say. \\n\\n “Do you mind telling me, young man, why you were arrested, or why you fell under suspicion?” \\n\\n “I was arrested while on the horse\u0027s back.” \\n\\n “Ha! But how did that happen?” \\n\\n “I bought her of a man whom I met on the highway.” \\n\\n “Gentlemen,” said the lawyer, “I find that the court is in session and all is ready for the trial.” \\n\\n “By the way, colonel, are you not a graduate of Euclid?” asked the lawyer. \\n\\n “Yes, sir, and I am proud of the dear old college,” rejoined the colonel, warmly. \\n\\n “I agree with you,” said Walter. “I have passed two years in the college.” \\n\\n “Then, young man, here\u0027s my hand. My heart is always warm toward a Euclid man—” \\n\\n “Even if you have to prosecute him for horse-stealing,” suggested Lawyer Barry slyly. \\n\\n “Really, this is very painful!” said the colonel. “I wish I could get rid of it.” \\n\\n “You can say in court that you are convinced of the young man\u0027s innocence.” \\n\\n “And I will! And afterward I shall insist on Mr. Sherwood\u0027s driving home with me and making me a visit.” \\n\\n Great was the surprise of Mr. Crane and Mr. Penton when they saw the horse thief approach the court room arm in arm with Colonel Owen. \\n\\n The trial began, and presently Crane and Penton were called on to testify. \\n\\n “Did you see the prisoner steal the mare?” demanded Barry sharply. \\n\\n “No, but—” \\n\\n “It stands to reason that he did, or he wouldn\u0027t have had her in his possession.” \\n\\n “Mr. Sherwood, you may take the stand.” \\n\\n Walter gave a brief account of the way in which he became possessed of Bess. \\n\\n “Does Mr. Sherwood\u0027s story seem probable?” now remarked the judge. \\n\\n “I am convinced that it is true,” said the colonel promptly. \\n\\n The judge saw how matters stood and discharged the prisoner. \\n\\n “We\u0027re left!” said Crane, in a tragic whisper. \\n\\n “Now, Mr. Sherwood,” said the colonel, taking Walter\u0027s arm, “you must accompany me to Shelby.” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/3022/83613.html","bookId":259,"book":{"id":259,"title":"Walter Sherwood\u0027s Probation","description":"简介： Here\u0027s a letter for you, Doctor Mack, said the housekeeper, as she entered the plain room used as a library and sitting-room by her employer, Doctor Ezekiel Mack. It\u0027s from Walter, I surmise. This was a favorite word with Miss Nancy Sprague, who, tho...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/3022","creation":"Aug 1, 2019 12:18:28 AM","modification":"Aug 1, 2019 12:18:28 AM"}}
