{"id":101514,"no":13,"title":"Page 13","content":"Audrina and Colton obviously couldn\u0027t decide what was more amazing: the threat of a sodden and beautiful (but menacing) Pam or the ruin of glory that was Bubba. They\u0027d expected Eric, but Bubba was a complete surprise.\\n\\n They were entranced. Though I whispered to them on our way through the living room not to call him by his real name, I didn\u0027t know if they\u0027d have enough self-control. Luckily for us all, they did. Bubba really, really, didn\u0027t like being reminded of his past life. He had to be in a remarkable mood to sing.\\n\\n Wait. Ha! Finally, I had a real idea.\\n\\n They all sat around the table. Absorbed in figuring out my scheme, I got out the refreshments and pulled up a chair by Bubba. I had a floaty, surrealistic feeling. I simply couldn\u0027t think about the crash and burn I\u0027d just experienced. I had to think about this moment and this purpose.\\n\\n Pam sat behind Eric so they wouldn\u0027t meet each other\u0027s eyes. They both looked miserable, and it was a look I\u0027d seldom seen either of them wear. It didn\u0027t look good on them. I felt somehow guilty about the breach between them, though it certainly wasn\u0027t my fault. Or was it? I ran it through my mind. Nope, it wasn\u0027t.\\n\\n Eric proposed that he infiltrate his vampires into Vampire\u0027s Kiss one night in disguise, and that they wait until the club was about to close and the crowds were thin. Then we would attack. And, of course, kill them all.\\n\\n If Victor hadn\u0027t been an employee of Felipe, king of three states, Eric\u0027s scheme would have been workable, though there were some definite weak points. But surely killing a bunch of his vampires would piss off Felipe mightily, and I really couldn\u0027t blame him.\\n\\n Audrina had a plan, too, involving discovering Victor\u0027s sleeping place and getting him while he was out for the day. Wow, that was fresh and original. However, it was a classic for a reason. Victor would be helpless.\\n\\n \"Except we don\u0027t know where he sleeps,\" I said, trying to slide the objection in there without sounding snooty.\\n\\n \"I do,\" Audrina said proudly. \"He sleeps in a big stone mansion. It\u0027s set back from a parish road between Musgrave and Toniton. There\u0027s one lone road in, and that\u0027s it. There aren\u0027t any trees around the house. It\u0027s just grass.\"\\n\\n \"Wow.\" I was impressed. \"How\u0027d you track him down?\"\\n\\n \"I know the guy who mows the yard,\" she said. She grinned at me. \"Dusty Kolinchek, remember him?\"\\n\\n \"Sure,\" I said, feeling a stir of interest. Dusty\u0027s dad owned a fleet--okay, a small fleet--of lawn tractors and weed eaters, and every summer a group of Bon Temps high school boys earned their walking-around money working for Mr. Kolinchek. Dusty was inheriting the lawn-mowing empire, sounded like.\\n\\n \"He says that the house is almost empty during the day because Victor is paranoid about having anyone come in while he\u0027s sleeping. He just has two bodyguards there, Dixie and Dixon Mayhew, and they\u0027re some kind of wereanimals.\"\\n\\n \"I know them,\" I said. \"They\u0027re werepanthers. They\u0027re good.\" The Mayhew twins were tough and professional. \"They must be strapped for cash to work for a vampire.\" Now that my sister-in-law was dead and Calvin Norris had married Tanya Grissom, I didn\u0027t see many of the werepanthers with any frequency. Calvin didn\u0027t come into the bar much, and Jason seemed to see his former in-laws only at the full moon, when he became one of them . . . in a limited way, since he\u0027d been bitten, not born, as a were.\\n\\n \"So maybe I could bribe the Mayhews if they\u0027re that hard up,\" Eric said. \"You wouldn\u0027t need to kill them, then. Less mess. But you humans would have to do the job, since Pam and I will be down for the day.\"\\n\\n \"We\u0027d have to search the house, because I bet the Mayhews don\u0027t know exactly where he sleeps,\" I said. \"Though I\u0027m sure they have to have a pretty good idea.\" The vampire smell alone should help the twoeys zone in on where Victor slept, but it seemed kind of tacky to say that out loud.\\n\\n Pam kind of waved her hand. Eric half turned, catching the motion out of the corner of his eye. \"What?\" he said. \"Oh, you can speak.\"\\n\\n Pam looked relieved. She said, \"I think when he leaves the club in the morning would be a good time. His attention is on whoever he\u0027s going to feed on, and we might be able to attack then.\"\\n\\n These were all pretty straightforward plans, and maybe that was both their strength and their weakness. They were simple. And that meant they were predictable. Eric\u0027s plan was the bloodiest, of course. There would certainly be loss of life. Audrina and Colton\u0027s plan was the most human, since it depended on a day attack. Pam\u0027s was possibly the best, since it was a night attack but not in a heavily peopled area, though the club exit was so obviously the weakest point that I felt sure whatever vampires Victor used as bodyguards--maybe the toothsome Antonio and Luis?-- would be extra vigilant at such a moment.\\n\\n \"I have a plan,\" I said.\\n\\n It was like I\u0027d suddenly stood up and unhooked my bra. They all looked at me simultaneously, with a combination of surprise and skepticism. I will say that most of the skepticism came from Audrina and Colton, who hardly knew me. Bubba had been sitting on the high stool beside the counter, sipping a TrueBlood with an unsatisfied air. He looked pleased when I pointed to him and said, \"He\u0027s the way.\"\\n\\n I laid out my idea, trying hard to sound confident, and when I was through, they began trying to poke holes in it. And Bubba was reluctant, at least initially.\\n\\n In the end, Bubba said he would do it if Mr. Bill said it was a good idea. I phoned Bill. He was over in a flash, and the look he gave me when I let him in told me he was enjoying remembering how I looked wrapped in a tablecloth. Or even before I\u0027d found the tablecloth. With an effort, I swallowed my confusion and explained everything to him. And after a few embellishments had been added, he agreed.\\n\\n We went over the order of events again and again, trying to allow for every contingency. By three thirty in the morning, we were all in agreement. I was so tired I was asleep on my feet, and Audrina and Colton were barely able to stifle their yawns. Pam, who\u0027d been stepping out of the room to call Immanuel periodically, preceded Eric out the door. She was anxious to get to the hospital. Bill and Bubba had departed for Bill\u0027s house, where Bubba would spend the day. I was alone with Eric.\\n\\n We looked at each other, both at a loss. I tried to put myself in his place, feel what he must feel, but I simply couldn\u0027t do it. I couldn\u0027t imagine that, say, my grandmother had decided who I should marry and then passed away, fully expecting me to carry out her wishes. I couldn\u0027t imagine that I had to follow directions from beyond the grave, leave my home and go to a new place with people I didn\u0027t know, have sex with a stranger, simply because someone else had wanted me to.\\n\\n Even, a little voice said inside me, if the stranger was beautiful and wealthy and politically astute?\\n\\n No, I told myself stoutly. Not even then.\\n\\n \"Can you put yourself in my place?\" Eric asked, chiming in on my thoughts. We knew each other pretty well, without the bond. He took my hand and held it between his cold ones.\\n\\n \"No, actually, I can\u0027t,\" I said, as evenly as I could manage. \"I\u0027ve been trying. But I\u0027m not used to that sort of long-distance manipulation. Even after death, Appius is controlling you, and I just can\u0027t picture myself in that position.\"\\n\\n \"Americans,\" Eric said, and I couldn\u0027t decide if he said it admiringly or with a mild exasperation.\\n\\n \"Not just Americans, Eric.\"\\n\\n \"I feel very old.\"\\n\\n \"You are very old-fashioned.\" He was ancient-fashioned.\\n\\n \"I can\u0027t ignore a signed document,\" he said, almost angrily. \"He made an agreement for me, and I was his to order. He created me.\"\\n\\n What could I say, in the face of such conviction? \"I\u0027m so glad he\u0027s dead,\" I told Eric, not caring that my bitterness was written on my face. Eric looked sad, or at least regretful, but there was nothing else to say. Eric didn\u0027t mention spending what was left of the night with me, which was smart on his part.\\n\\n After he left, I began checking all the windows and doors in the house. Since so many people had been in and out that day and night, it seemed a good idea. I wasn\u0027t too surprised to see Bill out in the yard when I was locking the kitchen window over the sink.\\n\\n Though he didn\u0027t beckon to me, I took my weary self outside.\\n\\n \"What has Eric done to you?\" he said.\\n\\n I condensed the situation into a few sentences.\\n\\n \"What a dilemma,\" Bill said, not totally displeased.\\n\\n \"So you\u0027d feel the way Eric does?\"\\n\\n In an eerie echo, Bill took my hand just as Eric had earlier. \"Not only did Appius already enter negotiations, so there are presumably legal documents on the table, but also I would have to give my maker\u0027s wishes some consideration--as much as I hate to acknowledge that. You have no idea how strong the bond is. The years spent with one\u0027s maker are the most important years of a vampire\u0027s existence. As loathsome as I found Lorena, I have to admit that she did her best to teach me to be an effective vampire. Looking back on her life now--Judith and I talked about this, of course--Lorena betrayed her own maker, and then had years and years to regret it. The guilt drove her mad, we think.\"\\n\\n Well, I was glad Bill and Judith had gotten to talk over fun times in the old days with Mama Lorena--murderess, prostitute, torturer. I couldn\u0027t really hold the prostitute part against her, since there hadn\u0027t been that many ways for a woman alone to make a living in the old times, even a vampire woman. But the rest--no matter what her circumstances had been, no matter how hard her life before and after her first death, Lorena had been an evil bitch. I pulled my hand away from Bill.\\n\\n \"Good night,\" I said. \"I\u0027m overdue for bed.\"\\n\\n \"Are you angry with me?\"\\n\\n \"Not exactly,\" I said. \"I\u0027m just tired and sad.\"\\n\\n \"I love you,\" Bill said helplessly, as if he wished those magic words would heal me. But he knew they wouldn\u0027t.\\n\\n \"That\u0027s what you all keep saying,\" I answered. \"But it doesn\u0027t seem to get me any happier.\" I didn\u0027t know if I had a valid point or if I was simply being self-pitying, but it was too late at night--no, too early in the morning--to have the clarity of mind to decide that. A few minutes later, I crawled into my bed in an empty house, and being alone felt pretty damn good.\\n\\n I woke up at noon on Friday with two pressing thoughts. The first was, Did Dermot renew my wards? And the second was, Oh my God, the baby shower is tomorrow!\\n\\n After some coffee and pulling on my clothes, I called Hooligans. Bellenos answered.\\n\\n \"Hi,\" I said. \"Can I speak to Dermot? Is he better?\"\\n\\n \"He\u0027s well,\" Bellenos said. \"But he\u0027s on his way to your house.\"\\n\\n \"Oh, good! Listen, maybe you\u0027ll know this. . . . Did he renew the wards on the house, or am I unprotected?\"\\n\\n \"God forbid you should be with a fairy unprotected,\" Bellenos said, trying to sound serious.\\n\\n \"No double entendres!\"\\n\\n \"Okay, okay,\" he said, and I could tell he was flashing that sharptoothed smile. \"I myself put wards around your house, and I assure you they will hold.\"\\n\\n \"Thanks, Bellenos,\" I said, but I wasn\u0027t completely happy that someone I trusted as little as Bellenos had been in charge of my protection.\\n\\n \"You\u0027re welcome. Despite your doubts, I don\u0027t want anything to happen to you.\"\\n\\n \"That\u0027s good to know,\" I said, keeping all expression out of my voice.\\n\\n Bellenos laughed. \"If you get too lonely out there in the woods, you can always call me,\" he said.\\n\\n \"Hmmm,\" I said. \"Thanks.\" Was the elf coming on to me? That made no sense. More likely he wanted to eat me, and not in the fun way.\\n\\n Maybe better not to know. I wondered how Dermot was getting here but not enough to call Bellenos again.\\n\\n Reassured that Dermot was returning, I studied my list of shower preparations. I\u0027d asked Maxine Fortenberry to make the punch, because hers was famous. I was picking up the cake from the bakery. I didn\u0027t have to work today or tomorrow, which meant a big loss in tips, but it was turning out real convenient. So my to-do list was like: Today, complete all preparations for the baby shower. Tonight, kill Victor. Tomorrow, guests arrive for shower.\\n\\n In the meantime, like any incipient hostess, I was going to be all about the cleaning. My living room was still below par since the attic stuff had been sitting in it, and I started from the top down: dust the pictures, then the furniture, then the baseboards. Then vacuum. I worked my way down the hall, visiting my bedroom, the guest bedroom, and the hall bathroom. I got a squirt bottle of all-purpose cleaner and attacked the kitchen surfaces. I was about to mop the floors when I saw Dermot in the backyard. He\u0027d driven back in a battered Chevy compact.\\n\\n \"Where\u0027d you get the car?\" I called from the back porch.\\n\\n \"I bought it,\" he said proudly.\\n\\n I hoped he hadn\u0027t used fairy enchantment or something. I was scared to ask. \"Let me see your head,\" I said, when he got into the house. I looked at the back of his skull where the gash had been. A thin white line, that was all. \"Amazing,\" I said. \"How do you feel?\"\\n\\n \"Better than I did yesterday. I\u0027m ready to get back to work.\" He went into the living room. \"You\u0027re cleaning,\" he said. \"Is there a special occasion?\"\\n\\n \"Yes,\" I said, smacking myself on the forehead. \"I\u0027m so sorry I forgot to tell you. I\u0027m giving Tara Thornton--Tara du Rone--a baby shower tomorrow. She\u0027s expecting twins, Claude believes. Oh, she got that confirmed.\"\\n\\n \"Can I come?\" he asked.\\n\\n \"It\u0027s all right with me,\" I said, taken aback. Most human guys would rather have their toenails painted than come to such a party. \"You\u0027ll be the only man there, but I assume that won\u0027t bother you?\"\\n\\n \"Sounds great,\" he said, smiling that beautiful smile.\\n\\n \"You\u0027ll have to keep your ears covered and listen to about a million comments about how much you look like Jason,\" I said. \"We\u0027ll need to explain you.\" \"Just tell them I\u0027m your great-uncle,\" he said.\\n\\n For one fun moment, I envisioned doing just that. I had to give it up, though with some regret. \"You look much too young to be my great-uncle, and everyone here knows my family tree. The human part of it,\" I added hastily. \"But I\u0027ll think of something.\"\\n\\n While I vacuumed, Dermot looked at the big box of pictures and the smaller one of printed material that I hadn\u0027t yet had a chance to go over. He seemed fascinated by the pictures. \"We don\u0027t use this technology,\" he said.\\n\\n I sat beside him when I\u0027d put the vacuum away. I\u0027d tried to arrange the images in chronological order, but it had been a hasty task, and I was sure I\u0027d have to redo it.\\n\\n The pictures at the front of the box were very old. People sitting in stiff groups, their backs rigid, their faces, too. If the backs were labeled, it was in spidery formal handwriting. Many of the men were bearded or mustached, and they wore hats and ties. The women were confined in long sleeves and skirts, and their posture was amazing.\\n\\n Gradually as the Stackhouse family rolled along in time, the pictures became less posed, more spontaneous. The clothing morphed along with attitudes. Color began to tint faces and scenery. Dermot seemed genuinely interested, so I explained the background on some of the more recent snapshots. One was of a very old man holding a baby swathed in pink. \"That\u0027s me and one of my great-grandfathers; he died when I was little bitty,\" I said. \"That\u0027s him and his wife when they were in their fifties. And this is my grandmother Adele and her husband.\"\\n\\n \"No,\" Dermot said. \"That\u0027s my brother Fintan.\"\\n\\n \"No, this is my grandfather, Mitchell. Look at him.\"\\n\\n \"He is your grandfather. Your true grandfather. Fintan.\"\\n\\n \"How can you tell?\"\\n\\n \"He\u0027s made himself to look like Adele\u0027s husband, but I can tell it\u0027s my brother. He was my twin, after all, though we were not identical. Look here at his feet. His feet are smaller than those of the man who married Adele. Fintan was always careless that way.\"\\n\\n I spread out all the pictures of Grandmother and Grandfather Stackhouse. Fintan was in about a third of them. I\u0027d suspected from her letter that Fintan had been around more than she\u0027d realized, but this was just creepy. In every picture of Fintan-as-Mitchell, he was smiling broadly.\\n\\n \"She didn\u0027t know about this, for sure,\" I said. Dermot looked dubious. And I had to admit to myself that she had suspected. It was there, in her letter.\\n\\n \"He was playing one of his jokes,\" Dermot said fondly. \"Fintan was a great one for jokes.\"\\n\\n \"But . . .\" I hesitated, not sure how to phrase what I wanted to say. \"You get that this was really wrong?\" I said. \"You understand that he was deceiving her on a couple of different levels?\"\\n\\n \"She agreed to be lovers with him,\" Dermot said. \"He was very fond of her. What difference does it make?\"\\n\\n \"It makes a lot of difference,\" I said. \"If she thought she was with one man when she was with another, that\u0027s a huge deception.\"\\n\\n \"But a harmless one, surely? After all, even you agree she loved both men, had sex with both of them willingly. So,\" he asked again, \"what difference does it make?\"\\n\\n I stared at him doubtfully. No matter how she felt about her husband or her lover, I still thought there was a moral issue here. In fact, I knew there was. Dermot didn\u0027t seem to be able to discern that. I wondered if my great-grandfather would agree with me or with Dermot. I had a sinking feeling I knew.\\n\\n \"I better get back to work,\" I said, with a tight smile. \"Got to mop the kitchen. You going to get back to work in the attic?\"\\n\\n He nodded enthusiastically. \"I love the machinery,\" he said.\\n\\n \"Please close the attic door, then, because I\u0027ve dusted down here and I don\u0027t want to have to do that again before tomorrow afternoon.\"\\n\\n \"Sure, Sookie.\"\\n\\n Dermot went up the stairs whistling. It was a tune I\u0027d never heard before, which figured.\\n\\n I gathered up the pictures, keeping separate the ones that Dermot had earmarked as featuring his brother. I was considering building a little fire with them. Up in the attic, the sander started up. I looked at the ceiling as if I could see Dermot through the boards. Then I shook myself and went back to work, but in an abstracted and uneasy mood.\\n\\n When I was standing on a stepladder hanging the WELCOME BABY sign from the light fixture, I remembered I had to iron my great- grandmother\u0027s tablecloth. I hate ironing, but it had to be done, and better today than tomorrow. When the stepladder was put away, I opened the ironing board--there\u0027d been a built-in one in the previous kitchen--and set to work. The tablecloth was not exactly white anymore. It had aged to ivory. I soon had it smooth and beautiful, and touching it reminded me of high occasions in the past. I\u0027d seen pictures including this very piece of cloth today; it had been on the kitchen table or the old sideboard for Thanksgivings and Christmases and wedding showers and anniversaries. I loved my family, and I loved those memories. I only regretted that there were so few of us to recall them.\\n\\n And I was aware of another truth, another real thing. I realized I really didn\u0027t appreciate the fairy sense of fun that had made a lie out of some of those memories.\\n\\n By three that afternoon, the house was as close to ready as I could get it. The sideboard was draped with the tablecloth, the paper plates and napkins were out, the plastic forks and spoons. I\u0027d polished the silver nut dish and a little tray for the cheese straws, which I\u0027d made and frozen a couple of weeks before. I ran down my checklist. I was as ready as I could possibly be.\\n\\n If I didn\u0027t survive tonight, I was afraid that the baby shower would be a bust. I had to assume that my friends would be too jangled to go ahead with the shower if I got killed. Just in case, I left detailed notes about the location of everything that wasn\u0027t already out. I even brought out my present for the babies, matching wicker baskets that could be used as traveling cribs. They were decorated with big gingham bows and packed full of useful stuff. I\u0027d accumulated the items for the gift baskets on sale, bit by bit. Bottles for supplemental feeding, a baby thermometer, a few toys, a few receiving blankets, some picture books, bibs, a package of cloth diapers for use as spit-up rags. It felt strange to think that I might not be around to see the babies grow up.\\n\\n It also felt strange that paying for the shower hadn\u0027t been such a financial hardship, thanks to the money in my savings account.\\n\\n Suddenly, I had an amazing idea. That made two in two days. As soon as I\u0027d worked it out in my head, I was in my car and on my way to town. It felt weird walking into Merlotte\u0027s on my day off. Sam looked surprised but pleased to see me. He was in his office with a stack of bills in front of him. I put another piece of paper on his desk. He looked at it. \"What is this?\" he said in a low voice.\\n\\n \"You know what it is. Don\u0027t you give me that, Sam Merlotte. You need money. I\u0027ve got money. You put this in your account today. You use it to pull the bar through until times are better.\"\\n\\n \"I can\u0027t take this, Sookie.\" He didn\u0027t meet my eyes.\\n\\n \"The hell you can\u0027t, Sam. Look at me.\"\\n\\n Finally, he did.\\n\\n \"I\u0027m not kidding. You put it in the bank today,\" I said. \"And if anything might happen to me, you can repay my estate within, say, five years.\" \"Why would anything happen to you?\" Sam\u0027s face darkened.\\n\\n \"Nothing will. I\u0027m just saying. It\u0027s irresponsible to loan money without making arrangements to pay it back. I\u0027m calling my lawyer and telling him all this, and he\u0027ll draw up a paper. But right now, right this minute, you go to the bank.\"\\n\\n Sam looked away. I could feel the emotions sweeping over him. Truly, it felt wonderful to do something nice for him. He\u0027d done so many nice things for me. He said, \"All right.\" I could tell it was hard for him, as it would be for almost any man, but he knew it was the sensible thing to do, and he knew it wasn\u0027t charity.\\n\\n \"It\u0027s a love offering,\" I said, grinning at him. \"Like we took up at church last Sunday.\" That love offering had been for the missionaries in Uganda, and this one was for Merlotte\u0027s Bar.\\n\\n \"I\u0027d believe that,\" he said, and met my eyes.\\n\\n I kept my smile, but I began to feel a little self-conscious. \"I have to go get ready,\" I said.\\n\\n \"What for?\" His reddish eyebrows drew together.\\n\\n \"Tara\u0027s baby shower,\" I said. \"It\u0027s an old-fashioned gals-only party, so you didn\u0027t get invited.\"\\n\\n \"I\u0027ll try to contain my misery,\" he said. He didn\u0027t move.\\n\\n \"Are you getting up to go to the bank?\" I asked sweetly.\\n\\n \"Uh, yeah, getting up right now.\" He did get out of the chair and call down the hall to let the servers know he was running a quick errand. I got in my car at the same time he got in his truck. I don\u0027t know about Sam, but I was feeling really good.\\n\\n I did stop by my lawyer\u0027s to tell him what I\u0027d done. This would be my human, local lawyer, not Mr. Cataliades. Whom, by the way, I hadn\u0027t heard from.\\n\\n I swung by Maxine\u0027s house to get the punch, thanked her profusely, left her a list of what I was going to do and had done for the shower arrangements (to her puzzlement), and took the frozen containers back to my house to pop in the little chest freezer on my back porch. I had the ginger ale set out on the counter to mix with the frozen juices.\\n\\n I was as prepared as I could be for the baby shower.\\n\\n Now I had to get ready to kill Victor. \\n\\n","sourceLink":"https://allnovel.net/dead-reckoning-sookie-stackhouse-11/page-13.html","bookId":2201,"book":{"id":2201,"title":"Dead Reckoning (Sookie Stackhouse #11)","description":"Storyline: Dead Reckoning (Sookie Stackhouse #11) \\n With her knack for being in trouble\u0027s way, Sookie witnesses the firebombing of Merlotte\u0027s, the bar where she works. Since Sam Merlotte is now known to be two-natured, suspicion falls immediately on the anti-shifters in the area. Sookie suspects otherwise, but her attention is divided when she realizes that her lover Eric Northman and his \"child\" Pam are plotting to kill the vampire who is now their master. Gradually, Sookie is drawn into the plot-which is much more complicated than she knows...\\n","cover":"https://allnovel.net/images/dead-reckoning-sookie-stackhouse-11.jpg","author":"Charlaine Harris","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/dead-reckoning-sookie-stackhouse-11.html","creation":"Oct 5, 2019 8:58:27 AM","modification":"Oct 5, 2019 10:03:38 PM"}}
