{"id":101508,"no":6,"title":"Page 6","content":"Sunday morning I woke up worried.\\n\\n I\u0027d been too sleepy the night before, when I finally got home, to think much about what had happened at the bar. But evidently my subconscious had been chewing it over while I slept. My eyes flew open, and though the room was quiet and sunny, I gasped.\\n\\n I had that panicky feeling; it hadn\u0027t taken me over yet, but it was just around the corner, physically and mentally. You know the feeling? When you think any second your heart\u0027s going to start pounding, that your breathing is picking up, that your palms will start sweating.\\n\\n Sandra Pelt was after me, and I didn\u0027t know where she was or what she was plotting.\\n\\n Victor had it in for Eric and, by extension, me.\\n\\n I was sure I was the blonde the four thugs had been after, and I didn\u0027t know who\u0027d sent them or what they would have done when they got me, though I had a pretty bad feeling about that.\\n\\n Eric and Pam were on the outs, and I was sure that somehow I was involved in their dispute.\\n\\n And I had a list of questions. At the top of the list: How had Mr. Cataliades known that I would need help at that particular time in that particular place? And how had he known to send the private investigators from Little Rock? Of course, if he had been the Pelts\u0027 lawyer, he might have known that they\u0027d sent Lily and Jack Leeds to investigate their daughter Debbie\u0027s disappearance. He wouldn\u0027t have had to brief the Leeds as much, and he would have known they could handle themselves in a fight.\\n\\n Would the four thugs tell the police why they\u0027d come to the bar, and who\u0027d put them up to it? And where they\u0027d gotten the vampire blood--that would be helpful knowledge, also.\\n\\n What would the things I\u0027d gotten from the secret drawer tell me about my past?\\n\\n \"This is a fine kettle of fish,\" I said out loud. I pulled the sheet over my head and searched the house mentally. No one was here but me. Maybe Dermot and Claude were all talked out, after their big reveal. They seemed to have stayed in Monroe. Sighing, I sat up in bed, letting the sheet fall away. There was no hiding from my problems. The best I could do was to try to prioritize my crises and figure out what information I could gather about each one.\\n\\n The most important problem was the one closest to my heart. And its solution was right to hand.\\n\\n I gently extracted the pattern envelope and the worn velvet bag from the drawer of the bedside table. In addition to the practical contents (a flashlight, a candle, and matches), the drawer held the strange mementoes of my strange life. But I wasn\u0027t interested in anything today but the two new precious items. I carried them into the kitchen and laid them carefully back on the counter well away from the sink as I made my coffee.\\n\\n While the coffeepot dripped, I almost pushed back the flap of the pattern envelope. But I pulled back my hand. I was scared. Instead I tracked down my address book. I\u0027d charged my cell phone overnight, so I stowed the little cord away neatly--any delay would do--and at last, taking a deep breath, I punched in Mr. Cataliades\u0027s number. It rang three times.\\n\\n \"This is Desmond Cataliades,\" his rich voice said. \"I\u0027m traveling and unavailable at the moment, but if you\u0027d like to leave a message, I may call you back. Or not.\"\\n\\n Well, hell. I made a face at the telephone, but at the sound of the tone I dutifully recorded a guarded message that I hoped would convey my urgent need to talk to the lawyer. I crossed Mr. Cataliades--Desmond!--off my mental list and moved on to my second method of approach to the problem of Sandra Pelt.\\n\\n Sandra was going to keep after me until either I was dead or she was. I had a real, true, personal enemy. It was hard to believe that every member of a family had turned out so rotten (especially since both Debbie and Sandra were adopted), but all the Pelts were selfish, strong willed, and hateful. The girls were fruits of the poisonous tree, I guess. I needed to know where Sandra was, and I knew someone who might be able to help me.\\n\\n \"Hello?\" Amelia said briskly.\\n\\n \"How\u0027s life in the Big Easy?\" I asked.\\n\\n \"Sookie! Gosh, it\u0027s good to hear your voice! Things are going great for me, actually.\"\\n\\n \"Do tell?\"\\n\\n \"Bob showed up on my doorstep last week,\" she said.\\n\\n After Amelia\u0027s mentor, Octavia, had turned Bob back into his skinny Mormonish self, Bob had been so angry with Amelia that he\u0027d taken off like --well, like a scalded cat. As soon as he\u0027d reoriented to being human, Bob had left Bon Temps to track down his family, who\u0027d been in New Orleans during Katrina. Evidently Bob had calmed down about the whole transformation-into-a-cat issue.\\n\\n \"Did he find his folks?\"\\n\\n \"Well, he did! His aunt and his uncle, the ones who raised him. They had gotten an apartment in Natchez just big enough for the two of them, and he could tell they didn\u0027t have any way to add him to the household, so he traveled around a bit checking on other coven members, and then he wandered back down here. He\u0027s got a job cutting hair in a shop three blocks away from where I work! He came in the magic shop, asked after me.\" Members of Amelia\u0027s coven ran the Genuine Magic Shop in the French Quarter. \"I was surprised to see him. But real happy.\" She was practically purring on the last sentence, and I figured Bob had entered the room. \"He says hey, Sookie.\"\\n\\n \"Hey back at him. Listen, Amelia, I hate to interfere in love\u0027s young dream, but I got a favor to ask.\"\\n\\n \"Shoot.\"\\n\\n \"I need to find out where someone is.\"\\n\\n \"Telephone book?\"\\n\\n \"Ha-ha. Not that simple. Sandra Pelt is out of jail and gunning for me, literally. The bar\u0027s been firebombed, and yesterday four druggedup goons came in to get me, and I think Sandra might be behind both things. I mean, how many enemies can I have?\"\\n\\n I heard Amelia take a long breath. \"Don\u0027t answer that,\" I said hastily. \"So, she\u0027s failed twice, and I\u0027m afraid that soon she\u0027ll pick up the pace and send someone here to the house. I\u0027ll be alone, and it won\u0027t end good for me.\"\\n\\n \"Why didn\u0027t she start there?\"\\n\\n \"I finally figured out I should have asked myself that a few days ago. Do you think your wards are still active?\"\\n\\n \"Oh . . . sure. They very well could be.\" Amelia sounded just a shade pleased. She was very proud of her witchy abilities, as well she ought to be.\\n\\n \"Really? I mean, think about it. You haven\u0027t been here in . . . gosh, almost three months.\" Amelia had packed up her car the first week in March.\\n\\n \"True. But I reinforced them before I left.\"\\n\\n \"They work even when you aren\u0027t around.\" I wanted to be sure. My life depended on it. \"They will for a while. After all, I was out of the house for hours each day and left it guarded. But I do have to renew them, or they\u0027ll fade. You know, I got three days in a row I don\u0027t have to work. I think I\u0027ll come up there and check out the situation.\"\\n\\n \"That would be a huge relief, though I hate to put you out.\"\\n\\n \"Nah, no problem. Maybe me and Bob\u0027ll have a road trip. I\u0027ll ask a couple of other coven members how they find people. We can take care of the wards and give finding the bitch a shot.\"\\n\\n \"You think Bob\u0027ll be willing to come back here?\" Bob had spent almost his whole sojourn in my house in feline form, so I was doubtful.\\n\\n \"I can only ask him. Unless you hear from me, I\u0027m coming.\"\\n\\n \"Thanks so much.\" I hadn\u0027t realized my muscles were so tense until they began to relax. Amelia said she was coming.\\n\\n I wondered why I didn\u0027t feel safer with my two fairy guys around. They were my kin, and though I felt happy and relaxed when they were in the house, I trusted Amelia more.\\n\\n On the practical side, I never knew when Claude and Dermot would actually be under my roof. They were spending more and more nights in Monroe.\\n\\n I\u0027d have to put Amelia and Bob in the bedroom across the hall from mine, since the guys were occupying the upstairs. The bed in my old room was narrow, but neither Bob nor Amelia were large people.\\n\\n This was all just make-work for my head. I poured a mug of coffee and picked up the envelope and the bag. I sat down at the kitchen table with the objects in front of me. I had a terrible impulse to open the garbage can and drop them both in it unopened, the knowledge in them unlearned.\\n\\n But that was not something you did. You opened things that were meant to be opened.\\n\\n I opened the flap and tipped the envelope. The flouncy-skirted bride in the picture stared at me blandly as a yellowed letter slid out. It felt dusty somehow, as though its years in the attic had soaked into the microscopic crevices in the paper. I sighed and closed my eyes, bracing myself. Then I unfolded the paper and looked down at my grandmother\u0027s handwriting.\\n\\n It was unexpectedly painful to see it: spiky and compressed, poorly spelled and punctuated, but it was hers, my gran\u0027s. I had read God knows how many things she\u0027d written in our life together: grocery lists, instructions, recipes, even a few personal notes. There was a bundle of them in my dressing table still.\\n\\n Sookie, I\u0027m so proud of you graduating from high school. I wish your mom and dad had been here to see you in your cap and gown.\\n\\n Sookie, please pick up your room, I can\u0027t vacuum if I can\u0027t see the floor.\\n\\n Sookie, Jason will pick you up after softball practice, I have to go to a meeting of the Garden Club.\\n\\n I was sure this letter would be different. I was right. She began formally.\\n\\n Dear Sookie,\\n\\n I think you\u0027ll find this, if anyone does. There\u0027s nowhere else I can leave it, and when I think you\u0027re ready I\u0027ll tell you where I put it.\\n\\n Tears welled up in my eyes. She\u0027d been murdered before she thought I was ready. Maybe I never would have been ready.\\n\\n You know I loved your grandfather more than anything.\\n\\n I\u0027d thought I\u0027d known that. They\u0027d had a rock-solid marriage . . . I\u0027d assumed. The evidence suggested that might not have been the case.\\n\\n But I did want chilren so bad, so bad. I felt if I had chilren my life would be perfect. I didn\u0027t realize asking God for a perfect life was a stupid\\n\\n thing to do. I got tempted beyond my ability to resist. God was punishing me for my greed, I guess.\\n\\n He was so beautiful. But I knew when I saw him that he wasn\u0027t a real person. He told me later he was part human, but I never saw much\\n\\n humanity in him. Your grandfather had left for Baton Rouge, a long trip then. Later that morning we\u0027d had a storm that knocked down a big\\n\\n pine by the driveway so it was blocked. I was trying to saw up the pine so your grandfather would be able to bring the truck back up the\\n\\n driveway. I took a break to go to the back yard to see if the clothes on the line were dry, and he walked out of the woods. When he helped\\n\\n me move the tree--well, he moved it all by himself--I said Thank You, of course. I don\u0027t know if you know this, but if you say Thank You to\\n\\n one of them you\u0027re obligated. I don\u0027t know why, that\u0027s just good manners.\\n\\n Claudine had mentioned that in passing when I\u0027d first met her, but I believed she\u0027d told me it was simply a fairy etiquette thing. Mindful of my manners, I\u0027d tried to be sure to never explicitly thank Niall, even when we\u0027d swapped gifts at Christmas. (It had taken every bit of self-control I\u0027d had not to say \"Thank you.\" I\u0027d said, \"Oh, you thought of me! I know I\u0027ll enjoy it,\" and clamped my lips together.) But Claude . . . I\u0027d been around him so often, I knew I\u0027d thanked him for taking out the garbage or passing me the salt. Crap!\\n\\n Anyway, I asked him if he wanted a drink and he was thirsty, and I was so lonely and I wanted a baby. Your grandpa and me had been\\n\\n married five years by then and not a sign of a baby on the way. I figured something was wrong, though we didn\u0027t find out what until later\\n\\n when a doctor said the mumps had . . . well. Poor Mitchell. Was not his fault, it was the sickness. I just told him it was a miracle we\u0027d had\\n\\n the two, we didn\u0027t need the five or six he\u0027d hoped for. He never even looked at me funny about that. He was so sure I\u0027d never been with\\n\\n someone else. It was coals of fire on my head. Bad enough I did it once, but two years later Fintan came back and I did it again, and\\n\\n those weren\u0027t the only times. It was so strange. Sometimes I would think I smelled him! I would turn around and it was Mitchell.\\n\\n But having your dad and Linda was worth the guilt. I loved them so much, and I hope it wasn\u0027t my sin that made them both die so young.\\n\\n At least Linda had Hadley, wherever she may be, and at least Corbett had you and Jason. Watching you grow up has been a blessing\\n\\n and a privlege. I love you both more than I can say.\\n\\n Well, I\u0027ve been writing for a long time. I love you, honey. Now I have to tell you about your grandfather\u0027s friend. He was a dark-headed\\n\\n man, real big, talked real fancy. He said he was sort of like yall\u0027s sponsor, like a sort of godfather, but I didn\u0027t trust him any farther than I\\n\\n could throw him. He didn\u0027t look like a man of God. He dropped by after Corbett and Linda were born. After you two came along, I thought\\n\\n maybe he might come around again. Sure enough, he showed up all of a sudden, once while I was keeping Jason, and once while I was\\n\\n keeping you, when you were both in the cradle. He gave each of you a gift, he said, but if so it wasn\u0027t one I could put in the bank account,\\n\\n which would have been useful when you came to live with me.\\n\\n Then he came by one more time, a few years ago. He gave me this green thing. He said fairys give it to each other when they\u0027re in love,\\n\\n and Fintan had given it to him to bring here to me if Fintan died before I did. It\u0027s got a magical spell in it, he said. You won\u0027t ever need to\\n\\n use it, I hope, he said. But if you do he said to remember that it was a one time thing, not like a lamp, like in the story, with a lot of wishes.\\n\\n He called this thing a cluviel dor, and showed me how to spell it. So I guess Fintan is dead, though I was scared to ask the man any questions. I haven\u0027t seen Fintan since after your dad and Linda were\\n\\n born. He held them both and then he left. He said he couldn\u0027t come again ever, that it was too dangerous for me and the kids, that his\\n\\n enemys would follow him here if he kept visiting, even if he came in disguise. I think maybe he was saying he\u0027d come in disguise before,\\n\\n and that worries me. And why would he have enemys? I guess the fairys don\u0027t always get along, just like people. To tell you the truth, I\u0027d\\n\\n been feeling worse and worse about your grandpa every single time I saw Fintan, so when he said he was going for good, it was more or\\n\\n less a relief. I still feel plenty guilty, but when I remember raising your daddy and Linda I\u0027m so glad I had them, and raising you and Jason\\n\\n has been a joy to me.\\n\\n Anyway, this letter is yours now since I\u0027m leaving you the house and the cluviel dor. It may not seem fair that Jason didn\u0027t get anything\\n\\n magical, but your grandfather\u0027s friend said Fintan had watched both of you, and you were the one it should go to. I guess I hope you won\u0027t\\n\\n ever need to know any of this. I always wondered if your problem came from you being a little bit fairy, but then, how come Jason wasn\u0027t\\n\\n the same? Or your dad and Linda, for that matter? Maybe you being able to \"know things\" just happened. I wish I could have cured it so\\n\\n you could have had a normal life, but we have to take what God gives us, and you\u0027ve been real strong handling it.\\n\\n Please be careful. I hope you\u0027re not mad at me, or think the worse of me. All God\u0027s children are sinners. At least my sinning led to life\\n\\n for you and Jason and Hadley.\\n\\n Adele Hale Stackhouse (Grandmother)\\n\\n There was so much to think about that I didn\u0027t know where to start.\\n\\n I was simultaneously stunned, startled, curious, and confused. Before I could stop myself, I picked up my other relic, the worn velvet bag. I loosened the drawstring, which crumbled in my fingers. I opened the bag and let the hard thing inside--the cluviel dor, the gift from my fairy grandfather--fall into my palm.\\n\\n I loved it instantly.\\n\\n It was a creamy light green, trimmed in gold. It was like one of the snuffboxes at the antiques store, but nothing in Splendide had been this beautiful. I could see no catch, no hinge, nothing; it didn\u0027t pop open when I gently pressed and twisted the lid--and there was definitely a lid, trimmed in gold. Hmmm. The round box wasn\u0027t ready to yield its secret.\\n\\n Okeydokey. Maybe I had to do some research. I put the object to one side and sat with my hands folded on the table, staring into space. My head was crowded with thoughts.\\n\\n Gran had obviously been very emotional when she wrote the letter. If our \"godfather\" had given Gran more information about this gift, either she\u0027d neglected to mention it or she simply hadn\u0027t remembered anything else. I wondered when she\u0027d forced herself to set down this confession. Obviously, it had been written after Aunt Linda died, which had happened when Gran was in her seventies. My birth grandfather\u0027s friend--I was pretty sure I recognized the description. Surely the \"godfather\" was Mr. Cataliades, demon lawyer. I knew it must have cost her plenty to say-- on paper--that she\u0027d had sex with someone other than her husband. My grandmother had been a strong individual, and she\u0027d also been a devout Christian. Such an admission must have haunted her.\\n\\n She might have judged herself, but now that I\u0027d gotten over the shock of seeing my grandmother as a woman, I didn\u0027t judge her. Who was I to throw stones? The preacher had told me that all sins were equal in the eyes of God, but I couldn\u0027t help but feel (for example) that a child molester was worse than a person who cheated on his income tax or a lonely woman who\u0027d had unsanctioned sex because she wanted a baby. I was probably wrong, because we also weren\u0027t supposed to pick and choose which rules we obeyed, but that was the way I felt.\\n\\n I shoved my confused thoughts back into a corner of my head and picked up the cluviel dor again. Touching its smoothness was pure pleasure, like the happiness I\u0027d felt when I\u0027d hugged my great-grandfather--but times about two hundred. The cluviel dor was about the size of two stacked Oreo cookies. I rubbed it against my cheek and felt like purring.\\n\\n Did you have to have a magic word to open it?\\n\\n \"Abracadabra,\" I said. \"Please and thank you.\"\\n\\n Nope, didn\u0027t work, plus I felt like an idiot. \"Open sesame,\" I whispered. \"Presto change-o.\" Nope.\\n\\n But thinking of magic gave me an idea. I e-mailed Amelia, and it was a difficult message to phrase. I know e-mail isn\u0027t totally secure, but I also had no reason to think anyone considered my few messages of any importance. I wrote, \"I hate to ask, but besides doing that research on the blood bond for me, can you find out something about a fae thing? Initials c.d.?\" That was as subtle as I could get.\\n\\n Then I returned to my admiration of the cluviel dor. Did you have to be pure fairy to open it? No, that couldn\u0027t be the case. It had been a gift to my grandmother, presumably to use in case of dire need, and she had been completely human.\\n\\n I wished it hadn\u0027t been far away in the attic when she\u0027d been attacked. Whenever I remembered how she\u0027d been discarded on the kitchen floor like offal, soaking in her own blood, I felt both sick and furious. Maybe if she\u0027d had time to fetch the cluviel dor, she could have saved herself.\\n\\n And with that thought, I\u0027d had enough. I returned the cluviel dor to its velvet bag, and I returned Gran\u0027s letter to the pattern envelope. I\u0027d had as much upset as I could handle for a while.\\n\\n It was necessary to hide these items. Unfortunately, their previous excellent hideaway had been removed to a store in Shreveport.\\n\\n Maybe I should call Sam. He could put the letter and the cluviel dor in the safe at Merlotte\u0027s. But considering the attacks on the bar, that wouldn\u0027t be the best place to stow something I valued. I could drive over to Shreveport and use my key to enter Eric\u0027s house to find someplace there. In fact, it was highly possible that Eric had a safe, too, and had never had occasion to show it to me. After I\u0027d mulled it over, that didn\u0027t seem like a good idea, either.\\n\\n I wondered if my desire to keep the items here was simply because I didn\u0027t want to be parted from the cluviel dor. I shrugged. No matter how the conviction had come into my head, I was sure the house was the safest place, at least for now. Perhaps I could put the smooth green box into the sleeping hole for vampires in my guest bedroom closet . . . but that wasn\u0027t much more than a bare box, and what if Eric needed to spend the day there?\\n\\n After racking my brain, I put the pattern envelope into the box of unexamined paper items from the attic. These would be uninteresting to anyone but me. The cluviel dor was a little more difficult to stow away, at least partly because I kept having to resist an impulse to pull it out of the bag again. That struggle made me feel very--Gollum-esque.\\n\\n \"My precioussss,\" I muttered. Would Dermot and Claude be able to sense the nearness of such a remarkable item? No, of course not. It had been in the attic all the time and they hadn\u0027t found it.\\n\\n What if they\u0027d come to live here in hopes of finding it? What if they knew or suspected I had such a thing? Or (more likely) what if they were staying here because they were made happy by its proximity? Though I was sure there were holes in that idea, I couldn\u0027t shake it. It wasn\u0027t my fairy blood that drew them; it was the presence of the cluviel dor.\\n\\n Now you\u0027re just being paranoid, I told myself sternly, and I risked one more glimpse of the creamy green surface. The cluviel dor, I thought, looked like a miniature powder compact. With that idea, the right hiding place came to me. I took the cluviel dor out of its velvet pouch and slid it into the makeup drawer of my dressing table. I opened my box of loose powder and sprinkled just a little over the gleam of creamy green. I added a hair from my brush. Ha! I was pleased with the result. As an afterthought, I stuffed the disintegrating velvet bag into my hose-and-belt drawer. My reason told me the ratty object was just a decaying old bag, but my emotions told me it was something important because my grandmother and my grandfather had touched it.\\n\\n I had so many thoughts ricocheting in my brain that it shut down for the day. After I\u0027d done a little bit of housework, I watched the college softball world series on ESPN. I love softball, because I played in high school. I loved seeing the strong young women from all over America; I loved watching them play a game as hard as they could, full tilt, nothing held in reserve. I realized while I was watching that I knew two other young women like that: Sandra Pelt and Jannalynn Hopper. There was a lesson there, but I wasn\u0027t sure what it was. \\n\\n","sourceLink":"https://allnovel.net/dead-reckoning-sookie-stackhouse-11/page-6.html","bookId":2201,"book":{"id":2201,"title":"Dead Reckoning (Sookie Stackhouse #11)","description":"Storyline: Dead Reckoning (Sookie Stackhouse #11) \\n With her knack for being in trouble\u0027s way, Sookie witnesses the firebombing of Merlotte\u0027s, the bar where she works. Since Sam Merlotte is now known to be two-natured, suspicion falls immediately on the anti-shifters in the area. Sookie suspects otherwise, but her attention is divided when she realizes that her lover Eric Northman and his \"child\" Pam are plotting to kill the vampire who is now their master. Gradually, Sookie is drawn into the plot-which is much more complicated than she knows...\\n","cover":"https://allnovel.net/images/dead-reckoning-sookie-stackhouse-11.jpg","author":"Charlaine Harris","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/dead-reckoning-sookie-stackhouse-11.html","creation":"Oct 5, 2019 8:58:27 AM","modification":"Oct 5, 2019 10:03:38 PM"}}
