{"id":23185,"no":11,"title":"CHAPTER IV.","content":"Judy had just finished speaking when they were interrupted by the entrance of Harry, who had returned for his mother. Judy followed them to the sleigh, for she said she \"must cum out and see de chil\u0027en, spite of her rheumatiz.\" \\n\\n \\n\\n \"Auntie,\" said little Cornelia, \"have my little banty\u0027s eggs hatched yet?\" Cornelia had sent the little banty and her eggs to aunt Judy, that the chickens might be hatched under her care. \\n\\n \\n\\n \"Laws, yes, honey, I\u0027ll go in and get \u0027em for you to see; but I think you had bettor not take them home yet, till they get bigger,\" said Judy, going back into the house. In a little while she appeared with a little covered basket in her hand. She unwrapped the flannel from around the basket, and there lay six beautiful little white banties. \\n\\n \\n\\n \"O mamma! look at the little things! Are they not little beauties?\" said Cornelia, picking up one of them, and laying its soft feathery head to her cheeks. \\n\\n \\n\\n \"Yes, my dear; but you must give them back, and not keep Auntie waiting in the cold.\" \\n\\n \\n\\n Cornelia hesitated a little while, and then was giving it back reluctantly, when her mother gently said, \"Cornelia!\" and she instantly returned the basket to Judy. \\n\\n \\n\\n After they were all seated in the sleigh, and Harry had touched the horse with the whip, they heard some one calling after them, and on looking behind there was poor old Judy carrying two hot bricks in her hand. \\n\\n \\n\\n \"Get out, Ally, and take them from her, and do not let her come so far in the snow.\" \\n\\n \\n\\n But while he was getting free from the entanglement of the buffalo skin, \\n\\n Judy had come up, and, handing them to Mrs. Ford, said: \\n\\n \\n\\n \"Here, Missy, is these ar bricks. I heated \u0027em for you, and forgot \u0027em till you was gone; take \u0027em honey; you\u0027s got more than a mile to go, and I knows you will be cold.\" \\n\\n \\n\\n Mrs. Ford thanked her, but gently reproved her for exposing herself. They watched her as she trudged back in the snow, and then waving their hands to her as she disappeared in the turn of the road, Harry touched the horse, and in a few minutes they seemed as if they were actually flying over the frozen surface. \\n\\n \\n\\n When they arrived at home Bessie had a smoking dinner on the table for them, which they partook of with great relish. After they had finished their dinner, their mother said that as they had but one session at school, they would have ample time to perform their tasks before tea-time. Harry was to chop the wood, while Alfred was to pile it on the porch; and Cornelia would finish the garters that she was kniting as a Christmas present for papa. And after that they were to study their lessons for the next day, so that they would be at leisure in the evening. All cheerfully obeyed, and before tea-time their tasks were all performed and lessons learned. \\n\\n \\n\\n After the tea-things had been removed, \"Now,\" said Mr. Ford, \\n\\n \\n\\n \u0027Stir the fire, and close the shutters fast, \\n\\n Let fall the curtain, and wheel the sofa round,\u0027\" \\n\\n \\n\\n \"And be ready for Aunt Judy\u0027s story,\" added Alfred. \"Come, mother, come; we are all waiting.\" \\n\\n \\n\\n \"Have a little patience, my son, I will be there in a few minutes.\" \\n\\n \\n\\n She soon reappeared, and was greeted with \"three cheers\" from the children, and seating herself in the large comfortable rocking-chair, she began: \\n\\n \\n\\n \"On the eastern side of the beautiful Roanoke was the residence of Mr. Madison, and here the first few years of Judy\u0027s life was passed. She had a kind master, and, while in his service, had a very happy time. She had, like most of her race, a strong native talent for music, and was frequently called upon to exercise it by singing songs, and dancing, for the amusement of General Washington and the other officers of the Revolution who visited at her master\u0027s house. Judy was then quite young, and greatly enjoyed a sight of the soldier\u0027s gay uniform. \\n\\n \\n\\n \"Her master died when she was a child. Her mistress was then in very ill health, and little Judy spent most of the time in her room, in attendance upon her. One day her mistress was seized with a violent fit of coughing. Judy ran to her assistance, and finding that the cough did not yield to the usual remedies, called for help, but before aid was obtained, Mrs. Madison was dead! She died with her arms around the neck of her faithful attendant. \\n\\n \\n\\n \"Mrs. Madison had made provision for the emancipation of Judy, and after her death she received her free papers, which she carefully guarded. \\n\\n \\n\\n \"After her mother\u0027s death, the daughter of Mrs. Madison determined to remove to Kentucky, and Judy, being much attached to her and the family, accompanied them. \\n\\n \\n\\n \"Soon after her arrival there, Judy married a slave on the plantation of Mr. Jackson, which was several miles distant from that of Judy\u0027s mistress. John\u0027s master was very cruel to him; he would not allow him to leave the estate, nor was Judy permitted to come to see him; and thus they lived apart for several months; but the brutal treatment of his master at last rendered John desperate, and he determined to run away. It was a fearful risk, but if he succeeded, the prize, he thought, would be sufficient compensation. \\n\\n \\n\\n \"One morning he had a pass from his master to go to a neighboring town on business, and he thought this a good opportunity to execute the project he had so long entertained. He started, and traveled all night, and lay concealed in the woods all day, and on the third day after he had left home he ventured on to the estate of Judy\u0027s mistress. He went into one of the hen-houses, and it was not long before he saw Judy come out to feed the poultry. She was very much frightened when she saw him, and thought of the consequences that might arise from his master\u0027s rage if he found him. However, she hid him in the barn, supplying him with food at night. He stayed there more than a week, intending to leave Kentucky after his master\u0027s pursuit should have ceased. But one morning his master came to the house, and told Judy\u0027s mistress that one of his slaves was concealed on the place, and asked permission to hunt him, which was granted. He soon found him by the aid of one of the slaves who had noticed Judy carrying food to the barn, and watched her till he had discovered her husband, and then informed against him.\" \\n\\n \\n\\n \"O how mean to betray him!\" exclaimed Alfred. \\n\\n \\n\\n \"Yes, Ally, it was; but I suppose it was the hope of reward that induced him to be guilty of such a base act.\" \\n\\n \\n\\n \"And was he rewarded?\" asked Cornelia, \"for I am sure if he was he did not deserve it.\" \\n\\n \\n\\n \"I do not know that he was, my daughter,\" answered Mrs. Ford. \"John was taken to jail and locked up until his master should return home. Judy obtained a permit to enter the jail, and stayed with him in the cold, damp cell, cheering him with her presence. She could not bear the thought of being again separated, and determined to accompany him, let the consequences be what they might. Her husband was taken to a blacksmith\u0027s shop on the next day after his recapture, and a heavy pair of handcuffs placed upon him, and a chain (having at the end a large iron ball) was then fastened to his leg to prevent him from running, and in this condition they started for home. They walked for six days, she with her infant in her arms, and he, heavily loaded with irons. And she told me that often her dress was one cake of ice up to her knees, the snow and rain being frozen on her skirts. Her husband\u0027s shoes soon gave way, and his feet bled profusely at every step. Judy tore off her skirt, piece by piece, to wrap them in, for she loved him tenderly. But the anguish of their bodies was nothing in comparison with that of their minds. Fear for the consequences of the attempt, and regret that it had not been successful, filled their hearts with grief, and they journeyed on with no earthly hope to cheer them. \\n\\n \\n\\n \"Just think, my children, what they must have suffered through those long dreary days, John going back to slavery and misery, and Judy not knowing what her own fate might be. But she had comforted herself with the thought that when John\u0027s master saw what a condition he was in, he would relent toward him. But she was sadly mistaken, for he took him, weary, sick, and suffering, as he was, and whipped him cruelly, and then left him in an old shed.\" \\n\\n \\n\\n [Illustration: HANDCUFFING JUDY\u0027S HUSBAND] \\n\\n \\n\\n \"O mamma!\" said little Cornelia, burying her face in her mother\u0027s lap, and sobbing aloud, \"Do they do such wicked things?\" \\n\\n \\n\\n \"I wish I had hold of him,\" said Alfred, \"wouldn\u0027t I give it to him?\" \\n\\n \\n\\n \"I should feel very much grieved if I saw you harm him in any way, Ally. Do you forget what our blessed Saviour said about returning good for evil?\" asked his mother. \\n\\n \\n\\n \"Well, but mother, I am sure it would have been no more than fair just to give him a good cowhiding, so as it did not kill him.\" \\n\\n \\n\\n \"No more than he deserved, perhaps, but, my son, you should remember that Jesus taught us that we should forgive the greatest injuries. \\n\\n \\n\\n \"After this cruel treatment of John, Judy, with the aid of one of the other slaves who sympathized with her and John, carried him to a little hut that was not so much exposed as the one in which he had previously lain. He had a razor with which he had attempted to kill himself, but Judy came in at that moment, and as he was very weak, she easily took it from him; but he said: \\n\\n \\n\\n \"\u0027O let me die! I would rather be in my grave, than endure this over again.\u0027 \\n\\n \\n\\n \"He was sick and helpless a long time, but he would have suffered much more if Judy had not been free, and had it in her power to nurse him. There is many a poor slave that has fallen a victim to this kind of barbarity, with no eye to witness his distress but his heavenly Father\u0027s. \\n\\n \\n\\n \"To add to John\u0027s misery was the brutal treatment of a little brother; a smart active child of eight years of age, who was owned by the same man. Mr. Jackson was a great drunkard, and when under the influence of liquor no crime was too great for him. One day, for some slight offense, he took the child, marked his throat from ear to ear, and then cut the rims of his ears partly off and left them hanging down. A little while after this, a gentleman, who had been in the habit of visiting at the house, rode up, and noticing the child\u0027s throat, asked him how it happened. He said, \"Massa did it.\" The gentleman was so enraged, that he immediately mounted his horse, rode away, and had him arrested. \\n\\n \\n\\n \"When John was able to leave his bed, his mistress, a kind and humane woman, whose slave he had been before her marriage, took him and hid him in a cave that was on the plantation, and supplied him with food, intending to send him away as soon as she could do so safely. \\n\\n \\n\\n \"He was there several weeks, and his master supposed he had again escaped, and was hid somewhere in the woods, but he had become so much dissipated that he took no interest in his business affairs, and never explored the hiding-places on his own plantation. One day a gentleman by the name of Mr. Lawrence, of Vincennes, came to Mr. Jackson\u0027s to purchase a servant to take with him to Indiana. \\n\\n \\n\\n \"Why, mother, I thought that they would not allow any one to hold slaves here,\" said Ally. \\n\\n \\n\\n \"No, they do not, my son, but this gentleman was to take him as a bound servant for a term of years, and he probably supposed that poor John\u0027s legal rights would not be very carefully examined. John was sold in the woods for a small sum. After the bargain was concluded, Mr. Lawrence asked if the slave had a wife on the plantation, and was told that he had. Judy was pointed out to him. He asked her if she knew where her husband was, and she told him that she did; for she thought it was better for him to leave his cave, as it was damp and comfortless. So that night, with new hope in her heart, Judy went to his lone and dreary hiding-place, and told him of the bargain. Any change was a relief to him, and he came willingly out, and made preparations for going with Mr. Lawrence. He waited until his master was in bed, and too deeply stupefied with liquor to heed what was passing, and then came to the place appointed. Mrs. Jackson gave him some clothes, and made what provision she could for his comfort on the way. John had a horse given him to ride upon, but Judy was taken no notice of; yet she determined to walk the three days\u0027 journey, rather than be separated from John. \\n\\n \\n\\n \"Mr. Lawrence, when he perceived Judy was following them, tried to persuade her to return, for she had a young child with her, and he was afraid she would be troublesome. He told her that after her husband was settled in Vincennes, he would send for her, but she had learned to place no confidence in promises made to a slave; so she resolved she would go, believing if she lost sight of her husband she would never see him again. \\n\\n \\n\\n \"They had to cross the Ohio in a ferry boat, and Judy strained every nerve to reach it before them. She did so; and hurrying up the stairs with her baby, she clasped the railings, resolved to stay there, unless compelled by violence to leave the boat. But no one noticed her, and she arrived safely on the other side. After walking some miles, poor Judy became tired and weary, and her strength failed her, and she was afraid that after all she had gone through, for the sake of her husband, she would be left at last. But she thought she would make another effort, so she told Mr. Lawrence that if he would buy her a horse to ride upon, she would bind herself to him for six months after they arrived in Indiana. He agreed to do so, and bought her a horse. After they reached Vincennes, and Judy had worked out her six months, she again bound herself to him to serve out her husband\u0027s time, for he was very weak and feeble, and was suffering with a severe cough, and Judy longed to see him own his own body. But God freed him before the year was out. He had suffered so much from severe whipping and abuse of every kind that he wasted away and died of consumption. \\n\\n \\n\\n \"After his death Judy remained with his master for some time, but she finally became dissatisfied, and longed to go back to Mrs. Madison\u0027s daughter, and see her home once more. She mentioned this to Mr. Lawrence, but he took no notice of it until, one day, he came to her and said: \\n\\n \\n\\n \"\u0027Judy, I want you to come down to the auction rooms, I have bought a few things to-day, and I want you to carry them home; and you might as well bring little Charley along with you, he can help you.\u0027 \\n\\n \\n\\n \"The little Charley here spoken of was a smart child of five or six years of age. Judy and Charley accompanied Mr. Lawrence to the rooms. When they arrived there Judy observed a number of strange-looking men who appeared to be earnestly conversing on some subject which interested Mr. Lawrence deeply. But Judy suspected nothing, and had begun arranging the things so that she could carry them more conveniently, when her master turned round to her and said: \\n\\n \\n\\n \"\u0027Judy, you have become dissatisfied with me, and I have got you a new master.\u0027 \\n\\n \\n\\n \"Judy was frightened, and attempted to run, but one of them caught her, and dragging her to a trap door, let her down. Little Charley, not knowing what had become of his mother, began to cry, but one of the men held him and told him to stop making such a noise. \\n\\n \\n\\n \"Judy remained in the cellar until a vessel came along, and she was then taken out, and a handkerchief tied tightly over her mouth to prevent her from screaming or making any noise. She was then hurried on board of the boat, with a cargo of slaves bound for the far South. It seemed now as if her \u0027cup of bitterness was full.\u0027 As she was on the deck, in grief and terror, she heard some one calling \u0027Mother! mother!\u0027 and on looking up, there was her darling boy. She asked him how he came there; he answered: \\n\\n \\n\\n \"\u0027A naughty man that put you down in the cellar carried me to his house, and locked me up, and then brought me here.\u0027 \\n\\n \\n\\n [Illustration: WAITING TO BE SOLD.] \\n\\n \\n\\n \"Poor Judy! she knew in a moment that both were to be sold, and no language can describe her anguish; her free papers were left behind, and another one of her children, her little daughter Fanny. She did not know what would become of her, or where she was going. After sailing for several weeks, they arrived at a place which she thinks was called Vicksburg; here they were taken off the boat, and carried to the auction rooms, where a sale was then going on. In a little while after they came in, a gentleman walked up to them, and after looking at little Charley, placed him on the block. Poor Judy\u0027s heart was almost bursting; but when she saw a man buy and carry away the pride and joy of her heart, she became frantic, and screamed after him, but he was picked up and carried from her sight. It was too much for her; all was a mist in a moment, and she sank senseless to the floor. When she revived she found herself lying on an old pile of cotton in one corner of the auction rooms. The auctioneer, seeing that she had arisen, bade her stand in the pen, along with the other negroes. Judy mechanically obeyed, and took her place with the others, and was sitting like one in a dream, when she was aroused by a man slapping her on the back. \\n\\n \\n\\n \"\u0027Come, look spry, old woman,\u0027 said he. \\n\\n \\n\\n \"\u0027Could you look spry, massa, if your child, your son you loved as well as your life, was torn away from you? O God!\u0027 said she, burying her face in her hands, \u0027have mercy on me, and help me to be resigned.\u0027 \\n\\n \\n\\n \"\u0027Yes, I\u0027ll make you resigned,\u0027 said he, sneeringly, slapping her across the back. \u0027Now you follow me, and don\u0027t let me hear a word out of your head.\u0027 \\n\\n \\n\\n \"Judy obeyed, and after arriving at the wharf, they went on board a vessel that was bound for New Orleans. In about a week after they had started, they arrived at Mr. Martin\u0027s plantation, where Judy saw about one hundred and fifty slaves at work in the field. Without being allowed a moment to rest herself, after her long walk from the boat, she was given a basket and ordered to the field. Poor Judy\u0027s head was aching severely, and when she was exposed to the scorching rays of the sun of the south, her temples throbbed wildly, and O! how she longed for some quiet shady place, where she could bathe her fevered brow and rest her weary limbs. But she must not think of stopping a moment to rest, for the eyes of the brutal overseer were upon her, and the thought of the stinging lash, the smart and pain, came across her mind, and urged her on, and made her work with greater swiftness than before. At last the weary, weary day drew to a close, and it was getting quite dark, and the dew was beginning to fall, and Judy was expecting every moment to hear the order for them to return home. But still they worked on, and hour after hour passed, until it was almost midnight, and not till then did the joyful summons come for them to stop.\" \\n\\n \\n\\n \"Why, mamma, do they make them work so late as that?\" asked Cornelia. \\n\\n \\n\\n \"Yes, my daughter, in the busy season the poor slaves are often kept out very late. After they had received the order to return home, Judy, with aching limbs, joined the other slaves who were wearily wending their way to the little out-house where the overseer was weighing their cotton. As they presented their baskets to be weighed, they watched eagerly to see if their baskets were approved of. Judy gladly heard that hers was the full weight, and after ascertaining where she was to sleep, and receiving her allowance of corn, she went to the shed pointed out to her. She made her cakes for her supper and for the next morning, and then laid down upon her bed, or rather on a pile of straw with an old piece of sheet spread over it. Judy was much exhausted, and soon fell asleep, notwithstanding the roughness of her bed. But it seemed as though she had scarcely closed her eyes before the plantation bell rang, and called them to another weary day\u0027s work. \\n\\n \\n\\n \"Thus many, many months passed, of toiling from day to day, and from morning till night. One morning they saw one of the house servants running toward them; he told them that their master was dead. He had died suddenly from a fit of appoplexy. The tidings were received by Judy with joy. You must pardon her, my children, for this man had been a cruel master to her, and she thought that, as he had neither wife nor children, his slaves would be sold, and perhaps she would get farther north, and in the neighborhood of her old home, and might meet with some of her old friends who would prove that she was free. \\n\\n \\n\\n \"A few days after Mr. Martin\u0027s funeral there was a meeting of his heirs, and they determined to sell the slaves. Accordingly the next morning they were marched down to the wharf, where they found a boat at anchor, and all went on board. We will pass over the wearisome trip of several days, and imagine them to be at the end of their journey at Memphis. Here they were taken off the boat, and placed in jail until auction day. In a few days they were again taken out and tied in couples, and taken to the auction. Judy was sitting very disconsolate, thinking of her past misfortunes and coming sorrows. The hope of seeing any of her old friends, or of being reunited with her children, she had almost given up. The auctioneer called to her, and she stepped on the block. Her strong and well-proportioned figure, and comely, though dejected and sad appearance, instantly raised a dozen bids. First here, now there, might be heard the voice of the competitors; the noise of the hammer ceased, and Judy was the property of Mr. Carter. After his purchase Mr. Carter was taking Judy to the boat, when she felt some one catching hold of her arm; she turned around and immediately recognized the person as a gentleman whom she had known while living with Mrs. Madison\u0027s daughter. He said to her: \\n\\n \\n\\n \"\u0027Why, Judy, where are you going?\u0027 \\n\\n \\n\\n \"She answered in a kind of wicked despair: \\n\\n \\n\\n \"\u0027To hell, I believe.\u0027 \\n\\n \\n\\n \"This gentleman inquired about her condition, and finally rescued her, and sent her to Vincennes, where she labored for many years and found some good friends, but she never felt safe after she had been stolen away from there. She made inquiries about her children, but never learned anything of them. Not having anything to attach her to Vincennes, she left and came to Terra Haute, where she resided a little while, and then came further into the interior of the state. \\n\\n \\n\\n \"Her children are scattered, and gone she knows not where; and after a long life of toil and suffering she is here, old, infirm, and a beggar. Every wrinkle on her brow could tell a tale of suffering; her youth is gone; her energies are all spent, and her long life of toil has been for naught.\" \\n\\n \\n\\n Mrs. Ford ceased, her tears were falling fast, and the children were sobbing around her. The fire, from neglect, had gone out, and there were only a few smoking embers left in the fire-place, reminding them of the time that had been spent in hearing \"AUNT JUDY\u0027S STORY.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/2469/68317.html","bookId":555,"book":{"id":555,"title":"A Child\u0027s Anti-Slavery Book","description":"简介： A Child\u0027s Anti-Slavery Book Containing a Few Words About American Slave Children and Stories of Slave-Life....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2469","creation":"Aug 1, 2019 12:18:57 AM","modification":"Aug 1, 2019 12:18:57 AM"}}
