{"id":95659,"no":13,"title":"Page 13","content":"Lucia woke up in the hospital, with an IV in her arm and an oxygen mask on her face, and for a panicked moment she thought, I\u0027m dying.\\n\\n Didn\u0027t feel that way, though. In fact, she felt a lot better. Sore and weak, but better. Her mouth was dry as old paper. She cleared her throat and tried to sit up.\\n\\n \"Whoa!\"\\n\\n A face, looming over the bed. Jazz, looking delighted. Behind her was James Borden, all angles and smiles. His hair was creatively mussed, and his clothes looked lived-in. So did Jazz\u0027s, but that wasn\u0027t remarkable.\\n\\n \"Look who\u0027s awake,\" Jazz said, and reached for her hand, and the warm pressure of her fingers felt nice. Felt real. \"How you feeling?\"\\n\\n Lucia nodded slightly and tried to talk. No good. Her voice wasn\u0027t even a hoarse croak. She gestured toward the pink pitcher of water on the stand next to the bed, and Borden hurried around to pour some for her.\\n\\n Water, after such a long thirst, tasted like a revelation of the divine. Lucia whimpered with delight and swallowed until the cup was dry.\\n\\n \"Better?\" Borden asked. He refilled it. \"You\u0027ve been out awhile. Couple of days.\" Some silent conversation between Borden and Jazz passed over her head. \"You remember anything?\"\\n\\n \"No.\" That was a word. A small one, and it sounded rough, but it was a recognizable word. Progress. \"Pansy. All right?\"\\n\\n \"Pansy\u0027s fine,\" Jazz said. \"Never even got a sniffle or a fever. No infection at all. No other victims reported, either. Looks like you were the lucky one.\"\\n\\n \"What happened?\"\\n\\n \"What do you remember?\" Jazz asked.\\n\\n \"Going to sleep, after - after the hospital. Tired.\"\\n\\n \"Nothing else? You\u0027re sure?\"\\n\\n Lucia swallowed another ball of fire that seemed to be clinging to the back of her throat. \"Dreams, maybe. Nightmares.\"\\n\\n \"But you don\u0027t remember leaving your apartment.\"\\n\\n The fragile sense of well-being shattered. \"I - left?\"\\n\\n Another look passed from Borden to Jazz, Jazz to Borden. Lucia was still fuzzy, the world still indistinct, but even so she didn\u0027t care for the way they were avoiding her questions.\\n\\n \"Yeah,\" Jazz said softly. \"You left. At least, that\u0027s what the security logs say. You entered the code to disable the alarm, and you just - vanished. No sign of how you got out of the apartment.\"\\n\\n This wasn\u0027t right. Couldn\u0027t be right. She hadn\u0027t I\\n\\n well enough to leave. She remembered setting the alarm for instant alert and stumbling off to bed.\\n\\n There was, of course, another way out of the apartment that wouldn\u0027t appear on the security logs - her own Manny-inspired precautions - but why would she run away? And why wouldn\u0027t she remember it? \"Where did you find me?\"\\n\\n \"We didn\u0027t,\" Borden said. \"You were missing for four days. And on the fifth day, you were found sleeping in a supposedly unoccupied room at the Raphael.\"\\n\\n \"What?\"\\n\\n \"Yeah,\" Jazz said grimly. \"I\u0027m not a woo-woo girl, but I\u0027m not ruling out alien abduction.\"\\n\\n That was impossible.\\n\\n Lucia didn\u0027t remember anything from the moment she\u0027d fallen asleep on her bed, fully clothed, to waking up here.\\n\\n Nothing. Just dreams, and those were fading fast.\\n\\n \"Where was I?\" she asked. Her voice was faint and weak, and Jazz looked at Borden again, this time for support.\\n\\n \"Honest to God, L. - I wish to hell I knew. The only good thing anybody can tell us is that you were being treated for what was wrong with you. IV antibiotics, just like they would have done here, apparently. You\u0027re weak now, but you\u0027re on the mend. Fever\u0027s gone, no sign of infection from the swabs they took, and you\u0027re not even going to want to know about any of that swabbing business, believe me.\" Jazz blew hair off of her forehead and grinned grimly. \"Trust you to end up kidnapped by renegade doctors.\"\\n\\n \"Renegade doctors whose heads I\u0027m going to mount on my trophy wall.\"\\n\\n \"Yes, bwana. I\u0027ll carry the elephant gun.\"\\n\\n Four days. Four missing days. Six, if she\u0027d been unconscious here since they\u0027d found her. Almost a week of her life gone into a black hole.\\n\\n \"What about Susannah?\" Omar, dead on the floor, hands open, throat cut. \"Do the cops still have her?\"\\n\\n \"No. They let her go. McCarthy\u0027s watching her,\" Jazz said. \"Although believe me, it\u0027s been a challenge keeping him from being here twenty-four-seven. Look, I\u0027ve been thinking...maybe the Cross Society decided they owed you one. Considering that it was their fake red letter that got you in trouble in the first place.\"\\n\\n Eerily possible. Gregory Ivanovich had defeated her security once. He could have done it again. And carried me out? If he\u0027d used her emergency exit, he could have done it?\"\\n\\n \"I\u0027ll deal with that later,\" she whispered. \"What about Susannah? You said they released her?\"\\n\\n \"Forensic evidence proved out her story. Her husband\u0027s prints were on the knife, hers overlaid his. So she picked up the knife after he did. So yeah, KCPD released her.\" Jazz cleared her throat. \"Problem is, she\u0027s already had one attempt on her life since they let her go. We had to step in again.\"\\n\\n McCarthy. Omar\u0027s bloody corpse flashed in front of Lucia\u0027s eyes again. \"Anyone - \" McCarthy \" - hurt?\"\\n\\n \"No, the shooter tried for a sidewalk hit. McCarthy got her behind a car in time. No damage.\"\\n\\n \"No red envelopes?\"\\n\\n \"Evidently, saving her life isn\u0027t important.\" The grim set of Jazz\u0027s face told Lucia what she thought about that. \"I chewed Laskins a new asshole trying to get Simms to tell us what happened to you. No comment from the jailhouse psychic. He\u0027ll put himself out for strangers, not for his own. Bastards, all of them. I\u0027m sick of this fucking circus.\"\\n\\n Lucia smiled faintly. She could well imagine Jazz on the phone with Borden\u0027s boss, reading him the riot act. Laskins wouldn\u0027t have been pleased. For all she knew, Jazz might have hopped a plane to California, where Simms was jailed, to try the psychic in person.\\n\\n Borden was looking elsewhere, deliberately taking himself out of the conversation. She wondered if Jazz had considered the ramifications of having him in the room, and then realized that Jazz nearly always considered the ramifications. That was part of the contradiction of the woman. She was impulsive and rash, and she also saw consequences coming a mile ahead. That didn\u0027t mean she allowed them to dictate her course of action.\\n\\n Lucia cleared her throat again. \"She\u0027s still with him? With McCarthy?\"\\n\\n \"Yeah. He put me in charge of finding you.\" Jazz shrugged, eyes glittering. \"Called him every night to tell him that I hadn\u0027t. And every night, he told me that I\u0027d better find you, or it\u0027d be my ass.\"\\n\\n \"You did find me.\"\\n\\n Jazz nodded. \"Yeah, tripped over you getting admitted to the hospital. World-class detective, I am. But on the bright side, guess I get to keep my ass.\"\\n\\n Lucia drank more water. Borden raised the pitcher inquiringly; she shook her head. \"I wish I knew what - what happened.\" Because anything could have. That was a disturbing void in her life. \"When can I get out of here?\"\\n\\n \"When you can gnaw through the straps,\" Jazz said. \"I want you here until you can kick ass and take names.\"\\n\\n That, Lucia thought, would take nothing more than a decent meal, a walk around the building and a fresh set of clothes.\\n\\n Because she was so very, very ready to kick ass.\\n\\n It took something more than an afternoon - a day and a half, to be exact - for the various doctors to present themselves and sign off on her release. She\u0027d grimly demonstrated her ability to walk, eat, drink and pee in sufficient quantities to get everyone off her back.\\n\\n Ben McCarthy didn\u0027t show. She kept expecting to turn around and see him walking through the door, kept expecting to feel his presence behind her. Didn\u0027t happen. But then, she reminded herself, he was working. Doing her job, in fact.\\n\\n That didn\u0027t stop her from feeling irrationally annoyed about it.\\n\\n She felt weak, but it was the kind of weakness that only movement and exercise would cure. She started off by scorning the wheelchair and taking the stairs, with Jazz and Borden clumping along behind her.\\n\\n \"Did you bring me a gun?\" she asked Jazz before they hit the ground floor exit.\\n\\n For answer, Jazz jumped down to the landing, reached in the inside pocket of her leather jacket and pulled out Lucia\u0027s P95 and shoulder holster. Lucia ran through the checklist on the gun, ratcheting the slide, examining the clip, ejecting the bullet in the chamber and reloading. Everything worked smooth as silk.\\n\\n \"She cleaned it for you,\" Borden said.\\n\\n Jazz shrugged. \"No big deal.\" Then she grinned and nudged him with her elbow. \"Besides, nude girls cleaning guns turn him on.\"\\n\\n \"More than I needed to know. From both of you.\" Lucia removed her coat and put the holster on, settling the gun snugly against her ribs. While she was putting the coat on again, Jazz pushed past her to reach the door first.\\n\\n Protecting her, Lucia realized. She blinked, smiled slightly and followed.\\n\\n Once again, Manny had given up his Hummer to the cause; Lucia was starting to like the damn thing. It certainly gave one a feeling of security, riding high above traffic. It also presents a fine target, and it\u0027s easy to follow.\\n\\n Jazz wanted to take her straight home, but Lucia wasn\u0027t having any of it. \"Has Susannah said anything about her husband\u0027s business yet?\"\\n\\n \"Not a word. Ben\u0027s been working on it, but she doesn\u0027t seem to trust anybody. Why? You want to take a run at her?\"\\n\\n \"Absolutely.\" Mostly, she had to admit, she wanted to see McCarthy.\\n\\n \"And you don\u0027t think you should be, you know, resting...?\"\\n\\n \"Apparently, I\u0027ve been resting for almost a week. The last thing I need is more sleep. I need to think and I need to move. It\u0027s time to get into this thing, Jazz. I have a hunch that it\u0027s larger than we can see right now.\"\\n\\n Jazz took the next right turn. \"Far be it from me to get in the way of your hunches.\" She sounded amused, but not dismissive. Progress, of a sort. \"I\u0027m going to keep digging. Somebody had to see you being carried into the Raphael. You damn sure weren\u0027t walking on your own.\"\\n\\n Borden said nothing. He had a laptop computer open, and he was typing away.\\n\\n \"Counselor,\" Lucia said. He looked back over his shoulder at her, eyebrows raised. \"Shouldn\u0027t you be in New York?\"\\n\\n \"Actually, GP\u0026L is considering opening a branch office here,\" he said. \"I\u0027m fact-finding. We have seven corporate clients here, not to mention some other vested interests. And the air travel\u0027s getting old. They don\u0027t even feed you anymore on the plane.\"\\n\\n \"Tragic,\" she agreed, straight-faced. \"Was this your idea, or your boss\u0027s?\"\\n\\n \"Mine.\"\\n\\n \"Sure about that?\"\\n\\n He lost the friendly smile. \"Meaning?\"\\n\\n \"Meaning, are you sure that you\u0027re not doing the Cross Society\u0027s work instead of your firm\u0027s, setting up here?\"\\n\\n \"They\u0027re not mutually exclusive.\"\\n\\n \"I\u0027m not so certain.\"\\n\\n He blinked and turned around even farther. The laptop was in danger of sliding to the floor. \"So you think we\u0027re the villains now? Is that it?\"\\n\\n \"We?\"\\n\\n That wasn\u0027t Lucia speaking. It was Jazz. Borden looked at her, stricken. \"I mean...\"\\n\\n \"Yeah,\" she said. \"I get what you mean. Your loyalty\u0027s still with the Society. We means people who aren\u0027t in this car.\"\\n\\n \"Jazz - \"\\n\\n It was a lost cause, and Borden knew it. He turned to face the road.\\n\\n It occurred to her that he\u0027d be updating Laskins about what they were doing, and through Laskins, the Society and Simms. But she couldn\u0027t tell Jazz to turf him; she could see how important he was to her, and truthfully, she liked Borden. She liked his off-center smile, his quick intelligence, his wit, the passion in his eyes when he looked at her partner.\\n\\n But she didn\u0027t like what he represented, at the moment. And she wasn\u0027t sure she liked him knowing where Susannah Davis was hidden.\\n\\n They pulled into an apartment complex parking lot-not a complex Lucia was familiar with, more of a cheap, run-down establishment. The paint was peeling, and even the spring flowers in their landscaped beds looked cheap and struggling. It was the sort of place drug dealers rented, and hookers, and people who couldn\u0027t afford better. The sort of place where people averted their eyes from their neighbors and hoped that the noise in the apartment next door wasn\u0027t a felony being committed.\\n\\n But Jazz\u0027s instincts were, as always, sound. It was also a place where women with bruised faces weren\u0027t necessarily worth comment.\\n\\n \"Number 317. Some distant cousin\u0027s apartment,\" Jazz said. \"He\u0027s in jail. I told you before, my family tree has some funky branches.\"\\n\\n \"How\u0027d you get the keys?\"\\n\\n \"It\u0027s a cheap apartment.\" She shrugged. \"Keys aren\u0027t all that relevant.\"\\n\\n When Jazz and Borden started to exit the Hummer, Lucia reached over the seat and grabbed both of them by the shoulders. \"No,\" she said quietly. \"Listen. I want to talk to Susannah alone. I don\u0027t want an entourage. I appreciate everything you\u0027ve done for me, but you have to let me do my job now. And Jazz - you\u0027re not supposed to be running around like this, it isn\u0027t safe. Borden, you\u0027re supposed to be keeping her out of trouble, not getting her deeper into it. Right?\"\\n\\n \"No way,\" Jazz said instantly. \"I go with you to the door, at least. Don\u0027t start, okay? You get escorted. We protect each other. Hell, it\u0027s worked so far.\"\\n\\n Before she could form a coherent objection, Jazz was out of the truck. Lucia scrambled to follow. Jazz wasn\u0027t wasting time; she moved fast and sure, heading for building three. Lucia fell into step with her. \"I let you out of my sight,\" Jazz said softly, \"and you were gone. You seriously think I\u0027m going to let that happen again? Four days. Four fucking days, Lucia, and I thought I was looking for a corpse. Not again. Understand?\"\\n\\n They followed the cracked sidewalk in long, no-nonsense strides. The grass was sparse and dry, the bushes more branches than leaves. Some of the residents were making an effort - cheerful lawn furniture on the patios, wind chimes, bird feeders - but most had abandoned hope and lived with closed, sagging curtains, minding their own business.\\n\\n The apartment was at the top of two flights of stairs that creaked as Lucia and Jazz jogged up. Even had they wanted to be stealthy, it wouldn\u0027t have been possible.\\n\\n They slowed as they got to the landing, and Jazz unceremoniously pushed Lucia behind her and pulled her gun as she stepped forward. Two apartments, both with closed curtains. There was a faded welcome mat in front of 318, nothing but dried leaves in front of the other.\\n\\n Jazz raised her hand to knock, but the door swung open, and Ben McCarthy was there. He opened his mouth to speak, and then his eyes focused past Jazz, on Lucia.\\n\\n The look stopped her breath. His lips shaped a word-not her name. It took her a second to realize that it was God, A prayer, of a kind.\\n\\n \"Delivered to the door. Want me to wait in the car?\" Jazz asked.\\n\\n Ben tore his gaze away from Lucia to her. \"No,\" he said. \"I\u0027ll get her home. I don\u0027t want you hanging out in a goddamn Hummer in this parking lot. Kind of draws attention.\"\\n\\n \"Ah, hell, half a dozen guys in this complex drive Hummers.\"\\n\\n \"Drag dealers.\"\\n\\n \"Exactly.\"\\n\\n McCarthy stilled her with a hand on her arm. \"Jazz. I\u0027ll get her home safe. Count on it.\"\\n\\n She shut up and looked at him for long seconds, then nodded.\\n\\n \"Now get the damn truck out of here. Go.\"\\n\\n Jazz glanced at Lucia as she turned toward the stairs. \"I\u0027ll kill you if you up and die on me,\" she said, and descended quickly, two steps at a time.\\n\\n \"Inside,\" McCarthy said, and tugged Lucia over the threshold before she could react. He stayed at the door for a long moment, and she watched him, reading the tension in his body. He had his gun out, ready at his side, and she could tell the precise moment when Jazz was safely in the Hummer, because he let out a held breath and shut the door. The place smelled faintly of old cats and stale cigarettes. She blinked, and her eyes adjusted to the dimness. Except for the welcome sight of McCarthy, she wished they hadn\u0027t. The furniture was garage sale, most of it broken, and the carpet was an unattractive green shag that she thought at first was stained, but then decided must have been meant to have a mottled effect. Plain white walls had plenty of damage to give the place that special designer touch.\\n\\n A giant glow-in-the-dark poster of a marijuana leaf decorated the wall over the sagging couch, and another of a long-dead singer looking the worse far wear. Heroin chic, the entire apartment.\\n\\n McCarthy finished the last of the dead bolts and turned toward her. She met his eyes and smiled slightly. \"Jazz said you were worried.\"\\n\\n \"Worried?\" Something flashed in his eyes. \"Worried doesn\u0027t quite cover it, Lucia. Where the hell were you?\"\\n\\n \"I don\u0027t know.\" It hurt to say it, and a bubble of panic formed somewhere just below her stomach. \"All I remember is going to sleep in my apartment and waking up in the hospital.\"\\n\\n \"Nothing else?\" He took her arm and guided her to the couch. \"You\u0027re sure?\"\\n\\n \"Dreams,\" she said. \"Impressions. Nothing - \" She remembered a quick flash. Bright lights, a smothering feeling of panic, her limbs heavy with sedatives. Smeared voices.\\n\\n Violations.\\n\\n \"I\u0027ll find out,\" she said flatly. \"If it\u0027s the last thing I do, I\u0027ll know what happened to me.\"\\n\\n He helped her to the couch, assistance she didn\u0027t need but didn\u0027t resist. Unlike Jazz, she knew when to control her independent impulses. Instead, she reached up and covered his hand with her own - not to remove it, more a confirmation that she was really touching him. The heat of his skin against her palm, the caress of his fingers...the longing in his eyes.\\n\\n The care with which he touched her made her shiver. \"Jazz said wherever you were, you had medical care. The...\"\\n\\n \"Anthrax,\" she supplied, with a flash of a smile. \"You can say it. And it\u0027s gone. I don\u0027t think Dr. Kirkland would have allowed me out of bed if I hadn\u0027t been healthy.\"\\n\\n Ben slid his hand from her arm, to fold her fingers in his. \"Anything else?\"\\n\\n \"What?\"\\n\\n \"Did they find anything else?\"\\n\\n She frowned. Violations. \"No. No, nothing.\"\\n\\n He let out a slow breath. \"Good.\" He smiled, heavy on the irony. \"Good as it is to see you, I hope you didn\u0027t risk your life to come out here to visit me.\"\\n\\n She had, mostly. But it wouldn\u0027t sound precisely smart to admit it. \"I need to talk to Susannah,\" she said.\\n\\n He nodded and, without a word, turned around and walked into the bedroom.\\n\\n Lucia got up from the couch and moved to sit on a battered wooden chair. It looked less likely to harbor fleas than the grimy plaid cushions. It took a few minutes, but McCarthy reappeared, bringing with him a sleep-creased woman whom Lucia barely recognized as Susannah Davis. She looked considerably better. The swelling in her face had gone down, and the bruises were fading to blotches. She\u0027d be pretty when she recovered, if not beautiful.\\n\\n The scared expression in her eyes had faded, too. She looked different now. Desperation had made her seem honest, but the truth was emerging, and it wasn\u0027t entirely reassuring.\\n\\n \"Susannah,\" Lucia said. \"How have you been?\"\\n\\n \"All right,\" she answered, and slid into the chair opposite, across the battered kitchen table. She yawned and pushed her sleep-disordered hair back from her face. \"I heard you were missing or something.\"\\n\\n \"Or something.\" Lucia let that sit for a few seconds to close the topic. \"Someone tried to kill you, I hear.\"\\n\\n Susannah looked down at her hands. She was picking at her cuticles. \"Well, it damn sure wasn\u0027t Leonard.\" Cold, Lucia thought. Very cold.\\n\\n \"Maybe Leonard\u0027s business associates,\" Lucia said. \"Right? You told us in the beginning that you knew things about his business dealings. Maybe they don\u0027t want you telling anyone what you know?\"\\n\\n She didn\u0027t reply. Her nervous picking continued. She\u0027d had a good manicure once, but it had grown out, and the polish was halfway up her nails. Seashell-pink. When she\u0027d had that manicure done - three weeks ago, at a guess - she\u0027d also had a haircut. The shape was still there, even if she\u0027d done nothing to style it. The clothes Susannah had on weren\u0027t her own, but the shoes were, and they were good ones. Not a woman who did her shopping at discount stores, but one who\u0027d taken pride in herself, up until recently.\\n\\n \"Susannah,\" Lucia said, and drew her eyes in a direct gaze. \"You know something. You knew Leonard would come after you, and you were afraid he\u0027d kill you. He or his associates.\"\\n\\n Susannah nodded and looked down again, picking furiously at the offending cuticle. She tore off a strip of skin. A bright bead of red appeared in the corner, next to the nail bed.\\n\\n \"You need to tell someone,\" Lucia repeated softly. \"Why not McCarthy?\"\\n\\n The woman gave a mute shake of her head. Lucia made an intuitive leap, and didn\u0027t like where it took her. McCarthy was in the other room, but she couldn\u0027t tell if he could hear. She had to assume he could. \"Maybe you just don\u0027t like him,\" she said. \"You wouldn\u0027t be the first.\"\\n\\n Susannah\u0027s head shake this time was almost a shiver. She knew something about McCarthy. Nothing that would require her to scream bloody murder over being left alone with him, but something. Maybe she\u0027d picked it up at KCPD; plenty of cops might have said things there. A detective willing to take bribes might be the last person she could trust.\\n\\n \"Will you tell me?\"\\n\\n Susannah\u0027s fingers stopped moving. Lucia didn\u0027t speak; she knew Susannah was arguing with herself, and adding her voice would only hurt.\\n\\n \"He - \" Susannah\u0027s voice failed, briefly, then came back stronger. \"Leonard was working for these people. They had some kind of plan or something - I don\u0027t know what it was all about. But he would get these messages, and he would do things for them. The last one...he bought a lot of chemicals. A lot. He rented a building somewhere. He said he was starting up a lab.\"\\n\\n Ah. \"A meth lab,\" Lucia said.\\n\\n Susannah gave her an irritated look. \"No, it wasn\u0027t a meth lab. I know the chemicals for a meth lab, and this wasn\u0027t - look, it was different. There were two things they were delivering there. Sodium cyanide and hydrochloric acid.\"\\n\\n The skin tightened on the back of Lucia\u0027s neck. \"Were they opening an electroplating lab? Those are chemicals used - \"\\n\\n \"Electroplating? You\u0027ve got to be kidding! When I say I know what chemicals you use for a meth lab, how do you think I know that? I\u0027m not a damn saint, and he wasn\u0027t opening any damn legitimate business. This was something else. Maybe the paperwork says electroplating, I don\u0027t know, but it\u0027s a lie. Can\u0027t you use that crap for something else, too?\"\\n\\n \"Possibly.\" Noncommittal was the best strategy. If Susannah got frightened - more frightened - there was no telling what she might do. \"I can check it out if you want. Where\u0027s the lab?\"\\n\\n \"In SubTropolis,\" Susannah said.\\n\\n Lucia frowned. \"I don\u0027t - \"\\n\\n McCarthy, sure enough, was within earshot. He walked to the bedroom doorway, leaned against the frame and said, \"Underground business complex. It\u0027s huge. You\u0027re going to need more than that. A business name, a unit number...\"\\n\\n \"I don\u0027t know, okay? He didn\u0027t tell me anything. When I asked, he got mad.\" Susannah pointed at her face. \"I didn\u0027t ask any more questions.\"\\n\\n Lucia looked from her to Ben. \"We could track suppliers. That could give us the unit number.\"\\n\\n \"Or we could just give the FBI the information.\" He nodded at Susannah. \"And her.\"\\n\\n \"I can make the phone call, but without some proof, I don\u0027t think Agent Rawlins is going to be giving it much priority. He\u0027s overworked. He barely responded when we had anthrax in an envelope.\" She paused, thinking about it. \"I know somebody to talk to, but he\u0027s undercover. I\u0027ll have to arrange a drive-by meeting. Shouldn\u0027t take long.\"\\n\\n McCarthy didn\u0027t look happy about it.\\n\\n \"How are you going to get there?\" he asked. \"To your meeting? I cant leave her alone here.\"\\n\\n \"That\u0027s the wonderful thing,\" Lucia said, and pulled the cell phone from her purse. \"If you have a phone and a credit card, you can get just about anything delivered.\"\\n\\n \"Get pizza while you\u0027re at it.\"\\n\\n She called FBI Special Agent Roger Cole ten minutes later. Cell phone, not office phone. Two minutes of idle chatting, a simple thirty-second request, and silence from him on the other end.\\n\\n \"Is this going to bite me in the ass?\" he asked her. He was in his car. The road noise nearly overwhelmed his voice. \"Because I\u0027d like to know how, so I can get my will ready.\"\\n\\n \"It might make your day, Roger. If I\u0027m right.\"\\n\\n \"Then you should give me everything you have so I can get to work on it. Or better yet, somebody else can. I\u0027m a little busy. Maybe you\u0027ve heard, somebody\u0027s been playing with funny little white powder in envelopes.\"\\n\\n \"I\u0027ve heard,\" she said blandly; he knew perfectly well who\u0027d gotten the envelope. \"This could be connected.\" A lie, but a nebulous one.\\n\\n \"Yeah?\" The road noise lessened; he was pulling over.\\n\\n \"Okay, give. What do you have, and why aren\u0027t you talking to your red-haired boy?\"\\n\\n \"My red-haired boy isn\u0027t exactly jumping through hoops for me at the moment.\"\\n\\n \"Don\u0027t be that way. He had four guys on the street looking for you, you know. He was distressed.\"\\n\\n \"So distressed he hasn\u0027t bothered to make a phone call to say hello and interrogate me about what I know? He\u0027s got bigger and juicier fish to catch just now. Look, all you have to do is track the shipments of chemicals to a specific address in SubTropolis, and I\u0027ll do the rest. If it checks out, it\u0027s yours. You get to be the hero.\" She read out the names of the specific chemicals as Susannah had given them. \"Sound like anything to you?\"\\n\\n \"Electroplating,\" he said. \"And gas chambers. Fuck. You\u0027ve done it again, haven\u0027t you?\"\\n\\n \"Are you going to get me the information?\" His sigh rattled in the speaker. \"No. I\u0027ll get the info, but I go with you.\"\\n\\n \"I don\u0027t want a full team for reconnaissance.\"\\n\\n \"Relax. I\u0027ll make some calls, pick you up in...\" he paused to check the time \"...about an hour, okay?\"\\n\\n \"Thank you.\"\\n\\n The pizza arrived in forty-five minutes, and the driver looked nervous when Lucia met him at the door to hand him cash. She didn\u0027t doubt the apartment complex had a bad rep among deliverymen. She added on a considerable tip for his trouble, and hoped he wasn\u0027t mugged on his way back to his car.\\n\\n Two slices later, her cell phone rang. Cole had a unit number in SubTropolis, including an entrance address. He\u0027d even secured a Bureau van labeled as an electrical contractor; it would draw less attention in the SubTropolis tunnels than a private vehicle, especially since so much of the place was fitted out for industrial use.\\n\\n \"Where should I meet you?\"\\n\\n \"You shouldn\u0027t,\" he said, amused. \"I\u0027ll pick you up. Curb service and all that crap. Address?\" She gave it. \"Right, I\u0027m close. Five minutes. I\u0027ll honk twice.\"\\n\\n As she hung up, she realized that both McCarthy and Susannah were staring at her. \"He\u0027s a decorated FBI special agent,\" she said. \"I can vouch for him. He\u0027s the last person you need to worry about.\"\\n\\n \"Lucia, I don\u0027t like this, McCarthy said. He leaned back in his chair, frowning. \"You just got out of the hospital, for Christ\u0027s sake. Let Jazz check it out.\"\\n\\n \"Jazz is looking into where I was taken while I was unconscious. That\u0027s not something I can put on the back burner. I need to know.\"\\n\\n \"Jazz hasn\u0027t slept in a week,\" he said softly. \"You know that, right? She\u0027s catnapped a couple of times, when she fell down from exhaustion, but she\u0027s been living on coffee and Vivarin. Give her a break. Hell, give both of you a break.\"\\n\\n \"Hydrochloric acid and sodium cyanide?\" Lucia asked, and raised her eyebrows. \"What if they release it on a bus, Ben? In a shopping mall? You remember the Tokyo subway attack, right?\\n\\n He said nothing, just shook his head.\\n\\n \"I\u0027m going,\" she stated. \"We\u0027re just going to check it out. If it\u0027s a legitimate operation, then no harm done. If not, the FBI will have a leg up. It\u0027s the best way to handle it. If it does turn out to be hinky, Susannah, you\u0027ll be in witness protection so fast the carpet will smoke on your way out the door.\"\\n\\n She didn\u0027t look happy. \"I don\u0027t like it here. Wouldn\u0027t it be better if I was someplace safer now? Someplace more - I don\u0027t know - fortified?\"\\n\\n \"You\u0027ve been fine here for days. You\u0027ll be fine another few hours.\"\\n\\n Lucia got up and washed her hands in the kitchen sink, wincing at the state of the hygiene. McCarthy was going for drug-dealer authenticity. She hoped he\u0027d changed the sheets, at least.\\n\\n \"Hey.\" He was behind her, close and warm, his voice low in her ear. She turned to face him. Behind him, the TV flipped on. Susannah was surfing listlessly through the channels, her face lit by the flickering glow.\\n\\n \"I know I don\u0027t have to say it, but for God\u0027s sake, would you be careful?\" he asked. \"You and Jazz, you\u0027re killing me. I was better off in prison. At least I didn\u0027t have friends to worry about.\"\\n\\n She met his eyes. \"Friends,\" she repeated softly. The sound from the TV was covering their conversation. \"Is that what you want?\"\\n\\n \"Of course not. Fresh out of prison, remember? But wanting more isn\u0027t all that smart between us right now. You\u0027re not - \" He sucked in a breath and inclined his head, hiding his expression. His voice went very low in his throat. \"You\u0027re not some cheap lay, okay? And I\u0027m not going to use you that way. Or let you use me.\"\\n\\n Oh, God. That was - powerful. She pressed back against the counter to keep from wrapping herself around him.\\n\\n He raised his head and met her eyes.\\n\\n \"Do we understand each other?\" he asked. \"No matter what, I\u0027m not going to use you.\"\\n\\n She nodded. She wasn\u0027t sure she could actually speak at the moment.\\n\\n \"Okay. Then don\u0027t get yourself killed, or I\u0027ll be very disappointed,\" he said, and moved out of the way. She didn\u0027t go. She reached out, took hold of the scooped neck of his wifebeater, and pulled him toward her.\\n\\n It was a long, slow kiss this time. He moaned, low in his throat, and put his hands on her, sliding them warmly up her shoulders, her neck, burying his fingers in her hair. She was glad she\u0027d let it out of the ponytail.\\n\\n Two honks sounded in the parking lot. His lips looked damp and hungry, and she brushed hers against them one more time. \"I have to go,\" she whispered. He nodded. \"I\u0027ll be back soon.\"\\n\\n He stepped away and let her leave the kitchen, then stopped her with an outstretched hand at the apartment door and checked through the peephole before flipping the locks and swinging it open. When she looked back, the door was closed and locked, the peephole dark.\\n\\n He was watching her go.\\n\\n She followed Jazz\u0027s excellent example, taking the steps fast, and saw the electrician\u0027s van idling in the parking lot twenty feet from the sidewalk. She crossed to it without incident, she checked for Cole\u0027s familiar face before opening the passenger door.\\n\\n Cole was a medium guy - medium height, medium weight, medium complexion. He\u0027d disappear into a crowd of two. He\u0027d chosen the vehicle well; the paint on the exterior was sun-faded and the contractor\u0027s logo and information were chipped. Cole himself was wearing a denim shirt, blue jeans and a tool belt that had just the right wear on the leather.\\n\\n She wouldn\u0027t have given him a second glance, and Lucia knew herself to be more paranoid than most.\\n\\n He put the van in gear without any words being spoken, and pulled out of the parking lot and onto the road.\\n\\n \"Sorry,\" she said, and indicated what she was wearing, which wasn\u0027t exactly appropriate to the occasion. \"I haven\u0027t been home.\"\\n\\n \"Yeah, I heard you were in the hospital.\" He gave her a long look. \"How are you?\"\\n\\n \"I\u0027m fine. Any word on the origin of the anthrax strain?\"\\n\\n \"Came out of a lab in California, and believe me, somebody\u0027s ass is cooking on a grill right now. Rawlins is pissed. He really doesn\u0027t like terrorists.\"\\n\\n She grinned. \"And you do?\"\\n\\n \"I spend a lot more time rubbing shoulders with them. Hard to get a real hate going when you\u0027ve met their wives and kids. You know you have to do it, but sometimes it gets hard.\"\\n\\n \"Probably the same for them.\"\\n\\n \"Yeah. It is.\" He glanced out the back windows of the van. \"You armed?\"\\n\\n \"Always.\"\\n\\n \"Good. Not that I figure we\u0027ll need it, but I don\u0027t want to get caught with my tool belt down, if you know what I mean. Your source was right, by the way. These guys are ordering in big amounts of sodium cyanide, and their next-door neighbors are shipping in hydrochloric acid. I can see why you\u0027re not fond of the combination. It\u0027d make a hell of a nice hydrogen cyanide cloud. In an enclosed space, it could kill hundreds, maybe thousands. Arrowhead Stadium\u0027s right down the street. The volume of gas we\u0027re talking about, you set it off in a place like that, you could count on major results.\"\\n\\n \"God,\" she whispered reverently. \"How easy would it be - ?\"\\n\\n \"The stadium? Not very. I mean, we\u0027re talking about a lot of chemicals here, very high profile, and chemicals are bulky to move around. But you look at some of the high-rise buildings in the city? Pump some of this into the air handlers, and you\u0027re talking big numbers of bodies.\" Cole considered it, his light brown eyes distant as he rubbed his chin. \"Unless they\u0027re making a hell of a lot of gold chains and pimping up the hubcaps of half of the country, I can\u0027t see how they could be using everything they\u0027ve ordered.\"\\n\\n \"So we take a look.\"\\n\\n \"Wrong,\" he said. \"I take a look. You watch my ride. Looking like you do, I don\u0027t think anybody\u0027s going to believe you\u0027re apprenticing as a cable puller, so you\u0027d better keep out of sight.\"\\n\\n He wasn\u0027t being judgmental, just practical. She nodded and settled herself in the grimy seat. It occurred to her that she should call Jazz, but truthfully, she didn\u0027t want to. She knew she was pushing her luck. Fresh from the hospital and already taking risks? Jazz wouldn\u0027t approve. Loudly. At length.\\n\\n As if she\u0027d conjured up a connection telepathically, her cell phone rang. She exchanged a quick glance with Cole as he turned the van down Eldon Road, heading toward the railroad tracks. The entrance to SubTropolis was just ahead. Lucia pulled her phone out and flipped it open, and winced as static blasted her eardrum.\\n\\n Wind noise.\\n\\n No, jet noise. Someone was calling her from a plane. \"Hello?\" She couldn\u0027t hear a damn thing. The connection was terrible, and the van she was in was rattling as well. She blocked her other ear and concentrated. \"Hello? Anyone there?\"\\n\\n The answer, if there was one, was lost in the dull thump of the van\u0027s tires going over railroad tracks. There was a line of vehicles passing through the SubTropolis gates, most of them 18-wheelers. Cole slowed the van to a crawl.\\n\\n She listened for another few seconds, but the connection cut out.\\n\\n \"Anything important?\" he asked.\\n\\n \"Couldn\u0027t tell,\" she said. She checked the caller ID, but as she\u0027d expected, it was an air phone. \"I hope not.\"\\n\\n They edged forward slowly. When they got to the guard station, Cole presented ID that Lucia didn\u0027t doubt was absolutely authentic. The guard waved him on, and they passed into a tunnel.\\n\\n She\u0027d expected it to be dark, but SubTropolis was surprisingly bright. The tunnel was huge and well-lit, the limestone it was carved from reflecting the brilliance.\\n\\n \"These guys have got some balls, setting up something down here. This place has everything. Post offices, restaurants, hell, they keep film reels somewhere. A few billion in inventory stored down here, at least. Not exactly low-profile.\"\\n\\n \"Maybe that\u0027s the point,\" she said. \"Hiding in plain sight.\" She leaned over to look past the front seat at the empty, seemingly endless stretch of tunnel. \"How far do we have to go?\" It was too late to realize that she didn\u0027t like this kind of place, with the weight of so much rock over her head as they descended. Her palms were getting damp. The ceiling, high as it was, seemed oppressively heavy.\\n\\n \"Long ways,\" Cole said, which was not reassuring. \"We make a right up ahead at Huspuckney Road, then a left on 8800.\"\\n\\n She was starting to seriously regret suggesting this, not so much for the potential danger ahead but for the uncomfortable feeling of claustrophobia that she was battling. Stupid. She was in a van, which should have been much more claustrophobic than the spacious tunnel they were traversing. But she could get out of the van. There were only two ways out of the tunnel: forward and back.\\n\\n \"You okay?\" Cole was watching her. She nodded and forced a smile. \"You\u0027ll let me know if you plan to freak out, okay?\"\\n\\n \"Remember who you\u0027re talking to,\" she said. \"I don\u0027t have a reputation for freaking out.\"\\n\\n \"Yeah. Those are the ones you have to worry about.\" Mercifully, he left her alone. She found that closing her eyes didn\u0027t help, so she finally resorted to clinging tight-lipped to the seat, fingernails digging in to the bending point. They slowed. \"All right. It\u0027s up ahead. Here\u0027s the drill. I\u0027m going to get out and scout around, you stay in the van and monitor. I\u0027ll keep my walkie channel open. I get into trouble, you wait until I give the code phrase, which is \u0027electrical short. Okay?\"\\n\\n \"Yes,\" she muttered. \"Fine. Absolutely.\" He gave her one last assessing look as he pulled into a parking spot off the road, next to a rough-textured limestone pillar, and jammed the van into Park. \"We good?\"\\n\\n \"Fine,\" she repeated. \"I\u0027ll be okay. You go.\" He shook his head, clearly not believing her - smart man - and climbed out of the passenger seat and into the murky dimness of the windowless back, where even someone staring in the window would have trouble spotting her. He nodded, locked up and sauntered toward a big industrial building that looked oddly lost in the cavernous open spaces. This was just so weird. She caught herself breathing too fast, and deliberately slowed down. Biofeedback. She\u0027d survived traumas and tortures; she could survive a short visit underground.\\n\\n Cole even walked like a working man - as if tired, in no particular hurry. He picked something overhead and traced it with a stare as he walked, clearly intent on his own business. She could hear the crunch of his work boots on rock as he walked to the back dock of the warehouse. It was labeled J\u0026J Electroplating - Warehouse and Distribution Center. No trucks were lined up just now. Cole climbed the steps and opened an unmarked door. It closed behind him.\\n\\n \"Hey!\" Not Cole\u0027s voice, someone else\u0027s. It came from the walkie-talkie she was holding. He\u0027d already been challenged. \"What are you doing in here?\"\\n\\n \"You guys having trouble with the plugs?\" Cole asked. \"We have a fault report.\"\\n\\n \"No, we don\u0027t have trouble. Try someplace else.\"\\n\\n \"You sure you don\u0027t want me to check it out? You got a faulty plug, you could get a fire.\" Cole knew just how to work it, she thought; he sounded conscientious but not concerned. The subtext was his body language - he\u0027d be ready to move to the door, convincing the subject that he wasn\u0027t at all eager to be on their property. \"Hey, your call. I can write up the report, but buddy, your insurance company could nail your ass to the wall, you don\u0027t check out a fault report.\"\\n\\n \"Where you gotta go?\"\\n\\n \"In there.\" Cole might be choosing at random, or he might have seen something. \"Line goes right in, see? Up there?\" He\u0027d be pointing at something nobody could possibly see or understand. She suppressed a grin. Beautiful. \"Wait here.\"\\n\\n Footsteps faded away. Cole didn\u0027t say anything, but she heard him moving around. It seemed like a long time, but as she watched the sweep of the second hand on her watch, she realized that he\u0027d been inside only two minutes, going on three. Probably not enough time to - \"Hey, I told you to wait!\" The voice was startlingly loud.\\n\\n \"I\u0027ve got to get through twelve buildings. You know how big this place is.\"\\n\\n \"We checked it out. Everything\u0027s fine.\"\\n\\n \"Okay then. I\u0027ll write it up. Anything goes wrong, though, you - \"\\n\\n \"Yeah, insurance, whatever. We\u0027re closing up.\"\\n\\n \"Have a good one.\"\\n\\n Cole was on the move, heading for the door.\\n\\n \"Hang on a second,\" said the other voice. \"What\u0027s your name?\"\\n\\n Lucia slid her gun from its holster and put her hand on the door handle.\\n\\n \"Frank. Frank Scarabelli. Here - here\u0027s my ID, okay? I don\u0027t want no trouble or nothing. I\u0027m just - \"\\n\\n \"Doing your job, yeah, we heard. Listen, hang out a second, okay? I\u0027m gonna make a phone call.\"\\n\\n \"Okay,\" Cole said. He sounded thoroughly disgusted. \"You guys get an electrical short, it\u0027s no skin off my - \"\\n\\n She was out of the van, gun at her side, before he finished the sentence. Her knees felt weak, her whole body not quite in tune, but it served to get her across the exposed parking lot and behind one of the massive white limestone pillars. She sucked in two deep breaths, then finished the run to the warehouse dock. Up the six concrete steps to the flat staging area. The walk-in door was closed again. All but one of the garage doors were down. The one on the end was clanking shut.\\n\\n I won\u0027t make it, some part of her thought, but she didn\u0027t allow that to stop her. It wasn\u0027t a matter for thinking. She kicked off her shoes and crossed the distance in long runner\u0027s strides, moving as silently as she could.\\n\\n The door was clattering down. There were two feet of clearance left.\\n\\n Lucia hit the concrete and rolled, tucking elbows and knees, and she felt hard steel and rubber grab her for a heart-stopping second. But then momentum won and she was inside. The door rattled irritably shut with a boom just an inch behind her.\\n\\n She was panting and shaking, but there was no time for fear now. She was exposed. There were three men at the end of the hall, one smaller, two larger. Cole was the smaller. This end of the dock was in relative shadow, which was in her favor.\\n\\n Should have called for backup, she thought, but she doubted that wireless signals would make it through the solid limestone roof. She\u0027d need a land line, and by that time... by that time, she\u0027d have gotten another friend killed.\\n\\n She rolled up to her knee, gun trained steadily on the group at the far end of the hall, and then to her bare feet. The concrete felt ice-cold. She gained the concealment of a big industrial trash bin and risked another look to assess the situation. She was close enough to see faces now, and catch fragments of words.\\n\\n Cole still looked bland and harassed. \"Guys, this is stupid. Look, let me get the hell out, you call whoever you want to fix the damn electrical - \"\\n\\n The biggest one hit him. One quick pop, not telegraphed, and it took Cole full in the face. Blood spattered. He went down, and the man was already moving his right foot in a bone-breaking kick.\\n\\n She couldn\u0027t afford caution. Caution would get Cole disabled or dead, and she couldn\u0027t take these men playing by FBI rules. This would have to be done Jazz-style.\\n\\n Lucia stood, braced her shoulder against the wall and kicked the big rubber trash can at its wheeled base. It screeched indignantly and rolled at an angle across the exposed space to slam into one of the metal doors, then tipped and crashed onto its side.\\n\\n Both of the suspects spun to look. Both drew guns.\\n\\n Lucia braced her right hand with her left and sighted.\\n\\n \"Freeze!\" she yelled. They moved fast, too fast, and a bullet exploded part of the concrete next to her arm.\\n\\n She pulled the trigger twice without flinching, and the first shooter sank down on his knees, swaying. The gun slipped from his hand and spun across the concrete. Cole, his face a mask of blood, scrambled after it and kicked the man\u0027s side to dump him on his face. The other man dropped his gun and voluntarily went down, hands on the back of his head.\\n\\n \"Dammit!\" Cole screamed. \"Are you hurt? Lucia?\"\\n\\n \"No,\" she said calmly, and walked forward. \"If you call an ambulance, you can probably save this one. I think I missed his heart.\"\\n\\n Cole - normally so cool and insouciant - looked shocked. She raised her eyes to his, and saw him flinch a little. Seasoned FBI, and he flinched. But then, he didn\u0027t know her, did he?\\n\\n Nobody did.\\n\\n \"Better call it in,\" she said. \"I\u0027ll check the rest of the building. These can\u0027t be the only bad guys in the place.\"\\n\\n \"I\u0027m going to hell for this.\"\\n\\n \"Yeah,\" she said grimly. \"I\u0027ll save you a seat.\" \\n\\n","sourceLink":"https://allnovel.net/devil-s-due-red-letter-days-2/page-13.html","bookId":2311,"book":{"id":2311,"title":"Devil\u0027s Due (Red Letter Days #2)","description":"Storyline: Devil\u0027s Due (Red Letter Days #2) \\n The money Lucia and her new partner received to open their detective agency had come with strings: any assignment delivered via red envelope had to be top priority. No sweat. No one could make Lucia do something she didn\u0027t believe in -- right? \\n Wrong. Lucia soon learned that every choice she made meant life or death for innocent people. No one could be trusted, not even the ex-cop she\u0027d hired -- and fallen for. In fact, Ben might be her fatal weakness, if the powers warring to control the future used him to control Lucia....\\n","cover":"https://allnovel.net/images/devil-s-due-red-letter-days-2.jpg","author":"Rachel Caine","type":"Mystery","source":"allnovel","link":"https://allnovel.net/devil-s-due-red-letter-days-2.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:16:05 PM"}}
