{"id":59559,"no":1003,"title":"Chapter 1003","content":"Advancement\n “Surrender. You will lose in a mere contest between domains.” Akaban’s voice echoed throughout the battlefield. He was circling Leylin leisurely, aside from the two demigods in combat.\n He had the valiant spirit of an emperor, and before becoming a demigod he had clearly been a tactician. His words were designed to affect Leylin’s mind. Sadly, Leylin’s own hardships had given him a will that was harder than diamond. Such challenges were pointless, only revealing Akaban’s lack of confidence to him.\n ‘Are you worried about any trump cards that I have? Or is it my background on the mainland?’ The gears in Leylin’s mind whirred, and he soon understood what the other party was thinking. Akaban seemed to know a little about the gods on the mainland, which was why he was guessing at Leylin’s identity.\n Unfortunately, Leylin was now completely alone. Even if he were to be killed here, nobody would cause trouble for Akaban… Besides his main Warlock body, that is.\n ‘I can wipe out all four of them easily if I use the floating city, but then it won’t be a secret anymore…’ Leylin looked deep in thought. He had amassed a tremendous number of cards up his sleeves, and the jaws of the other gods would probably drop if they found out about it.\n The floating city had shifted to the area outside Debanks Island, awaiting his next commands. At its peak performance, the floating city could contest against true gods! Taking care of a few demigods was like playing around.\n Unfortunately, such power would be sensed by the other gods, making things difficult for him in the future.\n “Massacre domain!” Leylin chose to fight it out with his own strength. The dark red domain burst forth from him, allowing him to get a huge boost in strength. He was now on home ground, after all.\n The dark red domain that held the power of tyrannical bloodlust abruptly expanded, and even pushed the domains of the two demigods away. They were now on equal ground.\n ‘Such pure bloodlust, and the strength of this domain…’ Watching from the sidelines, Akaban immediately seemed to be put deep in thought, as if he’d gotten some inspiration from Leylin’s domain.\n ‘Is it the purity? I was too greedy in the past… To become a true god, I’ll need to completely grasp at least one aspect.’ This inspiration seemed to change Akaban’s body, making his divine form more solid. This was the most terrifying part about him, he could learn and improve even in battle!\n If Akaban could walk out of this battle, then he would be able to get rid of the heterogenous elements in his domain and obtain a divine domain. That would make him a true god!\n ‘Unfortunately… you won’t get that chance!’ Leylin laughed wildly, the legendary spell in his hands seemingly cast instantaneously.\n Meteor Explosion! Crushing Palm!\n A dazzling explosion and a large palm drowned out the two demigods fighting him. Enraged howls sounded out amongst the bright spell lights as Leylin used Dimensional Leap to arrive in front of Akaban. A golden staff appeared in his hands.\n *Chiu! Chiu!* Lights flickered, and a flaming golden bird came into existence. Its gigantic wings flapped out flames like they were petals as its large beak began to peck at Akaban.\n “A divine being’s soul? Is that what you’re counting on? How naive!” Facing such an attack, Akaban merely frowned slightly. The horse in front of the chariot abruptly snorted, absorbing all the scattered flames.\n “Seeing that you gave me pointers on my path, let me send your truesoul to the astral plane!” The golden lance in Akaban’s hand pierced forward, striking the beak of the large flaming bird.\n A crisp shattering sound rang out, and the flaming bird’s beak began to fragment like glass, revealing the goldens staff underneath. The beak of the bird had actually been the staff’s tip.\n “Be it the strength of your domain or your accumulation of divine force, you cannot match up to me…” Akaban seemed to sigh, his golden lance mercilessly striking the crystal at the top of the staff.\n *Chiu! Chiu!* The large flaming bird soul in the crystal emitted a miserable cry, and the core that held a slight hint of gold shattered. However, Akaban felt that something was off.\n “Haha… Thank you very much, you helped me take care of the last bit of resistance. I would have found it rather difficult to tame it!” Light flickered, and Leylin’s figure quickly left. The flaming bird at the tip of the staff exploded, and reformed.\n However, unlike before it seemed to lack intelligence, looking rather stiff. Bundles of flames enveloped the staff, and energy undulations with more than legendary might rippled out.\n All this happened in what seemed to be the blink of an eye. Leylin had made use of Akaban’s strength and completely subdued the flaming bird, even refining the Red Dragon Staff once more.\n “The name Red Dragon Staff now no longer suits you. Let’s call you the Blazing Sceptre!” Leylin sized up his work in satisfaction. As he had used the soul of a divine being and had help from a demigod, even if it wasn’t a divine weapon yet the Blazing Sceptre was much stronger than other legendary items.\n ‘A divine weapon needs the flesh and divine force of a god to be completed…’ Leylin sighed in thought.\n Meanwhile, Akaban was thoroughly enraged in front of him. “Wretched sinner! How dare you make a fool of me!”\n His fury was like that of a regent, and a large hole opened up in the night skies. Blue lightning, each bolt as thick as a human arm, fell continuously. Akaban felt the ultimate humiliation in being made use of to refine a weapon, and teased by a mere divine being.\n The wrath from such disrespect could only be eased with the fresh blood and soul of the sinner!\n “I will show you the sin you have committed!” The warhorse snarled, and the flaming chariot charged forth. Akaban’s lance danced as the lightning in the skies gathered at its tip.\n *Roar!* *Chik! Chik!* Meanwhile, the two demigods Leylin had occupied for a while pounced over as well. Although they looked a little pitiful, there weren’t any injuries. The joint attack of the four demigods pushed the air out of the region, forming a strange vacuum.\n The pressure on Leylin rose rapidly, and the force that surged towards him from all directions seemed to want to tear him apart.\n “As expected, a divine being trying to fight a demigod will lose…” Leylin could only smile wryly, and then began to look resolute.\n “Did you only just notice? It’s too late! Your body shall be placed under my golden throne to be used as an eternal decoration…” Akaban roared. Along with the other three demigods, his attacks soon drowned Leylin out.\n Lightning, flames, poison… All sorts of forces mixed in with the power of divine force. The domains formed a colourful, spotted, and chaotic region of energy. Leylin’s aura quickly weakened within, to the point that it completely disappeared.\n “Even I won’t be able to deal with the attacks from four demigods…” Akaban withdrew the golden lance in his hands, “It’s a pity that I didn’t get the method to undo the plague, but I now know that becoming a true god is possible… Hm? Wait!”\n Akaban’s expression quickly changed, as he sensed the descent of powerful World Origin Force.\n *Whoosh!* The skies quickly darkened, and the stars and silver moon quickly hid their luster. It was as if a berserk dragon was travelling through the dark clouds, and compared to it Akaban’s lightning was like that of a kid playing house.\n “The descent of World Origin Force… This is the appointment of a demigod!” Akaban had experienced this once before, and naturally would not get this wrong.\n Just as he was about to do all he could to interrupt the process, an absolute and powerful strength burst forth. Traces of the conscient of the World Will sent him and the three other demigods flying.\n The gods truly were the darlings of the world, and when they advanced they naturally caught the attention of the World Origin Force. The isolating energy that came was not something four demigods could deal with.\n The World Origin Force that had come roaring in immediately attracted the attention of a few powerful gods. While the advancement of a demigod was nothing much, there were a few existences who still noticed him.\n “This… it feels like a demigod, and the location is at the the south of the south seas, the natives’ territories. Has a totem spirit or natural spirit advanced?” To the gods, the totems of the natives were like a group of useless things. They were weak and could not leave their respective areas, which was why they were not worthy of attention. Several streaks of godly conscients gathered in the skies, and then dissipated like this had nothing to do with them.\n However, no matter how careful Leylin was, his reputation of being the youngest legendary wizard was sound, and he had caught the attention of some existences.\n Golden light flickered on Faulen Island, within Waukeen’s church. It turned into a woman dressed in luxurious golden robes.\n ‘I could never be wrong. This aura is that of the wizard! Has he become a demigod?’ Waukeen’s eyes crinkled in a smile, ‘Interesting! His name as a genius will probably resound through the continent once more…’\n At this thought, Waukeen called out sternly. “My servants!”\n “Mistress!” A few priests of wealth knelt and listened to the goddess’ commands.\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-1003","bookId":1513,"book":{"id":1513,"title":"Warlock of the Magus World","description":"What happens when a scientist from a futuristic world reincarnates in a World of Magic and Knights?\n An awesome MC — that’s what happens!\n A scientist’s goal is to explore the secrets of the universe, and this is exactly what Leylin sets out to do when he is reincarnated. Dark, cold and calculating, he makes use of all his resources as he sets off on his adventures to meet his goal.\n Face? Who needs that… Hmmm… that guy seems too powerful for me to take on now… I better keep a low profile for now.\n You want me to help you? Sure… but what benefit can I get out of it? Nothing? Bye.\n Hmmm… that guy looks like he might cause me problems in the future. Should I let him off for now and let him grow into someone that can threaten me….. Nahhh. *kill*\n","cover":"http://cunovel.com/img/WMW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
