{"id":58658,"no":102,"title":"Chapter 102","content":"Brewing an Ancient Potion\\n\\n “Ancient Medicine: Tears of Mary formula. Begin the 1,312,933rd drug simulation!”\\n\\n Leylin had received 2 sheets of medicinal formulas from Professor Kroft. One of them was about the Azure Potion, for which he had found substitute ingredients that had helped him reach his current level.\\n\\n The other one, Tears of Mary, involved the concepts from his soul research. This had left Leylin at a loss as to how he should proceed.\\n\\n Afterwards, with the observations from the bulk experiments at Extreme Night City, Leylin had gathered vast amounts of data regarding souls, and was thus pushing for the analysis of the formula of the ancient drug, Tears of Mary.\\n\\n Finally, after having obtained the Grine Water, the A.I. Chip had performed reverse engineering to find out the refining process of the Grine Water, and had eventually overcome the last obstacle in concocting the Tears of Mary.\\n\\n However, to Leylin’s dismay, he found that some of the steps in the formula for the Tears of Mary could only be completed by an official Magus!\\n\\n Moreover, many of the processes required huge reserves of spiritual force that was at least at the level of an official Magus.\\n\\n This situation proved that Leylin’s prior guess was correct — the Tears of Mary was definitely the secret formula for the ancient Magi to increase their spiritual force!\\n\\n Thus, Leylin’s eagerness to successfully configure the Tears of Mary was reinforced.\\n\\n His spiritual force had not increased over a long period of time.\\n\\n His body had developed a complete resistance to the modified Azure Potion, so even if he were to drink more of the potion, his spiritual force would not increase even a little bit.\\n\\n Also, after having increased his spiritual force using medicine, trying to increase it using his regular meditation technique was something he couldn\u0027t endure because the rate of increase was similar to a tortoise’s pace.\\n\\n His current spiritual force was just not quite enough to be able to break through the boundary to become an official Magus.\\n\\n According to the A.I. Chip’s calculations and his own estimation, with his regular meditation, it would take him several years to become an official Magus!\\n\\n Leylin could not wait that long, hence he brewed a new type of potion. Apart from that, he had been collecting other formulas all the while.\\n\\n Other ancient potion formulas were mostly controlled by the official Magi. Leylin did not have many treasured ingredients with him that he could exchange for, and did not wish to draw too much attention to himself..\\n\\n Moreover, compared to simulating and brewing an entire new formula, more than half of the formula for the Tears of Mary was solved so it was the better choice.\\n\\n Leylin boldly replaced a few brewing processes that could only be executed by an official Magus into one that was suited for a level 3 acolyte to brew with.\\n\\n After tens of thousands of modifications, together with the A.I. Chip’s millions of simulations, Leylin’s experiment now was very close to succeeding.\\n\\n “First of all, I need the basic material for the formula, a female vengeful spirit!.”\\n\\n From the corner of his experiment desk, Leylin picked up a brand new Confining Spirit Sphere. Within it was a woman wearing a red gown, and looking at Leylin with an expression of fright.\\n\\n The energy waves emitted from this female vengeful spirit which was not even close to those of Roman, who was only a level 1 acolyte.\\n\\n After most of the acolytes in the academy had perished, it was the golden age of self-development for the surviving acolytes.\\n\\n Originally, the resources for the acolytes in the academy had been for a thousand acolytes, but now, they had all been released for these 50 remaining acolytes.\\n\\n Furthermore, the prices of all ingredients and spell models had been marked down drastically compared to the time before the bloodbath.\\n\\n For example, a vengeful spirit was originally a rare commodity in the market. Once they had been seen on the market, they would have been bought immediately by acolytes, and the prices could have been up to 500 magic crystals.\\n\\n As for now, Leylin went to the counter to look at the price, and bought it immediately. His expenditure did not even amount to 100 magic crystals!\\n\\n Of course, this was a disguised reward from the academy to the survivors!\\n\\n This situation continued all the way until the next batch of recruits.\\n\\n However, in this discounted sale, Leylin quickly threw away the notion of reselling at a high price outside. The academy had long since forbidden this. If they were caught, the circumstances would be severe.\\n\\n Leylin made use of this opportunity, and spent half of his magic crystals savings, buying a large amount of resources and strange spell models.\\n\\n The female vengeful spirit in the Confining Spirit Sphere had long, silver hair; dark blue eyes; and soft, moistened lips. She also had a slender waist and long legs. When she was alive, she would have definitely been an outstanding woman who drove men crazy!\\n\\n “What a pity!”\\n\\n Leylin sighed, yet his hand continued to move and dropped a silver liquid onto the Confining Spirit Sphere.\\n\\n This was the “Dissolving Spirit Potion”. Back when Leylin had specially prepared it for Roman, with only a few drops, Roman would have definitely been shrieking for half a day, and even sustain a severe injury.\\n\\n As of now, the remainder was used by Leylin here.\\n\\n “Ah… It hurts! Please… I beg you! No…!”\\n\\n The vengeful spirit continued to wail from within the crystal ball. Towards such an extraordinary woman, any man would have at least hesitated deep down within their heart.\\n\\n However, Leylin’s brows had not furrowed the slightest as he continued the movement with his hands.\\n\\n As more of the Dissolving Spirit Potion was used, the pleading of the female vengeful spirit was becoming more and more muffled. Even her red robes were slowly dissolving, revealing an illusory, and yet alluring glowing skin.\\n\\n “You want to entice me?” Looking at this scene, Leylin’s lips curled up in ridicule.\\n\\n “Vengeful spirit! Reveal your original ugly form!” Leylin raised a finger with a large, black needle protruding from the nail.\\n\\n * Sssii! *\\n\\n The black long needle pierced through the crystal ball, and directly into the chest of the female vengeful spirit.\\n\\n “Argh!” The female vengeful spirit let off a hair-raising scream, and her body became blurry. Once she could be seen again, the vengeful spirit that was in front of Leylin’s eyes had taken on a completely different form.\\n\\n The face was filled with scales and wrinkles, and the orifices seemed to be misaligned, as though someone had casually attached them to her face. There were a few strands of green hair on the sides of her bald head.\\n\\n The mouth opened and closed, and razor sharp teeth could be seen. From time to time, a disgusting, viscous liquid could be seen dripping from her scarlet tongue.\\n\\n “Ao!”\\n\\n The female vengeful spirit’s eyes contained a greed that could rip people apart. She stared intently at Leylin as if wanting to gobble him down immediately.\\n\\n “Your outer appearance and inner self are ugly throughout!”\\n\\n ……\\n\\n Leylin mocked her and laughed, before drawing another mysterious magic rune...\\n\\n The experiment lasted for over a dozen hours and continued the way until the second day before the end was near.\\n\\n Inside the experiment lab.\\n\\n Inside a scarlet pentagonal formation, a naked body with bumps through could be seen. The beautiful face of the female vengeful spirit had been tied down by a metal chain, trapped within the spell formation.\\n\\n At this moment, although the female vengeful spirit looked to be phantom, as if disappearing in the next moment, her face no longer had the craze and hate from before. Instead, there was a shy expression on it.\\n\\n Combining with the binding of the metal chains, it even creates a sadomasochistic desire!\\n\\n Leylin looked at the naked woman in front of him, his face revealing a satisfied expression. “After a long day, I have finally removed all of the grievances from it!”\\n\\n “Thank you! Young man! However, could you release me and give me some clothes to wear?”\\n\\n The woman spoke within the formation, her voice as delightful as a black-naped oriole bird.\\n\\n “Are you joking? I spent so much effort to release you from your grievance, not for some gratification!”\\n\\n After hearing Leylin’s words, the female vengeful spirit suddenly felt that a calamity was looming over her.\\n\\n Disturbed, crazed and pondering expressions flashed through Leylin’s face. Finally, they all uniformed into only one expression—Apathy! Indifference towards everything!\\n\\n ……\\n\\n A few hours passed.\\n\\n At this moment, there was a chill permeating the experiment lab.\\n\\n One could almost hear the wails of vengeful spirits within these four walls.\\n\\n As for the female vengeful spirit in front of Leylin, it had almost lost its human appearance.\\n\\n “The last step!” Leylin picked up a silver fork and pierced the female vengeful spirit’s head through the eyes.\\n\\n “Pu!”\\n\\n As if made from some special materials, the silver fork directly pierced through the female vengeful spirit’s eyeball.\\n\\n “Hehe!” The female vengeful spirit squirmed and screamed like a wild beast, as if without a tongue.\\n\\n After the fork had pierced the eyeball, the face of the female vengeful spirit could barely be made out. Two trickles of blood tears flowed down.\\n\\n “This is the ancient potion—Tears of Mary?”\\n\\n Leylin raised his hand, dripping a few drops of blood in his hands.\\n\\n An icy cold and viscous sensation was felt.\\n\\n “The spirit is an illusory thing. As for me, I could actually come in contact with a spirit’s tears, what a wonder….”\\n\\n Leylin muttered as he smeared the red potion on his eyes.\\n\\n * Bang! *\\n\\n An extremely spicy sensation travelled from Leylin’s eyes, causing immense pain.\\n\\n Red! His vision could only see the colour red!”\\n\\n There seemed to be a woman’s voice sounding inside his brain as if narrating something. The voice gradually grew louder and louder.\\n\\n Finally, Leylin could only grab his head and head-butt viciously against the wall, to ease this symptom.\\n\\n The A.I. Chip’s indicator appeared in front of Leylin.\\n\\n [Subject underwent an unknown effect. spiritual force increased. Currently, it is 14.3….]\\n\\n The data that represented Leylin’s spiritual force continuously increased.\\n\\n 14.8\\n\\n 15.3\\n\\n 15.8\\n\\n 16.1\\n\\n The number which represented the spiritual force continuously rose, finally stopping at the number 16.1.\\n\\n “Hu… It has finally passed!”\\n\\n Leylin rubbed his temples firmly, as he inhaled a lungful of cold air.\\n\\n “Although it’s very painful, the side effects are not too much…”\\n\\n Before he could finish speaking, Leylin discovered that there was a thin layer of mist in the surroundings.\\n\\n A flash of red colour robes streaked past in the room.\\n\\n Leylin wanted to move, yet the air seemed to be extremely muddy like starch paste. Any movement would be difficult to execute!\\n\\n Finally, the owner of the red robes appeared in front of Leylin — the vengeful spirit!\\n\\n At this moment, more than half of the vengeful spirit’s head had dissolved.\\n\\n “If it was another time! Such an attack!”\\n\\n Leylin was extremely unwilling, but he was still struck in the chest by that claw.\\n\\n An icy cold chill started to spread from his chest.\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-102","bookId":1513,"book":{"id":1513,"title":"Warlock of the Magus World","description":"What happens when a scientist from a futuristic world reincarnates in a World of Magic and Knights?\\n An awesome MC — that’s what happens!\\n A scientist’s goal is to explore the secrets of the universe, and this is exactly what Leylin sets out to do when he is reincarnated. Dark, cold and calculating, he makes use of all his resources as he sets off on his adventures to meet his goal.\\n Face? Who needs that… Hmmm… that guy seems too powerful for me to take on now… I better keep a low profile for now.\\n You want me to help you? Sure… but what benefit can I get out of it? Nothing? Bye.\\n Hmmm… that guy looks like he might cause me problems in the future. Should I let him off for now and let him grow into someone that can threaten me….. Nahhh. *kill*\\n","cover":"http://cunovel.com/img/WMW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
