{"id":59628,"no":1072,"title":"Chapter 1072","content":"Cleanup\\n\\n The Snake Dowager ruled over the Shadow World in ancient times. Then, this place had been largely similar to the Magus World, with extraordinary power granting high status and various empires at war with each other. Wars erupted every day, and it was a dark time for the commoners.\\n\\n It seemed like Xavier’s father adopted a prudent stance against these descriptions of snake descendants and bloodline carriers, thinking they were just superstitions used by people of ancient times to control them through fear.\\n\\n History had changed when the Snake Dowager had lost her position about thirty thousand years ago. The Mistress of the Night had taken control of the Shadow World. Unknowing of the facts, the regular humans had met a pivotal point— psi energy and the Shadow Weave had been established.\\n\\n “With the Snake Dowager gone humans took primary control of the Shadow World, allowing science to flourish. The most crucial bit was the discovery of psi energy…” Leylin’s right index finger tapped on the cover of a history book as he pondered the subject deeply.\\n\\n ‘Psi energy, the gift of the Shadow World. Pure and effective, it has low contamination. Even more important is that a lot of it can be stored, and humans could make containers for it quite easily. Once it was discovered it replaced all kinds of fuels, developing into many other fields as well. Now the maglev trains, aircraft, and even the high-tech armour used by their soldiers ran on psi energy…’\\n\\n Leylin read on slowly.\\n\\n ‘Psi energy did not exist during the reign of the Snake Dowager, instead coming right after the Mistress of the Night appeared… It is extensively used, connected to another new creation called the Shadow Weave.’\\n\\n Once one read to this point, even a fool would realise it was a setup of the Mistress of the Night.\\n\\n ‘Ever since then, humans have had near unlimited energy. Money allows them to cast spells from the Shadow Weave, letting them toss extraordinary ability into the trash and abandon all ancient training techniques. Is this now the era of science?’\\n\\n This was all within the books from Xavier’s family. Several tens of thousands of years ago, there were countless myths and legends of heroes with superpowers, but by the era of Xavier’s ancestor all small discoveries of such abilities had been carefully recorded. It was evident that history had changed greatly.\\n\\n ‘Make them over-reliant on equipment, having them forgo true strength and regress in their extraordinary abilities… It reduces the number of enemies, and allows you to use the Weave to control the entire world…’\\n\\n Leylin felt like he understood part of why Shar had prepared all this. At the same time, a spirit force message travelled over, causing his face to change.\\n\\n ……\\n\\n Amdo City had now been surroudned by soldiers with powerful-looking cannons. Many of these soldiers had expensive equipment on, making for an extremely imposing sight that stilled the atmosphere.\\n\\n At the centre was a large piece of land that had been hollowed out by a meteorite. The extreme heat had left behind traces of crystal within, but the meteorite itself had already disappeared.\\n\\n A command post had been erected here temporarily, with many troops analysing data and conducting investigations within. They were all submitting their information to the middle-aged commander from before.\\n\\n “The Weave has been checked, no traces of psi energy found.”\\n\\n “Meteorite sample collected, sending a copy to the royal family for further analysis.”\\n\\n “All troops on standby, prepared to move at any time.”\\n\\n All this information did nothing to improve the commander’s mood. After all, he was facing an opponent that had obliterated a military base in an instant. What’s more, there was more than one enemy!\\n\\n “So the culprit within this meteorite hid himself inside Amdo City. What about the other two, where did they land?” The officer rubbed his temples.\\n\\n “The estimated trajectory puts the second landing point in the east of the empire, within 30km of Danube City. However, the base there was extremely quiet. The mission has been handed over to the local troops.” The report came from a well-trained intelligence officer with a pair of long, beautiful legs. She adjusted her spectacles as she spoke calmly, “The third landing point is at Coral Coastal City. We’ve already sent a request to the navy to find and annihilate the opponent.”\\n\\n “Three apostles at a time…” The middle-aged officer seemed unable to bear this heavy burden, “And one’s already infiltrated Amdo City. How is the city’s shutdown going?”\\n\\n “Our troops have already surrounded the place, forbidding any citizens from leaving the city. A couple of small fights broke out, but the situation is under control…”\\n\\n “Alright then… We can only impose these heavy laws for the sake of the empire,” the officer said with an expressionless face.\\n\\n Creatures from the stars were extremely dangerous. They could hide within the souls of ordinary citizens, beginning to spread contamination. They’d taken down entire empires in the past, so he had to prevent it at all costs!\\n\\n Even if these specific apostles couldn’t contaminate the soul, any foreign pathogens or viruses they carried could cause serious damage to the affected citizens. Thinking about it some more, the officer passed down further orders, “Relay the new safety measures once more! Deny all citizens who wants to leave, including the local officials inside too. All who disobey must be killed immediately!”\\n\\n “… Yes!” Listening to the merciless order, the soldier was taken aback. Still, she ended up obeying his orders.\\n\\n “Hehe… It looks like the Empire Hawks aren\u0027t all that capable? They actually have a headache from such a small event?”\\n\\n Just as the soldier was about to leave, a mocking voice sounded from outside the strength. The green flaps were pushed open to reveal a group of soldiers in black uniform. The one who laughed earlier was a member of the group with yellow crew-cut hair.\\n\\n “Soldiers! Soldiers!” The soldier pulled out a minigun, aiming at the group that had barged in. She was extremely furious at the lack of security outside the tent.\\n\\n “Raise your hands slowly! You are now intruding in a restricted area of the army, I have the rights to kill you immediately!”\\n\\n The other officers pulled out their guns as well, pointing them at the group.\\n\\n “Hehe… Kill us? How interesting! Foolish humans…” The group of black uniformed personnel did not show any expression. As for the yellow crewcut man, he pointed his finger at the woman and twirled it.\\n\\n “Ahhh…” Suddenly, the woman felt like her hands did not belong to her anymore, and the gun fell to the ground as she was lifted and floated in midair, her head facing towards the ground.\\n\\n “How can this be? The Weave is sealed in here, mid-grade spells can’t be cast at all!” The other administrators were shocked.\\n\\n The yellow haired man looked at the female soldier’s thighs, his sleazy eyes revealing his lust. He then asked his leader for permission. “Not a bad pair of thighs! This stocking… You’re rather wanton on the inside. Boss, can I play with her?”\\n\\n “Enough! All of you, stop now! Put down your guns!” The middle-aged officer ordered. Very soon, he looked at the leader of the black uniforms, his eyes revealing a complex gaze, “Are you here to mock me, Javis?”\\n\\n “I don’t have time like that to waste, elder brother.” The huge bloke called Javis looked at the yellow-haired man, who immediately released the female soldier. He then took out documents sealed by the imperial seal.\\n\\n “I’m here to clean up your mess… It’s a fact that the Special Forces are the true trump card of the empire, used to deal with things like this.” All the military personnel within the tent gasped after hearing the words ‘Special Forces’.\\n\\n This was a covert team put together by the empire. They consisted of people with extraordinary abilities, and were supported by many resources and the newest technology, tasked with dealing with special occurences like this.\\n\\n More importantly, the members of this team were extremely lawless. Nasty news and rumours floated around the army about them, labelling every team member a crazed criminal.\\n\\n “The empire has sent out the Special Forces, do those up the hierarchy believe that things have reached such a bad stage?” The female soldier collapsed to the ground, breaking out in cold sweat. She didn’t dare to look at the yellow-haired man anymore.\\n\\n “Since it’s the orders of the empire, I have no objections!” The commander looked through the documents and even saw the seals from his direct superior. He saluted in a military pose, before handing over a silver key over to Javis, “I hope you don’t let the superiors down!”\\n\\n “Relax, I’m not you!” Javis smirked, the silver key melting as it entered his body through his skin.\\n\\n Suddenly, a mechanical voice sounded in the tent. “Authority passed on. Shadow Weave control of Amdo City has changed, welcome General Javis.”\\n\\n “Very good! Contact Mole and Wolf Fang for me!” Javis barked out his orders. Very soon, two soldiers wearing black uniforms appeared on the screen.\\n\\n “Boss! Team 1 is in position!”\\n\\n “Team 2 Ready!”\\n\\n “Our target this time has the ability to enter souls. The feedback from the Weave and the estimation of the central neural net say that the possibility of the enemy hiding in a citizen’s body is extremely high.This is a list compiled by the city’s surveillance system, I want you to dispose of every member there!”\\n\\n Javis raised his hand, and an extremely detailed, long list of names appeared. This was the list of suspects put together by the central neural net, where the Weave had sensed the greatest number of questionable energy spikes.\\n\\n “Have you gone mad?” Javis’ brother looked at the list of names. There were over ten thousand names written in there! He howled once more, “These are all citizens of the empire! There may just be one culprit while the rest of them are innocent!”\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-1072","bookId":1513,"book":{"id":1513,"title":"Warlock of the Magus World","description":"What happens when a scientist from a futuristic world reincarnates in a World of Magic and Knights?\\n An awesome MC — that’s what happens!\\n A scientist’s goal is to explore the secrets of the universe, and this is exactly what Leylin sets out to do when he is reincarnated. Dark, cold and calculating, he makes use of all his resources as he sets off on his adventures to meet his goal.\\n Face? Who needs that… Hmmm… that guy seems too powerful for me to take on now… I better keep a low profile for now.\\n You want me to help you? Sure… but what benefit can I get out of it? Nothing? Bye.\\n Hmmm… that guy looks like he might cause me problems in the future. Should I let him off for now and let him grow into someone that can threaten me….. Nahhh. *kill*\\n","cover":"http://cunovel.com/img/WMW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
