{"id":59629,"no":1073,"title":"Chapter 1073","content":"Annihilation\n “You’ve always been so soft, brother. It’s your greatest weakness…” Javis looked at his brother. They had similar faces, but their hairs were already turning white.\n “I’m the person in charge right now. If not for the citizens, I would long since have applied for the Shadow Weave Team to destroy the entire city…”\n Javis dug his ears, “Where are the soldiers? Remove unauthorised personnel from this tent at once!”\n Suddenly, a group of armored troops entered and chased the middle aged officer and his subordinates away.\n “People who get in the way should leave. Now… Let us play our game of hide and seek!” Javis looked at the screen, his extreme insanity spilling over into calmness, “Enable city surveillance. Lock down all spells using the Shadow Weave, and disable teleportation. Scan for any strange sightings and energy movements. Begin the purge!”\n “Go! Action!” Mole and Wolf Fang waved their hands in a forward motion, and the armoured troops behind them began their operation to kill the people on the list.\n “Hey, what are you trying to do?” Armoured troops entered a civilian’s home, and began shooting at the family of three who were having a meal at the dining table.\n *Bang! Bang!* Very soon, the head of the man exploded, and his body lay in a pool full blood, followed by his wife and his daughter.\n Although middle-grade spells in the empire had seals that needed unlocking and high-grade spells were reserved for soldiers and royals, commoners still had the right to use low-level spells. However, Javis had already locked down on magic in Amdo City, so all Rapid Shadows watches had turned to trash.\n Without those tools, these commoners were weak and small in front of the armored troops. Wave after wave of flying drone encircled the air around Amdo City, releasing messages of warning.\n “Troops of the empire are currently in the midst of capturing spies. All civilians are requested to stay in their homes, and not to leave. We will not hurt the innocents. I repeat, we are troops of the empire…”\n Gunshots sounded from time to time, and there seemed to be a flurry of activity within the city. However, the soldiers had still managed to suppress the situation and keep it in control.\n After all, ten thousand was still only a small fraction of the ten million plus population here. As long as their own names weren’t on the list, these citizens wouldn’t be brash enough to resist the executions.\n As for Javis, he sat in the command post and watched the screen in admiration, enjoying the wine in his hand.\n *Bang!* Yet another man was killed in his own home, and blood spilled everywhere.\n “No! Don’t….” This was the plea of a young lady before her death, but the soldier did not even spare her another glance.\n To obey commands was the basic duty of a soldier, and one who didn’t think for themselves was basically the ultimate weapon. Only resolution and strength would carry them through all situations and missions.\n The mass killing was executed quickly, but there were still some hiccups from time to time.\n “Damn it! The Empire still has a hostile outlook on us extraordinary humans?”\n A bespectacled young man howled at the gun pointing towards him. Suddenly, he was covered in flames as he turned into a malevolent creature that was filled with scales.\n “Shoot!” The psi energy filled bullets only left white scars on the scales.\n “It’s a mutant! Extraordinary person! Hurry and call for backup!” A squad leader howled at the communicator, but it was already too late.\n *Zoom! Whoosh!* The monstrosity leapt forward, turning into a black line on the screen.\n *Crash!* The armour that the troops wore was soon torn apart, spilling out broken white bones and blood.\n “Huff… Want me to die? You first!” A human voice sounded from the creature’s mouth, as he ducked into the sewer quickly.\n “Ding! Target’s identity confirmed! Second level civilian, Chengfei! Father… Mother…Current home address:... Beginning lock-on!”\n The central system screen revealed pieces of information on the target, and on the left side was the appearance of the young man before he transformed.\n “Good! These mutants are hereditary. Mole, find a couple of men to get rid of him. As for the rest, look for his parents and blood-related kin!” Javis ordered.\n “Kiddo! You had a fun time earlier huh?”\n The sewer duct was shattered into pieces, reveal the underground pipe network and the creature’s shocked expression.\n A black-uniformed soldier stood in midair before the creature, looking down on him in mockery.\n “Spawn of the witch! Meet your maker today! Before you die, I hope you can give me some fun…”\n “It’s only a low-level bloodline carrier?” Javis nodded his head indifferently as he watched the young-man-turned-creature being brutally killed on the screen.\n The expansion of technology and the constant purges from the empire had dropped the numbers of these mutants. Some of the present generation didn’t have strong powers. On the other hand, people who had obtained extraordinary strength through training rigorous techniques were still around.\n However, these two types of extraordinary humans were as weak as ants in front of the forces of the Empire and the Shadow Weave. As the killing in Amdo City continued, many innocent civilians who were caught in the crossfire ended up dead as well.\n There were also other unlucky ones like the mutant earlier, killed mercilessly without any proof or verification needed.\n These mutants formed the underground world of the each city, but after this event they were completely purged from Amdo city. However, if Amdo City could survive this ordeal, they would instead reach a very high level of society.\n As the massacre continued, the several thousand names on the screen disappeared, finally showing only the last few hundred targets.\n “All teams on alert!” As the target area grew smaller, even Javis himself had turned more solemn.\n ……\n *Whoosh! Whoosh!*\n A woman wearing an office outfit rapidly ran down the streets, as if a predator that was searching actively for its prey.\n Suddenly, a metal net appeared from the side of her vision. She leapt upwards for a distance of more than five metres, passing through a wall to disappear from the scene.\n “I have to avoid the surveillance cameras, and also throw away any hi-tech equipments related to hidden energy and the Weave!” The office lady face changed as she crushed the Rapid Shadow on her wrist...\n About ten minutes later, in an abandoned factory. Blood splattered on the walls like plum blossom in a dark corner.\n The office lady took off her coat, revealing a white blouse underneath. She had a hole on her hand.\n “Urgh…” However, she gritted her teeth and moved her muscles, forcing out a golden metal bullet out from her body. After expelling the bullet, she heaved a sigh of relief. She then tore part of her blouse to wrap the wound, and her face turned extremely pale.\n “The empire is quite resolved this time. Was our organisation discovered?”\n “No! Even if we were exposed, they would not need to take such drastic actions. Moreover, the whole of Amdo City is filled with gunshots… We were just unlucky to have been discovered… Were they after some powerful mutant organisation?”\n The office lady smiled wryly, “Even if I learned a few body techniques and trained my Plum Blossom Fingers to rank 5, I can only run in the face of the Empire… If not for the other mutants diverting the attention from me, I would have been captured or killed by now… After they narrow down the radius of their hunt, the situation will grow even more troublesome. I need to leave this place as quickly as I can!”\n She did not realise that a strand of her hair had already turned crimson red, with a phantom voodoo doll faintly floating behind her back.\n [Host Command: Gather intelligence and conceal as much as possible! Chances of current target being discovered is too great! Abandon current target immediately!]\n Very soon, the phantom of the voodoo doll left the office lady’s body and merged into the darkness.\n [Current location is unsafe, attempting to leave! Traces of spatial lockdown discovered! Attempting to break through!]\n Light flashed within the dim eyes of the voodoo doll.\n “Found you!” Javis howled from within the command post, “Gather up immediately. Attack!”\n A dazzling white light flashed as the abandoned factory and the office lady within it disintegrated, turning into dark liquid before sizzling and evaporating into thin air, not leaving behind a trace.\n [Beep! Whereabouts discovered, mode changed to breaking through!] The smile on the voodoo doll’s face turned even more sinister than before, as light flashed past its eyes once again.\n *Boom!* The incendiary bomb which contained a huge amount of energy caused a quarter of Amdo City to be completely destroyed.\n Javis and the other members of the Special Forces stood above the explosion in mid-air, surrounding the voodoo doll.\n “First apostle found!” Javis snapped his fingers, and powerful spells took form nearby. The energy waves they radiated were no less than that of legendary spells!\n “Damn it! That crazy Javis!” Javis’ brother, that middle-aged commander, couldn’t help but curse as more than a quarter of Amdo City was destroyed.\n “I knew it… Handing over the Weave to him was not a wise thing!”\n ……\n Leylin was shocked for a moment as he received the news in Thousand Bears City.\n “Although they have made a large sacrifice, they still managed to capture the doll and destroy it, huh?”\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-1073","bookId":1513,"book":{"id":1513,"title":"Warlock of the Magus World","description":"What happens when a scientist from a futuristic world reincarnates in a World of Magic and Knights?\n An awesome MC — that’s what happens!\n A scientist’s goal is to explore the secrets of the universe, and this is exactly what Leylin sets out to do when he is reincarnated. Dark, cold and calculating, he makes use of all his resources as he sets off on his adventures to meet his goal.\n Face? Who needs that… Hmmm… that guy seems too powerful for me to take on now… I better keep a low profile for now.\n You want me to help you? Sure… but what benefit can I get out of it? Nothing? Bye.\n Hmmm… that guy looks like he might cause me problems in the future. Should I let him off for now and let him grow into someone that can threaten me….. Nahhh. *kill*\n","cover":"http://cunovel.com/img/WMW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
