{"id":59671,"no":1115,"title":"Chapter 1115","content":"Meeting\\n\\n The old butler and the youth were guarded by a group of ‘friendly and polite’ native soldiers after they entered the territories of Debanks Island. Since they were in a land that was not their own, they allowed this arrangement. After a few days of uneasy waiting, they managed to arrange a meeting with Leylin.\\n\\n On their path to the holy mountain, the old butler looked at the youth solemnly. “Do you remember what I told you, young master?”\\n\\n The youth had stiffened up in the tense atmosphere, but he still managed to nod, “Mm.”\\n\\n ‘Sigh… This beautiful and fertile country… It’s a powerful base even for demigods. No wonder he can flourish for so long without fear of being destroyed by the mainland…’ The old butler gazed at the flourishing imperial capital and sighed in awe. Leylin truly had picked a great place. Not only was there a large population to provide faith for him, the mainland had little influence here.\\n\\n However, thoughts were just thoughts in the end. Few were as bold as Leylin, aiming to take over the natives’ empire. With the defect in the natives’ souls, the gods avoided them like the plague.\\n\\n With all sorts of factors, Leylin somehow managed to get the best parts of everything. If not for the natives, Debanks Island would long since have been divided amongst the gods, and he wouldn’t have had any chances.\\n\\n *Clang!* The heavy gates of the Giant Serpent Church opened slowly. The devil hunters guarding the sides and the large number of priests and acolytes walking around added a certain weight to the atmosphere.\\n\\n “Welcome!” Tiff was dressed in his regal attire, crown included. Standing on the steps, he looked like a kind and holy man.\\n\\n “The Pope shouldn’t bother with humble servants like us…” The butler pulled at the youth, who quickly realised his position and hastened to bow.\\n\\n Tiff merely smiled in answer to the tiny mistake of the youth, “Please follow me. My master will see you personally…”\\n\\n Hearing this news, the butler and youth obviously grew more nervous.\\n\\n ‘The Giant Serpent, the youngest legendary wizard in the world who conquered an empire with a few thousand people… Leylin Faulen, the legend of legends…’\\n\\n The youth exchanged a glance with his butler, obviously uneasy. However, Tiff had already moved out, and the two couldn’t avoid this confrontation anymore. They could only follow behind in apprehension.\\n\\n The three soon arrived at the palace behind the headquarters. A god in white robes was already waiting there, standing under his own statue. Golden light sparkled off his body, causing the large statue of the winged serpent to grow radiant as well. He seemed in harmony with the shrine, almost blending into one body.\\n\\n After taking one look at this person, the butler was certain that this was the Leylin Faulen of the legends! This was the master of the Debanks Empire, as well as a demigod magician!\\n\\n “Oh great being, please accept the worship of a humble mortal!” The butler bowed down and knelt, and the youth followed soon after.\\n\\n “High-ranked magician, Daybreak Hand Schliff… your loyalty is worthy of praise…” Leylin did not speak loudly, but it still reverberated throughout the shrine. The tone of the voice showed that it was unquestionable.\\n\\n The Giant Serpent Church had long since revealed all of this high-ranked wizard’s secrets. His true thoughts couldn’t be hidden in front of Leylin.\\n\\n “Is this the Poison Scorpion’s son?” The god’s gaze moved past Schliff, focusing onto the youth.\\n\\n “Ra… Raike greets His Highness…” the youth stuttered out. He could sense that Leylin’s imposing aura was even more powerful than that of his demigod father, who had once been the master of his church.\\n\\n “Yes… Raike inherited the Master’s bloodline and glory, and will surely become a saint in the future!” At the mention of his faith, Schliff just had to speak, “Your Highness, please help us on account of the goodwill from our master in the past…”\\n\\n In answer to this mortal’s humble request, Leylin did not comment. Rather, there was a look of pity in his eyes as he watched Raike.\\n\\n “As the child of a god, do you know what your destiny is?”\\n\\n ”Destiny?” Raike’s eyes showed his confusion and bewilderment.\\n\\n “As the descendant of our Master, he has no other choice!” Schliff answered loudly, obviously trying to hide things for a while longer.\\n\\n “Heh!” Leylin merely shook his head and smiled, but did not reveal the truth.\\n\\n True gods only needed faith to revive themselves, but things were wildly different for demigods. The master of the Poison Scorpion Church hadn’t accumulated any divine force, and now that he’d fallen even if he obtained enough faith in the future he lacked the most important thing for revival— a vessel.\\n\\n The vessel needed to be powerful enough to take on the power of a god. Most importantly, this person had to have the same blood as the god. This Raike was evidently Poison Scorpion’s vessel, and someday in the future his father would break into his body and revive within to appear in the world once more.\\n\\n It was not just demigods. In actuality, many true gods liked to use this method. Leylin had once even wondered whether Alustriel, the queen in the north, had been prepared for such plans by the Goddess of the Weave.\\n\\n “There’s a contract between Poison Scorpion and I, to give each other all the help we can. Promises at our level cannot be broken.” Leylin answered in the affirmative.\\n\\n “Many thanks, Your Highness!” Schliff bowed in excitement. Even he had not expected things to go so smoothly. However, after seeing Raike, Schliff hesitated before steeling the look in his eyes.\\n\\n “Mighty master, this is a humble offering from us.” Meeting Schliff’s gaze, Raike gritted his teeth and pulled out the sparkling pendant from his neck, offering it up with both hands…\\n\\n Once everyone left, Leylin focused on the necklace in his hands.\\n\\n ‘A divine weapon? And there even seems to be some force hidden inside…’ The A.I. Chip’s light flashed in Leylin’s eyes, and he nonchalantly threw the item into a semi-plane. As he was now, refining an origin force weapon, a divine weapon was nothing much. However, it wasn’t bad as a collectible.\\n\\n “Raike… I sense a dense aura of deity blood…” Leylin looked in the direction that Raike had left, eyes seeming to reflect scenes of what would happen after he left.\\n\\n ……\\n\\n Within the carriage, Raike seemed to have made up his mind before he asked Schlif, “Just now… what His Highness mentioned…”\\n\\n “You don’t need to know about that, young master!” Schliff immediately put on a cold expression, his powerful aura preventing Raike from speaking further.\\n\\n “All you need to know is that you were born for the sake of our master. Everything that is yours has to be sacrificed in order for the revival of the master…” Fervour glinted in Schliff’s eyes, the terrifying zeal causing Raike to shift his gaze down.\\n\\n ……\\n\\n Demigod as he was, it was easy for Leylin to peek on a high-ranked wizard without them even noticing. Many secrets revealed themselves before him.\\n\\n Unfortunately, he felt no pity towards Raike, and he had no desire to help him.\\n\\n “His blood is concentrated, so the chances of revival are greater… But that isn’t enough…” His divine sight seemed to transcend the seas, locking onto the vast mainland.\\n\\n ……\\n\\n In the south of the mainland, within a dangerous marsh full of lush bushes.\\n\\n A devil hunter with the crest of the Giant Serpent Church cautiously maneuvered past numerous assassins’ territories as well as the tribes of barbarians and kobolds, arriving at the depths of the marshes.\\n\\n This was an ultimate region of death. It was rumoured that there was a nine-headed monster dwelling here, and the poisonous fog it emitted could kill any living being. Even divine spells were useless in front of it.\\n\\n However, few on the mainland knew that a tribe similar to humans lived deep inside.\\n\\n *Ooooo—* Numerous humanoids gathered with the sound of a large cow bugle. These beings had a distinct physical appearance, looking like werejackals or kobols.\\n\\n Some kind of shaman walked up to an altar. “Ukekelu, our Lord… We pray to you devoutly, and offer a blood sacrifice!”\\n\\n A few sacrifices had their clothes stripped from them as the old man prayed, trembling as they were delivered to the platform. His eyes bloodshot, he picked up an obsidian dagger and kissed it once in devotion before standing in front of the slaves. It looked like he was watching some lambs to be slaughtered.\\n\\n The shaman dismembered the sacrifices easily, a technique passed down through centuries allowing him to keep them alive until he made the final cut. Only such a thing would please Ukekelu enough to grant them his favour.\\n\\n Demigods, devils, and demons who were false gods were different from true gods. They could do anything for the sake of faith and power, seeking out new followers with greed.\\n\\n Most of the time, Leylin believed that it was because there were people like these who were so shortsighted that the reputation of demigods was tarnished so badly. It made it such that his Giant Serpent Church could not operate well on the continent.\\n\\n However, he was merely blabbering on. Without blood sacrifices, demigods would long since have died out with the bit of faith they obtained from their followers. Only Leylin, who took control over the Debanks Island and had nobody vying for faith with him could treat his followers so generously and give them more benefits. In the long run, this was the best method, but it was difficult for everyone to do this considering the circumstances.\\n\\n As the shaman proceeded with his ceremony, the other worshippers quickly knelt in prayer. Blood poured everywhere, as if nurturing some horrifying force.\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-1115","bookId":1513,"book":{"id":1513,"title":"Warlock of the Magus World","description":"What happens when a scientist from a futuristic world reincarnates in a World of Magic and Knights?\\n An awesome MC — that’s what happens!\\n A scientist’s goal is to explore the secrets of the universe, and this is exactly what Leylin sets out to do when he is reincarnated. Dark, cold and calculating, he makes use of all his resources as he sets off on his adventures to meet his goal.\\n Face? Who needs that… Hmmm… that guy seems too powerful for me to take on now… I better keep a low profile for now.\\n You want me to help you? Sure… but what benefit can I get out of it? Nothing? Bye.\\n Hmmm… that guy looks like he might cause me problems in the future. Should I let him off for now and let him grow into someone that can threaten me….. Nahhh. *kill*\\n","cover":"http://cunovel.com/img/WMW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
