{"id":58670,"no":114,"title":"Chapter 114","content":"The Dylan Gardens “That being so, why don\u0027t we all enter together?!” Bosain looked at the other two. “Certainly!” Resolve surfaced on Jayden’s face. For him, the exploration, this time, was only considered successful if he found a Magus inheritance! “I have no objections!” Leylin looked calm on the surface, yet it was contrary to what he felt. He was aware of the person who left behind this inheritance and what was buried here. \"Rank 4 Magus, a virtuous person in legends, inheritance of the great Magus Serholm!” Leylin’s heart blazed in desire. The three had the same opinion and entered the rusty metal passage. The tunnel was broad, enough to fit 3 adults walking side by side. Since they were 3 youths, naturally they had more freedom for movement. Leylin touched the wall and grey dust fell down, revealing the silver metal wall behind it. At first, it felt was icy-cold, then again it felt warm. This metal gave a strange sensation when Leylin’s fingers touched upon it. [Discovery of an unknown metal, not registered within database!] After a scan, the A.I. Chip’s voice intoned. “This is the Crying Blood Alloy. It seems that during its casting, it requires the fresh blood of beasts or slaves. Reportedly, there is a certain limit to its effect on the spirit bodies!” Bosain whispered into Leylin’s ears. If magicians were treated as commoners, then Bosain would belong to nobility within magicians. His knowledge still surpassed Leylin’s in certain areas. Moreover, a few precious materials could only be obtained within such families, Leylin had no access to them at all. “Blood Crying Alloy?!” Leylin commanded silently, “A.I. Chip, record composition!” [Beep! Target information collect, saving in database. Folder: Resource Information—Blood Crying Alloy!] The A.I. Chip’s indicator sounded in Leylin’s ears. “The distance to the protective screen observed earlier is becoming shorter!” Jayden walked on the right, suddenly speaking, “Since this is a passage constructed by this type of alloy, there may be something appearing ahead…” “A spirit body!” Leylin and Bosain called in unison, their face looking awful. For acolytes, they lack effective defensive measures. For spiritual body attacks, they had no good countermeasures for it. If it were regular acolytes, they would have long since retreated. However, Leylin and the others were different. Bosain and Jayden had magic artifacts on them, which could be temporarily used for defense. Although those were not defensive magic artifacts like the Fallen Star Pendant, could still protect their spirits from being attacked for the time being. As for Leylin himself, he had researched on spirit bodies for over two years. Under the aid of the A.I. Chip, his knowledge on spirit bodies had exceeded even a few of his professors. At this moment, Leylin quivered. [The negative energy density in the air has increased by an additional 3.14% than regular settings!] The A.I. Chip’s voice intoned. “This environment seemed to be recorded by the A.I. Chip before. It is one of the most suitable environments for spirit bodies to survive!” A strong fearful instinct rose from Leylin’s body. “It’s here!” Leylin eyes squinted, there was a bright hole appearing in front of them. After passing through the cave hole, Leylin, and the rest felt a radiant light whose glare bothered their eyes and they could not help but shut their eyes. When they opened their eyes again, they had already entered a sea of flowers with varying colours. Tulips, flaming poppies, red large winding chrysanthemum, green calla lily, various flowers that Leylin knew and don\u0027t know were blooming in this flower garden. The garden seemed to be under some spell. Different blooming seasons and different areas of flowers were blooming wildly in this garden. The secular world flowers were only for decoration. After a quick whiff, Leylin discovered many useful herbs for magicians. Many were those that even Kroft could never find. Yet now, they were sitting here in this garden. “Violet Leaves Flower, Nose Root Fruit, Walking Dragonfly, Inverted Sunflower and there is even the Void Flower!” Jayden and Bosain, too, gasped in amazement. Towards the end, there were many species of flowers that Leylin could not recognise, but seeing where they were planted, their value must be above that of the Void Flower. Right now, Leylin finally knew why the Dylan Gardens were named. This huge garden was at least a dozen square kilometres. How much valuable plants were here? How much worth of magic crystals? Leylin only thought about it for a while and felt dazed. “Haha… the Sun Golden Flame! It’s actually the Sun Golden Flame!” Jayden looked at a flaming plant at the middle with a fervent gaze. “The strength of the Sun Golden Flame can even be combined with Grine Water to help Fire element acolytes to breakthrough. The success rate is increased by 20%!” Jayden muttered and his hand unknowingly went to reach for the fire red Sun Golden Flame. “Don’t!” Leylin seemed to thought of something and spoke suddenly. Alas, it was too late. Jayden completely ignored Leylin’s warning and reached for the flowerbed. *Ding Ling!* *Ding Ling!* *Ding Ling!* A sound similar to chimes sounded, and was extremely melodious to the ears. The air stopped! The wind stopped! Leylin and the other two felt nothing below their feet and was immediately shifted to another area. It seemed to be the interior of a villa. The four walls were displayed with brand new furniture. On the pale yellow desk, there was a lamp which contained an orange-red flame. “Where is this place?” Jayden spoke, losing his voice. “A type of defense mechanism. It seems like we have been transported to another area!” Leylin smiled wryly. Bosain was looking at Jayden right now, and he no longer appeared friendly. “However, there is also good news. According to the Kukeral period’s traditions, if we solve this mechanism, most of the remnant’s defensive mechanism will immediately lose their effect.” Bosain’s face darkened, “Originally, we had many opportunities to explore, and this is all because of you!” He pointed at Jayden. Leylin suspected that if not for the dangers lurking in the area Bosain would most likely attack him. “Teehee! Who’s here to play with Alice?” A mechanical girl’s voice sounded. At the turn of a corridor, something appeared—a Western Doll? Leylin noticed the giant mannequin that was in the shadows of the corridor’s corner. This western doll seemed to have to size of a grown adult. The eyeballs were of blue gems sewn in. It wore a pink frock and had beautiful blonde hair. On the chest, there was a red bowknot. “A vengeful spirit figurine!” Bosain stuttered. “Vengeful spirit figurine?” Leylin had not heard of this word before. Obviously, this was a spirit body of some sort. Looking at the physical body of the vengeful spirit figurine, Leylin realised that his research and probes on the spirit aspect had just been on a superficial level. At the very least, he was completely clueless about these types of vengeful spirits that seemed to border between illusion and reality. “Hehe! You come play with Alice!” The blonde girl pointed a finger at Leylin. Her arms were made of fabric and had no palm. Only a naked arm which was a glossy hemisphere. *Bang!* A translucent forcefield immediately exploded behind Leylin. He flew up in the air and could not stop himself as he flew towards the cloth doll. “Come here! My little baby! Let Alice give you a hug!” The cloth doll spread her arms as if wanting to hug Leylin. Jayden and Bosain looked at each other and immediately left the cloth doll and retreated. They actually abandoned Leylin and left. “F*ck!” Leylin tossed two balls of flames on the cloth doll and set it ablaze. However, the fire was quickly extinguished, and not even a trace of the damage was found on the cloth doll. *Ding!* Many baby sized arms appeared faintly from the void and seemed to pull on Leylin. A pair of girl’s arms was even touching Leylin’s waist now. A numb feeling was immediately spreading from his waist. Leylin’s eyes flashed in viciousness and immediately threw a yellow potion on the ground. A yellow protection screen immediately appeared around Leylin’s body, separating the countless baby sized arms. Trevor\u0027s Revolving Shield Potion! The only defense potion that Leylin had access to was now duly exhibiting its effects. “Argh! You have hurt Alice!” The cloth doll’s face split opened, revealing razor sharp teeth, “I\u0027m going to eat you!” A pair of half transparent beast mouth immediately appeared before Leylin and nipped down. *Ka-Cha!* Ripples seemed to have formed on the yellow defensive light shield, letting off noises that could no longer endure the attack. “This attack is quickly exceeding the capabilities of the potion!” Leylin felt for the item on his neck, “Now is not the right moment to use my trump card!” After which, a red flaming potion was tossed out by Leylin. “Intense Blazing Potion! Also this!” Leylin felt for several pink coloured pearls in his sack and threw it into the flames. During his stay at Extreme Night City, he had some results from researching spirit bodies. Apart from researching the laws of the spirit bodies, he also obtained some information on what those spirit bodies hated the most and what could hurt them. This pink coloured pearls contained one of the best effects. *Pu!* The pink pearls very soon exploded in the flames, revealing pink powder. After this addition, the flame turned pink too. It continued to spread until it filled the jaws of the beast. The huge jaws of the beast let off a terrifying roar and was very soon burnt to ashes by the flame. At the same time, the flame seemed to have gone through the void, extending to the face of the cloth doll. The cloth doll covered its face as it let out a loud and indignant howl. After the final wisp of flame had disappeared, the radiant screen on Leylin’s body had completely vanished. Leylin landed on the floor. On his waist were the scars caused by two tiny hands. His brows furrowed. The clothes on his back had already been corroded, leaving behind two small black imprints on the skin. “The injury caused by a spirit body must be removed immediately, if not it will continue to spread!” Leylin hurriedly withdrew several white leaves and applied on the wound. Suddenly a refreshing feeling could be felt from the injury. *Pa! Pa!* The windows on the side were broken, and two figures immediately charged in. Bosain looked at Jayden, the surroundings and then looked at Leylin on the ground. He smiled wryly, “It seems like no matter where we go, we will always return here!” Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-114","bookId":1513,"book":{"id":1513,"title":"Warlock of the Magus World","description":"What happens when a scientist from a futuristic world reincarnates in a World of Magic and Knights? An awesome MC — that’s what happens! A scientist’s goal is to explore the secrets of the universe, and this is exactly what Leylin sets out to do when he is reincarnated. Dark, cold and calculating, he makes use of all his resources as he sets off on his adventures to meet his goal. Face? Who needs that… Hmmm… that guy seems too powerful for me to take on now… I better keep a low profile for now. You want me to help you? Sure… but what benefit can I get out of it? Nothing? Bye. Hmmm… that guy looks like he might cause me problems in the future. Should I let him off for now and let him grow into someone that can threaten me….. Nahhh. *kill*","cover":"http://cunovel.com/img/WMW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
