{"id":59730,"no":1174,"title":"Chapter 1174","content":"Self-Destruct “It’s great that the two of you could join our alliance…” The grin on Asmodeus’ face turned wider as he signed the contract. “I’ve already ordered my subordinates to resist at all costs in Maladomini. We should be able to delay him for a while…” Baalzebul said. His aura had grown weak, apparently having severed connections with the Seventh Hell. Even if his subordinates knew they’d been given a suicide mission, as lawful creatures they could only surge forth to complete their orders. Such was the dignity of an Archdevil! “Same here,” Mephistopheles chimed in, “I hope that buys us time…” Leylin’s fearsome image, Seven Sins in hand, had evidently been etched deep into the minds of these Archdevils. “I stand by my previous suggestions,” Distorted Shadow said, “It’s a better idea to hide in the endless void or the elemental planes than to defend Nessus at all costs…” “That’s something that will only benefit you,” Asmodeus coldly interjected. “Once we lose all nine layers all our authority will be stripped from us. We’ll lose Baator’s origin force, bleeding in power without any chance to return…” “Hehe…” Distorted Shadow only smiled coldly at Asmodeus’ retort, not speaking another word. “Of course… We’re all common enemies of this God of Massacre,” Asmodeus said slowly. Devils were extremely crafty creatures, and this was especially true for their Supreme, “I wonder if Your Excellency can call upon any other Magi who are unhappy with this God of Massacre, and…” “My apologies, I cannot do that right now.” Distorted Shadow expressed his regrets, “Leylin found passage into the World of Gods, and the Magi of other worlds have already made a pact with him. He’s also the one who released the ancient conscients sealed in here long ago, so they already owe him a favour…” Asmodeus’ face darkened just from hearing those few sentences. “So Leylin is like the leader of their alliance, a mascot amongst the Magi…”Glasya sighed. “Indeed! We can only make full use of the gods’ powers to destroy him alongside his divine kingdom.” “Damn it!” the lords cursed. They’d never thought they’d meet an enemy as powerful as Leylin in Baator. Asmodeus saw them losing morale, quickly interjecting, “Alright. As long as we stand together Leylin won’t be able to make his most crucial advancement. His death will be but a matter of time…” However, the old devil’s expression changed the very next moment. His gigantic body shuddered, causing endless tremors through the earth. “It’s him! He’s here!” Asmodeus exclaimed. There was only one person that could cause his expression to change this quick. “Leylin!” the four other people gathered shouted. *Rumble!* At this moment, an enormous flying city descended outside of Nessus. Leylin was stood atop it, looking down at Nessus which stretched far beyond what the eye could see, his gaze filled with mockery, “You thought I’d be baited by Maladomini and Cania? How childish! “Compared to those two levels, I value you lords more…” The Nightmare Hydra phantom appeared behind Leylin’s back, its three remaining illusory snake heads staring at their respective lords like predators stalking their prey. “Seal the place now!” *Boom!* The earth was blasted open, revealing Asmodeus’ massive true body. His black wings covered the skies as he stood up, revealing the severe injury inflicted upon him back in ancient times. The wound had been exacerbated by Leylin’s attack when he’d brought his divine kingdom down. Facing Leylin, Asmodeus didn’t have the leeway to consider his injuries. He unleashed the full extent of his power, as a dark web appeared from his hand to envelop the entirety of Nessus. A power of isolation stopped Thultanthar from entering the Ninth Hell. The three other lords used their own authorities as well, mustering what origin force they could in a final struggle. Distorted Shadow disappeared into the darkness, the shadows shifting formlessly as if he was planning on something. [Beep! Target locked. Space has been sealed, preparing primary cannons…] A white light appeared on the main cannon of the flying city, so bright that it could kill a god. [Netherese core prepared, firing!] A powerful light seemingly born of the very universe shot forth under the fearful eyes of the devils, its absolute power unleashed on the barrier around Nessus. The barrier rumbled as the energy scattered in all directions, annihilating hordes of devils. The energy was so powerful that it attracted the attention of many powerful beings from the Abyss and the Celestial Planes. The stunning white light blinded the Lords of Baator. Glasya gripped her hands tightly as the energy waves began to dissipate, sighing in relief after she saw Nessus undamaged. “Hehe… With us here, Nessus is like the divine kingdom of a greater god… What will you attack it with?” The other two lords seemed to be encouraged by the sight. They’d just been far too fearful of Leylin slaying them. “A weave, origin force, spells, and elemental particles as well…” Leylin looked at the dark web that stopped his attack, and how it was being replenished by origin force. The A.I. Chip recorded everything he saw. “It seems like you’ve struck quite a few deals with Distorted Shadow, Asmodeus. I can’t let you carry on any further, or the consequences will be too dire.” Leylin stepped forward, leaving the flying city. The gem of Netheril that could house hundreds of thousands began to descend slowly, heading for Nessus like a meteorite. “What is he planning to do? Not good!” Distorted Shadow exclaimed in shock. He had never lost his bearings like this before. [Beep! Authorisation valid, initiating self-destruct.] Light flashed from the A.I. Chip, and all of Thultanthar’s energy converged into a massive aura. “Explosives prepared, beginning collapse of secondary dimension. Preparing Netherese Core…” There was no expression on Shaylin’s face. The city continued to descend, growing faster and faster. “Preparations complete. Impact in T minus 3, 2, 1…” *BOOM!* The light generated this time was far brighter than before, unleashing great explosive force upon Nessus. An indescribable scene occurred as the pinnacle of technology destroyed itself under Leylin’s orders. It was thousands of times more powerful than the Tunguska explosion back on his old world, feeling like the big bang as its undeniable might seemed to shoot the force of the entire world at Nessus. “You think losing the city hurts me?” the Nightmare Hydra phantom roared, dark clouds appearing above its head. This being that absorbed strength from the emotions of all beings protected Leylin. Seeing this explosion, Leylin smiled. “Material things are just that. So what if it can kill gods? A flying city is nothing on my path to power!” Leylin had been extremely clear on the situations. If he hadn’t taken Nessus out immediately, the Lords of Baator would very likely hole up like tortoises and render him helpless. Hence, he did not hesitate to use his trump card as he sacrificed Thultanthar to kill his enemies. Even if multiple renovations had given Leylin full control of the city, he couldn’t help but be wary of any backdoors Distorted Shadow had placed into it. The safest way forward was to destroy the city, just like he’d killed his divine clone after using Karsus’ Avatar to avoid harm. The deed was done now anyway, there was no need to analyse costs anymore. Distorted Shadow grew extremely impatient when Leylin sacrificed Thultanthar. A large writhing shadow with boundless power headed to the boundaries of Leylin’s divine kingdom. “Leave!” the void flickered, and Leylin’s clone appeared alongside Mother Core. The two gave him a strong warning at the border. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-1174","bookId":1513,"book":{"id":1513,"title":"Warlock of the Magus World","description":"What happens when a scientist from a futuristic world reincarnates in a World of Magic and Knights? An awesome MC — that’s what happens! A scientist’s goal is to explore the secrets of the universe, and this is exactly what Leylin sets out to do when he is reincarnated. Dark, cold and calculating, he makes use of all his resources as he sets off on his adventures to meet his goal. Face? Who needs that… Hmmm… that guy seems too powerful for me to take on now… I better keep a low profile for now. You want me to help you? Sure… but what benefit can I get out of it? Nothing? Bye. Hmmm… that guy looks like he might cause me problems in the future. Should I let him off for now and let him grow into someone that can threaten me….. Nahhh. *kill*","cover":"http://cunovel.com/img/WMW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
