{"id":58695,"no":139,"title":"Chapter 139","content":"Sentinel Slate\\n\\n The rain drizzled continuously, as if like a thread of yarn.\\n\\n It pelted onto the tarpaulin Leylin had draped over his shoulders; it gave a cooling sensation.\\n\\n Riding on the Seated Lupin Wolf that had a night’s rest, Leylin appeared tranquil as he peered through the ashy haze, trying to look at the scenery ahead.\\n\\n *Whoosh*\\n\\n It was as if the curtains were pulled apart. Leylin felt like he had rushed out of a dense fog as extremely dazzling sunlight directly shined on them.\\n\\n *Rustling*\\n\\n Wolf claws slowly sunk into the countless grains of sand they were stepping on.\\n\\n The rain-filled, dark clouds had gradually dispersed, and now the fiery sun had taken over the sky. It brought with it burning hot rays of brilliance, which constantly spread across the wide desert.\\n\\n From what they could see, there was a field of gold as well as modulating levels of sand dunes.\\n\\n “Golden Desert, we’ve arrived!” Leylin felt the surrounding temperature increasing constantly. It must have gone up by at least twenty degrees since the rain earlier.\\n\\n The sweltering humidity continuously flooded into the tarpaulin, and even with Leylin’s constitution, he felt a little uncomfortable.\\n\\n *Crash* He hastily removed the tarpaulin and stripped off some clothes, and even then he only felt a little better.\\n\\n This sudden change in temperature within the Grand Canyon Margaret was not unusual. If ordinary people came here, it would have been a torment for them. However for Leylin and his group, it was only a wee bit troublesome.\\n\\n “Awooooooo!”\\n\\n The leading Seated Lupin Wolf howled, and the rest of the wolves that were being ridden by the others also howled. It wasn’t clear if these howls were due to excitement or was meant as a warning.\\n\\n With the howling of the wolves, Leylin noted that the body hairs on the Seated Lupin Wolf began to change.\\n\\n The Seated Lupin Wolves had black fur, and only the head had a touch of bright red fur. But now in the hot sunlight, the wolf’s hair color gradually faded. Finally, it completely transformed into a pale white color, then a streak of light blue lighted up from the wolf’s body. The whole piece fur turned ice blue.\\n\\n An icy breath emitted from the back of the wolf. The icy-cool feeling was very comfortable, especially in this desert.\\n\\n “It actually even knows of the uses and the difference between thermal absorption properties of light and dark colors!”\\n\\n Leylin could not help but to gasp in amazement of the adaptability of the Seated Lupin Wolf. Under the scorching rays of the sun, the ice blue fur was not affected by the heat as much as the dark fur. As for the fact that the Seated Lupin Wolf knew of these — it made Leylin feel somewhat shocked.\\n\\n Moreover, they even applied the slight use of Ice element energy particles.\\n\\n The Seated Lupin Wolf was undoubtedly the best creature to traverse the terrains of the Great Canyon Margaret!\\n\\n The six huge wolves with icy blue fur gave off a chilly sensation. They very soon proceeded on their journey along with the Magi riding on them, and stepped into the Golden Desert which was 10 times more dangerous than the Limestone Wasteland.\\n\\n Under the scorching rays, Leylin gulped down some more water.\\n\\n With his vision and the A.I. Chip’s detection, he had already discovered many dangerous creatures in the nearby desert.\\n\\n To put it bluntly, the level of danger in the Limestone Wasteland was the lowest in all of the terrains within the Great Canyon Margaret.\\n\\n A dozen days before, the journey for Leylin and the others were extremely relaxed. There was no difference from an excursion, and the dangerous creatures they met were rare.\\n\\n However, things were obviously different in here.\\n\\n With the slightest observation, Leylin already discovered many dangerous lifeforms concealed within the sand dunes.\\n\\n Six-Eyed Poison Snake, Golden Scorpion, Toxic Compound Eye Lizard were a few creatures that Leylin saw before in illustrations as they continued to appear before his eyes. There were even some grotesquely shaped creatures.\\n\\n “The energy density in the air here has even been replicated. It’s even higher than in the outside world, no wonder there are so many troublesome things!”\\n\\n Feeling the energy particles that filled the air, Leylin gasped slightly.\\n\\n “Everyone, keep your spirits raised. The dangers in the Golden Desert cannot be compared with the Limestone Wasteland!”\\n\\n The female Magus, called Lancey, shouted.\\n\\n Even without her reminder, the other Magi present had already recollected their absent-minded pace from before.\\n\\n One can loosen their guard occasionally in the Limestone Wasteland, but if they chose to do the same in the Golden Desert, they were foolish and seeking for death! Those magicians who were able to advance into a rank 1 Magus were seldom such people.\\n\\n “Awoooooo!”\\n\\n Just then, Lancey’s steed let off a howl. Its huge claws were raised and its sharp claws at tip slashed down with a cold glint of light!\\n\\n *Pat*\\n\\n Suddenly, a black scorpion with the image of an eye appeared in front of where the wolf was. It was patted down by the sharp claws of wolf as it continuously writhed its body and hissed.\\n\\n *Ka-Cha* The Seated Lupin Wolf dropped its jaws and opened its gory mouth as it placed the scorpion into its jaws. The razor sharp mandible continued to chew, bringing along the snapping sounds of the scorpion’s bones being crunched.\\n\\n “Such a life form can be settled by the Seated Lupin Wolf. However, dangerous creatures such as the Kary Vultures must be dealt by us personally!”\\n\\n Lancey slighted nudged her steed forward and said to the Magi behind her.\\n\\n “This is…”\\n\\n Where the Seated Lupin Wolf had attacked earlier, it sent a huge amount of sand flying in the air and Leylin spotted several grains of gold within it.\\n\\n He reached his hand forward and grasp a handful of gold sand in his hands.\\n\\n In the middle of the normal grains of sand, several golden grains were mixed in with it. Its weight was also heavier than the others by a large margin.\\n\\n “Golden sand?”\\n\\n Leylin looked at the gold which seemed to be alluring and was somewhat speechless.\\n\\n “Golden Desert, this here is the real Golden Desert!”\\n\\n “If it was the secular world, it will definitely cause chaos. A pity, however…”\\n\\n With a look of contempt, Leylin flung the gold sand back onto the ground.\\n\\n To magicians, only the magic crystals, the ingredients which could stimulate the spiritual force and the various advanced information was considered to be the real currency!\\n\\n As for the gold belonging the secular world, apart from its uses as an ingredient, it was no different from regular metals.\\n\\n Moreover, the Golden Desert was situated inside the Great Canyon Margaret, an area forbidden to regular humans. To traverse it also required the employment of the highly expensive Seated Lupin Wolves.\\n\\n Thinking of the cost of excavation would already frighten the kings in many dukedoms!\\n\\n Leylin only felt some pity regarding the golden sand, but he very soon regained his composure.\\n\\n The A.I. Chip’s detection had been activated by him all along as his eyes surveyed the surroundings. In the Golden Desert, one must always be on alert.\\n\\n The six giant, icy-blue wolves seemed to be six small boats in the Golden Desert as they continuously plodded on.\\n\\n After the sky gradually darkened, the temperature in the desert also dropped.\\n\\n At this moment, the Seated Lupin Wolf gave off warmth; their furs also turned back to black, as if storing the heat from day time.\\n\\n “Today, I shall stand guard during the night!”\\n\\n After Leylin had built his tent, an official Magus present among them all, said so.\\n\\n There was a total of 6 in the group. Leylin, Lancey, the old leader, and the huge bloke and two others who remained silent most of the time. The one who spoke was one of these two.\\n\\n These two Magi had grey robes on at all times, and seldom spoke. Their personality was also extremely antisocial. Up till now, Leylin managed to exchange two sentences with only one of the two.\\n\\n “We will count on you!” Lancey did not look too good, her face appeared tired as she went into her tent.\\n\\n During the day, she had used her spiritual force to scan the surroundings for any activity going on. Now, she urgently needed to rest and meditate to recover her spiritual force.\\n\\n As Leylin had the A.I. Chip to help with his tasks, his mental state was still doing fine. Yet he still put on a false impression of being weary.\\n\\n “Are you not going to rest awhile?” Leylin appeared in front of one of those official Magi and casually spoke to him.\\n\\n “I need not rest. I have these. Come out, my little babies!”\\n\\n The Magus on night duty gave a deep laughter as his pair of arms performed a strange gesture.\\n\\n *Bang* *Bang* *Bang* A layer of Earth element particles continued to emanate from his body.\\n\\n The surrounding sand rose up by a layer. After which, it was quickly broken, revealing a dozen yellow slates.\\n\\n These muddy yellow slates each had a human face on it. Some were young, some were old. They even a pair of slim arms and legs. Just like a gingerbread man.\\n\\n “Father! We await your commands!” A dozen stone slate people knelt on one knee in front of the Magus on night duty.\\n\\n “Very well, you all shall guard the night for me. You are in charge of…” The night guard Magus nodded his head and unrestrainedly began giving out orders.\\n\\n “Sentinel Slates?” Leylin was bewildered.\\n\\n These creatures were very similar to the Sentinel Slates in the database of the A.I. Chip, yet it seemed like a creature of a higher level.\\n\\n “It’s a rank 1 Sentinel Slate but they have undergone modifications from me!” The night duty Magus declared proudly.\\n\\n After becoming an official Magus, magicians will often attempt to modify and improve some rank 1 spells and even the rank 0 spells of acolytes.\\n\\n Once they were successful, it could absolutely turn into a unique trump card. Or it could be sold in exchange for a large amount of resources.\\n\\n A pity that these things and finding replacement potions were the same. Unless one was extremely lucky to chance across it, or only after undergoing a vast amount of experiments, would it be possible to see results.\\n\\n “It’s really quite a remarkable spell!” Several traces of admiration, which was just right, appeared on Leylin’s face, turning the gaze of the spell caster gentler towards him.\\n\\n “Let’s go! The Sentinel Slates originally have to use of acting as a warning. After my modification, their detection abilities can span a dozen miles…” The Magus on night duty said.\\n\\n Leylin looked at the Sentinel Slates, which, having received orders, hurriedly ran to the outer area of the camp encirclement, using the sand to conceal their own bodies.\\n\\n Along with the sand that continuously trickled down, the energy waves of the slate got smaller, finally turning into an untraceable spell. Leylin could not help but approve in silence.\\n\\n Any Magus would have their own trump card. Once they were disregarded, it would definitely be a painful experience.\\n\\n Deep in the night, Leylin who was in a light sleep heard an ear-piercing scream.\\n\\n “Hurry, get up. We have trouble!”\\n\\n The earlier Magus, who was on guard duty, went into the individual tents and his face showing utter exasperation.\\n\\n “What happened?” Lancey’s expression was the worst. There were several spots on her body where the robes were not yet arranged, as it revealed her alluring flesh. A pity nobody at the scene bothered to have another look.\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-139","bookId":1513,"book":{"id":1513,"title":"Warlock of the Magus World","description":"What happens when a scientist from a futuristic world reincarnates in a World of Magic and Knights?\\n An awesome MC — that’s what happens!\\n A scientist’s goal is to explore the secrets of the universe, and this is exactly what Leylin sets out to do when he is reincarnated. Dark, cold and calculating, he makes use of all his resources as he sets off on his adventures to meet his goal.\\n Face? Who needs that… Hmmm… that guy seems too powerful for me to take on now… I better keep a low profile for now.\\n You want me to help you? Sure… but what benefit can I get out of it? Nothing? Bye.\\n Hmmm… that guy looks like he might cause me problems in the future. Should I let him off for now and let him grow into someone that can threaten me….. Nahhh. *kill*\\n","cover":"http://cunovel.com/img/WMW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
