{"id":58717,"no":161,"title":"Chapter 161","content":"Man-made Rain “This is shocking, isn’t it?” Martin joyfully said as he walked closer. “This is the Four Seasons Garden’s four seasons secret plane, which has an overall land area of more than one hundred thousand mu, and is abundant with various types of resources… …” “One hundred thousand mu?” Leylin was extremely surprised; this was the land area of a couple countries from before he was reincarnated added up together. “Yeah, there are not only valuable objects and magical living creatures, but normal humans are in here too…” Martin pointed towards the distance at what looked like an area of small towns and villages. “We employ normal humans to help us with farming and even working at some plantations for the Magi. This proves that being well organised, well planned with training, and more highly invested human resources, we can produce even more resources…” “The entire Four Season’s secret plane is the foundation of our Four Season’s Garden, and is an unending stream of treasure!” “Building the secret plane, cultivating resources, and harvesting; these are the main resources used to furnish the white Magi’s power!” An intoxicating look flashed through Martin’s eyes. “These one hundred thousand mu of land have such a high energy concentration, and adding the special care and maintenance…” Leylin sighed, as he thought to himself in his heart. Leylin also felt that the old him was always living in the shadows of the Magus world, whereas right now, he could finally see the differing ideologies of the dark Magi. The light Magi cultivated the various plantations and animals within the secret plane, thus reaping great resources. On the other hand, the dark Magi seemed to prefer using violence to obtain these resources. “Leylin, do you know why the previous check that we went through was so stringent?” Martin asked unexpectedly. “Why? Could it be because of the fear of the dark Magi?” Leylin shared his speculations. “Yes, it’s those wretched beings!” Martin was fuming with rage when he spoke of the dark Magi. “Those bloodthirsty dark Magi always seek to profit using other people’s toils, and cannot be bothered to run their own secret plane. Instead, from time to time, they plot against our light Magi’s secret plane. The short magician who was at the side revealed the reason. “Every year, there would be a successful occasion of dark Magi raiding our secret plane! Although they took only the presently available resources, and the secret plane was able to resume production, it was still a tremendous loss... On the contrary, Leylin was surprisingly knowledgeable about the reasoning behind it. Although the dark Magi grew up in a bloody and vicious environment, it was undeniable that having grown up in such conditions, these dark Magi were more powerful than the average light Magus. In the eyes of the dark Magi, whose methods involved preying on the weak, the resources of the white Magi were a veritable gold mine. Moreover, these kinds of smaller scale battles could even be used as a way for the dark Magi to train their forces. If the white Magi had not been well organised and united, and the black Magi themselves also had flaws and trust issues, perhaps the balance of power of Magi in the entire south coast may have been altered. “Alright, I will allocate the next task!” Martin stood at the corner again and waited for all the Magi to make their way over, before giving his speech. “Our task is to clean up an area in the north division, getting rid of the insect pests and diseases within. We also have to pay attention to the disease that is affecting the grassland in the east division. Black spots have appeared on the surface of Horse Milk Grass, and we need to use the First Jacklin Potion to take care of it.” “Fire Eyes and Hakob, go to the first east division! Oak and Leylin, you two go to the second east division.” Next, Martin started to announce people’s duties. “Let’s go!” The midget Magus named Oak told Leylin. After everyone’s duties had been distributed, the Magi in the third team left the platform in groups of twos and threes. “There is still a very large distance that we need to traverse to reach the north division, but we have already arranged for a mount, and will be able to reach our destination quickly… …” It was obvious that Oak had been here a few times in the past. He brought Leylin to the edge of a building. Facing the window, he asked for 2 of the green metal plates. “The controlling device for the Dragon Crown Nighthawks?” By now, Leylin understood that the Four Seasons Garden totally controlled the secret plane. With the two piercing cries of the Nighthawks, the two Dragon Crown Nighthawks flapped their wings and flew towards the east. After flying for a distance, if one were to look at the riders from they had set off, one would only be able to see some tiny black specks. The whistling of the wind continued to sound in Leylin’s ears. Leylin sat on the wide back of the Nighthawk, sweeping his eyes over the land under him. In the secret plane, where the amount of energy particles was much denser, all types of vegetation grew very well. For as far as the eye could see, there were lush green fields, within which there were several organised patches of blue flowers that gave off a sweet scent. This was the Honey Milk Flower. Not only was it often used by acolytes as an ingredient used in Potioneering, the nectar within the flower was also a food that all beings in the Magus world enjoyed. With the use of the A.I. Chip, Leylin could see that within the sea of blue, there were several people looking like ants as they worked diligently. Beside the sea of flowers, there were several obviously man-made constructions, which seemed to have the sole purpose of watching over the flowers. “Regular humans are in charge of plants that acolytes use as ingredients. As for ingredients that the official Magi usually use, which are more precious, they are more heavily defended, and are bred in special environments that simulate the environment of the outside world.” After flying for nearly half an hour, they descended into the outskirts of a small town. “Greetings, my Lords!” At this moment, a bunch of housewives and children came out from the town, and led by a town mayor and an acolyte, they respectfully greeted Leylin and Oak. “We have definitely told you everything regarding the general events that have been taking place! This is my identity token! Bring me to the surveillance tower!” Oak handed over a badge to the acolyte. The acolyte seemed to be very old, and there were streaks of white hair behind his ears. He took the badge and traced over the surface of it with his thumb while chanting an incantation. With the incantation, a layer of white light emerged from the badge and formed an image in midair. The screen listed Leylin’s and Oak’s profiles. “Lord Leylin! Lord Oak! Please follow me!” After seeing the image and information, this acolyte seemed to heave a sigh of relief, as he led Leylin and Oak to a tall stone tower within the small town. “This is the organisation\u0027s surveillance tower. I have been taking on the role as a guard and have been maintaining the tower. Right now it is operating perfectly fine.” The acolyte opened the doors of the surveillance tower as he made his report. The surveillance tower was extremely simple, and the walls were the colour of ashen grey rocks. The first floor made up the living quarters of the acolyte, and goods such as the stones and crystals used in the maintenance of the tower were haphazardly stocked on the second floor. After going up the long flight of spiral steps, Leylin reached the highest floor of the surveillance tower. Outside the door of the highest floor, there was actually a living magic creature. It was a painting of a lizard mounted on the wall. “Give me the password!” “The great mother earth has bestowed upon us her powers!” The acolyte recited in a singsong voice. “Password confirmed!” Following the reply of the lizard, the door opened with a creak. “Even though he is only a level 3 acolyte, he’s not bad!” Leylin looked at the lizard within the painting that was still crawling and commented, before entering the room. The room at the highest level was very small. There were windows installed on the four walls, and through them, one could observe the scenery surrounding the town. “This is an apparatus that monitors the weather, and these spell formations complement the fine tuning of humidity and temperature. The controls are extremely simple, but since this is still your first time, Leylin, you can watch me first…” Oak walked towards a black apparatus. “Our initial purpose for coming here is to treat the disease that is affecting the Horse Milk Grass…” Oak pressed on the apparatus, and immediately put on a red plastic mask on his face. *Ka-Cha!* A depression appeared in the apparatus. It was the size of a thumb, which could fit a test-tube in. “First Jacklin Potion!” Oak placed several test tubes in the depression. Immediately, the green liquids water level slowly fell. “Rain!” Oak spat out the word in the ancient Byron language. At the same time, water element particles were constantly converging in his palm. The energy particles were magnified through the apparatus and were eventually expelled out of the tower. “To have used the magic of magicians to replace science and create man-made rain, this is incredible!” An intoxicated expression appeared on Leylin’s face as he thought. Any and all paths of progression would eventually converge at the same final destination. The magicians who harnessed the mysterious powers of magic in this world had nearly achieved the same feats attained in Leylin’s previous world. *Ka-Cha!* Above the small town, patches of ominous clouds gathered and seemingly grew denser by the second. *Pitter Patter!* Droplets of green rain fell from the sky. Dark clouds amassed, and the rain descended upon the grassy plains. With the onset of rain, the black spots on the surface of the Horse Milk Grass became noticeably lighter. It seemed that with the treatment contained within the rainfall, the grass could have a complete recovery “The management of the secret plane is also a skill! The method of creating rain is the simplest of all of the techniques that we use. We also need to be aware of the compatibility of the flora and the fauna. For instance, if Night Lotus Flowers and Midnight Bees are put together, not only can this raise the efficiency of the production of the Midnight Lotus Flowers, it can also increase the vitality of the Midnight Bees, and increase the chance of there being a Bee King. Furthermore, the honey made from the pollen of the Midnight Lotus Flower is also a cosmetic item highly sought after by female Magi.” Oak gave Leylin a brief introduction. Leylin’s experience in managing a secret plane was completely non-existent. Hence, he attentively recorded Oak’s words in his memory and asked questions from time to time in order to lessen his doubts “However, it’s a pity! If I am able to let the A.I. Chip manage the activities within the secret plane using science and technology, I am confident that I can increase the productivity of the secret plane by at least 20%!” After understanding the general situation within the secret plane, Leylin felt that this was a pity. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-161","bookId":1513,"book":{"id":1513,"title":"Warlock of the Magus World","description":"What happens when a scientist from a futuristic world reincarnates in a World of Magic and Knights? An awesome MC — that’s what happens! A scientist’s goal is to explore the secrets of the universe, and this is exactly what Leylin sets out to do when he is reincarnated. Dark, cold and calculating, he makes use of all his resources as he sets off on his adventures to meet his goal. Face? Who needs that… Hmmm… that guy seems too powerful for me to take on now… I better keep a low profile for now. You want me to help you? Sure… but what benefit can I get out of it? Nothing? Bye. Hmmm… that guy looks like he might cause me problems in the future. Should I let him off for now and let him grow into someone that can threaten me….. Nahhh. *kill*","cover":"http://cunovel.com/img/WMW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
