{"id":58760,"no":204,"title":"Chapter 204","content":"Marat Canyon\n Marat Canyon was located at the end of Pome Alley.\n It was a barren canyon where the area and economy were both destitute. Apart from several wretched people who lived here in extreme poverty, no other humans would bother with a place like this\n However, after the discovery that there was an entrance to a secret plane in this area, everything changed.\n Ever since one of the entrances to the Eternal River Plains’ secret plane was discovered here, Magi from every corner began to fight each other over the area.\n Eventually, the hunting and battle teams from Four Seasons Garden, with the aid of the white Magi domain, managed to repel the dark Magi forces and claim this land as theirs.\n Soon after this, unaffiliated Magi and acolytes set up a market for magic items in the surroundings.\n Four Seasons Garden’s higher-ups were well aware this place wasn’t well developed and dispatched people here. They treated this Magus Market as the center of their power and created a little town, welcoming all non-dark Magi.\n The first impression Leylin had when walking in this small town was that it had a lively atmosphere.\n “Looking for members! All of us are level 3 acolytes! We have a healer!”\n “The latest map of the secret plane for only 500 magic crystals!”\n “Walking Dragon Flower! Walking Dragon Flower that’s freshly plucked from the Eternal River Plain’s secret plane for 6000 magic crystals! This is a discounted rate!”\n “I am looking for a group to join! I’m a level 3 acolyte and have both offensive and defensive skills. I also know three healing rank 0 spells.”\n From the entrance of the little town, various stall-keepers, adventurers and official Magi were crowded together, constantly arguing over prices till they were red in the face.\n Everyone was at least an acolyte. There were no regular humans.\n The whole town was like a busy food market.\n After much effort Lelin arrived at Four Seasons Garden’s administrative area, which was located in the middle of the town.\n Compared to the chaos outside, it was much quieter inside the administrative area, which had the battle and hunting teams guarding the area.\n Leylin couldn’t help but think about the two official Magi he had seen at the entrance to the administration area.\n Getting two official Magi to stand guard obviously caused the Magi and acolytes who came here to feel immense pressure.\n Numerous Magi were chattering amongst themselves quietly as they walked by Leylin. All of them looked to be in a hurry.\n “Welcome! May I know if you’re here to do the entrance procedures? Please provide evidence that you aren’t a dark Magus, and then present 500 magic crystals. You will then have a one-time opportunity to enter!”\n Leylin came to a counter, and as soon as the personnel saw him, he quickly spoke very formally, as if he were selling tickets.\n In reality, Four Seasons Garden’s higher-ups had actually capitalized on the opportunity to enter the secret plane by selling entry permits.\n “I’m not a Magus from anywhere else. I belong to Four Seasons Garden’s Potioneering team and have been transferred here!”\n Leylin placed his token of identification on the counter.\n “Ah… My apologies, Lord Leylin!”\n The personnel took a look at the symbol and name on the token and bowed.\n “No worries!” Leylin looked at the several counters that had a long queue behind them and asked indifferently, “Have there been many magicians going in recently?”\n “A large amount have come! Once we had allowed non-affiliated magicians to enter, the Magi and acolytes who came forth to register had filled up this area… We even had to request for several of the hunting team Magi to maintain order!”\n The staff smiled wryly.\n Leylin was aware of this policy.\n Before he came here, he had taken a tour around the town and gathered information.\n Though Four Seasons Garden had taken over this entrance, the amount of magicians who came here was no small number. If they kept hogging the entrance, it was sure to trigger someone’s dissatisfaction.\n It wasn’t much if it was just acolytes, but when there were wandering official Magi involved, the situation wasn’t as easy to deal with.\n If there were dark Magi purposely inciting conflict, then this cause a catastrophe!\n Hence, the light Magi factions made a temporary agreement to become allies. They decided to open the entrance up to the public.\n All entrances that were controlled by light Magi had rules: other than dark Magi, as long as one paid up 500 magic crystals, one would have the right to enter the secret plane!\n In addition to this, there was the condition that acolytes had to give up 50% of their earnings within the secret plane to the light Magi powers guarding the entrance. Even official Magi would have a portion of their profits taken away!\n Even with these fees, magicians still flocked here.\n They unceasingly entered the secret plane and explored the areas without fear of death. There were some with good luck that managed to survive and leave the area with large amounts of resources. This attracted more acolytes to enter and risk their lives in the plane.\n While these free labourers were dying by the dozen, Four Seasons Garden was hiding in the shadows and stealing portions of their profits. They were earning a fortune from this, and on top of that, through coercion and purchases, they now had a map of almost a million mu of the plane and received precious information firsthand.\n To large light Magi organisations like the Four Seasons Garden, the resources that were currently inside the secret plane was just a small reward. What they really hankered after was the continuous production of resources that the secret plane could provide!\n Hence, with the resources as the bait, large organisations such as the Four Seasons Garden were able to attract many magicians with no affiliation to risk their lives and enter the secret plane for the resources. In exchange, they would be able to obtain more information regarding the topography and ecosystem within the secret plane.\n As for the unaffiliated magicians, even if they were aware of the manipulations and hidden agendas behind the entrance fees, as long as they walked the path of a Magus they had no choice but to enter this profitable scheme that the white Magi had established. As the saying goes, as one is willing to be hit, one is willing to beat.\n Even Leylin had no choice but to approve the deviousness of this shrewd plan.\n “I have 2 Grand Knights servants with me, they left for this place before me. Have they arrived yet?”\n Leylin asked.\n “Please wait a minute, I’ll check for you!” The staff hurriedly flipped through the thick book of records and accounting.\n “I found it, it’s only yesterday that your two Grand Knights servants brought your mount and luggage here. Also after showing us your identification token, they were allocated to district D9 no. 23!”\n The staff member bowed.\n “I will report your arrival as soon I can. Regarding your task allocation, someone else will contact and inform you in detail!”\n “En! Great!” Leylin nodded his head. After leaving a secret imprint with the staff as a proof of his arrival, he left the great hall through the back door.\n Behind the administration area was rows of orderly wooden houses.\n These houses were modelled simply, and the edges were rather rough. They looked as if their construction had been rushed.\n Within these wooden houses, one could occasionally see a few Magi and acolytes wearing Four Seasons Garden accessories.\n In the middle of these buildings, a huge platinum gate that was tens of metres tall was standing tall proudly like a mountain.\n It stood tall there like an ancient existence. On the gate were numerous runes connected together. They seemed to be alive and kept wriggling on the gate frame.\n Just the aura from the gate to the secret plane made it difficult for Leylin to breathe.\n “Is this the entrance to the Eternal River Plain\u0027s secret plane?” Leylin raised his head and surveyed this gate that seemed to be rising into the heavens, eyes full of unspeakable awe.\n The preciousness of a secret plane could be told from its entrance.\n Entrances to secrets planes comparable to that of the Spirit Slaying Sect’s plane could be easily destroyed by Leylin. The Gargamel that was as strong as a rank 2 Magus even had the terrifying power to break out of such planes!\n However, if it were here, that Gargamel might not be able to even create a crack in the gate to the Eternal River Plain’s secret plane!\n With an area of more than ten million mu, its internal structure and defences had to be unimaginably strong. Even if rank 2 or 3 Magi were to battle fiercely, the secret plane would be unaffected.\n Leylin guessed that even a rank 4 Morning Star Magus would have a hard time trying to destroy this platinum gate.\n Such a secret plane could be said to be a continental treasure! It was something that could help large organisations progress rapidly, or aid someone in taking over the world!\n After actually seeing Eternal River Plain\u0027s secret plane, Leylin finally understood how it could attract Magi from all over the south coast and even cause a Magus war.\n “Unfortunately, no Magi organisation in the south coast is confident that it can take over the whole plane. As such, the plane has to be divided.”\n Leylin sighed and turned his attention to the bottom of the large gate.\n At the lower part of the large platinum gate, twenty or so Magi wearing Four Seasons Garden attire were patrolling the area like soldiers.\n From these Magi, strong undulations from powerful elemental essence conversions of at least 50% were purposefully released!\n Their bloodlust was also very obvious. It was apparent they weren’t idiots who were taking the resources based on luck but were actually seasoned Magi warriors!\n Blue light flashed in Leylin’s eyes, and the A.I. Chip immediately scanned the several spell formations that were laid around the entrance of the secret plane. There were some defensive formations, while others were for detecting intruders.\n With such tight security, even if it was Leylin who were to try infiltrate inside, he would only end up dying.\n “What’s displayed might just be on the superficial level. There would at least be a rank 2 Magus holding fort around here!”\n Even outside Four Seasons Garden’s secret plane, there was a rank 2 Magus standing guard outside. Leylin did not think when it came to the Eternal River Plains’ secret plane, the Four Seasons Garden would be reluctant to send a rank 2 Magus as the guardian.\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-204","bookId":1513,"book":{"id":1513,"title":"Warlock of the Magus World","description":"What happens when a scientist from a futuristic world reincarnates in a World of Magic and Knights?\n An awesome MC — that’s what happens!\n A scientist’s goal is to explore the secrets of the universe, and this is exactly what Leylin sets out to do when he is reincarnated. Dark, cold and calculating, he makes use of all his resources as he sets off on his adventures to meet his goal.\n Face? Who needs that… Hmmm… that guy seems too powerful for me to take on now… I better keep a low profile for now.\n You want me to help you? Sure… but what benefit can I get out of it? Nothing? Bye.\n Hmmm… that guy looks like he might cause me problems in the future. Should I let him off for now and let him grow into someone that can threaten me….. Nahhh. *kill*\n","cover":"http://cunovel.com/img/WMW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
