{"id":58777,"no":221,"title":"Chapter 221","content":"Saving A Damsel In Distress\\n\\n Seeing herself surrounded by wild wolves, the acolyte made a decision.\\n\\n She fiercely swung her right arm backwards.\\n\\n *Ka-cha!* Her palm split open, revealing multiple white teeth, and looked like another mouth\\n\\n *Thump! Thump! Thump!*\\n\\n From the mouth on her right arm, several lumps of putrid green liquid shot out.\\n\\n “Awooooo…”\\n\\n The liquid balls hit the bodies of the wild wolves, producing large amounts of white smoke. They corroded at a very fast pace, revealing the striking red flesh and white bones of the wild wolves.\\n\\n The wolves’ attack became sluggish, and making use of this chance, the acolyte quickly recited a few incantations and added a spell that would increase her speed.\\n\\n Eventually, before the group of wolves caught up to her, this acolyte quickly burst into a layer of mist.\\n\\n After entering the mist, she heaved a huge sigh of relief.\\n\\n She looked around her.\\n\\n Around her were several official Magi and acolytes in the robes unique to Abyssal Bone Forest Academy moving about.\\n\\n ”Stop there, acolyte! The password and your token!”\\n\\n Countless black owls surrounded the acolyte, creating a huge human figure that spoke.\\n\\n ”Supreme Abyssal Bones!” The acolyte muttered lowly, and then produced a black stamp, placing it before the giant.\\n\\n “Correct!” The giant spoke, dispersing into many owls that flew away. This acolyte then took out a map and compared it with her surroundings.\\n\\n “I never thought I would go so far inside. This is a danger zone marked with three bones. Without the strength of an official Magus, it’s best to leave as soon as possible.”\\n\\n “Oh my! Such a disgusting smell! Let me guess who’s here.”\\n\\n At this point, the acolyte was stopped by a few acolytes who were preparing to leave.\\n\\n The acolyte in charge was wearing robes that indicated his status and made with exquisite materials. There was a silver necklace around his neck that gave off immense energy waves, which obviously made it a magic artifact.\\n\\n “Is there even the need to guess? This smell is just as stinky as the sewers. Besides our swine Nyssa, who else could it be?”\\n\\n The other acolytes immediately burst into laughter.\\n\\n The acolyte who had spoken walked in front of her and lifted her hood.\\n\\n Under the hood was an exceptionally ugly face.\\n\\n The top of the head was bald, and between several of the teeth were gaps. There was also a snout, and a constant stink surrounded this person.\\n\\n The acolyte who had entered the stronghold was actually from the same place as Leylin and she was his old classmate, Nyssa.\\n\\n ”Lord Lilytell!” Nyssa bowed respectfully, though her expression was stiff.\\n\\n Due to her appearance, she had been discriminated against and bullied, but most of the acolytes did not think their actions were too excessive.\\n\\n The acolyte obstructing her way was from the Lilytell family and had a whole gang escorting him. He was exceedingly arrogant and often made fun of her appearance.\\n\\n ”Hn!” The acolyte nodded indifferently, looking aloof and proud.\\n\\n “Swine Nyssa, this is not a place you should be in. Don’t let your bad smell alarm the various Lord Magi here! They are our forefathers!”\\n\\n The acolyte who had the word ‘Lilytell’ in his name covered his nostrils, looking at her in disdain.\\n\\n ”I… I’ll leave now…” Nyssa hastily retreated.\\n\\n However, as she was leaving, she accidentally tripped and revealed the red ore in her hand.\\n\\n “Hm! Wait!” That acolyte immediately stopped her. “What’s that in your hand? What is it? Take it out!”\\n\\n “No! No, it’s nothing!” Nyssa kept drawing back and tried her best to hide it, but the panic in her eyes could not be hidden so easily.\\n\\n “Bitch!”\\n\\n The acolyte cursed, and suddenly made his move. His entire right hand abruptly became bigger; the flesh bulged bit by bit, and the blue veins were prominent.\\n\\n *Thud!* A punch landed on Nyssa’s face, and her entire body was sent flying.\\n\\n While she was in midair, a red ore fell to the ground, whirling around like a spinning top.\\n\\n “A Markov Crystal? And it’s actually red?” The acolyte of the Lilytell family stared hard at the red ore, joy and greed flashing in his expression.\\n\\n “That’s mi- mine…” Seeing the greed in the acolyte’s face, Nyssa’s heart sank. However, this ore was extremely important to her since she would need it to advance, so she drummed up her courage and spoke up.\\n\\n ”Darned bitch! Even the skin on her face is so thick!”\\n\\n The acolyte who had punched her swung his arm. “This crystal was my gains from yesterday. You despicable thief, wretched thief; not only did you steal it, you even dared to claim that it’s yours!”\\n\\n The acolyte waved his arm. “Go! Grab her and send her to the academy’s enforcement team to be punished!”\\n\\n The few acolytes behind him encircled her, their intentions clear.\\n\\n Nyssa kept stepping backwards, yellow pus flowing from her eyes.\\n\\n A few acolyte bystanders remained unperturbed as they watched, and even some of the Magi looked on in the same fashion.\\n\\n That acolyte was from the Lilytell family! They were one of the three big families in Abyssal Bone Forest Academy! Many of the people in that family held important positions in the academy!\\n\\n Offending them was akin to offending the school.\\n\\n In addition, the Magi in charge of the stronghold were all people from the Lilytell family. Even if somebody else wanted to help her, there was nothing that could be done.\\n\\n Besides, Magi were a bunch of practical beings, and this was even more so for dark Magi.\\n\\n Why would they especially go against the Lilytell family for somebody like Nyssa, an ugly freak like her?\\n\\n Hence, all they could do was to give a heavy sigh and continue with their work, as if they had seen nothing.\\n\\n “Hehe! You’ve been an eyesore for far too long. Just seeing your back spoils my appetite!”\\n\\n One of the acolytes around her snickered as he grabbed forward with his right hand! A black claw suddenly appeared, scratching towards Nyssa’s face.\\n\\n “I want to smash this disgusting face to bits!”\\n\\n The acolyte roared, as if at this very moment, a sense of righteousness had possessed him.\\n\\n “No!” Nyssa blocked her face with her hands.\\n\\n *Bang!* The black claw scratched at her arm, but only a layer of skin broke.\\n\\n As the product of a failed experiment of an official Magus, Nyssa had gained a resistance to spells that ordinary acolytes did not have. Her strength had also increased, though she had no clue if this was good or bad.\\n\\n “Damn it!”\\n\\n The acolytes around her were fuming red as if they had been humiliated. They looked at each other and suddenly attacked as a group.\\n\\n Fireballs! Ice bolts! Hurricanes! All of these were thrown towards her head.\\n\\n ”Don’t- Don’t force me!” Nyssa wailed as she ran from the onslaught of magic, hands hugging her head.\\n\\n “Pu!” Thick green pus sprayed out of her mouth, right into the face of an acolyte opposite her.\\n\\n “Ah!” The facial muscles of that acolyte fell bit by bit, and he could do little but hold on to his face and roll around on the floor in pain.\\n\\n At this moment, the spiritual waves belonging to a level 3 acolyte exploded forth from Nyssa.\\n\\n “You’ve been hiding your strength, eh?” Seeing the state that his subordinate was in, the acolyte of the Lilytell family could take it no longer.\\n\\n He walked a few steps forward, a teasing grin on his face. “Once more! Attack me!”\\n\\n He arrogantly pointed at his face.\\n\\n Nyssa stepped back in response to his provocation. She was not stupid. If she dared to attack someone of the Lilytell family here, the Magi here would definitely tear her apart.\\n\\n “Haha… You don’t dare to? Then I’m going to make my move!” The acolyte laughed maniacally as he pointed a finger at Nyssa.\\n\\n “Bind!”\\n\\n From the silver necklace around his neck, countless silver threads were produced. Layer by layer they extended like a spider web and caught Nyssa inside.\\n\\n *Shua Shua!*\\n\\n Silver threads inwardly gathered, binding her inside.\\n\\n *Tsss!* Even with the modifications to Nyssa’s skin, yellow pus flowed under the tight binding of the silver threads. A look of pain appeared on her face.\\n\\n “Let’s do this together! Kill that bitch!”\\n\\n Feeling that his reputation had been sullied, this acolyte of the Lilytell family had begun to disregard the rules of the academy, wanting all schoolmates who were present to kill her!\\n\\n After all, he was a part of the Lilytell family. Even if he did something wrong, the worst punishment he would get was confinement. His family members would definitely rescue him, so what was there to fear?\\n\\n Seeing herself on the verge of being encircled once more by acolytes with the light from spells flashing in their hands, she could only hang her head sadly.\\n\\n “Am I going to die here today? Though it’s a type of release, dying in such a manner really doesn’t sit well with me…” Nyssa thought to herself.\\n\\n *Boom!*\\n\\n The sound of immense waves from magic resounded.\\n\\n Nyssa squeezed her eyes shut, but feeling no pain in her head, she raised her head in astonishment.\\n\\n Her jaw dropped in amazement.\\n\\n She could see a huge Venom Wyvern hovering around in the sky, above the stronghold’s wards.\\n\\n A black, flaming hand scooped downwards, fierce black flames immediately tearing apart a huge hole in the ward.\\n\\n “Enemy attack!”\\n\\n The owls from before appeared once more, turning into the shape of a giant.\\n\\n “Shoo!”\\n\\n A young man wearing black robes waved his arm disdainfully.\\n\\n A huge black fireball fell like a comet.\\n\\n *Boom!*\\n\\n Innumerable feathers flew, and the giant made from the owls immediately dispersed after a brief contact with the flames. Owl after owl was burnt to ashes, falling from the sky.\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-221","bookId":1513,"book":{"id":1513,"title":"Warlock of the Magus World","description":"What happens when a scientist from a futuristic world reincarnates in a World of Magic and Knights?\\n An awesome MC — that’s what happens!\\n A scientist’s goal is to explore the secrets of the universe, and this is exactly what Leylin sets out to do when he is reincarnated. Dark, cold and calculating, he makes use of all his resources as he sets off on his adventures to meet his goal.\\n Face? Who needs that… Hmmm… that guy seems too powerful for me to take on now… I better keep a low profile for now.\\n You want me to help you? Sure… but what benefit can I get out of it? Nothing? Bye.\\n Hmmm… that guy looks like he might cause me problems in the future. Should I let him off for now and let him grow into someone that can threaten me….. Nahhh. *kill*\\n","cover":"http://cunovel.com/img/WMW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
