{"id":58780,"no":224,"title":"Chapter 224","content":"Metal And Gravity\\n\\n *Rumble!*\\n\\n The world seemed to stop at this second.\\n\\n A few seconds later, the surroundings returned to normal.\\n\\n The situation just now was as if a movie was being been screened, but had suddenly malfunctioned.\\n\\n Next, a strong energy storm spread out in all directions.\\n\\n In the centre of the energy storm, black flames and silvery white rays of light constantly battled, engulfing each other.\\n\\n *Creak…*\\n\\n At the boundaries of the battle, where Marb had set up the metallic prison, the cage constantly creaked in protest of their intense fight.\\n\\n Minutes later, the frightening energy storm dissipated.\\n\\n Marb did not have a single injury on him, and even his hair was untouched. He stared straight in Leylin’s direction, grabbing at him with a single hand, “Lad! Come here!”\\n\\n Leylin’s body moved sluggishly, and this was enough time for several silver chains to lock him into place, and make his body involuntarily fly towards Marb.\\n\\n “Die!”\\n\\n Marb charged forward furiously, the spikes and blades attacking like the rain, with each spike and blade carrying a large amount of energy. Just being hit by one would cause a regular rank 1 Magus serious injuries.\\n\\n “Fallen Star Pendant!”\\n\\n Leylin bellowed, and the black scales and dark red light fused together, forming a ring of unusual light.\\n\\n *Ka-cha! Ka-cha!* His muscles swelled, and he broke the chains binding him using his brute strength.\\n\\n *Ding ding! Ding ding!*\\n\\n Silver flying needles and blades fell upon this layer of light and were then repelled, producing sparks and crisp sounds.\\n\\n “Is this all you have? You disappoint me!”\\n\\n Leylin looked to be quite disappointed, and moments later, his eyes turned amber!\\n\\n “If that’s the most you can do, then I give my apologies. You’re the one dying here today!”\\n\\n In a flash, a strange light emitted from Leylin’s eyes and headed straight into Marb’s eyes.\\n\\n The innate spell—Eyes of Petrification!\\n\\n Marb’s charging form suddenly became sluggish, and a layer of ashen stone skin spread, beginning from the corners of his eyes.\\n\\n *Weng Weng!*\\n\\n A burst of white light was produced by a talisman around Marb’s neck.\\n\\n Under the milky white shine, the stone skin on his face came loose bit by bit.\\n\\n “A talisman meant to counter against petrification? It’s quite effective. It must have been difficult to obtain!”\\n\\n Leylin’s expression did not change as he came up to Marb in a few breaths.\\n\\n The first time he had been chased after by Marb’s clone, Leylin had revealed his petrification abilities. That was how he had turned the tables on the clone, but in the process, he had also exposed his ability to petrify his opponents.\\n\\n As his archenemy, how could Marb not make preparations against that?\\n\\n However, even in ancient times, petrification was a lesser known spell. In the south coast, it was practically extinct. Talismans that could be used to negate it were scarce, and most could only be found in ancient ruins.\\n\\n Leylin was a little surprised at Marb’s ability to find one so quickly.\\n\\n However, even if Marb had a talisman, how could it be that effective against the petrification methods of an ancient creature such as the Giant Serpent Kemoyin?\\n\\n Though Marb had dispelled the petrification, he had still been slowed.\\n\\n *Shua!* Black light flashed, and in that instant, Leylin was already in front of Marb, his amber eyes meeting Marb’s.\\n\\n “Die!”\\n\\n The crimson light produced by the Fallen Star Pendant solidified into a giant axe. However, Leylin did not seem to be satisfied and pointed at the weapon.\\n\\n *Shik!*\\n\\n Immense black flames engulfed the axe.\\n\\n “Hah!” Leylin shouted, and large numbers of shadows emerged from behind him, and converged onto his body.\\n\\n From the shadows, Leylin’s tall figure suddenly shot up, and he transformed into a three metre tall giant with tanned skin.\\n\\n “Aooooo!”\\n\\n The giant roared, the muscles on his arm bulging, and showing the dark red, earthworm-like veins on his body.\\n\\n Like a deity from legends, the giant held the large axe and swung, aiming for Marb’s neck!\\n\\n *Chi!* Before the hatchet connected, the unimaginable sharpness of the heat waves and gales produced from the swing had already destroyed the defensive layer of liquid metal on his neck.\\n\\n *Ka-cha!*\\n\\n The fiery, black axe cut through Marb’s neck, and it looked as if his head was going to fall off. The black flames extended throughout his body in an instant.\\n\\n Marb’s expression was blank as he collapsed.\\n\\n “Hm?” Leylin was in a daze. This was much too easy, but even official Magi would not live if their heads were chopped off!\\n\\n [Beep! Danger! Detecting target still giving out energy waves!] The A.I. Chip sounded at this moment.\\n\\n Immediately after, a ray of snow white light appeared in front of Leylin.\\n\\n “This is bad!” All Leylin could do was to try his best to dodge, and protect the most important parts of his body.\\n\\n *Puchi!* A silvery white longsword that was giving off milky white light pierced into Leylin’s lower abdomen.\\n\\n ”Scram!”\\n\\n Both of Leylin’s hands turned crimson, and blood coloured flames blazed as he clawed down!\\n\\n ”Crimson Palm!”\\n\\n At the same time, he retreated without even glancing at Marb.\\n\\n After he managed to create some distance between them, Leylin covered the injury on his abdomen while looking at Marb in shock.\\n\\n At this moment, Marb had turned into a white metallic humanoid. His head, which was tilted, was loosely connected to his neck by a tiny amount of skin. His body was still burning with black flames, yet it was as though he didn’t feel a thing as he quietly stood there. The sword that was held by Marb was also dripping with Leylin’s blood.\\n\\n At the point of Marb’s neck where he had chopped, Leylin could see that the surface of the open wound was now all metallic, where there was no likeness to a human’s flesh and blood at all.\\n\\n ”To think that not only did he have his outer appearance protected by the liquid metal, even his internals had completed turned into metal…”\\n\\n Leylin’s heart sank.\\n\\n ”Hahah…” Marb, whose head was dangling, laughed wildly. “Bet you’d never thought of this huh? Ninety-odd years ago, I had already completely fused my body with a metallic creature, so now, I don’t have a single weak point on my body. Injuries in places that would be fatal to other regular Magi are just scratches to me…”\\n\\n “How pathetic!”\\n\\n Leylin looked at the somewhat crazed Marb with a pitiful look on his face.\\n\\n Although there were benefits to fusing with an elemental creature, by doing so, one would lose their sense of touch.\\n\\n When one’s flesh and skin turned into metal, he would not be able to enjoy the sense of touch anymore.\\n\\n Wasn’t real reason for a Magus to pursue the truth and climb to the top, to control his fate and fulfill his desires, enjoying life to the fullest?\\n\\n But now, for the sake of power, Marb had actually forsaken such a thing. So then, what more was the meaning of his pursuit?\\n\\n ”The pathetic one is you!”\\n\\n Evidently, Leylin’s look of pity had deeply triggered Marb and his deranged expression grew even more intense.\\n\\n Suddenly, a brownish yellow light flickered on Marb’s body. The silver liquid metal protruded outward, transforming into a tiny spell formation.\\n\\n “Gravity spell formation!” After having been inflicted damage several times by Leylin, Marb finally revealed the trump card that he had been holding back!\\n\\n *Weng!*\\n\\n In an instant, a huge amount of brownish yellow light began to emanate from him.\\n\\n “This is… Gravity?!” Suddenly, Leylin felt his body turned heavy as if it was being crushed by a large mountain. As it happened, Leylin recalled something.\\n\\n Around him, the gravitational force multiplied in an instant. Not only was movement difficult, Leylin’s face darkened due to the fact that even his internal organs had suffered from the gravitational pull to the point that pain had spread from his insides.\\n\\n “Not good; although my defense on the outside is strong, it’s a completely different story for my insides! If this goes on and he activates a one hundred times multiplier, my body will most likely be obliterated…”\\n\\n Leylin’s face was extremely unsightly at this point in time.\\n\\n Marb, who had a body made of metal, would not suffer any hindrances to his brain or organs.\\n\\n “Hahaha… Once more! Times ten!”\\n\\n Marb shouted, and the brownish yellow light flashed even brighter.\\n\\n Leylin’s feet sank, and the injury to his abdomen, which had undergone hemostasis, started to bleed profusely again due to the gravitational pull.\\n\\n “Hahaha… Come on!”\\n\\n Marb dashed right in front of Leylin and brandished his sword, yet Leylin could only feebly raise his right hand to deflect the blow.\\n\\n *Bang!*\\n\\n The scales on his arm were crushed and shattered, and Leylin was sent flying backwards like a cannonball.\\n\\n “Not enough! Still not enough! Times twenty!” Marb pierced the ground with both of his hands.\\n\\n In an instant, Leylin felt as if the gravitational force had increased once more. If he had felt the weight of a mountain crushing him before, now, it was the weight of three mountains!\\n\\n *Boom!*\\n\\n A huge crater was created on the ground the moment Leylin’s body landed.\\n\\n “Go to hell!” Marb’s right hand turned into a giant silver hammer.\\n\\n “Urgh! You actually restored the ancient gravity spell formation!”\\n\\n Leylin laid on his back as he smiled with a hint of admiration, “Not bad indeed!”\\n\\n This expression gave Marb a sudden yet very uneasy premonition.\\n\\n “You’re already going to die. What are you trying to act so tough for?” Marb hammered down viciously.\\n\\n “Suction spell formation! Activate!”\\n\\n Under the shadow of the large hammer, Leylin rapidly chanted a few syllables.\\n\\n *Weng!*\\n\\n A reversed ‘j’-shaped rune suddenly appeared on Leylin’s body.\\n\\n In a flash, Leylin seemed to be pulled back by a huge force and flew away from under the giant hammer, and into a distant place.\\n\\n “Trying to escape? Times thirty…”\\n\\n Watching Leylin’s retreating figure, the brownish yellow light on Marb’s body increased in brightness once more.\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-224","bookId":1513,"book":{"id":1513,"title":"Warlock of the Magus World","description":"What happens when a scientist from a futuristic world reincarnates in a World of Magic and Knights?\\n An awesome MC — that’s what happens!\\n A scientist’s goal is to explore the secrets of the universe, and this is exactly what Leylin sets out to do when he is reincarnated. Dark, cold and calculating, he makes use of all his resources as he sets off on his adventures to meet his goal.\\n Face? Who needs that… Hmmm… that guy seems too powerful for me to take on now… I better keep a low profile for now.\\n You want me to help you? Sure… but what benefit can I get out of it? Nothing? Bye.\\n Hmmm… that guy looks like he might cause me problems in the future. Should I let him off for now and let him grow into someone that can threaten me….. Nahhh. *kill*\\n","cover":"http://cunovel.com/img/WMW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
