{"id":58888,"no":332,"title":"Chapter 332","content":"Notta Highlands\n “Have you made inquiries about this already?”\n Leylin asked Celine, who was at the side.\n “Based on intel from a few close friends, the person targeting us at this joint conference is Skrill of the Eight-Clawed Spiders!” Celine smoothed her hair out, revealing her pale neck. One could also see her well-developed chest.\n “Skrill? That spider man?” Leylin turned a blind eye to Celine’s unintended seduction. The Crystal Mask that Celine trained in had a special effect, in which the Magus would unwittingly bewitch the people around them.\n This was not very effective on a semi-converted Magus, and even less so on Leylin.\n “He’s merely a semi-converted Magus. With a few helpers, you’d be able to take care of him, right?”\n Leylin glanced at Celine.\n “If it was only him, I could somewhat contend against by using some help my mentor left me, but…”\n Celine’s eyebrows showed her gloominess at this. “There seems to be another power supporting Skrill..”\n “I see!” Leylin nodded.\n “Of course, all I hope for is that my lord maintains the Nature’s Alliance’s current standing. Celine has no wish for anything more.” As if afraid Leylin would change his mind halfway through, she quickly spoke and clarified herself.\n “Don’t worry. Since I’ve already agreed, you can trust me.”\n Leylin didn’t pay any attention to whoever was working behind the scenes.\n The bloodline imprint of the Icy Jade Scorpion Emperor was completed, and once his body could adapt to the icy radiation, he could regain his strength as a rank 2 Warlock!\n A rank 2 Warlock, and especially one like Leylin with a powerful bloodline, had a strength that far exceeded that of a regular rank 2 Magus.\n Whatever Nature’s Alliance had, it wasn’t enough for a rank 2 to covet it, was it?\n “A.I. Chip! How much longer will it take until my body adapts to the icy radiation?”\n Leylin closed his eyes and asked.\n [Beep! Based on the current data on Host body, estimated time left: 56h 34min.]\n The A.I. Chip quickly gave an answer.\n “Two days later, which is after the joint conference ends?” Leylin muttered to himself and then checked his stats again.\n [Leylin Farlier. Rank 2 Warlock, Bloodline: Giant Kemoyin Serpent. Strength: 21.1, Agility: 14.4, Vitality: 27.9, Spiritual force: 79, Magic power: 79 (Magic power is in synchronisation with spiritual force).]\n After so many days of hard work and treatment using all sorts of potions, he could only draw out a small amount of his solidified spiritual force. This was not enough to break through the bottleneck of rank 1.\n This strengthened Leylin’s resolve to use the freezing innate ability. If not, who knew how much longer it would take for him to regain his strength as a rank 2 Magus!\n “After mending my sea of consciousness, my battle power will be even more powerful than it had been on the south coast since I’m no longer affected by my emotional instability…” Leylin calculated in his mind.\n “I look forward to it!”\n In the icy caves, with the Icy Jade Scorpion Emperor’s Breath, as well as its Icy Jade Scorpion’s bodies, he had thoroughly eliminated the issue of emotional instability.\n However, this was not a complete elimination. Perhaps after he advanced to a higher rank, the chaos and tyranny in his bloodline and genes would explode forth once more.\n However, with the detections by the A.I. Chip, Leylin was sure that while he was a rank 2 or even rank 3 Warlock, the emotional instability would not affect him.\n Getting rid of this issue, he now possessed all the advantages of being a warlock with an ancient bloodline with no disadvantages at all. How much more power could he display?\n When strength and intelligence were combined, there was nothing that could hinder a Warlock in a pursuit of the truth.\n “My lord, what’s on your mind?”\n Celine leaned over.\n “Nothing much!” Leylin tugged her into his lap, a hand slipping down while following the curves of her waist.\n “M-my lord, not here. Outside–there are people outside!”\n Celine blushed, rejecting Leylin’s embrace.\n Outside, Obo and Ilya outside ducked their heads in embarrassment. All the thoughts they had died down after seeing the strength that Leylin flaunted every once in a while.\n ……\n Notta Highlands. The ground in this desolate area was filled with a white quartz gravel.\n Usually, this place would be filled with creatures of the darkness, but they had now left the area.\n At the heart of the Notta Highlands, a bright ball of light that spanned for around ten metres was hanging in mid-air like a little sun, emitting light and warmth.\n Under it gathered Magi of different tribes who looked different and wore clothes of various colours.\n Even if it was just passive radiation and energy fluctuations that were emitted, the gathering of so many Magi forced the creatures to avoid them.\n After all, this was still within the eastern capital of the Twilight Zone, and not a place for the creatures to flaunt their prowess. Any Magi that was stronger than them, could exterminate all the higher ranked darkness creatures.\n However, if this was outside the Twilight Zone, where human activity was low, the situation would be reversed.\n The creatures of the darkness had an absolute advantage based on their numbers. There would even appear formidable creatures that could rival a Magus, which would encircle and annihilate Magi.\n “Lu lu!”\n Meanwhile, another horse carriage bringing a few Magi passed through. The Horned Horse pulling the carriage seemed to sense the strength of the Magi, and neighed in worry.\n The Magi merely shot a glance at this area. Upon finding out that it was a small-scaled guild, they promptly lost interest and continued along their way.\n However, there were a few Magi that exchanging glances in secret, staring at the carriage without even blinking.\n *Rattle!*\n Obo and Ilya respectfully opened the door to the carriage, bowing as they welcomed the two professors inside.\n Celine alighted first, her face unusually flushed and clothes slightly untidy. However, she soon regained her calm.\n “That’s quite a lot of Magi!”\n Leylin also descended from the carriage, scanning the area and commenting with a smile.\n He had sensed the aura of large amounts of energy while on the carriage, and now, using his naked eyes, he knew that there were at least 400 official Magi gathered here.\n This was no small number, and these were merely the representatives from various large organisations. They still had much more guards than their headquarters.\n Only Celine, whose guild was about to fall apart, would come with the full power of her guild, leaving no one behind to protect the headquarters.\n These 400 Magi seemed to intentionally cause pressure on the area, the radiation from their bodies slowly yet steadily emitting, and even causing the land here to have a different smell.\n “Four hundred nuclear reactors piled together, exposing all their strength. If this happened in my previous world, it would be a huge issue!”\n Leylin’s lips curved up in a grin.\n “But upon closer inspection, there are still some differences between Magi in the subterranean world and in the south coast.”\n Leylin observed and thought.\n As there was less light, or perhaps because they had never been under the sun for a long period of time, the Magi in Twilight Zone were paler.\n In terms of clothing style, there was a large variety. There were even some bizarre Magi who were completely naked and did not have any clothing on their skins.\n Some nature-elemental Magi advocated being in harmony with nature and felt that clothes would interfere with this process. Hence, they had this strange behaviour. Though this was not acknowledged by many Magi, this was a matter of principle, and for this reason, others could not oppose this logic.\n Leylin also found another point. These Magi did not have any distinctions such as light and dark Magi.\n Black and white robes were merely the formal attire of the Magi here. There was no special meaning.\n He saw many Magi donning black and white robes joking together, and it didn’t seem like they were going to attack each other.\n “Perhaps the distinction between light and dark Magi is a situation unique to the south coast!”\n Upon seeing this scene, Leylin’s eyes flashed.\n “My beloved Celine, it’s been about a year since we had last met, yes?”\n At this moment, an upper-class woman wearing clothing filled with gems and tassels, looking as if she were about to attend a ballroom dance party at a palace, approached them, greeting with a smile.\n “This is Mistress Sache of the Obsidian Throne guild. She’s a good friend, as well as an ally of our guild!” Celine explained in Leylin’s ear and then proceeded to press her cheek to Mistress Sache’s as a greeting.\n “Hello, Mistress Sache! This is the famed professor of our guild, Mister Leylin!” Celine introduced him to Mistress Sache.”\n “Hello!”\n Mistress Sache looked Leylin up and down, her eyes glimmering with curiosity.\n “I remember that with the conditions of your Nature’s Alliance, as well as permission of the joint conference, you could only recruit one famed professor, right? It looks like Celine is betting everything on you!”\n Leylin also observed this Mistress Sache.\n Along the journey the conference, Celine had given Leylin a simple introduction to this ally guild, the Obsidian Throne.\n Mistress Sache was very tall, and her nose was pointed. Paired with her blue eyes, she gave off a unique feeling that was similar to the European style in Leylin’s previous world.\n “I will do my best, Mistress Sache!”\n Leylin was naturally aware that though there had been precedents of finding outside help for the joint conference, things still had to go according to the rules.\n A small-scale guild like Nature’s Alliance could, at most, allow one person to vie for their ranking under the name of a famed professor.\n How did one tell which guild they were from? This was actually very simple. Just by looking at the high-grade meditation technique the Magus cultivated in would make everything clear.\n After advancing to become an official Magus, high-grade meditation techniques produced different effects that made them easy to distinguish between.\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-332","bookId":1513,"book":{"id":1513,"title":"Warlock of the Magus World","description":"What happens when a scientist from a futuristic world reincarnates in a World of Magic and Knights?\n An awesome MC — that’s what happens!\n A scientist’s goal is to explore the secrets of the universe, and this is exactly what Leylin sets out to do when he is reincarnated. Dark, cold and calculating, he makes use of all his resources as he sets off on his adventures to meet his goal.\n Face? Who needs that… Hmmm… that guy seems too powerful for me to take on now… I better keep a low profile for now.\n You want me to help you? Sure… but what benefit can I get out of it? Nothing? Bye.\n Hmmm… that guy looks like he might cause me problems in the future. Should I let him off for now and let him grow into someone that can threaten me….. Nahhh. *kill*\n","cover":"http://cunovel.com/img/WMW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
