{"id":58602,"no":46,"title":"Chapter 46","content":"Ambush\\n\\n “Based on the latest news and the A.I. Chip’s calculations, the creature sucking the blood of others might be after me!”\\n\\n “Moreover, it’s tracking me down by smell! Their numbers are unknown, but they shouldn\u0027t exceed two, or there might actually be just one!”\\n\\n Previously, Leylin got rid of his scent using the scent-masking powder and changed his appearance before he entered the city. He wanted to use the mixed scents of people to conceal his. He would then gather sufficient information about the enemy before planning a counterattack.\\n\\n Now, it seemed to have paid off pretty well.\\n\\n “What a pity! My scent-masking powder is almost used up, if not, I would have been able to leave here long ago!” Leylin surmised regretfully.\\n\\n The Subterranean Blind Worm was a rather rare ingredient used by the Magi, and its price was never cheap. Leylin had spent quite a lot to obtain a small packet of the ingredient before refining it into a scent-masking powder.\\n\\n However, he had enough for only about 3 or 4 days. Within such a short period, he could not possibly run far. Once the enemy expands the range of detection, his traces would definitely be discovered.\\n\\n “It’s better to settle this as soon as possible. If they chase me to my destination, then that wouldn\u0027t do me any good!”\\n\\n Leylin’s face became solemn.\\n\\n Even now, the effects of the powder were wearing off. He was relying more and more on the complicated mix of smells in the city to mask his scent. Alas, the unknown creatures were still able to trace him even after all he did.\\n\\n After returning to his room, Leylin casually sat on the bed and mentally called up the A.I. Chip.\\n\\n “A.I. Chip! In accordance with the news obtained during these past two days, simulate the enemy’s movement patterns, and design a plan for killing them!”\\n\\n [Beep! Establishing mission parameters, beginning simulation…...Map imported…...The Host’s battle strength imported, analysis in progress……”]\\n\\n The A.I. Chip’s icy cold and unfeeling mechanical voice intoned within his mind.\\n\\n The A.I. Chip was a tool specifically allocated to scientists in his previous world, so how could it have the intelligence or even emotions? Due to human rights concerns, they had forbidden A.I. Chips from manifesting intelligence and emotion as a core directive in its programming.\\n\\n [Simulation complete. Host kills the target but will sustain light injuries. Success rate: 67.7%]\\n\\n The A.I. Chip’s voice intoned while transmitting a large amount of information into Leylin’s mind.\\n\\n “Sustain injuries?” Leylin stroked his chin, “Are there any possibilities of killing the target unscathed?”\\n\\n [Insufficient Data! Requires more detailed information on the target!]\\n\\n “So it’s like this,” Leylin shook his head. According to the news he got from the hoodlums, the creature outside the city was already in an enraged mood and had started attacking the locals. At this rate, it would definitely charge into the city within 24 hours.\\n\\n Although there was a mutual accord among the Magi to not disrupt the lives of the regular humans, there were still some who were crazy enough to do so.\\n\\n If massive casualties resulted, and his identity was discovered, Leylin had to take responsibility for the collateral damages, aside from taking into consideration the creatures and the Magi behind them. This was a problem that he clearly did not want.\\n\\n “67.7%, this is enough for me to take my chances! I also have confidence in being able to retreat fully!” Vehemence marked Leylin’s countenance as he walked out.\\n\\n The pub’s atmosphere remained as boisterous as ever. Upon seeing Leylin, the bartender went forward and bowed, “Sir, do you have any instructions?”\\n\\n “Help me find a person……” Leylin spoke slowly and made his request.\\n\\n “No problem! Although there aren\u0027t any mercenaries of the sort in this city, there are bandits here. I can contact them on your behalf.”\\n\\n The bartender said, “By the way, Lord Roland, the city’s lord, sent men over. He wishes to meet you, sir!”\\n\\n “The city’s lord?” Leylin nodded his head. No matter where a Preparatory Knight went, they would always be warmly greeted and received by lords. If Roland were to know of Leylin’s status as an acolyte, the treatment would be even grander.\\n\\n “I have something on right now. How about we change to meeting time to the day after tomorrow?” Leylin enquired.\\n\\n “Of course!”\\n\\n “Also, the steak that you guys have here isn\u0027t bad, send a serving of it to my room tonight.” Leylin instructed once again.\\n\\n “As you wish!” The bartender smiled.\\n\\n ……\\n\\n The second day, late in the night.\\n\\n A grey robed figure appeared in the charred woodland nearby.\\n\\n “Investigate? What is there to investigate here? There aren’t any treasures here. Most likely this was caused by some careless farmer, which resulted in this area going up in a blaze!”\\n\\n The grey robed man was quite skinny. His movements, though, were rather swift as he continuously rummaged through the piles of charred wood.\\n\\n “Something isn\u0027t right! These scorch marks were not done by normal flames!” The man’s brows furrowed. His experience as a bandit made him realise something obviously wasn\u0027t right just by looking at the scorch marks.\\n\\n “This…... Seems to be the doings of mysterious entities.” The bandit’s hair stood on end. As a member of the underground activities, he had only heard of these entities in myths. These stories emphasised the most important things about them: their mysteriousness, their cold-heartedness, and that they were not to be made enemies of!\\n\\n “I’d better hurry and leave! If I knew this mission was linked to these mysterious entities, I wouldn\u0027t have accepted it even if the rewards were dozen-fold!”\\n\\n The grey robed man trembled and wanted to leave.\\n\\n “I found it. The smell of my enemy!” At this moment, a hoarse and repugnant voice sounded from behind.\\n\\n The bandit’s body shivered. He saw an abomination, the size of a child, floating in midair.\\n\\n Its body was strewn with scales in a disorderly fashion. Its face was full of warts. From time to time, its snake-like tongue hissed out.\\n\\n “I\u0027m afraid that even the devil wouldn\u0027t be as ugly as this!” The bandit thought as he jumped back by 5 metres.\\n\\n “I should have thought of this before! I have actually turned into bait!” The bandit shouted.\\n\\n “Don\u0027t think about leaving!” Doris spat its tongue out and flew above the bandit, almost immediately with just a few flaps of its wings.\\n\\n “We can talk about this! I have a lot of information on this mission’s principal!” The bandit yelled in despair.\\n\\n “Die!”\\n\\n Doris’s eyes were bloodshot. It did not care about the pleas and screams of the bandit. Immediately, it chewed on the right arm that was waving the dagger about and fed voraciously on the bandit’s blood.\\n\\n A few minutes later, only the bandit’s shrivelled corpse remained.\\n\\n “A scent lingers on his robes! That damned acolyte is definitely in the city!” Doris squinted at the silhouette of the city walls.\\n\\n * Xiu! *\\n\\n A black arrow zoomed past. A boom was heard as it went supersonic, directly piercing Doris’ chest.\\n\\n “The last of the scent-masking powder was wasted here. I even sprinkled some paralysis powder on the bandit’s body. I don\u0027t believe that this arrow won\u0027t hit its target!”\\n\\n From behind some tall shrubs, Leylin emerged wearing a leather armour and carrying the crossbow he had just used.\\n\\n “Enemy!” Doris\u0027 face twitched. Its originally repulsive face now even showed veins bulging from it. It was a sight that would definitely make children cry.\\n\\n “Even I wouldn’t have guessed that the one chasing me was the Green Tree Sprite from before! This originally beautiful creature has now turned into something like this!” Leylin was a little shocked.\\n\\n [Mutated Green Tree Sprite. Strength: 3.1, Agility: 4.3, Vitality: 3.5, Spiritual force: 5.5. Abilities unknown!] The A.I. Chip’s voice intoned the readings and situation over.\\n\\n “Its attributes were actually raised by this much! What an astonishing spell. However, its body’s unstable condition can slowly be seen on its surface. It is unlikely to survive more than half a month.” Leylin eyes flashed coldly.\\n\\n “The enemy who murdered my father and sisters! Even if Doris had to betray its soul, Doris will avenge them!”\\n\\n Doris howled as it yanked the arrow out of its chest. A puddle of green liquid gushed out of the wound.\\n\\n The green liquid quickly covered the whole chest., A plant root could be seen extending continuously and very soon the wound was suppressed.\\n\\n “Go to hell!” Doris charged at Leylin in a green blur.\\n\\n “It actually went through so much mutation that melee attacks are no longer effective?” Leylin nodded his head and snapped his fingers.\\n\\n “Pa!”\\n\\n Suddenly, a mud ball rose from the ground, blocking Doris’s path. Its contents were revealed to be crimson coloured potions.\\n\\n * Bang! * A flame rose up. The accompanying heat wave even scorched the nearby vegetation.\\n\\n The flames engulfed Doris and the crackling sound of something being barbequed was heard.\\n\\n * Hu! * A green figure emerged from the sea of flames. Its body was scorched black. It even still had the fire burning on it as it charged towards Leylin.\\n\\n [Target’s speed reduced by 67%!] Chimed the A.I. Chip.\\n\\n “It was first affected by the paralysis powder, and then injured by the explosive potions. Even if it specialises in fire resistance, it will definitely still receive damage!”\\n\\n Leylin’s face was calm. He threw away the crossbow and then drew his cross blade as he charged forward.\\n\\n “Cross Slash!” The silver cross blade shone. This time, Leylin even circulated his ignited internal Knight energy. The sharp blade reflected a glimmer of light.\\n\\n When the cross figure directly struck the Green Tree Sprite, immediately a pool of green liquid appeared.\\n\\n Doris toppled, and Leylin stopped advancing. He looked at the cross blade in his hands and his brows furrowed.\\n\\n The silver blade was already filled with bumpy spots where the various liquid from Doris’s body splashed.\\n\\n “Even its bodily fluid has a strong corrosive effect? This cross blade is ruined!” Leylin felt a little rueful. This cross blade had been taken from a noble youth while in the travelling party. It was extremely handy to use, but he never thought that it would be destroyed here.\\n\\n He threw away the cross blade. As he looked at Doris who was still trying to charge over despite the cross slash on its chest, Leylin quickly chanted an incantation.\\n\\n “Umbra’s Hand!”\\n\\n A black-coloured palm rose from Doris’ shadow. It grabbed hold of its ankles and kept them firmly on the ground.\\n\\n * Sssi Sssi! * A layer of white mist rose from the black-coloured palm.\\n\\n “Although Umbra’s Hand has a corrosive effect, it seems like, against the mutated Green Tree Sprite, it is still somewhat lacking! Leylin’s mind quickly worked out the situation.\\n\\n “I’ll use you as a guinea pig for my newly learnt spell!”\\n\\n “The sound of the azure thunder! Listen to my command! Descend to the mortal realm and strike my foes down!” (Byron Language)\\n\\n As Leylin voiced his incantation, silvery-blue lightning suddenly appeared in his hands.\\n\\n “Go!” Leylin pointed his fingers and dazzling lightning flew towards Doris in an arc.\\n\\n “Doris is not afraid of death!” At this moment, Doris stretched its hands forward, and its palm split open. From it, a tree root-like object extended out.\\n\\n * Xiu! * The tree roots entwined and assumed the shape of a bow. A brown coloured arrow was already loaded onto it.\\n\\n “Not good!” Leylin hurriedly dodged.\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-46","bookId":1513,"book":{"id":1513,"title":"Warlock of the Magus World","description":"What happens when a scientist from a futuristic world reincarnates in a World of Magic and Knights?\\n An awesome MC — that’s what happens!\\n A scientist’s goal is to explore the secrets of the universe, and this is exactly what Leylin sets out to do when he is reincarnated. Dark, cold and calculating, he makes use of all his resources as he sets off on his adventures to meet his goal.\\n Face? Who needs that… Hmmm… that guy seems too powerful for me to take on now… I better keep a low profile for now.\\n You want me to help you? Sure… but what benefit can I get out of it? Nothing? Bye.\\n Hmmm… that guy looks like he might cause me problems in the future. Should I let him off for now and let him grow into someone that can threaten me….. Nahhh. *kill*\\n","cover":"http://cunovel.com/img/WMW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
