{"id":58612,"no":56,"title":"Chapter 56","content":"A Visit A golden object arced, flashing in the light, and landed in the arms of the bald trader. \"Take this; it\u0027s the commission that you deserve,\" Leylin said \"Many thanks for your conferment, most respected Young Master!\" The baldy hurriedly bowed. \"Next, I need a housekeeper and two people who can keep accounts well! If you\u0027re able to find them for me, this gold coin is yours!\" Leylin flicked a gold coin on his hand. \"Let me think! Let me think!\" Seeing that it was another gold coin waving its hand at him, the baldy suddenly became lively. He began muttering incoherently while grabbing his bald head and racking his brains. \"That\u0027s right! Old Welker! Old Welker was a housekeeper for a Baron before. Recently, He has been saying that he wants to come out again to make a living!\" The bald trader said. \"Very good! Bring me to him!\" Leylin nodded his head approvingly. Two days later, in the morning. While the mist still had not completely dissipated, there was still some frostiness lingering in the cold morning air. * Creak! * Roran City gates opened slowly, and a horse carriage emerged from between them. A dozen odd mercenaries, wearing broken armour and carrying metal spears and bows, escorted a large horse carriage as it slowly left the city. In front of the horse carriage, Fayern was leading a brown colored handsome steed. Behind him was a 20-year-old mercenary carrying a red-coloured flag. On it was embroidered the image of a hawk; the insignia of the Roran Hawks mercenary group. Greem rode close to the horse carriage having given up the driver seat. The person who sat there instead was a white-haired geezer. Although he faced the wind and his hair was blown about wildly, his clothes were impeccable and without any creases. He was the housekeeper that Leylin got-- Old Welker. Earlier, the Baron he served had gone bankrupt, hence, he became jobless. He was in the same boat as the bald trader who visited him and joined Leylin\u0027s party. Going from Roran City to Extreme Night City only required 7 days. Roran Hawks mercenary group was worthy of Fayern\u0027s praise. They were extremely familiar with the route and could even find lodging along the way, saving them from the hassle of setting up camp. 7 days later, the group safely arrived at Extreme Night City. Leylin lifted open the hanging screen on the horse carriage and saw that the clouds ahead were rather dark. The layers of cloud were crowded together, completely blocking any sunrays. It seemed that it would rain soon. There was also a shadow cast on the surrounding bushes and grasses, which made it look very gloomy. \"Fayern!\" Leylin walked out of the horse carriage\u0027s door, \"Didn\u0027t you say that Extreme Night City has a large area of vegetation that withered? Which area was that?\" \"Young Master!\" Fayern grasped the reins firmly and reduced the pace of the horses to match the pace of the horse carriage. \"Extreme Night City is enormous. These mysterious happenings only belong to a small portion in the eastern part. Normally, we try our best to detour around that area. After all, humans have also done their best to avoid danger......\" \"Where is that forest?\" Leylin leaned against the side of the door as if he was enjoying the scenery. \"The eastern part of Dark Night Woods is closer to the core of the city!\" Fayern looked at Leylin and he lowered his voice and said, \"Dark Night Woods had an abundance of certain herbs. Ever since the withering event, however, the supply of herbs in Extreme Night City has decreased by 30%!\" \"Is that so?\" Leylin smiled. Extreme Night City was considered a large city in Eastwoods Province and one of the pillars of its economy was the herb industry. Now, it seemed that most likely the City\u0027s Lord and his officers were worried about the situation. \"Dark Night Woods? I\u0027ll remember it!\" Although the woods in the kingdom were rather dangerous, this was only true for normal humans. Leylin even traversed his academy\u0027s Abyssal Bone Forest, so naturally he was not worried about the present dangers. \"Did any of the herb gatherers disappear in the withering zone?\" Leylin asked suddenly. \"Herb gatherers? You mean various hired hands, bandits, and adventurers?\" Fayern shrugged his shoulders, \"The woods are full of dangers, and a few people dying is very normal, so who knows?\" As the two conversed, the horse carriage slowly approached Extreme Night City. The city walls were not very high, yet they were extremely thick. It seemed to be made by piling granite rocks, and was extremely sturdy. The guard at the city gates recognised Fayern and allowed the horse carriage to enter after payment of the toll fee. \"Let\u0027s find lodging first!\" Leylin ordered briefly. ...... Night approached, and Leylin sent Anna, who was serving him, away and stayed alone in the inn\u0027s room. Opening the window, a cold gust of air blew in. The outside was extremely dark, and there were few lighted lamps. Leylin closed the door and took out a blue coloured crystal ball from the sack he carried at all times. This crystal ball was extremely small and let off a strange glow. In the centre of the glass were many golden specks of light that continuously rove about like little fireflies. \"Activate!\" Leylin muttered an incantation. The specks in the crystal ball started to shift about until finally forming a strange symbol. This symbol was rather curvy and swirled continuously. It finally looked like an eye that was bloodshot. Leylin\u0027s expression was extremely solemn. First, he turned the symbol towards his face allowing his somewhat skinny face to be reflected onto the crystal ball. \"Shadow Calendar, Year 1032, Month of the severe cold, Day of the ravens weeping.\" Leylin enunciated slowly in an extremely distinct voice. \"Today, I have arrived at Extreme Night City and am currently residing at Hoof\u0027s Inn.\" Leylin turned the crystal ball so the surroundings were reflected into the symbol inside. He then walked over to the windowsill and soaked up the imagery outside. \"Currently, news has it that the withering area belongs to the east area, Dark Night Woods. As of this recording, there have been no reports of any member\u0027s death. Tomorrow I will prepare to set off and enquire, maybe gather new information.\" \"The above-mentioned records are by level 2 acolyte, Leylin Farlier!\" After he finished speaking, Leylin wiped the crystal ball with his pale white fingers. *Hehe! Hehe!* From within the crystal ball came a strange sound, like a kid\u0027s laughter. Following which, the eye symbol flickered and disappeared, turning back into countless golden specks of light The crystal ball was given by the academy to Leylin to be used as proof of having undertaken the mission. The crystal ball was able to record a few scenes and voices. All that Leylin had to do was to record every important event during the mission. He could then hand it over as proof upon returning to the academy. Of course, the crystal ball\u0027s controlling right was with Leylin. As long as he did not want to activate it, the crystal ball would not be able to record anything without his magical support. This was why Abyssal Bone Forest Academy dared to allow their acolytes to go out on long-term missions without fear of being duped. \"From Fayern\u0027s description, the withering danger zone is not that huge. I\u0027m afraid that it could either be some tree demons or organisms that feed on humans. A level 2 acolyte would be more than enough to deal with them!\" Leylin weighed things carefully, \"I don\u0027t have to be that frantic, I still have over two years! I should first send some mercenaries over to have a look......\" \"The most important thing at hand now is to settle down here. Moreover, I have to visit a \u0027friend\u0027...... Leylin\u0027s lips curved into a mysterious smile. Although the location of Extreme Night City was rather remote, it was close to a few Magi resource points. There was even a magic crystal mine nearby that was being excavated. Of course, the resources were already exhausted, but they still attracted a good number of wandering Magi and small families. It even gave rise to a small scale Magus market and was indicated on the map Bicky gave. Moreover, within the short span of time, while they were entering the city, the A.I. Chip had already picked out several energy waves emitted by other acolytes. It seems that there were quite a few acolytes living in this city. This was extremely normal, as wandering magicians or those who were reclusive preferred remote towns to settle in, and to better conceal their identities. Of course, due to having longer lifespans, appearance and radiation emissions, they cannot stay in the same area for long, often changing locations after a few years. While Leylin was thinking thus, he yelled, \"Anna!\" \"Young Master, what are your instructions!\" Not long after, Anna entered wearing a beautiful red dress. As she curtseyed, her snow white calves were revealed. \"Prepare a gift; I want to pay someone a visit tomorrow!\" \"As to the specifics, Welker will tell you!\" Leylin yawned and stated blandly. After dismissing the somewhat disappointed Anna, Leylin casually set up an energy particle array as an early warning device before he blew out the candles and entered dreamland. The next morning, Leylin left with Anna who brought along a beautiful hat. \"Is this the gift that Old Welker picked?\" Leylin took the cap and gave it a once-over, realising that it was made of beast hide. It was very smooth to the touch, and there was also a feather stuck on it. \"Housekeeper Welker said that in Extreme Night City, Sticking the Night Hawk\u0027s feather on a leather cap represents peaceful intent and friendliness. It is the gift of choice when paying a visit for the first time!\" Anna put on a rather frightened expression. \"Young......Young Master! Are you going to visit another \u0027Sire\u0027?\" Anna\u0027s voice became somewhat shaky. \"Yes! He is also an acolyte!\" Leylin lowered his voice so that it was only audible to Anna and himself. After he spoke, he saw the young girl\u0027s shoulder trembled. Leylin smiled, Anna was sold to a Magus before she was resold as a slave. It seemed to have been a traumatic experience for her. \"If you\u0027re afraid, you can always go back first!\" Leylin moved forward and embraced Anna\u0027s slender waist. \"No! Anna wants to go together with Young Master!\" Anna forced herself to smile. Leylin shook his head, \"Follow me if you want to!\" Extreme Night City\u0027s construction was somewhat gothic with sharp spikes on the roof tops. The pavements were also layered with smooth rocks giving the impression that Extreme Night City was one of the wealthier cities around. As Leylin and Anna neared the eastern side of the city, the people\u0027s outfits here became much more urbane than that of other places and the decorations on the buildings became more gorgeous too. \"It seems like the east of Extreme Night City is where the nobles and scholars congregate.\" Leylin looked at the clusters of flowers on both sides of the road. There was even an outdoor fountain. He could not help but smile as he said to Anna. Afterward, the two of them came to a white-coloured two storey villa. On the door plate was hung, \"Cecelia Main Street, 59\". Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-56","bookId":1513,"book":{"id":1513,"title":"Warlock of the Magus World","description":"What happens when a scientist from a futuristic world reincarnates in a World of Magic and Knights? An awesome MC — that’s what happens! A scientist’s goal is to explore the secrets of the universe, and this is exactly what Leylin sets out to do when he is reincarnated. Dark, cold and calculating, he makes use of all his resources as he sets off on his adventures to meet his goal. Face? Who needs that… Hmmm… that guy seems too powerful for me to take on now… I better keep a low profile for now. You want me to help you? Sure… but what benefit can I get out of it? Nothing? Bye. Hmmm… that guy looks like he might cause me problems in the future. Should I let him off for now and let him grow into someone that can threaten me….. Nahhh. *kill*","cover":"http://cunovel.com/img/WMW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
