{"id":59134,"no":578,"title":"Chapter 578","content":"Return Zegna was a Radiant Moon Magus after all. Even if he was enraged, it would only be for a short period of time. “The key now is to deal with this Leylin Farlier! I have a feeling that he’ll hinder my advancement to Breaking Dawn.” Zegna looked fierce as he muttered softly. “Oh? Has he risen to rank 5? Bloodline shackles aren’t so easily broken.” The woman’s voice now held a trace of curiosity, her interest in Leylin having been piqued. “He didn’t break through, but he’s reached the peak of Morning Star. With some strange techniques from the Lava World and other methods, I’m afraid…” Zegna wore a sour look. He had to acknowledge that Leylin really was a genius seen once in thousands of years. He had gained such strength even with the low-levelled bloodline of the Giant Kemoyin Serpent and its inheritance. Now, even if his main body were to act, defeating him wouldn’t be a problem but it was just a dream if he wanted to kill him. That was, unless he could find his opponent’s weak point. He would then have to wage a life-and-death battle. But was that possible? Zegna recalled the intel on Leylin and gave up on that. He knew that, to some level, they were the same type of person, and would not risk their lives for anyone or anything. Enemies who were powerful and lacked any weaknesses that could be exploited were the most frightening! Zegna rubbed his forehead, feeling a headache coming. After being silent for a while, the female spoke again, “In that case, let’s engage our previous plan. How about it…” “Do you mean…” Zegna’s eyes brightened. …… “Finally home!” At Phosphorescence Swamp, Gilbert and Emma stood behind Leylin, watching the familiar surroundings with eyes full of an indescribable fondness and emotion. “What should we do next?” Gilbert asked. Emma glanced at Leylin. They were now treating Leylin as their main pillar of strength. After witnessing Leylin’s strength, the two Warlocks would not protest even if Leylin used them as mere figureheads. With the yielding of these two Morning Star Warlocks, the real power of the Ouroboros Clan now completely lay in Leylin’s hands, and his authority was even more solid than before he had left. Such a result would cause anyone to be astonished. “We don’t have to do anything, just maintain our current stance!” Leylin shook his head. “Leylin, have you risen to rank 5?” Fervent hope could be seen in Emma’s expression. In her eyes, if Leylin could break through to rank 5 and had a method of circumventing the issue of bloodline shackles, that would be the best. “How’s that possible?” Leylin smiled wryly. “I’m only at the peak of Morning Star and only have a few cards up my sleeves!” This was the truth. Leylin was quite exact when it came to evaluation of his strength, and while he’d seemed invincible in the Lava World as he defeated Scarlet Eye and even obliterated Zegna’s clone, he was aware of his own situation. Scarlet Eye’s main body had been gravely injured in the battle before, and had also been constrained by his technique. That was he had been unlucky enough to be defeated. And when it came to Zegna, not only was it just a clone but it had also been seriously injured in his fight with Scarlet Eye. Faced up against Leylin’s all-out Morning Star Arcane Art, his Kemoyin Serpent Transformation, it could do nothing. When Scarlet Eye and Archibald looked like they were about to cooperate, Leylin rushed to escape, because he knew he would meet his death if he did not leave at that moment. However, Leylin would not belittle himself either. With his current strength, he might not win against a rank 5 Radiant Moon, but he had a large chance of survival. “Just a few cards up your sleeve?” Hearing his words, Gilbert and Emma rolled their eyes inwardly. Those frightening black flames and the strange Kemoyin Serpent Transformation were ‘a few cards up his sleeve’? What did that make them? From the beginning, they had only stood at the side like cheerleaders, unable to make any moves. “But our Ouroboros Clan is now unafraid of external threats, and can start a new journey!” Leylin beamed as he gazed at the sun, the golden rays wrapped around him in radiance. There were few in the central continent who were unafraid of Radiant Moons. Those rank 5 Magi would not want to provoke an enemy that could contend against them. Hence, with the Ouroboros Clan in Leylin’s hands, they were definitely going to expand well. Emma and Gilbert were aware of this fact, and their gazes towards Leylin were full of hope... “Your Graces, Gilbert and Emma, it is the fortune of our Warlock Union that the two of you could return safely!” Within the headquarters, Leylin and the other Giant Kemoyin Serpent Warlocks were in discussion with Paul, Philip and the helpers they had called over. The Crystal Phase Warlock, Freya, stood respectfully behind these few Morning Star Warlocks, her eyes full of indescribable emotion. Though even the First Elder’s side had smiles on their faces, they could not conceal the sorrow in their hearts. Leylin’s abrupt rise to power, as well as the return of the other two Kemoyin dukes meant that they would lose a large portion of their benefits. There was no Morning Star who would support them anymore. Of course, there were few Warlocks with this mindset. The students and clansmen of Gilbert and Emma were now full of glee, and extremely grateful to Leylin. Due to her relationship with Leylin, Freya was wedged between Leylin and Emma. Her eyes glanced past Leylin, Emma and Gilbert occasionally, and she came to a conclusion that made her gasp. ‘Mentor Emma and Duke Gilbert are now letting Leylin call the shots!’ Though Leylin was a newly-advanced Morning Star, he was the one taking charge of receiving all these Morning Star Warlocks, and he was even seated right in the middle in the Master’s seat. Freya, who had astutely discovered this, was astonished. This meant that even Emma and Gilbert acknowledged Leylin’s rule! For some reason, Freya sighed with relief as she found this out, even though her seniors and juniors were unwilling and perplexed. She was Emma’s student and they were on very good terms, but that still lost out to her relationship with Leylin. If the two began to vie for strength, she really had no clue about where she would stand. Now, however, all was solved! Freya sneaked a peek at her husband, the reverence in her eyes unable to be hidden. Seeing his wife adopting a childlike behaviour, Leylin laughed inwardly. If Gilbert and Emma did not know how to act even after he displayed his strength that was comparable to rank 5s, he would probably have to employ certain other techniques. However, Morning Stars were no fools. Gilbert and Emma especially understood the situation, which made things easier for him. “Yes! When we first found out the two of you were lost in another world, we were extremely shocked. Next was the battle with the allied forces, but thanks to Leylin…” Regardless of the Crystal Phase Magi’s thoughts, the Morning Star Warlocks discussed amongst themselves. Philip was observing Leylin, but could not make sense of his sitting at the master’s seat. He glanced at Gilbert and Emma, and could not help but sigh. The magnitude of the events in the past few years had exceeded that in the past few centuries. Under crisis after crisis, many Morning Star powers in the continent had gone through a round of reshuffling. Spirit Circle and Wind Wolf Lair had lost most of their Morning Star forces in the Scarlet Ruins, and now only had one Morning Star maintaining their organisation each. Their losses were massive. The Ouroboros Clan had been on the brink of destruction, but a terrifying genius had suddenly appeared and successfully saved two of the dukes. Now, their strength had not diminished, and was instead increased. ‘I’m afraid the situation of our three organisations in the alliance with equal power will be broken. In the next hundreds of years, Duke Leylin of the Ouroboros Clan will be calling the shots..’ Philip watched Leylin whose aura was even more profound than that of the previous First Kemoyin elder, and a thought rose in his mind. ‘Whatever it is, our Wind Wolf Lair had been on good terms with the Ouroboros Clan, and my personal relationship with Leylin is more solid than his with Paul. As long as I stay cautious, nothing will happen. With Leylin as an external support, I’ll be able to protect my Wind Wolf Lair until the next generation grows up…’ Philip might be hot-headed, but he was no fool. Having understood this, he treated Leylin with more respect, and this attitude left Paul rather annoyed. “Alright! Based on the contract in the Morning Star area, here are your rewards!” With a wave of his arms, three streaks of light shot towards Paul and the other Morning Star Warlocks, black light shining on a spatial item. After Paul and the others used their soul force and checked, looks of satisfaction appeared on their faces. “The Ouroboros Clan being safe is all thanks to all of you, and you’ve chased away a few people. Hence, I’m giving you thirty percent more on top of the promised rewards.” Leylin’s smile was very gentle. It was like a breath of fresh air for Paul and the others. This was obviously feigned, but when feigned by Leylin who had a rather unique status, he seemed more amiable and mysterious. Paul and the rest were solemn, but their facial expressions displayed their thanks, and seemed touched. Leylin shook his head inwardly, though the smile on his face remained, “Also, our Ouroboros Clan is planning to launch a war campaign and retrieve our lost territory. Please bear witness to it!” Upon hearing Leylin’s words, the Morning Star Warlocks all carried different expressions. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-578","bookId":1513,"book":{"id":1513,"title":"Warlock of the Magus World","description":"What happens when a scientist from a futuristic world reincarnates in a World of Magic and Knights? An awesome MC — that’s what happens! A scientist’s goal is to explore the secrets of the universe, and this is exactly what Leylin sets out to do when he is reincarnated. Dark, cold and calculating, he makes use of all his resources as he sets off on his adventures to meet his goal. Face? Who needs that… Hmmm… that guy seems too powerful for me to take on now… I better keep a low profile for now. You want me to help you? Sure… but what benefit can I get out of it? Nothing? Bye. Hmmm… that guy looks like he might cause me problems in the future. Should I let him off for now and let him grow into someone that can threaten me….. Nahhh. *kill*","cover":"http://cunovel.com/img/WMW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
