{"id":59188,"no":632,"title":"Chapter 632","content":"Plotting and Reconnaissance “Test my ability?” Leylin sneered, “If it’s true, I’ll slaughter you and imprison your soul, having it burn for a million years.” The coldness in his voice seemed to drop the ambient temperature. “Haha… I’m just joking with you! It was definitely an accident!” Melinda’s voice had once again switched to that of a sweet little girl, “Anyway, I prepared a gift to make up for my dear brother’s loss. Open up the astral gate.” “A gift?” Leylin furrowed his brows, but soon arrived at his astral laboratory and opened up his gate. Flame-like blue light gathered together to form a passageway. Leylin was very cautious about Melinda. The astral stone energy that was inputted and the spell patterns only allowed for the transfer of non-living objects. If there was any invasion of external force or spiritual force, he would shut the passageway immediately. However, Melinda seemed to have been honest this time, and a black cube was sent through the gate. In spite of the high energy consumption, this was a popular way of transferring parcels in the central continent, especially among the Morning Stars of the Warlock Union. There were numerous seals on top of this black box. At first glance, there seemed to be an ice elemental rune that kept whatever was inside fresh. Leylin blew at it, and the rune on the surface of that black box split apart. The box then opened on its own, revealing its contents. A stench of blood immediately spread around the room. “Urgh? What happened to this Magus?” Inside the box was the head of a Magus! Worse still, Leylin was very familiar with him! It was the leader of the Magi who’d attacked him in Twilight Zone! This was the Full Moon Magus who’d escaped from his attack! “It’s not just the face. The soul fluctuations match as well,” Leylin nodded after a check by the A.I. Chip. It was pretty easy for any Magus to counterfeit a fake body part like the one before Leylin, but the lingering aura of the soul and the strong resentment were hard to fake. “Hehe...What do you think about this? His name is Marriott, the top lackey of the Blazing Flame Monarch! It took me great effort to get rid of him while the Blazing Flame Monarch was away. So, dear brother, are you satisfied with the surprise?” “Of course! I’m more than satisfied!” Leylin’s hand made a gesture and the head of Marriott floated into the air, the resentment on his face evident and the level of hatred accumulated beyond what words could describe. Dark Magi could often extract memories and information from a fresh brain; despite being a Radiant Moon Magus, Marriott was still subjected to such means. “This gift is definitely something more than just a surprise... ” To be able to kill a Full Moon Magus, she was surely no less powerful than a Breaking Dawn Monarch. Leylin had long understood that she could not be underestimated, having become a Radiant Moon right at rebirth. Even though Marriott had been severely injured by Leylin before he got killed, he could not deny the fact that she was incredibly powerful. “I have to admit that you’re good enough to work with me!” Huge black flames shot out of Leylin’s palm, and Marriott\u0027s head slowly melted under the heat until there was nothing left. “Hehe! You’re the bes— Umm, hold on for a sec; she’s coming out!” The little girl’s voice turned mature once more, “Hello there, young Magus. We meet again.” ‘You freak! Here’s another one with a split personality,’ Leylin rolled his eyes in secret. “Let’s get straight to the topic, why do you want me?” “To get rid of the Blazing Flame Monarch. Are you interested?” The female Magus was frank and straightforward. This time, though, Leylin did not beat around the bush as he had before, “Yes, but we aren’t strong enough!” “I know the Blazing Flame Monarch’s weakness, as well as when he’ll be at his weakest. I’ve also roped in a few other friends…” Melinda sounded very confident, evidently having an extraordinary understanding of the Monarch as well as great amounts of intel on him. “In that case, why look for me? Wayde and Offa should be rather interested in this as well, right?” Leylin stated his query. “It’s because you’re the most powerful Warlock in the Warlock Union. Furthermore, after the fall of the Blazing Flame Monarch, the fewer the participants the greater the benefits. If more people come and share the profits, it’d be such a shame… “On top of that, those rotten old bloodline Warlocks only focus on the Warlock who’s inherited a bloodline from a rank 6 being, which is just inflexible and shortsighted of them…” Melinda seemed to have issues with the rank 5 Warlocks in the Warlock Union. “You can inform them of our operation of course, but I am sure they won’t be interested. Even if you get them to come, you won’t get any extra for it… This communication channel is extremely secure, so there’s no need to be worried about eavesdropping or anything. I’ll hand over this method later, so let’s keep in contact in the future!” Having said this, Melinda broke off the connection, leaving Leylin behind in deep thought. A long while later, Leylin touched his chin, “It seems like Melinda’s true identity shouldn’t be simple, she might have a deep relationship with the Blazing Flame Monarch!” In reality, Leylin was in favour of Melinda’s methods. From the memories he extracted from Marriott’s head, Leylin himself had acquired a lot of information and intel. At the very least, him chasing Leylin to Twilight Zone and attacking him there was confirmed to be by order of the Monarch. With Leylin’s temper, he would viciously fight back in answer. However, it was impossible to accede to Melinda’s requests. Even if she suddenly became benevolent and did not try to backstab him, she would definitely possess most of the benefits. Leylin had no desire to tussle with a Breaking Dawn only to end up with nothing. It was very important to first conduct a few probes and rope in many people. Other Magi might think Leylin and Melinda were lunatics, lacking the calm and rational judgement typical to Magi. It was a joke for two Radiant Moons to even think of causing the fall of a Breaking Dawn Magus! In reality, however, Leylin and Melinda were extremely confident in their own abilities, and could not be compared to regular Radiant Moons. However, at their cool appearance, an underlying fervent desire coursed through them. They both shared a common goal in seeking revenge, hence the formation of this paper thin alliance. ‘Who else did Melinda find though?’ Leylin had his doubts, ‘There are at most over twenty Radiant Moon Magi in the central continent, with five in our Warlock Union. Those who came up by themselves like Zegna are extremely rare, and most are subservient to other Monarchs… Could Melinda be thinking of convincing some other Monarchs?’ There weren’t that many Radiant Moon Magi in the central continent, and even if there were hidden Magi in large organisations, Leylin estimated that there definitely wouldn’t be more than thirty. He had eliminated two Radiant Moons who worked under the Blazing Flame Monarch. Along with Marriott, who Melinda had brought him, perhaps the Monarch no longer had any subordinates of great power, having to come attack Leylin himself. This possibility was very likely. Perhaps there wasn’t even a single Radiant Moon under the Blazing Flame Monarch now. And now, he probably held a deep-seated hatred towards the main causes of such a disaster, Leylin and Melinda. If not for the Morning Star Area being renowned for having fended off Breaking Dawn Magi before, he would likely have rushed over long ago. As for Melinda? This woman was just too mysterious, and she might even have more trump cards than Leylin and definitely had aces up her sleeve. Leylin wouldn’t bother worrying about her safety. “I heard from her that after eliminating the Blazing Flame Monarch, I can get some amazing benefits…” Leylin’s pupils shone with light from the A.I. Chip as large numbers of images and scenes flashed in front of him. The A.I. Chip’s processor had been stretched to the limit, and it had begun operations. ‘Her words are very credible. In that case, I won’t need to invite Wayde and the rest. Of course, I can still get the Warlock Union to gather intel and stuff like that.’ Leylin made up his mind. It was not just the Warlock Union. Leylin was already preparing to command the Kemoyin Warlocks in the Ouroboros Clan to expend all effort on finding news regarding the Blazing Flame Monarch, especially anything that had to do with Melinda. He had a feeling that the relationship between the two was definitely not as simple as it seemed, and perhaps when the truth was revealed at the end, everyone would be shocked. However, rather than gathering information, Leylin was more focused on the information she had leaked. “So there’s a Warlock in the union whose bloodline has reached rank 6?” Leylin’s eyes began to flicker with intelligence, “It should be that Radiant Moon Warlock who hasn’t shown himself yet…” Even though his Kemoyin bloodline had risen to that of a Kemoyin Emperor, his bloodline was still at rank 5, a level lower than a rank 6 bloodline. Such a person would only encounter bloodline shackles at the end of rank 6, which was much better when compared to a Warlock like Leylin. Of course, before a rank 6 bloodline appeared, Warlocks with rank 5 bloodlines could be said to be regal amongst Warlocks, and they were the ones who had been supporting the Warlock Union. The inheritor of a rank 6 bloodline was their hope, someone who could cross over into Breaking Dawn and become a Monarch of bloodlines. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-632","bookId":1513,"book":{"id":1513,"title":"Warlock of the Magus World","description":"What happens when a scientist from a futuristic world reincarnates in a World of Magic and Knights? An awesome MC — that’s what happens! A scientist’s goal is to explore the secrets of the universe, and this is exactly what Leylin sets out to do when he is reincarnated. Dark, cold and calculating, he makes use of all his resources as he sets off on his adventures to meet his goal. Face? Who needs that… Hmmm… that guy seems too powerful for me to take on now… I better keep a low profile for now. You want me to help you? Sure… but what benefit can I get out of it? Nothing? Bye. Hmmm… that guy looks like he might cause me problems in the future. Should I let him off for now and let him grow into someone that can threaten me….. Nahhh. *kill*","cover":"http://cunovel.com/img/WMW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
