{"id":59201,"no":645,"title":"Chapter 645","content":"Spider and Breakage \\n\\n After all, if the astral laboratory was destroyed, not only would he lose his channel to Dreamscape, he would be trapped here, forever.\\n\\n ‘‘Impossible! I set up a concealing technique and spell formation before leaving. I even left behind…’’\\n\\n Leylin’s mind began to work rapidly. He was confident in his setup, but the warning from the A.I. Chip definitely wasn’t false.\\n\\n ‘Could it be some kind of unique creature that can see through my illusory spell formation? Or… is it demons?’ The possibility instantly turned Leylin gloomy. He suddenly sped up, coming to the area where his laboratory was…\\n\\n But the scene that came into his vision made Leylin’s eyes widen gradually. “This…”\\n\\n In his sight was a huge spider the size of a tall mountain, spitting out threads that wrapped up the entire laboratory.\\n\\n The runes around the laboratory flickered continuously, rippling with a dazzling lustre. The defensive layer and spider web depleted each other.\\n\\n On the spider’s abdomens were large numbers of patterns, coming together to form a distorted male face. A whimpering sound echoed from its wide open maw.\\n\\n [Warning! Warning! Formation genie energy reserves at less than 10%, approaching critical value. Immediate countermeasures recommended!] the A.I. Chip’s red warning window shot out again.\\n\\n “Is it possible to scan the opponent?” Leylin quickly asked.\\n\\n [Mission established, attempting to scan. Beginning to break through opponent’s force field.]\\n\\n *Chik Chik!* Even as the A.I. Chip sounded out mechanically, the huge spider in mid-air seemed to be provoked by something. Its compound eyes turned, aiming directly at Leylin.\\n\\n A forceful scan would release a feeling of a malicious invasion. It was likely to trigger the opponent’s hatred, something Leylin expected long ago.\\n\\n The male face on the spider’s abdomen let out a sob, and terrifying sound waves swept past the area where Leylin was, tearing off the topsoil to reveal the thick bedrock.\\n\\n Leylin had taken precautions the moment he commanded the A.I. Chip to scan. His body was covered in a layer of Kemoyin Scales, and a few blood-red shields emerged.\\n\\n *Ka-cha!* *Ka-cha!* The blood-red shields and the sound waves came into contact, and it seemed to be unable to defend for much longer. Many cracks emerged on the surface of the shields, and they soon shattered.\\n\\n The sound waves swept across Leylin, causing intense pain to be transmitted from his Kemoyin Scales.\\n\\n “Argh… This power!” Weirdly enough, a hint of happiness emerged in Leylin’s eyes. At the very least, he could confirm through this attack that his opponent had not comprehended laws. The opponent was not a regulatory existence. This was more important than anything else.\\n\\n If not, he could only have turned around and fled, abandoning the laboratory and wandering alone in Dreamscape.\\n\\n [Beep! Target has resisted scanning, not all data has been obtained. Display what is available?] the A.I. Chip asked mechanically.\\n\\n Of course, Leylin assented unhesitantly. The A.I. Chip responded immediately, projecting a data panel with many incomplete fields before him.\\n\\n [Beep! Unknown Creature. Power: 200+, Agility: 100+, Vitality: Not enough information, Spiritual Force: 2000+(estimate), Abilities: 1, Detection: Has a keen perceptivity towards the energy waves in its territory, 2, unknown… 3, unknown…]\\n\\n ‘That Detection ability should be why the opponent could discover the laboratory in spite of my meticulous concealment.’ Leylin sighed. He was reminded of the saying, ‘Man proposes, God disposes.’\\n\\n He had observed this area for a long time. Only after ensuring that there weren\u0027t any terrifying creatures did he go out to explore with peace of mind. He hadn’t expected that such a terrifying monster would be attracted when he was out.\\n\\n ‘The opponent is a rank 6 creature at most, there’s still a chance!’ Leylin’s figure twinkled endlessly as he dodged the snow-white spider web in mid-air. His thoughts were running endlessly.\\n\\n Of course, the beings of Dreamscape did not follow the Magus World’s rankings. Because of the inherent uncertainty of dreamforce, their rankings were very vague.\\n\\n But through the A.I. Chip’s detection and his own observations, Leylin could already confirm that the opponent was at least a rank 6 creature, ferocious and powerful/\\n\\n ‘These kinds of creatures all occupy their own territories normally. Why did it come out for no reason?’ Leylin immediately shook his head even as this thought came to mind, ‘I’m too foolish! This is Dreamscape, why would it follow such rules?’\\n\\n Right at this moment, the abdomen of the spider in mid-air suddenly bloated as it let out a cry, expanding and lastly exploding! Large quantities of densely packed spiders fell from the sky like raindrops. A translucent thread at all their tails connected them to the main body.\\n\\n An even finer radiance flashed across these closely packed threads.\\n\\n Terrifying amounts of dreamforce condensed with a bang, converging on that man’s distorted face as he let out a horrifying growl in the sky. “kdalkgmalk!”\\n\\n Terrifying dreamforce crashed down on Leylin’s body, causing the defensive suit to begin cracking inch by inch.\\n\\n “So powerful! Is this the power of rank 6?” As Leylin mumbled, a blood-red radiance burst out from his body. The power from his point mass had concentrated to an extreme as it boosted a spell, resulting in a new transformation.\\n\\n “Radiant Moon Arcane Art— Kemoyin Transformation!”\\n\\n Along with a terrifying hiss, an enormous serpent over a hundred thousand metres long suddenly appeared in the sky. The large bones at the top of its head formed something like a crown, the smooth and elegant lines of its scales emitting the aura of nobility.\\n\\n This was the ruler of the ancient Giant Kemoyin Serpents— the rank 5 Kemoyin Emperor!\\n\\n *Whoosh!* A huge phantom flashed across the sky. The Kemoyin Emperor suddenly flung its tail out, which struck the face in the sky and caused it to explode. Mysterious petrifying light short from the amber pupils that were like Morning Stars.\\n\\n Many of the tiny spiders were petrified right in mid-air, turning into rocks and falling down.\\n\\n “Innate skill— Devour!” Along with Leylin’s soul force, the Kemoyin Emperor suddenly widened its serpent’s jaw and a big black hole formed faintly before him.\\n\\n The spider web in the sky was directly broken, disappearing into the terrifying black hole with the surrounding rocks, branches, and even light itself.\\n\\n “Get out!” Accompanying Leylin’s explosive shout, the enormous serpent suddenly crashed into the large spider in the sky.\\n\\n With a mountain-cracking, space-shattering rumble, terrifying shockwaves of air swept out in all directions. The large spider that was hovering in front of the laboratory was struck some distance away.\\n\\n *Chik chik!* This kind of attack obviously enraged the spider. With ear-piercing yells, a few blades of dark light suddenly burst forth, leaving deep scars on the Kemoyin Emperor’s body.\\n\\n Large scales fell down as blood splashed in all directions. Yet, under the effect of the innate Devour skill, the serpent recovered very quickly.\\n\\n A poof sounded as countless black streams of air gathered together, restoring Leylin’s true body. There was an unusual blush on his face as numerous black flames formed on his body making him resemble a demonic phoenix.\\n\\n “Soaring Demonic Phoenix!” Together with an exalted phoenix cry, the blackfire phoenix tore open the layers of webbing that had wrapped around the laboratory and Leylin dashed inside.\\n\\n “Go!” Various potions were thrown out from Leylin’s body, forming a terrifying combination spell. It mixed with attacks from the Scarlet Earring, and they drowned the enormous spider that was rushing over.\\n\\n He did not even look at the outcome of that, suddenly closing the door of the laboratory.\\n\\n *Bang!* When he opened it again, the surroundings of the laboratory had already transformed into the scene of an ancient castle.\\n\\n “I’m back!” Leylin murmured. His expression suddenly changed and a great amount of dark red dreamforce shrouded his body, forming the phantom of a huge spider.\\n\\n “Indeed. I still can’t resist the attack of a rank 6 creature…” He mumbled with a bitter smile on his face. Suddenly, his expression showed another drastic change.\\n\\n *Rumble!* Glaring blue lightning bounced around the surroundings of the laboratory, even emerging in Dreamscape. A huge red spider spat out a large amount of thread from the other side that seemed to stretch across the void. With his Astral Vision, Leylin saw a large amount of thread twisting on top of the laboratory, aiming to drag it back into Dreamscape.\\n\\n “No! If this goes on, no matter whether the laboratory is dragged over there or that thing gets access to the channel leading here, it isn’t going to be something I wish to see.” A rare look of hesitation emerged on Leylin’s face, but ultimately dissolved into resolution. “I need to break the connection!”\\n\\n Leylin had studied this space-switching of the laboratory extensively. Although he hadn’t had many results, he’d still deduced how to stop this phenomenon.\\n\\n Leylin’s right hand dropped a little powerlessly. “A.I. Chip, command the formation genie to activate self-destruct procedures!”\\n\\n [Beep! Authority confirmed, enforcing command.] Without human thoughts, the A.I. Chip only carried out his orders mechanically. As it sounded out, a slightly dark red gas emerged from the floor of the lab.\\n\\n The dark red dreamforce grew more concentrated as it converged, eventually even forming a layer of dark red flames.\\n\\n With a series of bangs, a great amount of webbing melted and broke apart. Even the laboratory itself began to melt slowly.\\n\\n *Chik Chik Chi…* Leylin felt like he could hear the furious growls of the spider all the way from the distant Dreamscape.\\n\\n The loud sound was originally very intense, but is soon softened as it gradually disappeared. The dark red flames then extinguished, leaving a big black hole where the laboratory had originally stood. It had disappeared without a trace.\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-645","bookId":1513,"book":{"id":1513,"title":"Warlock of the Magus World","description":"What happens when a scientist from a futuristic world reincarnates in a World of Magic and Knights?\\n An awesome MC — that’s what happens!\\n A scientist’s goal is to explore the secrets of the universe, and this is exactly what Leylin sets out to do when he is reincarnated. Dark, cold and calculating, he makes use of all his resources as he sets off on his adventures to meet his goal.\\n Face? Who needs that… Hmmm… that guy seems too powerful for me to take on now… I better keep a low profile for now.\\n You want me to help you? Sure… but what benefit can I get out of it? Nothing? Bye.\\n Hmmm… that guy looks like he might cause me problems in the future. Should I let him off for now and let him grow into someone that can threaten me….. Nahhh. *kill*\\n","cover":"http://cunovel.com/img/WMW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
