{"id":59220,"no":664,"title":"Chapter 664","content":"Descendant and Discovery\n Not only did Leylin have a lot of information on methods to increase elemental affinity, he’d also attempted some of these methods himself.\n There were ancient records detailing this field in the central continent, and the A.I. Chip had recorded the information down and used it well.\n However, even the central continent that was touted as the cradle of the revival of the glory of Magi had very little information on soul aptitude.\n It had been extremely unlikely for Leylin to find a physique from an ancient dead clan, and it might have been useful to him. However, Joanna had ended up self-destructing, something Leylin found a huge pity.\n With what he understood, Leylin found that the power of laws could alter his soul aptitude. How could he not go crazy in excitement?\n ‘The power of laws is boundless and inexhaustible, and can even modify a Magus’ soul aptitude!’ Leylin’s eyes brightened. While he was a bloodline Warlock, he still paid much attention to his soul aptitude.\n ‘But…’ At the thought of what he had comprehended, a look of hesitation rose on his expression.\n The Blazing Flame Monarch did not have complete authority over the law of fire, else she would long since have advanced to rank 7.\n Her comprehension of laws was incomplete, and what Leylin had found from her memories was pieces of a fragmented version. He’d comprehended less than a tenth of the power of the laws of fire, and it was impossible for him to fully understand them and become a rank 7 Magus with this.\n With the A.I. Chip’s lack of research and information on laws, it was impractical to rely on it to simulate the complete version of the law of fire.\n “Hah… There’s no way around it…” Leylin sighed, “Profiting through that risk was already extremely lucky. Do I have to sneak attack another Magus that has comprehended laws and steal their comprehension?” He was unwilling to go up against someone who had completely grasped the power of a law and obtained control of it.\n The World of Gods had a special title for existences at rank 7 and above; they were called True Gods. This was because once one completely understood the power of laws, even a regular human would step into the domain of divinity! The gap between the two was even wider than the gaps between ranks 1 and 6.\n Hence, while Leylin and Melinda dared to grievously harm a Breaking Dawn Monarch, they definitely wouldn’t set their sights on a rank 7.\n He wanted to live for a long time, hopefully peeking at and transcending to a state of immortality. Why would he intentionally seek death?\n “Those things don’t matter yet. For now, I need to break the bloodline shackles as quickly as possible and break through to Breaking Dawn. After all, only peaking the power of my soul force will give me the foundations to begin to comprehend the power of laws…”\n At the thought of what had happened during the comprehension process, Leylin’s expression turned grim. With his current soul force, analysing and comprehending the power of laws was much too difficult. Even though he had compiled all of the information, he had only felt a bit of the aura of the law of fire, and had not even understood 0.00001% of it.\n Only Breaking Dawns could comprehend laws. Even being able to achieve what he had was because Leylin was talented and had the great help of the A.I. Chip.\n “Whatever it is, I need to obtain the power of laws as soon as possible. Breaking the bloodline shackles will depend on it…” Recalling the meeting with the Wisdom Tree as well as its ‘gift’, Leylin’s eyes blazed as he immersed himself in understanding the law of fire.\n ……\n Crimson light fluctuated around Leylin under a tree in the darkness.\n His eyes were closed tightly, as if he was in contact with a world full of mysteries. Large amounts of this light surged around his body, the endless information forming a strange code as they hovered before his eyes.\n He tried to stretch out and grab those flaming words, but the action was in vain. He could sense some flaming words continuously dig into his body like earthworms, causing him to tremble slightly. The comprehension of laws had begun.\n *Bzzt bzzt!* Just as Leylin’s comprehension of the law of fire was about to begin, a massive amount of crimson light interrupted him.\n “No! What’s going on?” Leylin almost roared. The state he’d been in was clearly one that was hard to come by, and it had been interrupted just like that. It filled him with a near-insane bloodlust.\n “Wah! Wah!” Both his bloodline and the innate controlling ability of the Kemoyin Emperor laid a scene out before his eyes.\n In an extravagant bedroom the dark subterranean world, a bed sheet had blood stains on it. A woman who was sweating profusely trembled as she held onto a wrinkled baby.\n “Goo Gaa!” The baby with jet-black eyes still had amniotic fluid on its body. The umbilical cord had just been cut, and as if noticing Leylin peeping, the crying baby beamed up at him, causing the woman to be shocked.\n “My blood! My blood has been born in Twilight Zone!” Leylin opened his eyes wide. All Magi had a strange sensitivity to their own blood, and given that the Kemoyin Emperor was the ruler of a race, Leylin’s sensitivity was even greater.\n “Has the child I left to Celine been born?” His gaze penetrated through the ground and arrived at Twilight Zone. He hadn’t let the A.I. Chip control his interactions with Celine, intentionally leaving behind his bloodline with her. It was about time for the child to have been born.\n Because these children were Warlocks, they would be different from regular humans. They would have some inborn talent, and could cause elemental storms or leak radiation at birth. Celine was a Magus herself and had defences against these situations. Most regular women would be done for.\n The younger generation would mature quickly with Leylin’s rank 5 Kemoyin Emperor bloodline, and they would definitely be terrifying beyond belief.\n With Celine’s influence, what kind of changes would be brought to Twilight Zone? Leylin’s eyes showed he was deep in thought.\n And yet he was the same detached Magus after all, and he waited for a long time after observing the law of fire. With a slight sigh, Leylin placed his attention on himself, and the A.I. Chip’s prompts popped up.\n [Beep! Host beginning to grasp unknown force, determined to be power of the law of fire. Fire elemental affinity increased by 50%.]\n [Host’s soul aptitude has been strengthened. Recalculating… Determined to be upgraded to grade 4.]\n ‘My elemental affinity and soul aptitude have been upgraded after crossing the threshold of comprehending laws?’ Leylin was surprised by this. From his days as an acolyte to the current day, he’d only been able to raise his soul aptitude to the peak of his initial grade of 3. This one step he took into comprehending laws had pushed it up a grade, something with a terrifying meaning.\n However, that would be it for Leylin’s current soul in terms of comprehension of the power of laws. He was only a Radiant Moon Magus after all, and his truesoul was still at Half Moon and hadn’t even reached peak Full Moon. It couldn’t support the study of laws.\n In other words, Leylin himself wasn’t good enough to accommodate a greater understanding. He had to upgrade himself to break through, and that had to be accomplished by reaching rank 6, Breaking Dawn.\n This discovery rendered Leylin speechless. Though he had stolen about 10% of the Blazing Flame Monarch’s comprehension of the laws of fire, he had only understood about 1%. The rest would have to be shelved due to him not meeting the prerequisites.\n “My injuries have completely recovered, and I’ve gone through pretty much all of my profits. It’s time to return…” Leylin suddenly sighed, figure turning into black flames and disappearing from the area.\n ……\n In an astral river, countless light-years away from the Magus World.\n A starlike coiled up snake in the Purgatory World revealed the figure of the Snake Dowager. Every strand of her hair was a different serpent, emitting different kinds of energy. Her face was extremely exquisite, and her eyes held within them the life and death of worlds themselves.\n Every inch of her body seemed to embody the law of darkness, and it was full of perfection and harmony.\n Currently, there was a rare grimness in the Dowager’s eyes. “The Emperor of the Kemoyin has already begun to make contact with the power of laws? Its bloodline has begun to spread as well…”\n The Snake Dowager could see the events in the faraway Magus World from across the astral river, causing her to sink deep into thought. Though the Kemoyins were only a small branch of her bloodline, they still represented a portion of her abilities and authority!\n The imperial bloodline had left her on guard. This uncontrollable variable could one day become a power that would tear apart her divinity.\n “Through the shore of clouds and stars, my bloodline shall all return to my embrace…” The Dowager’s voice was faint and tender, giving one the urge to lose themselves within it.\n With what sounded like a prophecy, a tremendous illusory world slowly emanated from behind the Snake Dowager, and as if she was stepping through time and space, she entered the Magus World.\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-664","bookId":1513,"book":{"id":1513,"title":"Warlock of the Magus World","description":"What happens when a scientist from a futuristic world reincarnates in a World of Magic and Knights?\n An awesome MC — that’s what happens!\n A scientist’s goal is to explore the secrets of the universe, and this is exactly what Leylin sets out to do when he is reincarnated. Dark, cold and calculating, he makes use of all his resources as he sets off on his adventures to meet his goal.\n Face? Who needs that… Hmmm… that guy seems too powerful for me to take on now… I better keep a low profile for now.\n You want me to help you? Sure… but what benefit can I get out of it? Nothing? Bye.\n Hmmm… that guy looks like he might cause me problems in the future. Should I let him off for now and let him grow into someone that can threaten me….. Nahhh. *kill*\n","cover":"http://cunovel.com/img/WMW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
