{"id":59325,"no":769,"title":"Chapter 769","content":"Turbulent Undercurrent With a buzz, the Morning Star realm’s transportation area suddenly flickered with a brilliant light. “They have arrived!” Offa and Wayde’s eyes lit up at the sight, but Bevis’ expression became rather probing and had an unyielding look to it. Several figures wrapped in a gentle ray of light appeared. After the light had dispersed, it revealed the figure of Leylin, Jeffrey and the others. “Sir Offa, Sir Wayde and Sir Bevis! It’s been a long time since we met,” Leylin walked in front of the rest and greeted them with a smile. “Sir Leylin, you- have you broken through?” Offa twisted his hands together, and appeared very excited. “Yes, I have already reached the realm of rank 6,” Leylin smiled, and behind his back, the essence of his sun-like truesoul appeared, its piercing golden flame sweeping across everyone with powerful energy undulations. “As expected, this is the power of a Breaking Dawn rank!” Offa’s eyes were bright and filled with tears, “our organisation’s long-cherished wish has finally been realised, Sir Leylin, no, your majesty Leylin! You are the pride of our Bloodline Alliance!” Offa respectfully bowed, along with Wayde and even a seemingly unwilling Bevis. “Your highness? Have I been promoted to a new title?” Leylin seemed to find it funny as he raised his hand to support Offa and the others up from their bow. With this hierarchy, as Leylin had now advanced to a rank 6 warlock and impressively become a Warlock Emperor, so he was now called ‘his highness. ‘What a funny way to give titles, so when Bevis also advances, wouldn’t the Bloodline Alliance have two highnesses?’ Leylin humorously thought of the aftermath of that scene. “1557 years, it’s already fully been 1557 years! Our Bloodline Warlock Monarch has finally appeared, but never had I thought that it would be his majesty, Leylin!” Wayde said, which made Bevis’ expression darken. He was still a rank 5 Warlock, and did not have the strength to act against Leylin. He could only respectfully express his allegiance. No matter how he had schemed before, in front of this absolute strength, it was an insubstantial as a spider’s web that could be brushed away without leaving a trace. “However, I can also reach that rank. In a hundred more years, very quickly…” At this moment, Leylin’s gaze had also gone past Offa and Wayde, and had arrived on Bevis. “Sire Bevis!” “Yes!” Bevis put in his greatest effort to make his smile slightly more natural, but he disgracefully failed at doing so. His twisted expression made everyone who looked upon it want to laugh. “Your fog giant bloodline, when amplified by another set of giant’s remains, you still have 87 years left before you break through! Work hard, you still have 65.1% chance of advancing to rank 6,” Leylin said with a smile, and he looked as if he had completely seen through Bevis. ‘How did he know?’ Bevis raised his head with amazement. He had always considered the fog giant’s remains that he had obtained from Offa as his final hope and trump card, and never had he thought that Leylin would be able to tell. ‘The gap between him and me has grown so big?’ Seeing that Leylin had a greater understanding of his bloodline than he himself, and had even calculated the probability of advancement, dealt a devastating strike to Bevis’ confidence. Until now, he realised that his actions before made him look like an absolute clown, and he looked extremely ridiculous. “Lord Leylin!” After Leylin and the others had welcomed them into the headquarters, Offa and his group saw Leylin sit down. They still stood there ramrod-straight, with solemn and respectful expressions on their face. “Mm! I’ve come to the central continent today to relocate the Ouroboros clan, and also take care of some other trifling matters. After that, I might permanently settle there,” Leylin said. This surface Magus world was all the same to Leylin, and no matter how concentrated the elemental particles were, it would not be of any use to advancing his strength now. “Relocate? Settle?! Is it because of the subterranean commerce? I’ve heard about it, but please let me speak bluntly, your majesty. Although we Warlocks rely on bloodline power, the south coast’s weak elemental concentration will definitely still affect us…” Offa and the others had anxious expressions on their faces. Their long-awaited rank 6 Bloodline Monarch had finally appeared, and they thought they could exact their revenge on the central continent, so how could they let Leylin go so easily? Would they really have to wait another hundred years for Bevis? Seeing Offa’s expression, Leylin immediately knew what they were thinking in their heart of hearts. However, he did not expose them. “Be at ease, I know what you are all concerned about. Before I leave, I’ll settle this matter completely!” Leylin indifferently waved his hand, but Offa and his group were still a little dissatisfied. They seemed to want to say something else, but they were all stopped in their tracks by Jeffrey’s most severe glare. After Leylin had left, Jeffrey was surrounded by Offa and the others. “What’s the matter? Why did you stop us?” Offa asked very calmly. They had been comrades for a very long time, so he was very clear about how Jeffrey was as a person and knew that he definitely had his own considerations. “The earlier situation shocked me a little too much, and the news from the distant continent was rather delayed, so I couldn’t tell you all about the latest situation…” Jeffrey said with a wry smile, “Lord Leylin is not an average rank 6 Monarch, he is the person that we must pin all our hopes on…” …… Afterwards, the shocking news began to spread throughout the entire central continent. The Bloodline Union’s Warlock king, Leylin Farlier, had already stepped across the threshold of Breaking Dawn, and entered the realm of rank 6! After the Morning Star space had verified this news, they immediately invited other organisations to attend Leylin’s celebrations. Many powerful Magi organisations and even some Monarchs had one-by-one expressed their intention to come themselves and meet with Leylin. In a short while, the entire Phosphorescence Swamp once again became the gathering point of the central continent, and it seemed like all the Magi were discussing this matter, and how it would affect the central continent. …... Sky City, the Drifting Garden. “What?” the parchment in Weyer’s hands dropped to the floor, “How is this possible? He’s already advanced to rank 6, and reached the same status as the Monarch of the Skies? How long has he taken?” “The Monarch of the Skies has already accepted Leylin’s invitation, and will definitely personally attend. This news is very trustworthy. This is reality, you must get used to it and accept it, my child!” A middle-aged Magi that looked rather similar to Weyers helplessly said. He knew, of course, how great the shock this news would pose to a genius like Weyers. His small achievements were nothing compared to Leylin. That terrifying fellow’ speed at advancing made all the central continent’s geniuses despair and crumble. “Being born in the same century as him is your greatest misfortune but also your greatest fortune! I hope you can step out from his shadow,” the middle-aged man looked at Weyers with undisguised concern in his eyes. “I want to go as well, I want to see exactly how far the gap is between me and him!” Weyers gnashed his teeth, with an obstinate expression all over his face. “Ah, you…” the middle-aged man helplessly sighed. …… The reconstruction of Düz City had happened, under the Blazing Flame Monarch’s direction, many slaves put out their utmost effort and had completely rebuilt from the original ruins in the shortest period of time. The sacred flame had been relit, to represent the Blazing Flame Monarch’s strength and might. Inside the city, within a giant sphere of flames, the golden blaze’s boiling hot temperature had the power to melt the surrounding buildings. This phenomenon continued for nearly a few hours, and afterwards a slender figure emerged from the flames. The person was wrapped in a red cloak, and had a small crown of flame upon their head. It turned out to be Melinda, who was now the Blazing Flame Monarch. “Over the years, after consuming so many precious materials and the power of Dreamscape Elven stones, finally I have mended my soul to 80% of its original self…” The present Melinda had not only regrow a new arm, her aura had also reached the stage of rank 6. “Leylin Farlier! You really have given me a huge shock!” Melinda’s expression was very complicated. She had previously been able to take revenge thanks to Leylin’s help. However, he had attacked at the most crucial point and made her suffer enormous losses. Only now had she been able to recover. “He’s already broken through to rank 6? How interesting! Even bloodline shackles and the Snake Dowager couldn\u0027t stop him?” As an old monster who knew of many ancient secrets, Melinda naturally knew what it meant to break through the bloodline shackles-- he had the strength to resist the originator of his bloodline! “It looks as if I can\u0027t take my revenge now, and I even need to try to mend our relations,” Melinda licked her lips with a rich smile on her face. “Just as well! That freshly caught little fellow would be a rather good gift!” With Melinda’s thoughts and a loud clap, a fire elf immediately appeared before her. “Almighty master, please bestow your orders upon me!” The elf knelt on the floor with a respectful and humble attitude. “That freshly captured witch, I think she\u0027s called Natasha, command the others to erase her attitude and make her compliant! Put her as one of our guards!” “Your orders will be put into effect!” The elf spread it\u0027s blazing wings on its back and flew out from the door. “I really am looking forward to the ceremony!” Melinda laughed brightly, and the fire in the rear hall suddenly grew several times more intense, as if it wanted to scorch the entire sky. In just a moment, the entire central continent was full of hidden undercurrents as everyone turned their gazes towards the Phosphorescence Swamp. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-769","bookId":1513,"book":{"id":1513,"title":"Warlock of the Magus World","description":"What happens when a scientist from a futuristic world reincarnates in a World of Magic and Knights? An awesome MC — that’s what happens! A scientist’s goal is to explore the secrets of the universe, and this is exactly what Leylin sets out to do when he is reincarnated. Dark, cold and calculating, he makes use of all his resources as he sets off on his adventures to meet his goal. Face? Who needs that… Hmmm… that guy seems too powerful for me to take on now… I better keep a low profile for now. You want me to help you? Sure… but what benefit can I get out of it? Nothing? Bye. Hmmm… that guy looks like he might cause me problems in the future. Should I let him off for now and let him grow into someone that can threaten me….. Nahhh. *kill*","cover":"http://cunovel.com/img/WMW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
