{"id":59450,"no":894,"title":"Chapter 894","content":"Ambush\n The roars and howling of beasts filled the vicinity, putting everyone on edge.\n Lanshire laughed hysterically, “Hah! All of you will die with me! You can never beat those werecreatures! Every one of you will be torn apart and then swallowed; your souls will be caged in the depths of hell!”\n After spitting out her malicious curse, Lanshire’s face flushed and fresh blood spurted out from her mouth. Her aura completely disappeared as she died.\n “Ignore her! Listen to me, engage defensive formation.” Seeing that Aulen wasn’t in a good condition, Leylin took over command.\n It was only now that he found out what exactly had happened directly from Ogg, and began to organise the troops. In reality, everything that happened tonight was within Leylin’s plan. Firstly, he found Aulen and told her that they may have a spy within their ranks to win her support, which allowed him to plant the trap.\n And to make things easy for the possible attack, the brothers, Ogg and Otto were sent out to be on standby.\n “There were high-ranked werecreatures, so many of them, I– I can’t be sure of the exact number, but my brother tried to protect me- He tried to protect me and-” Ogg’s eyes swelled red with tears and his facial muscles began to twitch.\n “Heal!” A spell flew forth from Jinx’s hands, and swiftly cured most of Ogg’s severe wounds.\n “I’m gonna kill those damned beast bastards!” He stood up and grabbed his enormous claw hammer without waiting for his wounds to recover completely.\n “Were you the only one who managed to escape in the close combat team? It looks like I underestimated our enemies this time round.” Leylin looked slightly ashamed, but a light flashed deep within in his eyes.\n Whether it was done intentionally or not, the capture and exposure of Lanshire’s identity as a spy and her death had dealt a huge blow to Aulen. Moreover, the troops led by Ogg and Otto were now left with casualties, and Otto had even died; Silverymoon City would have to compensate Otto’s family for that later on. Jinx was a priest and under heavy restriction, while Rafiniya was a new member and did not have enough experience.\n The event seemed to have cleared quite a number of obstacles for him, but Leylin would never admit to that. He would probably say that it was a coincidence!\n By then, the werecreatures were already directly outside the campsite, their mountainous shadows and the screams of the guards causing horror to tinge the atmosphere.\n “Everyone stay close, we’re in trouble.” An Eternal Flame spell lit up Leylin’s palm, and he managed to repel a large amount of the fog. As the soldiers gathered together, he managed to see the werecreatures more clearly.\n This was a humongous group with at least 200 of the monsters among them, six of which had exceptionally strong physiques and savage auras.\n “High-ranked werecreatures, and there’s 6 of them!” Even the perturbed Aulen was now anxious. The werecreatures’ strength had greatly surpassed their expectations. If they were at all careless, their troop would be completely wiped out.\n Suppressing her emotions, Aulen returned to her cool-headed self and sent out commands, “Defensive formation number 2!”\n How could she not have realised that Lanshire had conspired with the werecreatures to kill everyone here?\n “Lanshire, my friend. I’m sorry!” Aulen muttered to herself and drew out her elven sword, the shaft decorated in plant motifs. Its lustre suggested that it was an enchanted item.\n *Boom! Boom!* Giant footsteps sounded out, and several giants that were at least ten metres tall emerged from the fog. They were like walking hills clothed in coppery skin.\n “G-Giants! These werecreatures managed to tame giants!” Aulen’s hand trembled ever so slightly as she watched these human-like but also bizarre creatures, and some soldiers even yelped in despair.\n “Giants? Those extraordinary creatures from the north?” Leylin massaged his temples in distress as data of the creatures was presented to him.\n [Name Unknown. Race: Giant. Strength: 15. Agility: 6. Vitality: 13. Spirit: 2. Feats: 1. Strong 2. Regeneration 3. Armoured Skin. Description: A unique creature that only exists in the north. Cruel and fierce in temperament, unintelligent, easily tamed by other barbaric tribes.]\n “Looking at this strength, they’re most certainly connected to the Blackblood tribe. They might even be a branch! Cassley obviously wanted us to die.” Aulen laughed bitterly.\n “Prepare to break through! We can only evacuate as many as we can.” She now seemed to have lost heart.\n “Elf from Silverymoon City, and other humans!” A shadow walked out from the group of werecreatures.\n He was 2 metres tall, and had an appearance similar to that of a human. The difference was that he had unusual beastly patterns all over his face, and certain body parts of a beast.\n He choked in disgust after sniffing in the direction of Leylin and the rest, “Damn Silverymoon City! That is a place of evil, it should be wiped clean!”\n As followers of Malar, the werecreatures were naturally hostile towards the civilised beings of Silverymoon City and hated all who dwelled within it. The city guards were undoubtedly their first target.\n “All of you will die here today! You are all too worthless to even be sacrificed to my Lord!” The werecreatures growled, and more petrifying shadows headed towards them.\n Werecreatures had robust physiques and a staggering jumping ability. The temporary barriers by the side of the campsite posed no deterrence to them. *Roar!* The giants grunted and every step they took was like a miniature earthquake, flipping tents and crushing soldiers under their feet.\n “Damn it! Leylin, protect me!” The elegance of an elf was long forgotten to Aulen as her eyes were red with anxiety and she pulled the elven bow from her back.\n Greater Magic Weapon! Leylin’s expression became heavy as the lustre of a high-grade spell burst forth from his hand.\n *Phew!* Silver arrows went off like shooting stars, the spell-filled arrowheads hitting the giants right in their eyes, their weakest points. The giants’ defences still couldn’t match high-grade spells, and this was aimed at their eyes.\n The giants roared as their eyes cracked apart in a soft explosion, copious amount of shimmering liquid and blood dripping everywhere.\n One pressed a palm against his injured eye as he went berserk, charging towards Aulen.\n Grease! Spell rays enveloped the giants as Leylin took advantage of this moment. He wouldn’t be himself if he let go of the chance to target the giants’ weakness.\n *Bang!* Magnificent lights shot out of his hands like fireworks, and the group of giants immediately went berserk. Even the werecreatures were unable to calm them down.\n Everything was in a frenzy as they roared wildly and attacked everything in their vicinity, including a handful werecreatures who were shredded into pieces.\n “It’s a high-grade spell attack! Get rid of that darned wizard, I’ll dispel it!” A werecreature clad in a priest robe stood out in the chaos. He, too, had strange decorative motifs and paint on his face.\n “Kill!” Aulen made use of this chance and charged forwards with Rafiniya and the rest. The only way they could survive under a situation like this was to go all-in. The soldiers were well aware of this too as they plucked up their remaining courage, following Aulen’s lead and charging ahead.\n *Roar!* The clash of the two opposing sides created a fierce orchestra of howls and clangs of steel meeting steel.\n And yet everything was in vain. Aulen’s numbers started to dwindle, and they could not win no matter how great their fighting spirit was. The werecreatures were just too many.\n “Go to hell!” Having been enhanced by magic, the sword in Aulen’s hand was brighter than ever. It could easily pierce through the defences of the werecreatures and cause unimaginable damage to their internal organs.\n With it, Aulen severed the heads of 3 werecreatures in a flash and attracted the attention of their companion— a high-ranked werecreature.\n “I admit you’re strong. But too bad; you’re still going to hell!” The werecreature priest suddenly towered over Aulen like a huge and tenacious mountain which she could not scale.\n ……\n “I’m your opponent!”\n Leylin had already cast Fly, and was blocking the priest from saving his companions.\n “Mid-ranked wizard, you’re not worthy to become a sacrifice!” The werecreature said in pity, and looked into Leylin’s blood-lust-filled eyes as if looking at his prey. It caused Leylin to furrow his brow uneasily.\n ‘I can’t be sure what other abilities this rank 15 or higher priest has. Hopefully Tiff and the rest will make it here soon!’\n But of course, Leylin had more than one plan. He was also confident of escaping. As a wizard, there were countless life-saving spells. A simple Fly could get him out of the scene in a matter of seconds as long as he wasn’t shot down. Rank 15 wizards would escape death even more easily with Teleport.\n This priest in front of him would just be a headache.\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-894","bookId":1513,"book":{"id":1513,"title":"Warlock of the Magus World","description":"What happens when a scientist from a futuristic world reincarnates in a World of Magic and Knights?\n An awesome MC — that’s what happens!\n A scientist’s goal is to explore the secrets of the universe, and this is exactly what Leylin sets out to do when he is reincarnated. Dark, cold and calculating, he makes use of all his resources as he sets off on his adventures to meet his goal.\n Face? Who needs that… Hmmm… that guy seems too powerful for me to take on now… I better keep a low profile for now.\n You want me to help you? Sure… but what benefit can I get out of it? Nothing? Bye.\n Hmmm… that guy looks like he might cause me problems in the future. Should I let him off for now and let him grow into someone that can threaten me….. Nahhh. *kill*\n","cover":"http://cunovel.com/img/WMW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
