{"id":59507,"no":951,"title":"Chapter 951","content":"Transformation\n The second layer of Nightmare Island was constructed of numerous dreams. Leylin now wandered through many dreams, looking for an opportunity to break through.\n He felt weightless again, and found his surroundings changed once more. Ardin had now grown into a young man, but the scar on his cheek had not disappeared. He’d activated some sort of talent in that life or death fight to successfully survive the attack, and was now an apprentice of the Nightmare Wizard.\n The Nightmare Wizard’s method of teaching his apprentices was very crude, and he had several apprentices like Ardin who were treated almost inhumanely. Many died, and only Ardin’s desire for revenge allowed him to persevere and strengthen himself rapidly.\n Many of these dreams involved him with a female junior, creating some of his most tender memories.\n “Next is a great darkness… That must be the reason he transformed…” Leylin muttered to himself, both hands waving to create strange runes as he broke through this dream, entering deeper levels.\n What appeared in front of him was darkness was so dense that it could not dissipate. Endless malicious intent converged to its limit, attacking his senses and almost turning him insane.\n ‘Nothing can hold me back!’ Leylin looked indifferent as he took a step forward.\n *Bzzt! Bzzt!* The darkness separated, revealing orange dots of candlelight. There were many fragmented and incoherent scenes here.\n “Keke… dear apprentices, your last test is to kill each other in this pocket dimension. Only one can survive, and that person will absorb all of your life forces and ingenuity, becoming my most outstanding disciple…” The Nightmare Wizard laughed wildly, sending all of his apprentices to a bloody pocket dimension.\n Ardin clenched his fists, glancing at the female apprentice who was like a white lotus next to him. She now looked slightly pale, and while she at most could be considered graceful, she still had a unique aura that captured his heart.\n ‘No! There has to be another way! There has to!’ Ardin bit his lips till blood was spilt.\n ……\n ‘The next dream should be in a bloody pocket dimension…’ This level of darkness was nothing to Leylin. With a slight caress with his right hand, he seemed to push a curtain aside.\n However, the next scene surprised him. Torrential rain fell, and terrifying dreamforce spread everywhere. The area looked to be full of debris, and there had evidently been a great battle here.\n “Haha… Ardin, my dearest disciple, are you going to betray me?” The Nightmare Wizard formed of numerous shadows watched the young Magus in front of him. This was obviously Ardin, who now only wished for his master’s’ death. He’d lost one of his eyes, and the other had turned purple.\n “Do you not know that my nightmare clones have spread across the whole world? Without the determination to destroy the world, don’t you know you can’t kill me?” The Nightmare Wizard laughed madly, a dreamforce spell forming a three-headed helldog. Hellfire blazed as it ruthlessly pushed Ardin to the ground.\n “I was the one who taught you all your magic, so what are you going to use against me?” He continued to snicker wildly as the bloody eyes of the figure stared at him, “Speak… how do you want to die?”\n “I want you to die!” Ardin yelled, his arms surrounding the three-headed dog.\n *Awoo!* Terrifying hurricanes formed at his forehead as a red eye opened up. Streaks of green veins protruded from it, shooting out rays that dissipated the fog and absorbed the dispelled dreamforce.\n “Ah… Ah…” Ardin’s clothes burst bit by bit, and he turned into a monstrous giant of five metres, with a horn, red scales, and a third eye between his brows.\n “This is… the physique to absorb nightmares! How is it possible? I’ve already checked it before, you can’t have this bloodline…”\n “Nothing is impossible, old man. Die!” Ardin, who had turned into a giant, grabbed forward in the air. Dark phantoms were pulled out of the dreams of numerous intellectual beings, and then exterminated.\n “So your true body was hidden in Dreamscape. I found you!” Ardin exclaimed, and then seemed to open a channel straight to Dreamscape. Powerful dreamforce forced the old Magus out.\n After seeing the old man, the black figures from before pounced forth, the injuries they had transferring over to him. The old man’s expression quickly changed as he coughed up black blood.\n “Hehe… as expected of the Nightmare Absorbing Physique, the rumoured favourite of Dreamscape! Cough cough… He actually managed to link with Dreamscape and expel my true body… cough cough…”\n Mouthfuls of black blood spurted out from his mouth, but his gaze as he watched Ardin was like he was seeing treasure.\n “Cough cough… The Nightmare Absorbing Physique has the natural ability to link with Dreamscape and absorb its origin. What I’ve been pursuing all my life has finally appeared before me…” The old man’s eyes were filled with fervour, like a devout follower finally meeting his god.\n “Are you done yet?” The giant walked over to him, the scar from the knife wound now seeming more jagged and obvious.\n “I ensure you that even your truesoul will be crushed, and I won’t give you the chance to enter the astral plane!” Tremendous Dreamscape origin force poured into Ardin, to the point that he could even somewhat sense laws.\n *Rumble!* After the powerful tremors, Ardin returned to his original state. Traces of black blood still flowed from his right fist.\n “Henceforth… I am the Nightmare King!”\n ……\n Light flashed, and the scene changed.\n “Little Ardin! The great wizard Poffert is here to recruit an apprentice; you must succeed this time!”\n Ardin’s mother urged him repeatedly...\n ……\n ‘As expected, the dreams are repeating themselves. Is this a maze formed of the life experiences of that Nightmare King? If I can’t break the seal and find the entrance to the third level, I might be trapped to death here…’\n Leylin watched the scenes a second time, feeling like a movie was being replayed.\n ‘But...the Nightmare Absorbing Physique! I never thought it actually existed! Ancient records say that those with such a physique are the darlings of Dreamscape, and can even have Dreamscape origin force poured into their bodies. They are treated even better than the children of planes… This physique can absorb a large amount of dreamforce and compensate for its weak phase, the Nightmare King must be incomparably close to rank 9…’\n “But… How do I get out of this dream maze?” The A.I. Chip’s light shone in Leylin’s eyes,\n “Based on the A.I. Chip’s observations and calculations, there were 38 key points in the dreams just now that could have changed his fate. There are 34198 chances to indirectly change it… but most important is probably the lost memory of the battle in the pocket dimension… I’ll try them one by one first…”\n “Plan 1…” Leylin pushed at the milk on the table, causing a large cup of milk to splatter onto Ardin’s clothes.\n “Ah! What’s going on, Ardin? Your clothes!” The housewife cried, “Are you going to meet that esteemed wizard in this state?”\n “I’m sorry, Mama! I’m going to change now!” Little Ardin ran into the next room and began to change his clothes.\n As expected, his efforts had led to Ardin staying inside the house. Immediately after, a huge explosion burst out and enveloped the building...\n Lights flashed, and the scene changed again.\n “Little Ardin! The great wizard Poffert is here to recruit an apprentice; you must succeed this time!” Ardin’s mother urged him repeatedly...\n “Alright! Looks like killing Ardin won’t work. I need to try something else…” Leylin had no choice but to watch this scene unfold again, and he began more tests...\n ……\n ‘Getting him to escape and then study under the Nightmare Wizard… fail!’\n ‘Saving his parents and having the whole family move to another city… fail!’\n ‘Accident during experiment, finding a new strength system… fail!’\n “It’s already the 17,862nd time… My spiritual energy can’t hold on much longer… But I’ve already found the key to proceed to the key memory region!” Leylin now looked resolute. The scene had changed to the time when the Nightmare Wizard had wanted the apprentices to kill each other.\n “After so many experiments, I finally found the key point. Dreamforce, stop!” The scene froze with Leylin’s will. Be it the crazy laughter of the Nightmare Wizard or the worried apprentices and Ardin biting his lips, everything stopped like a statue.\n The world lost all its colour in that instant, turning monochrome like a photograph.\n Leylin headed to the female apprentice that Ardin had feelings for, staring at the jade pendant on her chest. It had a white lotus on it.\n “Break!” Concentrated dreamforce passed through the pendant like a needle, and the entire scene seemed to shatter like porcelain. The dream no longer repeated, and everything descended into darkness.\n Two paths flickering with dark red light appeared in front of Leylin, and there were even strange eyes on him from the back of the paths.\n “One of these two should lead to the third layer, and the other should be the sealed memories…” Leylin stroked his chin, “If I were the Nightmare King, finding out that an outsider dared peep on my sealed memories would make me…”\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-951","bookId":1513,"book":{"id":1513,"title":"Warlock of the Magus World","description":"What happens when a scientist from a futuristic world reincarnates in a World of Magic and Knights?\n An awesome MC — that’s what happens!\n A scientist’s goal is to explore the secrets of the universe, and this is exactly what Leylin sets out to do when he is reincarnated. Dark, cold and calculating, he makes use of all his resources as he sets off on his adventures to meet his goal.\n Face? Who needs that… Hmmm… that guy seems too powerful for me to take on now… I better keep a low profile for now.\n You want me to help you? Sure… but what benefit can I get out of it? Nothing? Bye.\n Hmmm… that guy looks like he might cause me problems in the future. Should I let him off for now and let him grow into someone that can threaten me….. Nahhh. *kill*\n","cover":"http://cunovel.com/img/WMW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
