{"id":58653,"no":97,"title":"Chapter 97","content":"Conclusion\\n\\n What followed next was the most valuable loot this time around.\\n\\n Leylin looked at the pile of items in front of him and muttered irresolutely to himself.\\n\\n There were a few broken items, a dagger which had been broken into half, the remnant of a silver palm, with an incomplete silver necklace, with lightning flashing time to time.\\n\\n The 3 acolytes who died under Leylin’s hands were the potential Magi of the enemy academies, so how could they not have magic artifacts on them?\\n\\n It was a pity, however, that the broken dagger from the female blonde acolyte was only used to summon the aura of the abyss, and Leylin was still unable to figure out how the other items were meant to be used.\\n\\n As for Silver-Claw Saurun, he was totally a pervert, who actually infused the magic artifact into his own palm.\\n\\n Leylin could only chop the whole palm down, to try to separate the various properties in the magic artifact.\\n\\n As for Torash, the magic artifact on him had also destroyed itself, which was the reason why he could unleash an attack of 16 degrees at the end.\\n\\n The probing of magic artifacts was an extremely dangerous task. Before further information, Leylin did not dare to risk and use these items.\\n\\n Moreover, who knows if there were some booby trap laid within the magic artifacts by the enemy, thus Leylin felt that he should be more cautious.\\n\\n If he discovered that they might cause trouble to him, no matter how much Leylin was reluctant to part with them he would still toss them away within this secret plane.\\n\\n After all, he did not wish for an official Magus to notice him.\\n\\n “Actually, there is still a magic artifact that can be easily obtained! That is the green vine badge on Jayden’s body!”\\n\\n Leylin saw Jayden use this magic artifact on the dirigible before, back when he used it to suppress Kaliweir, leaving a strong impression on Leylin’s memory.\\n\\n However, this badge was given to him by Professor Dorotte.\\n\\n As for Dorotte, he was an official Magus in Abyssal Bone Forest Academy. If Leylin snatched an enemy’s magic artifact and hid in the academy, he might be safe. However if he took Jayden’s, then Leylin wouldn’t be able to stay in the Abyssal Bone Forest Academy anymore.\\n\\n During the academy’s critical moments, if the news that he was still causing harm to fellow acolytes got out, then Leylin’s name would be equivalent to the despised street rat, in the Magus World.\\n\\n He would not lose his rationality for just this little benefit.\\n\\n “There is this also!”\\n\\n Leylin flicked his hands, and two differently shaped badges appeared in his hands.\\n\\n This were the badges of Saurun and the female blonde acolyte. Although they were weaker than Torash by a little, but it was still worth at least 20 to 30 contribution points.\\n\\n “At first, I’ll just hold onto these. If I’m able to find other badges in future then I won\u0027t exchange these!”\\n\\n These two badges were Leylin’s insurance. If he was able to collect other badges in the secret plane to accumulate 50 contribution points, then he wouldn\u0027t use these.\\n\\n However, if the contribution points were not enough, then Leylin had no choice, and could only hand over one of them or both.\\n\\n As for Torash, Leylin felt that his strength was of great importance to his academy and the person backing Torash would have spent enormous efforts in nurturing him and so it was better to not provoke him.\\n\\n ……\\n\\n Two days passed.\\n\\n The wilderness found outside the secret plane was lit up with a bright yellow color. From time to time, there were gusts of wind blowing granules of sand, and the living organisms on the ground avoided this place at all cost — even the moles and ants were not an exception.\\n\\n The entrance to the secret plane was slowly shrinking as if it were a live animal.\\n\\n Outside of the entrance, the 3 chairmen and all the professors looked at the entrance that was constantly glowing with varying colours and had different expressions on their faces.\\n\\n Siley looked at the silver hourglass floating in midair. On the upper half of the hourglass, beads of golden sand trickled downwards, finally leaving behind a thin layer.\\n\\n * Di! * With the passing of time, the final golden bead of sand trickled downward.\\n\\n “The time is up, let us receive our acolytes!” Siley opened his mouth and spoke in a low tone.\\n\\n “Are you extremely anxious?” Guru who was at the side smirked, “Every minute more that passes, one acolyte in Abyssal Bone Forest Academy will be slain. Their heads will become the glory of my Sage Gotham’s Hut, and hung on the large gates….”\\n\\n “At this moment, the secret plane might no longer have anymore Abyssal Bone Forest Academy acolytes. We all know that once the acolytes from the two academies have gathered, Abyssal Bone Forest Academy’s acolytes would be meat on a chopping board for us to slice, and is not even equivalent to a lamb.\\n\\n The other blonde women smiled — but her smiled seemed somewhat malicious.\\n\\n “Nicola, you still can\u0027t let it go?” Finally, a trace of expression surfaced on Siley’s face, and it seemed to be - regret?\\n\\n “I have long since forgotten the matters from the past!” The female blonde woman Nicola said with a frosty expression.\\n\\n “You can seek revenge for the matters previously, but once you are bent on destroying this academy that I succeeded as a professor, then you will be my eternal nemesis!”\\n\\n Siley’s face too gradually hardened.\\n\\n “Haha...Haha… You are still as arrogant as before, thinking that you are the main character of some novel, which the earth would revolve around you indefinitely!”\\n\\n “However such an expression makes me want to puke!” Said the blonde woman as her eyes appeared to emit flames.\\n\\n “I want to destroy your life’s work, destroy the Abyssal Bone Forest Academy, even if there is the Lighthouse of the Night mediating, this time, there is still the next time....”\\n\\n “Enough!” Guru at the side interrupted Nicola.\\n\\n “Earlier you stopped me and Siley from fighting, but why is it that you can\u0027t endure it now?”\\n\\n “My reason for stopping you was because I want to take action myself!” Nicola’s maniacal look grew even stronger.\\n\\n “Enough!” A dense black colour descended, and covered the sky in an instant.\\n\\n Amidst the darkness, there was a bright yellow light that came from within, revealing a figure that was wrapped in black robes.\\n\\n “Sir!” The three chairmen bowed.\\n\\n They were only rank 2 Magus, yet this person in front of them was a true rank 3 Magus! Every level in the Magus World had an obvious difference like that between the sky and earth.\\n\\n Previously, it was this Sir that suppressed the 3 of them to mediate the war.\\n\\n “Since my Lighthouse of the Night has already stepped in, any conflicts that arise after is deemed as a provocation to us, as the contract and date are still effective.”\\n\\n The black-robed man had a pair of dark green eyes. No matter if it was Siley or the other 2 chairman, if these eyes landed on them, they would shudder as if being trapped by some magical beast.\\n\\n This feeling of imminent death finally brought Nicola out from her madness.\\n\\n “From now, activate the spell formation, and receive the acolytes within the secret plane!”\\n\\n “Yes, Sir!”\\n\\n * Peng! *\\n\\n A fiery explosion erupted, and set the acolytes behind Leylin on fire, turning them into ashes.\\n\\n Leylin’s footsteps did not stop as he continued to escape.\\n\\n “It’s him who killed Seet, Kroc, and Old Eagle, don’t let him escape!”\\n\\n Behind him, parties of Sage Gotham’s Hut and Whitewoods Castle acolytes were formed, a standard party of seven, which continuously gave chase.\\n\\n Leylin’s pursuers gradually drew closer.\\n\\n * Peng! * Leylin flung another two explosive potions again, where flames continuously extended behind him.\\n\\n The acolytes yelled and Leylin drew a longer distance from them.\\n\\n “Damn it!” Leylin’s face was downcast.\\n\\n After killing the 3 acolytes previously, Leylin began his hunting movement all alone again.\\n\\n At first, it was rather smooth sailing, where he collected another level 3 acolyte’s badge. This time, he specifically chose those who were rather old or those with no powerful items on them. They were those who seemed not able to advance further and had no strong backing behind them.\\n\\n During the later half of the second day, all of the enemy camp acolytes had already gathered and formed group spell formations!\\n\\n All of them were performed by level 2 or 3 acolyte groups. If their numbers were sufficient, even a rank 1 Magus had to seek retreat temporarily.\\n\\n Leylin had no choice, so he could only conceal himself and stop his hunt.\\n\\n With the detection of the A.I. Chip, he managed to successfully hide until this day.\\n\\n Things went according to how he had predicted: after the acolytes had gathered, they formed smaller squadrons and made a thorough search of the secret plane. They maintained a wanting-to-kill-every-last-enemy posture.\\n\\n Many Abyssal Bone Forest Academy acolytes were immediately killed, and under the opponent’s immense pressure, they could not even resist.\\n\\n Leylin even saw a level 3 acolyte who carried a magic artifact, but that acolyte could only survive for a few more minutes under the spell formation. Afterward, he was ripped to shreds by the countless rank 0 spells that befell on him. Even the magic artifact became the trophy prize for his opponents.\\n\\n Leylin could only extend his sympathisation to this fellow acolyte, and covered his tracks even more covertly.\\n\\n Fortunately, the methods of magicians were extremely strange, and the opponents were only two academies who could not completely be harmonious amongst themselves. This gave the acolytes of Abyssal Bone Forest Academy a chance for survival!\\n\\n After Leylin estimated that time was almost up, he immediately ambushed a small party, since he was one badge short of his goal.\\n\\n According to his estimation, once he kills the opponents, then the time would be up, where he would even be teleported out and not need to face the group’s counterattack.\\n\\n “F*ck! This lack of punctuality will have people killed!”\\n\\n Of course, Leylin wouldn\u0027t expect that the time would be delayed due to the enmity of the chairmen, which resulted in an error to his calculations.\\n\\n After killing one of the level 3 acolyte, he was immediately surrounded and attacked.\\n\\n “The Fallen Star Pendant’s energy was fully consumed the last time and I have not recharged it. If not I could have escaped long ago!”\\n\\n Leylin gritted his teeth and gave an order, “A.I. Chip! Detect the geographical area and calculation the best retreat route!”\\n\\n [Beep! Mission establishing!]\\n\\n Along with the A.I. Chip’s indication, Leylin began to make various unexpected ducking movements amidst the dense forest, slowly pulling the distance further away from the pursuing acolytes.\\n\\n “I have finally escaped!”\\n\\n After running for over a dozen miles and shaking off his pursuers, suddenly he felt dizzy, and the badge pinned to his chest glowed resplendently.\\n\\n “F*ck, the teleportation is finally here!”\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-97","bookId":1513,"book":{"id":1513,"title":"Warlock of the Magus World","description":"What happens when a scientist from a futuristic world reincarnates in a World of Magic and Knights?\\n An awesome MC — that’s what happens!\\n A scientist’s goal is to explore the secrets of the universe, and this is exactly what Leylin sets out to do when he is reincarnated. Dark, cold and calculating, he makes use of all his resources as he sets off on his adventures to meet his goal.\\n Face? Who needs that… Hmmm… that guy seems too powerful for me to take on now… I better keep a low profile for now.\\n You want me to help you? Sure… but what benefit can I get out of it? Nothing? Bye.\\n Hmmm… that guy looks like he might cause me problems in the future. Should I let him off for now and let him grow into someone that can threaten me….. Nahhh. *kill*\\n","cover":"http://cunovel.com/img/WMW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
