{"id":59548,"no":992,"title":"Chapter 992","content":"Contamination\n ‘A.I. Chip, show me the schematic from the soul research.’ Leylin seemed to have no reaction to the natives’ fear. A wave of the hand had a wizened old man approach him, and he pressed his palm into the old man’s head with a glint in his eyes.\n Time, passed, and the man’s expression warped quickly. There was happiness and suffering, but mostly confusion. The rest of the natives backed off as they watched this ‘god’ ‘bestow’ gifts upon him.\n In their point of view, the leader of the slaves and the supervisor were both amazing people. As for Leylin, who headed thousands of pirates and had several hundred large ships in his possession, he far surpassed their tribal chiefs or priest elders. Perhaps the only thing that could compare to him were their totems.\n [Beep! Soul schematic analysis completed. Beginning comparison…] The A.I. Chip projected a coloured image in front of Leylin, comparing the native’s soul to that of a regular person. A few darker regions were specifically marked out.\n Putting the now-useless lab rat down, Leylin returned to his bedroom alone. Large amounts of data flashed across his eyes, and he began to turn serious.\n “As expected, there’s something wrong with the natives’ souls…” A long time ago, Leylin had discovered an extremely interesting phenomenon. None of the native tribes in the outer seas believed in any true gods. This was something unthinkable!\n The gods were so thirsty for faith that they wouldn’t even leave strange creatures and mud beasts alone. Why would they abandon these intelligent natives? Even if their souls weren’t even a tenth as strong as that of a commoner from the mainland, the gods still understood that little things would add up.\n However, of all the tribes that Leylin had attacked, the natives all believed in natural spirits and totems, and there was no appearance of the gods from the mainland at all. The only explanation for this would be that there was some flaw in their power of faith, which left the gods with no choice but to give up on them and treat them as trash. They allowed the natives to do as they wished, and even if they knew of the large native empire they didn’t bother with it.\n With large amounts of research and comparisons, as well as with his own abilities as a divine being, Leylin had finally touched upon the secret.\n ‘This spirit… The problem isn’t exactly internal. It’s actually contaminated…’ Leylin was now solemn, ‘On top of that, this mutation is familiar, with the mark of arcane and Magus spells… It reaches the depths of their genes, and has been passed on generation after generation.’\n In essence, the power of faith was just soul energy that was dispersed when worshippers reached an emotional peak during their prayers or ceremonies, full of fervour. Using their domains and divine sparks, the gods absorbed this specific soul energy and turned it into divine force. There was no essential difference between lesser and greater gods either. It was the same process.\n “What happens if we absorb this mutated soul force?”\n ‘A.I. Chip, simulate the absorption of the natives’ power of faith,’ Leylin commanded, stroking his chin with his interest piqued.\n [Beep! Mission established. Beginning simulations… Preparing model…] Large amounts of data flashed by Leylin’s eyes, giving form to a scenario. The statue of Malar from before had been enshrined around a native altar, the rest of the natives worshipping it. Visible only to divine beings, power of faith rippled as it gathered at the stone statue.\n There was no change to the statue at the beginning, and his divine force increased in strength. However, a decade later the statue began to grow indistinct. A dark red lustre lingered around it, and Malar turned more violent and asked for regular blood sacrifices.\n A century later, Malar’s divine kingdom exploded amidst his despairing roars. A gigantic ape body fell into the prime material plane, bound securely around the native priests.\n Five centuries had passed, and Malar was now a beast with no mind of his own. He had turned into a golden flag, with the figure of an ape on it.\n ‘I used Malar as the model because I’m more familiar with his divine force, but I never thought this would happen…’ Once the simulation had passed, Leylin fearfully recalled the scene just then.\n “There’s definitely something wrong with the natives’ power of faith. It’s greatly contaminated, and can even cause a true god to weaken, eventually even fall to the prime material plane. Combined with the sacrifices, they become bound to the planet, their mind slowly erased until all that’s left is pure instinct…”\n Such a miserable thing was no different from suicide. It was no wonder why the gods had forsaken these inhabitants.\n ‘They lost their holy kingdom, and were banished into this area with their consciousness eroding over time. It’s worse than confinement… The power of their faith is contaminated, but it’s a hereditary thing that they simply can’t change…’\n Leylin pondered over the issue, ‘Since that’s the case, I don’t have to worry about other gods meddling if I enact my plans on this kingdom. However, I’ll have to bear the burden all on my own…’\n Although the worship of these inhabitants was lacking, and the spirits they bound weren’t as powerful as gods, a demigod who assimilated with those spirits could become comparable to gods! The totemic demigods would be that strong!\n Of course, once they left their area, the power of these demigods would fall drastically.\n ‘No matter what, there is a chance here. A huge one!’ Leylin’s eyes flashed as countless possible scenarios unfolded in his mind. All that was left was to bring them to reality.\n “However… The incompleteness and contamination of these spirits still makes me uneasy. If I don’t understand them completely…” Leylin recalled several samples of these totems, his divine conscience delving deep into the genes where the ancient memories were located...\n There was a fire on the battlefield, floating cities crashing into the ground like meteorites. The arcanists, who were always intelligent and farsighted, who controlled all the truth in the world were now being slain. Their murderers? The gods!\n The last remaining arcanists of Netheril cried out in hatred and anguish, “The spark of the arcane spells of Mise will never cease! We will never yield…”\n Multiple memory fragments were revealed to Leylin, and even with his power he could only process a small portion of them. However, the information divulged from even that small portion was enough to move him.\n “So these people are actually immigrants from the Netheril era!” Leylin gasped. He’d previously seen other people from the Netheril era before, like Helen. Although it was a rather miserable thing to see them run and hide for their lives, they were living in heaven compared to these people.\n ‘Who’d have guessed that the progressive and cultured Netherese have been reduced to such a state over tens of thousands of years. They’re called barbarians and fools, some even captured and turned into slaves…’ Leylin sighed inwardly.\n He could now understand what had happened before. The gods had been displeased with the fearless research of the Netherese arcanists, and it had eventually led to war. They began to kill what looked like all living arcanists, and most of the floating cities crashed into oblivion. The Netherese civilization had crumbled in a day.\n It was at this moment that a group of Netherese had gathered. They likely wished to resist the enslavement of the gods, and were resolute in their decision. They swallowed a medicine that caused them to reject the power of faith, the rest unlucky enough to be swept into the high-ranking battle and ending up as collateral damage.\n In any case, the Netherese had experienced a complete change in spirit, and were now considered venomous to the power of faith, and in turn to the gods themselves! They definitely wouldn’t be taken in by the gods, so they escaped across the seas and started reproducing here.\n During this process, due to the powers of the gods and other backhanded means, these people from the Netherese Era had regressed. What was once a renowned and cultured civilisation had now turned into a group of barbaric and foolish tribals…\n ‘If my guess is correct, the ancestors of these natives turned into barbarians after rejecting the power of faith. This had stopped them from finding even one god to turn to, how pitiful…’Leylin felt the anguish of losing a whole civilisation from the bottom of his heart.\n His eyes turned red. ‘However… Since matters have turned out like this… Hand over your blood, tears, hatred, and your power of belief– everything…’\n The gods may not have been able to resolve the issue, but Leylin could circumvent it. His ancient Nightmare Absorbing Physique could absorb emotion itself, and the emotions of millions of people would definitely grant him power to rival gods!\n ‘Of course I have to keep a low profile about this. At least before I begin my ascension, the ability to make use of these inhabitants’ power of faith shouldn’t be divulged…’ Leylin rubbed his temples, feeling a headache. The number of secrets he was hiding continued to grow.\n \u0027I’ll have to devise a meticulous plan. Fortunately, Debank Islands is a solitary one, with almost zero contact with the mainland, so there’s a chance to keep information from leaking!’\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-992","bookId":1513,"book":{"id":1513,"title":"Warlock of the Magus World","description":"What happens when a scientist from a futuristic world reincarnates in a World of Magic and Knights?\n An awesome MC — that’s what happens!\n A scientist’s goal is to explore the secrets of the universe, and this is exactly what Leylin sets out to do when he is reincarnated. Dark, cold and calculating, he makes use of all his resources as he sets off on his adventures to meet his goal.\n Face? Who needs that… Hmmm… that guy seems too powerful for me to take on now… I better keep a low profile for now.\n You want me to help you? Sure… but what benefit can I get out of it? Nothing? Bye.\n Hmmm… that guy looks like he might cause me problems in the future. Should I let him off for now and let him grow into someone that can threaten me….. Nahhh. *kill*\n","cover":"http://cunovel.com/img/WMW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
