{"id":59550,"no":994,"title":"Chapter 994","content":"Massacre Domain “Hmph, what a pigheaded idiot! You haven’t even ignited your godfire yet and have the gall to go against me?” Leylin snorted, and the flames immediately went out. After obtaining divinity, he no longer saw anything in regular divine beings. This divine creature in front of him was merely seeking death. At this thought, Leylin looked through the results of the A.I. Chip’s scan. [Totem spirit (Flaming Bird) Divine being. Strength: 15 (+5) Agility: 17 (+5) Vitality: 19 (+5) Spirit: 20 (+5) Possessed feats: 1. Domain: In the range of its worshippers’ prayers, the totem spirit will be buffed. All stats will increase by 5. 2. Affinity with flames. 3. Holy Form: Immune to all spells below rank 5. 4: Unknown ???] ‘While in the range of the followers’ prayers, all stats increase by 5? This really is a god similar to earth-bound spirits…’ Leylin snickered, “Is this what you’re depending on? Unfortunately… This isn’t your time anymore. With the loss of your followers, the boost you get from your domain will decrease. Now is the best time to have you serve me…” The boost from the domain came due to the existence of its worshippers. Now, however, the pirate army was closing in and the young men of the native tribe were being slaughtered. The power of faith was quickly diminishing. The effects of the massacre itself were trivial. The problem, however, was that without the totem spirit protecting them the faith of the natives collapsed. Leylin saw the +5 at the end of each stat slowly drop to +4. As the land his army occupied expanded, the number dropped further. “Is this faith? So powerful, and so pitiful…” Leylin sighed, noticing the fraud that was totem spirits. If he really could become a true god and bestow divine spells, the followers’ faith would not crumble so quickly. *Chiu! Chiu!* Leylin actually planned to subdue this flaming bird totem. It would be his primary guide on Debanks Island. Unfortunately, the bird had no plans to make use of Leylin’s kind intentions. It ended the conversation with a ball of fire. Golden flames struck Leylin’s vicinity, the boiling-hot fire absorbing all the oxygen in the surroundings. Something similar to a vacuum was formed. ‘It’s ability is like magic, but it can’t make use of the divinity and power of faith in its body well. It’s like the instinct of beasts.’ Leylin sighed, and the Red Dragon Staff appeared in his hands. Since he’d used Soul Burn a few times already, the red dragon’s soul within the staff had already diminished, and it looked rather dispirited. Dragon Domain! Cone of Fire! In the face of a mere legendary divine creature, however, Leylin did not even need to burn the dragon’s soul. A powerful draconic aura rippled out with a wave of his staff. *Roar!* A phantom red dragon appeared above Leylin, spewing out a cone of fire at the flaming bird. It immediately caused the giant bird to snarl without end. *Rumble!* Two streams of fire strived for victory in the air, turning the horizon red. “How can such brutish strength contend against me?”Leylin yelled, the cone of fire piercing through the flaming bird’s golden fire and enveloping it. *Chiu! Chiu!* Enraged howls sounded from within the flames, but there was something peculiar about the situation.All of a sudden, the red dragon’s flames exploded into what looked like a red lotus. At the heart of it, the flaming bird did not seem to be injured at all. Instead it seemed even larger. It chirped in its excitement, swallowing the red dragon’s flames with large gulps, its golden flames turning crimson. *Chiu! Chiu!* The flaming bird that had assimilated with the red dragon’s flames grew larger in size, eyes looking human and filled with pride as it flew towards the red dragon phantom in the air. ‘It can absorb flames? The A.I. Chip should have found out. Is this a unique divine ability?’ Leylin’s eyes flashed with wit, “Are you trying to swallow a legendary dragon soul? In that case, I’ll give it to you!” Soul Burn! The dragon soul at the tip of the staff completely withered, its body enveloped by translucent flames. With that act, the phantom in the air grew more corporeal, each scale more vivid and each claw glinting with a sharper light. All of a sudden, the red dragon’s eyes showed intelligence. It roared as it crashed into the flaming bird. High-pitched dragon howls and bird cries surprised both the natives and pirates on the ground. All of them gazed upwards, watching the battle between the red dragon and flaming bird. Some natives were able to recognise their totem and immediately tossed their weapons aside, beginning to pray right away. “What are you standing there in a daze for? Go!” A similar draconic aura burst forth from Isabel, and she withdrew the Red Dragon Sword from a native soldier of unknown role as she berated the pirates loudly. Having two legendaries in charge, and being better than their opponents in strength, equipment, and warriors, they completely crushed the opponents. The pirate army had now pushed through to the outer regions of the tribe, and the enemies they faced had turned into a mob. The old were appearing now, as were the youths, females, and the frail natives. “Those who do not surrender are to be killed with no exceptions!” With her long life as a pirate, Isabel lacked the pity that normal women displayed. The pirates and devil worshippers were originally evil themselves, so they carried out her orders ruthlessly, perhaps being even more cruel than necessary. ‘All I can do is give him all my faith, and take care of the mortal battles…’ Isabel’s eyes showed her understanding of her position as she charged to the depths of the tribal area. Draconic flames followed her around, making her look like the most beautiful war goddess. *Chiu! Chiu!* Meanwhile, the battle in the sky between the legendary beasts had reached its conclusion. Although the red dragon was a legendary beast that was burning its soul, it had died long ago and its power was diminished. Its opponent was equal in power, but also had divinity on hand! After several rounds, it had torn large chunks of soul force out of the red dragon’s body and swallowed its flames, causing its golden fire to turn red. *Ka-cha! Ka-cha!* At the end, as the bird gnawed at the head of the red dragon figure, the crystal with the dragon soul at the tip of Leylin’s staff shattered. “Tsk… after so many uses, the red dragon’s soul force is completely consumed…” Seeing the dragon soul vanishing in front of him, Leylin did not look the least bit surprised. The flaming bird, on the other hand, released an elated chirp and gulped down the red dragon figure while absorbing the flames it possessed. “Then again, it’s time about I changed the core!” Leylin floated up to the flaming bird. After absorbing the dragon soul, its body had become more enormous. A draconic aura emanated from it as it met Leylin’s gaze without fear. There was even desire in its eyes. “Oh? Trying to eat me too?” Leylin could not help but begin to chuckle after understanding what the bird wanted, “It really is a beast. It can only do everything by instinct and doesn’t even care if it can digest me.” “Go crazy…” Leylin snapped his fingers, and the flaming bird immediately began to writhe, layers of flames rising as half of the red dragon’s head appeared from its body. “While being able to assimilate the flames is an advantage for you, you might want to be careful since eating too much could mean you might be assimilated instead…” A sinister smile rose by Leylin’s lips, “You’ve been fattened up well. As you are now, you truly are prey worthy of slaughter…” “Return!” Leylin tossed the Red Dragon Staff in his hands, and it began to soar into the air till it reached the head of the flaming bird. Its sharp end quickly pierced down into the head. *Chiu! Chiu!* The large flaming bird could have easily dodged the attack, but it seemed to have gone stupid as it stayed where it was, golden and red flames twining around and eating at it. *Swish!* The red dragon staff was like a sharp arrow that disappeared through the head of the bird, causing flames and golden blood to spurt everywhere. The bird cried one last time as a huge explosion sounded. The sound began from its stomach, transforming into a storm that swept the bird within. Leylin stood at the side, watching the large body being torn and devoured by the storm… ‘If all earth-bound spirits on Debanks Island have this level of strength, I have nothing to worry about. However, with the support of the native empire, those earth-bound spirits are probably as strong as demigods…’ Leylin sighed inside. The pirate armies had now killed their way into the inner parts of the native tribes. They began their ruthless massacre of the old, weak and ill, as well as all sorts of atrocious activities. “Is this what conquering is? Increasing my strength through continuous massacre…” Leylin’s eyes showed his bewilderment for a moment, before the A.I. Chip sounded. [Beep! Host has killed a divine creature. Additional information about the massacre domain has been found. Model established, beginning analysis…] [Beep! Host has grasped the massacre domain!] [Massacre Domain: This domain allows one to obtain strength by constant slaughter. In such an environment, host’s stats are increased by 1% (Current Effect). There is a chance to obtain an opponent’s soul energy, and the boost from the domain extends to the deployer’s worshippers.] Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world/wmw-chapter-994","bookId":1513,"book":{"id":1513,"title":"Warlock of the Magus World","description":"What happens when a scientist from a futuristic world reincarnates in a World of Magic and Knights? An awesome MC — that’s what happens! A scientist’s goal is to explore the secrets of the universe, and this is exactly what Leylin sets out to do when he is reincarnated. Dark, cold and calculating, he makes use of all his resources as he sets off on his adventures to meet his goal. Face? Who needs that… Hmmm… that guy seems too powerful for me to take on now… I better keep a low profile for now. You want me to help you? Sure… but what benefit can I get out of it? Nothing? Bye. Hmmm… that guy looks like he might cause me problems in the future. Should I let him off for now and let him grow into someone that can threaten me….. Nahhh. *kill*","cover":"http://cunovel.com/img/WMW.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/warlock-of-the-magus-world","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
