{"id":16356,"no":14,"title":"CHAPTER XIII.","content":"The next morning, before going round to Gibbons\u0027, Mark saw his chief and told him of what had taken place on the previous evening. “I certainly did not think that you would succeed so soon; you believe that you will be able fairly to expose these fellows?” “I have no doubt whatever that I shall be able to expose one of them; and I have equally no doubt that if the others are arrested, either false cards or pockets for cards will be found upon them. What do you wish me to do, sir? I can, of course, expose any fellow I catch at it, but can do nothing about the others.” “I must have more than one captured,” the chief said. “At even the most irreproachable club there may be one blackleg, but if it is clear that this place is the haunt of blacklegs we can break it. There are half a dozen Acts that apply; there is the 11th Act of Henry VIII, statute 33, cap. 9, which prohibits the keeping of any common house for dice, cards, or any unlawful game. That has never been repealed, except that gaming houses were licensed in 1620. What is more to the point is that five Acts of George II, the 9th, 12th, 13th, 18th, and 30th, impose penalties upon the keepers of public houses for permitting gambling, and lay heavy penalties upon hazard, roulette, and other gambling games, on the keepers of gambling houses and those who play there. Having received complaints of several young men being rooked in the place, we can, if we prove that some of its frequenters are blacklegs, shut the place up altogether. We should do it quietly, and without fuss, if possible; but if we shut it up several others of the same sort will be certain to close their doors. But mind, there will probably be a desperate row, and you had better take pistols with you. I will have four men close at hand from ten o\u0027clock till the time the place closes, and if they hear a scrimmage, or you fire a pistol out of the window, they will rush in and seize all engaged in the row, and march them to the lock up. Of course you will have to be included.” Mark then went to Chetwynd. “Well, what did you think of it last night?” “Well, I own that it went against my grain to see that young fellow being victimized by a sharper.” “My dear Mark, you must not use such language as that. I fancy from what I have heard that the Honorable John is not altogether an estimable character, but to call him a sharper is going too far altogether.” “I don\u0027t think that it is, for from what I saw last night I am pretty well convinced that he did not play fair. I mean to go again tonight.” “But why on earth should you mix yourself up in such an affair, Mark? It is no business of yours; you are not an habitue of the place. Above all, it is extremely unlikely that you are right. There were some shady people there, no doubt, but there were also a good many gentlemen present, and as you know nothing of cards, as far as I know, it is the most unlikely thing in the world that you should find out that Emerson cheated when no one else noticed it.” “It is my business; it is the duty of every honest man to see that a poor lad like that should not be eaten up by a shark like Emerson. I don\u0027t care if there is a shindy over it. I shall not interfere unless I can prove that the man is cheating, in which case no man of honor would go out with him. I shall be glad if you and Boldero would go with me again this evening. I am not known there, and you are to a good many men, and Boldero to many more. I only want that, if I get into a row, you should testify to the fact that I am a gentleman, and ordinarily sane. If there is a row you will have an opportunity of seeing how much I have benefited by my lessons.” “Yes, I heard you were making tremendous progress. Jack Needham told me a month ago that you had knocked him out of time, and I went into Gibbons\u0027 yesterday morning with a man who wanted to buy a dog, and he told me that he considered that it was a great misfortune that you were an amateur, for that you only required another six months\u0027 practice, and he would then be ready to back you for a hundred pounds against any man in the ring. But about this affair, Mark. Are you really in earnest?” “I am, Dick, thoroughly in earnest; so would you be if you had spoken to Cotter last night, as I did. I tell you that if I had not given him a little hope that the thing might come out right, he would have blown out his brains today.” “Well, Mark, if you have set your mind on it, of course I will stick to you, though I have some doubts whether Cotter has any brains to speak of to blow out, else he would not be mad enough to back himself against Emerson and other men whom Boldero tells me he has been playing with.” “He has made an ass of himself, no doubt, Dick; but I fancy a good many fellows do that at one time or other of their lives, though not, I grant, always in the same way.” “Well, I will go, Mark. I need not ask Boldero, for he told me that he should look in again at ten o\u0027clock this evening, for he thought that another night\u0027s play would probably bring Cotter to the end of his tether.” Accordingly a little before ten they walked into the gambling house together. “Now, Dick, I want you, as soon as you sit down, to take your place in the front line within a yard or two of Emerson. I don\u0027t want you to be just behind him, but a short distance away; and I want you to keep your eye upon Sir James Flash, who, if I am not mistaken, will take up the same position that he did last night, near enough to Cotter to see his hand. You will remark, I have no doubt, as I did last night, that whenever Cotter has a bad hand, Flash will either close his eyes, or put his hand up to his mouth and stroke his mustache, or make some sign of that sort. When Cotter has a good hand he will stand perfectly still or look about the room. At any rate, he will make no sign—that, of course, is a guide to Emerson whether to propose or to refuse to allow Cotter to do so. I need not point out to you what a tremendous advantage the knowledge whether an opponent\u0027s hand is good or not gives him. Of course, while watching an hour\u0027s play I can only know that Flash was making signs, and that when he did so Cotter\u0027s hand was a bad one. It is possible that the manner in which the sign was made, either by closing his eye or twisting his mustache, or so on, may have been an intimation as to the suit in which Cotter was strongest or weakest.” “By Jove, this is a serious thing, Mark.” “It is a serious thing. I don\u0027t want you to get into a row with the fellow. I should like you to give me a nod when you have satisfied yourself that I was not mistaken. I will take upon myself to denounce the fellow, and to say what I noticed yesterday and you can back me up by saying that you saw the same thing. I have no doubt that I shall be able to convince every decent man there that my charge is well founded. I am going to watch Emerson. With the help he gets from Flash, he won\u0027t risk anything by cheating until it comes to a big stake like the last game yesterday, in which case, if Cotter\u0027s hand happens to be a strong one, he is likely to do so, and I fancy if he does I shall be able to catch him at it. You had better keep Boldero near you. You can whisper to him what you are watching Flash for, and get him to do so too; as, if I catch Emerson cheating, there is likely to be a row; he can lend a hand if necessary, and, at any rate, his joining in with you will suffice to show his friends that the thing is genuine.” “All right, Mark. I am interested in the matter now, and am ready for anything.” Soon after ten Cotter and Emerson again sat down, and, as usual, a lot of spectators gathered round the table. The game resembled the one on the previous evening. Mark placed himself\u0027 by the side of Cotter, a stranger stood immediately behind his chair, another member of the club was on the other side, and Sir James Flash stood partly behind him, so that although somewhat in the background he could obtain a view between their heads of Cotter\u0027s cards. Mark saw to his satisfaction that Dick and Boldero had secured the exact position that he wished them to take. For the first few games the play was even, and Dick began to think that Mark had been mistaken, for Flash appeared to take little interest in the game, and made no sign how Emerson should proceed. As soon as the stake rose to a hundred again he distinctly saw Flash close his eyes and play with his mustache; he called Boldero\u0027s attention to the fact, and found the latter, who had also been watching, had noticed it. By the time a few games had been played he verified Mark\u0027s assertion that these signs were signals that Cotter\u0027s hand was a bad one, and in each case Emerson played without giving his opponent the opportunity of discarding and taking in fresh cards. He and Dick nodded quietly to Mark, who had satisfied himself that so far Emerson had not cheated in any other way. As on the previous evening, Cotter, after losing five or six hundred pounds, proposed a final game of five hundred. Mark bent down his head, so that the intentness of his gaze should not be noticed, but from under his eyebrows he watched Emerson\u0027s every movement; suddenly he placed a foot on the edge of the chair of the man sitting in front of him, and with a sudden spring leaped upon the table, seized Emerson\u0027s hand, and held it up to the full length of his arm. “Gentlemen,” he shouted, “this fellow is cheating; there is a card in his hand which he has just brought from under the table.” In a moment there was a dead silence of surprise; then Mark forced the hand open and took Emerson\u0027s card, which he held up. “There, you see, gentleman; it is a king.” Then a Babel of sounds arose, a dozen hands were laid upon Emerson, who was pulled back from his chair and thrown down on a sofa, while hands were run over his coat, waistcoat, and breeches. “Here they are!” a man shouted, and held a dozen cards over his head. The place of concealment had been cleverly chosen; the breeches apparently buttoned closely at the knee, but in reality they were loose enough to enable a finger and thumb to be passed between them and the stocking, and in the lining of the breeches was a pocket in which the cards had been placed, being held there by two pieces of whalebone, that closed the pocket. The searchers, among whom were Dick and Boldero, did not have it all their own way; four or five men rushed upon them, and endeavored to pull them off Emerson. The din of voices was prodigious, but Mark, still standing on the table, stilled it for a moment by shouting: “The scoundrel has an accomplice, who this evening and yesterday has been signaling the strength of the cards in Mr. Cotter\u0027s hands.” “Who is he?” was shouted over the room. “It is Sir James Flash,” Mark said. “I denounce him as a cheat and a sharper.” As pale as death, Flash rushed to the table. “I don\u0027t know who you are, sir,” he said, in a tone of concentrated rage, “but you are a liar, and you shall answer for this in the morning.” “I will answer to any gentleman that calls me to account,” Mark said, in a ringing voice, “but I don\u0027t meet a man who has been expelled from White\u0027s for cheating, and who I have no doubt is well stocked with cards at the present moment, in readiness for the victim that he is next going to meet after the plucking of Mr. Cotter has been done. Now, gentlemen, search him and see if I am wrong; if I am I will apologize for that part of my accusation.” Flash drew a pistol from his pocket, but in an instant his arm was seized by those standing round him, and it exploded harmlessly. Among those who seized Flash was the man who had played with him the previous evening. In spite of his struggles and curses, and the efforts of his friends to rescue him, he too was thrown down and eight court cards were found concealed in his sleeve. The uproar while this was going on had been tremendous, but it was suddenly stilled as four men in dark clothes entered the room. Each held in his hand the well known symbol of his office, the little ebony staff surmounted by a silver crown. “I arrest all present in the name of the king,” one said, “for breaking the laws against gambling, and for brawling and the use of firearms. Now, gentlemen, resistance is useless; I must request that you each give me your card, and your word of honor that you will appear at Bow Street tomorrow morning.” “What is all this about, sir?” he asked Mark, who was still standing on the table. “Two fellows here have been caught cheating.” “What is your name and address, sir?” “My name is Mark Thorndyke, and I am a landed gentleman at Reigate; my friends Mr. Chetwynd and Mr. Boldero will bear this out.” “Who are the two men?” the constable asked. “The two fellows with torn clothes,” Mark said. “They are Mr. Emerson and Sir James Flash.” “You are certain of the charge that you are making?” “Quite certain; the cards have been found hidden upon them.” “Yes, yes!” a score of voices shouted; “they have been caught in the act of cheating.” “Take those two men into custody,” the constable said to two of his companions. “Who fired that pistol?” he went on. A number of voices shouted: “Sir James Flash; he attempted to murder Mr. Thorndyke.” The constable nodded to the man who had laid his hands on Sir James Flash, and in a moment a pair of handcuffs closed on his wrists. “You shall repent this!” Flash exclaimed furiously. “Calm yourself, Sir James,” the constable said calmly. “We know our duty, and do it whether a man is a peer or a peasant; you are accused of card sharping and an attempted murder.” “What is your address in town, Mr. Thorndyke?” he asked. “18 Villiers Street.” “Is there any charge against anyone else here? A good many of you seem to have your clothes torn and disarranged.” “Some fellows attempted to rescue Emerson and Flash while we were searching them; for what reason we can all pretty well imagine.” “I shall require the names in the morning of your assailants,” the constable said; “it looks very much as if they were confederates of the two prisoners. Now, gentlemen, you can all leave. This house is closed, and will not be opened again until this affair is thoroughly investigated.” In five minutes the house was deserted. “How can I thank you, Mr. Thorndyke?” Cotter, who was one of those who had seized Flash\u0027s arm, diverted his aim and searched him, said, when they got outside the house. “You have saved my life. It did not seem possible to me that you could succeed in showing that I was being cheated, and I had firmly resolved that, instead of allowing you to suffer loss, I would tomorrow morning make a clean breast of the whole affair to my father, as I had intended to have done this morning.” “If I might advise you, Mr. Cotter, I should say, carry out your intention as far as making a clean breast of it is concerned. Happily, you are free from debt, as those IOUs are worthless, for they were obtained from you by cheating, therefore you have no demand to make upon his purse. The police will, I have no doubt, endeavor to keep this thing quiet, but your name may come out, and it would be far better that your father should hear this story from you than elsewhere; and your assurance that you will never touch a card again, and the heavy lesson that you have had, will doubtless induce him to look at the matter leniently. It will, no doubt, be a painful story to tell, but it will be far better told by you.” “I will do it, sir; as you say, the lesson has been a heavy one, and henceforth my father shall have no reason to complain of me. May I call and see you tomorrow evening?” “Certainly. I shall be at home from seven to eight, after which hour I have an engagement. Good night.” Cotter walked on, and Mark fell back, and joined Dick and Boldero, who had fallen behind when they saw him speaking to Cotter. “Well, Mark, I congratulate you,” Dick Chetwynd said. “You did it wonderfully, though how on earth you knew that fellow had a card in his hand is more than I can guess.” “I felt sure he was going to cheat,” Mark said quietly; “I saw that Cotter\u0027s hand was a very strong one, and knew that Emerson would be aware that it was so, because he would receive no signal from Flash, therefore this was the time, if any, that he would cheat. He had been playing with both hands upon the table. I saw him withdraw one, there was a little pause, and then it came up again, and I had not a doubt in the world that there was a card in it, and that it had been hidden somewhere in his breeches, which is one of the best places of concealment, for his hand being under the table while getting at the card, no one present who was not behind the scenes, as I was, could detect him doing it.” “The wonder to me is,” Boldero said, “that while there were a number of men looking on closely, for Emerson has long been suspected of not playing fair, you, just fresh from the country, if I may say so, should have spotted him.” “That is easily explained,” Mark said. “Not wishing to fall a victim, I have of late been put up to a great many of these sharpers\u0027 tricks by a man who at one time had been in the trade himself.” “That was a capital idea, Mark,” Dick said. “I wish you would introduce me to him.” “I won\u0027t do that, Dick, but I shall be very glad to teach you all I know myself about it; but I fancy that after this you will be in no great hurry to enter a gambling hell again.” “That is so, Mark. I have never had any great inclination for play; but after this you may be quite sure that I will light shy of cards altogether. Still, I shall be glad if you will put me up to some of these tricks, for I may be able to some day save a victim of card sharpers, as you have done this evening.” The next morning, when those who had been present at the scene of the previous evening arrived at the office of the detectives in Bow Street, they were shown into some private rooms, and asked to wait. Cotter, Mark, and his two friends first had an interview with the chief. “You will understand,” the latter said, “that this is an altogether informal affair. I propose you first tell me your story as briefly as possible.” This was done. “Now, Mr. Cotter. I take it that you do not wish to prosecute?” “Certainly not. I would, in fact, give anything rather than appear in it.” “You have said that, in addition to the IOUs that you have given to the two men caught cheating, they hold others to the amount of some five or six thousand pounds, given by you to three other frequenters of the club. In fact, these papers have been found in Emerson\u0027s pocketbook; he told you, I believe, that he had taken them up, so that you should not be inconvenienced by them. I understand, then, that you will be quite content if you get these IOUs back again; those given to Emerson and Flash are, of course, worthless. After what has happened, they could not be presented, but probably you might have trouble about the others, for, though I have no doubt that the whole of the men were in league together, we have no means of absolutely proving it.” “I shall be more than content, sir; I have no wish to prosecute.” “We are glad,” the chief said, “to be able to close a dangerous place; and as the exposure will put a stop to the career of these two men, and no doubt alarm a good many others, we don\u0027t care about taking the matter into court. Such gross scandals as this are best kept quiet, when there is no object in ventilating them. Therefore, gentlemen, as Mr. Cotter is willing to do so, we shall let the matter drop. I shall be obliged if you will step into the next room, however, until I have seen these three men.” When they had left, the three were brought in. “You have been concerned, sirs,” the chief said sternly, “in winning large sums of money from the Hon. William Denton, from Mr. James Carew, from Mr. William Hobson, and others; in all of these cases the two men caught cheating last night were also concerned. You all hold notes of hand of Mr. Hobson. I shall advise that gentleman\u0027s father to refuse to pay those notes, and promise him that if any further request for payment is made I will furnish him with such particulars for publication as will more than justify him in the eyes of the world in refusing to honor them. You, as well as Mr. Emerson and Sir James Flash, have won large sums from Mr. Cotter, and the fact that the IOUs he gave you were found on Mr. Emerson points very strongly to their being in confederacy with you in the matter; at any rate, they point so strongly that, whether a jury would convict or not on the evidence that we shall be able to lay before them, there can be no question whatever as to what the opinion of men of honor will be. These IOUs are in our hands. Mr. Cotter does not desire to pursue the case; he will, however, refuse absolutely to pay those IOUs, and in doing so he will have the approval of all honorable men. That being so, the IOUs are absolutely useless to you, and if you will agree to my tearing them up now, he has most kindly consented to let the matter drop in your cases.” The three men, who had all turned very white when he was speaking, now protested angrily against imputations being made on their honor. “Well, sirs,” the officer said, “in that case the matter can, of course, go on. You know best what the feeling will be as to these IOUs. They will form an important item of evidence against you, you will see. As the matter stands, either you gave them to Emerson to collect for you, without any money passing between you—a very strange procedure, which you will find it difficult to explain—or else he gave you the coin for them, and you passed them over to him, and have, therefore, parted with all claim on Mr. Cotter on your own account. Of course I impound them with the other IOUs as proof of a conspiracy between you. Now, sirs, am I to tear them up or not?” The three men looked at each other, and then one of them said: “We protest altogether against the assertion, sir, but at the same time, as there can be little doubt that Emerson and Sir James Flash have played unfairly, and we do not wish any association of our names with theirs, we are perfectly willing that the IOUs, which, under the circumstances, we should never have dreamt of presenting, should be destroyed.” “I think that you have chosen wisely,” the chief said dryly. “It is a pity that you did not do so at first. These are the IOUs he gave to one or other of you. Perhaps it would be pleasanter for you to destroy them yourselves.” The three men took the papers with their names on them and tore them up. “Thank you,” he went on sarcastically. “That will place you in a better position. You will be able to tell your friends that you felt so indignant at the manner in which Mr. Cotter had been swindled by Emerson and Flash that you at once destroyed his IOUs for the sums that you had won of him. But, gentlemen,”—he spoke sternly now,—“remember that we have a long list against you, and that the next victim, or let us say his father, might be more disposed to push matters to their full length than is Mr. Cotter. Remember, also, that we keep ourselves acquainted with what is going on, and that should trouble arise we shall produce all the complaints that have been made against you, and shall also mention your connection with this affair, in which, as I understand, you all did your best to prevent those two fellows from being searched.” Without saying another word the three men went out of the room, too crestfallen to make even an attempt at keeping up their air of indignation. The others were then called in. “I am sorry, gentlemen,” he said, “that you have had the trouble of coming here, for the gentleman swindled has declined to prosecute the swindlers, and you will understand that he is somewhat anxious that his name should not appear in the matter. Fortunately, as instead of paying in cash he gave IOUs for his losses, he will not be a loser to any large amount by these transactions. I may say that the proprietor of the hell has been there this morning, and to avoid trouble he has consented to close his place for good. I have only to remark that I should advise you, gentlemen, in future, only to indulge in gambling in places where you may be fairly assured of the character of the men you play with. I think, in conclusion, that you may all feel grateful to Mr. Cotter for refusing to prosecute. It has saved you from having to appear in court as witnesses in so utterly disreputable an affair.” There was a general murmur of assent, and in a minute or two the room was clear. Flash and Emerson were then brought in, with a constable on each side of them. “Mr. Cotter has, I regret to say, declined to prosecute, and Mr. Thorndyke has done the same with regard to Sir James Flash\u0027s use of his pistol. You have, therefore, escaped the punishment due to swindlers at cards. It is the less matter, as you are not likely to have an opportunity of making fresh victims, for the story will be known by this afternoon in every club in London. These IOUs will be of no use to you—they are not worth the paper on which they are written. However, I shall take it upon myself to hand them back to Mr. Cotter, to prevent the possibility of their getting into other hands and giving him trouble. “You can unlock those handcuffs, constable; these men are at liberty to go, and if they will take my advice they will lose no time in crossing the water and establishing themselves somewhere where their talents are likely to be better appreciated than they are here. They can go; one of you can call a hackney coach for them if they wish it. They will scarcely care to walk with their garments in their present condition.” Then the chief went into the next room. “There is an end of that affair, Mr. Cotter. Here are the IOUs you gave to those two swindlers. Those you gave to the other three men, who were no doubt their confederates, have been torn up by them in my presence. They declare that after seeing how shamefully you had been victimized they had not the slightest idea of ever presenting them.” “I am sure that I am extremely grateful to you,” Cotter said. “I know that I have behaved like a madman, and that I don\u0027t deserve to have got off as I have done. It will be a lesson to me for life, I can assure you.” On leaving, Dick Chetwynd walked for some distance with Mark—as far as Gibbons\u0027 place in St. Giles. “There is one thing which I cannot understand,” he said, “and that is how it was that the constables happened to be so close at hand, just at the time they were wanted.” “Well, you see, Dick, my relations with Bow Street are just at present of a somewhat close nature, for they are aiding me in the search that I told you that I was making for my father\u0027s murderer. The consequence was that I had only to mention to the chief that I fancied I had detected cheating at that place, and that there was a likelihood of a row there last night, and he at once said he would send four men, to come in if they heard a rumpus; and he was, indeed, rather glad of an opportunity for breaking up the place, concerning which he had had several complaints of young men being plucked to the last feather. Well, it was lucky they came. I don\u0027t say that it would have made any difference, because I think our side was a great deal stronger than they were, still it would have led to a nasty row, and perhaps to half a dozen duels afterwards. Well, I will say goodby now. I am very glad that the affair has been dropped; it would not have mattered so much to me, as I am single and my own master, but there were a good many men there who would have been ready to have paid up handsomely rather than that their names should appear in connection with a row at a gambling house.” At seven o\u0027clock in the evening Philip Cotter called at Mark\u0027s lodgings, accompanied by his father, who, as he came in with him, advanced at once to Mark and shook him warmly by the hand. “My son has told me everything, Mr. Thorndyke,” he said, “and I cannot thank you sufficiently for the noble part you took in rescuing him from the terrible effects of his folly. I have been down here twice this afternoon, for I felt that I could not rest until I had shaken you by the hand. It is not the question of money so much, though that would have been a serious loss to me, but it is the saving of my son\u0027s life, and the saving of the honor of our name.” “I am glad indeed to have been of service, Mr. Cotter, and I trust that you have consented to forgive the folly that he has committed, and which I feel sure will never be repeated.” “Yes. It was a heavy blow to me, Mr. Thorndyke, when Philip told me; but as he has sworn most solemnly never to touch a card again, and as I feel sure that the lesson cannot but be a useful one to him all his life, I have agreed to say no more about it, and let the matter drop altogether. He has been fortunate to have escaped so easily. He has told me of the noble offer you made to pay his losses if you should not be able to prove that he was being cheated.” “I was not committing myself heavily,” Mark said with a smile. “I had seen enough to be absolutely certain, and was sure that I should be able to bring it home to them.” “But it was at a considerable risk to yourself, Mr. Thorndyke. As it was, you had a narrow escape of being shot.” “Not a very narrow escape,” Mark replied. “With so many men standing round him and their attention called to him, it was certain that he would be seized before he could take aim at me. I had pistols in my pocket, and was prepared to fire in an instant, but I saw at once that there was no occasion for that.” “But I cannot imagine how you should have detected the cheating,” the banker said. “You are younger than my son, and he said that you told him that you had only recently come up to London. It is astonishing that while experienced players should never have noticed that anything was wrong you should have discovered it.” “The explanation is simple, Mr. Cotter. I have no inclination for play myself, but I happened a short time since to fall in with a man who was well acquainted with all the various methods of card sharping. I thought that a knowledge of that might some day be useful, and I got him to put me up to a number of the tricks of card sharpers both at home and abroad. Having these fresh in my mind, and seeing that your son was playing with a man whose reputation I knew to be bad, I naturally concentrated my attention upon him, and was not long in discovering that he had a confederate standing behind your son\u0027s chair. Being a stranger in the place, I could not denounce him, but the next night I set two friends to watch that method of cheating, while I kept my eyes fixed on Emerson\u0027s hands. As I anticipated, there was nothing suspicious about his movements so long as play was comparatively low, for the advantage that he gained from his confederate enabled him to be sure of winning in the long run; it was only in the last game, which was a high one, that, as he knew that your son had a strong hand, he was tempted to stock his hand with false cards; and watching closely, I had no difficulty in detecting his method.” “Well, sir, you have, at any rate, laid us both under the deepest obligation. Is there any possible way in which we can show our gratitude?” Mark thought for a moment. “In one way you might do me a favor, Mr. Cotter. A ward of my father\u0027s, who will inherit some property when she comes of age, is at present finishing her education in town, and is living with a lady who has been her friend and companion since childhood. I have a good many acquaintances, but they are all bachelors; and having been living down at my father\u0027s place, near Reigate, for so many years, the ladies have no acquaintances in London. They live at Islington, and their life is a very dull one. I am anxious, for several reasons, that the young lady should have the advantage of going somewhat into society. Hitherto I have had no means of introducing her. If it is not too much to ask, Mr. Cotter, I should be extremely glad and obliged if Mrs. Cotter would call on them and give them an introduction into society. The lady with my father\u0027s ward is the widow of a captain in the Indian Army, and is in all ways a very charming person, and has been at the head of my father\u0027s establishment for the last twelve years.” “With the greatest pleasure in the world, Mr. Thorndyke. I am only sorry that it is so slight a thing that you ask of me. I have thought it but right to tell my wife what has passed, and I had difficulty in persuading her not to come with me this evening to also express her gratitude to you. She will be pleased indeed to call upon your friends at once, and I am sure she will do so tomorrow. I was going to ask you to dine with us, and I hope that you will do so. We shall have no one else, and I hope that you will be able to arrange to meet your friends at our house a few days later.” The next morning Mark called on Mrs. Cunningham. “I think you will have a visitor today,” he said. “It has happened that I have been able to do a service to the son of Mr. Cotter, a wealthy banker. I am going to dine there this evening. He asked me about my friends in London, and I mentioned that my only lady friends were you and Millicent. He asked a few questions as to where you were living, and so on, and said that his wife would have much pleasure in calling and introducing Millicent into society. As your life is very dull here, and it is clearly very desirable that Millicent should go into society, I gladly accepted the offer, and I believe that she will call today.” “That will be very nice indeed, Mark. Millicent is not complaining, but she must have felt it very dull. I have even felt it so myself after the cheerful society we had at home.” “I don\u0027t know that I shall like it,” Millicent said doubtfully. “Oh, yes, you will, Millicent; and besides, it will be good for you. It is not natural for a girl of your age to be here without friends, and I shall be very glad to know that you are going to mix a little with other people.” Mrs. Cotter called that afternoon, and three days later Mark met Mrs. Cunningham and Millicent at a dinner party at the banker\u0027s, and Mrs. Cotter introduced them very warmly to several of her friends, with the result that in a very short time they were frequently invited out, while they became very intimate with the banker and his wife, and often spent the day there. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3091/85288.html","bookId":953,"book":{"id":953,"title":"Colonel Thorndyke\u0027s Secret","description":"简介： Squire Thorndyke, of the Manor House of Crawley, was, on the 1st of September; 1782, walking up and down the little terrace in front of the quaint old house in an unusually disturbed mood. He was a man of forty three or four, stoutly and strongly bui...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3091","creation":"Aug 1, 2019 12:23:58 AM","modification":"Aug 1, 2019 12:23:58 AM"}}
