{"id":16365,"no":23,"title":"CHAPTER XXII.","content":"It was not until Easter that Mark Thorndyke and his wife returned to England. They had spent the greater portion of that time in Italy, lingering for a month at Venice, and had then journeyed quietly homewards through Bavaria and Saxony; They were in no hurry, as before starting on their honeymoon Mark had consulted an architect, had told him exactly what he wanted, and had left the matter in his hands. Mrs. Cunningham had from time to time kept them informed how things were going on. The part of the house in which the Squire\u0027s room had been situated was entirely pulled down, and a new wing built in its stead. Millicent had been specially wishful that this should be done. “I don\u0027t know that I am superstitious, Mark,” she had said, “but I do think that when a murder has taken place in a house it is better to make a complete change. The servants always think they see or hear something. That part of the house is avoided, and it is difficult to get anyone to stay there. I think it is very much more important to do that than it is to get the house refurnished; we can do anything in that way you like when we get back, but I should certainly like very much to have the great alteration made before we return.” The architect was a clever one, and the house, which was some two hundred years old, was greatly improved in appearance by the new wing, which was made to harmonize well with the rest, but was specially designed to give as much variety as possible to the general outline. Millicent uttered an exclamation of pleasure when they first caught a glimpse of the house. As they rode through the village they were again welcomed as heartily as they were on their wedding day. Mrs. Cunningham received them; she had been established there for a month, and had placed the house entirely on its old footing. They first examined the new portion of the house, and Millicent was greatly pleased with the rooms that had been prepared for them, Mark having requested Mrs. Cunningham to put the furnishing into the hands of the best known firm of the day. “I have asked,” Mrs. Cunningham said, “the Rector and his wife and Mr. Chetwynd to dine with us this evening; they can scarcely be termed company, and I thought that you might find it pleasant to have these old friends here the first evening. There is a letter for you on the library table, Mark; it may almost be called a packet; it has been here nearly a month.” In our days a newly married couple would find on their return from foreign travel basketfuls of letters, circulars, and catalogues from tradesmen of all kinds; happily, our forefathers were saved from these inflictions, and Mark at once went to the library with almost a feeling of surprise as to who could have written to him. He saw at once that it was a ship\u0027s letter, for on the top was written, “Favored by the Surinam.” “Why, it is Ramoo\u0027s writing. I suppose he gave it to someone he knew, and that instead of its being put in the mail bag in India, he brought it on with him. What a tremendously long epistle!” he exclaimed, glancing his eye down the first page, and then a puzzled expression came across his face; he sat down and began to read from the first slowly and carefully. “HONORED SAHIB: “I do not know why I should write to tell you the true history of all these matters. I have thought it over many times, but I feel that it is right that you should know clearly what has happened, and how it has come about, and more especially that you should know that you need never fear any troubles such as those that have taken place. I am beginning to write this while we are yet sailing, and shall send it to you by ship from the Cape, or if it chances that we meet any ship on her way to England, our letters may be put on board her.” “Why, this letter must be more than a year old,” Mark said to himself. There was no date to the letter, but, turning to the last sheet, he saw as a postscript after the signature the words, “January 26th.—A ship, the Surinam, is lying a short distance from us, and will take our letters to England.” “Yes, it must be a year old; but what he means by the way he begins is more than I can imagine;” and he turned back to the point at which he had broken off. “I would tell it you in order as it happened. I, Ramoo, am a Brahmin. Twenty years ago I was the head priest of a great temple. I shall not say where the temple was; it matters not in any way. There was fighting, as there is always fighting in India. There were Company\u0027s Sepoys and white troops, and one night the most sacred bracelet of the great god of our temple was stolen.” “Good Heavens!” Mark exclaimed, laying down the letter. “Then it has been Ramoo who has all this time been in pursuit of the diamonds; and to think that my uncle never even suspected him!” Then suddenly he continued, “now I understand why it was my life was spared by those fellows. By Jove, this is astounding!” Then he took up the letter again. “Two of the Brahmins under me had observed, at a festival the day before the bracelet was lost, a white soldier staring at it with covetous eyes. One of them was in charge of the temple on the night when it was stolen, and on the day following he came to me, and said, \u0027I desire to devote my life to the recovery of the jewels of the god. Bondah will go with me; we will return no more until we bring them back.\u0027 \u0027It is good,\u0027 I said; \u0027the god must be appeased, or terrible misfortunes may happen.\u0027 Then we held a solemn service in the temple. The two men removed the caste marks from their foreheads, prostrated themselves before the god, and went out from amongst us as outcasts until the day of their death. Two months later a messenger came from the one who had spoken to me, saying that they had found the man, but had for a long time had no opportunity of finding the bracelet. Then Bondah had met him in a lonely place, and had attacked him. Bondah had lost his life, but the soldier was, though sorely wounded, able to get back to his regiment. He had died, but he had, the writer was convinced, passed the jewels on to a comrade, whom he would watch. Then I saw that one man was not sufficient for such a task. Then I, too, the Chief Brahmin of the temple, saw that it was my duty to go forth also. “I laid the matter before the others, and they said, \u0027You are right; it is you who, as the chief in the service of the god, should bring back his jewels.\u0027 So again there was a service, and I went forth as an outcast and a wanderer, knowing that I must do many things that were forbidden to my caste; that I must touch unclean things, must eat forbidden food, and must take life if needs be. You, sahib, cannot understand how terrible was the degradation to me, who was of the purest blood of the Brahmins. I had taken the most solemn vows to devote my life to this. I knew that, whether successful or not, although I might be forgiven my offense by the god, yet that never again could I recover my caste, even though the heaviest penances were performed. Henceforth, I must stand alone in the world, without kindred, without friends, without help, save such as the god might give me in the search. “I was rich. The greater part of my goods I gave to the temple, and yet retained a considerable sum, for I should need money to carry out my quest, and after I had accomplished it I should hand over what remained for the benefit of the poor. I should myself become a fakir. I want you to understand, sahib, that henceforth I had but one object in life, a supreme one, to accomplish, in which nothing must stand in my way, and that what would be in others a crime was but a sacrifice on my part, most acceptable to the god. I journeyed down to the place where my comrade was, dressed as one of the lowest class, even as a sweeper, and he and I strove by all the means in our power to discover what this man had done with the jewels. Night after night we crawled into his tent. We searched his bed and his clothes. With sharp rods we tried every inch of the soil, believing that he had hidden the diamonds underground, but we failed. “There my comrade said, \u0027I must give my life to find out where he hides these things. I will watch night after night by the door of his tent, and if he comes out I will stab him; it shall be a mortal wound, but I will not kill him outright. Before he dies he will doubtless, as the other did, pass the jewels on to some comrade, and then it will be for you to follow him up.\u0027 \u0027It is good,\u0027 I said. \u0027This man may have hidden them away somewhere during the time they have marched through the country. In spite of the watch you have kept he may have said to himself, “I will return, though it be years hence.” Your plan is good,\u0027 I said. \u0027I envy you. \u0027Tis better to die thus than to live in sin as we are doing.\u0027 “That evening the man was stabbed, but an officer running up killed my comrade. The soldier was taken to the hospital, and I lay down beside the tent with my eye to a slit that I had cut, and watched till morning. “Then I took my broom and swept the ground. I had not been hired as one of the camp sweepers, and so could move about and sweep where I chose. No one ever asked me any questions. The soldiers heeded me no more than if I had been a dog, and, of course, supposed that I was acting by the order of the head of the sweepers. Presently I saw one of the servants of the hospital go across to the tent of the officer who had killed my comrade. He came over and went into the hospital tent. I felt sure that it was the wounded man who had sent for him. He was in there some time. Presently a soldier came out and went to the tent of the wounded man, and returned bringing a musket. Then I said to myself, \u0027The god has blinded us. He wills that we shall go through many more toils before we regain the bracelet.\u0027 Doubtless the man had carried the bracelet in his musket all the time, and we, blind that we were, had never thought of it. “Presently the officer came out again. I noticed that as he did so he looked round on all sides as if to see if he were watched. Then I knew that it was as I had thought: the soldier had given the bracelet to him. At this I was pleased; it would be far more easy to search the tent of an officer than of a soldier, who sleeps surrounded by his comrades. I thought that there was no hurry now; it would need but patience, and I should be sure to find them. I had not calculated that he would have better opportunities than the soldier for going about, and that, doubtless, the soldier had warned him of his danger. Two hours later the officer mounted his horse and rode towards the camp of another regiment, a mile and a quarter away. There was nothing in that; but I watched for his return all that day and all that night, and when he did not come back, I felt that he was doing something to get rid of the diamonds. “He was away three days, and when he returned I was almost sure that he had not the diamonds about him. As he had ridden off he had looked about just as he had when he left the hospital: he was uneasy, just as if he was watched; now he was uneasy no longer. Then I knew that my search would be a long one, and might fail altogether. I went away, and for three months I prayed and fasted; then I returned. I bought different clothes, I painted my forehead with another caste mark, then I bought from the servant of an officer in another regiment his papers of service: recommendations from former masters. Then I went to the officer—you will guess, sahib, that it was the Major, your uncle—and I paid his servant to leave his service, and to present me as a brother of his who had been accustomed to serve white sahibs, and was, like himself, a good servant; so I took his place. “He was a good master, and I came to love him, though I knew that I might yet have to kill him. You have heard that I saved his life three times; I did so partly because I loved him, but chiefly because his life was most precious to me, for if he had died I should have lost all clew to the bracelet. I had, of course, made sure that he had not got them with him; over and over again I searched every article in his possession. I ripped open his saddle lest they might be sewn up in its stuffing. All that could be done I did, until I was quite sure that he had not got them. He, on his part, came to like me. He thought that I was the most faithful of servants, and after the last time I saved his life he took me with him everywhere. He went down to Madras, and was married there. I watched his every movement. After that he went down frequently. Then a child was born, and six months afterwards his wife died. “The regiment was stationed at the fort. At that time he was at many places—the governor\u0027s, the other officer sahibs\u0027, the merchants\u0027, and others\u0027. I could not follow him, but I was sure by his manner that he had not taken back the bracelet from whoever he had sent it to. I knew him so well by this time that I should have noticed any change in his manner in a moment. At last the child went away in the charge of Mrs. Cunningham. I bribed the child\u0027s ayah, and she searched Mrs. Cunningham\u0027s boxes and every garment she had, and found no small sealed parcel or box amongst them. Three years more passed. By this time the Colonel treated me more as a friend than as a servant. He said one day, laughing, \u0027It is a long time since my things have been turned topsy turvy, Ramoo. I think the thieves have come to the conclusion that I have not got what they are looking for.\u0027 \u0027What is that, sahib?\u0027 I asked. \u0027Some special jewels,\u0027 he said. \u0027They are extremely valuable. But I have got them and a lot of other things so safely stowed that no one will ever find them unless I give them the clew.\u0027 \u0027But suppose you are killed, sahib,\u0027 I said; \u0027your little daughter will never get the things.\u0027 \u0027I have provided for that,\u0027 he answered. \u0027If I am killed I have arranged that she shall know all about it either when she comes to the age of eighteen or twenty-one.\u0027 “A few weeks after that he was wounded very badly. I nursed him night and day for weeks, and when he came to England he brought me with him. As you know, sahib, he died. When he was in London he went to see Mrs. Cunningham and the child, and several times to the office of the lawyer who attended your father\u0027s funeral. Then he came down to your father, and I know he had long and earnest conversations with him. I did all I could to listen, but the Colonel always had the windows and doors shut before he began to speak. I could see that your father was troubled. Then the Colonel died. After his death I could never find his snuff box; he had carried it about with him for some years; once or twice I had examined it, but it was too small for the diamonds to be hidden in. I suppose that he had given it to the sahib, your father, but as I could never find it I guessed that there was some mystery attached to it, though what I could not tell. “Then your father took me down to Crowswood with him, and Mrs. Cunningham and the little girl came down. I was surprised to find that your father seemed to be master of the estate, and that no one thought anything of the child, whose name had been changed. I spoke one day to Mrs. Cunningham about it; your father seemed to me a just and good man, and I could not believe that he was robbing his brother\u0027s daughter. Mrs. Cunningham told me that the Colonel did not wish her to be known as an heiress, and that he had left the estate to his brother until she came of age. Your father was as good a master as the Colonel had been. I watched and watched, and once or twice I overheard him talking to himself in the library, and discovered that your father himself was altogether ignorant of the hiding place of the property that the Colonel had mentioned in his will. I knew then that I should have to wait until the child was either eighteen or twenty-one. “It was a long time, but I had learnt to be patient. I was not unhappy; I loved your father, I loved the Colonel\u0027s little daughter; and I was very fond of you. All these things were small to me in comparison to my vow and the finding the jewels of the god, but they shortened the years of waiting. Then a year before the young mistress was eighteen came the shot through the window. I did not know who had fired it, but I saw that your father\u0027s life was in danger, and I said to myself, \u0027He will tell the young sahib what he knows about the bracelet.\u0027 After you had gone into the library I opened the door quietly, and listened. I could hear much that was said, but not all. I heard him say something about a snuff box, and some means of finding the lost things being hidden in it, and that he had kept them all these years in a secret hiding place, which he described. You were to search for the diamonds, and I guessed from that that he did not know what he was to be told when the young memsahib came of age, or perhaps when she was eighteen. It was not until I had thought over what I heard that I came to the conclusion that if I could find the things he spoke of I might be able to find the jewels. By that time your father had gone to bed. I was foolish not to have been patient, but my blood boiled after waiting for eighteen or nineteen years. The god seemed to have sent me the chance, and it seemed to me that I should take it at once. I knew that he generally slept with his window open, and it seemed to me that it would be easy to slip in there and to get those things from the cabinet. I knew where the ladder was kept. I took a file from the tool chest and cut the chain.” Here Mark dropped the letter in horror. “Good Heavens!” he exclaimed. “Then Bastow spoke truly, and he was not my father\u0027s murderer! Never did a single suspicion of Ramoo enter my head. This is appalling; but I cannot read any more now. It is time for me to go and dress for dinner.” “Is anything the matter with you, Mark?” Millicent asked anxiously, as she met him in the drawing room; “you look as white as a sheet.” “I have been reading Ramoo\u0027s letter, and he has told me some things that have surprised and shocked me. I will tell you about them after dinner, dear. It is a long story, but you won\u0027t have to wait until Dick and the Gregs are gone. They are interested in all that interests us, and shall hear the letter read. No; I think I will ask them and Dick to come in the morning. I should not like anything to sadden the first evening of our coming home.” “Then it is something sad.” “Yes, but it does not affect us, though it does affect Ramoo. Now clear your brow, dear, and dismiss the subject from your mind, else our guests will fancy that our marriage has not been altogether so satisfactory as they had hoped.” “As if they could think such a thing as that, Mark,” she said indignantly. “But there is the sound of wheels; it is Mr. Chetwynd\u0027s gig.” The three visitors all came in together, having met at the door. Mark, with a great effort, put aside the letter from his mind, and a cheerful evening was spent. They had much to tell of their travels, many questions to ask about the parish and their mutual friends and the neighborhood generally, and when they rose to go Mark said: “Would you mind riding over again tomorrow morning, Dick? I have a letter to read to you that will interest you greatly.” “Certainly. What time shall I be here?” “Say at eleven o\u0027clock. It is a long epistle, and will take us an hour to get through; after that we can stroll round, and, of course, you will stop to lunch. “I should be glad if you and Mrs. Greg can come over too,” he added, turning to the Rector; “you will be much interested also in the matter.” The next day the party met in the library at the hour named. “I may tell you, Mr. Greg, that I specially asked you and your wife here because this letter throws some light on Arthur Bastow\u0027s connection with my father\u0027s murder; you were friends with his father, and I think you ought to know. As to you, Dick, the letter will interest you from beginning to end, and will surprise as much as it will interest you.” “Even I don\u0027t know what it is, Mrs. Greg,” Millicent said. “I know it quite upset Mark yesterday, but he said he would sooner I did not know anything about it until today, as he did not want me to be saddened on the first evening of our return home. Now, please go on, Mark; you have said quite enough to excite us all.” Mark had read but a short distance when Dick Chetwynd exclaimed: “Then Ramoo was at the bottom of that Indian business, after all. I almost wonder you never suspected it, Mark.” “Well, I hardly could do so,” Mark said, “when my uncle was so fond of him, and he had served him so faithfully.” As he approached the point at which he had laid down the letter on the previous evening, Millicent\u0027s color faded. Suddenly an exclamation of horror broke from her when he read the last line. “Oh, Mark,” she said, with quivering lips, “don\u0027t say it was Ramoo. He always seemed so kind and good.” “It was here I stopped last night,” he said, “but I fear there can be no doubt about it. I must say that it is evident from this letter, that no thought of doing my father harm was in his mind when he placed that ladder against the window. Now I will go on.” The letter continued as follows: “Having placed the ladder, I clambered to the window and quietly entered the room. It was quite dark, but I knew the place of every piece of furniture so well that I was able to go without hesitation to the cabinet. Your father was speaking very slowly and distinctly when he told you how it was to be opened, and I was able to do it easily, but I did not know that the back opened with a sharp click, and the noise startled me and woke your father. In an instant he was out of bed and seized me by the throat. Now, he was a much stronger man than I was. I struggled in vain. I felt that in a moment I should become insensible; my vow and my duty to the god flashed across me, and scarce knowing what I did, I drew a little dagger I always carried, and struck blindly. He fell, and I fell beside him. For a time I was insensible. When I recovered I was seized with the bitterest remorse that I had killed one I loved, but I seemed to hear the voice of the god saying, \u0027You have done well, Ramoo. I am your great master, and you are bound to my service.\u0027 “I got up almost blindly, felt in the cabinet, and found a coin and a piece of paper, and a feeling of exultation came over me that, after nearly twenty years, I should succeed in carrying out my vow and taking his bracelet back to the god. I descended the ladder, crept in the back door by which I had come out, went up to my room, where I had kept a light burning, and examined my treasures. Then I saw that all had been in vain. They were doubtless a key to the mystery, but until a clew was given they were absolutely useless. I sat for hours staring at them. I would have gone back and replaced them in the cabinet and left all as it had been before, but I dared not enter the room again. The next day I heard you say that you suspected that the talk with your father had been overheard, and that the man who had earlier in the evening before shot at him had returned, and while listening had heard something said about the hiding place, and thought that he would find some sort of treasure there. I thought that in the talk your father might have told you how to use these things, though I had not caught it, and it was therefore important that you should have them back again, so I went into the room after the inquest was over, and placed the things in their hiding place again. “Then, thinking it over, I determined to leave your service. You would be trying to find the treasure, and I must watch you, and this I could not do as long as I was a house servant; so I came up to London, and you thought I had sailed for India, but I did not go. I hired four Lascars, men of my own religion, and paid them to watch every movement that you made, to see where you visited and where you went. I paid them well, and they served me well; it was so that I was able to bring those men to your help when but for that you would have lost your life. It was for this to some extent that I had you followed; for I soon found out that you were on the search for the man who had fired through the window, and who you believed had killed your father, rather than for the jewels. I knew that you might run into danger, and partly because I loved you, and partly because it was possible that it would be essential for that coin and piece of paper to be produced in order that the treasure might be obtained, I kept guard over you. “When the 18th of August approached we were all on the watch. I felt sure that you would take every possible precaution while you had the bracelet in your possession. We knew who were your principal friends, the banker\u0027s son and Mr. Chetwynd. On the 18th of August everything went on as usual. On the following day the banker\u0027s son came to you, and as soon as he left you, you went to the lawyer\u0027s, and afterwards to the banker\u0027s. I felt sure now that it was at that bank that the jewels had been placed, and that you had been waiting till the young memsahib\u0027s birthday for the news that they might be taken out; then you went to Mr. Chetwynd\u0027s, and he went to the bank. I had no doubt that he was to take them out for you, and after that one of the men never took his eyes off him when he was outside of his house. Afterwards you went to the place where the men used to fight, and the man who was watching you went in, and had beer, and saw you talking with the big man you used to fight with, in the parlor behind the bar. The watcher went out to follow you, but left another to watch this man. We found that both Mr. Chetwynd and he went to a shipping office in Tower Street, and we then guessed that you intended to take the bracelet at once across the sea. “I went myself and found out that a vessel was sailing in two days to Amsterdam. I took a passage for a man in the cheap cabin, and asked to look at the list of passengers, as I believed that some friend would be sailing by her; there were two men\u0027s names down together in one handwriting among the first class passengers, and I guessed that these were you and Mr. Chetwynd. I also saw the name of the big man, which I had heard long before, down in the list of passengers, and another name next to his in the same handwriting. I did not know his name, but guessed that it was another of the fighting men, and that they were going to look after you until you had got rid of the diamonds. On the morning that she was to sail one of the Lascars was on board; I thought it possible that in order to throw anyone who might be following you off your scent you might at the last moment go ashore, and that Mr. Chetwynd might take the diamonds over, so I watched, and saw you on the deck with your friend. “I and the other three Lascars then took passage that evening in a craft for Rotterdam, and got to Amsterdam two days before your ship arrived; we went to different houses, and going separately into the worst parts of the town, soon found a man who kept a gambling den, and who was a man who could be trusted. I offered him a thousand francs to collect twenty-five men, who were to be paid a hundred francs each, and to be ready, if your ship arrived after dark, to attack two passengers I would point out to them. I did not want you to be hurt, so bargained that all knives were to be left behind, and that he was to supply the men only with clubs. If the ship came in in daylight you were to be attacked the first time you went out after dark. You know how that was carried out. You had two more men with you than I had expected; but I thought that with a sudden rush you might all be separated. You know the rest. The moment you were knocked down I and three others carried you to a boat. It had been lying near the stairs, and we took you off to the barge in which I had arranged you should be taken to Rotterdam. “We told them that you were a drunken man who had been stunned in a fight in a public house. As soon as we were off, I searched you and found the diamonds. Then, as you know, we put you ashore. We all crossed to England that night. Two days later I sailed in this ship, the Brahmapootra. I am not afraid of telling you this, because I know that the diamonds will not shine on the god\u0027s arm until all fear of search and inquiry are over. My task will be done when I hand them over to the man who holds the office I once held; then I shall bear the penances imposed on me for having broken my caste in every way, and for having taken life, and for the rest of my days I shall wander as a fakir through India. I shall be supported by the knowledge that I have done my duty to my god, and have sacrificed all in his service, but it will ever be a grief to me that in so doing it was necessary to sacrifice the life of one who had ever shown me kindness. You may wonder why I have written this, but I felt that I must own the truth to you, and that you should know that if in the course of my duty to the god it was my misfortune to slay your father, I have twice saved your life, just as three times I saved that of the Colonel Sahib, your uncle.” There was silence for some little time after Mark had finished reading. “It is a strange story indeed,” Mr. Greg said, “but it is not for us to judge the man. He has acted according to his lights, and none can do more. He sacrificed himself and his life solely to the service of his god, well knowing that even were he successful, his reward would be penance and suffering, and a life of what cannot but be misery to a man brought up, as he has been, to consider himself of the highest and holiest rank of the people. I think, Mark, we need neither say nor think anything harshly of him.” “Certainly not,” Mark agreed. “I can understand that according to his view of the matter anything that stood between him and his goal was but an obstacle to be swept aside; assuredly there was no premeditation in the killing of my father. I have no doubt that the man was attached to him, and that he killed him not to save his own life, but in order that his mission might be carried out.” “Quite so, Mark; it was done in the same spirit, if I may say so, that Abraham would have sacrificed his son at the order of his God. What years of devotion that man has passed through! Accustomed, as you see, to a lofty position, to the respect and veneration of those around him, he became a servant, and performed duties that were in his opinion not only humiliating, but polluting and destructive to his caste, and which rendered him an outcast even among the lowest of his people. Do you not think so, Mrs. Thorndyke?” Millicent, who was crying quietly, looked up. “I can only think of him as the man who twice saved Mark\u0027s life,” she said. “I understand why you have wished to tell me this story,” the Rector went on to Mark. “You wish me to know that Arthur Bastow did not add this to his other crimes; that he was spared from being the murderer of your father, but from no want of will on his part; and, as we know, he killed many others, the last but an hour or two before he put an end to his own life; still I am glad that this terrible crime is not his. It seemed to be so revolting and unnatural. It was the Squire\u0027s father who had given the living to his father, and the Squire himself had been his friend in the greatest of his trials, and had given him a shelter and a home in his old age. I am glad, at least, that the man, evil as he was, was spared this last crime of the grossest ingratitude.” “Well, Mark,” Dick Chetwynd said cheerfully, in order to turn the subject, “I am heartily glad that we have got to the bottom of this jewel mystery. I have been puzzling over it all the time that you have been away, and I have never been able to understand how, in spite of the precautions that we took, they should have found out that the jewels were at Cotter\u0027s, and that you had them on board with you, and, above all, why they spared your life when they could so easily and safely have put you out of the way. It is certainly strange that while you were thinking over everything connected with the jewels, the idea that Ramoo was the leading spirit in the whole business should never once have occurred to you.” A month later, when Mark went up to town, he called at Leadenhall Street. “Of course, you have not heard of the arrival of the Brahmapootra at Madras yet. May I ask when she left the Cape?” “She never left the Cape, sir,” the clerk replied, “and there are very grave fears for her safety. She spoke the Surinam and gave her mails for England when the latter was eight days out from the Cape, and the Surinam reported that a day later she encountered a terrible gale, lost several spars, and narrowly escaped being blown onto the African coast. Since then we have had no news of the Brahmapootra. A number of Indiamen have arrived since; the latest came in only yesterday, and up to the time when she left no news had been received of the ship. Three small craft had been sent up the coast weeks before to make inquiries for her, but had returned without being able to obtain any intelligence, and had seen no wreckage on the coast, although they had gone several hundred miles beyond where she had spoken the Surinam, therefore there can be little doubt that she foundered with all hands during the gale. You had no near relatives on board, I hope, sir?” “No near relatives, but there was one on board in whom I was greatly interested. Here is my card; I should feel greatly obliged if you would write me a line should you hear anything of her.” “I will do so, sir. We have had innumerable inquiries from friends and relatives of those on board, and although of late we have been obliged to say that there can no longer be any hope that she will ever be heard of, not a day passes but many persons still come in to inquire.” No letter ever came to Mark; no news was ever heard of the Brahmapootra. Ramoo\u0027s sacrifice was in vain, and never again did the diamond bracelet glisten on the arm of the idol in the unknown temple. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3091/85297.html","bookId":953,"book":{"id":953,"title":"Colonel Thorndyke\u0027s Secret","description":"简介： Squire Thorndyke, of the Manor House of Crawley, was, on the 1st of September; 1782, walking up and down the little terrace in front of the quaint old house in an unusually disturbed mood. He was a man of forty three or four, stoutly and strongly bui...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3091","creation":"Aug 1, 2019 12:23:58 AM","modification":"Aug 1, 2019 12:23:58 AM"}}
