{"id":106183,"no":23,"title":"Page 23","content":"But the idea of tapping into the wood magic that Lesya had taught him made his insides curdle. He wanted to be rid of her completely, to cleanse himself of her enchantment, to stop feeling the queasy love that had insinuated itself into him. Even now he wished he could erase the past few days and return to the bliss he had felt before Lesya’s loneliness had revealed its dangerous edge.\n So instead of pausing and making camp, he followed the river south. Though he persisted in thinking of this rushing water as the Klondike, it was merely a tributary. It would lead him eventually to the deeply flowing river, and then a trek along the bank of the Klondike would bring him back to Dawson City. There, he hoped his supplies still languished in the storage barns of the hotel where he, Merritt, and Jim had been beaten and pressed into the service of bad men.\n Their memory made him melancholy. His friends and enemies were all dead. Souls bright and souls dark, they had passed from the world, and each had had a hand in forging the person Jack had now become.\n Less than an hour later, he walked into the ruin of the slavers’ camp.\n An eagle cried as it flew above him, as if in recognition of the dread he felt as he explored the scene of the massacre. Perhaps without even being aware of it, Jack had reached out to the bird, and it did share his trepidation. Yet the eagle flew on, arcing across the sky toward the tallest of the distant pines on the other side of the river, and Jack remained.\n The creek flowed by, its voice either mournful whisper or mocking chuckle—he could not tell which—and Jack wandered the site. Tents and bedrolls were strewn about, along with shovels and the pans they’d been using to sift for gold in the river. There were boots and torn jackets, all stained with long-dried blood. Brown splashes of old blood spattered the rocks and many spots around the camp. Charred evidence of two campfires had been kicked and scattered. Saddles and saddlebags lay where they had fallen, but no horses, and no mules.\n No bodies at all, in fact, and that was the worst of it.\n Jack picked up a discarded shovel and strode the camp with it, looking beneath blankets and torn clothing. He found nothing he could bury. When Jim had died, the slavers had left him for the animals, but no animal could have done this. The Wendigo had murdered all the men of the camp, and now nothing remained of the prospectors or their slaves. Either the damned thing had eaten them, flesh and bone, or it had removed their bodies to store them for future consumption. And any bits of viscera left behind during the slaughter had since been found by birds or beasts who roamed the area.\n Only the blood remained. And perhaps the ghosts of the men who had died here, with nothing to mark their passing.\n I should have been here, Jack thought. It was a foolish idea. The campground still echoed with the screams of the dying. The Wendigo would have torn him apart, just as it had the others. It had swept through the camp, almost invisible in the dark, and so fast that it had seemed as though the night itself had claws and fangs. Jack had been staked to the ground. If the wolf had not freed him and urged him to attempt an escape, he would have been trapped there when the monster came.\n As the shadows grew long and the light began to fail, Jack performed a methodical search of the camp. The temperature had been plummeting all day, and he scavenged a second sweater and a heavy coat, and more than one pair of gloves.\n Some of the packs had been torn into by scavengers for the food within, but he found plenty of dried jerky, tins of beans, and other things he barely glanced at. What interested him most was the tin of coffee he procured from a canvas bag, along with flint and a metal pot. There were other pots, boxes of matches, tobacco, and myriad other things he would sort through in the morning when deciding what to bring with him when he broke camp. He chose the most formidable-looking of the intact packs, which he emptied in anticipation of repacking after he’d made himself supper.\n The prospectors’ weapons had done little good against the Wendigo, and the cursed creature had had no use for them. They were scattered all through the camp along with everything else. Jack chose the best rifle, a pair of Colts, and a two-shot derringer, as well as a pair of bowie knives and a small hatchet. Ammunition went into the pack before the encroaching night robbed him of the ability to tell which bullets went with which guns.\n When he began dragging leather saddlebags over to the pile, he found them surprisingly heavy. Inside, he discovered the reason: two small bags of gold in each saddlebag, making four total. Staring into the unlaced opening of the first bag, he smiled to himself and felt like crying. He’d promised his mother and Eliza gold from the Klondike, sworn to Shepard that he would not return without it. Black-hearted men had killed for this, and luckless innocents had died. With all that spilled blood, Jack should have left the gold right where it was, except he had suffered for it as well, and he’d be damned if—now that he had it in his hands—he would go home without it.\n As night fell, Jack built a fire, heated a tin of beans, and ate it with some jerky. In comparison to what he had grown used to eating in Lesya’s company it was a rough meal, but there would be little better between here and home. Afterward he made coffee—the real reason for the fire; he’d eaten cold beans many times before—and then leaned against a saddle he’d hauled over beside the flames. He’d made himself a bedroll as well, but he wasn’t ready to sleep yet.\n On a second saddle, he carved an epitaph to the men who had died there beside the creek. The wind whipped up and the cold began to hurt his hands, but Jack did not stop until he had etched the complete message into the leather.\n 20 OR SO MEN KILLED ON THIS SPOT.\n SOME GOOD, SOME BASTARDS, AND ONE MY FRIEND, MERRITT SLOPER.\n MAY HE REST IN PEACE, AND THE BASTARDS GO TO THE DEVIL.\n Jack woke before dawn with snow accumulating on his face. He wiped it away, his skin prickling with the cold, and blinked flakes out of his eyes. Before falling asleep he had stoked the fire as high as he could against the encroaching chill of darkness, but the temperature had continued to plummet overnight.\n He sat up, removed his hat and brushed the snow from it, and looked around at the thin coating of pure white that had blanketed the land. How long had he spent with Lesya in the forest?\n The days and nights had passed with a strange fluidity while he had been with her. It had seemed to Jack like no more than a couple of months, and yet at the same time the days had felt endless, as though each had been its own eternity. He had read folktales in which wanderers in the woods might emerge and find they had been gone from the world for years. Jack had no sense that the world had changed that much, but the snowfall proved that time had passed more slowly while he’d been with Lesya than it had beyond the reach of her influence.\n Still, he did not believe that winter had arrived. Yesterday the wind had been calm and the sun bright and warm, the temperature in the midfifties at least. In the afternoon the temperature had slid precipitously. The previous winter, out in the white silence, he had grown used to temperatures no human should have to endure, and this morning’s snowfall was warm in comparison.\n No, this was not winter. Jack refused to believe even that October had arrived. Late September, then, and an unseasonably cold day. It wouldn’t be unheard of this far north, snow in September. The flakes were fat and moist, the temperature only barely cold enough for the storm, perhaps thirty degrees.\n It’s beautiful, Jack thought. The sight of the gentle snow falling over the river as morning lit the horizon quieted his troubled mind. The snow would fall, and winter would come, and in the spring there would be rain that would wash the blood from the rocks, cleansing the horror from this place. He found some peace in that.\n Unwilling to take the time to attempt a new fire in the damp snow, Jack ate two pieces of jerky and took a cup of water from the creek. He pulled on two dry, clean pairs of socks he had found in a pack and then retied his boots, grateful for the coat and gloves he had scavenged from the camp. Before falling asleep the night before, he had stowed what food and supplies he could carry in the pack he’d chosen, and now he shook the snow off his bedroll, wrapped it tight, and tied it to the pack. The two Colts hung in gun belts one on each hip, the knives in sheaths; the derringer hid in an inside pocket, the hatchet was in his pack, and he carried the rifle over one shoulder. Over the other he hung the saddlebags containing the slavers’ gold.\n Weighted down like that, he was tired before he’d walked a hundred yards, but there was nothing he was willing to leave behind. He could not be sure how far from Dawson he might be, or what he would encounter on the trek.\n So he trudged in the snow, following the creek to the river as he had planned. Jack had thought that the arrival of morning would warm the air enough to turn the snow to rain or that it would cease completely. Instead, the day grew colder, the wind more fierce; and the snow fell faster.\n A horrible suspicion began to develop in Jack’s mind: that the storm might not be entirely natural. He traveled the morning on edge, peering into the storm for any sign of threat. Despite the cold, his exertion and the heavy coat made sweat trickle down the small of his back, and his labored breaths plumed their steam with every step. Jack barely noticed such details, and even the growl of hunger in his belly did not distract him from his vigilance. Every tree took on sinister aspect, and where the river passed close by woods, he scanned the trunks and branches for some sign that all was not as it seemed.\n Could Lesya come this far from her secret wood? Surely she would be able to do so, but would her magic extend so far from her father’s influence? Jack didn’t know, and did not care to find out. His chest tightened with dread at the very thought of what would become of him should she discover him and drag him back to her cabin, or to the grove she had made of cursed lovers, the abominations those men had become. He had been hard at work trying to expunge the image from his mind, but he knew that it would always haunt his dreams.\n For hours his concentration was fixed on every shadow, until at last he became utterly certain that indeed some presence observed him on his journey. It watched from the trees, or hid in the whipping snow, or submerged in the frigid, rushing river. He could not decipher its location, but he felt it there.\n Lesya? Or…and a spark of hope rose within him…the wolf? Other possibilities occurred to him. The Wendigo had been thwarted before, but it still roamed the wilds, and who knew what other spirits and legends prowled the land?\n Jack marched on, long past the time he should have paused to rest. Yet doubt lingered in the back of his mind. His senses had been heightened over the course of the year—by the guardian presence of the wolf the prior winter, and the ominous awareness of Leshii in the forest inhabited by his spirit—but did he dare trust them? Did he sense peril in the storm only because it was what he expected to find?\n The question dogged him, but did nothing to relieve the tension. Once he stumbled and glanced up quickly at a line of nearby trees, only to have one of those dark figures move, vanishing deeper into the wood.\n He bent against the wind and kept trudging, casting wary glances at those trees, but nothing else moved. Soon he had left that wood behind. An open, rocky slope led up and away from the riverbank, and the only shapes in the snow were low bushes and stones that jutted from the ground. The snow clung to the bushes, though the rocks were mostly bare thanks to the buffeting wind.\n Sure he felt eyes upon him, Jack spun, seeing nothing other than the whipping snow. The weight of all that he carried dragged on him, and he shifted the saddlebags from one shoulder to the other. He unslung and cocked the rifle. His fingers were cold inside the gloves, but despite the frozen ache in his bones, he would still be able to pull the trigger. What good bullets would do, he had no idea. He had survived this long, and he meant to get home to the people who were waiting for him. He owed it to Shepard, and Eliza would be heartbroken should she never see him again.\n “Show yourself!” Jack shouted, but the wind carried the words away.\n Again he turned, and this time caught something moving just out of the corner of his eye. It disappeared again into the storm. He held his breath, listening, but heard only the wind and the river.\n He was not alone in the snow. Something paced his every step.\n Jack moved closer to the water’s edge, glanced around, and came to a halt. Still standing, he closed his eyes and exhaled to let his spirit expand the way Lesya had taught him. He felt for animals at first, and found sleeping owls, skittish hares, furtive wolverines, a single black bear, and in the distance a small herd of caribou.\n But the thing was there as well, and though he could not touch its spirit the way he could the animals’, he sensed it clearly now, and he knew it meant him harm. Lesya might be a madwoman intent upon punishing him for what she considered his betrayal of her, but the wood witch was a lost soul, stricken by loneliness. The thing that pursued him now felt far more sinister and more savage than he believed even mad Lesya could be.\n Jack heard snow crunching underfoot. Opening his eyes, he swung the barrel of the rifle in a wide arc, his back to the river. Once again he thought he saw a shape just at the edges of his vision, perhaps closer than before, but it vanished when he tried to look directly at it.\n He raised the rifle to his shoulder and fired into the snow, listening to the shot echo through the storm. No other sound returned, no cry of pain or surprise. But he had not really expected to hit the thing that stalked him. Jack hoped only to make it wary, perhaps keep it away for a while. If luck smiled upon him, he might stumble upon some prospector’s cabin or a small Indian settlement on the river.\n He ratcheted the bolt to bring another bullet from the magazine. Luck seemed far too much to hope for, so he would rely on the Lee-Metford rifle instead. There were seven more shots in the rifle, and he had other weapons. He would fight to the death—fight death itself, should it come to that—but nothing would keep him from getting home after this extraordinary journey.\n Bent against the storm, still he picked up his pace, wary with every step. He searched the storm for further signs of his stalker but saw nothing more. Perhaps the rifle shot had given it pause after all. \n","sourceLink":"https://allnovel.net/the-wild-the-secret-journeys-of-jack-london-1/page-23.html","bookId":1537,"book":{"id":1537,"title":"The Wild (The Secret Journeys of Jack London #1)","description":"Storyline: \n The Wild (The Secret Journeys of Jack London #1) \n The world knows Jack London as a writer who lived his own thrilling, real-life adventures. But there are parts of his life that have remained hidden for many years, things so horrifying even he couldn’t set them down in writing. These are the Secret Journeys of Jack London. \n We meet Jack at age seventeen, following thousands of men and women into the Yukon Territory in search of gold. For Jack, the journey holds the promise of another kind of fortune: challenge and adventure. But what he finds in the wild north is something far more sinister than he could ever have imagined: kidnapping and slavery, the murderous nature of desperate men, and, amidst it all, supernatural beasts of the wilderness that prey upon the weakness in men’s hearts. \n Acclaimed writers Christopher Golden and Tim Lebbon, along with illustrator Greg Ruth, have crafted a masterful tale both classic and contemporary, a gripping original story of the paranormal in the tradition of the great Jack London.\n \n","cover":"https://allnovel.net/images/the-wild-the-secret-journeys-of-jack-london-1.jpg","author":"Christopher Golden","type":"Adventure","source":"allnovel","link":"https://allnovel.net/the-wild-the-secret-journeys-of-jack-london-1.html","creation":"Oct 5, 2019 8:57:41 AM","modification":"Oct 5, 2019 10:52:00 PM"}}
