{"id":52236,"no":115,"title":"Chapter 114 - Mission Impossible (1)","content":"Chapter 114 - Mission Impossible (1)\n \n \n Silpennon was looking at her with a baffled expression on his face. She gave a detailed explanation of her reasoning.\n “My sense of presence has always been weak. Even after I joined this place, people aren’t able to perceive me very well.”\n “At this point, it doesn’t sound like your sense of presence is weak. I can come up with another adjective that would describe your ability.”\n Aria cheerfully ignored the very normal retort to her words. She continued to speak.\n “That is why the pope…. Occasionally, the other high priests performed important tasks in my presence. They didn’t realize I was near.”\n “You saw something suspicious. So why did you do nothing about it?”\n “I\u0027m only a maid. I have no power. The only thing I can do is put my faith in the pope, and in addition, the priests.”\n It was bullshit to say that she didn’t have any power. She possessed a stealth ability that was capable of deceiving even the pope. How can she be so shameless by speaking such words! Silpennon was flabbergasted. However, Aria was on a roll, so he didn’t stop her from speaking. He just stood still.\n “However, when I heard your story today, I came to a decision that I can longer stand by doing nothing. When I think back on it, the pope had a really odd expression on his face. It was as if he was mesmerized….. If I’m to be blunt, he looked like a perverted old man.”\n He thought she was being way too blunt.\n “So you do think that old man is doing something unseemly.”\n “Yes. ······I cannot confirm it for myself, but it will be possible for you to do so.”\n Silpennon had the ability to infiltrate into the Zero Class! Her eyes contained great expectation as her gaze washed over him. He became a little bit cocky. Up until now, he had been caught up in his need to growing faster. This was why it felt pretty good to receive recognition from someone else.\n “All right. I want you to guide me to the secret tunnel.”\n “D...do I have to go too?”\n “You’ll only believe it if you see it with your own eyes?”\n “That is…. Yes. It is so. What about the hero-nim?”\n “Ah. That’s right. I’ll have to contact Artpe first…..”\n In the middle of his speech, Silpennon suddenly disappeared from Aria’s sight. It had occurred so fast that she stood in place as she blinked her eyes.\n “Ah?”\n “······mmm.”\n Afterwards, the door opened and someone came in. It was none other than the holy priestess Vadinet!\n She came into the room, then she tilted her head in puzzlement.\n “That’s strange. I definitely heard a voice in here…. It was the voice of a young man, so I thought it was the hero-nim.”\n “Ah. Holy priestess-nim….”\n “He isn’t here. I guess I misheard.”\n Of course, Aria was ignored by Vadinet. It seemed she hadn’t been discovered by Vadinet. It was to be expected. Silpennon had grown as a thief, yet he was only able to register Aria after he had opened the door.\n “Ha-ah, hero-nim. He was as I had imagined. He’s a wonderful person. He isn’t exactly my ideal type, but…. That fact makes me like him even more…...”\n The holy priestess slowly entered into the room, and she sat on top of the bed. Aria was frozen like an ice sculpture as she looked on. The holy priestess’ actions steadily escalated, and it became quite the spectacle. She fell onto the bed as she started to grope the blanket.\n “Hoo-ooh….. I want to see him up close. Will he come to this room tomorrow? If that meddling woman wasn’t here, everything would have been perfect…..”\n “······.”\n It was clear as to who the meddling woman was! They had been trying to expose the pope’s true nature, yet they were faced with the holy priestess’ true nature! When faced with this reality, Aria didn’t know what to do. She looked like she was about to cry.\n “The blessing was supposed to be given only to Arpte-nim. I wonder why it turned out like that…. I’m sure that witch used some weird trick. The position of hero is only for Artpe-nim, yet she is sharing that spot with him. I’m sure she used similar methods in the past to steal his power. Yes, that’s it. That’s the only explanation that makes sense.”\n There was murderous intent dripping from her voice. It would be much more dangerous than before if Aria’s presence was found out! Aria desperately tried to use her skill that allowed her to assimilate into her nature environment. While she was doing that, the holy priestess finally spoke the worst possible words that she could come out of her mouth.\n “If that woman disappears, hero-nim will only look at me.”\n The holy priestess’ face was filled with desire and jealousy. It was an expression that shouldn’t be made by a woman called the holy priestess.\n “That woman is evil. She is an evil woman that is getting in between the hero-nim and me….. How do I reveal that bitch’s true nature? How? How…...”\n She rolled around the bed as she brainstormed. In the end, she couldn’t come up with an answer. She had a preoccupied expression on her face as she exited the room. Of course, it was enough for the two in the room to make an assessment of the holy priestess. \n She was quite rotten.\n “Ah, ah-oooh. Even the holy priestess…...”\n Aria found out a truth that she hadn’t wanted to know. When Aria looked like she was about to cry, Silpennon dropped to the floor. He had been hiding in the ceiling. He had a miserable expression on his face.\n “Artpe······ You want me to seduce such a woman…...!”\n “S...seduce?”\n “It was one of the requests given to me by the hero. However….”\n He was supposed to seduce the woman. After procuring her as an ally, Silpennon had planned on exposing the corruption that was being propagated by the pope and his faction. It would have been revealed in glorious fashion. He was going to do this with her. His story would have unfolded dramatically starting tonight… That was the plan. However, he unexpectedly met a collaborator in Aria, and he had set out on a different route. \n Moreover, he was late in finding out the true nature of the holy priestess. She was a bit….\n “Nope. It isn’t just a little bit. She is completely trash.”\n “The holy priestess always smiles at us as she gives us blessings. She is a good person…… So why is she acting like that?”\n “She didn’t hesitate to label Maetel as being evil. It is actually impressive. I never knew a human could become so twisted.”\n “A...are you...going to seduce her?”\n Aria carefully asked him the question. Silpennon let out a kind laughter as he shook his head from side to side.\n “No, I have no interest in seducing a woman that is hell bent on having a different man. Moreover, she has such a dirty and ill-tempered personality. I’d rather die than seduce her.”\n “That’s great…. Aht.”\n After hearing his words, Aria blurted out something odd. Aria quickly shut her mouth. Silpennon was too busy cursing Artpe inside that he didn’t hear her words.\n ‘As expected, she’s a bomb! Her appearance is perfect, but everything else is all messed up. Why would I seduce her? On top of that, he wants me to seduce someone that is clinging to him. Does he plan on humiliating me?’\n It was the moment when Artpe’s Pass on the Bomb plan failed! Silpennon kept swearing as he picked up his communication device. He tried to contact Artpe. Artpe immediately answered the call.\n [Are there any spells being used near you?]\n “I checked using the Artifact. There is none.”\n [Is anyone there?]\n “There is another person with me.”\n [I see. All right. I’ll go there right now, and I’m going to kill you.]\n “Relax. She’s an ally.”\n [······I want you to keep the person you call an ally in place. I’ll be there.]\n “What about Maetel?”\n [I was barely able to put her to sleep. Oooh ooh ooh.]\n The mere fact that Artpe could sleep with Maetel made Silpennon feel envious. Artpe should be in heaven, yet he was acting as if it was a terrifying experience. Silpennon couldn’t understand what was so bad about it, but Artpe ended the call. Artpe didn’t elaborate on the subject. Aria stood next to him, and her eyes were twinkling.\n “That really was the hero-nim!?”\n “I thought you said you believed me. Were you worried?”\n “It is like hearing a description of the 5 Great Dishes of the world and eating them yourself. It is a completely different experience!”\n “Those weren’t that tasty. I thought the buttered corn on the cob was tastier.”\n “What······? You ate the 5 Great Dishes…..?”\n How long had passed since the two of them struck up a conversation that sounded a little bit out of place? The door opened, and a young man possessing black hair and bewitching purple eyes entered into the room. It was Artpe. \n “It has been a while, Silpennon.”\n “Kek, Artpe. You are bigger than me? I thought you would have become frail….”\n It had been 2 years since he met Artpe. Silpennon grinded his teeth as he sighed in grief.\n He had fallen behind in terms of level, but Silpennon believed that he would be able to overwhelm Artpe in terms of height and body build. Artpe had completely taken the route of a magician, yet he possessed a sturdy build. Moreover, he had grown into a young man that was handsome and tall!\n “Of course, I’m big. I’m the hero. Aren’t you a little bit too skinny?”\n “Of course, I’m skinny. I’m a thief! Shit!”\n This was something Silpennon had recognized when they were young, but as a 15 year old, Artpe looked really handsome. His appearance had been upgraded by two steps. He possessed good looks that could be called bewitching! It automatically made Silpennon deflate! \n “Wa-ahhhh. It really is the hero-nim! He’s wonderful······.”\n “Huh?”\n On the other hand, Artpe treated the reunion with Silpennon as if it was no big deal. Artpe was about to close the door when he paused. He had discovered Aria, who was shouting with joy at the sight of him.\n He couldn’t help but chuckle. \n “I see. Someone like you exists within the temple.”\n “Did you find out something about her on first sight?”\n “Well, yeah.”\n Artpe’s eyes took in the young maid, who possessed an endlessly large and clear eyes.\n She was the daughter of a high rank priest, yet she was working as a maid. That part was a bit unusual, but aside from that fact, she was a very normal maid. She was from the human race, and her level was 3.\n On the other hand, there were two characteristics that made her abnormal.\n [Aria Kuar Serieta]\n [Human Girl 14 Years Old]\n [Level : 3]\n [Innate Ability : Assimilation]\n The first thing of note was the fact that she didn’t have a Class. Secondly, she was only a level 3, 14 year old girl, yet she had already awakened to her Innate Ability.\n “Hello, Aria. Why don’t you have a Class?”\n She was flustered by Artpe’s question, but she obediently gave him an answer.\n “T...the maids that work within the Zero Class aren’t given a Class. After finishing 5 years of volunteer service, we gain recognition, and we are blessed for the first time. Then we begin the course to become an elite priestess….. That is what my father told me.”\n “I’m surprised that they are so picky!”\n Artpe totally ignored Silpennon, who had become surprised by the information.\n “That is why they didn’t know about your potential. You have an Innate ability called Assimilation. You are assimilating with a part of your surrounding even as we speak. The effect of this ability just makes others not take notice of you. However, your ability has the possibility to grow into something amazing.”\n “I have an Innate ability······!?”\n “That’s right. It is very important for you to fully grasp what your ability is. The more you have an understanding of your Innate ability, you can draw out the potential that is nestled within you. Your Innate ability will become powerful. You should take this to heart.”\n “Assimilation…...”\n “No wonder.”\n She was level 3, and she didn’t possess any skills. However, she was able to fool the holy priestess and the pope. The only possible explanation was an Innate ability. Silpennon nodded his head as if he had already accepted it as fact. Artpe also nodded his head as he spoke.\n “Yes, this girl has an Innate ability, which is something you don’t have.”\n “You are a hero that possess a true gift for annoying other people.”\n “Aren’t I great?”\n “Shut up.”\n While Silpennon and Artpe conversed, Aria kept mumbling, ‘Innate ability’, repeatedly to herself. If she had to pick what had been the biggest surprise for her today, it would be the realization that she possessed an Innate ability.\n ‘I became one of the Four Heavenly King using an Innate ability. Maetel awakened to her Innate ability after she became a hero. Then there is Sherryl. After a lot of fuss, she was able to become the Genesis Mermaid Queen, and she acquired an Innate ability. Such a rare talent is working here as a maid…..’\n It was an extraordinary coincidence. No, it might be fate if one looked at it in a certain way. If she didn’t have her Assimilation ability, her meeting with Silpennon wouldn’t have occurred.\n ‘All right. Things have gone off the rails a little bit, but if I think about her potential, my eventual profit might be quite lucrative.’\n Artpe grinned as he verified something with her.\n “You said you wanted help with our work?”\n “It isn\u0027t like that, Artpe. She wants to see positive proof before….”\n “Yes,hero-nim! If you will have me, I will help you as much as you want!”\n “Hey!”\n Her words had changed! It hadn’t been long since she had met the hero, but Aria had already developed an endless trust for the hero. There was no hesitation within her. \n “Please follow me. I’ll guide you to what I consider to be the most suspicious location.”\n “Ah ah ah. I can’t accept it!”\n “You are being noisy, dude. Let’s hurry up and go.”\n While everyone was asleep, the hero, the thief and the maid started exploring the Zero Class. The makeup of the party was quite odd.\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/i-reincarnated-for-nothing/irfn-chapter-114","bookId":1506,"book":{"id":1506,"title":"I Reincarnated For Nothing","description":"Synopsis: “My life as a demon… No. My life as human is really…”\n Artpe was supposed to live a charmed life as the 4th strongest in the Demon King’s Army. However, his life was cut short by the hero’s blade.With his previous life’s memory intact, Artpe will live his life again. His boldness and resourcefulness will make him unrivalled!\n","cover":"http://cunovel.com/img/IRFN.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/i-reincarnated-for-nothing","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:17 AM"}}
