{"id":52272,"no":151,"title":"Chapter 150 - Zestbar (3)","content":"Chapter 150 - Zestbar (3)\\n\\n \\n\\n \\n\\n \\n\\n \\n\\n [Goo-ohhhhhhhhhhhng!]\\n\\n The whale’s fierce roar could be heard from the outside, but Artpe wasn’t cowed. He briskly started giving an explanation.\\n\\n “The process of making a spell is very convoluted and difficult. Amongst spells, the great magic spells need nature’s power, which coalesces over countless years. It has to be processed to a point where the power could accept the Record and Mana of a human. This is the typical requirement.”\\n\\n In the process of creating the great spell, it took in the Record of all humans and living organisms in the region. It was a process that was more complicated than fixing the shape of the spell. However, he pared down the explanation.\\n\\n “So there is a higher chance of a powerful magic appearing in a more rugged and perilous environment in nature?”\\n\\n “That’s right. Moreover, the great magic Reign of Ruin is the strongest amongst…. At the very least, it is the strongest spell to the best of my knowledge.”\\n\\n This location was naturally made, yet it wasn’t naturally made. It was artificial, yet it wasn’t artificial. It possessed transcendent Record. It was located at the border of the human realm and the Demon world. There were endless waves, submarine earthquakes and underwater volcanic activities. Countless monsters were born influenced by these unique conditions. In the end, this supernatural ruin was born. \\n\\n They were within a predator that fused with all the monsters of Zestbar. This was the identity of the tomb of the sea.\\n\\n “How the heck did someone find this place!”\\n\\n “No one was able to find this place. That is why it stayed hidden until we came along.”\\n\\n “I... I guess so?”\\n\\n Elrick accept that line of reasoning, and he quieted down. Maetel’s shoulders retracted in pride.\\n\\n “Isn’t our Artpe amazing?”\\n\\n “Artpe-nim is the one that is amazing, so I don’t know why Maetel-nim is bragging about him. Anyways, Artpe-nim… It seems we’ve entered into the mouth of an enormous whale….”\\n\\n Vadinet shrank into herself as she looked at her surrounding. To all appearances, there was no way this was the insides of a living organism. The walls were made out of hard mud-plastered wall, and there were weak Mana crystals embedded on the ceiling. It made Vadinet feel afraid.\\n\\n “I...is this a form of a dimensional pocket?”\\n\\n “That’s right. We achieved the prerequisites for entering this ruin. There is no way we’ll be digested like food. You can be at ease.”\\n\\n “I’ve been waiting for you to say that…..”\\n\\n It was also Artpe’s first time coming into this ruin. Of course, he was the one that had found out about the spell that was hidden within Zestbar. However, he didn’t have the ability or the authority to come search for this magic tome. It was why he had obediently informed the Demon King about the location of this spell.\\n\\n The Demon King had already been strong, yet he had become much much stronger after learning this spell.\\n\\n Of course, Artpe hadn’t been able to see the Demon King use the Reign of Ruin. In the human realm, there was no one capable of stopping this spell. This included the hero. The only one that might have been able to stop it was Regina, but she had died fighting Etna…..\\n\\n “······your gaze is unpleasant. Your gaze is that of an hawk looking at its prey..”\\n\\n “Yes, I might have been waiting for such a reaction….”\\n\\n His past life was just that. It was his past life. They were his allies now. Artpe watched Regina. She fidgeted as she avoided his gaze. He shook his head to dispel such thought, then he turned to look at his party.\\n\\n “Everyone get ready for battle. It is as I\u0027ve said before. Each monster that comes out in this ruin is boss class. You should be on alert. Sienna will be in the front, and Elrick will bring up the rear.”\\n\\n “Yes!”\\n\\n “Leave it to me!”\\n\\n Maetel’s equipment wasn’t inferior to Sienna’s equipment. However, Maetel wasn’t suited for repelling attacks from enemies. Maetel was more suited for the role of attacking weak points of enemies. She would rush in and cut down the enemies. Each party member listened to Artpe’s order, and they settled into their position. Maetel closed her eyes, and she waited for her turn to come.\\n\\n “They are coming.”\\n\\n As soon as Artpe’s words were spoken, a small light formed in the air. It twinkled. Regina blinked her eyes when she saw it.\\n\\n “Wisp······?”\\n\\n “Even I am knowledgeable about the Wisps, Artpe-nim. They are beings born by chance in locations that are rich in pure Mana. Mana coalesces around the newly formed consciousness. They are pure elemental spirits. If their will is weak, they aren’t able to affect the material world in a significant manner. That is why I heard….”\\n\\n “However, these aren’t normal Wisps. These are level 320 Wisps.”\\n\\n [!?]\\n\\n The Wisp said something. Or rather it looked as if the Wisp had said something.\\n\\n In the next moment, Sienna instinctively raised her shield.\\n\\n [!?!?]\\n\\n “Kooh?!”\\n\\n The Wisp’s body rammed squarely into Sienna’s Shield. Its speed was comparable to Artpe’s Blink! Despite its speed, its power was more powerful than Maetel’s headbutt at full strength.\\n\\n “Ggoo-ooh. Ooh-ha-ahhhhhh!”\\n\\n “Good job, Sienna!”\\n\\n Sienna’s eyes narrowed at the horrifying impact, but she didn’t budge at all. Artpe extended his Mana Strings, and he quickly ordered the other party members.\\n\\n “Vadinet! Blessing!”\\n\\n “G...give the Guardian’s Blessing to those that protect me!”\\n\\n “It can’t be physically harmed! Regina, Speed Debuff!”\\n\\n “I command in the name of the Winter Queen, who rules over the endless cold. Slow the steps of this wanderer.”\\n\\n Vadinet and Regina kept chanting. When the Wisp sensed mana, it activated its magical energy to cancel the spells being used. However, Artpe had been waiting for this moment. The Mana Strings, which had extended into the surrounding, made contact with the Wisp’s Mana. It also tried to bind the body of the Wisp. It quickly retreated in fright. Of course, Vadinet and Regina was able to properly finish chanting their spells.\\n\\n The Blessing placed over Sienna, and it strengthened her body. Regina’s Debuff created frost around the Wisp, which was made out of pure Mana. It started to slow down. It charged towards the party again, but its speed was noticeably slower!\\n\\n “Maetel!”\\n\\n “Ha-ah!”\\n\\n Maetel shot forward like a bullet. She stabbed her bastard sword into the body of the Wisp, and she detonated her Mana. The Wisp couldn’t withstand the blow. It was sent flying as it let out a scream that was unintelligible to humans.\\n\\n “There isn’t just one. Be on your guard!”\\n\\n Suddenly, Artpe’s staff floated into the air. Several thousand...tens of thousand Mana Strings shot out using the staff and Artpe as mediums!\\n\\n [!]\\n\\n [??]\\n\\n [!?!!]\\n\\n The Wisps had appeared throughout the ruin. When they saw the Mana Strings, every single one of them let out an unintelligible scream.\\n\\n There were Wisps that attacked without regards to their lives. They wanted to avenge their comrades. However, they couldn’t penetrate the layered wall of Mana Strings. In fact, they became entrapped by the wall of Mana Strings. Even if some were able to breakthrough the Mana Strings, they were stopped by Elrick and Sienna.\\n\\n “Ahh-oooh. Artpe! It hurts! It really hurts!”\\n\\n “Vadinet, give them another layer of Blessing!”\\n\\n “Ah ah, Artpe-nim. You are too beautiful….”\\n\\n “How can you let your attention wander right now, you dork?!”\\n\\n “Hoo-ahhhhhp!”\\n\\n Fortunately, Maetel knew her role, and she continued to do what was needed of her. She focused as much Mana she could muster into the bastard sword, and she used Artpe’s Mana Strings as guides. She ran to the ends of the Mana Strings to ruthlessly stab the Wisps, who were being restrained.\\n\\n Their level was so high that they couldn’t be killed with a single blow. At the very least, each strike was able to incapacitate them. The fact that she was able to create such a result was astounding in itself.\\n\\n “Regina!”\\n\\n “Light isn’t needed in front of the Winter Queen’s grandeur.”\\n\\n It was Regina’s role to kill off the incapacitated Wisps. The ice crystals, which had formed in the air, twinkled. They flew towards the Wisps, and the ice crystals embedded themselves into the body of the Wisps. She cleanly extracted the Record of the Wisps.\\n\\n Despite the party killing only couple Wisps, Elrick’s level rose. The experience of other party members rose incrementally. Once one was over level 300, even a small rise in EXP was a ludicrous gain.\\n\\n “How can these small Wisps······!”\\n\\n “It hurts to level up…...!”\\n\\n The Wisps were Mana organisms that were made out of pure Mana essence. Of course, the power they possessed differed depending on where they were born. These Wisps were born in this ruin, which was of the highest class.\\n\\n “There are Wisps that are much more terrifying than these guys. If you look in the mountain behind the Demon King’s castle…..”\\n\\n “No, you don’t have to tell me about them······.”\\n\\n Elrick responded in a sullen manner as he once again raised his shield.\\n\\n The Wisps were moving so fast that Elrick had given up on the idea of counterattacking. His job was to protect Artpe, Regina and Vadinet!\\n\\n If he blocked the attacks, Artpe would use his Mana Strings to bind the Wisps. Maetel and Regina would kill off the Wisps. Currently, they were experiencing a proper party play. It was something they hadn’t beenable to experience within the Abyss.\\n\\n “Their numbers are steadily increasing. Are they multiplying?”\\n\\n “Look at it this way. This ruin was formed a very long time ago, and we are the first to enter this ruin. How much surplus Mana do you think this ruin had accumulated over the years?”\\n\\n “Wah-ah. They are like fireflies!”\\n\\n Maetel had a hobby of splitting firelies into two with her sword, so she yelled out in delight. The Wisps were enraged by the fact that Maetel was slaughtering their own kind. They charged towards her as they threw caution to the wind. Their charge was met by Sienna’s shield, and they were repelled. As the number of Wisps increased, Artpe and Regina became busy.\\n\\n When several hundred of their kind were killed, a change occurred on the battlefield. The rate at which the Wisps were appearing was the same. However, they were starting to act in a conservative manner. \\n\\n Only few Wisps in the front kept flying like mayflies to occupy the attention of Artpe’s party. The rest were gathered in a single location as they started to resonate.\\n\\n [!!?]\\n\\n [!!!]\\n\\n [!!]\\n\\n “Ah. Those bastards are combining in the back!”\\n\\n “That’s gonna hurt······ Let’s stop them before they complete their fusion!”\\n\\n These Wisps were born from the same location, so they were capable of being absorbed by a Wisp with a stronger consciousness. They were able to pass on their magical energy and Record.\\n\\n After eating several dozen Wisps, they were able to create oppressive spells that magicians of the human realm couldn’t even dream about using. On the other hand….\\n\\n “Hoo-ahhhhhhhp!”\\n\\n [!?!?!?]\\n\\n Their health and defense remained comparable to a regular Wisp. It would be easy to kill the Wisp before it could get off an attack. When Maetel realized this, she used Acceleration to immediately plant her sword into the body of the Wisp. She activated her Skill and an big explosion occurred!\\n\\n [!!!?]\\n\\n “Hooht!”\\n\\n It died a sudden death before it could use its fusion attack! The enraged Wisps tried to attack her, but she once again used Acceleration to rejoin with her party. There were Wisps that had followed after her, but they were met by Sienna’s shield. It sounded as if someone banging on a drum.\\n\\n “Opaaaaaaaaaaa.”\\n\\n “Just endure it for a little bit longer!”\\n\\n “Hoo-ahhhhhhhp!”\\n\\n The Mana Strings, which had explosive powers, cut across the space that was filled with Wisps. Regina supported him. Her eyes shone as she used her spells. As Wisps died, they released a massive amount of Mana into the ambient air. If only they could use that Mana, they wouldn’t have to suffer the risk of running out of magical energy.\\n\\n After a long time, the Wisps in this region of the ruin was wiped out. After the first attempt, the Wisp tried to fuse two more times, but they were put down pretty easily.\\n\\n “Ooh ooh. What a ridiculous Dungeon.”\\n\\n When Elrick went underground, he had experienced a good deal of violence when he faced off against the Shadows of Sinners. He was proud of this fact. However, even he had never faced several hundred level 320 Wisps before. This was a first for him.\\n\\n “Artpe, are these the types of monsters that’ll show up as we move forward?”\\n\\n “Your hunch is right, Maetel.”\\n\\n Reign of Ruin was a spell that dealt with pure destructive energy. All the monsters, who were guarding the ruin, held the form of pure energy. Wisps were representative of the types of monsters they would face. The monsters that were waiting for them wouldn’t be too different from the Wisps.\\n\\n “So how long is this place?”\\n\\n It was Sienna’s question. Artpe looked down the tunnel of the ruin, which looked endless. He had a bright smile on his face as he opened his mouth.\\n\\n “That’s a very good question.”\\n\\n “Ah. I see..”\\n\\n “Huh? I didn’t answer your question yet.”\\n\\n Artpe was flustered, but his party started stretching as they tidied up the scene of their battle.\\n\\n “Let’s go. Let’s hurry up and acquire this magic tome, so we can get out of here.”\\n\\n “Yes.”\\n\\n “Interesting ruin. Leveled up.”\\n\\n “Hey! I didn’t tell you guys anything yet!”\\n\\n This was the final ruin before the Demon world. This was only the beginning of their exploration.\\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/i-reincarnated-for-nothing/irfn-chapter-150","bookId":1506,"book":{"id":1506,"title":"I Reincarnated For Nothing","description":"Synopsis: “My life as a demon… No. My life as human is really…”\\n Artpe was supposed to live a charmed life as the 4th strongest in the Demon King’s Army. However, his life was cut short by the hero’s blade.With his previous life’s memory intact, Artpe will live his life again. His boldness and resourcefulness will make him unrivalled!\\n","cover":"http://cunovel.com/img/IRFN.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/i-reincarnated-for-nothing","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:17 AM"}}
