{"id":52295,"no":174,"title":"Chapter 173 - A Man\u0027s Contract (6)","content":"Chapter 173 - A Man\u0027s Contract (6) [Do you remember everything now?] “Remember······? What the hell did you do!” The inside of his head was a confused mess, so he couldn’t speak properly. The numerous memories became mixed with his current memories. It made him doubt if he was really here at all. [You were the thief of the hero’s party, and you went through countless adventures with Maetel. In the end, you guys lost at the Demon King’s castle. You fell.] “You are talking nonsense······.” He refuted the Demon’s words on instinct, but he could clear see the scene inside his head. The Maetel in his memory was a bit more mature than the Maetel he currently knew. He had stood next to her, and he could see his other comrades too. However, Artpe was missing from that scene. [There is no such thing as a second hero. You were the hero’s partner. At the very least, you thought of yourself as her partner.] However, that wasn’t true. The hero Maetel hadn’t treated Silpennon any different from her other comrades. He had merely been her friend. In the end, she hadn’t even tried to bring him along into the battlefield. From beginning to end, Silpennon had merely been the bridesmaid. She only loved the man, who had appeared in front of her as an enemy. It seemed the man had felt the same way towards Maetel. Silpennon had become jealous, and he had stabbed that man to death. He justified it to himself by saying that he had done it for the hero. [However, his awakening paved the way for us. It is truly ironic. He earned the chance at reversing the world, but it also meant that everyone became swept up in his power.] “Artpe······.” He had gained these memories thanks to that damned Demon. In his memories, Artpe wasn’t the hero. He was the Four Heavenly King. He still looked disgustingly handsome, but his position in life differed greatly. In the end, he had died facing the hero’s party. In this current reality, Artpe was…. [You know this isn’t a lie. You’ve already realized that this is the truth. Doesn’t that man have way too much knowledge about everything? Haven’t you experienced numerous events that couldn’t be explained away by him being wise?] “······.” Silpennon’s weapon had been moving towards the enemy, but at some point, he had come to a stop. It would be easy for him to dismiss this as nonsense, but a different will was inside his head. This other will stopped him from dismissing the Demon’s assertion. It made him continue the conversation with the Demon. “Artpe······ He tricked me?” [To be precise, he is duping the entire world. He used to be the Four Heavenly King in the Demon King’s army. He changed the world to his taste, and he is putting on an act of being the hero. How laughable is that?! You deserve to be next to the hero’s side, yet he separated you from her. He took possession of the hero. How can I not laugh?!] “Koohk!” His head hurt once again. The past…. No, the memories and the consciousness from before the reversal of this world was slowly encroaching on his current self. [My Innate ability is called Record Keeping. That is why I wasn’t completely swept up by his power. I preserved his majesty’s Record, and I also took possession of your Record. You probably know why I did that.] The envoy laughed. [I want you to think about the answer you gave. Didn’t you say you are with us?] “I······.” He had despaired at his hopeless and shabby situation. He was disappointed at the hero, who hadn’t even glanced towards him. He hated Artpe, who had been reborn through his death. That’s right. The thief Silpennon had accepted the envoy’s proposal. [Everything has been prepared. There’s only one change in the variable. I was going to give your your past life’s Record, and I was going to strengthen you. However, you were tricked into following that man. You’ve already gained power. However, the power you’ve acquired will be used to stab that man once again. How funny is that?] “I······ Why me······.” [You possess the true bloodline of Diaz. You have enough power to become a central figure for the humans. If you join the side of the Demon race, it won’t be necessary to kill numerous humans.] “What······?” When Silpennon replied in a dumbfounded manner, the Demon spoke with a truly satisfied smile on his face. [That’s right. In the end, they will all become vassals under his majesty, so why would we exterminate all of them?] “What the hell are you talking about?” [It is quite simple. Everyone will become a Demon. If everyone becomes the same, there will be no reason for the humans and Demons to fight. The human realm will turn into the Demon realm. The two realm will no longer be divided.] “What are you······!” In an instant, Silpennon felt a silence descend around him. The envoy’s words echoed in his ears. Whether it was possible was secondary, Silpennon could feel that the Demon truly believed in his words. He couldn’t help but be shocked by it. “That kind of tyranny······ Do you really think we’ll let you do as you like?!” Silpennon grinded his teeth as he yelled out. His mind, which had become fuzzy, regained some of its clarity. He couldn’t be swayed by such nebulous story like his past life. He was a king responsible for the lives of countless humans, and he was a warrior! It seemed the envoy was truly enjoying his reaction. [The Demons live longer than humans, and we are more powerful. Why would humans refuse to become Demons?] “You are going to use such reasoning to turn all humans into Demons? Are you nuts…?” [Change? We are just finishing what humans wanted in the first place.] “They wanted it······?” Silpennon’s instinct sounded an alarm. It was telling him that this was as far as he should listen to the Demon’s words. He tried attacking the Demon, but unfortunately, he couldn’t overcome the skill gap between the Demon and him. He once again created a thunderbolt with his daggers, but the Demon easily blocked it. The Demon snickered. [The past humans wanted to become strong, and they wanted longevity. No, the current humans want the same thing too.] “I don’t believe you.” [They put their heart and soul into solving this problem. After countless years, the humans found a method that worked. It was to twist the Mana to cause a change in one’s body. Basically, it was an evolution. It was a stronger and more destructive form of Mana, but it created a superior body. It gave them longevity. Not all could achieve this evolution. However, the ones that were born anew had gained what they had wished for.] “I told you that I don’t believe you!” [You already know this to be true. They became the Demon race. The Demon race and the Demon realm were created by the hands of humans.] “No!” It couldn’t be. The Demons were like the Elves and Dwarves. They were races separate from the human race. This Demon was just lying to him. The memories, which was forcefully inserted into him, were a lie. That’s right. It was all a lie! [You don’t need to swing your blades against me. Haven’t you already decided to work with me?] “I······ No. You want to make humans into Demons? I cannot participate in such work.” Even if it wasn’t a lie, it didn’t matter. He was well aware of the nature of the Demon race. He knew it very well. The Demon had injected memories into Silpennon, and Silpennon was able to bring up relevant memories to this topic. It was a society where the strong preyed upon the weak. It was a world where instinct was valued over logic. Power was the only thing that could keep such a world in order! Maybe, a part of humanity wanted to become Demons. It was possible. However, it wasn’t something humanity as a whole had wanted. It wasn\u0027t a decision that should be made by a small number of supreme beings! The envoy didn’t care if Silpennon’s ill feeling towards him was deepening. In the end, Silpennon had no choice, but to listen to the Demon. [We’ll give them all to your care. We just want to unite the world. We aren’t interested in ruling the weak.] “Do you really think I’ll believe that?” [I don’t really have a reason to lie. Are you not satisfied with being given the people of this realm? If so······ All right. I’ll give her to you too.] “Her······?” Silpennon’s movement came to a stop as if by magic. It was as if he had been struck by lightning. He had a crush on Maetel as soon as he had met her. The memories from his past life had been transferred to Silpennon through the envoy’s ability, and it dominated his mind. An extremely pleased smile appeared on the envoy’s lips. [Originally, the hero Maetel was fated to die. However, we\u0027ll spare her if you cooperate with us. You just have to present us with the humans. We’ll spare her, and we’ll give her to you.] “She is······.” [There is the one that took possession of the hero’s heart. He coveted the place that isn’t his, and he turned back the world. I\u0027ll help you kill the second hero Artpe. You will be able to kill him with your own hands, and everything you wanted will be yours. As a price, the human realm will be turned into the Demon realm. You have to help out a little bit on that.] “Artpe······?” [That’s right. You’ve regained your memories, so you know this. You know how vile and deceitful that bastard is. You also know how much you hate him as a man….] The Demon was right. He hadn’t said a single lie. Silpennon from his previous life had wanted to kill Artpe. His heart had been filled with that desire. Moreover, Silpennon from his previous life had learned about his own miserable situation when his life was coming to an end. He had believed Artpe was dead, yet Artpe was able to change the world after awakening to his Innate ability. The feeling of unfairness had reached a boiling point. However, did these feelings dominate the current Silpennon’s heart? In truth, it wasn’t like that at all. ‘You can leave the Demon King’s castle to me. You should protect your land and your people.’ Before he had risen to the throne of Diaz, Artpe had talked to him using the communication Artifact. Silpennon hadn’t forgotten Artpe’s words. ‘Also, you should be nice to Aria and Leseti. From my experience, there is nothing more scary than a woman’s enmity.’ Artpe had spoken as if he was showing off his relationship with Maetel. He teased Silpennon, but at the same time, Artpe had given him advice. That wasn’t all. If one looked over Artpe actions, all this actions had been for the people around him. Artpe knew everything, yet he was best at seeing into the heart of people. He looked like he was always doing everything for himself, but his actions resulted in being beneficial to other people. One could tell that he was considerate towards others. ‘Can I really call him a fraud? Even if Artpe had been the Four Heavenly King, do I have reason to condemn the current Artpe?’ Artpe was a leader of people. Everyone that followed him seemed to laugh. Maetel’s sole reason for living was for Artpe. All the people that joined Artpe’s party had deep feelings for Artpe. They weren’t following Artpe, because they were coerced. If Artpe used his incredible power to cause change to this world, and let’s say he had placed himself at the heart of the world. What if he rose to a position where he was adored by everyone? Would it be right for Silpennon to kill him again? He loved Maetel, but should he forcefully steal Maetel for himself? Should he cooperate with the Demons? Was that what he really wanted? In the first place, did Artpe want to be affiliated with the Demon King’s army? He was born as a Demon, yet did he want to fight against humanity? Silpennon had the memories from his past life, so he could find the answer. All Demons had been shackled by the Absolute Control! What did Maetel from his previous life say to Artpe? What did she say when she met the tired and sad Artpe? What did Artpe say to her? ‘Should I really carry all the feelings I had in my previous life into this current life? If I merge those feelings into my current feeling, will I be able to accept everything about myself? Am I confident that I won’t regret it? I know what it is like to love, yet do I have the right to steal away someone else’s love?’ Above all else... Is the choice made by Silpennon from his previous life the best choice for the current Silpennon? “My answer······” [I guess you are ready to give me your answer.] “I refuse.” Silpennon lowered his head then he raised it. The two daggers in his hands let out a blinding blue light. Even if he was a high level Demon, he became blinded for a brief moment by the light! [Refuse!? Foolish human! You felt so much despair and anger, yet you refuse…. Koohk!?] After his vision returned, the Demon gritted his teeth as he glared at Silpennon. However, Silpennon was no longer alone. “Ooh-ahhhhhhh. He’s an incredibly strong Demon! I shouldn’t have come here!” “Shit. What a crappy life I live······!” “Hoo, hoo-hue-hue. An additional bonus······! If I’m able kill that bastard, I can catch Artpe-nim by the scruff!” “Mr Silpennon, we weren’t too late!?” There was the guardian knight, who had accompanied him through his whole life. There was the black magician that shared an ill-fated relationship with him. However, he grown to have affection for the black magician. Then there was the merchant ajumma. He had known her for quite a while, yet her appearance and mind hadn’t changed. Lastly, there was the girl, who mistrusted him, yet she continued to follow him. She was the holy priestess, who used to be a servant. When Silpennon was added to these four members, another hero’s party was born. It didn’t matter what others said. This was Silpennon’s party. “I’ve found someone that is more precious to me than Maetel.” [You bastard······!?] The thunderbolt hadn’t been meant to harm the Demon. It was a signal that called in his comrades. When the Demon belatedly realized this fact, he raged as he bared his teeth. Silpennon let out a gleeful laughter as he took his combat stance. The holy priestess quickly used her Blessing to increase his abilities. The thief from the previous life had become the young king of a nation in his current life. After finding out the whole truth, he had chosen his current life. When he did so, his daggers let out a much more brilliant light. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/i-reincarnated-for-nothing/irfn-chapter-173","bookId":1506,"book":{"id":1506,"title":"I Reincarnated For Nothing","description":"Synopsis: “My life as a demon… No. My life as human is really…” Artpe was supposed to live a charmed life as the 4th strongest in the Demon King’s Army. However, his life was cut short by the hero’s blade.With his previous life’s memory intact, Artpe will live his life again. His boldness and resourcefulness will make him unrivalled!","cover":"http://cunovel.com/img/IRFN.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/i-reincarnated-for-nothing","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:17 AM"}}
