{"id":52297,"no":176,"title":"Chapter 175 - Phoenix\u0027s Daughter (2)","content":"Chapter 175 - Phoenix\u0027s Daughter (2)\n \n \n Artpe’s party exited the Demon realm without a hitch. Of course, they temporarily joined up with the Genesis Mermaids. Artpe assessed the overall power of the Genesis Mermaids, and he created a new defensive line that would be more effective in barricading the Demon realm.\n “I’ll stay behind, master.”\n “I see. You’ve made your choice.”\n “Yes. It is very unfortunate that I cannot stay by master’s side, but…..”\n Sherryl returned to her role as ruler of the Genesis Mermaids. If she followed her desire, she would have accompanied Artpe. However, there was a chance that she would lose all her vassals if she didn’t return. She had to rule over her people.\n “I’ll block the Demons here. The fact that I was able to be with master for a short amount of time made me happy.”\n “The war won’t drag out too long. I’ll see you at the end of it.”\n “I’ll do my best to end it quickly.”\n Even by herself, she had power that was on par with a Four Heavenly King. Her words gave him much confidence. After Artpe saw her rejoin the merfolk, he turned around. He was greeted with Maetel’s sullen eyes.\n “When the war ends, you don’t have to see that woman again. Let her live her life in the ocean.”\n “Sometimes you say the most surprising and scary words.”\n “I just worry that Artpe will be duped by other women. Artpe is kind. This is why I worry that you’ll fall for the machination of women with black hearts. Look, look. Aren’t you suffering even now, because of one particular black-hearted woman?”\n No matter how much Artpe thought about it, the one with the blackest heart was Maetel. It seemed she wasn’t self-aware of this fact, so it was pointless to point this out.\n “She is correct. Artpe-nim is too kind, so a bad woman can easily deceive you. That is why I have to protect Artpe-nim from such women.”\n “Vadinet, sometimes you say the most interesting thing.”\n He had already given up trying to stop Maetel and Vadinet from fighting. That was why he had decided to avoid them all together. When he looked away, he caught sight of Petra. He was looking into a tracking Artifact.\n “You are able to find her with that?”\n [It is a very sensitive Artifact, but I’ve used this Artifact for the past couple dozen years. That is why I am able to get a general distance and location of my target.]\n “As expected, you have the skill of a pro stalker. Amazing.”\n [Shut up.]\n The pro stalker Petra kept looking into the Artifact for a long time, and he tilted his head in confusion.\n [This can’t be.]\n “What’s wrong? For your sake, you better not say that Etna is dead······?”\n [That isn’t the case. However…. Her location hasn’t changed from the last time I checked······?]\n In Artpe’s head, he imagined Etna sensing Petra’s tracking magic. She would probably burn all traces related to her location. He liked that image, but if she did that right now, it would make his task of find her more difficult. \n “Where was she when you last checked the Artifact? Is it Glacia?”\n [I thought she would have exited Glacia by now…. Shit. We have to hurry.]\n Petra hadn’t worried about Etna even though she was being chased by the previous Demon King’s army. He had joined forces with the previous Demon King’s army, so he had assumed she would be subdued by the previous Demon King’s army. In the end, she would have to cooperate with them. Petra hadn’t balked at the idea, because he would be on the same side as Etna.\n However, she had been trapped in Glacia for the past year. That was a different story all together. The mere presence of the ice continent weakened Etna’s power. If Etna had been chased around in such an environment, it was highly probable that her mind and body wasn’t sound right now. Petra wasn’t interested in embracing a thorny cactus.\n “Let’s go.”\n “In the end, we have to go to Glacia again.”\n “I hate the cold.”\n Artpe ruminated as he increased the speed of the Steel Horse. Was he thinking about Etna and Petra? No, he was thinking about the previous generation’s hero and Demon King.\n ‘I am getting some idea as to why my current life unfolding differently from my previous life. It does bother me that this theory is based on the periodic dreams I’ve had. However, veracity of those dreams have been confirmed. I had already suspected this early on…..’\n In his past life, the previous Demon King and his forces had been sealed. It was probably the work of the previous hero. He wanted to pick a bone with the previous hero. If he had the power to seal the previous Demon King, why hadn’t he killed the previous Demon King? His heart was full of desire to berate the previous hero. The previous hero probably didn’t have enough power to kill the previous Demon King. That was the most probable answer.\n Despite this fact, the previous hero hadn’t mentioned that he hadn’t killed the previous Demon King. It was conspicuously absent in the messages left behind to the future heroes. He just wrote down words that boasted about himself. It made Artpe want to bring the dead back to life, so he could beat up the previous hero.\n ‘Anyways, they were sealed. Since Nanarai Bodra’s ruin was placed near the Demon King’s castle, I wonder if the seal was placed near the Demon King’s castle too. Moreover, that seal broke when Maetel’s party invaded the Demon King’s castle. They were freed on the day I died.’\n This was all speculation. When the seal was broken, Artpe had awakened to the second stage of his Innate Ability. In that moment, he had caused change to the world using his ‘Rewrite’ ability. \n The world was rewound, and the nearby seal was affected by his ability. Or maybe, the previous Demon King had affected his Innate ability and the seal. Everyone else was probably swept up in the ‘Rewrite’, and they had no choice. On the other hand, it might have created an opportunity for the previous Demon King, who was sealed.\n Didn’t the Winter Queen talk about it? Those with massive Records weren’t swept up in the change. If the previous Demon King possessed enough power, he might not have been swept up in the Rewrite. The current situation could be explained.\n As soon as Artpe returned to his past, the reality was already distorted. From that point on, the previous Demon King’s faction started to methodically regain their power, and they had confronted the current Demon King’s forces. In the end, they had gained control of Demon realm.\n “In the end, it’s my fault.”\n “You are right. If you were a little bit less handsome, I wouldn’t be this troubled…..”\n “If Artpe-nim was a bit more strict, you would have walked a different path from this sort of a hero…..”\n “You guys are still fighting over that topic?”\n As if to ask Artpe to choose who was more right, Maetel and Vadinet had approached him. He flicked both their foreheads, and he let out a sigh.\n They had entered into the heart of the Demon realm, and they had fought big battles there. They had returned after learning a big secret of the Demon realm. His party members didn’t look strained by the recent events. He wondered if he was being too strung up. As he thought about it, he found his needless worry to be pathetic. He decided not to overthink it. Everything was based on a supposition. It wasn’t certain that the previous Demon King’s seal was broken by Artpe’s awakening. Moreover, it was true that the Demon realm became reinforced by this development, but the hero’s side had gained much more than the other side. \n He was one of the Four Heavenly Kings in his past life, and he had been revived in his current life as a hero. The hero’s party had gained Vadinet and Sienna thanks to Artpe. Silpennon was much stronger than his past self….\n [Artpe.]\n Speak of the devil. As soon as Artpe thought about Silpennon, he contacted Artpe. Artpe let out a bitter laughter as he took out his communication Artifact. He answered it.\n “Are you doing ok? We are going to Glacia to acquire a new party member.”\n [Didn’t you say that last time…..? Anyways, we killed one of the Four Heavenly Kings.]\n “Four Heavenly King? From what I know, there shouldn’t be any Four Heavenly Kings left...”\n [He wasn’t under the current Demon King. He was the weakest amongst the Four Heavenly Kings working under the previous Demon King. He had an Innate ability called Record Keeping.]\n “······.”\n He had never expected to hear such words from Silpennon’s mouth. It was what Artpe had been most worried about! It seemed the previous Demon King’s faction was starting to operate out in the open. \n Wait a moment. Silpennon had encountered the Four Heavenly King from the previous generation…..!\n “Is anyone hurt!? What’s the damage!?”\n [Everyone is safe. His Innate ability couldn’t be used directly in battle.]\n It didn’t matter if the weakest Four Heavenly King was working under the current Demon King or the past Demon King. The result was befitting his title! The manner of his death, and the fact that he had an ambiguous Innate ability was similar to the previous Artpe! Artpe hoped that bastard couldn’t rewind the world! Since Artpe was still here, it meant that the weakest Four Heavenly King wasn’t capable of rewinding the world!\n He should be happy, yet somehow, he felt tears well up in his eyes. It was unknown as to whether Silpennon knew what emotions Artpe was feeling, but he continued to speak in a calm manner. \n [In the process of killing him, we all grew a good amount. You’ll probably see me in new light when we meet again.]\n “I’m already seeing you in a different light….. Anyways, it is fortunate that you guys were able to kill him. I’m glad you are safe and sound. So he mentioned the previous Demon King? Did he volunteer this information? What is Record Keeping?”\n [Alright. I’ll explain it to you. However, there is something I must confirm with you before I do so.]\n His voice was lower than usual, and Artpe understood that Silpennon was being serious.\n “Speak.”\n [So…. You… Do you…..]\n Artpe had set the stage for him, yet Silpennon was tentative to speak. Artpe became restless, so he decided to strike first.\n “For your information, I like women.”\n [Is Maetel amongst the women you like?]\n “Uh······ What?”\n Is this the information he must confirm with Artpe? In a flash, he turned around, and he realized that Maetel was staring at him. He let out an eek as he shrank into himself.\n There was no way she could hear the transmission. He wondered if she thought he was talking to a woman. Maybe, she was jealous.\n [Hurry up and answer me.]\n Artpe put up a soundproof barrier. It made Maetel narrow her eyes further. He snorted as he waved her away.\n “Yes, I like her. Are you satisfied?”\n [Then you should promise me. You will never allow her to get hurt.]\n “She might get hurt in a fight, so I can’t give you a definite answer.”\n [Hey.]\n “······at the very least, I won’t let her die while I’m still alive.”\n Since his opponent was being serious, Artpe had to answer in a serious manner. After hearing those words, Silpennon didn’t say anything for a brief moment. He finally let out a sigh as he answered Artpe.\n [Alright. I believe you. Let’s move on to the main topic.]\n “What?”\n [I want to talk to you about your past life. I want to hear how you became a hero after you escaped being a Four Heavenly King.]\n “······.”\n This time his thoughts truly came to a stop.\n [The Demon I met had an ability called Record Keeping. I received Record from my past life from him. He wanted to bring me over to their side. He wanted me to help them make the human realm into the Demon realm. I was able to become stronger thanks to him, and we were able to kill him.]\n “Record Keeping······ That makes sense.”\n At the same time, he was able to accept why the previous Demon King’s faction was able to recover their power so quickly. Before they returned to the past, the Four Heavenly King had stored their Records. He was able to restore their past Records in their current lives. It was fortunate that Silpennon’s party was able to kill him. It was best to kill such a variable as soon as possible.\n However, the last change caused by the past Four Heavenly King was giving Artpe a headache.\n [I won’t betray you, and you don’t have to worry about me revealing this information to others… I just want to hear your story.]\n “Silpennon, you’ve really matured.”\n [It is all thanks to you, Artpe. So...]\n Silpennon was probably letting out a bitter laughter on the other end of the communication Artifact. Artpe’s mortal enemy from his previous life spoke to him.\n [Will you tell me your story?]\n “It’ll take a very long time. We aren’t dating, so it would be awkward to talk to you on the communication Artifact for so long.”\n [You can tell me in your spare moments. I just….. I want to become as strong as you. Even if it is a little bit, I just want to see the makeup of your heart.]\n Artpe thought about it for a brief moment. They would be on the move for a while, and he had nothing to do during that time. Moreover….. He had someone he could talk to. He could reveal everything about himself. In truth, he was thankful for the opportunity.\n “Alright. Let’s do that . At the end, you’ll have so much respect for me that you won’t know what to do with yourself.”\n In the end, Artpe nodded his head. At that moment, Maetel had become peeved. She had put a massive amount of Mana in her fists, and she was getting ready to break his soundproof barrier. He didn’t forget to add this qualifier.\n “First, I have to make up an excuse with Maetel.”\n They were on the road to Glacia. This was how Artpe gained a free diversion to pass the time.\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/i-reincarnated-for-nothing/irfn-chapter-175","bookId":1506,"book":{"id":1506,"title":"I Reincarnated For Nothing","description":"Synopsis: “My life as a demon… No. My life as human is really…”\n Artpe was supposed to live a charmed life as the 4th strongest in the Demon King’s Army. However, his life was cut short by the hero’s blade.With his previous life’s memory intact, Artpe will live his life again. His boldness and resourcefulness will make him unrivalled!\n","cover":"http://cunovel.com/img/IRFN.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/i-reincarnated-for-nothing","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:17 AM"}}
