{"id":52139,"no":18,"title":"Chapter 17 - Our Sunbae-nim Did This? (1)","content":"Chapter 17 - Our Sunbae-nim Did This? (1)\n Artpe headed down the stair leading towards the 35th floor. He grinded his teeth as the Dungeon shamelessly showed no signs of ending.\n “What kind of Dungeon is this!?”\n “Aren’t all Dungeons like this, Artpe?”\n Maetel’s innocent eyes shone as she asked the question. She had drawn the short end of the stick by coming into this brutal Dungeon as her first Dungeon. However, she didn’t have the proper perspective to know any better. She didn’t get tired of this place, and she didn’t complain. She possessed an essential virtue needed as a Dungeon explorer….\n “Mmm. What I’m trying to say is…..”\n Artpe couldn’t tell if this was a good thing or not. Therefore, he evaded giving an answer by stroking her head. In turn, Maetel’s eyes narrowed in pleasure as if she was a cat. Mycenae had left behind her cart to look at them. She had a gentle look in her eyes as she spoke.\n “It looks as if you are training an animal, customer.”\n “Shut up. I want 245 gold.”\n “You said you’ll sell it to me for 230 gold a moment ago!?”\n “The price on items aren’t fixed. The price can fluctuate depending on my condition or if the other person is being rude. Let’s see… Right now it should be 247…..”\n “Two hundred forty five gold! I’ll buy it!”\n At this rate, Mycenae knew the price might increase further, so she quickly pushed the money towards him.\n “Here.”\n “Koo-ooooooooooh.”\n Artpe grinned as he handed her the item. Mycenae used her observation magic to check the item, and she let out a groan.\n “Kook. As expected, it is a really good weapon…. Your ability to price an item is really uncanny. It makes me want to recruit you into the Anywhere company.”\n “You won’t steal Artpe away from me, ajumma!”\n “I’m really not an ajumma!”\n Maetel, who had been standing there like a lamb, quickly hid Artpe behind her. Then she bared her teeth towards Mycenae. It made one wonder if she was a dog or some form of an animal in her previous life. Artpe patted Maetel, who was seriously worried.\n “Even if I wanted to go, I won’t be able to. Don’t worry about it. Anyways, if you sell that item to anyone, you’ll be unable to handle the aftermath. Be careful.”\n The identity of the artifact handed over to Mycenae was a Blood Gold Halberd, which held the curse of madness.\n It accelerated the destruction of the user’s mind as a powerful downside, but the weapon would all one to destroy all enemies and allies alike.\n However, Maetel already had control over her Berserk skill, so it was a useless weapon for her. Moreover, the weapon was too heavy for Artpe to wield.\n Still, it would be an attractive option to most adventurers or mercenaries. The weapon would lead the user down a path of destruction, yet ambition made people take up such weapons. It was a trait inherent in all humans.\n “Hoo hoo. As a merchant, my duty is to sell it at a high price. It is beyond my province to determine, who becomes the owner of an item.”\n “You are an unscrupulous trader.”\n Artpe let out a bitter laugh as he took out 100 gold from his pouch, and he pushed it towards Mycenae. She already knew what he would ask for. Mycenae didn’t give a reply as she took the money. Then she prepared the potions, water and ration.\n In the past year, she had appeared each time they moved onto the next floor. She monopolized the trade with them as they moved from the 6th floor to the 34th floor. This type of trade was almost automatic.\n “Excuse me, customer.”\n She put together items worth 100 gold with no frills. Mycenae asked a question as she divided the items between Artpe and Maetel.\n “What is the identity of this Dungeon? Why does it continue to go on like this? Does it perhaps have a tunnel leading to the demon world at the end?”\n “We are exploring this place to find that answer.”\n “You aren’t able to come up with a conjecture using your ability?”\n Mycenae had a truly surprised expression on her face. Artpe snorted.\n “I think you have too high of an opinion in regards to my ability.”\n “As the number of floor gets deeper, the items that are coming out are increasingly to my liking. From my perspective, I wouldn’t mind if the Dungeon goes on for another 100 floors…. Still, it is clear that this Dungeon wasn’t formed naturally. You probably already guessed this, right?”\n “Yes.”\n Artpe’s nodded his head in a self-possessed manner. Then he looked down at the stairway leading to the 35th floor.\n Ghouls that were around 2 levels higher than the ones on the 34th floor was probably waiting for them on the next floor. If not, there would be a single jump in difficulty, and new monsters might show up.\n “This Dungeon was created by someone with a clear goal in mind. It is true and definite that the two of us aren’t challengers that are compatible with that goal.”\n “Normally, one would usually search the history of the region gain some clues about the Dungeon. If you want such a research done, I can do it for you. I’ll gladly accept a commission to research about the history of this region….”\n “I’ll see you later, ajumma.”\n “I knew you will answer in such a way.”\n Mycenae grumbled as she went away. She notched another loss to him. She accepted the clean loss as she disappeared alongside the light.\n However, after he sent her away, her words made him become mired in his thoughts again.\n ‘The history of this region…...?’\n According to his knowledge, this region was where the hero was born. There hadn’t been anything special. It was a place where there was a normal town near the mountain. He knew from his past life that nothing much had occurred here.\n On the other hand, how could there be nothing here? Even now, he was in a strange Dungeon that was made by someone.\n Maybe, this place was hidden? What if this place was shielded from the eyes of the hero and Demon King?\n In the past, the hero hadn’t wanted to desecrate a grave, because she was raised properly by her family. It could have also been the fact that she was quickly sent packing to the royal palace as if she was some fragile glass statue. In the end, she hadn’t discovered this place. Was there some enormous secret hidden here?\n ‘What happened here in the past? Did something of significance happen here?’\n He had no way of finding out. Even if Artpe had the Read All Creation ability, he couldn’t see into the past to a time when he wasn’t alive. It was impossible.\n On the other hand, if such a thing was possible…..\n “Artpe…..?”\n “.....it’s nothing.”\n Maetel was looking at his face with a worried look in her eyes. Artpe shook his head to dislodge such thoughts, and he answered her. Unexpectedly, Maetel looked slightly wistful.\n “Your face was incredibly serious and dashing.”\n “Hmmph. That kind of sweet words will only work against the Four Heavenly Kings of the Demon king’s army.”\n This was why such words worked on him. It was a direct hit. Artpe let out a fake cough as he tried to hide the fullness he felt within his heart.\n He didn’t know what would appear in front of them. It was something that couldn’t be confirmed unless one saw it with one’s eyes. He also knew that priority of this Dungeon had changed when he found out how the Dungeon was structured.\n In other words, they were too far down the road to back off now.\n ‘In my past life, the hero wasted five years of her life at the castle. We have a lot of time to spare.’\n Of course, even if Artpe had used all types of methods to focus on leveling up, it was unclear as to whether he would have been able to achieve a better result than this.\n They would have missed out on fighting a horde of Skeletons linked by a rare magic called Record Link. They would have missed out on the precious EXP, and the artifacts they received as reward. They wouldn’t have been amass this much fortune. \n The factor that tipped the scale was the fact that Artpe and Maetel was able to develop so many high quality Skills here. It was crazy. If they hadn’t drawn this Dungeon as their first starting place, he wondered if they would have been able to develop skills like Berserk and Mana Link.\n Even if they continued to stay inside the Dungeon for five years, it wouldn’t impede with their development.\n ‘Ah. Of course, I have to get out of here and find those places as soon as possible…..’\n Artpe possessed the memories of his past life, so he had several significant advantages he could acquire for himself. He was talking about spell books of great magic, ancient ruins and the like.\n While Artpe battled within the Dungeon, he created a hierarchy of which goodies he will go for first. He would gain enough level in the Dungeon where they would be able to travel the world without worry. They will start traveling according to the list he had made.\n This was why they didn’t have time to hesitate or look back on what had already occurred. It didn’t matter what waited for them. They would move forward. This was the will of Maetel and Artpe even if their destination differed!\n After they smoothly defeat the Demon King, he would have the means to be able to raise cows in the countryside. At that time, he would be done with Maetel! He didn’t care if she wanted to become the queen of a country or a female pope of a religion she built. She was free to do whatever she wanted!\n Until that time arrived, Artpe and Maetel had to live a healthy and well-off life. In the immediate future, they would have to pass this Dungeon without any complications.\n “Aren’t you tired, Maetel? Shall we head down after we sleep?”\n “I’m not tired, Artpe. What about you, Artpe? Do you want to use my lap as a pillow?”\n “I’m also not tired.”\n “Tsk.”\n Maetel grumbled as if she was dissatisfied with his answer. Artpe led Maetel down to the Dungeon’s 35th floor.\n At that moment, a powerful vibration shook the Dungeon. Accompanying the tremor, a wet and moldy voice could be heard in their ears.\n [This test has been maintained for a very long time.]\n ‘That is a pretty ominous introduction!?’\n It was as if a legendary figure was about to step forward from the darkness if they took a step forward. It was a line given by a being, who would drop the adventurers into hell!\n “Hey, let’s head back for a moment.”\n [Denied.]\n When he heard the introductory line emanating from the darkness, Artpe immediately knew something was wrong. He quickly ordered a retreat as soon as they stepped onto this floor. However, the way back to the 34th floor was blocked.\n [You bastards are only allowed to go forward.]\n “You talk a pretty good game… Ooh?”\n Artpe was clicking his tongue as he tried to use his Mana. However, the torches mounted on the wall started to light up in order starting from the nearest torches. The light from the fire revealed the layout of the 35th floor. Artpe groaned when he saw them.\n “....crazy.”\n “Look at them, Artpe….”\n They were in a really large square, and there were a very, very ,very ,very ,very ,very large number of armored knights filling the place. The armored knights boasted a much more domineering spirit compared to the Ghouls. It was obvious that Undeads were within the armor.\n [We’ve been waiting for you, destroyer of rules.]\n [Insolent brat. You are the honey tongued brat that defies logic.]\n [Your judgement is close at hand.]\n Even in death, these beings hadn’t forgotten the will and techniques carved into their bodies. They were knights, who had a sense of self. They were Death Knights. All of them were powerful, and they were all over level 150. There were 500 of them.\n If a normal level 120 party was to fight this group, the possibility of them winning was uncertain.\n The one standing in the lead raised its bastard sword towards Artpe as its helmet rattled.\n [You have caused dishonor to all of us. You have corrupted the pure hero by spitting on our intent. You have looked down on our power. Your misguided will is now encased in a powerful body, and the worst of the situation has come to pass. You made fool of fate. You connected things that shouldn’t be connected, and you severed things you shouldn’t have severed.]\n All the Death Knights followed the one in the lead as they pointed their swords towards Artpe. During all of this, they hadn’t shown much hostility towards Maetel. They directed all their hate towards Artpe as if he was their mortal enemy. It annoyed Artpe. \n These bastards were quick in assessing the situation!\n [Still, we cannot deny the fact that you are a hero. This is why we will give you this last chance. If you take this last test properly, we will believe in this reality that had be turned on its head. We will trust in the hope blooming from within the darkness that will cause change to the future. We will go back to sleep.]\n “No, you don’t really have to believe in me.”\n The ominous feeling was increasing as time passed. Artpe readied the only specialty magic he possessed. He readied himself to use Hyper Rubbing, then he grasped Maetel’s shoulder. It was signal for her to get ready for battle. It also told her to be careful of their enemies.\n “Don’t worry about it, Artpe.”\n Even in such a situation, Maetel’s expression was calm. In the past year, her features had matured considerably. She already looked like an angel, but her beautiful smile made her look like an archangel. She gave a reassurance to Artpe.\n “I’ll protect Artpe. Artpe will protect me in return?”\n “....yes. I trust you.”\n The shield on Artpe’s back rose into the air. He only had to repair the shield couple times as they descended from the 6th floor to the 35th floor. This was why the shield hadn’t been replaced with other weapons. It was a rare artifact that gave a weak curse to whatever it hit. If he was with the shield, there was nothing for him to fear!\n [When the battle starts, he might use cheap tactics to play us off against each other.]\n However, the enemies he would face were excessively resolute in defending against mental warfare.\n [This is why we will force the activation of the final test, so you can face it.]\n “Uh, hey… Wait a moment, you guys·.”\n Artpe tried to speak up when he realized what they were about to do, but the Death Knights just glared at Artpe as they plunged their swords into their hearts. Their Mana flooded forth! The restriction of the Record Link made it impossible to attack one’s comrades, but it seemed suicide was possible!\n As he faced the domineering sight, Artpe yelled out in shock.\n “You bastards will be penalized even if you kill yourselves!”\n [We are already Undead!]\n The 499 Death Knights crumbled in place. The oppressive energy from each of the Death Knights flowed towards the single Death Knight standing in the middle.\n It happened when Artpe and Maetel was struck dumb by the ridiculous sight. \n [I’m ready, heroes.]\n The power of the armored knights were gathered into a single being, and ‘It’ was reborn as a horrible nightmare. It made a declaration as it pointed its long sword towards the two heroes.\n [The test will start.]\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/i-reincarnated-for-nothing/irfn-chapter-17","bookId":1506,"book":{"id":1506,"title":"I Reincarnated For Nothing","description":"Synopsis: “My life as a demon… No. My life as human is really…”\n Artpe was supposed to live a charmed life as the 4th strongest in the Demon King’s Army. However, his life was cut short by the hero’s blade.With his previous life’s memory intact, Artpe will live his life again. His boldness and resourcefulness will make him unrivalled!\n","cover":"http://cunovel.com/img/IRFN.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/i-reincarnated-for-nothing","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:17 AM"}}
