{"id":52126,"no":5,"title":"Chapter 4 - I’m a Hero!? (4)","content":"\n \n “Stay still, Artpe.”\n “Hey, stop right there. Don’t come over here! Hey, hey!”\n Artpe was facing the biggest threat of his lifetime. The identity of this threat was a paste made from a handful of grass that Maetel held in her hand.\n “You’ll get better soon if I can put this on you.”\n “Stop lying! There is no way I’ll get better by applying such a dirty… Ah.”\n [Maetel]\n [Level - 2]\n [Medicine Lv4]\n [Care Grass]\n [The grass works against all types of wounds, but its effects are weak. If the grass is made into a paste by combining liquid, its recuperative power is increased slightly.]\n Maybe it could really heal his wound.\n When that thought ran through his mind, Artpe immediately calmed down. This was his mistake, because unlike the previous incarnation of herself, the current hero had learned how to attack an opening. In a flash, she darted in and put the grass paste on his knee!\n “Ooh-ahhhk!”\n “Just be still and get treated by me!”\n “Ooh-ahhh… It really is getting better!”\n She hadn’t put much effort into searching through the thicket. After she pulled out the grass, she spat on it before mushing it. \n The pain disappeared in a flash after the paste was applied!\n Artpe was taken aback by this unexpected aptitude the hero possessed. She preened as she stuck out her still flat chest.\n “My dad taught me about the different types of grass. There are grasses you can eat, and there are naturally ones that can treat wounds. There is even a type of grass that can recover your energy. He also taught me about which grasses are dangerous to eat.”\n “I ignored you when you said you ate grass before, but now it sounds as if your words were predictive...”\n “Let’s rest for a little bit until the medicine soaks in. Ah, before we do that...”\n Maetel found a patch of grass nearby and pulled out the wide leaved grass, wiping it off on her sleeve. Then she wrapped the wide leaves around the wound administered with the paste and tied it loosely.\n She looked fiendish when fighting the goblins, but in this light, she showed her feminine side. If he was a normal boy, he would have fallen for her at this point in time. Of course, Artpe was able to sidestep this issue. The number one cause of death for the Four Heavenly Kings had been honey traps. He was well-informed regarding this issue, so his heart didn\u0027t beat faster at all.\n “Oopsy daisy, It’s all done.”\n “...thank you.”\n “This is nothing compared to what Artpe has done for me!”\n Maetel had a big smile on her face as she sat next to Artpe. After the battle with the goblins had ended, they had decided to recover from the fatigue caused by their first battle by resting on top of a big boulder that was nearby.\n “What I did for you…”\n Artpe felt guilty at Maetel’s words, so he let out a bitter laugh.\n Truthfully, he had mixed feelings about all of this. Was he really the same person as the version of himself who had grown up with Maetel? Why did Artpe have no memory of the time before he regained his memories?\n “Are you tired, Artpe? I’ll let you use my lap as a pillow, why don’t you sleep even if it is for a brief time?”\n “...no.”\n Artpe faced the angelic and kind face of Maetel. He felt awkward facing her, so he surreptitiously turned his gaze towards the sky, where the glow of the setting sun was slowly spreading.\n They didn’t have any time to waste.\n “My wound is fine. Let’s get up now, it’ll be extremely cold and dark once the night comes.”\n “What should we do?”\n The two heroes were still too young and weak, it was risky for them to spend the whole night within the forest. Be that as it may, they couldn’t just blindly go back to the town either.\n What would their best option be right now?\n Artpe let out a gentle laugh as he revealed the answer.\n “We can go into a Dungeon.”\n “...what?”\n Maetel answered back with a question.\n For the first time since he was reincarnated, Artpe spoke words worthy of a hero.\n “I’m saying we should go clear a Dungeon!”\n Dungeons were scary places teeming with monsters and traps. However, at the end of the Dungeons, there was always the prospect of acquiring sweet rewards. This was why adventurers were lured into those dangerous places. Some called the Dungeons a gift from the gods, others called them the temptation from the devil. There were even some who called them a prank pulled off by the Demon King.\n “I like to refer to Dungeons as rich mines.”\n “Artpe is amazing!”\n It was unbelievably hard to find rewards within the Dungeons.\n There were cases where one was able to avoid all the traps, but when they reached the last room, it was revealed that the treasure was hidden in one of the traps they had already passed. There were times when the last boss was killed, but it was revealed that the last boss itself was the treasure. Then there were cases where the last boss didn’t turn out to be the actual boss, the adventurer was \u0027awakened\u0027 in the course of the fight to become the last boss by being inflicted with poisons and curses. The world was overflowing with such stories!\n At this point, it was clear that a god’s nature could be as twisted as the Demon King\u0027s.\n Or were they the two sides of the same coin?\n On the other hand, Artpe possessed the Read All Creation ability, he could pierce through all lies to see the truth, nothing could deceive his eyes. Artpe possessed an ability that would allow him to find all the hidden Dungeons, and it wouldn’t be difficult for him to acquire the hidden treasures within those Dungeons! \n ‘Of course, in my previous life, I used this amazing ability for the benefit of the Demon King…’\n Just the thought of this made Artpe grind his teeth. If he had been able to take just a 20 percent cut of what he earned from those countless Dungeons, he would have been able to take care of 30 generations of his descendants!\n “It’ll be different this time around. All right, I’m going to work a little bit harder so that I can enjoy a peaceful life as a dairy farmer.”\n “I’m not sure what you are talking about, but let’s both work harder!”\n Artpe knew about a Dungeon near the village where the hero was born. To be precise, there was exactly one Dungeon inside the forest near the country village. It was fitting, since that village had nothing.\n From the start, he had thought about visiting this Dungeon while they were running away. This was why they had been heading in this direction from the moment they came out of the village, it was going as planned. The Dungeon appeared not much later.\n “...is it here?”\n “Yes.”\n When Maetel saw the entrance of the Dungeon, she had an odd expression on her face.\n “Do we have to go into such a strange place? Isn’t this a burial ground?”\n “All Dungeon entrances are like this. It\u0027s as if all the Dungeons creators made a friendly agreement by losing their collective minds.”\n Aside from burial grounds, there were several thousand year old trees, natural lakes formed within a cave and a ruined house inside a town. These were the popular spots for Dungeons.\n These were very obvious and suspicious locations, but these spots weren’t investigated unless the hero or Artpe discovered them. He had always wondered why it was like that. However, that issue didn’t matter now.\n “I don’t want to go in there.... My dad said we shouldn’t disturb the rest of the dead.”\n “Your father did a very good job in educating you.”\n Up until now, Maetel had meekly followed Artpe’s words, this was the first time she had pushed back. Well, it was true that the hero from his past life never visited this Dungeon either.\n After being chosen as a hero, she had been dragged immediately into the palace. She might have always had an aversion toward burial grounds, but that didn’t matter any more. There was only one important fact right now, she must go into this Dungeon.\n This was why Artpe spoke with a stern voice.\n “If we don’t go in there, we’ll be dragged back into the palace.”\n “I like tasteless food even less! I also don’t like the cold. Woo, woo…”\n “Well, are you going to go in?”\n “·...yes.”\n The sun had set all the way, and their surroundings were getting colder, they didn’t have the time to dawdle. Maetel looked as if she was about to cry, but she followed Artpe. She had no choice but to enter the Dungeon.\n “Huh?”\n However, when she actually entered the Dungeon, Maetel tilted her head in confusion.\n “This isn’t a grave?”\n Maetel had expected to see a coffin with a dead body inside. She had expected cold brick walls with hidden bats and long spiderwebs. The sight that greeted them was a square room, and the floor was covered with brown soil.\n When she turned around, she saw the stairway heading outside. Maetel was sure she had walked on stone steps, yet unbeknownst to her, they had changed into stairs made out of dirt!\n “Artpe, Artpe!”\n Maetel’s eyes turned round and she grabbed Artpe’s dirty sleeve. He had somewhat expected such a reaction from Maetel, so he smirked.\n “Dungeons are all like this. What do you think? Are you still cold?”\n “No, I’m not cold at all… Huh? Why is that?”\n When the hero realized the abnormal condition around her, she became slightly confused. \n Artpe gave a short explanation to her.\n “Dungeons are a form of pocket dimensions. You should think of it as a space disengaged from the outside world.”\n “What is a pocket dimension?”\n “The concept of a pocket dimension was first introduced in the year 728 according to the Continent Calendar. A demon named ‘Nanarai Bodra’ set up an experiment where the density of Mana within a limited space was pushed past the maximum permissible amount…”\n “It’s over my head!”\n Maetel raised one hand and yelled out in a spirited manner. Artpe had already expected such a reaction from her. He let out a benevolent smile as he asked her a question.\n “Which part don’t you understand?”\n “There’s too much… You should explain what the Continent Calendar is first.”\n “All right. Let’s lay that aside for now.”\n Artpe gave up on giving her an explanation. He was the one at fault for trying to explain a concept of magic to an idiot.\n “Just accept that such places exists, and the Dungeons occupy that space.”\n “Yes, all right!”\n If she was going to gloss over everything, she shouldn’t have asked for an explanation!\n “We’ll sleep here today. Since we are at the Dungeon entrance, the monsters won’t come near this place. Moreover, no one will able to find and enter this Dungeon, we can relax and sleep.”\n “Yes. All right.”\n He said those words, but he still prepared for the unexpected. He used his fingers to spread several threads of Mana over the Dungeon’s entrance, stairway, and the doorway located on the other side of the room. It would allow him to be aware of external threats beforehand, and it would give him some time to prepare for it. This was supposed to be an impossible task for a normal level 2 hero, but Artpe was able to pull it off.\n Maetel watched Artpe work. Her eyes were shining relentlessly.\n “Artpe is really incredible. There isn’t a thing you don’t know, you are great at everything except exercising. You are kind… Moreover, you are a hero!”\n “You are a hero too.”\n “I... I like being a hero, but in truth, I wouldn’t have minded if I hadn’t become a hero.”\n Artpe finally remembered the words spoken by Maetel in the morning. She most definitely said there was something she wanted to be more than a hero.\n She had role-played at being a hero everyday. He knew she loved being a hero, so what was she referring to when she said there was something she wanted more than being a hero?\n Artpe mused over it when he turned to look at Maetel in alarm.\n “Did you perhaps want to become the Demon King instead of a hero!?”\n “No way!”\n “You should most definitely not become one of the Four Heavenly Kings. It isn’t worth it.”\n “I’m not talking about that!”\n Maetel’s face had turned red as she fumed. Her anger pretty much wiped away the fear she felt for the Dungeon and the future. Artpe smiled for the first time, and he gently patted her head.\n “I already know, you dummy. Whatever you want to be, you should keep it safe within your heart. When the Demon King is dead, you’ll be free.”\n “Free…?”\n A hero only existed only because there was a Demon King in existence. When the Demon King disappeared, the Hero Class would also vanish. \n Then, the hero would be able to acquire a new Class.\n “That day will come, so you should safeguard your dream. You shouldn’t forget about it. I will help you achieve it.”\n “Dream... Do you really think I’ll be able to fulfill my dream?”\n “Of course.”\n He didn’t know what her dream was. However, the dream was probably something she could realize after the death of the Demon King. Artpe nodded his head vigorously, and Maetel’s face visibly brightened.\n “All right. I’ll try harder from now on! I’ll do whatever it takes!”\n “Yes. Anyways, it is time for us to sleep.”\n “Yes! Sleep well, Artpe!”\n “You sleep well too.”\n He had succeeded in motivating the hero. \n Now she would be an active participant in moving forward!\n Artpe let out a pleased smile. He had been able to turn the tide of Maetel\u0027s reluctance, and his plan was on track now.\n His expression was akin to a farmer waiting for his harvest.\n If he knew what Maetel was dreaming about, Artpe wouldn’t have been able to make such a contented expression. He had always been the lowest ranked of the Four Heavenly Kings because he had a habit of not catching the important developments.\n This was how the two heroes slept safely within the Dungeon on their first night out.\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/i-reincarnated-for-nothing/irfn-chapter-4","bookId":1506,"book":{"id":1506,"title":"I Reincarnated For Nothing","description":"Synopsis: “My life as a demon… No. My life as human is really…”\n Artpe was supposed to live a charmed life as the 4th strongest in the Demon King’s Army. However, his life was cut short by the hero’s blade.With his previous life’s memory intact, Artpe will live his life again. His boldness and resourcefulness will make him unrivalled!\n","cover":"http://cunovel.com/img/IRFN.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/i-reincarnated-for-nothing","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:17 AM"}}
