{"id":96048,"no":11,"title":"Page 11","content":"The following day Aunt Libby insisted I keep my evening date with Alexander, not only because he is so handsome, as she put it, but because she was overdue for a yoga workout. While my aunt was going to stretch her body and mind, I was going to spend the evening glued to Alexander. But I still had ages before sunset and I could either hang out in Aunt Libby`s apartment or go to Hipsterville`s library. I chose neither and opted for a little adventure. A few miles across town lay a mysterious crop circle that needed to be investigated. Phoenix would be confronting Jagger there at sunset and I might get a hint of their conversation and be back in time for Alexander`s and my date. At the very least, I was intrigued by the crop circles and had to know who or what was making them. Were they really signals for vampires? Why did Jagger have all the hoax material stashed in his apartment? I wondered what the circle looked like up close. According to the directions I got online, the same number seven bus that had previously taken me to the manor house made its way even farther through town and stopped a mile away from Mr. Sears`s farm. The RBI--Raven Bureau of Investigation--was back in business and on the hunt. Just in case of dangerous situations before me, I geared up with garlic powder, mace, and a flashlight borrowed from underneath Aunt Libby`s sink. Dullsville had its share of graffiti, vandals, and trespassers but nothing as exciting as an all-out alien invasion. Besides, if aliens traveled a million light-years to earth, I`m sure they`d be bummed to find they`d arrived in the boring town of Dullsville, U.S.A. Hipsterville, on the other hand, might make a great pit stop on the way to New York or Paris. But if my presumption was right and the boy on TV had seen hovering bats, the guy at the Dungeon bar was speaking fact, and Jagger`s mess was actually clues, the crop circles had the markings of a vampire. Perhaps the farmer was selling tickets to his nine-acre backyard. I half expected the number seven to be transformed into a tour bus. But there was nothing unusual about the number seven or its riders, and when the bus lurched at the stop, I was the only one who disembarked. The directions I had were pointing me to a single dirt road that separated luscious trees on one side from acres of wheat on the other. I was in the middle of nowhere and the sun was already beginning to set over the farmhouse. When I explored the Mansion or the manor house, there were at least other houses within the sound of a scream. I was as exhilarated as I was terrified as I hurried along the lonely dirt road. This was a prime spot for an alien or vampire sighting. There was nothing around for miles. All at once, I felt someone or something behind me. I held on to the flashlight with one hand and the mace with the other, the garlic powder inches away in my purse. I was confident I could talk myself out of a situation if I was confronted by the farmer or one of his neighbors, but I could see the latter was a remote possibility. Maybe I was imagining things. After all, I`d grown up watching Children of the Corn and The Texas Chainsaw Massacre. Farmer Sears seemed jovial on TV, though. Either way, I still was primed for a unique encounter and hummed to myself softly to keep calm. A dog barked in the distance, and I saw a small girl run out from the farmhouse and bring the animal inside. There was only a fence that surrounded the house and another one that ran alongside the wheat field. Perhaps that`s why it was so easy for some kids to pull a midnight prank. I decided to stay clear of the farmhouse so Farmer Sears wouldn`t come out a-shootin`. A few minutes later, I was far enough away to climb over the fence and bury myself in the rows of wheat. The surroundings were actually quite beautiful. There were no city or town lights, and the stars were so visible and vibrant I wasn`t sure they were real. I was heading through the stalks when I saw what I thought to be crows flying over a scarecrow posted a few yards ahead. As I approached the raggedy stuffed man, I realized that the flying creatures were bats. I crept closer until they vanished. It was then that I noticed that a few more yards ahead of me, in the middle of the wheat field, a circle as large as my house was mashed into the ground. The circle was even more thrilling than when I`d seen it on TV. It was hard to make out its gigantic circumference, but it must have been the size of a spaceship. I couldn`t imagine Jagger actually doing this alone. For a moment I wondered if in fact it was made by something other than vampires or human life. I was actually surprised when I remembered the farmer`s curious reaction on TV. I would have been furious. Whoever or whatever had destroyed a lot of his wheat. I followed the circle for quite some time, scanning and probing the dirt for anything unusual. I wasn`t a scientist from NASA, but I could tell that there weren`t any rocks or life- forms that I hadn`t seen before. It was getting harder to inspect in the dark, so I had decided to turn on my flashlight when I heard voices coming from the opposite side of the field. I was sure Farmer Sears had spotted me nosing around. I switched off my light, doubled back, and raced into the rows of stalks. I was ready to hightail it out of there and call off my crop circle adventure when I glanced back to see the farmer. I caught a glimpse of white hair. I immediately ducked and poked my head between the stalks. Jagger and two burly guys with tattoos and dressed in camouflage were examining the circle. I didn`t move. There`s been TV coverage, Jagger said. It`s been all over the news. This is good. I thought you wanted the club to be a secret, the taller member of his crew said. From mortals, stupid. Not us. That`s why we`re out here making sure these stay intact, Jagger said, surveying the smashed wheat. Vampires have been using crop circles for centuries to signal other vampires about areas where there`s an Underworld presence. But mortals can`t fathom our genius, so instead they think these are being made by extraterrestrials. It`s really best for both worlds. But we are attracting others that can make trouble for us, the shaved-headed one confessed, following behind. No one can make trouble while I`m in charge, Jagger argued. There are others who don`t want to follow your plan, said his burly cohort. Not everyone wants you to be in charge, Jagger. Shocked, Jagger spun back and confronted his bald supporter. Excuse me? It`s true, the taller one said, defending his friend. We`ve heard rumors. There are others who think the club should remain as just a club. Nothing more. We just wanted you to know. Anyone who dares to undermine me will have to deal with not only me but a gang of bloodthirsty vampires. Just then I saw a purple head rise behind Jagger and his cohorts. They were startled as much as I was. I didn`t hear your bike, Jagger said, bewildered. What are you guys doing out here? Phoenix asked. I should be asking you that. We are expanding our club--my club. And maybe it`s time we revoke your membership. You can`t. Can you? Phoenix challenged. I have eternal membership. I thought that`s what you wanted when you started the Dungeon. I did, but on my terms. Now out of our way; we have work to do. Phoenix stepped before him. We don`t need more members, Phoenix argued. It`s time you and your crew stop making these circles. There are plenty of our kind already in town. If we continue increasing our size, we increase our chances-- Of infiltrating the town? Jagger asked with a sinister smile. Of being run out of town, Phoenix said firmly. You don`t care about the club`s direction. All you care about is seizing control of it. And then who knows what you`ll do with it? It`s time for a new leader when the old one has undermined his followers. You`re inviting vampires to this town for the sole purpose of taking it over. It`s time to be part of the town. I`m tired of hiding. Now that I have a strong membership, we`ll be able to roam freely amongst the mortals. We have a right to be known, and that decision is not yours to make. Nor is it yours, Phoenix said, his arms crossed. You created a great club--a place for vampires to hang out in secret and be ourselves, without a threat to them or us. Where both worlds could live peacefully. But you let your ego get in the way. And now you are planning on destroying the very thing you created. I`m planning on expanding it. Not while I`m around. Don`t you realize that you are outnumbered? And that when we get more members, you won`t stand a chance? Jagger`s gang surrounded him. No one appointed you, Phoenix challenged. I will take you down. Then why don`t you do it here? Now? Jagger`s thugs closed their circle. It`s too easy, Phoenix said defiantly. I want to do it where everyone can see you fail. There was something so fiery and powerful about Phoenix. Though he stood alone before Jagger and the other two muscle-bound vampires, he was still not threatened. They closed in tighter. Don`t even think about it, Phoenix said, undeterred. Or we`ll end this whole matter right here. Jagger was quiet for a moment--then called off his gang. This won`t be the last of me. You can talk big here, in the middle of a field, but I have the club behind me. With that, Jagger and his thugs disappeared into the darkness. Phoenix remained in place. I could barely breathe. If he didn`t even flinch in the company of three frightening vampires, what was a mere mortal like me to do? He walked up to the stalks--only a few feet away from where I was hiding. I didn`t move a muscle or exhale. I closed my eyes. At any moment he was going to find me. I finally opened my eyes. Phoenix was nowhere in sight. He had vanished. I waited for a moment, making sure the coast was clear. I raced back through the field, over the fence, and up the lonely dirt road. I waved my arms and shouted frantically as a number seven retreated up the adjacent road. A passenger saw me and signaled the driver. As the bus pulled away and I slumped down in an empty seat in the back, I heard the sound of a motorcycle passing and racing off down the road.","sourceLink":"https://allnovel.net/the-coffin-club-vampire-kisses-5/page-11.html","bookId":2144,"book":{"id":2144,"title":"The Coffin Club (Vampire Kisses #5)","description":"Storyline: The Coffin Club (Vampire Kisses #5) When Raven returns to Hipsterville\u0027s cryptic goth haunt, the Coffin Club, she discovers a secret door to another disco-\"The Dungeon\"-that is inhabited by vampires only. Raven learns that the nefarious Jagger Maxwell has welcomed the vampire clan into the club and has gained the popularity he missed in Romania. He is poised to take over Hipsterville, until a new vampire named Phoenix challenges him for control of the Coffin Club. Unbeknownst to Alexander, Raven becomes caught up in the clash, entranced by the hypnotic vampire culture of the Underworld.","cover":"https://allnovel.net/images/the-coffin-club-vampire-kisses-5.jpg","author":"Ellen Schreiber","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-coffin-club-vampire-kisses-5.html","creation":"Oct 5, 2019 8:58:23 AM","modification":"Oct 5, 2019 6:18:15 PM"}}
