{"id":96039,"no":2,"title":"Page 2","content":"More than a few months ago I`d waved good-bye to my mother at Dullsville`s Greyhound bus stop and boarded the Hipsterville-bound bus to visit my ultraconservative father`s hippie sister, Aunt Libby.\n Today I was on a Prozac high, minus the Prozac, ecstatic to return to the funky town of Hipsterville--home to unique coffee shops, with handmade coffee mugs and fresh scones (not the overincorporated cutout kinds with focus-group canned-in music), goth and hipster boutiques, and the perfectly morbid Coffin Club. I was excited to see Aunt Libby again, but even more important, I was only a few hours away from being reunited, or so I hoped, with my number-one vampire-mate.\n I passed the bus ride doodling in my Olivia Outcast journal, imagining my reunion with Alexander. We`d meet inside the Coffin Club, where pale mannequins with bat wings hung from the ceiling and ghostlike fog permeated the air. Alexander would be waiting for me in the middle of the packed dance floor, with a single black rose. I`d run into his arms and he`d envelop me in them like a gothic Juliet. He`d lean into me and greet me with a long, seductive kiss, sending chills from my head to my combat boots. We`d dance the night away to the twisted sounds of the Skeletons until my legs could no longer hold me up. Alexander and I would venture off into a tiny church`s graveyard, and we`d climb into a vacant crypt, where an empty coffin would be awaiting us. He`d close the lid on our night as dawn approached, and we`d snuggle together in darkness.\n I was halfway through an episode of The Munsters on Billy Boy`s borrowed (or rather bribed) iPod when I noticed the two-mile exit sign for Hipsterville.\n Last time I arrived in Hipsterville, sunny skies and puffy blue clouds hung over the town. This time I was met with ominous clouds and a fierce downpour.\n I covered myself with my skull-and-crossbones hoodie as the driver, undeterred by the pouring rain, unloaded suitcases from the bus`s cargo hold. Finally I saw my suitcase, grabbed it, and huddled underneath the bus-stop shelter along with a crowd of other passengers. One thing hadn`t changed--Aunt Libby was nowhere to be found.\n I watched as each traveler was picked up by their party until I was the only traveler left waiting at the stop. When tapping my boots in the rising puddles grew boring, I headed for the convenience store a few yards away. I checked the aisles for any hippie chicks with the scent of potpourri or women wearing Nairobi sandals and tie-dyed skirts. Unfortunately, all I saw were a few truckers and the hungry bus driver. I grew more excited to see my hipster Aunt Libby again. She and I were outsiders among the Madison clan. My aunt lived an unconventional lifestyle, working as a waitress in a vegan restaurant to support her acting career. She was a free spirit, and Hipsterville was a funky town where she could be her organic-eating, hemp-wearing, liberal self. Though we had different tastes, I always felt bonded with her in that we shared a passion for being different.\n Ten minutes later, Aunt Libby was still nowhere to be found. Perhaps she was stuck in a rehearsal or filling up the saltshakers at the restaurant. I could feel the glare of the tattooed cashier. I didn`t want to appear to be loitering, which I was, or stealing, which I wasn`t. My stomach started to growl. I hovered over the candy aisle, debating which sugary cavity-forming candy to buy, when I felt a tap on my shoulder. I turned around. A beautiful lady wearing pressed pants, a Happy Homes real estate jacket, and my dad`s smile was standing in front of me.\n Aunt Libby? I asked, confused.\n Raven! It`s great to see you! She gave me a hard squeeze and I could feel her rain- stained face against my own dampened one. I hope I wasn`t too late.\n I just got here, I fibbed.\n I bet you`re starved. We can stop and grab a bite. I took the rest of the day off. She lifted my suitcase and we hurried into her vintage Beetle.\n I couldn`t help but stare at my aunt, who had traded her waitress outfit for a real estate one, as we buckled in.\n Surprised to see me in a suit? she asked, obviously reading my thoughts.\n I don`t think I`ve ever seen you without sandals and a flower in your hair, I teased.\n I figured it was time to get a real job, she confessed. I didn`t bother telling your father. I haven`t been working that long and I`ve already taken a half day. She laughed. So who knows how much longer it will last.\n She started the car and the engine putt-putted as she motored through the historic downtown area.\n Aunt Libby was such an independent spirit, I felt disappointed and sad that she was giving up her dream. I didn`t want her to change, nor did I ever want to change. I wondered, if Aunt Libby had to give up her passions, would I have to, too?\n Have you given up acting? I asked.\n No, it`s in my blood, she said. In fact, I`m doing a one-woman show. You can take the girl out of acting but not the acting out of the girl.\n I felt relieved. A one-woman show...That`s great. Soon enough you`ll have your own Oscar.\n Aunt Libby chuckled, then turned serious. Raindrops pelted the windshield and the rustic wipers struggled to clear them as we headed toward her apartment.\n Something felt strange as I gazed out the window. An eerie shadow blanketed the town as we drove through it. I thought I saw a few bats hovering over a church.\n Wow...Those look like...\n Bats?\n Yes.\n There was a nest of them in one of the houses we have on the market. You would have loved it!\n Awesome.\n And you would have loved this house we just rented.\n Really? Is it spooky? Completely. It was a half-dead manor house.\n A manor house? I asked. It couldn`t have been the one Alexander and Jameson had occupied last time I was here.\n Yes, my aunt replied.\n Well, there must be a lot in this town, I hinted.\n Not too many. And not one like this.\n What do you mean?\n It had been abandoned for years. The back lawn was completely overgrown, and I think the floors needed to be rehabbed, but the new renter didn`t seem to mind.\n Is it the one on Lennox Hill Road?\n Yes. How would you know?\n Uh...I remember seeing pictures of it in the paper the last time I was here, I lied.\n It does seem like a house you would love to live in. I wouldn`t be surprised if it was haunted.\n If someone had rented the manor house, then where were Alexander and Jameson staying? And how would I ever find them?\n Do you still have the key? Maybe they can give me a tour.\n No, the man who is renting it has the key.\n What does he look like?\n My aunt appeared puzzled.\n I was just wondering what kind of a man would rent a manor house. Perhaps a prince or a big-time executive, I prodded.\n This man wasn`t a prince but more of a gentleman. He did look creepy--in the ghoulish sense of the word. I guess that`s why he liked the house.\n Jameson! I blurted out at the same time Aunt Libby tapped her horn and hit the brakes.\n A sparrow quickly flew off in front of us.\n I brake for birds, she said with a smile.\n I wondered why Jameson would rent the manor house. Did they plan on staying indefinitely? My heart sank. Then I remembered Alexander`s reassuring words: I will return soon. But what was keeping my boyfriend here?\n We turned onto Aunt Libby`s tree-lined urban street and she confidently, or foolishly, squeezed her Beetle into an anorexically small space between a truck and an orange scooter. Aunt Libby attached a lock to her steering wheel. She opened the entrance door to the 1940s row house apartment building, unlocked her mailbox, followed by her apartment door. Aunt Libby had as many keys as Dullsville High`s janitor.\n The smell of lavender incense bled through the cracks of Aunt Libby`s apartment door before we entered. Once inside, a waft of floral scents hit me as if I`d just stepped into a flower conservatory.\n Though Aunt Libby`s attire had changed, her apartment decor hadn`t. Besides a few stacks of real estate manuals sitting on her coffee table, the sixties and seventies still ruled the one-bedroom apartment. Beaded curtains hung from the frame of her bedroom door and half- melted candles lined every inch of available space, from the mantel to the floor.\n As I shed my rain-soaked clothes for dry ones in Aunt Libby`s dinky bathroom, I imagined what my life would be like on my own if I`d never met Alexander. Who would I grow up to become? Dullsville was way too dull for a girl like me. I`d probably end up in Hipsterville in an apartment similar to my aunt`s, only it would have dripping wax candelabras, black lace curtains, and a gargoyle headboard on my bed.\n But what would it mean if I couldn`t share it with Alexander? Living on my own and working perhaps as a bartender at the Coffin Club night after night. I felt a pang of loneliness for my aunt--she had eaten, slept, lived by herself for as many years as I could remember. Instead of being dragged down by her independent lifestyle, Aunt Libby seemed to thrive on it. She serial dated and had a wide circle of friends from her theater community. Aunt Libby was gorgeous. Someone as hip and cool as she could get any man she wanted.\n I reapplied my chocolate eye shadow and liner and towel dried my damp hair. I smelled teriyaki sauce and found Aunt Libby--the one I`d always known, wearing embroidered jeans and jeweled flip-flops, a halter top underneath a linen jacket--stir-frying in her wok.\n I sighed, relieved that my aunt had returned to her inner Deadhead.\n Aunt Libby served our healthy entrees. We sat down at her coffee table, on oversized mismatched fluffy pillows, surrounded by candles, incense, and a spicy Asian meal.\n I think I`m getting married! she suddenly announced. I`ve been dying to tell you.\n You are? I asked, surprised. Congrats! Dad didn`t mention...\n Well, okay, it`s not official or anything. In fact, we haven`t officially gone out yet. I just met him last night.\n Aunt Libby`s face flushed bright red. She grabbed a brown hobo purse that was sitting on her paisley futon and pulled out a rainbow-colored beaded wallet. She opened it and presented me with a Renegades paper napkin. It had a man`s name and phone number written on it. He has beautiful handwriting, doesn`t he?\n Devon. That`s a cool name.\n I can`t wait to tell you all about him.\n Tell me all!\n He has pool-colored eyes and salt-and-pepper hair.\n He sounds dreamy.\n I noticed him in the audience when I was onstage. I almost couldn`t see him because he was just outside the glare of the spotlight. He has the most piercing blue eyes I`ve ever seen. Our eyes locked and I forgot my lines. I stood there, frozen, for what seemed like hours. He had this hypnotic stare.\n I laughed. Aunt Libby was like a sixteen-year-old girl who had fallen in love.\n When the show was over, he was waiting for me. We had this intense connection I`ve never felt before.\n I know exactly what you mean. That`s how I feel about Alexander. That`s why I had to come here....\n Come here? she asked.\n Uh...yes, for girl time.\n I know what you mean. I`m bursting at the seams to talk about him, but there`s not much I know--besides how handsome he is!\n I`m sure I`ll be calling him Uncle Devon within a matter of days. Can I wear black to your wedding?\n I wouldn`t want it any other way. We have a date in the next few days and you have to come.\n You are going out on your first date with him and you`re going to show up with me? Your vampire-obsessed niece? Even I don`t think that`s a good idea. You have to come. I can`t wait for you to see him...and I can`t leave you here alone.\n Of course you can. But we can talk about it tomorrow.\n We had just placed the dishes in the sink when Aunt Libby noticed the time.\n I have a drumming class tonight. I was hoping you`d join me.\n Well...I...\n I don`t have to go.\n No, I don`t want you to miss it on account of me.\n It`s a master class tonight. Otherwise I wouldn`t think about going.\n Please go. I`ll be fine. I wouldn`t be able to run across town and try to make contact with Alexander if I were stuck in a drumming class all night.\n Think about it while I get ready.\n While Aunt Libby prepared for class, I stretched my legs out on her futon and turned on the nineteen-inch TV with a leaning cactus on it. Her TV received only local channels and the color faded in and out at will.\n How do you live without cable? I asked, frustrated.\n I switched on the local news. Normally I would have turned the set off quickly and kept myself busy text-messaging Becky about my arrival. But something caught my eye.\n Hi, I`m Anne Ramirez, reporting to you live. I`m standing with Fred Sears, a farm owner who discovered a crop circle in his wheat field. This is the second one reported in this county in less than a month, this one being a little more intricate than the last.\n The camera panned to the wheat field, where stalks had been crushed against the ground in the shape of a fifty-foot circle, with several smaller circles in the center.\n The petite woman stood next to the black-haired farmer, who was three times her size. When did you notice this? she asked.\n When I woke up. It just cropped up,` he joked.\n I rolled my eyes as I watched two preteens running around it.\n I saw bats hovering over the area last night, said one boy, almost breathless, to the reporter.\n Those were crows, stupid, the other admonished. Flying away from the alien spacecraft that landed here.\n They were bats! the boy insisted.\n Anything interesting? my aunt called from her room.\n Just a crop circle with hovering bats.\n The girls at the agency were talking about that at lunch. They are convinced it`s all for publicity.\n The video switched to an aerial shot from WBEZ`s helicopter. The circle was impressive.\n Then the camera was back on the reporter.\n Spacecraft or just spaced out? You decide. Back to you, Jay.\n That`s so bogus..., I called to my aunt. I saw a report on TV once where kids confessed to creating them. They demonstrated to the reporter how in the middle of the night they used a stake, a rope, and wooden boards to press down the stalks and form a giant circle.\n My aunt came back into the living room dressed in an off-the-shoulder cotton top and pea green yoga pants. I believe we aren`t the only ones in the solar system. They could be aliens. No one has disproved their existence.\n Are you kidding? You really believe in aliens?\n Do you really believe in vampires? She had a point. Yes, but they are real, I blurted out without thinking. Uh...I mean, no one has disproved their existence.\n I`m just saying, Aunt Libby argued as she added some final touches to her hair, it could be the markings of an alien aircraft--or a signal for other aliens. Aren`t crop circles meant to be viewed from the air?\n The boy on the news swore he saw bats last night. Maybe it could be vampires signaling other vampires, I suggested.\n Hmmm. I like your theory better. Aliens are kind of odd-looking and have green heads. Vampires are sexier. I`d prefer to see them invade our town.\n I gave my thought pause as the anchor turned the focus to weather. Our five-day forecast calls for rain and fog.\n Curiosity getting the best of me, I couldn`t shake the farm boy`s claim. After all, who better to go undetected in the night than vampires? They could easily see the circles as they fly in bat form over the horizon. There was no way to confirm my theory by sitting in my aunt`s apartment, and it wasn`t like me to not poke around for some clues.\n Do you mind if I check my e-mail? I asked.\n Sure. The computer is already on.\n I searched the Internet on my aunt`s iMac for vampires and crop circles. I scrolled past various movie and book sites until I came to a small website that specialized in paranormal sightings in North America. All the entries detailed unearthly bright lights, alien abductions, and hoaxes. Just as I began to click out of one such site, I spotted something of interest. Instead of green-headed monsters, one blogger claimed that the night before he spotted a crop circle, he`d seen a swarm of hovering bats.\n I thought I`d stumbled onto something big. The entry had to be posted by a Harvard scholar, a scientist, or a Nobel Peace Prize winner. Instead it was signed Bob from Utah.\n Bob could have been a crackpot like any other, a bored kid in study hall posting erroneous entries on websites, or, like me, a vampire-obsessed mortal with an overactive imagination. But I took his single entry as a sign.\n There was one way to investigate my theory further. I had an advantage that Bob in Utah didn`t--I was dating a vampire.\n Are you sure you don`t want to come with me? my aunt asked as she picked up an African drum lying next to the fireplace.\n I`m beat--no pun intended, I teased, shutting down the computer. Do you mind if I just crash?\n Even if I wasn`t preoccupied about reuniting with Alexander, the thought of amateur drummers learning how to bang on instruments for two hours was enough to make me mental.\n There`s plenty of tofu patties in the fridge and soy pudding in the cabinet. I`ll call you on your cell at break to check in.\n Thanks, Aunt Libby, I said, giving my dad`s sister a hug. I really appreciate your letting me visit you again.\n Are you kidding? I love having a roommate. Just bolt the door behind me and don`t buzz anyone in. And please, don`t get abducted by aliens. Your father would kill me. \n","sourceLink":"https://allnovel.net/the-coffin-club-vampire-kisses-5/page-2.html","bookId":2144,"book":{"id":2144,"title":"The Coffin Club (Vampire Kisses #5)","description":"Storyline: \n The Coffin Club (Vampire Kisses #5) \n When Raven returns to Hipsterville\u0027s cryptic goth haunt, the Coffin Club, she discovers a secret door to another disco-\"The Dungeon\"-that is inhabited by vampires only. Raven learns that the nefarious Jagger Maxwell has welcomed the vampire clan into the club and has gained the popularity he missed in Romania. He is poised to take over Hipsterville, until a new vampire named Phoenix challenges him for control of the Coffin Club. Unbeknownst to Alexander, Raven becomes caught up in the clash, entranced by the hypnotic vampire culture of the Underworld.\n \n","cover":"https://allnovel.net/images/the-coffin-club-vampire-kisses-5.jpg","author":"Ellen Schreiber","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-coffin-club-vampire-kisses-5.html","creation":"Oct 5, 2019 8:58:23 AM","modification":"Oct 5, 2019 6:18:15 PM"}}
