{"id":96041,"no":4,"title":"Page 4","content":"I held my breath in wild anticipation of seeing the Coffin Club up close once again, but when I approached the underground club, I was shocked. More than a hundred young goths were anxiously awaiting admittance to the club--twice as long a line as I remembered it being last time. The procession of clubsters, dressed similarly to me (except sporting different-colored streaks, tattoos, piercings, and shoes), wrapped the block like a line at Disney World. I`d be lucky if I gained entrance before summer break was over. Frustrated, I began walking toward the end of the line. I was about halfway down the block when I noticed a guy with a cape and vinyl pants bent over, adjusting his monster boots. I snuck in the space before him and tried to appear inconspicuous. I avoided any trouble by standing with my back to him and gazed at the stars and then a few birds flying above the roof of the club. When the birds began to hover instead of fly off, I realized I`d spotted a cluster of bats. How wicked--bats at the Coffin Club!\\n\\n I checked my watch. Aunt Libby`s class was going to end in less than an hour, and it appeared that I`d be spending the time waiting in this never-ending line.\\n\\n I anxiously shifted back and forth. I peered out toward the club`s entrance to see if there was an obvious holdup, but there wasn`t anything more than a bouncer checking IDs. It was then I noticed a familiar couple standing at the head of the line. I leaned out, holding my place with one foot like a checkers player holds his place with his finger before making his next move. It was Primus and Poison, two clubsters I`d snuck in front of last time I`d visited the club.\\n\\n Primus and Poison. How could I forget their names when all I`d ever known were names like Billy, Matt, or Becky?\\n\\n I took a chance and stepped out of line, racing up to the macabre duo. Primus! Poison! It`s me, Raven!\\n\\n The pair scrutinized me. It was clear they wanted to recognize me--after all, I did know their names. But I could tell by their gaze that they couldn`t place my face.\\n\\n I met you a few months ago, here in line, I said, finagling my way into the crowded line beside them.\\n\\n Oh yeah, Primus, a Marilyn Manson look-alike, said, finally remembering. How are you doing?\\n\\n Poison looked at me with venom in her eyes.\\n\\n I`m great! I said to Primus. It`s so cool to see you again. Then I turned to Poison. I love your corset! It`s beautiful!\\n\\n Poison`s disposition changed. I just threw this together.\\n\\n No way! You should be a model for Gothic Beauty.\\n\\n One could hear the sudden sound of a motorcycle`s engine revving above the other street noises and the throbbing music bleeding out of the Coffin Club. A Harley-Davidson Night Rod shot up the street and screeched to a halt in an empty VIP space right in front of the club. The hot rod had a sleek and sexy design, black-walled tires with orange pinstripes. The rider took off his helmet, emblazoned with a white skull and crossbones, unleashing shoulder-length jagged purple hair with black undertones. Wearing dark Ray-Bans and dressed in stud-and-chain-riddled leather pants and jacket, the motorcycle rider confidently hopped off his Night Rod, nodded to the bouncer, and walked right into the club as if he owned it.\\n\\n Who`s he? I wondered aloud. A celeb? I didn`t recognize him.\\n\\n They all think they are movie stars here now, Primus said.\\n\\n Yes, this club has tripled in size in the last few months. And so has the attitude, Poison added.\\n\\n The line inched forward, and before I knew it we were presenting the burly bouncer with our IDs.\\n\\n The gatekeeper immediately stamped the image of a bat on Primus`s and Poison`s hands and strapped barbed-wire-shaped bracelets on their wrists, but he scrutinized my card like he was checking a passport at an international airport. Poison doubled back and got right in the bouncer`s face. She comes here all the time, she said. I can`t believe you don`t remember her.\\n\\n The bouncer lifted his gaze back to me, his expression one of disdain, then shifted it to the waiting line, sporting streaks in various colors of the gothic rainbow.\\n\\n I had blue hair last time, I said.\\n\\n Oh, that was you? he asked seriously.\\n\\n He stamped my hand with the Coffin Club bat and wrapped a band around my wrist. I had gained passage to the Coffin Club. We slipped behind the bouncer, headed past the bloodred carpet and rope and two skeleton greeters, and before I knew it I was walking through the black wooden coffin-shaped doors.\\n\\n Thanks, I said to Poison. Everyone says I look younger than I am. I bet you get that a lot, since you have such flawless skin.\\n\\n Poison`s ghost white face lit up. She put her arm around me. I`ll buy the first round, she said.\\n\\n The Coffin Club was still morbidly magical. Neon headstones flashed against black spray-painted cement walls. Pale mannequins, dressed in antique clothing or Victorian suits or bound in leather, hung from the rafters. Music pulsed hard throughout the club as if the DJ were trying to wake the dead. A balcony, the place where I`d first encountered Alexander`s nemesis, Jagger, loomed over the vampire-wannabe crowded dance floor, blood-filled amulets swinging from necks like Olympic medals.\\n\\n But Primus was right. The Coffin Club had changed in the last few months. The club was packed, black wall to black wall, with clubsters. The thick dry ice permeated the air like a Jack the Ripper London fog, making it difficult to see. And where, as last time, I got stares as I ventured through the club, this time the clubsters were intensely partying and seemingly uninterested in a newbie.\\n\\n I followed Primus and Poison to the bar, but other eager patrons pushed their way in front of me, leaving me to fall behind. I could see their heads above the crowd as I squeezed between the clubsters. When I thought I`d finally reached them, I realized I`d been following another couple the entire time. I popped out at the mini\u0026#65533;flea market, where for a small price a clubster could buy anything from an amulet to a sit-down with a numerologist. The packed dance floor was next to the row of sellers, but the bar was nowhere in sight.\\n\\n I squeezed my way back between the dancing and drinking clubsters, past the giant tombstone-shaped restroom doors marked MONSTERS and GHOULS. I finally saw a wall filled with bottles, spiderwebs clinging to them. I knew I had found the holy grail. But the bar was so jammed with thirsty customers it was impossible to see who was bartending or where Primus and Poison were located. I squished my way through. Just as a girl was sliding off a tombstone- shaped barstool, I jumped on it.\\n\\n A guy sitting next to me spun around. He was wearing more eyeliner than Alice Cooper, and it didn`t look as good on him as it did on the elder rocker.\\n\\n I`ll buy you whatever you want, he said, slurring his way into my face and space.\\n\\n I spotted the bartender, Romeo, but neither my barmate nor I attracted his attention.\\n\\n Romeo responded to every wave of a ten-dollar bill but continued to ignore us. When he passed by for the hundredth time, I leaned over the bar and grabbed his tattooed arm.\\n\\n Since Alexander and Jameson had been mum about all things Maxwell, I thought this was my chance to get some inside scoop. Did Jagger go back to Romania? I asked. Romeo, holding a beer in each hand, glared at me. The mention of Jagger`s name gave him pause. Like Primus and Poison, he didn`t recognize me.\\n\\n Who wants to know? he asked suspiciously.\\n\\n Raven. Is he in town? Or did he go back to Romania?\\n\\n Raven...Your name sounds familiar.\\n\\n I realized I shouldn`t have let Romeo know I was looking for Jagger. I wasn`t a regular clubster; I was the girlfriend of Jagger`s nemesis. Alexander had already reunited Valentine with him. Now it appeared as if I was stirring up trouble. How could I have been so stupid?\\n\\n I`ll have a Medieval Massacre, and the lady will have--, my barmate began.\\n\\n I`ll be right back, I said, knowing I wouldn`t return.\\n\\n It was time to call it a night. I`d lost Primus and Poison. I`d been asking about locations of nefarious vampires. And I was an underage girl alone at a bar. I`d better arrive at Old Town before this black-fingernailed Cinderella turned into a pumpkin.\\n\\n Fatigue set in as I headed for the entrance doors. It was starting to hit me that when I`d woken up this morning, I was in Dullsville. I began to feel dizzy as I pushed and squeezed my way through the fog-filled club, my safety pins getting tangled on other clubsters` chains. When I glanced up, I`d reached a wall that was unfamiliar but had a coffin-shaped door. I tried to open it, but it was stuck. I turned the knob and pushed my body against it.\\n\\n The door flung open and I stumbled into a barely lit area. It took me several steps before I realized that instead of exiting into the street, I had entered a dimly lit corridor.\\n\\n I would have turned back, but I heard music (different from the song being played in the Coffin Club) pulsing from the other end. Perhaps it was coming from Jagger`s apartment--the very one he had shown me when I visited the club on my last trip. It would take only a moment for me to find out. A single overhead naked bulb lit the cryptic corridor, and graffiti lined the cement walls like an urban overpass. When I reached the end of the corridor, I discovered another smaller tunnellike path, with arched stone walls and a very narrow, steep staircase that plummeted into darkness. I let the rusty handrail go untouched and crept down the stairs. They led to a single wooden dungeon door. Written in bloodred spray-painted letters was: DEAD END.\\n\\n Was this someone`s office? Or perhaps another entrance to the apartment Jagger had been living in?\\n\\n I pressed my ear to the coffin-lid door. I could hear a mixture of music and voices.\\n\\n I slowly turned the knob and pushed the door, but it wouldn`t budge. I heard some voices behind me and the sound of footsteps descending the stairs. It was a dead end--I had nowhere to go. I knew at any moment I might be kicked out of the club and perhaps Hipsterville altogether--if I lived to tell.\\n\\n Two guys with the complexion of corpses, one blond, one redhead, confronted me. Can`t get in? the blond one asked.\\n\\n I forgot my key, I said flippantly.\\n\\n It`s okay, I have mine.\\n\\n He unclipped a skeleton key swinging from a chain attached to his studded belt.\\n\\n Getting in is easy, the blond said.\\n\\n That is, if you make it past Dragon, his friend retorted.\\n\\n But getting out is harder, the blond warned.\\n\\n I didn`t know what lay on the other side or why a key was required to unlock the door. I`d also never heard of a guard shielding the inside of a door. The coffin lid creaked open. We stepped into a dark and dingy foyer where we were greeted by a monstrous-looking bouncer the size of a small dinosaur. Black fabric hung behind him like at a car wash, blocking any view of what he was guarding.\\n\\n The bouncer`s head was shaved, and inked on it was the head of a dragon, its reptilian wings breaking out of his white tank top and wrapping his Terminator biceps. I didn`t dare ask to see the bottom half of the fiery dragon.\\n\\n The two corpselike guys showed him their keys, walked through a slit in the fabric, then disappeared.\\n\\n Where is yours? he grumbled.\\n\\n He has it, I said, pointing to the guy I`d followed in. Please, they`re waiting for me.\\n\\n He paused, inspecting me to see if I was worthy of passing. I`d flashed him my best Don`t make me ask to see the manager face when the door opened again and a group of clubsters, draped in black and sporting white fangs, entered.\\n\\n Next time, keep it on you, he said. Otherwise you`ll be banned.\\n\\n I pushed through the fabric before Dragon changed his mind. What lay on the other side blew my mind--it was a massive underground tomb. An ancient-looking subterranean cemetery, with serpentine catacombs and graves dug out in the stone walls and dirt floors, like something unearthed on the History Channel. It was creepy, dark and dangerous. In the center, a sunken dance floor with a hard-rocking band played on a fluorescent-lit stage. Spray-painted in red on the wall behind the bandmates were the words THE DUNGEON with a pair of real shackles and chains hanging down. Suspended above was a candelabra chandelier where a disco ball might be. Surrounding the dance floor were hallowed tombs carved into the walls, like a skeletal morgue, and fifteen-foot-high stone archways leading to cavelike rooms. Where mummies would have been buried instead were live bodies, drinking, smoking, and making out. Each cave was lined with black or red velvet and had puffy leather couches with canoodling couples. More than a few entranceways spawned darkened tunnels, their destinations unknown from my vantage point. Some bore signs--THE EXECUTIONER`S LOUNGE, THE TORTURE CHAMBER, DRACULA`S DEN--while others remained bare like an unmarked grave.\\n\\n As morbid as the buried club was, the clubsters themselves were stylishly ghoulish. The dancers were uniformly pale, blue lips covered with red gloss. The clubsters ranged in dress from goth to punk to gothic Lolitas. Each appeared to be more seductive than the next. The club`s stone walls dripped with danger, while its inhabitants oozed with sensuality. Though its existence and location were secretive and secluded, I`d stumbled upon a cryptically wicked party scene. This club was far more intimate and sinister than its sister club above.\\n\\n And unlike the patrons upstairs, these ghost white clubsters appeared inviting. Guys and girls alike checked me out as I made my way through. Some stared at me as if they guessed I didn`t have a key to enter, while other oglers didn`t seem to care.\\n\\n Guys were kissing girls` necks, wrists, and every place with a prominent vein as the girls smiled back with delight.\\n\\n This crowd was definitely a whole lot friendlier. Hi. Want to dance? A guy approached me as I was avoiding stepping into a grave, while another girl, her nose as long as a witch`s, just followed me. I haven`t seen you around before. Are you single? I know the perfect guy for you.\\n\\n But instead of obliging them, I snuck up to the bar and hopped on a barstool.\\n\\n A bartender, his hair flowing down to the dirt floor, set a black Dungeon bar napkin in front of me. We have imports or domestic. Uh...how about local?\\n\\n The bartender laughed. It`s ladies` night. Girls drink free.\\n\\n I was as thirsty as a bloodless vampire.\\n\\n In that case...something nonalcoholic.\\n\\n Sure...why dilute it.\\n\\n He grabbed a vintage green bottle, poured its contents into a pewter glass, then pushed the drink to me.\\n\\n The drink smelled peculiar. I was hoping it would taste like supersweet Kool-Aid, but it appeared to have the consistency of tomato juice.\\n\\n I touched it with my finger and examined it closely.\\n\\n Then I realized it was neither Kool-Aid nor tomato juice--it was blood.\\n\\n Was this a mistake, or perhaps a practical joke?\\n\\n Can I get some water, too? I asked, flagging him down.\\n\\n Don`t you like it?\\n\\n It`s delicious, I said, not wanting to draw attention to myself. I`d like to finish it off with a glass of water.\\n\\n He placed another goblet next to my blood-filled one while I rubbed my hand with a bacterial wipe underneath the bar.\\n\\n I smelled the new glass. Who knows--it could have been filled with whiskey. There wasn`t any noticeable scent, so I took a small sip. I was in luck. It was ordinary Hipsterville tap water. I guzzled it down, then placed a tip on the bar. I was getting ready to hop off the stool when someone put their hand on my shoulder.\\n\\n A slender guy with a five o`clock shadow sat at the bar next to me. Where are you from?\\n\\n I rolled my eyes and recoiled my shoulder from his hand.\\n\\n I don`t mean that as a pickup line; I really meant it--where are you from?\\n\\n Are you taking a survey?\\n\\n As a matter of fact...\\n\\n I didn`t feel like telling a stranger my personal address. It was enough that Jagger had followed me home from the Coffin Club last time I`d visited Hipsterville. I didn`t want Five O`clock Shadow showing up at my house, shaved or not.\\n\\n You`ll have to find someone else for your survey.\\n\\n I`ve never seen you here before. How did you find out about this place?\\n\\n A little bat told me.\\n\\n He cracked a smile.\\n\\n And you? I asked, only to be polite.\\n\\n The crop circles. Then I knew there was a population of our kind here.\\n\\n Aliens? I asked.\\n\\n The stranger laughed again. I was intrigued by his response, but I knew if I pressed him for more info, he`d interpret our continuing conversation as a come-on.\\n\\n Let me buy you a drink, he said, moving close.\\n\\n Thanks anyway; I`m not staying.\\n\\n You`re cautious. I understand...We all are. That`s why the Coffin Club is the hottest underground club. We can all be ourselves. By the way, my name is Leopold.\\n\\n Uh...I`m... I felt something vibrating in my purse. I reached in--it was my cell. Saved by the bell-- or in this case vibration. I have to take this, I said, leaving the bar. I flipped my cell open and snuck under a stone archway.\\n\\n Raven? It was Aunt Libby. I could barely hear her. How are you?\\n\\n Hi, Aunt Libby, I shouted back. I`m fine.\\n\\n What are you doing? I can hardly hear you.\\n\\n I sauntered through the catacombs, heading away from the noisy dance floor.\\n\\n I have your stereo cranked.\\n\\n You`ll have to turn it down. I don`t want my neighbors to complain.\\n\\n Of course. I`ll turn it off as soon as we hang up.\\n\\n Are you having a good time?\\n\\n Can you talk louder? I asked, holding my other ear closed with my index finger.\\n\\n Are you having fun? I`m sure you`re bored to tears.\\n\\n It`s not too bad, I bellowed back, continuing to walk.\\n\\n I wish you had come to class with me. Our teacher was from Kenya. He was truly amazing.\\n\\n Don`t worry about me. I`m having a great time by myself, I said truthfully.\\n\\n What? I can`t hear you.\\n\\n I`m having a great time, I shouted as a few clubsters dressed in cosplay outfits passed me.\\n\\n Class will be letting out shortly. I`ll see you soon.\\n\\n Take your time, Aunt Libby.\\n\\n What?\\n\\n You don`t have to rush on account of me.\\n\\n I can`t hear you. We`ll talk when I get home. See you soon. She hung up before I had a chance to stall her departure.\\n\\n It was imperative that I beat Aunt Libby home.\\n\\n I dropped my cell in my purse and realized I`d lost my sense of direction. Was the Dungeon dance floor to the right or the left? I had a fifty-fifty chance of making the correct choice. Naked bulbs lit the way through the stone tunnel, and a few more catacombs splintered off. I`d been so focused on my conversation with Aunt Libby that I hadn`t made any mental directional notes. I needed a trail of bread crumbs.\\n\\n I noticed some skulls lining the tunnel like a kitchen border. I didn`t remember seeing them when I was talking on the phone, but then again, I wasn`t looking.\\n\\n The tunnel was dimly lit and confining. The stone walls leaned as if caving in on me as I paced in indecision.\\n\\n I heard some voices and laughter coming from one end, so I followed them. Cautiously I crept through the catacombs, trying not to trip on the uneven terrain. The winding tunnel dumped into a small room. THE COVE. A dozen or so clubsters, their backs to me, were listening to what I thought might have been a stand-up comic. I was curious why they chose to listen instead of jamming on the dance floor.\\n\\n But this was no ordinary blue-jean-wearing comedian. He wore a dark hoodie, pulled over his head, obscuring his deathly pale face, and he wasn`t making the crowd laugh.\\n\\n The Dungeon should take a new direction. Why hide in obscurity when there is so much more we can do? he challenged. Catching the glare of a single stagelight was a gold skeleton key dangling from a black lanyard around his neck like a backstage pass to a rock concert. I agree. Why deny who we are? a girl asked, a snake wrapped around her neck like a mink stole.\\n\\n That`s why this club is so important, so we can be ourselves, another began.\\n\\n But the Dungeon is a secret and safe place we can call our own.\\n\\n Isn`t it time we make ourselves known? the snake whisperer argued, caressing the reptile. Many of us are becoming frustrated remaining hidden.\\n\\n But many others feel safer among ourselves, one clubster admitted.\\n\\n We don`t get along with outsiders, another said.\\n\\n Maybe it`s time that we try, a girl in the front row said.\\n\\n So we can be like them and lose our identity? another asked.\\n\\n The tension grew from both sides. The speaker held his hands up. Calm down. We must all be united.\\n\\n A guy hanging next to me asked, What do you think?\\n\\n All at once the group was staring straight at me. The snake, still coiled around his owner, hissed.\\n\\n I think it`s time for me to get back to the dance floor!\\n\\n I stole my way back into the once deadly tunnel. My eyes didn`t have a chance to adjust to the darkness and I bumped into a pair of girls. I stiffened but was too tired for a barroom brawl.\\n\\n Excuse me, I said. Do you know the way back to the dance floor?\\n\\n The girls, unlike the Pradabees at Dullsville High, weren`t confrontational. Instead I felt a warmth and friendliness emanating from them.\\n\\n The two girls appeared to be my age. One wore an indigo blue corset dress, while the other sported a baby doll dress and thigh-high silver-laced boots. Their purple-hued vampy makeup dramatically accentuated their Draculine features. One had long red curly hair and the other`s jet black hair was straight as a blade.\\n\\n Follow me, the girl in the corset dress directed, linking our arms. I`m Onyx, and this is Scarlet. What`s your name? She flashed a gorgeous smile, revealing a tiny black onyx jewel embedded on one of her fangs.\\n\\n Wow--where did you get those? I began. They look so real.\\n\\n She flashed her fangs again. It is. We can totally get yours done, too.\\n\\n I was taken aback. Onyx was referring to the jewel, while I was referring to her fangs.\\n\\n How do you find your way around the club? I asked.\\n\\n It took us an eternity, Scarlet replied.\\n\\n Before I knew it, I`d made it safely to the center of the club, two new friends in tow.\\n\\n Thank you so much, I said. Now I`ll be on my way--\\n\\n Their bright expressions turned sallow. Don`t you want to dance?\\n\\n Here I was hanging out with two of the coolest girls I`d ever met--when I`d been excluded by cliques my whole life. It was thrilling to be immediately accepted as myself. And I didn`t know when I`d get a chance to come to the Dungeon again.\\n\\n Okay, one song! I relented.\\n\\n We thrashed around and giggled like we`d been best friends since childhood. I envisioned what life would have been like for me if Scarlet and Onyx had grown up in Dullsville. We`d have sleepovers during the day, paint our nails by moonlight, and gossip in the graveyard.\\n\\n We rocked so hard, I thought my fake tattoos were going to fall off. The vampire theme was taken to the extreme in the Dungeon. Clubsters writhed together as if drinking in each other`s souls. As lustful guys` lips lay on giddy girls` necks, it was unclear where one clubster began and the other ended.\\n\\n I was intoxicated by the music, the dangerous feel of the club, and my acceptance by Scarlet and Onyx. Then I noticed the time. I really have to go.\\n\\n Already? But we can dance until dawn, Scarlet offered, tossing her luscious thick red curly hair off her shoulder.\\n\\n I can`t. I`m supposed to meet someone.\\n\\n Is he dreamy? Onyx asked.\\n\\n Is he like us? Scarlet prodded.\\n\\n I was too embarrassed to say I was meeting my aunt.\\n\\n I`ll give you my number. Scarlet opened my purse, pulled out my cell, and punched in a ten-digit number. Call whenever you want, except during the day. My parents despise being woken up.\\n\\n She hugged me hard, as did Onyx.\\n\\n I hated to leave. Besides being with Alexander, I was having the best time of my life. I was reluctant to leave my discovery of the Dungeon behind.\\n\\n When I stepped off the dance floor I noticed my boot had come unlaced. I hobbled off to one side, avoiding any clubsters who might trip over my long shoestrings. I had kicked up my boot on a chair and leaned on the archway for support when I sensed someone`s piercing gaze. Buried in the shadows of a small cavelike lounge, I could barely see the silhouette of a person sitting alone. Curious, I inched forward. From a safe distance, I peered through the darkness. A candelabra perched on the table gently illuminated the figure. First I saw motorcycle boots, crossed at the ankle, resting on the dirt floor, then tight black leather pants, like cellophane. I could see the sleeves of his motorcycle jacket, his chain, and his studded arms folded. I stepped a tiny bit closer and leaned into the ray of light. Purple hair flopped over black sunglasses. He seemed to be staring straight at me. It took a moment, but I broke his binding gaze and retreated into the safety of the shadows, or so I hoped.\\n\\n Why was the motorcycle guy checking me out? And sitting alone like he was waiting to hold court?\\n\\n I felt strangely drawn to him. His stare was magnetic.\\n\\n Several rough-looking clubsters approached him--but instead of greeting him like one of the guys by slapping him on the arm or high-fiving him, they all nodded and entered the small chamber, sat down at the table around him, and waited for him to speak.\\n\\n I desperately wanted to hear their secret conversation and get a handle on who or what this biker was all about.\\n\\n He doesn`t have any idea about what vampires truly need, one clubster told the biker.\\n\\n I think it`s time we do something, another said.\\n\\n Before he ruins our plans, a third added.\\n\\n The purple-haired biker leaned in, out of earshot.\\n\\n The cagey guys were listening to him so intently, I could tell they were as entranced as I was. If the biker was these barbaric clubsters` leader, I could only imagine that I`d encountered someone twice as dangerous as Jagger and Valentine.\\n\\n I felt my heart race again throughout my body when I realized my cell phone was vibrating. Aunt Libby again. Everyone, except for the biker, turned and glared at me. But the rock star biker dude remained still. It was as if he knew I had been standing there the whole time. I quickly headed for the archway leading back to the dance floor when all at once someone was standing in front of me, blocking my way.\\n\\n I took a breath and looked up. His purple hair flopped down, seductively, over his Ray- Bans. His stern, hypnotic gaze bore through the dark lenses. There was something powerful about the mysterious stranger. He smelled like Obsession and towered over me in his thick motorcycle boots.\\n\\n How did you get in? he asked in a heavy Romanian accent.\\n\\n Do you own the club?\\n\\n No, but I might. His leather jacket crackled as he folded his arms. I haven`t seen you before. His head lowered and it appeared he was checking out my neck. I suspect you don`t belong.\\n\\n I fiddled with my earring, covering my smooth, bite-free neck with my palm. I felt slightly intimidated by him, but it didn`t prevent me from talking back.\\n\\n How would you know? I challenged.\\n\\n His glasses and hair cast a shadow over his face, making him hard to read. I wasn`t sure if he broke a smile. By his body language, I knew he was serious. It is best that you leave. Membership to our club comes at a very high price. But perhaps I can explain more over a drink.\\n\\n No thanks. I already have a boyfriend.\\n\\n Then he is a very lucky guy, he complimented me. My name is Phoenix Slater, he said, extending his hand and grabbing mine. And you are?\\n\\n Leaving, I said, pulling my hand away.\\n\\n I had made it halfway to the Dungeon door when he slithered his arm around me. Angry, I spun around but wasn`t prepared for who I now confronted. Staring back at me were one metallic green eye and one ice blue eye. Jagger Maxwell.\\n\\n I gasped. It had been a few months since I`d seen Alexander`s nemesis up close and personal.\\n\\n Jagger looked exactly the same--white hair with red tips, as if they`d been dipped in blood. Three silver rings pierced his left ear, and a tattoo on his arm read POSSESS. He was holding the dark hoodie.\\n\\n He closed in on me like a spider to a fly.\\n\\n What are you doing here? I asked, moving back.\\n\\n What are you doing here? he demanded, slithering close.\\n\\n I thought you were in Romania.\\n\\n I thought you were in Alexander`s arms.\\n\\n I came here to see--\\n\\n Yes? He watched my lips intensely, waiting for my response.\\n\\n My aunt.\\n\\n Does your aunt belong to this club? he asked, mocking me. What is she, forty? Fifty? I don`t see anyone dancing with a walker.\\n\\n She`s not here, doofus, I said. She lives in town, but you`d better--\\n\\n I have no interest in your aunt. You, however... He inhaled deeply, as if he were breathing me in, then licked his deadly pale lips. I`m curious why you are here. This club is for members only. But once you join, membership lasts for an eternity. Unless...\\n\\n Unless what?\\n\\n Unless you`ve already joined. Before I had a chance to stop him, he placed his cold hands against my chin and turned my head from one side to the other, inspecting my neck.\\n\\n Let go!\\n\\n I didn`t think so. You really shouldn`t be here. This is not a place for your kind.\\n\\n I don`t have a kind.\\n\\n Too bad. Isn`t this what you`ve always dreamed of? He stared into my eyes and traced the neckline of my dress with his black-tipped fingernail. He licked his lips and flashed his fangs.\\n\\n Phoenix pushed between us. He and Jagger locked eyes before Jagger backed away.\\n\\n Dozens of clubsters gathered around, half on Jagger`s side, the others flanking Phoenix, as if awaiting a deadly fight.\\n\\n I didn`t know which side to choose. Even though I knew Jagger was nefarious, I at least had an idea of who I was dealing with. But as the tension grew between the two, I knew it was best to leave.\\n\\n I escaped and hid behind the black curtain a few yards away. When I caught my breath, I peered inside the slit in the fabric.\\n\\n I wasn`t quite sure what kind of club I`d stumbled into, but I had an idea. Blood-filled drinks, flashing fangs, a club where membership lasts an eternity. There was only one way to be sure.\\n\\n I reached into my purse and pulled out Ruby`s compact. I angled it behind me. I took a deep breath and peered into the reflected glass. I froze. The crowded club and dance floor were empty.\\n\\n I`d just entered the real Coffin Club. \\n\\n","sourceLink":"https://allnovel.net/the-coffin-club-vampire-kisses-5/page-4.html","bookId":2144,"book":{"id":2144,"title":"The Coffin Club (Vampire Kisses #5)","description":"Storyline: The Coffin Club (Vampire Kisses #5) \\n When Raven returns to Hipsterville\u0027s cryptic goth haunt, the Coffin Club, she discovers a secret door to another disco-\"The Dungeon\"-that is inhabited by vampires only. Raven learns that the nefarious Jagger Maxwell has welcomed the vampire clan into the club and has gained the popularity he missed in Romania. He is poised to take over Hipsterville, until a new vampire named Phoenix challenges him for control of the Coffin Club. Unbeknownst to Alexander, Raven becomes caught up in the clash, entranced by the hypnotic vampire culture of the Underworld.\\n","cover":"https://allnovel.net/images/the-coffin-club-vampire-kisses-5.jpg","author":"Ellen Schreiber","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-coffin-club-vampire-kisses-5.html","creation":"Oct 5, 2019 8:58:23 AM","modification":"Oct 5, 2019 6:18:15 PM"}}
