{"id":76144,"no":10,"title":"Page 10","content":"Chessy threw back the drink, swallowing in a big gulp, and then promptly coughed and sputtered. Tate was behind her in an instant, her perfume wafting tantalizingly in his nostrils.\\n\\n The dress she’d chosen to wear was meant to seduce. She’d known, had he showed up for dinner, that he wouldn’t have been able to keep his eyes off her. That he would have hurried them through their dinner so he could take her home and peel that delectable dress off her body and then take over as a Dominant to his submissive.\\n\\n She’d made a lot of plans for their anniversary it would seem. He’d caught a glance of the open master bedroom on his way to the living room and all the equipment he used and had chosen by his own hand was lying neatly on the bed for his perusal. To pick and choose the instruments he would use this night. Until Tate had to f**k it all up by allowing what was supposed to be a very special night for his girl go completely down the drain. How the hell would he make this up to her?\\n\\n When she heaved and coughed again, her eyes, already watering, kept watering as she tried to correct which pipe her drink had gone down.\\n\\n Tate instantly began patting her back and then rubbing smooth circles around her back, massaging. “You okay, Chessy? What the hell were you drinking anyway?”\\n\\n She shrugged. “I just grabbed the first bottle I saw and went with it.”\\n\\n Tate reached around her and grabbed the bottle at the very front where she’d carelessly shoved it back in.\\n\\n “Jesus, Chessy, you don’t need to hit the hard stuff in order to talk to me. Remember me? Your husband, but more than that, your best friend? When have you ever had to ply yourself with alcohol just to talk to me? Is it so bad?”\\n\\n She burped and then covered her mouth. It amused Tate though. Chessy was the epitome of polite and discreet. She would have been mortified to ever burp in a public place. He just thought they were cute. Little “Chess burps” he called them since they weren’t a complete blowing-out-the-windows kind.\\n\\n “Because what I have to say isn’t good,” she said in a tone that told him the healthy dose of alcohol was already working its way down her body and loosening her tongue. Or at least he hoped so. But at the same time, what she said registered with him and froze his insides. Completely paralyzed him and his tongue seemed dry and swollen, impacting his ability to even speak.\\n\\n Because what I have to say isn’t good.\\n\\n The words rang in his ears, like a continuous video feed endlessly cycling, repeating itself until he nearly shook his head to make it stop.\\n\\n “Come and sit down on the sofa with me, Chessy. You don’t need to be standing and pacing after downing that alcohol. We can work this out, baby. You have to know I love my girl more than anything in the world. Whatever it is, I swear we can work it out.”\\n\\n His impassioned words seem to hit her, and she stood, absorbing them. He could see the wheels turning in her mind, the uncertainty in her eyes, and worse, doubt. Doubt clouded her beautiful eyes, and that hurt him because he was used to her having complete faith in him. In their marriage and relationship.\\n\\n This was new territory for Tate and he didn’t like it one bit. In all other aspects of his life, he was decisive, take charge, take no prisoners. And until tonight, he would have believed that he was still Chessy’s Dominant and that he was taking care of her needs.\\n\\n “Chessy?” he prompted softly, reaching to touch her arm.\\n\\n She flinched and visibly recoiled and he swore under his breath. When had she gotten to the point of not being able to bear his touch? Was he hurting her so badly that she couldn’t be in the same room with him?\\n\\n She turned, wobbling unsteadily as she headed for the sofa. He wouldn’t even allow himself relief over that small victory because he knew he still had a veritable mountain to climb once they settled onto the sofa and Chessy poured her heart out.\\n\\n If she would.\\n\\n She sank onto the couch, her entire body sagging as a weary look entered her eyes. She looked defeated.\\n\\n He went to her, sitting beside her. It killed him to maintain any distance but he was afraid of her rejection if he so much as touched her.\\n\\n “Talk to me, baby,” he encouraged softly. “Please. Give me a chance to fix this.”\\n\\n Her eyes watered and tears gathered rapidly as she finally turned her gaze to meet his.\\n\\n “I’m not sure it can be fixed,” she said, her voice choked with emotion. “I used to think it could be. I was certain everything would be all right. I told myself to just be patient. Let things ride out and everything would go back to normal when you were secure in your business. But I’m tired of waiting, Tate. I’m tired of faking a smile and saying ‘it’s okay’ every time you have to dump me for a client when I’m bleeding on the inside. I’ve pretended for so long that it’s become second nature and I can’t do it anymore. I just can’t.”\\n\\n The utter despair in her voice flayed open his heart. He caught his breath, unsure of even what to say to her. This wasn’t a simple fix. Not something that could be worked out in one night or even two. Their relationship was in deep trouble, and he was only just now recognizing the magnitude of all he’d done to her over the past years.\\n\\n “My friends look at me with pity,” she continued on, her gaze falling away from his.\\n\\n She stared forward, so much pain in her features that it was a physical hurt for him to witness.\\n\\n “They know I’m terrible at faking happiness. They see through me and they know I’m unhappy. They know the situation with you is bad. Even Dash and Jensen are giving me pep talks, for God’s sake. It’s humiliating. And I don’t know how to fix it. Now I don’t even know if I can.” \\n\\n","sourceLink":"https://allnovel.net/taking-it-all-surrender-trilogy-3/page-10.html","bookId":1781,"book":{"id":1781,"title":"Taking It All (Surrender Trilogy #3)","description":"Storyline: Chessy and Tate have been married for several years. In the beginning, their relationship was everything she wanted. Passionate. All consuming. She offered her submission freely and Tate cherished her gift with a tenderness that made her feel safe. Content. Wanted. And loved beyond all measure. But as the years have gone by, Tate has become more immersed in making his business the success it has become, and Chessy has taken a back seat to his business obligations. Growing unhappier with the status of their once blissful marriage, Chessy knows that something has to give. Or they stand to lose it all \\n Tate loves his wife. Has always loved her. Providing for her has always been his number one priority. But lately she’s seemed unhappy, and he’s worried. Worried enough that he arranges for a night together that he hopes will reignite the fire that once burned like an inferno between them. \\n But a business call at the wrong time threatens everything. Chessy’s safety, his concentration, his wife’s faith in him as her husband, a man sworn to love and protect her above all else. Gutted with the realization that he’s going to lose her—has already lost her—he readies for the fight of his life. Whatever it takes, he’ll get her back. And prove to her that nothing is more important than her love. And that if she’ll allow him to prove himself one more time, he’ll take it all. Everything. But he’ll give far more back. Himself. His undying love.\\n","cover":"https://allnovel.net/images/taking-it-all-surrender-trilogy-3.jpg","author":"Maya banks","type":"Romance","source":"allnovel","link":"https://allnovel.net/taking-it-all-surrender-trilogy-3.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:36:45 AM"}}
