{"id":76157,"no":23,"title":"Page 23","content":"“I just wanted to know where you planned for us to have dinner tonight,” she said in a low voice. “I don’t … I don’t want to go back to where we were supposed to have dinner last night. I don’t think I could handle it. There was a lot of humiliation in last night for me. I don’t want to even remember it. I’d rather just go somewhere else and truly start over again.”\n The look of love, understanding and self-recrimination all crowding into his eyes made her emotional and she had to swallow hard at the knot forming in her throat.\n He leaned forward and pressed his lips to her forehead and left them there a long moment. When he pulled away, he framed her face in his hands and stared her directly in the eyes.\n “I’d never do that to you, my girl. I thought we’d go to a place we’ve never been before. I’ve heard good things about it. I’ve already made a reservation. I placed one online before I got you up this morning. I want a fresh start too. It’ll be a new beginning all the way around.”\n Relief and love coursed through her veins. To her dismay, a tear rolled down her cheek and collided with one of his hands. Damn it but she’d been determined not to cry. She’d done entirely too much of that the night before. As it was, it was going to take her best makeup job to disguise the shadows under her eyes before they went out to dinner. And she wanted to look her best for Tate tonight. Just as they wouldn’t be eating in the same restaurant, neither would she wear the same outfit she’d worn the night before.\n But Tate seemed to understand that she wasn’t upset. His expression grew even more tender and he leaned in and kissed away the path of the single tear that had trickled onto his hand.\n “I love you, Chess. Please don’t ever forget that.”\n “I love you too,” she whispered. “Now shoo so I can finish getting ready. How much time do I have?”\n He checked his watch and then helped her to her feet, patting her lightly on the behind. “Forty-five minutes before we need to leave, so get a move on, baby. I’ll go get dressed and meet you in the living room.”\n She sent him a brilliant smile, one she could feel in the tightening of her cheeks, and she was rewarded by an answering smile from him that took her breath away. There was so much promise in that smile that she was besieged by a surge of giddiness. She all but skipped to her closet to pick out what she would wear. Her hair still needed to be blown dry, but she’d save that for after her wardrobe had been selected and then she’d do hair and makeup before dressing.\n TEN\n TATE gazed at Chessy’s bright smile as they sat in a corner table of the new steakhouse in the same suburb of Houston they lived in. It was a mere five-minute drive from their house, and while they were certainly acquainted with most of the restaurants in the fast-developing Woodlands, this was a place that had just opened a few months before and already promised success judging by the number of people in the spacious interior.\n Some of the awful weight that had pressed on his heart had eased and he was feeling optimistic about his and Chessy’s future. How could he not rededicate himself to this beautiful woman and vow to put her first before all else? It was no less than she deserved and he’d made her a promise five years ago when she’d given him her heart—and her submission—to cherish those gifts absolutely.\n That he’d failed was a burden he’d carry with him to the grave, but it wasn’t too late. There were no lengths he wouldn’t go to in order to secure her love and faith once more.\n He gazed at her shining eyes and his mind drifted, an image of her bound in a position of utter submission, the hands of another man caressing her under Tate’s watchful eye. Another man commanding her, via Tate’s command, preparing her for Tate’s possession.\n It was a kink they both enjoyed, had made it a point to participate in at The House on a regular basis before Tate got so involved with his business. Then The House and the activities had fallen by the wayside, something Tate intended to correct soon.\n But first he had to cement his recommitment to her. Ensure that she knew in her heart she was first in his heart. And then he’d plan a night of utter decadence. All focused on Chessy and her pleasure. It would be a gift to her. His gift.\n “Oh no,” Chessy whispered, her eyes suddenly stricken.\n Her words and expression yanked Tate from his erotic reverie and he frowned as he took in her obvious distress.\n “What’s wrong?” he demanded, looking around to see what could have caused her to be upset.\n “Kylie and Joss must be so worried,” Chessy said anxiously. “They knew all about our anniversary plans and I was supposed to call them this morning to check in. I completely forgot about it.”\n Tate smiled, though he could feel the tightness in his features. Yes, Joss and Kylie were Chessy’s best friends, and as such, he supposed they shared everything. Too much for Tate’s liking. It was obvious that not only his wife’s closest friends had been scrutinizing his marriage but also Dash and Jensen. A fact that didn’t sit well with Tate. He was a very private person and the idea of his personal life being the topic of conversation, not to mention judgment, of others dug under his skin.\n But in this case the truth hurt and if he wasn’t so guilty of neglecting his wife then the scrutiny of others wouldn’t hit so close to home with him. It was a cross he had to bear. But he’d be damned if he hung his head when in the company of Chessy’s friends. His friends. They weren’t just his wife’s friends. Hell, he’d inserted himself into Dash’s relationship with Joss when Dash had nearly blown everything all to hell. Tate had been furious with Dash, rightfully so, but the hypocrisy that was so evident was appalling.\n","sourceLink":"https://allnovel.net/taking-it-all-surrender-trilogy-3/page-23.html","bookId":1781,"book":{"id":1781,"title":"Taking It All (Surrender Trilogy #3)","description":"Storyline: \n Chessy and Tate have been married for several years. In the beginning, their relationship was everything she wanted. Passionate. All consuming. She offered her submission freely and Tate cherished her gift with a tenderness that made her feel safe. Content. Wanted. And loved beyond all measure. But as the years have gone by, Tate has become more immersed in making his business the success it has become, and Chessy has taken a back seat to his business obligations. Growing unhappier with the status of their once blissful marriage, Chessy knows that something has to give. Or they stand to lose it all \n Tate loves his wife. Has always loved her. Providing for her has always been his number one priority. But lately she’s seemed unhappy, and he’s worried. Worried enough that he arranges for a night together that he hopes will reignite the fire that once burned like an inferno between them. \n But a business call at the wrong time threatens everything. Chessy’s safety, his concentration, his wife’s faith in him as her husband, a man sworn to love and protect her above all else. Gutted with the realization that he’s going to lose her—has already lost her—he readies for the fight of his life. Whatever it takes, he’ll get her back. And prove to her that nothing is more important than her love. And that if she’ll allow him to prove himself one more time, he’ll take it all. Everything. But he’ll give far more back. Himself. His undying love.\n \n","cover":"https://allnovel.net/images/taking-it-all-surrender-trilogy-3.jpg","author":"Maya banks","type":"Romance","source":"allnovel","link":"https://allnovel.net/taking-it-all-surrender-trilogy-3.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:36:45 AM"}}
