{"id":76160,"no":26,"title":"Page 26","content":"His mouth pressed against the shell of her ear and he nuzzled softly, grazing his teeth lightly over the delicate skin and then sucking at the tiny lobe.\n She shivered and he grew harder, his erection straining at the pants he still wore. It was a scenario they’d enacted before. He, the Dominant, asking his submissive how to please her. Yes, he was in absolute control, but in essence he was hers, his pleasure hers, his desire whatever she desired.\n “My hands … behind my back,” she whispered, her eyes closing when he traced the edge of her ear with his tongue. Her breath hitched and he smiled as he drew away just enough to take in every facet of her expression.\n “Me on my hands and knees … you behind me,” she continued in a shy, faltering voice.\n He loved that even as uninhibited as she was in bed, she was still adorably shy when expressing her fantasies. It was the perfect blend of good girl meets bad and a glimpse of her inner vixen who came out to play during intimacy.\n “You taking me hard,” she said breathlessly. “Not stopping even if I beg you for mercy. Refusing when I say no. Your hand twisting in my hair, pulling as you thrust into me. You demanding me to remain still and to take whatever you give me.”\n His own eyes closed. He took long, measured breaths to still his racing pulse. All the blood in his body pooled painfully in his groin, his dick so hard that it had reached the point of pain. He couldn’t move for the material of his underwear abrading the sensitive head of his penis. Already there was a bead of moisture coating the tip. He was imagining being balls deep inside her, plunging and straining even harder to go deeper. Him holding her in place to meet his thrusts, his hand, as she’d whispered, tangled in her hair, forcing her to take whatever he dished out.\n It was one of the many roles they played during sex. Their love life was wide open and wonderfully diverse. If it could be imagined, they enjoyed it. He knew how damn lucky he was to have such a wonderfully responsive lover. Wife. Best friend. It was cliché but, in his case, so very true.\n “I like the way my girl thinks,” he said in a husky, passion-laced voice.\n “Think my man is up to giving his girl what she wants?” she asked with a teasing glint to her eyes.\n He tipped her chin up with one fingertip and brushed his mouth over hers. “I think I can manage. It’s a hardship but I can swing the sacrifice.”\n “Good,” she whispered against his lips. Then she slid her hand up the inside of his thigh to cup his bulging erection. “I’d hate for this perfectly good hard-on to go to waste.”\n ELEVEN\n CHESSY ran her fingers lightly over Tate’s erection and then grew bolder in her caresses. Her husband was very well endowed. Not enough to make the logistics impossible but certainly enough for her to never complain in that department. Too much, and a girl had major appendage issues. Too little? And it was inevitable disappointment.\n She liked her man just as he was and had no complaints about his prowess in bed or in domination. She was positively giddy with anticipation over Tate taking control back. Reasserting his dominance and his mastery over her body. Nobody knew her better than Tate. Though she hadn’t had many lovers before meeting Tate, she’d had enough to know perfection when she found it. At the time, being young and hopelessly naïve, she’d lamented the fact that Tate hadn’t been her first. She’d had this ridiculous romantic notion of gifting him not only with her submission but her virginity as well. Now she was glad he hadn’t been her first because there was no doubt in her mind that he was miles above any of the other men she’d been with.\n She was also secretly, and not so secretly, smug and delighted that Tate had admitted he’d never had a woman—a submissive—who was so perfectly suited for him. They were just meant to be, as corny as it sounded to say it aloud. But nothing about her relationship and ensuing marriage caused her any embarrassment. She was proud of who and what she was with him. He’d never given her any reason to feel shame for her desires and she loved him deeply for that. For always praising her boldness when it came to embracing her needs and desires.\n “Baby, you’re killing me,” he groaned. “And I want to give you everything you want tonight. It will be my honor—and privilege—to give you whatever you need from me. My love. My control. Whatever makes you feel safe and cherished.”\n The words coming from him hit the very heart of her. A part of her soul that had been long denied. Emotion clogged her throat, making it impossible to breathe around the growing knot. Tears burned her eyelids but she furiously blinked them back, determined not to give him any misapprehension about her willingness—and desire—to see the night through in absolute decadence and splendor.\n “I do feel safe and cherished with you, Tate. Please don’t hold back with me. I’m not fragile. I won’t break. I need you. I need us. Like we were. I need things to go back to normal. I want your control back, that feeling of absolute safety and security I feel when I’m with you.”\n He cupped her face in his hands and kissed her again, long and lingering this time, his mouth utterly possessive. As though they’d never drifted apart and were taking up right where they left off before he became so distant to her.\n He reached down and took both her hands in his, gently pulling her to stand before him.\n “Then go to the bed. Belly down, arms stretched toward the headboard and feet on the floor at the end. Get as comfortable as possible while I get the rope to bind you.” \n","sourceLink":"https://allnovel.net/taking-it-all-surrender-trilogy-3/page-26.html","bookId":1781,"book":{"id":1781,"title":"Taking It All (Surrender Trilogy #3)","description":"Storyline: \n Chessy and Tate have been married for several years. In the beginning, their relationship was everything she wanted. Passionate. All consuming. She offered her submission freely and Tate cherished her gift with a tenderness that made her feel safe. Content. Wanted. And loved beyond all measure. But as the years have gone by, Tate has become more immersed in making his business the success it has become, and Chessy has taken a back seat to his business obligations. Growing unhappier with the status of their once blissful marriage, Chessy knows that something has to give. Or they stand to lose it all \n Tate loves his wife. Has always loved her. Providing for her has always been his number one priority. But lately she’s seemed unhappy, and he’s worried. Worried enough that he arranges for a night together that he hopes will reignite the fire that once burned like an inferno between them. \n But a business call at the wrong time threatens everything. Chessy’s safety, his concentration, his wife’s faith in him as her husband, a man sworn to love and protect her above all else. Gutted with the realization that he’s going to lose her—has already lost her—he readies for the fight of his life. Whatever it takes, he’ll get her back. And prove to her that nothing is more important than her love. And that if she’ll allow him to prove himself one more time, he’ll take it all. Everything. But he’ll give far more back. Himself. His undying love.\n \n","cover":"https://allnovel.net/images/taking-it-all-surrender-trilogy-3.jpg","author":"Maya banks","type":"Romance","source":"allnovel","link":"https://allnovel.net/taking-it-all-surrender-trilogy-3.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:36:45 AM"}}
