{"id":76171,"no":37,"title":"Page 37","content":"“Oh yes,” Chessy said with a radiant smile. “Tate is very aware of what I like, what gives me pleasure. But he likes to surprise me. He never tells me beforehand what to expect. Me not knowing heightens the anticipation. Sometimes the man will bind me to cross bars, arms and legs spread wide. He’ll flog me or use leather. Other times he’ll secure me over a spanking bench and after the man has ‘sufficiently prepared’ me, Tate will take over and f**k me while my skin is still heated from the kiss of the whip.” She could feel the blush working its way up her neck at the blunt way she’d described the scene.\\n\\n Kylie sent a suspicious glance Joss’s way. “You don’t seem the least bit shocked or appalled. Just what have you and Dash been up to anyway?”\\n\\n “Oh, much the same,” Joss said cheerfully. “Only without the other guy, and well, not since we learned I was pregnant.”\\n\\n Kylie shook her head. “Clearly I’m the boring one in this group.”\\n\\n Chessy smiled mischievously. “Oh, I don’t know. Tying a guy to your bed can’t exactly be considered boring.”\\n\\n “Y’all are never going to let go of that, are you?” Kylie asked with an exasperated sigh.\\n\\n “Nope!” Joss said, a huge grin on her face.\\n\\n “I think y’all are the ones who need therapy,” Kylie grumbled. “I’m looking more ‘normal’ all the time.”\\n\\n Joss checked her watch and then glanced up at the others in chagrin. “Sorry to eat and run but I have to leave if I’m going to make my OB appointment.”\\n\\n Chessy made a shooing motion with her hand. “You go on. Lunch is on me today.”\\n\\n Joss paused on her way up from the table and pinned Chessy with a pointed stare. “Kylie and I will expect all the juicy details Saturday, and if we don’t hear from you, we’re totally coming over.”\\n\\n FIFTEEN\\n\\n CHESSY’S phone rang, Tate’s ring tone, and she answered quickly. It was around the time Tate usually got off of work and she hoped he wasn’t calling to say he would be late.\\n\\n “Hello?”\\n\\n Tate’s voice was gruff and laced with thick desire.\\n\\n “I want you naked and kneeling in the living room when I get home.”\\n\\n Her pulse fluttered and sped up, leaving her breathless and nearly unable to respond.\\n\\n “I’ll be waiting,” she whispered.\\n\\n “Love my girl.”\\n\\n “I love you too.”\\n\\n “See you in ten minutes,” he said.\\n\\n Chessy ended the call and then ran for the bathroom, knowing she didn’t have much time. She brushed out her hair as much as she was able. The humidity was particularly high today and the result was her hair being much curlier and less manageable than usual. But then, Tate loved her curls.\\n\\n She checked her appearance with a critical eye, wanting to look her best. She applied light lip gloss, though it was silly considering it would most certainly be wiped off within minutes of Tate’s arrival.\\n\\n She stripped out of her clothing, tossing it in the laundry basket in the bathroom, and then she hurried back to the living room and settled into a kneeling position on the soft rug in front of the fireplace.\\n\\n The wait seemed interminable, but then finally she heard the sound of Tate’s car pulling up to the house. Her breath caught in her throat and she expelled it in long, shaky breaths.\\n\\n With their visit to The House coming up the next day, she wondered what Tate had planned for tonight.\\n\\n The front door opened and then Tate appeared in the living room, his suit coat over one arm, briefcase in the other.\\n\\n His look of intense appreciation gave her a heady thrill. His eyes glowed with open lust. The fact that after so many years of marriage he still looked at her with the same desire he had when they first married gave her fierce satisfaction. But Tate wanting her had never been the issue.\\n\\n He slowly laid his things down on the couch and immediately loosened his tie, but held on to it instead of discarding it with the other stuff.\\n\\n His walk toward her was slow and leisurely as if he were taking in every bit of the moment. When he finally got within touching distance, his hand gently threaded through her hair and then he roughly pulled her head back and his mouth crashed down over hers, feeding hungrily from her lips.\\n\\n “Consider tonight a preview of what’s to come at The House,” he murmured.\\n\\n Her blood surged and her ni**les beaded into tight knots.\\n\\n “Just be warned, I plan to work you hard,” he said. “Remember your safe word.”\\n\\n “I remember,” she whispered.\\n\\n He pulled her arms behind her back, her still in a kneeling position, and he tied her wrists together with his tie. Then he walked around to the front of her and hastily unzipped his pants, pulling his c**k free without removing his clothing.\\n\\n “Open,” he commanded.\\n\\n He shoved his hand into her hair and angled her head back as he grasped his c**k with his free hand. She instantly obeyed, opening her lips just as he thrust fully into her mouth. He was rough and she reveled in it. She wanted to sigh her satisfaction that they were returning to the roots of their relationship. Finally.\\n\\n “Let’s see how much you can take,” he said gruffly.\\n\\n He began to thrust hard, hitting the back of her throat with the broad head of his cock. Her cheeks puffed outward and she inhaled sharply through her nose to keep up. But she was determined she would endure whatever he chose to do.\\n\\n “Very nice,” he complimented as he continued to push himself as far as he could go. \\n\\n","sourceLink":"https://allnovel.net/taking-it-all-surrender-trilogy-3/page-37.html","bookId":1781,"book":{"id":1781,"title":"Taking It All (Surrender Trilogy #3)","description":"Storyline: Chessy and Tate have been married for several years. In the beginning, their relationship was everything she wanted. Passionate. All consuming. She offered her submission freely and Tate cherished her gift with a tenderness that made her feel safe. Content. Wanted. And loved beyond all measure. But as the years have gone by, Tate has become more immersed in making his business the success it has become, and Chessy has taken a back seat to his business obligations. Growing unhappier with the status of their once blissful marriage, Chessy knows that something has to give. Or they stand to lose it all \\n Tate loves his wife. Has always loved her. Providing for her has always been his number one priority. But lately she’s seemed unhappy, and he’s worried. Worried enough that he arranges for a night together that he hopes will reignite the fire that once burned like an inferno between them. \\n But a business call at the wrong time threatens everything. Chessy’s safety, his concentration, his wife’s faith in him as her husband, a man sworn to love and protect her above all else. Gutted with the realization that he’s going to lose her—has already lost her—he readies for the fight of his life. Whatever it takes, he’ll get her back. And prove to her that nothing is more important than her love. And that if she’ll allow him to prove himself one more time, he’ll take it all. Everything. But he’ll give far more back. Himself. His undying love.\\n","cover":"https://allnovel.net/images/taking-it-all-surrender-trilogy-3.jpg","author":"Maya banks","type":"Romance","source":"allnovel","link":"https://allnovel.net/taking-it-all-surrender-trilogy-3.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:36:45 AM"}}
