{"id":76197,"no":63,"title":"Page 63","content":"Tate’s blood ran cold and he was seized by paralyzing fear. But he had to keep calm. He couldn’t afford to do or say the wrong thing and drive her away for good.\n “I know we have a lot to work out, but I’m willing to try. Are you?”\n She bit into her bottom lip nervously, her eyes cloudy with uncertainty. “I don’t know,” she admitted. “This whole thing has thrown me for a loop. I don’t know what the right decision is. I just know I can’t continue on like it was before. Our child deserves better. I deserve better.”\n “Yes, you do deserve better than I’ve given you,” Tate said, not even bothering to hide the truth in her statement. “And I’m committed to giving you better. One hundred and ten percent of me from now on. But I can’t do that if we’re apart. I need you here. Where I can take care of you and our baby. You aren’t happy. I’m not happy. What do we have to lose by trying?”\n “I can’t make that decision in a split second,” she murmured. “I need time, Tate. I need time to think. To process this all. I only just found out about my pregnancy. I haven’t had time to figure out what’s best for our child or for me. Much less us.”\n And yet she’d come to him at her first opportunity. She hadn’t tried to hide the fact that she was pregnant. That gave him hope that all wasn’t lost. She’d trusted him enough to confide in him. But then she was inherently honest. Hiding anything wasn’t in her nature. It was one of the things he loved most about her. She wasn’t adept in disguising her emotions, her moods. He knew them all.\n He wanted her back before he knew about their child, but did she realize that? Surely she did. He’d certainly not made it a secret in his relentless pursuit of her over the last weeks. But he had no way of knowing how or what she was thinking. It was new and frustrating for him. He’d always been able to count on her predictability. A quality some men might not find attractive, but for Tate, always knowing just where he stood with Chessy and knowing she always stood with him had been a source of great comfort. But it had also been his greatest downfall because he’d grown too complacent, too confident in the fact that she was with him through thick and thin.\n Never would he take her for granted again, but he had to find a way to convince her of that. Words were just words and they no longer held any power with her.\n “I’ll give you time,” he conceded. “But please don’t shut me out, Chess. Allow me to see you and our baby. Let me go to the doctor with you. I won’t pressure you and I won’t demand anything you’re unwilling to give me. But give me a chance to show you that I’ve truly changed, starting with the announcement of my partnership tomorrow. I’d like us to start over. Whatever I have to do to regain your trust I’ll do.”\n “You want to date?” she asked skeptically.\n “I want us to see each other,” he corrected. “I’d rather not live apart while we’re doing it, but if you need time and space, I’ll give it to you. But I want to see you, which means coming over, going out to dinner, you coming here so I can cook dinner for you like tonight. I’d like to go to your first obstetrician appointment and be included in your prenatal care. I want to talk about baby names and pick out baby furniture and clothing.”\n Her expression softened and his pulse sped up. She was caving. He could see it. But it was a hollow victory at best because he still didn’t have what he most wanted. Her back in his life, his house, his bed. But he had to believe that in time those things would come. The alternative didn’t bear thinking about.\n “I’ll consider everything you’ve said,” Chessy finally said. “I should be going now. Kylie and Jensen are going to be worried. They didn’t want me to come alone.”\n Tate’s expression darkened. “Do they think I’m some ogre who’s going to abuse you?”\n “No,” Chessy said softly. “But they’re afraid you’ll hurt me. Emotionally. And I’m not in a good place right now. As I said before the whole reason I went to the doctor was to ask for medication for anxiety and depression. Instead I found out I’m pregnant. I’m scared. More scared than I’ve ever been in my life. This isn’t easy for me, Tate. I’m not used to questioning my every decision, but I’ve continued to make bad ones. I can’t afford to do that now that I have a child to consider.”\n Tate closed his eyes, the ache in his heart making his chest hurt. “I wish you wouldn’t go. I’d like you to stay so we can talk. About the baby. Our future.”\n “It hasn’t been decided yet if we have a future,” she pointed out. “I’m open to seeing you. On my terms, not yours. But ultimately the decision resides with me and I expect you to respect that.”\n He bit his tongue against the urge to argue. To try and wear her down. Only her complete look of fragility and fatigue halted him. The last thing she needed was more stress piled on top of her.\n Patience. This was going to require patience, a trait he was very unfamiliar with. He’d never had to wait on anything in his life. When he’d met Chessy, he’d immediately known she was the one, and he’d pursued her and won her in short order.\n And now he’d lost her.\n “When can I see you then?” he asked bluntly.\n “I’ll call you,” she said.\n He made a sound of impatience. If he waited for her to call he may well wait forever.\n","sourceLink":"https://allnovel.net/taking-it-all-surrender-trilogy-3/page-63.html","bookId":1781,"book":{"id":1781,"title":"Taking It All (Surrender Trilogy #3)","description":"Storyline: \n Chessy and Tate have been married for several years. In the beginning, their relationship was everything she wanted. Passionate. All consuming. She offered her submission freely and Tate cherished her gift with a tenderness that made her feel safe. Content. Wanted. And loved beyond all measure. But as the years have gone by, Tate has become more immersed in making his business the success it has become, and Chessy has taken a back seat to his business obligations. Growing unhappier with the status of their once blissful marriage, Chessy knows that something has to give. Or they stand to lose it all \n Tate loves his wife. Has always loved her. Providing for her has always been his number one priority. But lately she’s seemed unhappy, and he’s worried. Worried enough that he arranges for a night together that he hopes will reignite the fire that once burned like an inferno between them. \n But a business call at the wrong time threatens everything. Chessy’s safety, his concentration, his wife’s faith in him as her husband, a man sworn to love and protect her above all else. Gutted with the realization that he’s going to lose her—has already lost her—he readies for the fight of his life. Whatever it takes, he’ll get her back. And prove to her that nothing is more important than her love. And that if she’ll allow him to prove himself one more time, he’ll take it all. Everything. But he’ll give far more back. Himself. His undying love.\n \n","cover":"https://allnovel.net/images/taking-it-all-surrender-trilogy-3.jpg","author":"Maya banks","type":"Romance","source":"allnovel","link":"https://allnovel.net/taking-it-all-surrender-trilogy-3.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:36:45 AM"}}
