{"id":76208,"no":74,"title":"Page 74","content":"And she did believe Tate. All the doubts of the past, all the betrayals and disappointment melted away, leaving love and trust in their wake.\\n\\n EPILOGUE\\n\\n KYLIE decided to wait until after Joss’s and Chessy’s babies were born before she and Jensen married. Joss and Chessy had complained that they could hardly be bridesmaids when they were big as a house. Jensen wasn’t happy with the delay. He wanted Kylie to be legally his as soon as possible and he didn’t care if they had an actual wedding or not. He’d threatened to kidnap Kylie and elope to Vegas but in the end he caved when Kylie told him how important it was that she be surrounded by her “family” on their special day.\\n\\n Joss gave birth to an eight-pound, nine-ounce baby boy. They named him Carson, in recognition of Joss’s first husband and Dash’s best friend.\\n\\n Not long after, Chessy delivered a seven-pound, two-ounce baby girl. She smugly told Tate that she’d been right all along and that she knew she was having a daughter. Tate had coddled her the entire time. He’d taken her home from the hospital on that horrible day when she’d feared the worst. Her arm had indeed been broken and she’d worn a cast for two months. Tate hadn’t allowed her to so much as lift a finger, and also true to his word, he’d spent much more time away from work and with her.\\n\\n When the cast had been removed, and with her having an adorable baby bump, he’d taken her away for an entire week where they’d done nothing more than lounge on a beach and make love in the hotel room. It had been utter perfection.\\n\\n Two months after Chessy gave birth, Kylie’s wedding day arrived. The weather was perfect, heralding a magnificent day.\\n\\n “You look beautiful,” Tate said as he watched Chessy put the finishing touches on her makeup.\\n\\n The bridesmaid dress was gorgeous and to Chessy’s delight she was actually able to fit into the same size she’d worn before her pregnancy. The only problem was that her boobs were huge. Tate wasn’t complaining about that at all.\\n\\n “You don’t look so shabby yourself,” Chessy said, admiring the black tuxedo he’d donned in order to be one of Jensen’s attendants.\\n\\n Tate picked up Caroline and when she started to fuss, he reached for her pacifier. Once inserted, Caroline sucked contentedly and immediately settled into sleep in her father’s arms.\\n\\n It had been decided that Joss and Chessy would carry their babies with them down the aisle to stand for Kylie at her ceremony. Chessy just hoped that neither child started fussing through the service.\\n\\n She needn’t have worried. The babies were perfectly content in their mothers’ arms. Joss and Chessy watched Kylie and Jensen pledge their love and the start of their lives together as man and wife and they both started crying.\\n\\n Tate heaved an exasperated sigh and handed over a handkerchief to Chessy.\\n\\n “And to think we were worried about the babies crying,” Dash muttered.\\n\\n Rings were exchanged and then the minister pronounced them man and wife. Jensen pulled Kylie into a scorching kiss that made Chessy blush. Tate didn’t know it yet, but tonight was the night she planned to tell him her doctor had told her she was perfectly able to resume sexual activity.\\n\\n To everyone’s surprise—and delight—Jensen swept Kylie into his arms and carried her down the aisle instead of the traditional side-by-side walk down the aisle after being pronounced man and wife.\\n\\n The others hurried after them and caught up to them in the vestibule of the church.\\n\\n Kylie hugged Joss and then Chessy. “Thank you for being here,” she whispered. “It made my wedding so much more special to have the people I love the most around me.”\\n\\n “I wouldn’t have missed it for the world,” Chessy said. “We love you, Kylie. And I’m so glad you’re happy. You deserve happiness and I think Jensen is perfect for you. I wish for you a long life of love and happiness.”\\n\\n Tears glistened in Kylie’s eyes. “I don’t know what I’d do without you and Joss. I love you both.”\\n\\n “I think Jensen is getting a wee bit impatient,” Joss murmured. “He’s ready to take you on your honeymoon!”\\n\\n Kylie blushed but turned only to be swept into her husband’s arms—again. He carried her to the waiting limo and put her inside. Then he turned with a grin and waved at his group of friends.\\n\\n “Thank you all for making this so special for Kylie. I know she won’t forget this day and neither will I.”\\n\\n They all waved as Jensen got into the limo with Kylie, and as they drove away, Tate reached for Caroline and nestled her on his chest so her head rested on his shoulder.\\n\\n Chessy leaned in close so no one could hear her as she whispered to her husband.\\n\\n “My OB gave me the green light to resume sexual relations,” she murmured.\\n\\n Fire blazed in Tate’s eyes, desire and lust brimming. He gave her a predatory look and then glanced ruefully down at their baby.\\n\\n “I’m going to set a record in getting her down for the night. And then you and I are going to be up a very long time. I may just have to call out of work tomorrow.”\\n\\n Chessy laughed, the sound joyous and carefree. Everything was simply … perfect. She had her husband back, Kylie was happily married and Joss and Dash were new parents. Everyone was … happy. What more could she ask for? \\n\\n","sourceLink":"https://allnovel.net/taking-it-all-surrender-trilogy-3/page-74.html","bookId":1781,"book":{"id":1781,"title":"Taking It All (Surrender Trilogy #3)","description":"Storyline: Chessy and Tate have been married for several years. In the beginning, their relationship was everything she wanted. Passionate. All consuming. She offered her submission freely and Tate cherished her gift with a tenderness that made her feel safe. Content. Wanted. And loved beyond all measure. But as the years have gone by, Tate has become more immersed in making his business the success it has become, and Chessy has taken a back seat to his business obligations. Growing unhappier with the status of their once blissful marriage, Chessy knows that something has to give. Or they stand to lose it all \\n Tate loves his wife. Has always loved her. Providing for her has always been his number one priority. But lately she’s seemed unhappy, and he’s worried. Worried enough that he arranges for a night together that he hopes will reignite the fire that once burned like an inferno between them. \\n But a business call at the wrong time threatens everything. Chessy’s safety, his concentration, his wife’s faith in him as her husband, a man sworn to love and protect her above all else. Gutted with the realization that he’s going to lose her—has already lost her—he readies for the fight of his life. Whatever it takes, he’ll get her back. And prove to her that nothing is more important than her love. And that if she’ll allow him to prove himself one more time, he’ll take it all. Everything. But he’ll give far more back. Himself. His undying love.\\n","cover":"https://allnovel.net/images/taking-it-all-surrender-trilogy-3.jpg","author":"Maya banks","type":"Romance","source":"allnovel","link":"https://allnovel.net/taking-it-all-surrender-trilogy-3.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:36:45 AM"}}
