{"id":46505,"no":1188,"title":"Chapter 1186: Fury!","content":"“Everyone in the River-Defying Sect has been arrested!!” “A huge spell formation has been set up outside Vile-Emperor City!!” “They’re going to extract the blood of tens of thousands of cultivators from the Heavenspan Realm!!” Each message from Big Fatty Zhang was like a dagger stabbing into Bai Xiaochun’s heart! Patriarch Spirit Stream, Li Qinghou, and other compatriots from the River-Defying Sect, as well as cultivators from other parts of the Heavenspan Realm, were now trapped in a spell formation outside the city! Big Fatty Zhang didn’t just sound anxious in his messages, he also sounded angry. Bai Xiaochun could only imagine what level of despair he currently felt. Panting, and heart pounding painfully, he rose to his feet, his eyes completely bloodshot as he let out a howl of anguish! Pain wracked him both physically and mentally! Madness gripped him, from his mind down to his soul! He had been hurt deeply back in the incident at the imperial palace, and had Gongsun Wan’er not intervened, he would have lost complete control. Afterward, it was only because of the Arch-Emperor’s legacy that he managed to clench his hands into fists and trudge back to the embassy like the walking dead. Then, he descended into a near masochistic session of cultivation. His mood had lifted quite a bit after becoming the new owner of the damaged fan, but now he had returned only to be hit with this news. As of now, it was completely impossible for him to suppress the madness in his heart! He didn’t care what the consequences might be, or what price he might have to pay…. This was Patriarch Spirit Stream and Li Qinghou!! This was the River-Defying Sect!! This was the lives of tens of thousands of people from the Heavenspan Realm!! Laughing in madness, he shot out from the embassy, accompanied by intense rumbling sounds. At the same time, a murderous aura erupted from him that cast the embassy and everything around it into the dead of winter. All cultivators present shivered as they were instantly sealed in place by the aura! A moment later, a blood mist sprang out around Bai Xiaochun! He was directly resorting to… the Godkiller technique!! Instantly, he vanished from the embassy. By the time the embassy staff came to their senses, he was gone, and they all knew exactly where he was going! “Something big is about to happen!!” “Quick, notify Saint-Emperor City!!” Everyone in the embassy was extremely nervous. Obviously, they knew what the Vile-Prince was up to, and therefore, to see Bai Xiaochun suddenly explode into action was a clear sign that something major was going to occur in Vile-Emperor City. And yet… what was about to happen surpassed anything they could possibly have imagined!! The blood mist that was Bai Xiaochun shot out of the city and then headed toward the shockingly large spell formation. The spell formation was a mass of turbid chaos, making it difficult to see what was going on inside. Nine black dragons formed the main structure of the formation, and seated cross-legged in key locations were several hundred Vile-Emperor Dynasty cultivators. They were powering the spell formation, and sitting cross-legged in the air above it were Reverend Devourer and Celestial Deadfall. Upon the request of the Vile-Prince, they were to actually operate the spell formation! They were aware of who was sealed inside the formation, and they also knew how it all related to Bai Xiaochun. But this was Vile-Emperor City, and in their estimation, the fact that Bai Xiaochun had held himself in check during the incident in the imperial palace indicated that he was no fool, and that he would likely do the same thing again. Celestial Deadfall was very happy to be a part of what was happening. He had not forgotten how badly he had fared against Bai Xiaochun in their fight some years ago, and was also irritated that Daoist Heavenspan’s fame had surpassed his own in the Vile-Emperor Dynasty. “If this Bai Xiaochun comes, then his end will be miserable beyond belief! He’ll be forced to watch the people of Heavenspan wither and die. And his grudge won’t be with me, it will be with the Vile-Prince.” With such thoughts on his mind, Celestial Deadfall smiled and looked down at the spell formation below. However, it was in that very moment that his expression flickered. Off to the side, Reverend Devourer opened his eyes. Both of them looked over to see a crimson blur flying in their direction from Vile-Emperor City, seemingly filled with an unending aura of blood and death! As soon as they saw the blur, and sensed the fluctuations coming from within it, both Celestial Deadfall and Reverend Devourer knew exactly who was coming! “Bai Xiaochun!” Celestial Deadfall rose to his feet, and yet, before he could say anything, Bai Xiaochun spoke in a voice that shook heaven and earth! “Are you people… looking to die?!?!” His voice continued to echo through the air as he bore down on the cultivators seated cross-legged, powering the spell formation. Most of them were devas, with some being demigods, and all of them looked up in complete shock as Bai Xiaochun shot toward them. Before any of them could react, he had stabbed through seven or eight of them! They couldn’t resist or fight back! Their bodies instantly withered, and hoarse screams erupted out as they were transformed into desiccated corpses that toppled backward onto the ground. Terror erupted in the hearts of everyone present. As for Celestial Deadfall and Reverend Devourer, they shouted in anger and leaped to block Bai Xiaochun’s way. But Bai Xiaochun’s Godkiller technique was too fast. Rumbling sounds echoed out as dozens of enemies were slaughtered. It didn’t matter how scared they were, how they tried to flee, or what techniques they tried to use to defend themselves. They were powerless against that blood mist! It all happened so quickly that even the celestials were too slow to do anything about it, let alone the terrified cultivators powering the spell formation. Wherever the blood mist went, cultivators transformed into dried-up corpses, their flesh and blood extracted, their souls plucked out, their life force wrenched away! Hundreds of cultivators dropped to the ground, their life force flowing into the Godkiller technique, making it more powerful, until the entire area was stained with crimson light! Bai Xiaochun would usually refrain from killing if he could, but once he started… he wouldn’t hold back! As of this moment, his murderous aura had combined with his frustration and madness, exploding out in unprecedented fashion! “What incredible gall you have, Bai Xiaochun!” Celestial Deadfall shouted. Both he and Reverend Devourer were actually secretly delighted. Considering what had happened already, they knew that Bai Xiaochun would not easily escape catastrophe! And yet, even as Celestial Deadfall’s words rang out into the air, the blood mist converged upon itself to form an image of Bai Xiaochun’s face, except as red as blood. Instantly, that head began to speed toward Celestial Deadfall! Celestial Deadfall’s face fell, and Reverend Devourer narrowed his eyes. Both of them began to perform incantation gestures as they prepared to join forces. Before they could, though, Bai Xiaochun’s enraged voice erupted from within the blood mist. “Waterswamp Kingdom!” RRRUUUUMBLE! Water vapor erupted in all directions, and spikes shot up into the air. Mountain peaks turned into a gigantic beast… that rose up from the depths of the land around them, and then lunged toward Reverend Devourer! Yet again, Reverend Devourer’s face fell. Originally, he would never have considered retreating, but after being set upon by this enormous beast, he had no choice. Within moments, Celestial Deadfall was left standing alone! Bai Xiaochun didn’t hesitate for a moment. Accelerating, he slammed into Celestial Deadfall head on! Howling, Celestial Deadfall defended himself, resorting to powerful divine abilities that spared him, but resulted in him tumbling backward with blood spraying out of his mouth. The Godkiller technique dissipated, revealing Bai Xiaochun himself, his eyes blazing with killing intent. He wanted to take lives, even those belonging to celestials. Without killing the people who stood in his way, he wouldn’t have the time to open up the spell formation! “I\u0027ve never killed a celestial before. Is that why you dare to stand in my way!?” Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-1186","bookId":1496,"book":{"id":1496,"title":"A Will Eternal","description":"A Will Eternal is the fourth major xianxia novel by the renowned Er Gen. It tells the tale of Bai Xiaochun, an endearing but exasperating young man who is driven primarily by his fear of death and desire to live forever, but who deeply values friendship and family. The story takes place in the same Universe as Er Gen\u0027s other novels, but is a separate story and can be read alone. That said, it does have connections to the other novels, especially I Shall Seal the Heavens. Those connections only pertain to a handful of chapters, so you can read the novel as a whole and enjoy it without first reading ISSTH. However, the best reading experience would begin with the later portions of ISSTH. This novel is much more comedic and light-hearted than Er Gen\u0027s previous works, although it has its fair share of action and drama.","cover":"http://cunovel.com/img/AWE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/a-will-eternal","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:09 AM"}}
