{"id":46604,"no":1287,"title":"Chapter 1285: The Saint-Emperor Emerges","content":"In this moment, Daoist Heavenspan closely resembled the Mortal Renegade. In fact, a vortex appeared on his own forehead, within which a face could be seen, which was none other than the face of the Mortal Renegade! His aura was different as well; there was an air to it that suggested nirvanic extermination, as though he wished any area he saw to be filled with death! “The ultimate expression of my Dao is to bring nirvanic extermination to everything. In the end, only I shall be Eternal!” He strode forward, flanked by hordes of burning devilish specters. Then he extended his hand, causing numerous specters to clump together in front of him, forming a huge blazing fire of darkness! It was none other than… a black flower of flame! “Nirvanic extermination!” he said calmly. The black flame flower began to grow larger, spinning, rumbling, becoming a sea of flames that shot directly toward the crumbling spell formation! The sky turned black as the flames spread out, and the spell formation that had stood for many years… finally began to collapse! When that happened, all of the cultivators connected to the formation nodes, regardless of the level of their cultivation base, began to cough up mouthfuls of blood. Trembling, and faces ashen, they looked up, despair flickering in their eyes. As they did, countless chunks of the spell formation began to fall down toward the ground. Without anything to stand in its way, the black sea of flames rushed out, followed by a huge army of devilish specters. Howling, they shot toward the Eternal Immortal Domains, followed by Daoist Heavenspan, whose shocking aura seemed like that of a sovereign! He was wreathed in black flames, almost like a cloak of darkness, and as his hair floated around him, he emanated the icy coldness of nirvanic extermination. Further back, the Mortal Renegade remained in place, the same as ever, and yet, seemed to be struggling to open his eyes! To the further despair of the cultivators below, the sealing strip that Bai Xiaochun had repaired was now beginning to collapse, starting from the portion near the dantian region, and moving slowly upward toward his forehead. Once that strip vanished completely… the Mortal Renegade would wake up!! The true moment of deadly crisis for the Eternal Immortal Domains was nigh! From a distance, a sea of flames and an army of countless devilish specters descended on the Eternal Immortal Domains, led by Daoist Heavenspan. And their target… was Arch-Emperor City!! That was their ultimate goal, because that was the location of… Bai Xiaochun!! Song Junwan. Hou Xiaomei. Zhou Zimo. Gongsun Wan’er…. The Grand Heavenmaster. Li Qinghou. The Giant Ghost King. There were many powerful experts in Arch-Emperor City, and all of them were gathered around Bai Xiaochun’s meditation chamber, staring with ashen faces and despairing eyes at the fire and the specters, and most especially, at Daoist Heavenspan. Many a bitter sigh could be heard. “In the end… there just wasn’t enough time!” “Perhaps when he went into meditation, it really was the final farewell….” As Xiaoxiao stood there, she looked over her shoulder at Bai Xiaochun’s private chamber, and whispered, “Dad….” Her voice was filled with sorrow and love, and at the same time, a tone of farewell…. The Grand Heavenmaster chuckled bitterly, and the Giant Ghost King sighed. The other celestials all exchanged glances with bloodshot eyes. They knew that there was nowhere to run, and therefore, they began to power up their cultivation bases and prepare for a fight to the death! However, that was when the Eternal Immortal Domains began to tremble violently, as an explosive aura suddenly appeared! Much to the shock of everyone, it surpassed the Archaean Realm, and caused Daoist Heavenspan to look with flickering eyes in the direction of… the Eternal Sea!! Although it seemed to fill all of the Eternal Immortal Domains, Daoist Heavenspan knew exactly where it was coming from! In a deep crevice in the Eternal Sea was the entrance to the Eternal River. And in the depths of the Eternal River, sitting in front of the bell that represented the Eternal Mother, was the Saint-Emperor, who had just opened his eyes! As he did, a sigil appeared on his forehead, depicting… the Eternal Flower! Daoist Heavenspan had a similar mark on his own forehead, a sigil which represented a sovereign. Both of these individuals were half-sovereigns, and therefore, those marks indicated… that their true power came from other sources! Unfortunately, the Saint-Emperor had not finished the process of elevating his cultivation base and becoming a half-sovereign. He was not yet stable, and yet, had no choice but to end his session of cultivation! He was the Saint-Emperor! This was his home! And his Dao came from the Eternal Mother! Rising to his feet, he spoke in a voice that surpassed heavenly thunder, filling all of the Eternal Immortal Domains with a roar of rage. “The Arch-Emperor is not here, Daoist Heavenspan. Therefore, I, the Saint-Emperor, will defend these lands!” Stepping forward, he vanished, to reappear in the air above Arch-Emperor City! As he did, a tempest rose up in the Eternal Immortal Domains, a windstorm that converged on Arch-Emperor City and immediately began to resist the black sea of flames! Massive rumbling sounds echoed out as the two forces met, nearly deafening the living beings in the Eternal Immortal Domains! As the Saint-Emperor strode forth, he reached out toward Saint-Emperor City and made a grasping gesture, causing the enormous lotus within the heavenly pond to shudder for a moment, then vanish! When it reappeared, it was beneath the Saint-Emperor, shining with soft light. As that glow spread out, it covered Arch-Emperor City, making it impossible for the black sea of flames or the devilish specters to enter the city. Having resolved that small crisis, the Saint-Emperor looked up, the sigil on his forehead shining as he shot toward Daoist Heavenspan! “How amusing,” Daoist Heavenspan said, chuckling as he looked with cold eyes at the Saint-Emperor. “Unfortunately… your Dao comes from the paltry Eternal Flower. My Dao comes from the Mortal Renegade, a powerful sovereign. That puts me on another level altogether…. Furthermore, you haven’t stabilized yourself as a half-sovereign…. You simply don’t qualify to stand in my way!” Laughing madly, Daoist Heavenspan vanished, then reappeared directly in front of the Saint-Emperor in a black blur of light! The Saint-Emperor’s face fell as that black light slammed into him, causing blood to spray out of his mouth as he tumbled backward. The black light didn’t seem fazed at all by the interchange, and immediately shot toward him again. The light destroyed the air around it, and dissipated any nearby life force, replacing it with a powerful aura of death. As it closed in, the Saint-Emperor roared and performed a double-handed incantation gesture, instantly causing a huge moon to appear around him! This was one of his most powerful divine abilities, and now that his cultivation base was higher, it was no longer a crescent moon, but rather, a full moon. And yet, despite the powerful pressure it radiated, Daoist Heavenspan simply chuckled, reached out, and pushed against the moon! Instantly, cracks spread out across it, and the moon… shattered into countless pieces! More blood sprayed out of the Saint-Emperor’s mouth, and he fell back again, a defiant gleam in his eyes. “If only I could have had a few more years….” Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-1285","bookId":1496,"book":{"id":1496,"title":"A Will Eternal","description":"A Will Eternal is the fourth major xianxia novel by the renowned Er Gen. It tells the tale of Bai Xiaochun, an endearing but exasperating young man who is driven primarily by his fear of death and desire to live forever, but who deeply values friendship and family. The story takes place in the same Universe as Er Gen\u0027s other novels, but is a separate story and can be read alone. That said, it does have connections to the other novels, especially I Shall Seal the Heavens. Those connections only pertain to a handful of chapters, so you can read the novel as a whole and enjoy it without first reading ISSTH. However, the best reading experience would begin with the later portions of ISSTH. This novel is much more comedic and light-hearted than Er Gen\u0027s previous works, although it has its fair share of action and drama.","cover":"http://cunovel.com/img/AWE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/a-will-eternal","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:09 AM"}}
