{"id":45682,"no":365,"title":"Chapter 363: One Should Be Enough","content":"Chapter 363: One Should Be Enough In this legacy zone, heaven and earth were currently cloaked in darkness! The sky was leaden, a perfect complement to the pitch-black lands that stretched out below it. However, serving as a perfect foil to the darkness were the brilliant beams of light that were breaking out in multiple locations within the dimension. Those beams of light all contained cultivators, and the brilliance they cast instantly illuminated the murky world around them. Because of the new light, it was now possible to see that the dimension wasn’t very large. Furthermore, in the exact center of it, there was a mountain with a peak so tall it pierced the clouds. It was so immense that anyone looking up at it would feel like a tiny insect. The surface of the mountain was covered with numerous sealing marks, which moments ago had been the same color as the surface of the mountain itself. However, the arrival of the cultivators caused them to glow with bright light. Close examination revealed that the sealing marks on the mountain... were limited in number! There were exactly one hundred of them! This towering peak was none other than... the Mountain of Legacy Seals! It was also the brightest location in the entire legacy zone. As the crowd of cultivators appeared, Bai Xiaochun became visible within one of the beams of light. Next to him was Bruiser. As soon as they both appeared, Bai Xiaochun activated his paper talismans, causing dazzling, colorful lights to appear all around him. It actually looked quite attractive; he was like an entity of colorful light. Next, he helped Bruiser activate all of his paper talismans, until he looked equally as colorful. Because of that, they became very conspicuous within the legacy dimension. Quite a few gazes shifted in their direction, gazes of derision and mockery. Bai Xiaochun had already been nervous to begin with, and when he realized people were staring at him, he gasped, and his heart filled with icy fear. “This place is so dangerous! So much killing intent!” Bai Xiaochun put a restraining hand on Bruiser’s back, and then looked around vigilantly. After confirming that people were looking at him but not heading in his direction, he breathed a sigh of relief. Then he began to glare back at people. “I\u0027ve never lost to anybody when it comes to contests like this. Am I right, Bruiser? Alright, come on. Let’s both glare at them. Show them how badass the two of us are!” From that point on, whenever anyone looked over at him, Bai Xiaochun would glare back with a murderous stare, as did Bruiser. One particular young man from the Starry River Court who was relatively close to the two of them smiled mockingly and said, “Junior patriarch of the River-Defying Sect? Did you bring all of the paper talismans from your entire sect with you? Do you have enough? Or should I give you a few of mine?” Bai Xiaochun turned and cast him a fierce glare. “Sure. Hand a few over!” The young man’s scorn increased. Laughing coldly, he ignored Bai Xiaochun and began to head in the direction of the Mountain of Legacy Seals. He wasn’t the only one. The disciples of the three sects all began to transform into beams of light that headed in the same direction. Because of how close the mountain was, none of them flew, but instead, sped along on foot. Bai Xiaochun chose not to act blindly and without thinking. Instead, he took some time to assess the situation. The disciples approaching the Mountain of Legacy Seals were all going along on foot. Not a single one was flying. Furthermore, all of them stopped at a certain point roughly 15,000 meters from the base of the mountain. Furthermore, the disciples didn’t simply scatter. Instead, looks of vigilance could be seen on their faces as they began to gather in ranks according to their sects. Suddenly, rumbling sounds filled the air as numerous lightning bolts appeared in the area between the cultivators and the mountains, as well as a gale-force wind. The lightning bolts were as thick as buckets, and the intense wind was pitch black and contained incredible power. In fact, the wind almost looked like black dragons sweeping back and forth within the 15,000-meter region. Anyone with eyes could see how incredibly powerful the lightning bolts and the blasts of wind were. Other types of magic began to spread out. There were gigantic hands, blades of ice, and tongues of fire. There were illusory projections that looked like shrieking ghosts. Thorns began to grow up out of the ground, and deep crevices opened up randomly here and there. Obviously, the 15,000-meter area was a place rife with danger. Even Nascent Soul Daoist masters would be leery of such an area, let alone Core Formation cultivators. Bai Xiaochun looked over and noticed one of the cultivators from the Polarity River Court summon a puppet, which he sent into the 15,000-meter region. Before it got far, a bolt of lightning struck it, reducing it to nothing more than ashes. Bai Xiaochun gasped, and his face drained of blood. “The jade slip said this Mountain of Legacy Seals was dangerous, but it didn’t say it was this dangerous! That puppet... was at the same level as Core Formation, and it got destroyed by a single lightning bolt!” Bai Xiaochun stood in place hesitantly, trembling the entire time. Bai Xiaochun wasn’t the only one to react with such shock. Several disciples of the three sects used various magical means to try to enter the 15,000-meter area on their own, but in the end, were left sighing in frustration. “It must be because this isn’t the usual time to enter the legacy zone. The defensive spells around the Mountain of Legacy Seals must be much more powerful than usual....” “Usually the Starry Sky Dao Polarity Sect’s emissary limits the power, but not this time....” After discussing the matter, the three groups tightened their formations and then began to slowly make their way into the 15,000-meter area in groups. Whenever dangerous situations arose, they would pool their power to defend themselves. Before long, booms filled the air, and the lands began to quake. Bai Xiaochun stood there in hesitation for the time it takes an incense stick to burn. At that point, one of the hundred sealing marks on the Mountain of Legacy Seals suddenly began to shine brightly, then flew up into the air and spiraled out into the 15,000-meter region. Almost instantly, all of the disciples of the three sects looked over nervously at the sealing mark as it circled out further and further away from the mountain. When it reached the 13,500-meter mark, the disciples started making attempts to acquire it. The cultivators from the Starry River Court unleashed all of their cultivation base power, creating a stream of brilliant starlight fully 3,000 meters long. It only took a moment for the stream of starlight to bear down on the sealing mark as if to wrap it up and drag it away. At that point, the people from the Polarity River Court let out a bellow as they erupted with devil qi, summoning a huge flying head that shot toward the sealing mark and began to contend with the Starry River Court. The Dao River Court had the most people in the legacy zone. When they looked over at what was happening, many of them took deep breaths and then began to emanate a strange power that seemed almost like natural law. Instantly, the air surrounding their group began to twist and distort. Then, rumbling could be heard as a towering giant took form. Without any hesitation, the giant strode forward and reached out to grab the legacy seal! As soon as the giant\u0027s hand closed around the sealing mark, it vanished and reappeared in the hand of one of the Dao River Court cultivators. “It’s mine!!” he cried excitedly, throwing his head back and laughing as he absorbed the mark into his body. The other Dao River Court disciples were a bit jealous, and the Starry and Polarity River Courts were disappointed, but didn’t let it show on their faces. In fact, some of them even smiled in congratulation. Bai Xiaochun was left gasping at the scene which had just played out. He also understood the rules in this place a bit better now. Once the sealing marks flew out from the Mountain of Legacy Seals, the people who were closer to the mountain would have an advantage in trying to acquire them. “One should be enough for me!” he thought, gritting his teeth. He didn’t set his expectations too high. As long as he could get one, then at least he could call the mission a success. Trying to get more than that would surely be too dangerous.... With that, he headed toward the mountain. By the time he reached the border and prepared to step in, the cultivators of the three sects were already about two or three hundred meters in. Almost as soon as he entered, a black blast of wind shot toward him, filling his head with a sense of explosive crisis. Letting out a shriek, he backed up. Then a lightning bolt shot toward him, and he fell back again, scowling on the verge of tears. Within moments, he was back outside the 15,000-meter area. Only then did the various defensive magics ignore him. “What do I do now...?” he thought. Not daring to enter the area again, he looked over at Bruiser, who stared back at him blankly.... -- Translator: Deathblade. Chinese language consultant: ASI a.k.a. Beerblade. Editor: GNE. Memes: Logan. Meme archives: Tocsin. Transcendent Patrons: Daoist Elder N, BLE, ttre208. AWE Glossary. Xianxia-inspired T-shirts. -- This chapter is a bit short, slightly over 1,600 characters Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-363","bookId":1496,"book":{"id":1496,"title":"A Will Eternal","description":"A Will Eternal is the fourth major xianxia novel by the renowned Er Gen. It tells the tale of Bai Xiaochun, an endearing but exasperating young man who is driven primarily by his fear of death and desire to live forever, but who deeply values friendship and family. The story takes place in the same Universe as Er Gen\u0027s other novels, but is a separate story and can be read alone. That said, it does have connections to the other novels, especially I Shall Seal the Heavens. Those connections only pertain to a handful of chapters, so you can read the novel as a whole and enjoy it without first reading ISSTH. However, the best reading experience would begin with the later portions of ISSTH. This novel is much more comedic and light-hearted than Er Gen\u0027s previous works, although it has its fair share of action and drama.","cover":"http://cunovel.com/img/AWE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/a-will-eternal","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:09 AM"}}
