{"id":45876,"no":559,"title":"Chapter 557: Deva Soul In Hand!","content":"Bai Xiaochun’s heart was pounding from the fact that, if he counted this deva soul right in front of him, he now had three in his collection. Furthermore, all of them were different types of souls. Deva souls were very rare to begin with, and was impossible to say if or when he would be able to find two more of different types. After a bit of thought, he sighed. “Forget it. Going with deva beast souls is definitely the safest bet.” Although he was a bit disappointed that there was basically no way for him to reach the Heaven-Dao Nascent Soul stage, he was fairly certain that no one outside of this sepulcher was aware of the other usages of deva souls. That was a bit of information that he might be able to profit from later. With such thoughts on his mind, he reached out to see if he could erase the script from the stone stele. That way, if someone else ever came along, Bai Xiaochun would still remain the only person privy to the secrets he had just learned. To his delight, a quick test proved that the words on the stone stele had been there for so long that it took almost no effort on his part to wipe some of them away. Just when he was preparing to erase the entire body of text, he suddenly saw one line off to the side that he hadn’t noticed before. I have intentionally left these words behind, and thus, anyone who defaces them shall be cursed.... “Cursed!?!?” Bai Xiaochun exclaimed, his eyes going wide and his hair standing on end. He pulled his hand away from the stone stele as if it were a hot iron. “How sinister, this second generation Arch-Emperor! Why did he have to make the warning so small you can’t see it unless you stick your nose right up to the stele?! If he didn’t want people to erase the text, he should have used some magic to make sure people couldn’t.” Gritting his teeth, he decided he couldn’t take any more risks. The idea of a curse left him completely jumpy, and looking around in fear. “I only erased a few words, that’s all. Plus it wasn’t on purpose. Shouldn\u0027t be a problem....” Following the method described in the text he had just erased, he carefully performed an incantation gesture with his right hand and then waved his finger at the stone stele. Instantly, the stele began to vibrate, and then move backward, freeing the light blue bracelet. Even as it began to fly into the air, Bai Xiaochun reached out and grabbed it! “Deva soul in hand!” In the moment that Bai Xiaochun grabbed the bracelet, something happened in the realm of trials by fire in the second level. Mistress Red-Dust’s eyes snapped open. Instantly, her glowing sphere became a vortex which sucked her away, and the crowd broke out into a huge commotion. “Matriarch Red-Dust just disappeared!” “She finished her trial by fire! She’s being teleported to the deva soul!” “What a pity. Now none of us have any hope of getting the deva soul.” Zhou Yixing couldn’t have looked more excited, and started laughing loudly. “This time, you’re definitely dead, Bai Xiaochun! Maybe I can’t handle you, but I refuse to believe that you’ll have any other choice than to flee from Matriarch Red-Dust and her deva cultivation base!” At the same time, another loud cracking sound rang out from the huge stone stele, as the fissure which had opened up because of Bai Xiaochun’s spirit enhancement activities widened. In fact, seven or eight smaller fissures spread out from the main one. At the same time, enormous, thundering rumbling sounds began to ring out into the void, almost as if some invisible giant were striking the stele. Everything began to shake, and a sensation of imminent collapse filled the entire area. Everyone present looked around in shock and fear. “What’s going on!?” “Is this place gonna collapse or something?!” “Let’s get out of here! We\u0027re underground! If the place collapses, we’ll be buried alive!!” The cultivators in the glowing spheres were getting very nervous. As the stone stele began to crack, the glowing spheres started to twist and distort, and some of them even began to crack just like the stone stele. Some of the cultivators managed to blast open the spheres and fly out from inside. Although none of them knew why the imminent collapse was occurring, it seemed likely to them that someone had triggered the destruction of the labyrinth, which meant that they were in danger of being killed. There was little time for contemplation. After breaking free from the glowing spheres, people began to speed here and there in an attempt to find an exit. Zhou Yixing also broke free and began to join the search. However, the more than 1,000 people quickly discovered that, to their despair, there were no exits! Chen Hetian was among them. Eyes shining brightly, he flew high up in an attempt to use his deva cultivation base to break free. Booms rang out, and the area where Chen Hetian had attacked rippled and distorted. However, the depression he had formed with his attack quickly restored itself, and the signs of imminent self-destruction did not lessen. If anything, they grew more pronounced. Destructive bubbles even began to appear, which would instantly shred any cultivator too slow to avoid them to pieces. Chen Hetian’s face fell at the realization that not even he with his incredible battle prowess could break the barriers leading out of this place. Without any hesitation, he called out in a booming voice, “Listen up everyone. I don’t care if you’re from the Great Wall or the Wildlands, join me in attacking the barrier. Let’s get out of here!” Everyone knew that time was limited, and therefore, regardless of which side of the war they came from, they all joined forces under Chen Hetian, unleashing divine abilities and magical attacks to try to break out. As they did, the bulge created in the barrier grew more pronounced.... As the realm of trials by fire shook, drastic events were playing out in the rest of the labyrinth. The previously indestructible walls were now cracking and crumbling. Countless faces appeared on them, screaming as they attempted to flee, and yet, they were incapable of doing so. The labyrinth as a whole was rocking as violently as if it were being held in someone’s hand, and shook back and forth. The cultivators who were still searching for exits within the main part of the labyrinth were completely shaken, and it was all they could do just to stay on their feet. Everyone could tell that a major crisis was developing, and that the entire area was about to collapse. “How could this be happening?!” “Dammit, I still haven’t found the exit. Don’t tell me I\u0027m going to die in here!” Bitter howls of grief and anger filled every corner of the labyrinth. Master God-Diviner was still making his way through the tunnels when he saw, to his despair, that the walls were falling apart around him. He even saw a whole group of red hats flying through the air, screaming. “It’s all over. I’m finished....” he moaned. In another area not too far from the realm of trials by fire, Song Que was laughing bitterly as the labyrinth fell apart around him. He could tell that the exit was just up ahead, and yet, before he could reach it, drastic upheaval struck. “Could it be that I, Song Que, will end up buried in this labyrinth?!?!” Unwilling to give in, and yet bereft of any other options, he threw his head back and roared bitterly. Dramatic events were unfolding outside of the labyrinth as well. There were many people gathered outside. Bai Lin and two of the other generals had summoned large armies to camp outside the entrance. There were large groups of Wildlanders on the other side of the entrance, with hundreds of thousands of savages and soul cultivators, as well as quite a few necromancers. Both sides were waiting to find out who would get the deva soul, and in order to prevent a large-scale conflict from breaking out, had encamped in the area. However, before anyone could even emerge from the labyrinth, intense rumbling sounds began to echo out. Shocked expressions could be seen on the faces of Bai Lin and the generals, as well as the Wildlander necromancers. As of this moment, the entire area for 500 kilometers around the labyrinth was shining with bright light. At the same time, the land was beginning to cave in, causing a mushroom cloud of dust to rise high into the sky. The effects only continued to spread. Mountains collapsed, and the lands quaked as surely as if earth dragons were thrashing about beneath its surface. Everyone began to back away nervously from the expanding area of collapse. “Something’s happening!” Bai Lin’s heart was pounding, and he considered going to investigate. However, as the lands collapsed, an aura erupted out that destabilized the souls of everyone present. It seemed obvious that anyone who got too close would get sucked into the destruction. Clearly, the area of collapse was transforming into a huge spell formation, the size of which only continued to grow larger! Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-557","bookId":1496,"book":{"id":1496,"title":"A Will Eternal","description":"A Will Eternal is the fourth major xianxia novel by the renowned Er Gen. It tells the tale of Bai Xiaochun, an endearing but exasperating young man who is driven primarily by his fear of death and desire to live forever, but who deeply values friendship and family. The story takes place in the same Universe as Er Gen\u0027s other novels, but is a separate story and can be read alone. That said, it does have connections to the other novels, especially I Shall Seal the Heavens. Those connections only pertain to a handful of chapters, so you can read the novel as a whole and enjoy it without first reading ISSTH. However, the best reading experience would begin with the later portions of ISSTH. This novel is much more comedic and light-hearted than Er Gen\u0027s previous works, although it has its fair share of action and drama.","cover":"http://cunovel.com/img/AWE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/a-will-eternal","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:09 AM"}}
