{"id":46297,"no":980,"title":"Chapter 978: Shattered Mirror!","content":"“Dammit, there are still 20 breaths left!” Face pale, Bai Xiaochun backed up nervously. He was very well aware that, even despite being incomplete, the laughing-crying ghost face still had battle prowess equivalent to a demigod, and was something he couldn’t possibly fight against. As he backed up, the ghost face floated down, eyes gleaming with greed. Ignoring Bai Xiaochun completely, he headed toward the center of the vortex. “This world treasure is mine!” the ghost face cackled excitedly. Bai Xiaochun’s eyes had already begun to blaze with anger. Although he couldn’t be exactly sure of what would happen if the baby girl’s efforts were interrupted, even the stupidest person in the world could guess that it would be bad. “I can\u0027t let this happen!” he thought, his eyes turning bloodshot. If the ghost face took control of the magical item, not only would he and the baby girl fail at the last minute, but it was possible he could lose his poor little life. After all, there was no way the ghost face would let him leave to spread word of what had occurred. There was no time to consider what to do, or to worry about what might happen. Bai Xiaochun howled, immediately resorting to the Forefather Transformation to charge toward the ghost face. He only took three steps, but had already reached the fifth transformation! His left eye shone with moonlight, providing an explosive increase to his power. Then he added in the Living Mountain Incantation. All of his combined cultivation base and fleshly body power temporarily gave him a level of power that surpassed the late Deva Realm! Although he wasn’t quite in the great circle, he was very close! A blast of wind echoed out as he used his Undying Hex to shoot forward and appear directly in front of the ghost face. “You’re not going anywhere!” he roared in a voice that crackled like heavenly thunder, simultaneously unleashing the Undying Emperor’s Fist! He didn’t hold anything back. He poured all of his fleshly body power into the blow, forcing the ghost face to turn and look at him. However, a gleam of scorn appeared in the ghost face’s eyes as, instead of retreating, he lunged forward to meet Bai Xiaochun’s Undying Emperor’s Fist. A massive boom echoed out. Blood sprayed from Bai Xiaochun’s mouth as he tumbled backward, his Undying Emperor’s Fist routed, his Living Mountain Incantation shattered, and his Forefather Transformation vanquished. “You think a bit too much of yourself!” the ghost face said with a cold snort. Turning, he headed back toward the center of the vortex. However, thanks to the power of his Undying Blood, Bai Xiaochun’s injuries were already recovering rapidly. As the ghost face continued onward, Bai Xiaochun roared and used his Mountain Shaking Bash to shoot forward. He performed a double-handed incantation gesture, calling upon his Waterswamp Kingdom. At the same time, he sent frigid qi roiling out, within which appeared numerous frigid projections that lunged at the ghost face. Worried that it wasn’t enough, he slapped his bag of holding and produced a handful of multi-colored flame, which he also threw out in front of him. BOOOOOOOOOOOOOM! Cracks spread out in the surrounding ice, and the intense heat of the sea of flames that resulted from the detonation of the multi-colored flame caused much of it to melt. Even the laughing-crying ghost face, who currently had demigod battle prowess, couldn’t help but frown. Normally speaking, the ghost face could deal with these attacks with ease, and could also kill Bai Xiaochun fairly easily. However, he was worried about the fluctuations of the battle attracting attention. Furthermore, he had noticed… that there appeared to be something within the vortex, fusing with the magical item. He was in no mood to tangle with Bai Xiaochun. What he needed to do was get into the magical item before the fusing process was complete, and make sure that he was the one to fuse with it. “I’ll handle you in a moment!” he said with a cold snort. Then, he unhesitatingly called upon a bizarre curse, uttered in a language that did not originate within the lands of Heavenspan. As he did, the black smoke which surrounded him transformed into nine magical symbols, which swirled through the air toward Bai Xiaochun. Those nine magical symbols seemed to contain the power of Essence, and although they were weaker than they had been when the ghost face used them in the past, they still shone with dazzling light. Despite unleashing the nine magical symbols, the ghost face didn’t stop for a moment. He continued onward, ignoring Bai Xiaochun’s Mountain Shaking Bash, the Waterswamp Kingdom, and the shocking sea of flames. As for the magical symbols, they swirled around him, piercing through all of Bai Xiaochun’s divine abilities to appear directly in front of him. When the magical symbols slammed into him, his chest caved in, and he coughed up gobs upon gobs of blood. It was a grievous injury that caused his vision to swim as he was thrown violently backward. As Bai Xiaochun was flung away, the greed in the ghost face’s eyes grew more intense, and he closed in on the center of the vortex. If he entered the vortex, the consequences would be unimaginable. In his madness, Bai Xiaochun opened his Heavenspan Dharma Eye, sending out a beam of light that wrapped around the ghost face. The ghost face paused for a moment, but regained motion a moment later. He was angry and frustrated, but didn’t have time to spare worrying about Bai Xiaochun. He continued forward until half of his head was in the vortex itself. At that point, a voice echoed into Bai Xiaochun’s mind. “There are only a few breaths of time left! Stop him!!” Eyes bloodshot, Bai Xiaochun shouted, “You’re forcing me to do this, ghost face!” Bai Xiaochun had no options left. He quickly crushed a drop of Undying Blood, causing a towering level of blood qi to surge through him from head to toe. His eyes suddenly looked profoundly evil as he took a step forward, energy pulsing. He was already beginning to lose control of his consciousness, and act on instinct alone. As the Godkiller was unleashed, he suddenly became voraciously interested in any type of life force. Before the ghost face could even sense the surging blood qi of the Godkiller, Bai Xiaochun was right in front of him. Bai Xiaochun reached out with his right hand and grabbed onto him viciously. Instantly, a tremor ran through the ghost face, and a sensation of deep crisis rose up inside of him. And then, he was ripped out from the vortex! Howling, the ghost face spun to see Bai Xiaochun pulsing with blood qi. “Dammit, is this… blood magic?!” The ghost face couldn’t have been more shocked by how dangerous Bai Xiaochun seemed in this moment. In the moment that the ghost face was hauled out into the open, the baby girl reached the end of the 100 breaths of time. The vortex surged mightily as a powerful gravitational force erupted out, dragging everything in the area toward the opening! Neither Bai Xiaochun nor the ghost face had any control over their own bodies as they were swept up. “Maybe I failed on my first attempt, but once I\u0027m inside that magical item, I’ll figure out another way to take control!” The ghost face was furious, but at the same time, could see that something was off about Bai Xiaochun. “This guy’s divine soul is weak, making it difficult for him to use that blood magic properly. Otherwise, he would be really difficult to deal with!” The ghost face snorted coldly as he was dragged into the vortex. However, he still managed to send his magical symbols shooting toward Bai Xiaochun again. “How dare you make things difficult for me. Now that you\u0027ve lost consciousness and are acting on instinct, it’s the perfect time… to seal you!” Mysterious light shot out from his eyes as the nine magical symbols surrounded Bai Xiaochun, overlapping with each other as they sent out mountain-toppling, sea-draining power. Layer by layer, the power of sealing settled onto Bai Xiaochun. Even as the sealing marks fell into place, the vortex rumbled with thunderous intensity, and both Bai Xiaochun and the ghost face were dragged inside! As they were, the lake and the ice cave began to crumble! Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/a-will-eternal/awe-chapter-978","bookId":1496,"book":{"id":1496,"title":"A Will Eternal","description":"A Will Eternal is the fourth major xianxia novel by the renowned Er Gen. It tells the tale of Bai Xiaochun, an endearing but exasperating young man who is driven primarily by his fear of death and desire to live forever, but who deeply values friendship and family. The story takes place in the same Universe as Er Gen\u0027s other novels, but is a separate story and can be read alone. That said, it does have connections to the other novels, especially I Shall Seal the Heavens. Those connections only pertain to a handful of chapters, so you can read the novel as a whole and enjoy it without first reading ISSTH. However, the best reading experience would begin with the later portions of ISSTH. This novel is much more comedic and light-hearted than Er Gen\u0027s previous works, although it has its fair share of action and drama.","cover":"http://cunovel.com/img/AWE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/a-will-eternal","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:09 AM"}}
