{"id":83053,"no":4,"title":"Page 4","content":"THERE WAS LAZY WATER within the harbor; Kiss Bottom held back the swell and surge of the waves. Moore stood on the deck of the fishing trawler watching his own reflection break into halves, thirds, fourths by the boat\u0027s bow-break. The wharfs were coming up, and young boys stood ready there to catch and secure the thick fore and aft deck lines. Beneath the tangle of wharf pilings, where the steady surf washed in on a beach, crabs rustled through thorns and grass. The remains of a fishing skiff were half-buried there, and now no one remembered to whom it had belonged. Other small boats were beached along the semicircle of the harbor; nets were drying over timber racks, and a solitary fisherman sat beneath a cluster of palms, watching the trawler as it neared.\n The larger trawlers were moored in their places, their tire-browed sides rubbing aged timbers. A sheen of oil floated across the water, tinting it in a kaleidoscope of thick colors; a dead ghostfish hung in the midst of it, the oil coloring it. In another moment the trawler\u0027s bow had ground it under.\n \"I\u0027ve been in these islands for all my life, David,\" said Kip, coming up beside him and speaking over the din of the diesels\u0027 hoarse voices. \"But I\u0027ve never seen anything like that happen before. Like I say, it\u0027s a holy wonder you weren\u0027t killed.\" He scowled inwardly when he realized Moore wasn\u0027t listening.\n Kip had been born into a poor fishing family on Hatcher Key, a small island perhaps a hundred miles to the east of Coquina, so named because of its turtle hatchery. Often he dreamed of being a youth there again, running with his friends across mountains of gleaming ivory sand, and beyond the shore into the surf with its unbroken patterns of white. Then his father had broken his arm and shoulder running the family\u0027s boat aground on an uncharted sunken steamer. The bones had never knitted correctly and his father had had to give up fishing, so the family had gathered up their belongings and moved to the Kingston slums, a mass of twisted clapboard and streets of shifting sand. Survival there had meant making miniature straw figures for the tourists, or in Kip\u0027s case, acting as a guide for a few pence. His aunt and uncle lived just outside Kingston, on the fringe of the woods. They had frightened Kip - their beliefs and practices had seemed peculiar - unnatural - and altered their everyday personalities in some inexplicable way. Kip had hated his visits with those people.\n His mother had barely known how to read, but she insisted on teaching him. If you can read, she said, you can think. And in this world a man got to think to survive. While the woman had read to Kip, his father had sat apart from them in the tiny room, watching the lantern flicker and listening to the roll and call of the sea.\n Kip had gone to the United States, to Florida, to seek his own living and there he had run into trouble. The grinning, tallow-faced white men either tried to beat him or steal whatever money he made sweeping floors in a Miami poolhall. They weren\u0027t all like that, of course, but he thought then he\u0027d seen enough badness there to last a lifetime. By day he absorbed everything he saw or heard, and by night, in an upstairs room with holes in the plaster, he read all the books he could beg or borrow. One of them impressed him greatly: a novel about the bobbies of London, called The Long Arm of the Law. And so he worked his way across the Atlantic on a tramp steamer that docked in Liverpool, finding work as a deckhand on a harbor tug. He had had trouble at first, as the object of scorn and derision of the white old-timers. He had gradually won their respect, if not their friendship, simply because he could work like any three of them put together. Kip had gotten into a program in law enforcement and, returning to the islands in the sixties with his education and his eyes full of the world, he had landed a post as an officer in the Bahamas. On Grand Bahama he\u0027d met his wife-to-be and fathered his first child, a boy named Andrew. Then he was offered the position of constable on Coquina. He had accepted because of the responsibility involved and the sense of doing something worthwhile.\n He and Myra had stayed on Coquina because they\u0027d found life good here, peaceful and secure. Mindy had been born just after they\u0027d arrived, and five years later, Andrew, then seventeen, had gone to the United States on a factory boat to find his own path in the world. Kip saw the cycle repeating again and though he\u0027d miss his son, he knew there was no use in trying to hold back what must be. Which was, he knew, the way of the world.\n The trawler cut its engines and coasted toward the wharf. The boys caught the deck lines and made them secure around the stumps of pilings. Moore took Kip by the arm. \"Look who\u0027s coming,\" he said.\n \"His excellency,\" Kip said, watching the black man in a dark suit and white shirt approaching them.\n Moore climbed over the side of the boat and stepped onto the wharf; nearby two old men were cutting the heads off snappers to use as bait the following morning. Their knives gleamed with blood. As they worked they kept looking up at the thing that hung crazily across the reef.\n \"What\u0027s that?\" another black with a gold front tooth asked Moore; he squinted to look out to the reef. \"Big fish someone landed.\"\n \"That\u0027s right,\" Moore replied. \"A hell of a big fish.\"\n \"Moore!\" called the man in the dark suit, making his way past piles of crates, drying nets, and barrels of fish offal covered with motionless flies.\n Kip had stepped onto the wharf behind the white man to watch the mayor\u0027s approach. Reynard never failed - he was always there as soon as something happened that might make him look bad.\n \"Where did that come from?\" Reynard asked as he reached Moore, looking over Kip\u0027s shoulder at the hulk. He was neatly dressed in a clean suit, but the tight knot in his dark-blue tie was stretched badly, and the collar and cuffs of his shirt were frayed. When he squinted the lines around his nose and beneath his sparse field of white hair folded into deep trenches that gave his face the appearance of an aged oil painting about to crack. \"My God!\" he said, not looking at either the white man or the constable. \"Do you know what that is?\"\n \"It corked from about a hundred and fifty feet in the Abyss,\" Moore told him. \"And, yes, I know what it is.\"\n \"Is it open?\" The mayor turned to look at Kip.\n \"No.\"\n \"It\u0027s wedged in there, is it? Thank God it didn\u0027t come into the harbor or we\u0027d have hell to pay, gentlemen. It looks from here to be almost intact...\"\n \"It is,\" agreed Moore. \"All two hundred feet of it.\"\n The mayor made a face, as if he had swallowed something bitter. \"What\u0027s going to be done with it, constable?\"\n \"Right now I don\u0027t know. It\u0027s safe here for the time being. As long as it doesn\u0027t slip off the reef, it\u0027s not going anywhere.\"\n \"Isn\u0027t there some way to sink it again?\" Reynard said, glancing nervously from one man to the other.\n \"Unseal the hatches or torch a hole in it under the hull,\" Kip said. \"But I\u0027m not so sure that\u0027s our decision. There are salvage laws to consider; the thing may belong to Moore.\"\n Moore looked at him. He hadn\u0027t thought of that before, but now he realized it was entirely possible. He had found the thing and, in a sense, excavated it from its vault on the Abyss ledge. It wasn\u0027t something he would ordinarily have tried to claim as a salvage; few submarines were worth much except as historical relics. But, still, one in such good shape, and on the surface... it was something worth thinking about.\n \"And,\" Kip continued, \"that\u0027s an old boat. No identification markings, but I\u0027d say quite a few naval historians and museums would be interested. So I wouldn\u0027t be in such a hurry to put it back under again. David, if you like I\u0027ll fill out a witness form for you. I doubt if there\u0027s anything aboard that\u0027s not crumbling, but at least you might get a nice bronze plaque in a maritime museum...\"\n \"I want it off my reef,\" the mayor said brusquely. \"I don\u0027t like it being so close to the harbor. What if something exploded?\"\n \"I say we don\u0027t do anything until we think over the possibilities,\" the constable said firmly. \"I don\u0027t know a lot about submarines and nothing about explosives, but moving it could be worse than letting it stay as it is.\"\n Reynard took a handkerchief from a back pocket and dabbed at his glistening cheeks and forehead. \"I wish to God that thing had never come up! It should be rotting like a thousand other sunken ships out there, not hanging on Kiss Bottom like a black leech! God knows I\u0027ve never seen anything like it before!\"\n \"Do you have any idea what boat it might have been?\" Moore asked him.\n \"I didn\u0027t come here until after the war,\" the mayor said defensively. \"I\u0027m not certain what lies in the Abyss, probably all manner of trash. But that thing... I don\u0027t know.\"\n \"The fishermen may be able to tell us something,\" Kip said. \"In the meantime, David, let\u0027s get started on the salvage claim. We\u0027ll go from there.\"\n As the constable and Moore started down the wharf Reynard called after them, \"Just remember, both of you. The boat is as much your responsibility as mine. I hold you both accountable.\"\n \"Understood,\" Kip said.\n The two men left the wharf, moving through the crowd that had streamed down from the village to gawk. They climbed into the constable\u0027s old rust-eaten jeep, which was parked beneath a group of high palms. Kip started the engine and drove along Front Street, through the tangle of fisherman\u0027s clapboard dwellings to the intersection of High Street, which would carry them directly to the heart of the village. They passed a cluster of bars, a few small stores, and drove on toward the Square, where the constable maintained his office.\n A thin, hard-eyed black in dungarees watched the constable\u0027s jeep as it passed along High Street. Then he turned his attention back to the harbor and the object he\u0027d seen driven upon the reef by the currents. Dam\u0027 my eyes if that ain\u0027t it, he said to himself. He lifted the burning stub of a hand-rolled cigarette to his lips and when he did the fingers trembled. That got to be it, got to be. But thass so long ago...thirty-five, forty year...and now this bastard come up from the Abyss. It ain\u0027t right. Ain\u0027t no sense to be made from it. But I see it and by God I know thass it. He flicked the cigarette stub to the ground and stepped on it, then began walking quickly down High Street, past the bars, past the men who sat on porch stoops watching him, past the few easy ladies hanging around trying to coax money. Ordinarily he would have been inclined, especially when he saw that slender high yellow who\u0027d come in from Old Man\u0027s Cay a few days before, stopping to make money enough to get to Trinidad. But there was no time now.\n He walked around to Front Street, past islanders who milled around the wharfs gaping and talking about the boat; he saw the looks in the eyes of a few of the older fishermen, and he saw they knew and did not wish to know just as he did not. He left the wharfs behind, moving by the fishermen\u0027s shanties, kicking at a black dog that came at him fiercely from underneath a house with the paint peeling off. Beyond the village, where the green jungle grew up wild and thick and the birds screeched from perches high in gnarled red bottlebrush trees, and where Front Street turned into a rutted sand path. He continued on, deeper into jungle, hearing the sharp, plaintive cries of the birds. When he came around a thicket of thornbushes he saw the church just ahead.\n It was a small squat white structure with a high, pointed steeple. Front Street ended here. Beyond the church was a cemetery bordered by an ill-kempt picket fence and a chicken coop off to one side. The jungle was creeping in, grasping wood-plank grave markers with long green and brown vine fingers. Painted across the sides and front of the church itself were drawings: faces, numbers in circles, and names: Erzuli, Zoka, Legba. The paint, black and red, had streamed down in thick rivulets, staining the ground. There were two shuttered windows, both closed.\n The black man approached the church door, took hold of the unornamented metal knocker, and rapped sharply on the wood.\n Silence.\n He put his ear to the door, then rapped again.\n \"It Thomas Lacey, rev\u0027rend!\" he said after another moment.\n There was a long pause, the silence unbroken but for the birds and the breeze sweeping through foliage. Then the noise of a bolt sliding back. The door was pulled open. A face - gray goatee, eyes saucer-shaped behind thick wire-rimmed glasses, prominent cheekbones, and jutting chin - appeared in the opening. The eyes moved, slowly, taking the other man in, and then the reverend said in a thick French accent, \"Enter.\"\n Thomas stepped into a bare-floored room with a few long wooden pews. There was an altar at the center and a podium off to one side. He could smell sawdust, dampness, and age within the church, the odor of incense which was almost overpowered by the reek of tobacco. When the reverend shut the door the room was dark save for the light that squeezed through broken places in the window shutters, casting dim shadows about the walls. The reverend slid the bolt home and turned to face the other man. \"What is it you wish?\"\n \"It what come up out of the sea,\" Thomas said in a voice that was almost a whisper, the whispering echoing around the walls, moving like smoke in a box. \"It what been thrown up on Kiss Bottom.\"\n The reverend\u0027s eyes, dark marbles floating in yellowed whites, narrowed a fraction. His tall, almost frail body bent anxiously toward Lacey. \"What are you saying? I don\u0027t have time for you.\"\n \"The white mon, Moore, he go divin\u0027 into the deep water today,\" Thomas said, trying to speak slowly. \"It was him brought it up; it was him raised it. You say it was gone. But right now that thing, that thing be across the reef...\"\n \"Ma foi!\" The reverend was motionless, most of his face in shadow, only the lips moving.\n \"The boat!\" Thomas said, a droplet of spittle catching in the corner of his mouth. \"It come up from the deep water...\"\n \"No,\" the reverend said, very softly.\n \"I seen it with my own eyes. I seen it there!\"\n \"No.\" The voice was still soft, but a commanding note had crept into it, and Thomas Lacey stood looking at him fearfully.\n When Thomas found his voice he said, \"It be under the water a long time. It tore up, twisted, but thass the one.\"\n The reverend stared into the other man\u0027s eyes, examining them, as if he didn\u0027t want to believe what Thomas was saying. \"C\u0027est possible?\" he asked quietly, without expecting an answer. His shoulders sagged forward perceptibly, the sharp blades protruding. \"Non, non.\" A bird screamed outside, in the tangle of a protective perch. \"The white man?\" the reverend asked.\n \"Thass right.\"\n \"Leave me alone. Please. I want you to go away and leave me alone.\"\n Thomas stood where he was, blinking, worried that he had somehow hurt the old man. He wiped his hand across his mouth.\n \"Please,\" the reverend said, turning away.\n Thomas backed toward the door, unbolted it; the reverend was walking down the aisle between the pews, moving toward a doorway on the far side of the podium. He disappeared into the shadows as if consumed by them. Thomas stood there a moment, then he opened the door, squinting from the harsh glare. He left the church quickly, without looking back.\n In his meager, cramped living quarters the reverend lit a candle and watched the flame grow to a tall white point. He reached into a dresser drawer and brought out a locked black box, setting it on top of the dresser. He took a small key from a pocket and unlocked the box. He looked through the contents - a white rabbit\u0027s foot, a vial of dark-colored liquid, grains of something dark in a paper packet, silver-painted candles, a pair of glasses with tinted lenses. Finally he found what he sought. Oui. There.\n A silver case.\n He withdrew it and opened it; inside there was a glass eye - blue - on a coiled silver chain. He put everything away again but the eye, and this he fastened carefully about his neck so that it lay across his chest outside his shirt.\n He stepped forward, cupped a hand about the flame, and blew it out.\n Standing in the thick darkness, he asked in French, very softly, as if speaking to someone standing just beside him, \"What do you see? What do you see?\" \n","sourceLink":"https://allnovel.net/the-night-boat/page-4.html","bookId":2475,"book":{"id":2475,"title":"The Night Boat","description":"Storyline: \n A German submarine is sunk during World War Two. How do you turn this gimmick into a horror novel? Which direction do you go? What\u0027s the creep factor? Robert McCammon, who took the premise of vampires in Los Angeles to its natural conclusion by having half the city turned into vampires and unleashed an Allied werewolf loose on a secret Nazi base, can be counted on to accomplish the task. The raising of the Nazi submarine is central to McCammon\u0027s story which delivers surprising twists and bloody confrontations. The U-boat was sunk off a Caribbean island, but under circumstances that leave it largely intact until a diver accidentally dislodges an unexploded depth charge which lets the sand-covered sub bob to the surface. This could result in a nice sale to museum. But soon, it\u0027s decided the sub would be better off back in the Big Drink. The problem is, see, the crew is not dead, thanks to a voodoo curse.\n \n","cover":"https://allnovel.net/images/the-night-boat.jpg","author":"Robert McCammon","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-night-boat.html","creation":"Oct 5, 2019 8:58:46 AM","modification":"Oct 5, 2019 4:48:30 PM"}}
