{"id":38168,"no":9,"title":"IX IN ARTICULO MORTIS","content":"THE recent work on “Death and its Mystery,”[2] by Camille Flammarion, the eminent astronomer, cannot fail to be of supreme interest. The second volume of the series, entitled “At the Moment of Death,” will more especially appeal to medical men, and it is with this volume and with the reminiscences it has aroused that I am at present concerned. About the act or process of dying there is no mystery. The pathologist can explain precisely how death comes to pass, while the physiologist can describe the exact physical and chemical processes that ensue when a living thing ceases to live. Furthermore, he can demonstrate how the material of the body is finally resolved into the elements from which it was formed. The mystery begins in the moment of death, and that mystery has engaged the thoughts and imaginations of men since the dawn of human existence. It was probably the first problem that158 presented itself to the inquisitive and ingenious mind, and it may be that it will be the last to occupy it. Beyond the barrier of death is “the undiscovered country” where a kindly light falls upon Elysian Fields or happy hunting grounds, or fills with splendour the streets of an eternal city. To some, on the other hand, there is no such country but only an impenetrable void, a blank, a mere ceasing to be. Certain who read these works of the learned astronomer may perhaps feel that he has thrown light upon the great mystery. Others may affirm that he leaves that mystery still unillumined and wholly unsolved, while others again may think that he makes the mystery still more mysterious and more complex. M. Flammarion deals with the manifestations of the dying, with agencies set in action by the dying, and with events which attend upon the moment of death. He affirms that in addition to the physical body there is an astral body or “psychic element” which is “imponderable and gifted with special, intrinsic faculties, capable of functioning apart from the physical organism, and of manifesting itself at a distance.” This leads to the theory of bilocation where the actual body (at the point of death) may be in one place and the astral body in another. It is this159 power of bilocation which explains the phantasms and apparitions of which the book gives many detailed records. These apparitions may be objective—that is to say, may be visible to several people at the same time—or they may be subjective or capable of being perceived only by the subject or seer. “These apparitions,” the author states, “are projections emanating from the soul of the dying.” They are astral bodies detached for the moment from the physical body of which they are part. “It is,” the author continues, “at the hour of death that transmissions of images and of sensations are most frequent” (p. 108). These phantasms appear, either in dreams or in broad daylight, to the friends of dying persons. They may announce in words, “I am dying,” or “I am dead.” They may merely appear with signs upon their faces of alarm or of impending dissolution. They may appear as bodies lying dead upon a couch or in a coffin. They may predict the hour of their death, but more usually their appearance coincides with the exact moment at which their physical bodies ceased to exist. M. Flammarion gives numerous instances of these apparitions seen under such varying circumstances as have been named. In certain examples the phantom appears to have substance and to be160 capable of making its presence actually felt. Thus in one case the subject saw the apparition of her sister who was dying in a place far away, and at the same time “felt a hand brush lightly against the sheets.” The subject, when questioned, said: “No, no, it wasn’t a dream! I heard her steps; they made the floor creak. I’m sure of it; I wasn’t dreaming; she came; I saw her” (p. 345). It may be further noted that persons who announce their deaths to others by visions or by spoken words may at the time of such warning be in perfect health. Moreover, the apparition may announce to the dreamer the exact date of the speaker’s own death many days in advance. In one such instance a man—then in sound health—appeared to a friend in a dream on August 2 and informed him that he (the subject of the apparition) would die on August 15. The event happened as foretold. An instance which involved an interval of years is recorded by Robert Browning the poet. Seven years after his wife’s death she appeared in a dream to her sister, Miss Arabel Barrett. Miss Barrett asked the apparition, “When will the day come on which we shall be reunited?” The dead woman answered, “My dear, in five years.” Five years, lacking a161 month, after this vision, Miss Barrett died of heart disease. In messages or warnings from the dying M. Flammarion affirms that telepathy (or the transmission of thought to a distance) plays an important part. More than this, he says: “It is beyond doubt that at the moment of death a subtle shock, unknown in its nature, at times affects those at a distance who are connected with the dying person in some way. This connexion is not always that of sympathy.” The method in which telepathy acts is explained by the author in the following words: “It is admitted that a kind of radiation emanates from the dying person’s brain, from his spirit, still in his body, and is dispersed into space in ether waves—successive, spherical waves, like those of sound in the atmosphere. When this wave, this emanation, this effluvium, comes into contact with a brain attuned to receive it, as in the case of a wireless-telegraph apparatus, the brain comprehends it—feels, hears, sees” (p. 284). The manifestations produced by these passages between the living and those who are on the point of death are very varied. They may take the form of warnings, predictions or notifications of death. They may be conveyed vast distances and are162 usually received at the very moment at which the body from which they emanate ceases to be. Warnings or announcements may be conveyed by voices or by visions of various kinds. The voices may be recognized as those of the dying, or the actual death scene, “visioned from a distance,” may be presented complete in every detail. Some of the manifestations may take a physical form, such as knockings upon doors and windows, the sound of footsteps or of gliding feet, the moving of articles of furniture, the falling of portraits from the wall, the opening of doors, the passage of a gust of wind. Many of the phenomena appear to me to be hardly worthy of being recorded. As illustrations I may quote the movement of a hat on a hat peg used by the deceased, the violent shaking of an iron fender to announce a daughter’s death, the fact that about the time of a relative’s decease a table became “split completely along its whole length,” while on another like occasion a gas jet went out in a room in which a party was sitting, playing cards. The following circumstance will not commend itself to the reasonable as one that was dependent upon a supernatural agency. “My grandmother,” a student writes, “died in 1913. At the hour of163 her death the clock which hung in her room stopped, and no one could make it go again. Some years afterwards her son died, and the very day of his death the clock again began to go without anyone having touched it.” “It is strange,” comments M. Flammarion, “that the spirit of someone dying or dead should be able to stop a clock or start it again.” Assuredly it is more than strange. The same comment might apply to the following testimony provided by a gardener in Lunéville. “A friend, when one day cleaning vegetables, seated in a chair, was struck on the knee by a turnip which was on the ground, and heard at the same instant two cries: ‘Mother! Mother!’ That same day her son, a soldier, was dying in our colony of Guiana; she did not hear of his death until very much later.” M. Flammarion’s work is probably the most orderly, temperate and exact that has appeared on the subject of death from the point of view of the spiritualist. It has been the work of many years and its conclusions are based upon hundreds of reports, letters and declarations collected by the writer. To many readers the book will, no doubt, be convincing and inspiring, while possibly to a larger number of people the author’s position will appear to be untenable, and much of the evidence164 upon which his conclusions are based to be either incredible or impossible. With those who may hold this latter opinion I am entirely in accord. Many of the so-called manifestations, such as the spirit visitants, the visions and the voices, can be as fitly claimed to be illusions and hallucinations as affirmed to be due to the action of the psychic element or astral body. The tricks of the senses are innumerable. The imagination, stimulated and intensified, can effect strange things in sensitive subjects; while, on the other hand, the powers of self-deception are almost beyond belief, as the experience of any physician will attest. Belief in the supernatural and the miraculous has a fascination for many minds, and especially for minds of not too stable an order. Such persons seem to prefer a transcendental explanation to one that is commonplace. Apparitions are not apt to appear to those who are healthy both in body and in mind. Dreams, it will be admitted by all, are more often due to indigestion than to a supernatural or a spiritual agency. Voices are heard and non-existing things are seen by those whose minds are deranged, and it must be allowed that not a few of the men and women upon whose evidence M. Flammarion depends165 exhibit a degree of emotional excitement or exaltation which borders on the abnormal. I think, moreover, it would not be unjust to suggest that certain of the narratives are exaggerated and that an element of invention is possible and, indeed, probable in many of them. There is an impression also that some of the circumstances detailed have been misinterpreted or misapplied or have been modified by events which have followed later and to which they have been adapted as an afterthought. Above all I am reluctant to believe that the dying, in the solemn and supreme moment of passing away from the earth, can be occupied by the trivialities—and, indeed, I would say by the paltry tricks—which are accredited to their action in this book. It is only fair to point out that the volume now discussed is written by an eminent man of science who has been trained all his life in methods of precision, in the judicial examination of reported facts and in the close scrutiny of evidence. Further it may be said that the terms “incredible” and “impossible” would have been applied a few years ago to any account of the telephone or of wireless telegraphy, while the same expressions would assuredly be employed by a medical man when told, not so long since, that there was a ray capable166 of making a human body so transparent as to render visible not only the bones but the details of their internal construction. In common with others who have been for many years on the staff of a large hospital, I have seen much of death and have heard even more from those who have been in attendance on the dying. In this experience of a lifetime I have never met with a single circumstance which would confirm or support the propositions advanced by M. Flammarion. This is obviously no argument. It is merely a record of negative experience. The only two events, within my personal knowledge, which bear even remotely upon the present subject are the following. I was, as a youth, on a walking tour in the south of England with a cousin. We put up one night at a certain inn. In the morning my companion came down to breakfast much excited and perturbed. He declared that his father was dead, that in a vivid dream he had seen him stretched out dead upon the couch in his familiar bedroom at home. He had awakened suddenly and noted that the hour was 2 A.M. That his father had expired at that moment he was assured, so assured that he proposed to return home at once, since his mother was alone. Inasmuch as the journey167 would have occupied a whole day, I suggested that, before starting, he should telegraph and seek news of his father. With great reluctance he consented to this course and the telegram was dispatched. A reply was received in due course. It was from the father himself expressing surprise at the inquiry and stating that he was never better in his life. Nothing, it transpired, had disturbed the father’s rest at 2 A.M. on this particular night. Nothing untoward happened. My uncle lived for many years, and finally died one afternoon, and not, therefore, at 2 A.M. The other incident is associated with an actual death and with a strange announcement, but the announcement is not to be explained by any of the theories propounded by M. Flammarion. The facts are these. I was on a steamship which was making a passage along that coast known in old days as the Spanish Main. We put in at Colon, and remained there for about a day and a half. I took advantage of this break in the voyage to cross the Isthmus by train to Panama. The names of those who were travelling by the train had been telegraphed to that city, which will explain how it came about that on reaching the station I was accosted by one of the medical officers of the famous American hospital of the168 place. He begged me to see with him a patient under his care. The sick man was an Englishman who was travelling for pleasure, who was quite alone and who had been taken ill shortly after his arrival on the Pacific. He was the only Englishman, he said, on that side of the Isthmus. I found the gentleman in a private ward. He was a stranger to me, was very gravely ill, but still perfectly conscious. I had nothing fresh to suggest in the way of treatment. The case was obviously hopeless, and we agreed that his life could not be extended beyond a few days and certainly not for a week. It was a satisfaction to feel that the patient was as well cared for as if he had been in his own home in England. I returned to Colon. Travelling with me was a retired general of the Indian Army. He had remained at Colon during my absence. I told him my experience. He did not know the patient even by name, but was much distressed at the thought of a fellow-countryman dying alone in this somewhat remote part of the world. This idea, I noticed, impressed him greatly. Two days after my return from Panama we were on the high seas, having touched at no port since leaving Colon. On the third day after my169 visit to the hospital the general made a curious communication to me. The hour for lunch on the steamer was 12.15. My friend, as he sat down to the table, said abruptly, “Your patient at Panama is dead. He has just died. He died at 12 o’clock.” I naturally asked how he had acquired this knowledge, since we had called nowhere, there was no wireless installation on the ship, and we had received no message from any passing vessel. Apart from all this was the question of time, for the death, he maintained, had only just occurred. He replied, “I cannot say. I was not even thinking of the poor man. I only know that as the ship’s bell was striking twelve I was suddenly aware that he had, at that moment, died.” The general, I may say, was a man of sturdy common sense who had no belief in the supernatural, nor in emanations from the dying, nor in warnings, nor in what he called generally “all that nonsense.” Telepathy—in which also he did not believe—was out of the question, since he and the dead man were entirely unknown to one another. My friend was merely aware that the news had reached him. It was useless for me to say that I did not think the patient could have died so soon, for the general remained unmoved. He only knew that170 the man was dead whether I expected the event or whether I did not. When we reached Trinidad I proposed to go ashore to ascertain if any news had arrived of the death at Panama. The general said it was waste of time. The man was dead, and had died at noon. Nevertheless, I landed and found that a telegram had appeared in which the death of this lonely gentleman was noted as having taken place on the day I have named. The hour of his death was not mentioned, but on my return to England I was shown by his relatives the actual cablegram which had conveyed to them the news. It stated that he had died at Panama on that particular day at twelve o’clock noon. No coincidence could have been more precise. The general, to whom the event was as mysterious as it was unique in his experience, ventured one comment. He said that during his long residence in India he had heard rumours of the transmission of news from natives in one part of India to natives in another, which reports—if true—could not be explained by the feats of runners nor by any system of signalling, since the distances traversed were often hundreds of miles. We were both aware of the rumour, current at the time, that the news of the defeat171 at Colenso was known in a certain Indian bazaar a few hours after the guns had ceased firing. This, we agreed, was assuredly an example of loose babble—started by a native who hoped to hear of the failure of the British—and that this gossip had become, by repetition, converted into a prophecy after the occurrence. For my own part I must regard the Panama incident as nothing but a remarkable coincidence of thought and event. My friend was inclined to regard it as an example of the sudden transmission of news of the kind suggested by his Indian experience. Why he of all people should have been the recipient of the message was beyond his speculation, since he had no more concern with the happenings at Panama than had the captain of the ship, to whom I had also spoken of the occurrence. A further subject of some interest, suggested by M. Flammarion’s work, may be touched upon. In the contemplation of the mystery of death it may be reasonable to conjecture that at the moment of dying, or in the first moment after death, the great secret would be, in whole or in part, revealed. There are those who believe that after death there is merely the void of nonexistence, the impenetrable and eternal night of172 nothingness. Others conceive the spirit of the dead as wandering, somewhere and somehow, beyond the limits of the world. It is this belief which has induced many a mother, after the death of her child, to leave the cottage door open and to put a light in the window with some hope that the wandering feet might find a way home. Others, again, hold to the conviction that those who die pass at once into a new state of existence, the conditions of which vary according to the faith of the believer. In the face of the great mystery it would be thought that those who have returned to life after having been, for an appreciable time, apparently dead might have gained some insight into the unknown that lies beyond. Cases of such recovery are not uncommon, and not a few must have come within the experience of most medical men of large practice. I have watched certain of such cases with much interest. Among them the most pronounced example of apparent lifelessness was afforded by the following occasion. A middle-aged man, in good general health, was brought into the theatre of the London Hospital to undergo an operation of a moderate degree of severity. The administration of an an?sthetic was commenced, but long before the173 moment for operating arrived the man collapsed and appeared to be dead. His pulse had stopped, or at least no pulse could be detected, the heartbeat could not be felt, he had ceased to breathe, all traces of sensation had vanished, and his countenance was the countenance of the dead. Artificial respiration was at once employed, injections of various kinds were given, electricity was made extended use of, while the heat of the body was maintained by hot bottles liberally disposed. The man remained without evidence of life for a period so long that it seemed to be impossible that he could be other than dead. In the intense anxiety that prevailed, and in the excitement aroused, I have no doubt that this period of time was exaggerated and that seconds might have been counted as minutes; but it represented, in my own experience, the longest stretch of time during which a patient has remained apparently without life. Feeble indications of respiration returned and a flutter at the wrist could again be felt, but it was long before the man was well enough to be moved back to the ward, the operation having been, of course, abandoned. I determined to watch the recovery of consciousness174 in this instance, for here was a man who had been so far dead that, for a period almost incredible to believe, he had been without the signs and evidences of life. If life be indicated by certain manifestations, he had ceased to live. He was, without question, apparently dead. It seemed to me that this man must have penetrated so far into the Valley of the Shadow of Death that he should have seen something of what was beyond, some part, at least, of the way, some trace of a path, some sight of a country. The door that separates life from death was in his case surely opening. Had he no glimpse as it stood ajar? He became conscious very slowly. He looked at me, but I evidently conveyed no meaning to his mind. He seemed gradually to take in the details of the ward, and at last his eye fell upon the nurse. He recognized her, and after some little time said, with a smile, “Nurse, you never told me what you heard at the music hall last night.” I questioned him later as to any experience he may have had while in the operating theatre. He replied that, except for the first unpleasantness of breathing chloroform, he remembered nothing. He had dreamed nothing. At a recent meeting (1922) of the British Medical Association at Glasgow Sir William175 MacEwen reports an even more remarkable case of a man who was brought into the hospital as “dead.” He had ceased to breathe before admission. An operation upon the brain was performed without the use of an an?sthetic of any kind. During the procedure artificial respiration was maintained. The man recovered consciousness and, looking round with amazement at the operating theatre and the strange gathering of surgeons, dressers and nurses, broke his death-like silence by exclaiming, “What’s all this fuss about?” It is evident from cases such as these that no light upon the mystery is likely to be shed by the testimony of those who have even advanced so far as to reach at least the borderland of the “undiscovered country.” I might conclude this fragment with some comment on the Fear of Death. The dread of death is an instinct common to all humanity. Its counterpart is the instinct of self-preservation, the resolve to live. It is not concerned with the question of physical pain or distress, but is the fear of extinction, a dread of leaving the world, with its loves, its friendships and its cherished individual affairs, with perhaps hopes unrealized and projects incomplete. It is a dread of which the young know little. To them life is eternal. 176 The adventure is before them. Death and old age are as far away as the blue haze of the horizon. It is about middle age that the realization dawns upon men that life does not last for ever and that things must come to an end. As the past grows vaster and more distant and the future lessens to a mere span, the dread of death diminishes, so that in extreme old age it may be actually welcomed. Quite apart from this natural and instinctive attitude of mind there is with many a poignant fear of death itself, of the actual act of dying and of the terror and suffering that may be thereby involved. This fear is ill-founded. The last moments of life are more distressing to witness than to endure. What is termed “the agony of death” concerns the watcher by the bedside rather than the being who is the subject of pity. A last illness may be long, wearisome and painful, but the closing moments of it are, as a rule, free from suffering. There may appear to be a terrible struggle at the end, but of this struggle the subject is unconscious. It is the onlooker who bears the misery of it. To the subject there is merely a moment— “When something like a white wave of the sea Breaks o’er the brain and buries us in sleep.” 177 Death is often sudden, may often come during sleep, or may approach so gradually as to be almost unperceived. Those who resent the drawbacks of old age may take some consolation from the fact that the longer a man lives the easier he dies. A medical friend of mine had among his patients a very old couple who, having few remaining interests in the world, had taken up the study and arrangement of their health as a kind of hobby or diversion. To them the subject was like a game of “Patience,” and was treated in somewhat the same way. They had made an arrangement with the doctor that he should look in and see them every morning. He would find them, in the winter, in a cosy, old-fashioned room, sitting round the fire in two spacious arm-chairs which were precisely alike and were precisely placed, one on the right hand and one on the left. The old lady, with a bright ribbon in her lace cap and a shawl around her shoulders, would generally have some knitting on her knees, while the old gentleman, in a black biretta, would be fumbling with a newspaper and a pair of horn spectacles. The doctor’s conversation every morning was, of necessity, monotonous. He would listen to accounts of the food consumed, of the medicine taken and of the quantity of sleep secured, just178 as he would listen to the details of a game of “Patience.” Now and then there would be some startling “move,” some such adventure as a walk to the garden gate or the bold act of sitting for an hour at the open window. After having received this report he would compliment the lady on her knitting and on the singing of her canary and would discuss with the gentleman such items of news as he had read in the paper. On one morning visit he found them as usual. The wife was asleep, with her spectacles still in place and her hands folded over her knitting. The canary was full of song. The midday beef tea was warming on the hob. The old gentleman, having dealt with his health, became very heated on the subject of certain grievances, such as the noise of the church bells and the unseemly sounds which issued from the village inn. He characterized these and like disturbances of the peace as “outrages which were a disgrace to the country.” After he had made his denunciation he said he felt better. “Your wife, I see, is asleep,” said the doctor. “Yes,” replied the old man; “she has been asleep, I am glad to say, for quite two hours, because the poor dear had a bad night last night.” The doctor crossed the room to look at179 the old lady. She was dead, and had, indeed, been dead for two hours. Such may be the last moments of the very old. Quite commonly the actual instant of death is preceded, for hours or days, by total unconsciousness. In other instances a state of semi-consciousness may exist up to almost the last moment of life. It is a dreamy condition, free of all anxiety, a state of twilight when the familiar landscape of the world is becoming very indistinct. In this penumbra friends are recognized, automatic acts are performed, and remarks are uttered which show, or seem to show, both purpose and reason. It is, however, so hazy a mental mood that could the individual return to life again no recollection of the period would, I think, survive. It is a condition not only free from uneasiness and from any suspicion of alarm, but is one suggestive even of content. I was with a friend of mine—a solicitor—at the moment of his death. Although pulseless and rapidly sinking, he was conscious, and in the quite happy condition just described. I suggested that I should rearrange his pillows and put him in a more comfortable position. He replied, “Don’t trouble, my dear fellow; a lawyer is comfortable in any position.” After that he never spoke again. 180 In connexion with this semi-somnolent state it is interesting to note how certain traits of character which have been dominant during life may still survive and assert themselves—it may be automatically—in those whose general consciousness is fading away in the haze of death. The persistence of this ruling passion or phase of mind was illustrated during the last moments of an eminent literary man at whose death-bed I was present. This friend of mine had attained a position of great prominence as a journalist. He had commenced his career as a reporter, and the reporter’s spirit never ceased to mark the intellectual activities of his later life. He was always seeking for information, for news, for some matter of interest, something to report. His conversation, as one acquaintance said, consisted largely of questions. He always wanted to know. When he was in extremis, but still capable of recognizing those around him, the dire sound of rattling in his throat commenced. He indicated that he wanted to speak to me. I went to his bedside. He said, in what little voice remained, “Tell me: Is that the death rattle?” I replied that it was. “Thank you,” he said, with a faint shadow of a smile; “I thought so.”","sourceLink":"http://novel.tingroom.com/duanpian/3308/90426.html","bookId":418,"book":{"id":418,"title":"The Elephant Man and Other Reminiscences","description":"简介： IN the Mile End Road, opposite to the London Hospital, there was (and possibly still is) a line of small shops. Among them was a vacant greengrocers which was to let. The whole of the front of the shop, with the exception of the door, was hidden by a...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3308","creation":"Aug 1, 2019 12:18:45 AM","modification":"Aug 1, 2019 12:18:45 AM"}}
