{"id":27175,"no":17,"title":"CHAPTER XVII A STRANGE BOY SCOUT","content":"Marjorie and Frieda began to feel very tired and uncomfortable after they had walked several miles in their wet clothing. Had the sun been out to dry them, or had they been familiar with the road, it would not have been so difficult to go on. Their pace became slower and slower, each girl making a desperate effort to keep cheerful for the sake of the other. But soon they began to look eagerly for a house where they could get food and have a place to rest. They knew that they dared not lie down upon the ground, for they would not only be in danger of cold, but also of discovery by their enemy. So they pressed valiantly on. “Anyway, it’s better than staying forever at that prison!” commented Marjorie. Her feet were particularly wet, and her shoes heavy. “I should say so! But wasn’t the old man awful? Marj, don’t you hope we never are greedy like that when we get old?” “You bet! But do you know, I felt sorry for his poor wife. Isn’t it funny, Frieda, to think how differently a man may turn out, after he’s been married159 a long time? I don’t think Mrs. Higgins loves him now, but probably she did when they were young.” “I suppose so!” sighed the other girl, much more interested in their own problem than in that of their former captors. All the while she was keeping a sharp look-out among the trees, hoping to spy a house, or at least a forsaken barn where they might find protection. It was not long afterward that she was rewarded for her diligence. “Look, Marj!” she cried. “Isn’t that a house—or something?” And suddenly the girls realized that the night was over, that the first grey light of dawn was upon them. Looking in the direction her companion indicated, Marjorie too distinguished a grey, shadowy outline in the distance. Her heart leaped for joy; there was a chance of a rest at last! “Don’t you wish we had a watch?” she said; “or even our maps?” “Anyhow, we know it’s Monday morning,” said Frieda. “And we ought to get to Silvertown today—tonight, rather. For walking is as fast as canoeing.” By this time they were close enough to the structure to see that it was a rather tumble-down farm-house. The boards of the porch were rotting, and the woodwork everywhere needed paint. Two or three chairs on the porch made the girls certain of the fact that the place was inhabited. The win160dows were all wide open, but there was not a sign of a screen. Obviously, this was not so prosperous a farm as the one they had just left. But Marjorie and Frieda did not mind; they were so weary that a great sense of thankfulness at the promise of a rest was the only feeling that possessed them. “How much of the truth shall we tell?” asked Frieda, as they approached the porch. “Only that we are Girl Scouts, who have lost our party, and had our canoe stolen,” answered Marjorie, promptly. “And that we have no money, but when we get to Silvertown, we’ll send it to pay for a bed and a meal!” With no attempt at quiet, they walked boldly up the porch steps, and knocked loudly. They had to wait only a minute or two, until a middle-aged woman in a soiled wrapper came to the door. Her hair was already arranged in a knot; it was evident that she had been occupied in the process of dressing when she heard the knock. Marjorie told the story as briefly as possible, leaving out the part about their captivity. “Yes, sure!” said the woman, in answer to their request. “I’ll fix you up a cup of coffee, and you can go right to bed. Then I’ll have a nice breakfast when you wake up.” She proceeded to fix up her own bed for the girls and loaned them night dresses so that she might hang their wet clothing out to dry. The girls drank161 their coffee gratefully, and slipped into the borrowed garments, too tired even to laugh at the absurd appearance they made. They were asleep in no time. It was noon when they finally awakened. Frieda jumped out, surprised at the brightness of the sun. “Oh, Marj! We’ll have to hurry!” she cried; “or else we won’t get there tonight. Maybe the woman, whatever her name is, can tell us how many miles away Silvertown is.” She went to the door and called down the stairs, wishing that she knew the woman’s name. In a second, however, she received an answer, and Mrs. Brown appeared at the foot of the stairway. “Have a good nap?” she asked. “Fine, thanks,” replied Frieda. “But it’s late, and we want to get started. Are our clothes dry?” “Good and dry!” answered Mrs. Brown; “and I pressed your dresses fer you!” “Oh, thanks!” called Marjorie, gratefully. “Will you bring them up, Mrs.——?” “Brown,” supplied the woman. “I’m a widder, and I live with me brother, Sam Cullen. You’ll meet him when you come down.” A few minutes later she appeared with the clothing, all thoroughly dry, and, as she had said, the suits both carefully pressed. In high spirits, the girls dressed quickly. When they went downstairs they were surprised at the darkness of the house. Then, looking around,162 they saw that every window was tight shut, and the shutters closed and bolted from the outside. Two or three oil lamps were burning in the hall, kitchen and dining room. “Why so dark?” asked Marjorie, as Mrs. Brown motioned her to a seat at the table. “Well, we ain’t got no nettin’ and the flies gets in after the vittals. It’s dreadful to be poor!” “Mrs. Brown, how much shall we owe you for our visit?” asked Marjorie, changing the subject. “And will it be all right to send a money order?” “Oh, don’t worry about that!” said the older woman. “Yer welcome to what we’ve got—it ain’t much. But I don’t think you’d better start out today. Why not rest and wait till termorrer mornin’ early? If you start now, you’ve got another night to spend in the woods, and I reckon you won’t find another place to house you like this.” “Thanks ever so much,” replied Marjorie; “but we don’t want to miss our party any longer than necessary. About how far is it to Silvertown?” “Dunno exactly—’bout ten miles, I reckon.” She really knew it was not nearly so far, but she thought that if she could persuade the girls to stay it would be so much easier than forcing them. The girls ate their breakfast, which, though good, and well cooked, was not nearly so nice as the food Mrs. Higgins had given them. As they ate they talked the situation over. They thought that it was163 about one o’clock, but having no watches, they were amazed to find it quarter of three. This deception was merely another part of Mrs. Brown’s scheme. “Frieda, I don’t believe we could go ten miles before dark, even in our dry clothing,” said Marjorie; “and I don’t care about the prospects of another night in the woods by ourselves, with no tent, or food. If we only had some money, we could hire a machine!” “Where would you hire it from?” put in Mrs. Brown, rather sharply. “Besley’s the nearest town, and it’s five miles off! Of course,” she added; “if I had the money, you’d be welcome to it. But I ain’t got no more than fifty cents to my name.” Marjorie sighed, and settled herself to the inevitable. They decided to stay. Mrs. Brown, although delighted with the decision, was nevertheless in a quandary. She would have to let the girls go out; but could she trust them to return? She thought how angry her brother would be if she let them escape, and how roughly he might treat her afterwards for it. Still, she decided to take the risk. “And what would you like to do this afternoon?” she inquired, politely. “Take a walk?” The girls were delighted with this suggestion, for it reminded them of their freedom, but they did not wish to act upon it. They were still weary, and164 their feet were sore; the prospect of rest was alluring. “No, thanks, I think it would be nicer to stay on the porch, and take it easy,” said Marjorie. “Have you any books, Mrs. Brown?” “No books,” she replied; “but a travellin’ man left me some sample copies of magazines here a month or two ago. Want ’em?” “Yes, indeed!” answered Marjorie; and Mrs. Brown promptly brought them. All the afternoon the girls sat in the rickety, yet comfortable rocking chairs on the porch, and read the stories in the magazines. If they had not reached the goal of their desire, they were at least content. Supper was ready about seven o’clock—by real time; for Mrs. Brown had switched the clock back while they were reading—and she gave them a very good meal. The girls enjoyed it immensely; and after supper they helped her with the dishes, walked around the farm with her brother, and went early to bed, with the promise of being awakened at five the next morning. Their disappointment came, however, when Frieda awoke to find it broad daylight. She had no way of telling time, but she knew by the sun that it was long after five o’clock. “And today’s Tuesday!” she wailed. “Marj, we165 were fools to stay! The whole world is against us, I believe. Oh, do hurry!” The girls dressed quickly and descended to the darkness below. “Oh, what time is it, Mrs. Brown, and why didn’t you call us?” demanded Marjorie, in distress. “It’s half past seven,” replied the woman. “But you need not get so impatient, for yer not a leavin’ this here house today!” “What do you mean?” asked Marjorie, in amazement. A quick, sudden pang of fear seized her: were they in a prison again? “I mean jest what I said! There was a man here to say that you are a runaway, and your father’s offered a thousand dollars to whoever finds you, and the man’s over to Beasley’s tryin’ to get your father on the telephone. So, if my brother and I kin keep you here, the old man’s goin’ fifty-fifty on the reward!” Marjorie sank into a chair, overcome by the sense of the relentless fate that seemed to be pursuing and overtaking her. It was like a hideous dream: they were caught in a queer, unreal sort of net, from which there was no escape. She wondered whether the old man who had first announced the idea were not crazy; indeed, she felt that this must be the explanation of the matter. And yet he seemed to be very sane in all other respects. She remembered reading of other demented166 persons—rational on all but one subject, and obsessed by a certain idea. Evidently old Higgins had gone crazy on the subject of gold, and his diseased, avaricious mind had imagined this contingency. But why, oh, why, should she—poor, innocent Marjorie Wilkinson—be the victim? Especially when it meant so much to her to get to Silvertown by Wednesday, and to be in time to take part in the races! In vain she protested that the facts were not true; that her father and mother knew exactly where she was and had given their full consent to the trip; but the woman only shook her head. “It will not be for long. The old man promised me he’d be back tonight, no matter what happened. So it means only one more day. You can start early t’morrer mornin’.” “But that will be too late!” cried Marjorie, bursting into tears. “Oh, you are too cruel! You’re not human beings; you’re beasts! And I hope——” “Marj, come upstairs,” interrupted Frieda. She did not wish her companion to say anything for which she might later be sorry. “I’ll bring your breakfast up,” said Mrs. Brown, calmly. “And you’d better stay upstairs, it’s cooler. You can have the windows open there—there’s no danger of you gettin’ out so high up.” With Frieda’s arm around her, Marjorie stumbled out of the room and up the stairs. Frieda was the stronger now, of the two, but it was only because167 the thing did not touch her so deeply as it did her companion. Indeed, she suffered more for Marjorie’s sake than for her own. The canoe race meant little to her, and the house-party less. The canoe trip had been the main event to her; she even shrank a little shyly at the idea of such an exclusive resort and so gorgeous a house. She feared that she might say and do the wrong things, and she dreaded Ruth’s silent ridicule. But she realized how much it all meant to Marjorie. Marjorie sank upon the bed, disconsolately refusing to eat. Frieda, however, partook of the breakfast, and then went over to examine the windows. Perhaps there might be another lattice. But this old tumble-down house boasted of no such decoration, and if there had been one, it would no doubt have been so rotten that an attempt to descend by it would have been fatal. She sighed and turned away. “We can see the creek plainly from this window,” she said; “let’s sit by it. Maybe somebody might come along, and we could call for help.” “We wouldn’t dare—they’d hear us and persecute us all the more,” objected Marjorie. “If the scouts came, we could semaphore to them,” remarked Frieda. “They’d be near enough to read it.” “If they came, Frieda!” repeated Marjorie, sarcastically. Nevertheless, she pulled a chair over to168 the window, and sat down. For some minutes she gazed idly out of the window, watching the patches of light made by the bright morning sun flickering on the water. The ripple of the current, as the creek passed over the stones, was the only sound that broke the stillness on that summer morning. “You can’t see very far, though,” she observed; “there must be a bend up there.” She got up from her chair and leaned against the narrow frame, in her endeavor to see as far as she could. For a moment the motion of the wind in the foliage deceived her; she thought she saw something coming, only, however, to find herself a minute later, disappointed. She was still leaning in this position when suddenly her attitude became tense, alert, eager! Was she to be deluded again? She waited in breathless anticipation. From around the bend, she distinguished a narrow birch-bark canoe glide into view! “Frieda!” gasped the excited girl, “somebody’s coming!” “Sh!” warned the other, rushing towards the window. “Don’t scream! Oh, how shall we get their attention?” she looked wildly about the room for inspiration. “There—get that red table-cover, and I’ll wave it!” commanded Marjorie. “Oh, Frieda, look—he has a uniform! It’s khaki color! Oh, if it—if it could be—Frieda, It’s a Boy Scout!” 169 No discovery could possibly have brought a greater thrill to these desolate prisoners. For surely this meant delivery from captivity, freedom! If they could only attract his attention! The canoe came nearer; they watched it in breathless suspense, both leaning far out of the window, and waving their arms, their red table-cover, even the ties of their uniforms. Fortunately, being a canoeist, the stranger approached them face to face; had he been rowing a boat, all their hopes of securing his attention would have been lost. In spite of their wild attempts to attract his notice, the boy continued to look into the water until he advanced to within twenty yards of the house. But suddenly from the tree near by sounded the clear call of a king-fisher; and instantly he looked up toward the house. He missed the bird, but caught sight of the two girls, frantically signalling. Frieda instantly put her finger to her lips, while Marjorie spelled out the word HELP in semaphore. The boy stopped paddling, and wrinkled his forehead in uncertainty. What was the meaning of this? Had he read the message aright? Assured now of the scout’s interest, Marjorie began to send a longer message, to explain her meaning at length. “We are two Girl Scouts held prisoners here. Please bring help. Not a word.” She repeated the entire message and waited170 breathlessly. Then, to her infinite joy, she watched him signal back. “Give me one hour! Courage!” he flashed, and, turning around, he returned whence he came. With a great gasp of joy the girls sank to the floor exhausted.","sourceLink":"http://novel.tingroom.com/jingdian/1910/54963.html","bookId":917,"book":{"id":917,"title":"The Girl Scouts\u0027 Canoe Trip","description":"简介： At a peaceful spot along the Silver Creek, where the water was so still that it seemed to belong rather to a lake than to a stream, five new canoes lay upturned on the shore. Their long, graceful curves, their shining new paint and varnish, their pic...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1910","creation":"Aug 1, 2019 12:23:52 AM","modification":"Aug 1, 2019 12:23:52 AM"}}
