{"id":43549,"no":6,"title":"Chapter IV.","content":"1700-1755. COLLISION OF THE RIVAL COLONIES. The people of the northern English colonies had learned to regard their Canadian neighbors with the bitterest enmity. With them, the very name of Canada called up horrible recollections and ghastly images: the midnight massacre of Schenectady, and the desolation of many a New England hamlet; blazing dwellings and reeking scalps; and children snatched from their mothers’ arms, to be immured in convents and trained up in the abominations of Popery. To the sons of the Puritans, their enemy was doubly odious. They hated him as a Frenchman, and they hated him as a Papist. Hitherto he had waged his murderous warfare from a distance, wasting their settlements with rapid onsets, fierce and transient as a summer storm; but now, with enterprising audacity, he was intrenching himself on their very borders. The English hunter, in the lonely wilderness of Vermont, as by the warm glow of sunset he piled the spruce boughs for his woodland bed, started as a deep, low sound struck faintly on his ear, the evening gun of Fort Frederic, booming over lake and forest. The erection of this fort, better known among the English as Crown Point, was a piece of daring encroachment which justly kindled resentment in the northern colonies. But it was not here that the immediate occasion of a final rupture was to arise. By an article of the treaty of Utrecht, confirmed by that of Aix la Chapelle, Acadia had been ceded to England; but scarcely was the latter treaty signed, when debates sprang up touching the limits of the ceded province. Commissioners were named on either side to adjust the disputed boundary; but the claims of the rival powers proved utterly irreconcilable, and all negotiation was fruitless.[93] Meantime, the French and English forces in Acadia began to assume a belligerent attitude, and indulge their ill blood in mutual aggression and80 reprisal.[94] But while this game was played on the coasts of the Atlantic, interests of far greater moment were at stake in the west. The people of the middle colonies, placed by their local position beyond reach of the French, had heard with great composure of the sufferings of their New England brethren, and felt little concern at a danger so doubtful and remote. There were those among them, however, who with greater foresight had been quick to perceive the ambitious projects of the rival nation; and, as early as 1716, Spotswood, governor of Virginia, had urged the expediency of securing the valley of the Ohio by a series of forts and settlements.[95] His proposal was coldly received, and his plan fell to the ground. The time at length was come when the danger was approaching too near to be slighted longer. In 1748, an association, called the Ohio Company, was formed with the view of making settlements in the region beyond the Alleghanies; and two years later, Gist, the company’s surveyor, to the great disgust of the Indians, carried chain and compass down the Ohio as far as the falls at Louisville.[96] But so dilatory were the English, that before any effectual steps were taken, their agile enemies appeared upon the scene. In the spring of 1753, the middle provinces were startled at the tidings that French troops had crossed Lake Erie, fortified themselves at the point of Presqu’ Isle, and pushed forward to the northern branches of the Ohio.[97] Upon this, Governor Dinwiddie, of Virginia, resolved to despatch a message requiring their removal from territories which he claimed as belonging to the British crown; and looking about him for the person best qualified to act as messenger, he made choice of George Washington, a young man twenty-one years of age, adjutant general of the Virginian militia. Washington departed on his mission, crossed the mountains, descended to the bleak and leafless valley of the Ohio,81 and thence continued his journey up the banks of the Alleghany until the fourth of December. On that day he reached Venango, an Indian town on the Alleghany, at the mouth of French Creek. Here was the advanced post of the French; and here, among the Indian log cabins and huts of bark, he saw their flag flying above the house of an English trader, whom the military intruders had unceremoniously ejected. They gave the young envoy a hospitable reception,[98] and referred him to the commanding officer, whose headquarters were at Le B?uf, a fort which they had just built on French Creek, some distance above Venango. Thither Washington repaired, and on his arrival was received with stately courtesy by the officer, Legardeur de St. Pierre, whom he describes as an elderly gentleman of very soldier-like appearance. To the message of Dinwiddie, St. Pierre replied that he would forward it to the governor general of Canada; but that, in the mean time, his orders were to hold possession of the country, and this he should do to the best of his ability. With this answer Washington, through all the rigors of the midwinter forest, retraced his steps, with one attendant, to the English borders. With the first opening of spring, a newly raised company of Virginian backwoodsmen, under Captain Trent, hastened across the mountains, and began to build a fort at the confluence of the Monongahela and Alleghany, where Pittsburg now stands; when suddenly they found themselves invested by a host of French and Indians, who, with sixty bateaux and three hundred canoes, had descended from Le B?uf and Venango.[99] The English were ordered to evacuate the spot;82 and, being quite unable to resist, they obeyed the summons, and withdrew in great discomfiture towards Virginia. Meanwhile Washington, with another party of backwoodsmen, was advancing from the borders; and, hearing of Trent’s disaster, he resolved to fortify himself on the Monongahela, and hold his ground, if possible, until fresh troops could arrive to support him. The French sent out a scouting party under M. Jumonville, with the design, probably, of watching his movements; but, on a dark and stormy night, Washington surprised them, as they lay lurking in a rocky glen not far from his camp, killed the officer, and captured the whole detachment.[100] Learning that the French, enraged by this reverse, were about to attack him in great force, he thought it prudent to fall back, and retired accordingly to a spot called the Great Meadows, where he had before thrown up a slight intrenchment. Here he found himself assailed by nine hundred French and Indians, commanded by a brother of the slain Jumonville. From eleven in the morning till eight at night, the backwoodsmen, who were half famished from the failure of their stores, maintained a stubborn defence, some fighting within the intrenchment, and some on the plain without. In the evening, the French sounded a parley, and offered terms. They were accepted, and on the following day Washington and his men retired across the mountains, leaving the disputed territory in the hands of the French.[101] While the rival nations were beginning to quarrel for a prize which belonged to neither of them, the unhappy Indians saw, with alarm and amazement, their lands becoming a bone of contention between rapacious strangers. The first appearance of the French on the Ohio excited the wildest fears in the tribes of that quarter, among whom were those who, disgusted by the encroachments of the Pennsylvanians, had fled to these remote retreats to escape the intrusions of the83 white men. Scarcely was their fancied asylum gained, when they saw themselves invaded by a host of armed men from Canada. Thus placed between two fires, they knew not which way to turn. There was no union in their counsels, and they seemed like a mob of bewildered children. Their native jealousy was roused to its utmost pitch. Many of them thought that the two white nations had conspired to destroy them, and then divide their lands. “You and the French,” said one of them, a few years afterwards, to an English emissary, “are like the two edges of a pair of shears, and we are the cloth which is cut to pieces between them.”[102] The French labored hard to conciliate them, plying them with gifts and flatteries,[103] and proclaiming themselves their champions against the English. At first, these arts seemed in vain, but their effect soon began to declare itself; and this effect was greatly increased by a singular piece of infatuation on the part of the proprietors of Pennsylvania. During the summer of 1754, delegates of the several provinces met at Albany, to concert measures of defence in the war which now seemed inevitable. It was at this meeting that the memorable plan of a union of the colonies was brought forward; a plan, the fate of which was curious and significant, for the crown rejected it as giving too much power to the people, and the people as giving too much power to the crown.[104] A council was also held with the Iroquois, and though they were found but lukewarm in their attachment to the English, a treaty of friendship and alliance was concluded with their84 deputies.[105] It would have been well if the matter had ended here; but, with ill-timed rapacity, the proprietary agents of Pennsylvania took advantage of this great assemblage of sachems to procure from them the grant of extensive tracts, including the lands inhabited by the very tribes whom the French were at that moment striving to seduce.[106] When they heard that, without their consent, their conquerors and tyrants, the Iroquois, had sold the soil from beneath their feet, their indignation was extreme; and, convinced that there was no limit to English encroachment, many of them from that hour became fast allies of the French. The courts of London and Versailles still maintained a diplomatic intercourse, both protesting their earnest wish that their conflicting claims might be adjusted by friendly negotiation; but while each disclaimed the intention of hostility, both were hastening to prepare for war. Early in 1755, an English fleet sailed from Cork, having on board two regiments destined for Virginia, and commanded by General Braddock; and soon after, a French fleet put to sea from the port of Brest, freighted with munitions of war and a strong body of troops under Baron Dieskau, an officer who had distinguished himself in the campaigns of Marshal Saxe. The English fleet gained its destination, and landed its troops in safety. The French were less fortunate. Two of their ships, the Lys and the Alcide, became involved in the fogs of the banks of Newfoundland; and when the weather cleared, they found themselves under the guns of a superior British force, belonging to the squadron of Admiral Boscawen, sent out for the express purpose of intercepting them. “Are we at peace or war?” demanded the French commander. A broadside from the Englishman soon solved his doubts, and after a stout resistance the French struck their colors.[107] News of the capture caused great excitement in England, but the conduct of the85 aggressors was generally approved; and under pretence that the French had begun the war by their alleged encroachments in America, orders were issued for a general attack upon their marine. So successful were the British cruisers, that, before the end of the year, three hundred French vessels and nearly eight thousand sailors were captured and brought into port.[108] The French, unable to retort in kind, raised an outcry of indignation, and Mirepoix their ambassador withdrew from the court of London. Thus began that memorable war which, kindling among the forests of America, scattered its fires over the kingdoms of Europe, and the sultry empire of the Great Mogul; the war made glorious by the heroic death of Wolfe, the victories of Frederic, and the exploits of Clive; the war which controlled the destinies of America, and was first in the chain of events which led on to her Revolution with all its vast and undeveloped consequences. On the old battle-ground of Europe, the contest bore the same familiar features of violence and horror which had marked the strife of former generations—fields ploughed by the cannon ball, and walls shattered by the exploding mine, sacked towns and blazing suburbs, the lamentations of women, and the license of a maddened soldiery. But in America, war assumed a new and striking aspect. A wilderness was its sublime arena. Army met army under the shadows of primeval woods; their cannon resounded over wastes unknown to civilized man. And before the hostile powers could join in battle, endless forests must be traversed, and morasses passed, and everywhere the axe of the pioneer must hew a path for the bayonet of the soldier. Before the declaration of war, and before the breaking off of negotiations between the courts of France and England,86 the English ministry formed the plan of assailing the French in America on all sides at once, and repelling them, by one bold push, from all their encroachments.[109] A provincial army was to advance upon Acadia, a second was to attack Crown Point, and a third Niagara; while the two regiments which had lately arrived in Virginia under General Braddock, aided by a strong body of provincials, were to dislodge the French from their newly-built fort of Du Quesne. To Braddock was assigned the chief command of all the British forces in America; and a person worse fitted for the office could scarcely have been found. His experience had been ample, and none could doubt his courage; but he was profligate, arrogant, perverse, and a bigot to military rules.[110] On his first arrival in Virginia, he called together the governors of the several provinces, in order to explain his instructions and adjust the details of the projected operations. These arrangements complete, Braddock advanced to the borders of Virginia, and formed his camp at Fort Cumberland, where he spent several weeks in training the raw backwoodsmen, who joined him,87 into such discipline as they seemed capable of; in collecting horses and wagons, which could only be had with the utmost difficulty; in railing at the contractors, who scandalously cheated him; and in venting his spleen by copious abuse of the country and the people. All at length was ready, and early in June, 1755, the army left civilization behind, and struck into the broad wilderness as a squadron puts out to sea. It was no easy task to force their way over that rugged ground, covered with an unbroken growth of forest; and the difficulty was increased by the needless load of baggage which encumbered their march. The crash of falling trees resounded in the front, where a hundred axemen labored with ceaseless toil to hew a passage for the army.[111] The horses strained their utmost strength to drag the ponderous wagons over roots and stumps, through gullies and quagmires; and the regular troops were daunted by the depth and gloom of the forest which hedged them in on either hand, and closed its leafy arches above their heads. So tedious was their progress, that, by the advice of Washington, twelve hundred chosen men moved on in advance with the lighter baggage and artillery, leaving the rest of the army to follow, by slower stages, with the heavy wagons. On the eighth of July, the advanced body reached the Monongahela, at a point not far distant from Fort du Quesne. The rocky and impracticable ground on the eastern side debarred their passage, and the general resolved to cross the river in search of a smoother path, and recross it a few miles lower down, in order to gain the fort. The first passage was easily made, and the troops moved, in glittering array, down the western margin of the water, rejoicing that their goal was well nigh reached, and the hour of their expected triumph close at hand. Scouts and Indian runners had brought the tidings of Braddock’s approach to the French at Fort du Quesne. Their dismay was great, and Contrec?ur, the commander, thought only of retreat; when Beaujeu, a captain in the garrison, made the bold proposal of leading out a party of French and Indians to waylay the English in the woods, and harass or88 interrupt their march. The offer was accepted, and Beaujeu hastened to the Indian camps. Around the fort and beneath the adjacent forest were the bark lodges of savage hordes, whom the French had mustered from far and near; Ojibwas and Ottawas, Hurons and Caughnawagas, Abenakis and Delawares. Beaujeu called the warriors together, flung a hatchet on the ground before them, and invited them to follow him out to battle; but the boldest stood aghast at the peril, and none would accept the challenge. A second interview took place with no better success; but the Frenchman was resolved to carry his point. “I am determined to go,” he exclaimed. “What, will you suffer your father to go alone?”[112] His daring proved contagious. The warriors hesitated no longer; and when, on the morning of the ninth of July, a scout ran in with the news that the English army was but a few miles distant, the Indian camps were at once astir with the turmoil of preparation. Chiefs harangued their yelling followers, braves bedaubed themselves with war-paint, smeared themselves with grease, hung feathers in their scalp-locks, and whooped and stamped till they had wrought themselves into a delirium of valor. That morning, James Smith, an English prisoner recently captured on the frontier of Pennsylvania, stood on the rampart, and saw the half-frenzied multitude thronging about the gateway, where kegs of bullets and gunpowder were broken open, that each might help himself at will.[113] Then band after band hastened away towards the forest, followed and supported by nearly two hundred and fifty French and Canadians, commanded by Beaujeu. There were the Ottawas, led on, it is said, by the remarkable man whose name stands on the title-page of this history; there were the Hurons of Lorette under their chief, whom the French called Athanase,[114] and many more, all keen as hounds on the scent of blood. At89 about nine miles from the fort, they reached a spot where the narrow road descended to the river through deep and gloomy woods, and where two ravines, concealed by trees and bushes, seemed formed by nature for an ambuscade. Beaujeu well knew the ground; and it was here that he had resolved to fight; but he and his followers were well nigh too late; for as they neared the ravines, the woods were resounding with the roll of the British drums. It was past noon of a day brightened with the clear sunlight of an American midsummer, when the forces of Braddock began, for a second time, to cross the Monongahela, at the fording-place, which to this day bears the name of their ill-fated leader. The scarlet columns of the British regulars, complete in martial appointment, the rude backwoodsmen with shouldered rifles, the trains of artillery and the white-topped wagons, moved on in long procession through the shallow current, and slowly mounted the opposing bank.[115] Men were there whose names have become historic: Gage, who, twenty years later, saw his routed battalions recoil in disorder from before the breastwork on Bunker Hill; Gates, the future conqueror of Burgoyne; and one destined to a higher fame,—George Washington, a boy in years, a man in calm thought and self-ruling wisdom. With steady and well ordered march, the troops advanced into the great labyrinth of woods which shadowed the eastern borders of the river. Rank after rank vanished from sight. The forest swallowed them up, and the silence of the wilderness90 sank down once more on the shores and waters of the Monongahela. Several engineers and guides and six light horsemen led the way; a body of grenadiers under Gage was close behind, and the army followed in such order as the rough ground would permit, along a narrow road, twelve feet wide, tunnelled through the dense and matted foliage. There were flanking parties on either side, but no scouts to scour the woods in front, and with an insane confidence Braddock pressed on to meet his fate. The van had passed the low grounds that bordered the river, and were now ascending a gently rising ground, where, on either hand, hidden by thick trees, by tangled undergrowth and rank grasses, lay the two fatal ravines. Suddenly, Gordon, an engineer in advance, saw the French and Indians bounding forward through the forest and along the narrow track, Beaujeu leading them on, dressed in a fringed hunting-shirt, and wearing a silver gorget on his breast. He stopped, turned, and waved his hat, and his French followers, crowding across the road, opened a murderous fire upon the head of the British column, while, screeching their war-cries, the Indians thronged into the ravines, or crouched behind rocks and trees on both flanks of the advancing troops. The astonished grenadiers returned the fire, and returned it with good effect; for a random shot struck down the brave Beaujeu, and the courage of the assailants was staggered by his fall. Dumas, second in command, rallied them to the attack; and while he, with the French and Canadians, made good the pass in front, the Indians from their lurking places opened a deadly fire on the right and left. In a few moments, all was confusion. The advance guard fell back on the main body, and every trace of subordination vanished. The fire soon extended along the whole length of the army, from front to rear. Scarce an enemy could be seen, though the forest resounded with their yells; though every bush and tree was alive with incessant flashes; though the lead flew like a hailstorm, and the men went down by scores. The regular troops seemed bereft of their senses. They huddled together in the road like flocks of sheep; and happy did he think himself who could wedge his way into the midst of the crowd, and place a barrier of human flesh between his life and91 the shot of the ambushed marksmen. Many were seen eagerly loading their muskets, and then firing them into the air, or shooting their own comrades in the insanity of their terror. The officers, for the most part, displayed a conspicuous gallantry; but threats and commands were wasted alike on the panic-stricken multitude. It is said that at the outset Braddock showed signs of fear; but he soon recovered his wonted intrepidity. Five horses were shot under him, and five times he mounted afresh.[116] He stormed and shouted, and, while the Virginians were fighting to good purpose, each man behind a tree, like the Indians themselves, he ordered them with furious menace to form in platoons, where the fire of the enemy mowed them down like grass. At length, a mortal shot silenced him, and two provincials bore him off the field. Washington rode through the tumult calm and undaunted. Two horses were killed under him, and four bullets pierced his clothes;[117] but his hour was not come, and he escaped without a wound. Gates was shot through the body, and Gage also was severely wounded. Of eighty-six officers, only twenty-three remained unhurt; and of twelve hundred soldiers who crossed the Monongahela, more than seven hundred were killed and wounded. None suffered more severely than the Virginians, who had displayed throughout a degree of courage and steadiness which put the cowardice of the regulars to shame. The havoc among them was terrible, for of their whole number scarcely one-fifth left the field alive.[118] The slaughter lasted three hours; when, at length, the survivors, as if impelled by a general impulse, rushed tumultuously92 from the place of carnage, and with dastardly precipitation fled across the Monongahela. The enemy did not pursue beyond the river, flocking back to the field to collect the plunder, and gather a rich harvest of scalps. The routed troops pursued their flight until they met the rear division of the army, under Colonel Dunbar; and even then their senseless terrors did not abate. Dunbar’s soldiers caught the infection. Cannon, baggage, provisions and wagons were destroyed, and all fled together, eager to escape from the shadows of those awful woods, whose horrors haunted their imagination. They passed the defenceless settlements of the border, and hurried on to Philadelphia, leaving the unhappy people to defend themselves as they might against the tomahawk and scalping-knife. The calamities of this disgraceful rout did not cease with the loss of a few hundred soldiers on the field of battle; for it brought upon the provinces all the miseries of an Indian war. Those among the tribes who had thus far stood neutral, wavering between the French and English, now hesitated no longer. Many of them had been disgusted by the contemptuous behavior of Braddock. All had learned to despise the courage of the English, and to regard their own prowess with unbounded complacency. It is not in Indian nature to stand quiet in the midst of war; and the defeat of Braddock was a signal for the western savages to snatch their tomahawks and assail the English settlements with one accord, murdering and pillaging with ruthless fury, and turning the frontier of Pennsylvania and Virginia into one wide scene of havoc and desolation. The three remaining expeditions which the British ministry had planned for that year’s campaign were attended with various results. Acadia was quickly reduced by the forces of Colonel Monkton; but the glories of this easy victory were tarnished by an act of cruelty. Seven thousand of the unfortunate people, refusing to take the prescribed oath of allegiance, were seized by the conquerors, torn from their homes, placed on shipboard like cargoes of negro slaves, and transported to the British provinces.[119] The expedition against Niagara was a93 total failure, for the troops did not even reach their destination. The movement against Crown Point met with no better success, as regards the main object of the enterprise. Owing to the lateness of the season, and other causes, the troops proceeded no farther than Lake George; but the attempt was marked by a feat of arms, which, in that day of failures, was greeted, both in England and America, as a signal victory. General Johnson, afterwards Sir William Johnson, had been charged with the conduct of the Crown Point expedition; and his little army, a rude assemblage of hunters and farmers from New York and New England, officers and men alike ignorant of war, lay encamped at the southern extremity of Lake George. Here, while they languidly pursued their preparations, their active enemy anticipated them. Baron Dieskau, who, with a body of troops, had reached Quebec in the squadron which sailed from Brest in the spring, had intended to take forcible possession of the English fort of Oswego, erected upon ground claimed by the French as a part of Canada. Learning Johnson’s movements, he changed his plan, crossed Lake Champlain, made a circuit by way of Wood Creek, and gained the rear of the English army, with a force of about two thousand French and Indians. At midnight, on the seventh of September, the tidings reached Johnson that the army of the French baron was but a few miles distant from his camp. A council of war was called, and the resolution formed of detaching a thousand men to reconnoitre. “If they are to be killed,” said Hendrick, the Mohawk chief, “they are too many; if they are to fight, they are too few.” His remonstrance was unheeded; and the brave old savage, unable from age and corpulence to fight on foot, mounted his horse, and joined the English detachment with two hundred of his warriors. At sunrise, the party defiled from the camp, and entering the forest disappeared from the eyes of their comrades. Those who remained behind labored with all the energy of alarm to fortify their unprotected camp. An hour elapsed, when from the distance was heard a sudden explosion of musketry. The excited soldiers suspended their work to listen. A rattling fire succeeded, deadened among the woods, but growing louder and nearer, till none could doubt that their comrades had met the French, and were defeated. 94 This was indeed the case. Marching through thick woods, by the narrow and newly-cut road which led along the valley southward from Lake George, Williams, the English commander, had led his men full into an ambuscade, where all Dieskau’s army lay in wait to receive them. From the woods on both sides rose an appalling shout, followed by a storm of bullets. Williams was soon shot down; Hendrick shared his fate; many officers fell, and the road was strewn with dead and wounded soldiers. The English gave way at once. Had they been regular troops, the result would have been worse; but every man was a woodsman and a hunter. Some retired in bodies along the road; while the greater part spread themselves through the forest, opposing a wide front to the enemy, fighting stubbornly as they retreated, and shooting back at the French from behind every tree or bush that could afford a cover. The Canadians and Indians pressed them closely, darting, with shrill cries, from tree to tree, while Dieskau’s regulars, with steadier advance, bore all before them. Far and wide through the forest rang shout and shriek and Indian whoop, mingled with the deadly rattle of guns. Retreating and pursuing, the combatants passed northward towards the English camp, leaving the ground behind them strewn with dead and dying. A fresh detachment from the camp came in aid of the English, and the pursuit was checked. Yet the retreating men were not the less rejoiced when they could discern, between the brown columns of the woods, the mountains and waters of Lake George, with the white tents of their encampments on its shore. The French followed no farther. The blast of their trumpets was heard recalling their scattered men for a final attack. During the absence of Williams’s detachment, the main body of the army had covered the front of their camp with a breastwork,—if that name can be applied to a row of logs,—behind which the marksmen lay flat on their faces. This preparation was not yet complete, when the defeated troops appeared issuing from the woods. Breathless and perturbed, they entered the camp, and lay down with the rest; and the army waited the attack in a frame of mind which boded ill for the result. Soon, at the edge of the woods which bordered the95 open space in front, painted Indians were seen, and bayonets glittered among the foliage, shining, in the homely comparison of a New-England soldier, like a row of icicles on a January morning. The French regulars marched in column to the edge of the clearing, and formed in line, confronting the English at the distance of a hundred and fifty yards. Their complete order, their white uniforms and bristling bayonets, were a new and startling sight to the eyes of Johnson’s rustic soldiers, who raised but a feeble cheer in answer to the shouts of their enemies. Happily, Dieskau made no assault. The regulars opened a distant fire of musketry, throwing volley after volley against the English, while the Canadians and Indians, dispersing through the morasses on each flank of the camp, fired sharply, under cover of the trees and bushes. In the rear, the English were protected by the lake; but on the three remaining sides, they were hedged in by the flash and smoke of musketry. The fire of the French had little effect. The English recovered from their first surprise, and every moment their confidence rose higher and their shouts grew louder. Levelling their long hunting guns with cool precision, they returned a fire which thinned the ranks of the French, and galled them beyond endurance. Two cannon were soon brought to bear upon the morasses which sheltered the Canadians and Indians; and though the pieces were served with little skill, the assailants were so terrified by the crashing of the balls among the trunks and branches, that they gave way at once. Dieskau still persisted in the attack. From noon until past four o’clock, the firing was scarcely abated, when at length the French, who had suffered extremely, showed signs of wavering. At this, with a general shout, the English broke from their camp, and rushed upon their enemies, striking them down with the buts of their guns, and driving them through the woods like deer. Dieskau was taken prisoner, dangerously wounded, and leaning for support against the stump of a tree. The slaughter would have been great, had not the English general recalled the pursuers, and suffered the French to continue their flight unmolested. Fresh disasters still awaited the fugitives; for, as they approached the scene of that morning’s ambuscade, they were greeted by a volley of musketry. Two companies of New96 York and New Hampshire rangers, who had come out from Fort Edward as a scouting party, had lain in wait to receive them. Favored by the darkness of the woods,—for night was now approaching,—they made so sudden and vigorous an attack, that the French, though far superior in number, were totally routed and dispersed.[120] This memorable conflict has cast its dark associations over one of the most beautiful spots in America. Near the scene of the evening fight, a pool, half overgrown by weeds and water lilies, and darkened by the surrounding forest, is pointed out to the tourist, and he is told that beneath its stagnant waters lie the bones of three hundred Frenchmen, deep buried in mud and slime. The war thus begun was prosecuted for five succeeding years with the full energy of both nations. The period was one of suffering and anxiety to the colonists, who, knowing the full extent of their danger, spared no exertion to avert it. In the year 1758, Lord Abercrombie, who then commanded in America, had at his disposal a force amounting to fifty thousand men, of whom the greater part were provincials.[121] The97 operations of the war embraced a wide extent of country, from Cape Breton and Nova Scotia to the sources of the Ohio; but nowhere was the contest so actively carried on as in the neighborhood of Lake George, the waters of which, joined with those of Lake Champlain, formed the main avenue of communication between Canada and the British provinces. Lake George is more than thirty miles long, but of width so slight that it seems like some broad and placid river, enclosed between ranges of lofty mountains; now contracting into narrows, dotted with islands and shadowed by cliffs and crags, now spreading into a clear and open expanse. It had long been known to the French. The Jesuit Isaac Jogues, bound on a fatal mission to the ferocious Mohawks, had reached its banks on the eve of Corpus Christi Day, and named it Lac St. Sacrement. Its solitude was now rudely invaded. Armies passed and repassed upon its tranquil bosom. At its northern point the French planted their stronghold of Ticonderoga; at its southern stood the English fort William Henry, while the mountains and waters between were a scene of ceaseless ambuscades, surprises, and forest skirmishing. Through summer and winter, the crack of rifles and the cries of men gave no rest to their echoes; and at this day, on the field of many a forgotten fight, are dug up rusty tomahawks, corroded bullets, and human bones, to attest the struggles of the past. The earlier years of the war were unpropitious to the English, whose commanders displayed no great degree of vigor or ability. In the summer of 1756, the French general Montcalm advanced upon Oswego, took it, and levelled it to the ground. In August of the following year, he struck a heavier blow. Passing Lake George with a force of eight thousand men, including about two thousand Indians, gathered from the farthest parts of Canada, he laid siege to Fort William Henry, close to the spot where Dieskau had been defeated two years before. Planting his batteries against it, he beat down its ramparts and dismounted its guns, until the garrison, after a brave defence, were forced to capitulate. They marched out with the honors of war; but scarcely had they done so, when Montcalm’s Indians assailed them, cutting down and scalping them without mercy. Those who escaped came in to Fort Edward with exaggerated accounts of the98 horrors from which they had fled, and a general terror was spread through the country. The inhabitants were mustered from all parts to repel the advance of Montcalm; but the French general, satisfied with what he had done, repassed Lake George, and retired behind the walls of Ticonderoga. In the year 1758, the war began to assume a different aspect, for Pitt was at the head of the government. Sir Jeffrey Amherst laid siege to the strong fortress of Louisburg, and at length reduced it; while in the south, General Forbes marched against Fort du Quesne, and, more fortunate than his predecessor, Braddock, drove the French from that important point. Another successful stroke was the destruction of Fort Frontenac, which was taken by a provincial army under Colonel Bradstreet. These achievements were counterbalanced by a great disaster. Lord Abercrombie, with an army of sixteen thousand men, advanced to the head of Lake George, the place made memorable by Dieskau’s defeat and the loss of Fort William Henry. On a brilliant July morning, he embarked his whole force for an attack on Ticonderoga. Many of those present have recorded with admiration the beauty of the spectacle, the lines of boats filled with troops stretching far down the lake, the flashing of oars, the glitter of weapons, and the music ringing back from crags and rocks, or dying in mellowed strains among the distant mountains. At night, the army landed, and, driving in the French outposts, marched through the woods towards Ticonderoga. One of their columns, losing its way in the forest, fell in with a body of the retreating French; and in the conflict that ensued, Lord Howe, the favorite of the army, was shot dead. On the eighth of July, they prepared to storm the lines which Montcalm had drawn across the peninsula in front of the fortress. Advancing to the attack, they saw before them a breastwork of uncommon height and thickness. The French army were drawn up behind it, their heads alone visible, as they levelled their muskets against the assailants, while, for a hundred yards in front of the work, the ground was covered with felled trees, with sharpened branches pointing outward. The signal of assault was given. In vain the Highlanders, screaming with rage, hewed with their broadswords among the branches, struggling to get at the enemy. In vain the English, with their99 deep-toned shout, rushed on in heavy columns. A tempest of musket-balls met them, and Montcalm’s cannon swept the whole ground with terrible carnage. A few officers and men forced their way through the branches, passed the ditch, climbed the breastwork, and, leaping among the enemy, were instantly bayonetted. The English fought four hours with determined valor, but the position of the French was impregnable; and at length, having lost two thousand of their number, the army drew off, leaving many of their dead scattered upon the field. A sudden panic seized the defeated troops. They rushed in haste to their boats, and, though no pursuit was attempted, they did not regain their composure until Lake George was between them and the enemy. The fatal lines of Ticonderoga were not soon forgotten in the provinces; and marbles in Westminster Abbey preserve the memory of those who fell on that disastrous day. This repulse, far from depressing the energies of the British commanders, seemed to stimulate them to new exertion; and the campaign of the next year, 1759, had for its object the immediate and total reduction of Canada. This unhappy country was full of misery and disorder. Peculation and every kind of corruption prevailed among its civil and military chiefs, a reckless licentiousness was increasing among the people, and a general famine seemed impending, for the population had of late years been drained away for military service, and the fields were left untilled. In spite of their sufferings, the Canadians, strong in rooted antipathy to the English, and highly excited by their priests, resolved on fighting to the last. Prayers were offered up in the churches, masses said, and penances enjoined, to avert the wrath of God from the colony, while every thing was done for its defence which the energies of a great and patriotic leader could effect. By the plan of this summer’s campaign, Canada was to be assailed on three sides at once. Upon the west, General Prideaux was to attack Niagara; upon the south, General Amherst was to advance upon Ticonderoga and Crown Point; while upon the east, General Wolfe was to besiege Quebec; and each of these armies, having accomplished its particular object, was directed to push forward, if possible, until all three had united in the heart of Canada. In pursuance of the plan,100 General Prideaux moved up Lake Ontario and invested Niagara. This post was one of the greatest importance. Its capture would cut off the French from the whole interior country, and they therefore made every effort to raise the siege. An army of seventeen hundred French and Indians, collected at the distant garrisons of Detroit, Presqu’ Isle, Le B?uf, and Venango, suddenly appeared before Niagara.[122] Sir William Johnson was now in command of the English, Prideaux having been killed by the bursting of a cohorn. Advancing in order of battle, he met the French, charged, routed, and pursued them for five miles through the woods. This success was soon followed by the surrender of the fort. In the mean time, Sir Jeffrey Amherst had crossed Lake George, and appeared before Ticonderoga; upon which the French blew up their works, and retired down Lake Champlain to Crown Point. Retreating from this position also, on the approach of the English army, they collected all their forces, amounting to little more than three thousand men, at Isle Aux Noix, where they intrenched themselves, and prepared to resist the farther progress of the invaders. The lateness of the season prevented Amherst from carrying out the plan of advancing into Canada, and compelled him to go into winter-quarters at Crown Point. The same cause had withheld Prideaux’s army from descending the St. Lawrence. While the outposts of Canada were thus successfully attacked, a blow was struck at a more vital part. Early in June, General Wolfe sailed up the St. Lawrence with a force of eight thousand men, and formed his camp immediately below Quebec, on the Island of Orleans.[123] From thence he could discern, at a single glance, how arduous was the task before him. Piles of lofty cliffs rose with sheer ascent on the northern border of the river; and from their summits the boasted citadel of Canada looked down in proud security, with its churches and convents of stone, its ramparts, bastions, and batteries; while over them all, from the brink of the precipice, towered the massive walls of the Castle of St. Louis. Above, for many a league, the bank was guarded by an unbroken range of steep101 acclivities. Below, the River St. Charles, flowing into the St. Lawrence, washed the base of the rocky promontory on which the city stood. Lower yet lay an army of fourteen thousand men, under an able and renowned commander, the Marquis of Montcalm. His front was covered by intrenchments and batteries, which lined the bank of the St. Lawrence; his right wing rested on the city and the St. Charles; his left, on the cascade and deep gulf of Montmorenci; and thick forests extended along his rear. Opposite Quebec rose the high promontory of Point Levi; and the St. Lawrence, contracted to less than a mile in width, flowed between, with deep and powerful current. To a chief of less resolute temper, it might well have seemed that art and nature were in league to thwart his enterprise; but a mind like that of Wolfe could only have seen in this majestic combination of forest and cataract, mountain and river, a fitting theatre for the great drama about to be enacted there. Yet nature did not seem to have formed the young English general for the conduct of a doubtful and almost desperate enterprise. His person was slight, and his features by no means of a martial cast. His feeble constitution had been undermined by years of protracted and painful disease.[124] His kind and genial disposition seemed better fitted for the quiet of domestic life than for the stern duties of military command; but to these gentler traits he joined a high enthusiasm, and an unconquerable spirit of daring and endurance, which made him the idol of his soldiers, and bore his slender frame through every hardship and exposure. The work before him demanded all his courage. How to invest the city, or even bring the army of Montcalm to action, was a problem which might have perplexed a Hannibal. A French fleet lay in the river above, and the precipices along102 the northern bank were guarded at every accessible point by sentinels and outposts. Wolfe would have crossed the Montmorenci by its upper ford, and attacked the French army on its left and rear; but the plan was thwarted by the nature of the ground and the vigilance of his adversaries. Thus baffled at every other point, he formed the bold design of storming Montcalm’s position in front; and on the afternoon of the thirty-first of July, a strong body of troops was embarked in boats, and, covered by a furious cannonade from the English ships and batteries, landed on the beach just above the mouth of the Montmorenci. The grenadiers and Royal Americans were the first on shore, and their ill-timed impetuosity proved the ruin of the plan. Without waiting to receive their orders or form their ranks, they ran, pell-mell, across the level ground, and with loud shouts began, each man for himself, to scale the heights which rose in front, crested with intrenchments and bristling with hostile arms. The French at the top threw volley after volley among the hot-headed assailants. The slopes were soon covered with the fallen; and at that instant a storm, which had long been threatening, burst with sudden fury, drenched the combatants on both sides with a deluge of rain, extinguished for a moment the fire of the French, and at the same time made the steeps so slippery that the grenadiers fell repeatedly in their vain attempts to climb. Night was coming on with double darkness. The retreat was sounded, and, as the English re-embarked, troops of Indians came whooping down the heights, and hovered about their rear, to murder the stragglers and the wounded; while exulting cries of Vive le roi, from the crowded summits, proclaimed the triumph of the enemy. With bitter agony of mind, Wolfe beheld the headlong folly of his men, and saw more than four hundred of the flower of his army fall a useless sacrifice.[125] The anxieties of the siege had told severely upon his slender constitution; and not long after this disaster, he felt the first symptoms of a fever, which soon confined him to his couch. Still his mind never wavered from its purpose; and it was while lying helpless in the chamber of a Canadian house, where he had fixed his headquarters, that103 he embraced the plan of the enterprise which robbed him of life, and gave him immortal fame. This plan had been first proposed during the height of Wolfe’s illness, at a council of his subordinate generals, Monkton, Townshend, and Murray. It was resolved to divide the little army; and, while one portion remained before Quebec to alarm the enemy by false attacks, and distract their attention from the scene of actual operation, the other was to pass above the town, land under cover of darkness on the northern shore, climb the guarded heights, gain the plains above, and force Montcalm to quit his vantage-ground, and perhaps to offer battle. The scheme was daring even to rashness; but its audacity was the secret of its success. Early in September, a crowd of ships and transports, under Admiral Holmes, passed the city under the hot fire of its batteries; while the troops designed for the expedition, amounting to scarcely five thousand, marched upward along the southern bank, beyond reach of the cannonade. All were then embarked; and on the evening of the twelfth, Holmes’s fleet, with the troops on board, lay safe at anchor in the river, several leagues above the town. These operations had not failed to awaken the suspicions of Montcalm; and he had detached M. Bougainville to watch the movements of the English, and prevent their landing on the northern shore. The eventful night of the twelfth was clear and calm, with no light but that of the stars. Within two hours before daybreak, thirty boats, crowded with sixteen hundred soldiers, cast off from the vessels, and floated downward, in perfect order, with the current of the ebb tide. To the boundless joy of the army, Wolfe’s malady had abated, and he was able to command in person. His ruined health, the gloomy prospects of the siege, and the disaster at Montmorenci, had oppressed him with the deepest melancholy, but never impaired for a moment the promptness of his decisions, or the impetuous energy of his action.[126] He sat in the stern of one of the boats,104 pale and weak, but borne up to a calm height of resolution. Every order had been given, every arrangement made, and it only remained to face the issue. The ebbing tide sufficed to bear the boats along, and nothing broke the silence of the night but the gurgling of the river, and the low voice of Wolfe, as he repeated to the officers about him the stanzas of Gray’s “Elegy in a Country Churchyard,” which had recently appeared and which he had just received from England. Perhaps, as he uttered those strangely appropriate words,— “The paths of glory lead but to the grave,” the shadows of his own approaching fate stole with mournful prophecy across his mind. “Gentlemen,” he said, as he closed his recital, “I would rather have written those lines than take Quebec tomorrow.”[127] As they approached the landing-place, the boats edged closer in towards the northern shore, and the woody precipices rose high on their left, like a wall of undistinguished blackness. “Qui vive?” shouted a French sentinel, from out the impervious gloom. 105 “La France!” answered a captain of Fraser’s Highlanders, from the foremost boat. “A quel régiment?” demanded the soldier. “De la Reine!” promptly replied the Highland captain, who chanced to know that the regiment so designated formed part of Bougainville’s command. As boats were frequently passing down the river with supplies for the garrison, and as a convoy from Bougainville was expected that very night, the sentinel was deceived, and allowed the English to proceed. A few moments after, they were challenged again, and this time they could discern the soldier running close down to the water’s edge, as if all his suspicions were aroused; but the skilful replies of the Highlander once more saved the party from discovery.[128] They reached the landing-place in safety,—an indentation in the shore, about a league above the city, and now bearing the name of Wolfe’s Cove. Here a narrow path led up the face of the heights, and a French guard was posted at the top to defend the pass. By the force of the current, the foremost boats, including that which carried Wolfe himself, were borne a little below the spot. The general was one of the first on shore. He looked upward at the rugged heights which towered above him in the gloom. “You can try it,” he coolly observed to an officer near him; “but I don’t think you’ll get up.”[129] At the point where the Highlanders landed, one of their captains, Donald Macdonald, apparently the same whose presence of mind had just saved the enterprise from ruin, was climbing in advance of his men, when he was challenged by a sentinel. He replied in French, by declaring that he had been sent to relieve the guard, and ordering the soldier to withdraw.[130] Before the latter was undeceived, a crowd of Highlanders were close at hand, while the steeps below were106 thronged with eager climbers, dragging themselves up by trees, roots, and bushes.[131] The guard turned out, and made a brief though brave resistance. In a moment, they were cut to pieces, dispersed, or made prisoners; while men after men came swarming up the height, and quickly formed upon the plains above. Meanwhile, the vessels had dropped downward with the current, and anchored opposite the landing-place. The remaining troops were disembarked, and, with the dawn of day, the whole were brought in safety to the shore. The sun rose, and, from the ramparts of Quebec, the astonished people saw the Plains of Abraham glittering with arms, and the dark-red lines of the English forming in array of battle. Breathless messengers had borne the evil tidings to Montcalm, and far and near his wide-extended camp resounded with the rolling of alarm drums and the din of startled preparation. He, too, had had his struggles and his sorrows. The civil power had thwarted him; famine, discontent, and disaffection were rife among his soldiers; and no small portion of the Canadian militia had dispersed from sheer starvation. In spite of all, he had trusted to hold out till the winter frosts should drive the invaders from before the town; when, on that disastrous morning, the news of their successful temerity fell like a cannon shot upon his ear. Still he assumed a tone of confidence. “They have got to the weak side of us at last,” he is reported to have said, “and we must crush them with our numbers.” With headlong haste, his troops were pouring over the bridge of the St. Charles, and gathering in heavy masses under the western ramparts of the town. Could numbers give assurance of success, their triumph would have been secure; for five French battalions and the armed colonial peasantry amounted in all to more than seven thousand five hundred men. Full in sight before them stretched the long, thin lines of the British forces,—the half-wild Highlanders, the steady soldiery of England, and the hardy levies of the provinces,—less than five thousand in number, but all inured to battle, and strong in the full assurance of success. Yet, could the chiefs of that gallant army have pierced the secrets of the future, could they have foreseen that the victory which they107 burned to achieve would have robbed England of her proudest boast, that the conquest of Canada would pave the way for the independence of America, their swords would have dropped from their hands, and the heroic fire have gone out within their hearts. It was nine o’clock, and the adverse armies stood motionless, each gazing on the other. The clouds hung low, and, at intervals, warm light showers descended, besprinkling both alike. The coppice and cornfields in front of the British troops were filled with French sharpshooters, who kept up a distant, spattering fire. Here and there a soldier fell in the ranks, and the gap was filled in silence. At a little before ten, the British could see that Montcalm was preparing to advance, and, in a few moments, all his troops appeared in rapid motion. They came on in three divisions, shouting after the manner of their nation, and firing heavily as soon as they came within range. In the British ranks, not a trigger was pulled, not a soldier stirred; and their ominous composure seemed to damp the spirits of the assailants. It was not till the French were within forty yards that the fatal word was given, and the British muskets blazed forth at once in one crashing explosion. Like a ship at full career, arrested with sudden ruin on a sunken rock, the ranks of Montcalm staggered, shivered, and broke before that wasting storm of lead. The smoke, rolling along the field, for a moment shut out the view; but when the white wreaths were scattered on the wind, a wretched spectacle was disclosed; men and officers tumbled in heaps, battalions resolved into a mob, order and obedience gone; and when the British muskets were levelled for a second volley, the masses of the militia were seen to cower and shrink with uncontrollable panic. For a few minutes, the French regulars stood their ground, returning a sharp and not ineffectual fire. But now, echoing cheer on cheer, redoubling volley on volley, trampling the dying and the dead, and driving the fugitives in crowds, the British troops advanced and swept the field before them. The ardor of the men burst all restraint. They broke into a run, and with unsparing slaughter chased the flying multitude to the gates of Quebec. Foremost of all, the light-footed Highlanders dashed along in furious pursuit, hewing down the108 Frenchmen with their broadswords, and slaying many in the very ditch of the fortifications. Never was victory more quick or more decisive.[132] In the short action and pursuit, the French lost fifteen hundred men, killed, wounded, and taken. Of the remainder, some escaped within the city, and others fled across the St. Charles to rejoin their comrades who had been left to guard the camp. The pursuers were recalled by sound of trumpet; the broken ranks were formed afresh, and the English troops withdrawn beyond reach of the cannon of Quebec. Bougainville, with his corps, arrived from the upper country, and, hovering about their rear, threatened an attack; but when he saw what greeting was prepared for him, he abandoned his purpose and withdrew. Townshend and Murray, the only general officers who remained unhurt, passed to the head of every regiment in turn, and thanked the soldiers for the bravery they had shown; yet the triumph of the victors was mingled with sadness, as the tidings went from rank to rank that Wolfe had fallen. In the heat of the action, as he advanced at the head of the grenadiers of Louisburg, a bullet shattered his wrist; but he wrapped his handkerchief about the wound, and showed no sign of pain. A moment more, and a ball pierced his side. Still he pressed forward, waving his sword and cheering his soldiers to the attack, when a third shot lodged deep within his breast. He paused, reeled, and, staggering to one side, fell to the earth. Brown, a lieutenant of the grenadiers, Henderson, a volunteer, an officer of artillery, and a private soldier, raised him together in their arms, and, bearing him to the rear, laid him softly on the grass. They asked if he would have a surgeon; but he shook his head, and answered that all was over with him. His eyes closed with the torpor of approaching death, and those around sustained his fainting form. Yet they could not withhold their gaze from the wild turmoil before them, and the charging ranks of their companions rushing through fire and smoke. “See how they run,” one of the109 officers exclaimed, as the French fled in confusion before the levelled bayonets. “Who run?” demanded Wolfe, opening his eyes like a man aroused from sleep. “The enemy, sir,” was the reply; “they give way everywhere.” “Then,” said the dying general, “tell Colonel Burton to march Webb’s regiment down to Charles River, to cut off their retreat from the bridge. Now, God be praised, I will die in peace,” he murmured; and, turning on his side, he calmly breathed his last.[133] Almost at the same moment fell his great adversary, Montcalm, as he strove, with vain bravery, to rally his shattered ranks. Struck down with a mortal wound, he was placed upon a litter and borne to the General Hospital on the banks of the St. Charles. The surgeons told him that he could not recover. “I am glad of it,” was his calm reply. He then asked how long he might survive, and was told that he had not many hours remaining. “So much the better,” he said; “I am happy that I shall not live to see the surrender of Quebec.” Officers from the garrison came to his bedside to ask his orders and instructions. “I will give no more orders,” replied the defeated soldier; “I have much business that must be attended to, of greater moment than your ruined garrison and this wretched country. My time is very short; therefore, pray leave me.” The officers withdrew, and none remained in the chamber but his confessor and the Bishop of Quebec. To the last, he expressed his contempt for his own mutinous and half-famished troops, and his admiration for the disciplined valor of his opponents.[134] He died before midnight, and was buried at his own desire in a cavity of the earth formed by the bursting of a bombshell. The victorious army encamped before Quebec, and pushed their preparations for the siege with zealous energy; but before a single gun was brought to bear, the white flag was hung out, and the garrison surrendered. On the eighteenth of September, 1759, the rock-built citadel of Canada passed forever from the hands of its ancient masters. The victory on the Plains of Abraham and the downfall of Quebec filled all England with pride and exultation. From north to south, the land blazed with illuminations, and resounded110 with the ringing of bells, the firing of guns, and the shouts of the multitude. In one village alone all was dark and silent amid the general joy; for here dwelt the widowed mother of Wolfe. The populace, with unwonted delicacy, respected her lonely sorrow, and forbore to obtrude the sound of their rejoicings upon her grief for one who had been through life her pride and solace, and repaid her love with a tender and constant devotion.[135] Canada, crippled and dismembered by the disasters of this year’s campaign, lay waiting, as it were, the final stroke which was to extinguish her last remains of life, and close the eventful story of French dominion in America. Her limbs and her head were lopped away, but life still fluttered at her heart. Quebec, Niagara, Frontenac, and Crown Point had fallen; but Montreal and the adjacent country still held out, and thither, with the opening season of 1760, the British commanders turned all their energies. Three armies were to enter Canada at three several points, and, conquering as they advanced, converge towards Montreal as a common centre. In accordance with this plan, Sir Jeffrey Amherst embarked at Oswego, crossed Lake Ontario, and descended the St. Lawrence with ten thousand men; while Colonel Haviland advanced by way of Lake Champlain and the River Sorel, and General Murray ascended from Quebec, with a body of the veterans who had fought on the Plains of Abraham. By a singular concurrence of fortune and skill, the three armies reached the neighborhood of Montreal on the same day. The feeble and disheartened garrison could offer no resistance, and on the eighth of September, 1760, the Marquis de Vaudreuil surrendered Canada, with all its dependencies, to the British crown.","sourceLink":"http://novel.tingroom.com/duanpian/2855/78747.html","bookId":1211,"book":{"id":1211,"title":"The Conspiracy of Pontiac and the Indian War after the Conquest of Canada","description":"简介： I chose the subject of this book as affording better opportunities than any other portion of American history for portraying forest life and the Indian character; and I have never seen reason to change this opinion. In the nineteen years that have pa...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2855","creation":"Aug 1, 2019 12:24:36 AM","modification":"Aug 1, 2019 12:24:36 AM"}}
