{"id":43551,"no":8,"title":"Chapter VI.","content":"1760. THE ENGLISH TAKE POSSESSION OF THE WESTERN POSTS. The war was over. The plains around Montreal were dotted with the white tents of three victorious armies, and the work of conquest was complete. Canada, with all her dependencies, had yielded to the British crown; but it still remained to carry into full effect the terms of the surrender, and take possession of those western outposts, where the lilies of France had not as yet descended from the flagstaff. The execution of this task, neither an easy nor a safe one, was assigned to a provincial officer, Major Robert Rogers. Rogers was a native of New Hampshire. He commanded a body of provincial rangers, and stood in high repute as a partisan officer. Putnam and Stark were his associates; and it was in this woodland warfare that the former achieved many of those startling adventures and hair-breadth escapes which have made his name familiar at every New-England fireside. Rogers’s Rangers, half hunters, half woodsmen, trained in a discipline of their own, and armed, like Indians, with hatchet, knife, and gun, were employed in a service of peculiar hardship. Their chief theatre of action was the mountainous region of Lake George, the debatable ground between the hostile forts of Ticonderoga and William Henry. The deepest recesses of these romantic solitudes had heard the French and Indian yell, and the answering shout of the hardy New-England men. In summer, they passed down the lake in whale boats or canoes, or threaded the pathways of the woods in single file, like the savages themselves. In winter, they journeyed through the swamps on snowshoes, skated along the frozen surface of the lake, and bivouacked at night among the snow-drifts. They intercepted French messengers, encountered French scouting parties, and carried off prisoners from under the very walls of Ticonderoga. Their hardships and adventures, their marches and countermarches, their frequent skirmishes and midwinter battles, had made them famous125 throughout America; and though it was the fashion of the day to sneer at the efforts of provincial troops, the name of Rogers’s Rangers was never mentioned but with honor. Their commander was a man tall and strong in person, and rough in feature. He was versed in all the arts of woodcraft, sagacious, prompt, and resolute, yet so cautious withal that he sometimes incurred the unjust charge of cowardice. His mind, naturally active, was by no means uncultivated; and his books and unpublished letters bear witness that his style as a writer was not contemptible. But his vain, restless, and grasping spirit, and more than doubtful honesty, proved the ruin of an enviable reputation. Six years after the expedition of which I am about to speak, he was tried by a court-martial for a meditated act of treason, the surrender of Fort Michillimackinac into the hands of the Spaniards, who were at that time masters of Upper Louisiana.[147] Not long after, if we may trust his own account, he passed over to the Barbary States, entered the service of the Dey of Algiers, and fought two battles under his banners. At the opening of the war of independence, he returned to his native country, where he made professions of patriotism, but was strongly suspected by many, including Washington himself, of acting the part of a spy. In fact, he soon openly espoused the British cause, and received a colonel’s commission from the crown. His services, however, proved of little consequence. In 1778, he was proscribed and banished, under the act of New Hampshire, and the remainder of his life was passed in such obscurity that it is difficult to determine when and where he died.[148] 126 On the twelfth of September, 1760, Rogers, then at the height of his reputation, received orders from Sir Jeffrey Amherst to ascend the lakes with a detachment of rangers, and take possession, in the name of his Britannic Majesty, of Detroit, Michillimackinac, and other western posts included in the late capitulation. He left Montreal, on the following day, with two hundred rangers, in fifteen whale boats. Stemming the surges of La Chine and the Cedars, they left behind them the straggling hamlet which bore the latter name, and formed at that day the western limit of Canadian settlement.[149] They gained Lake Ontario, skirted its northern shore, amid rough and boisterous weather, and crossing at its western extremity, reached Fort Niagara on the first of October. Carrying their boats over the portage, they launched them once more above the cataract, and slowly pursued their voyage; while Rogers, with a few attendants, hastened on in advance to Fort Pitt, to deliver despatches, with which he was charged, to General Monkton. This errand accomplished, he rejoined his command at Presqu’ Isle, about the end of the month, and the whole proceeded together along the southern margin of Lake Erie. The season was far advanced. The wind was chill, the lake was stormy, and the woods on shore were tinged with127 the fading hues of autumn. On the seventh of November, they reached the mouth of a river called by Rogers the Chogage. No body of troops under the British flag had ever before penetrated so far. The day was dull and rainy, and, resolving to rest until the weather should improve, Rogers ordered his men to prepare their encampment in the neighboring forest. Soon after the arrival of the rangers, a party of Indian chiefs and warriors entered the camp. They proclaimed themselves an embassy from Pontiac, ruler of all that country, and directed, in his name, that the English should advance no farther until they had had an interview with the great chief, who was already close at hand. In truth, before the day closed, Pontiac himself appeared; and it is here, for the first time, that this remarkable man stands forth distinctly on the page of history. He greeted Rogers with the haughty demand, what was his business in that country, and how he dared enter it without his permission. Rogers informed him that the French were defeated, that Canada had surrendered, and that he was on his way to take possession of Detroit, and restore a general peace to white men and Indians alike. Pontiac listened with attention, but only replied that he should stand in the path of the English until morning. Having inquired if the strangers were in need of any thing which his country could afford, he withdrew, with his chiefs, at nightfall, to his own encampment; while the English, ill at ease, and suspecting treachery, stood well on their guard throughout the night.[150] In the morning, Pontiac returned to the camp with his attendant chiefs, and made his reply to Rogers’s speech of the previous day. He was willing, he said, to live at peace with the English, and suffer them to remain in his country as long as they treated him with due respect and deference. The Indian chiefs and provincial officers smoked the calumet together, and perfect harmony seemed established between them.[151] Up to this time, Pontiac had been, in word and deed, the128 fast ally of the French; but it is easy to discern the motives that impelled him to renounce his old adherence. The American forest never produced a man more shrewd, politic, and ambitious. Ignorant as he was of what was passing in the world, he could clearly see that the French power was on the wane, and he knew his own interest too well to prop a falling cause. By making friends of the English, he hoped to gain powerful allies, who would aid his ambitious projects, and give him an increased influence over the tribes; and he flattered himself that the new-comers would treat him with the same respect which the French had always observed. In this, and all his other expectations of advantage from the English, he was doomed to disappointment. A cold storm of rain set in, and the rangers were detained several days in their encampment. During this time, Rogers had several interviews with Pontiac, and was constrained to admire the native vigor of his intellect, no less than the singular control which he exercised over those around him. On the twelfth of November, the detachment was again in motion, and within a few days they had reached the western end of Lake Erie. Here they heard that the Indians of Detroit were in arms against them, and that four hundred warriors lay in ambush at the entrance of the river to cut them off. But the powerful influence of Pontiac was exerted in behalf of his new friends. The warriors abandoned their design, and the rangers continued their progress towards Detroit, now within a short distance. In the mean time, Lieutenant Brehm had been sent forward with a letter to Captain Belètre, the commandant at Detroit, informing him that Canada had capitulated, that his garrison was included in the capitulation, and that an English detachment was approaching to relieve it. The Frenchman, in great wrath at the tidings, disregarded the message as an informal communication, and resolved to keep a hostile attitude to the last. He did his best to rouse the fury of the Indians. Among other devices, he displayed upon a pole, before the yelling multitude, the effigy of a crow pecking a man’s head; the crow representing himself, and the head, observes Rogers, “being meant for my own.” All his efforts were unavailing,129 and his faithless allies showed unequivocal symptoms of defection in the hour of need. Rogers had now entered the mouth of the River Detroit, whence he sent forward Captain Campbell with a copy of the capitulation, and a letter from the Marquis de Vaudreuil, directing that the place should be given up, in accordance with the terms agreed upon between him and General Amherst. Belètre was forced to yield, and with a very ill grace declared himself and his garrison at the disposal of the English commander. The whale boats of the rangers moved slowly upwards between the low banks of the Detroit, until at length the green uniformity of marsh and forest was relieved by the Canadian houses, which began to appear on either bank, the outskirts of the secluded and isolated settlement. Before them, on the right side, they could see the village of the Wyandots, and on the left the clustered lodges of the Pottawattamies; while, a little beyond, the flag of France was flying for the last time above the bark roofs and weather-beaten palisades of the little fortified town. The rangers landed on the opposite bank, and pitched their tents upon a meadow, while two officers, with a small detachment, went across the river to take possession of the place. In obedience to their summons, the French garrison defiled upon the plain, and laid down their arms. The fleur de lis was lowered from the flagstaff, and the cross of St. George rose aloft in its place, while seven hundred Indian warriors, lately the active allies of France, greeted the sight with a burst of triumphant yells. The Canadian militia were next called together and disarmed. The Indians looked on with amazement at their obsequious behavior, quite at a loss to understand why so many men should humble themselves before so few. Nothing is more effective in gaining the respect, or even attachment, of Indians than a display of power. The savage spectators conceived the loftiest idea of English prowess, and were astonished at the forbearance of the conquerors in not killing their vanquished enemies on the spot. It was on the twenty-ninth of November, 1760, that Detroit fell into the hands of the English. The garrison were sent as130 prisoners down the lake, but the Canadian inhabitants were allowed to retain their farms and houses, on condition of swearing allegiance to the British crown. An officer was sent southward to take possession of the forts Miami and Ouatanon, which guarded the communication between Lake Erie and the Ohio; while Rogers himself, with a small party, proceeded northward to relieve the French garrison of Michillimackinac. The storms and gathering ice of Lake Huron forced him back without accomplishing his object; and Michillimackinac, with the three remoter posts of St. Marie, Green Bay, and St. Joseph, remained for a time in the hands of the French. During the next season, however, a detachment of the 60th regiment, then called the Royal Americans, took possession of them; and nothing now remained within the power of the French, except the few posts and settlements on the Mississippi and the Wabash, not included in the capitulation of Montreal. The work of conquest was finished. The fertile wilderness beyond the Alleghanies, over which France had claimed sovereignty,—that boundless forest, with its tracery of interlacing streams, which, like veins and arteries, gave it life and nourishment,—had passed into the hands of her rival. It was by a few insignificant forts, separated by oceans of fresh water and uncounted leagues of forest, that the two great European powers, France first, and now England, endeavored to enforce their claims to this vast domain. There is something ludicrous in the disparity between the importance of the possession and the slenderness of the force employed to maintain it. A region embracing so many thousand miles of surface was consigned to the keeping of some five or six hundred men. Yet the force, small as it was, appeared adequate to its object, for there seemed no enemy to contend with. The hands of the French were tied by the capitulation, and little apprehension was felt from the red inhabitants of the woods. The lapse of two years sufficed to show how complete and fatal was the mistake. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2855/78749.html","bookId":1211,"book":{"id":1211,"title":"The Conspiracy of Pontiac and the Indian War after the Conquest of Canada","description":"简介： I chose the subject of this book as affording better opportunities than any other portion of American history for portraying forest life and the Indian character; and I have never seen reason to change this opinion. In the nineteen years that have pa...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2855","creation":"Aug 1, 2019 12:24:36 AM","modification":"Aug 1, 2019 12:24:36 AM"}}
