{"id":22266,"no":20,"title":"CHAPTER XIX THE WOODLANDS STEEPLECHASE","content":"Oh! the merry days, \\n\\n The merry days, when we were young! \\n\\n \\n\\n Sang the ladye fayre. I can hear the clear rich tones even now. Ah me! what days were those! Why will they not come back? We are scarcely of such hoar antiquity that we may not enjoy the present reasonably, when \"gracieuses\" dames and demoiselles look brightly on us with those haunting eyes of theirs. But, oh! the awakening at dawn, that is when we find the difference. How glorious was it to regain consciousness from out a realm of poet dreams, with the certainty of a day of stirring world-strife before us. At the réveille of that enchanted time, how gaily the knight donned harness and mounted steed, serenely conscious of his ability to perform his devoir \"right manful under shield,\" confident of winning his guerdon, even, perchance, a smile from the Queen of Beauty herself. \\n\\n \\n\\n Now, alas, the sky seems lowering and sad-coloured, the lines of the foe ever serried and close[Pg 188] ranked, the blows come shrewder and more difficult of parry. More than once has the knight been, by trusty squire or faithful friend, \\n\\n Dragged from amid the horses\u0027 feet, \\n\\n With dinted shield and helmet beat. \\n\\n \\n\\n We were ever and anon minded to answer in the affirmative to the \"rendez vous!\" of Fate so persistently repeated. Yet will we forward still, parrying lance-thrust here, fending sword-play there. Many a trusty comrade is down; we miss the cheery tones of a voice that sounded never far from our right arm, in feast or in foray. Yet still en avant seems more natural than halt or retreat. \\n\\n \\n\\n Ye gods! what a spring morning was that on which we hurled ourselves out of bed at Woodlands, with the full, absorbing, wildly-exciting knowledge, even in that first moment of consciousness, that The Steeplechase was to be run that day—an Olympic game in which we were to share. A truly classic conflict in which the competitors were mostly men of mark, where the spectators were friends, relatives, and sympathisers, and where divine personages in the shape of various ladies of the period, lovely and beloved, were to gaze upon our prowess, thrill at our daring, and \"weep when a warrior nobly falls.\" \\n\\n \\n\\n We had a warrior, Colonel Acland Anderson—poor fellow; we had four squatters, Molesworth and Rawdon Greene, Edmund M\u0027Neill, and \"the duffer who writes this\" reminiscence. Last, not least, we had a Chief-Justice in posse. He wasn\u0027t Sir William in those days, only a hard-riding, hard-working, manifestly rising barrister, perhaps not inaptly[Pg 189] described by a maid-servant from the Emerald Isle, at a house where he had called, and who, in the fluster of the interview, had forgotten his name, as \"a mighty plisant young man with foxy whiskers.\" \\n\\n \\n\\n We were a goodly company, all staying at Woodlands for a week or two—have people leisure and inclination to do this sort of thing now?—and this steeplechase had been improvised to take place on the plain before Woodlands House, as an acceptable variation of the ordinary programme, which comprised other entertainments besides the orthodox dance which ended the day. Was there not also another legal celebrity not as yet graced with the accolade? Cheery, cultured, courteous Redmond Barry—did he not write a charade duly enacted by us youths and maidens, besides coaching us in \"The Chough and Crow\" and divers glees and part-songs? \\n\\n \\n\\n In that Arcadian period what a nice place Woodlands was! Somehow one could afford to take life more easily in those days. The sons of the house were sometimes up the country at their stations, especially at shearing time, but managed to be a good deal at the old home. And when they were there the chatelaine wisely took heed to make home a pleasant place; to that end inviting friends and well-wishers, among whom I had the privilege to be inscribed. Great were the doings done, and very pleasant the days we spent there. \\n\\n \\n\\n Thus Woodlands stands before me, looking back over those half-forgotten days, as \"the country-house\" par excellence of the period. \\n\\n \\n\\n Neither a farm nor yet a large estate, it was something between the two, while the household and[Pg 190] the ménage generally were more in accordance with the habitudes of English country-house life than often obtains in Australia. \\n\\n \\n\\n Mr. Pomeroy Greene, resolving to make Victoria his future home, had emigrated after a comprehensive fashion—not now so common. He brought with him, in addition to his large family, a house, with men-servants and maid-servants, horses and carriages, farm tools and implements, nearly everything which he could have needed had he proceeded to free-select an uninhabited island. Was there not \"Rory O\u0027More,\" a son of \"Irish Birdcatcher\"; \"Nora Creina,\" dam by \"Drone\"; the graceful \"Taglioni,\" and the hunter \"Pickwick,\" a big, powerful, Galway-looking nag, up to any weight over any height, and not too refined to draw a cart or do a day\u0027s harrowing on a pinch? An exceedingly useful stamp of horse in a new country, most of us will admit, and quite worth his passage money. \\n\\n \\n\\n Also, in this connection, came Tom Brannigan, an active, resolute, humorous young Irishman, with a decided family likeness to one Mickey Free about him. He was stud groom, and a model retainer during the first years of the settlement of Woodlands. Let me not forget Smith, the butler, a decorous, solemn personage of staid demeanour and faultless accuracy of get-up, an occasional twinkle of the eye only at times betraying that he belonged to the Milesian and not the Saxon branch of his widely-dispersed family and vocation. \\n\\n \\n\\n Just thirteen miles from Melbourne, Woodlands was a pleasant morning or afternoon\u0027s ride—an easy drive. You left Melbourne by the Flemington road, traversed the Moonee Ponds, finally [Pg 191]debouching upon the plain, whence you saw the house, built bungalow fashion upon a wooded slope, with flanking wings and a courtyard, verandah-encircled likewise, facing eastward towards Sunbury, and on the west having an extensive outlook over plain and forest, with the sea in the distance. The landscape was extensive, \"wide and wild, and open to the air,\" but sufficiently wooded to prevent the expression of bleakness. These thoughts possibly do not occur to me as I dress provisionally in shooting coat, slippers, etc., and rush out to the stables to look at the gallant steed that is to carry C?sar and his fortunes, a game-looking Arab grey, fast and a good fencer, the property of one John Fitzgerald Leslie Foster—a guest at the time, and lent to me for the occasion. Only been a few days off grass, though otherwise in good buckle. The certainty of his being short of condition does not weigh with me, however, so anxious am I to have a throw in and sport my tops and cords. Tom Brannigan thinks \"he has a great spring in him entirely,\" and encourages me to hope that a lucky chance may land me a winner. He relates an anecdote of his brother Jim, a well-known steeplechase jock, in a race where the fences were terrific. One of the country people was heard to say, \"Sure the most of them would break their necks, but Jim Brannigan and the ould mare would have a leg to spare, somehow or somehow.\" Much comforted by this apposite reference, I shut the door, and inspect the rest of the stable. It is not a very small one. \\n\\n \\n\\n Having a look for the hundredth time at \"Rory O\u0027More\"—a beautiful brown horse, showing great quality, with a strong likeness to \"The Premier\" in[Pg 192] more than one of his points, and glancing at a couple of yearlings—I betake myself to an inspection of the battle-steeds of the day. \\n\\n \\n\\n They are a goodish lot, and in that state and condition of life which impress on me the idea that, unless under the favouring accident of a general bouleversement, my chance of winning is slender indeed. First of all stands an elegant blood-looking grey, the property of the heir-apparent, sheeted, hooded, and done up in great style. He is as \"fit as a fiddle,\" and will have on his back an exceedingly cool and determined rider—who, like Mr. Stripes, \"will not throw a chance away.\" \\n\\n \\n\\n Next to him is a powerful, hunter-looking bay, an animal which would fetch about four hundred guineas in England. Let me describe him—remembering as I do every hair in his skin. I had ridden him more than once, and the reader, if he has been home lately, will note if I have overrated his price. A three-quarter or four-fifths bred horse, bay with black points, save one white hind leg. A light, well-shaped head, a good neck, and shoulders so oblique that it took the length of the snaffle bridle to pay out for rein; flat and clean bone under the knee, deep across the heart, powerful quarter, with muscular thighs and well-bent hocks. He would have been quite in the English fashion of the present day, as he had a shortish pulled tail. Height about fifteen hands three inches, on short legs. \\n\\n \\n\\n This was \"Thur\u0027mpogue,\" the property of Edmund M\u0027Neill, of the firm of Hall and M\u0027Neill, near Daisy Hill. The portrait is that of a weight-carrier,[Pg 193] doubtless. And so he needed to be, the aforesaid Edmund being of the unusual height of six and a half feet. Though not particularly broad, it will be seen that he could not be a very light man. In another box stands a long, low, blood-like chestnut horse. He winces and lays back his ears after a fashion which indicates temper, as the boy pulls the sheet off at my instigation. The test is a true one. What little he has is proverbially bad, and he has deposited so many riders in unexpected localities by \"mount, and stream, and sea,\" that a less resolute horseman than the Chief would have fought shy of him as an investment. He is in great form, however, and as hard as nails, his close bright golden coat shining like shot satin. I involuntarily give vent to an exclamation, which denotes that my own and other people\u0027s chances have receded since interviewing \"The Master of the Rolls,\" for such is the legal luminary I now behold. \\n\\n \\n\\n Back to bedroom and bath; for by this time dressing has set in seriously all over the house, and the bachelors\u0027 apartments, in a separate wing, resound with the careless talk and frequent laughter which are sure to emanate from a number of friends in the golden prime. All sorts of opinions are volunteered about the merits of each other\u0027s horses, sarcastic hints as to horsemanship and condition, laughing retorts and confident anticipations, are to be heard on every side, welling out from the bed-chambers and along the corridors, into which, with the exuberance of youth, the inmates, in various stages of apparelling, likewise overflow. \\n\\n \\n\\n We all met at breakfast, of course. Talk about[Pg 194] suppers! There may be, doubtless, a fair share of enjoyable \"causerie,\" or even serious love-making, at supper, \"when wit and wine sparkle instead of the sun\"; but for real, honest, hearty enjoyment, when all is sanguine anticipation of excitement or success, with good weather, good spirits, and good company, commend me to a country-house at breakfast time, where the sexes are judiciously mingled, and a hunt, a steeplechase, or a picnic is on the cards. There may be a few things better in this life of ours. If so, I have seldom come across them. \\n\\n \\n\\n Of course it was then and there arranged who were to drive whom—what traps, carriages, hacks, and so on were to be requisitioned. The organisation even went so far—if my memory serves me—as that every knight should be presented with the colours of some ladye fayre—after humble petition on bended knee—by my halidome!—which he doubtless swore to carry to the front, or nobly fall. \\n\\n \\n\\n I don\u0027t retain a clear account of the preliminaries on the morning of the \"Grand National\"; but I think we must have made as much fuss and given as much trouble. When, about mid-day, we turned out on the plain below Woodlands House, where the carriages were drawn up and the spectators assembled in expectation of our appearance, the excitement had passed from the stage of tireless energy to that of fervent concentration. Each man wore an aspect of settled, unflinching resolution, such as might have befitted, in an after-time,[Pg 195] \\n\\n Those who ran the tilt that day \\n\\n With Death, and bore their lives away \\n\\n From the Balaclava Charge! \\n\\n \\n\\n Out we came at last, a fairish field to look at, men and horses, though I say it. I should premise that the leaps were composed of two-railed fences, brushed underneath, about fifteen in all, from four feet to four feet six in height, and sufficiently stiff, as the event proved. \\n\\n \\n\\n On the upper or eastern side of the course, where shade was procurable, were entrenched the carriages and non-combatants, among whom Mr. Redmond Barry, Mr. Leslie Foster, William Anderson, \"Count\" Ogilby, and other disengaged cavaliers, who did their devoir in entertaining the ladies and judiciously criticising the field. Jimmy Ellis, friend and pastoral partner of one William Stawell, a brisk, black-bearded, hard-riding little Milesian, was starter and clerk of the course. Here we came up for the last time, more or less soberly or skittishly, to the post, with cords and tops, silk jackets and caps, \"accoutred proper,\" full jockey costume being de rigueur. A correct card of the race would probably have read as follows. The colours of the riders may have partially faded out of memory\u0027s ken, inasmuch as \"it was many and many a year ago.\" \\n\\n \\n\\n 1. Mr. Molesworth Greene\u0027s grey horse \"Trifle,\" four years, pink and white—ridden by owner. \\n\\n \\n\\n 2. Mr. Stawell\u0027s \"Master of the Rolls,\" aged chestnut, scarlet and black—owner. \\n\\n \\n\\n 3. Mr. E. M\u0027Neill\u0027s bay horse \"Thur\u0027mpogue,\" blue and silver—owner. \\n\\n \\n\\n 4. Mr. Acland Anderson\u0027s bay horse \"Spider,\" ridden by Mr. Rawdon Greene—crimson and gold. \\n\\n \\n\\n [Pg 196] \\n\\n \\n\\n 5. Mr. William Anderson\u0027s chestnut horse \"Murgah,\" ridden by Mr. Acland Anderson—maroon jacket, black cap. \\n\\n \\n\\n 6. Mr. Leslie Foster\u0027s grey horse \"Achmet,\" ridden by Mr. Rolf Boldrewood—white and magenta. \\n\\n \\n\\n We are marshalled in line by Jimmy Ellis, and a good start not being so vitally important as in a flat race, we get comfortably away. \\n\\n \\n\\n Pretty close together we charge the first fence, which is negotiated with \"ease to the riders and satisfaction to the lookers-on.\" The turf is green and firm, and the distance to the next fence rather greater, so we make the pace better, and, as we near it, blood begins to tell. \\n\\n \\n\\n The brothers Greene are first over, followed by \"Thur\u0027mpogue,\" the rider of the \"Master of the Rolls\" lying off, and evidently doing a little generalship. In the second division come my grey and William Anderson\u0027s chestnut. Both clear the fence well, and pull double, as we try to keep what wind they have, available for the finish. \\n\\n \\n\\n So we fare on; each fence shows that the race will mainly lie between Molesworth Greene\u0027s grey and the chestnut of Mr. Stawell, the latter taking all his fences in stride, and looking as resolute as at the first. Rawdon Greene, Acland Anderson, and M\u0027Neill are riding jealously for second place. \\n\\n \\n\\n The pace is now as good as we can make it. We are all at the second fence from home. The grey and the chestnut, almost neck and neck, are taking their leaps together, \"Trifle\" with a slight lead. We are all going our best. It has come to the do-or-die stage, and every man sets his teeth and rides[Pg 197] for his life. We are in full view of the grand stand too. I have been taking a pull at my grey, and manage, by a rush, to send him up into respectable prominence, when Rawdon Greene\u0027s horse hits a top-rail a terrible clout, which flies up and disturbs \"Thur\u0027mpogue\u0027s\" sensitive nerves as he measures his distance for the leap. Half looking back, half jumping, he strikes the rail close to the post. It bends, but does not break. The big horse balances for a moment, and then falls, rolling heavily over his rider. \"Thur\u0027mpogue\" rises in a moment, and makes a beeline—head up and rein flying—for the nearest road to Daisy Hill—a practice \"quite frequent\" with him whenever he happens to get loose. His rider does not rise, or indeed move for a few minutes. He has broken a rib, and, like Mr. Tupman, had all the temporary supply of breath knocked out of his body. The rest of the field finish creditably close, Molesworth Greene\u0027s grey being beaten on the post by the \"Master of the Rolls.\" \\n\\n \\n\\n We did not wait there long, every one being anxious about the precise amount of damage sustained by \"Emun Mhor,\" or Long Edmund, as we heard he was called by the tenantry of the estate after his return to Ireland. Knowing that if he did not die on the field, he would naturally be anxious for the safety of such a horse as \"Thur\u0027mpogue,\" and an extremely swell Wilkinson and Kidd saddle, I started off on the track, and was lucky enough to run him down just as he was preparing to cross the Deep Creek. As I led him back I encountered Jimmy Ellis, also running the trail like a black tracker, with his head so low to the ground that he did not see me[Pg 198] till I was close on top of him. When we returned to the scene of our contest the wounded warrior was being conveyed to the house in Mrs. Anderson\u0027s barouche, doubtless receiving an amount of sympathy which fully compensated for the pain and inconvenience of his mishap. \\n\\n \\n\\n He was not able to join in the dance which delightfully finished up the day\u0027s entertainment, or, indeed, to leave his room; but he was an interesting personage thenceforth, with his arm in a sling, and gained prestige and consideration during the remainder of the revels. \\n\\n \\n\\n The worst of these brief sketches, roughed off at intervals snatched from a busy life when \\n\\n Mournful memory sitteth singing \\n\\n Of the days that are no more, \\n\\n \\n\\n is that melancholy reflections will obtrude themselves. How many of one\u0027s comrades who made the joy of that pleasant time are no more! Of that same cheery gathering, how many lie low—how small a party should we now make could we meet—how different would be our greetings! \\n\\n \\n\\n It boots not to grieve. If we don\u0027t ride steeplechases, or try conclusions with the half-tamed steed, we still find a warm place in our hearts for a good hack. His Honour Sir William Stawell doesn\u0027t do much in the four-in-hand line nowadays, but I hear that he can walk up a mountain yet, and do his share of bush travelling in vacation. Life is but a battlefield at best, and we, the survivors of more than one decisive action, must bow to the merciful fate which has kept us so far unscathed, while in[Pg 199] secret we make moan over those who lie beneath green turf or murmuring wave, desert sand or wild-wood tree; whose place in our hearts, spite of careless speech and smiling brow, may never be filled up. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1709/50343.html","bookId":1148,"book":{"id":1148,"title":"Old Melbourne Memories","description":"简介： These reminiscences of the early days of Melbournea city which, as a family, we helped to foundawakened, when first published in the columns of the Australasian, an amount of general interest most gratifying to the writer....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1709","creation":"Aug 1, 2019 12:24:28 AM","modification":"Aug 1, 2019 12:24:28 AM"}}
