{"id":1174,"no":9,"title":"VIII THE FINAL CAMPAIGN","content":"After this close escape, it was clear to Grant as it had been clear to Lincoln that whatever forces were concentrated before Petersburg, the line of advance for Confederate invaders through the Shenandoah must be blocked. General Sheridan was placed in charge of the army of the Shenandoah and the 19th corps, instead of returning to the trenches of the James, marched on from Washington to Martinsburg and Winchester. In September, the commander in Washington had the satisfaction of hearing that his old assailant Early had been sent \"whirling through Winchester\" by the fierce advance of Sheridan. Lincoln recognised the possibility that Early might refuse to stay defeated and might make use, as had so often before been done by Confederate commanders in the Valley, of the short interior line to secure reinforcements from Richmond and to make a fresh attack. On the 29th of September, twenty days before this attack came off, Lincoln writes to Grant: \"Lee may be planning to reinforce Early. Care should be taken to trace any movement of troops westward.\" On the 19th of October, the persistent old fighter Early, not willing to acknowledge himself beaten and understanding that he had to do with an army that for the moment did not have the advantage of Sheridan\u0027s leadership, made his plucky, and for the time successful, fight at Cedar Creek. The arrival of Sheridan at the critical hour in the afternoon of the 19th of October did not, as has sometimes been stated, check the retreat of a demoralised army. Sheridan found his army driven back, to be sure, from its first position, but in occupation of a well supported line across the pike from which had just been thrown back the last attack made by Early\u0027s advance. It was Sheridan however who decided not only that the battle which had been lost could be regained, but that the work could be done to best advantage right away on that day, and it was Sheridan who led his troops through the too short hours of the October afternoon back to their original position from which before dark they were able to push Early\u0027s fatigued fighters across Cedar Creek southward. Lincoln had found another man who could fight. He was beginning to be able to put trust in leaders who, instead of having to be replaced, were with each campaign gathering fresh experience and more effective capacity. From the West also came reports, in this autumn of 1864, from a fighting general. Sherman had carried the army, after its success at Chattanooga, through the long line of advance to Atlanta, by outflanking movements against Joe Johnston, the Fabius of the Confederacy, and when Johnston had been replaced by the headstrong Hood, had promptly taken advantage of Hood\u0027s rashness to shatter the organisation of the army of Georgia. The capture of Atlanta in September, 1864, brought to Lincoln in Washington and to the North the feeling of certainty that the days of the Confederacy were numbered. The second invasion of Tennessee by the army of Hood, rendered possible by the march of Sherman to the sea, appeared for the moment to threaten the control that had been secured of the all-important region of which Nashville was the centre, but Hood\u0027s march could only be described as daring but futile. He had no base and no supplies. His advance did some desperate fighting at the battle of Franklin and succeeded in driving back the rear-guard of Thomas\u0027s army, ably commanded by General Schofield, but the Confederate ranks were so seriously shattered that when they took position in front of Nashville they no longer had adequate strength to make the siege of the city serious even as a threat. Thomas had only to wait until his own preparations were completed and then, on the same day in December on which Sherman was entering Savannah, Thomas, so to speak, \"took possession\" of Hood\u0027s army. After the fight at Nashville, there were left of the Confederate invaders only a few scattered divisions. It was just before the news of the victory at Nashville that Lincoln made time to write the letter to Mrs. Bixby whose name comes into history as an illustration of the thoughtful sympathy of the great captain: \"I have been shown in the files of the War Department a statement of the adjutant-general of Massachusetts that you are the mother of five sons who died gloriously on the field of battle. I feel how weak and fruitless must be any words of mine which should attempt to beguile you from the grief of a loss so overwhelming, but I cannot refrain from tendering to you the consolation that may be found in the thanks of the Republic they died to save. I pray that our Heavenly Father may assuage the anguish of your bereavement and leave you only the cherished memory of the loved and lost and the pride that must be yours to have laid so costly a sacrifice upon the altar of freedom.\" In March, 1864, Lincoln writes to Grant: \"New York votes to give votes to the soldiers. Tell the soldiers.\" The decision of New York in regard to the collection from the soldiers in each field of the votes for the coming Presidential election was in line with that arrived at by all of the States. The plan presented difficulties and, in connection with the work of special commissioners, it involved also expense. It was, however, on every ground desirable that the men who were risking their lives in defence of the nation should be given the opportunity of taking part in the selection of the nation\u0027s leader, who was also under the Constitution the commander-in-chief of the armies in the field. The votes of some four hundred thousand men constituted also an important factor in the election itself. I am not sure that the attempt was ever made to separate and classify the soldiers\u0027 vote but it is probable that although the Democratic candidate was McClellan, a soldier who had won the affection of the men serving under him, and the opposing candidate was a civilian, a substantial majority of the vote of the soldiers was given to Lincoln. Secretary Chase had fallen into the habit of emphasising what he believed to be his indispensability in the Cabinet by threatening to resign, or even by submitting a resignation, whenever his suggestions or conclusions met with opposition. These threats had been received with patience up to the point when patience seemed to be no longer a virtue; but finally, when (in May, 1864) such a resignation was tendered under some aggravation of opposition or of criticism, very much to Chase\u0027s surprise the resignation was accepted. The Secretary had had in train for some months active plans for becoming the Republican candidate for the Presidential campaign of 1864. Evidence had from time to time during the preceding year been brought to Lincoln of Chase\u0027s antagonism and of his hopes of securing the leadership of the party. Chase\u0027s opposition to certain of Lincoln\u0027s policies was doubtless honest enough. He had brought himself to believe that Lincoln did not possess the force and the qualities required to bring the War to a close. He had also convinced himself that he, Chase, was the man, and possibly was the only man, who was fitted to meet the special requirements of the task. Mr. Chase did possess the confidence of the more extreme of the anti-slavery groups throughout the country. His administration of the Treasury had been able and valuable, but the increasing difficulty that had been found in keeping the Secretary of the Treasury in harmonious relations with the other members of the administration caused his retirement to be on the whole a relief. Lincoln came to the conclusion that more effective service could be secured from some other man, even if possessing less ability, whose temperament made it possible for him to work in co-operation. The unexpected acceptance of the resignation caused to Chase and to Chase\u0027s friends no little bitterness, which found vent in sharp criticisms of the President. Neither bitterness nor criticisms could, however, prevent Lincoln from retaining a cordial appreciation for the abilities and the patriotism of the man, and, later in the year, Lincoln sent in his nomination as Chief Justice of the Supreme Court. Chase himself, in his lack of capacity to appreciate the self-forgetfulness of Lincoln\u0027s nature, was probably more surprised by his nomination as Chief Justice than he had been by the acceptance of his resignation as Secretary of the Treasury. In July, 1864, comes a fresh risk of international complications through the invasion of Mexico by a French army commanded by Bazaine, seven years later to be known as the (more or less) hero of Metz. Lotus Napoleon had been unwilling to give up his dream of a French empire, or of an empire instituted under French influence, in the Western Hemisphere. He was still hopeful, if not confident, that the United States would not be able to maintain its existence; and he felt assured that if the Southern Confederacy should finally be established with the friendly co-operation of France, he would be left unmolested to carry out his own schemes in Mexico. He had induced an honest-minded but not very clearheaded Prince, Maximilian, the brother of the Emperor of Austria, to accept a throne in Mexico to be established by French bayonets, and which, as the result showed, could sustain itself only while those bayonets were available. The presence of French troops on American soil brought fresh anxieties to the administration; but it was recognised that nothing could be done for the moment, and Lincoln and his advisers were hopeful that the Mexicans, before their capital had been taken possession of by the invader, would be able to maintain some national government until, with the successful close of its own War, the United States could come to the defence of the sister republic. The extreme anti-slavery group of the Republican party had, as indicated, never been fully satisfied with the thoroughness of the anti-slavery policy of the administration and Mr. Chase retained until the action of the convention in June the hope that he might through the influence of this group secure the Presidency. Lincoln remarks in connection with this candidacy: \"If Chase becomes President, all right. I hope we may never have a worse man.\" From the more conservative wing of the Republican party came suggestions as to the nomination of Grant and this plan brought from Lincoln the remark: \"If Grant takes Richmond, by all means let him have the nomination.\" When the delegates came together, however, in Baltimore, it was evident that, representing as they did the sober and well-thought-out convictions of the people, no candidacy but that of Lincoln could secure consideration and his nomination was practically unanimous. The election in November gave evidence that, even in the midst of civil war, a people\u0027s government can sustain the responsibility of a national election. The large popular majorities in nearly all of the voting States constituted not only a cordial recognition of the service that was being rendered by Lincoln and by Lincoln\u0027s administration, but a substantial assurance that the cause of nationality was to be sustained with all the resources of the nation. The Presidential election of this year gave the final blow to the hopes of the Confederacy. I had myself a part in a very small division of this election, a division which could have no effect in the final gathering of the votes, but which was in a way typical of the spirit of the army. On the 6th of November, 1864, I was in Libby Prison, having been captured at the battle of Cedar Creek in October. It was decided to hold a Presidential election in the prison, although some of us were rather doubtful as to the policy and anxious in regard to the result. The exchange of prisoners had been blocked for nearly a year on the ground of the refusal on the part of the South to exchange the coloured troops or white officers who held commissions in coloured regiments. Lincoln took the ground, very properly, that all of the nation\u0027s soldiers must be treated alike and must be protected by a uniform policy. Until the coloured troops should be included in the exchange, \"there can,\" said Lincoln, \"be no exchanging of prisoners.\" This decision, while sound, just, and necessary, brought, naturally, a good deal of dissatisfaction to the men in prison and to their friends at home. When I reached Libby in October, I found there men who had been prisoners for six or seven months and who (as far as they lived to get out) were to be prisoners for five months more. Through the winter of 1864-65, the illness and mortality in the Virginia prisons of Libby and Danville were very severe. It was in fact a stupid barbarity on the part of the Confederate authorities to keep any prisoners in Richmond during that last winter of the War. It was not easy to secure by the two lines of road (one of which was continually being cut by our troops) sufficient supplies for Lee\u0027s army. It was difficult to bring from the granaries farther south, in addition to the supplies required for the army, food for the inhabitants of the town. It was inevitable under the circumstances that the prisoners should be neglected and that in addition to the deaths from cold (the blankets, the overcoats, and the shoes had been taken from the prisoners because they were needed by the rebel troops) there should be further deaths from starvation. It was not unnatural that under such conditions the prisoners should have ground not only for bitter indignation with the prison authorities, but for discontent with their own administration. One may in fact be surprised that starving and dying men should have retained any assured spirit of loyalty. When the vote for President came to be counted, we found that we had elected Lincoln by more than three to one. The soldiers felt that Lincoln was the man behind the guns. The prison votes, naturally enough, reached no ballot boxes and my individual ballot in any case would not have been legal as I was at the time but twenty years of age. I can but feel, however, that this vote of the prisoners was typical and important, and I have no doubt it was so recognised when later the report of the voting reached Washington. In December, 1864, occurred one of the too-frequent cabals on the part of certain members of the Cabinet. Pressure was brought to bear upon Lincoln to get rid of Seward. Lincoln\u0027s reply made clear that he proposed to remain President. He says to the member reporting for himself and his associates the protest against Seward: \"I propose to be the sole judge as to the dismissal or appointment of the members of my Cabinet.\" Lincoln could more than once have secured peace within the Cabinet and a smoother working of the administrative machinery if he had been willing to replace the typical and idiosyncratic men whom he had associated with himself in the government by more commonplace citizens, who would have been competent to carry on the routine responsibilities of their posts. The difficulty of securing any consensus of opinion or any working action between men differing from each other as widely as did Chase, Stanton, Blair, and Seward, in temperament, in judgment, and in honest convictions as to the proper policy for the nation, was an attempt that brought upon the chief daily burdens and many keen anxieties. Lincoln insisted, however, that it was all-important for the proper carrying on of the contest that the Cabinet should contain representatives of the several loyal sections of the country and of the various phases of opinion. The extreme anti-slavery men were entitled to be heard even though their spokesman Chase was often intemperate, ill-judged, bitter, and unfair. The Border States men had a right to be represented and it was all-essential that they should feel that they had a part in the War government even though their spokesman Blair might show himself, as he often did show himself, quite incapable of understanding, much less of sympathising with, the real spirit of the North. Stanton might be truculent and even brutal, but he was willing to work, he knew how to organise, he was devotedly loyal. Seward, scholar and statesman as he was, had been ready to give needless provocation to Europe and was often equally ill-judged in his treatment of the conservative Border States on the one hand and of the New England abolitionists on the other, but Seward was a patriot as well as a scholar and was a representative not only of New York but of the best of the Whig Republican sentiment of the entire North, and Seward could not be spared. It is difficult to recall in history a government made up of such discordant elements which through the patience, tact, and genius of one man was made to do effective work. In February, 1865, in response to suggestions from the South which indicated the possibility of peace, Lincoln accepted a meeting with Alexander H. Stephens and two other commissioners to talk over measures for bringing the War to a close. The meeting was held on a gun-boat on the James River. It seems probable from the later history that Stephens had convinced himself that the Confederacy could not conquer its independence and that it only remained to secure the best terms possible for a surrender. On the other hand, Jefferson Davis was not yet prepared to consider any terms short of a recognition of the independence of the Confederacy, and Stephens could act only under the instructions received from Richmond. It was Lincoln\u0027s contention that the government of the United States could not treat with rebels (or, dropping the word \"rebels,\" with its own citizens) in arms. \"The first step in negotiations, must,\" said Lincoln, \"be the laying down of arms. There is no precedent in history for a government entering into negotiations with its own armed citizens.\" \"But there is a precedent, Mr. Lincoln,\" said Stephens, \"King Charles of England treated with the Cromwellians.\" \"Yes,\" said Lincoln, \"I believe that is so. I usually leave historical details to Mr. Seward, who is a student. It is, however, my memory that King Charles lost his head.\" It soon became evident that there was no real basis for negotiations, and Stephens and his associates had to return to Richmond disappointed. In the same month, was adopted by both Houses of Congress the Thirteenth Amendment, which prohibited slavery throughout the whole dominion of the United States. By the close of 1865, this amendment had been confirmed by thirty-three States. It is probable that among these thirty-three there were several States the names of which were hardly familiar to some of the older citizens of the South, the men who had accepted the responsibility for the rebellion. The state of mind of these older Southerners in regard more particularly to the resources of the North-west was recalled to me years after the War by an incident related by General Sherman at a dinner of the New England Society. Sherman said that during the march through Georgia he had found himself one day at noon, when near the head of his column, passing below the piazza of a comfortable-looking old plantation house. He stopped to rest on the piazza with one or two of his staff and was received by the old planter with all the courtliness that a Southern gentleman could show, even to an invader, when doing the honours of his own house. The General and the planter sat on the piazza, looking at the troops below and discussing, as it was inevitable under the circumstances that they must discuss, the causes of the War. \"General,\" said the planter, \"what troops are those passing below?\" The General leans over the piazza, and calls to the standard bearers, \"Throw out your flag, boys,\" and as the flag was thrown out, he reports to his host, \"The 30th Wisconsin.\" \"Wisconsin?\" said the planter, \"Wisconsin? Where is Wisconsin?\" \"It is one of the States of the North-west,\" said Sherman. \"When I was studying geography,\" said the planter, \"I knew of Wisconsin simply as the name of a tribe of Indians. How many men are there in a regiment?\" \"Well, there were a thousand when they started,\" said Sherman. \"Do you mean to say,\" said the planter, \"that there is a State called Wisconsin that has sent thirty thousand men into your armies?\" \"Oh, probably forty thousand,\" answered Sherman. With the next battalion the questions and the answers are repeated. The flag was that of a Minnesota regiment, say the 32d. The old planter had never heard that there was such a State. \"My God!\" he said when he had figured out the thousands of men who had come to the front, from these so-called Indian territories, to maintain the existence of the nation, \"If we in the South had known that you had turned those Indian territories into great States, we never should have gone into this war.\" The incident throws a light upon the state of mind of men in the South, even of well educated men in the South, at the outbreak of the War. They might, of course, have known by statistics that great States had grown up in the North-west, representing a population of millions and able themselves to put into the field armies to be counted by the thousand. They might have realised that these great States of the North-west were vitally concerned with the necessity of keeping the Mississippi open for their trade from its source to the Gulf of Mexico. They might have known that those States, largely settled from New England, were absolutely opposed to slavery. This knowledge was within their reach but they had not realised the facts of the case. It was their feeling that in the coming contest they would have to do only with New England and the Middle States and they felt that they were strong enough to hold their own against this group of opponents. That feeling would have been justified. The South could never have been overcome and the existence of the nation could never have been maintained if it had not been for the loyal co-operation and the magnificent resources of men and of national wealth that were contributed to the cause by the States of the North-west. In 1880, I had occasion, in talking to the two thousand students of the University of Minnesota, to recall the utterance of the old planter. The students of that magnificent University, placed in a beautiful city of two hundred and fifty thousand inhabitants, found it difficult on their part to realise, amidst their laughter at the ignorance of the old planter, just what the relations of the South had been before the War to the new free communities of the North-west. In February, 1865, with the fall of Fort Fisher and the capture of Wilmington, the control of the coast of the Confederacy became complete. The Southerners and their friends in Great Britain and the Bahamas (a group of friends whose sympathies for the cause were very much enhanced by the opportunity of making large profits out of their friendly relations) had shown during the years of the War exceptional ingenuity, daring, and persistence in carrying on the blockade-running. The ports of the British West Indies were very handy, and, particularly during the stormy months of the winter, it was hardly practicable to maintain an absolutely assured barrier of blockades along a line of coast aggregating about two thousand miles. The profits on a single voyage on the cotton taken out and on the stores brought back were sufficient to make good the loss of both vessel and cargo in three disastrous trips. The blockade-runners, Southerners and Englishmen, took their lives in their hands and they fairly earned all the returns that came to them. I happened to have early experience of the result of the fall of Fort Fisher and of the final closing of the last inlet for British goods. I was at the time in prison in Danville, Virginia. I was one of the few men in the prison (the group comprised about a dozen) who had been fortunate enough to retain a tooth-brush. We wore our tooth-brushes fastened into the front button-holes of our blouses, partly possibly from ostentation, but chiefly for the purpose of keeping them from being stolen. I was struck by receiving an offer one morning from the lieutenant of the prison guard of $300 for my tooth-brush. The \"dollars\" meant of course Confederate dollars and I doubtless hardly realised from the scanty information that leaked into the prison how low down in February, 1865, Confederate currency had depreciated. But still it was a large sum and the tooth-brush had been in use for a number of months. It then leaked out from a word dropped by the lieutenant that no more English tooth-brushes could get into the Confederacy and those of us who had been studying possibilities on the coast realised that Fort Fisher must have fallen. In this same month of February, into which were crowded some of the most noteworthy of the closing events of the War, Charleston was evacuated as Sherman\u0027s army on its sweep northward passed back of the city. I am not sure whether the fiercer of the old Charlestonians were not more annoyed at the lack of attention paid by Sherman to the fire-eating little city in which four years back had been fired the gun that opened the War, than they would have been by an immediate and strenuous occupation. Sherman had more important matters on hand than the business of looking after the original fire-eaters. He was hurrying northward, close on the heels of Johnston, to prevent if possible the combination of Johnston\u0027s troops with Lee\u0027s army which was supposed to be retreating from Virginia. On the 4th of March comes the second inaugural, in which Lincoln speaks almost in the language of a Hebrew prophet. The feeling is strong upon him that the clouds of war are about to roll away but he cannot free himself from the oppression that the burdens of the War have produced. The emphasis is placed on the all-important task of bringing the enmities to a close with the end of the actual fighting. He points out that responsibilities rest upon the North as well as upon the South and he invokes from those who under his leadership are bringing the contest to a triumphant close, their sympathy and their help for their fellow-men who have been overcome. The address is possibly the most impressive utterance ever made by a national leader and it is most characteristic of the fineness and largeness of nature of the man. I cite the closing paragraph: \"If we shall suppose that slavery is one of those offences which in the providence of God needs must come, and which having continued through His appointed time, He now wills to remove, and that He gives to both North and South this terrible war as the woe to those by whom the offence came, shall we discern therein any departure from those Divine attributes, which the believers in the Living God always ascribe to Him? Fondly do we hope, fervently do we pray, that this mighty scourge of war may speedily pass away. Yet if God wills that it should continue until all the wealth piled by the bondsmen in two hundred and fifty years of unrequited toil shall be sunk, and until every drop of blood drawn with the lash shall be paid for by another drop of blood drawn by the War, as was said two thousand years ago so still it must be said, that the judgments of the Lord are true, and righteous altogether.... With malice towards none, with charity for all, with firmness in the right as God gives us to see the right, let us strive to finish the work we are in, to bind up the nation\u0027s wounds, to care for him who shall have borne the battle and for his widow and for his orphans, to do all which may achieve and cherish a just and a lasting peace among ourselves and with all nations.\" After the election of 1864, Lincoln\u0027s word had been \"a common cause, a common interest, and a common country.\" The invocation in this last inaugural is based upon the understanding that there is again a common country and that in caring for those who have been in the battle and in the binding up of the wounds, there is to be no distinction between the men of the grey and those of the blue. At the close of February, Lee, who realises that his weakened lines cannot much longer be maintained, proposes to Grant terms of adjustment. Grant replies that his duties are purely military and that he has no authority to discuss any political relations. On the first of April, the right wing of Lee\u0027s army is overwhelmed and driven back by Sheridan at Five Forks, and on the day following Richmond is evacuated by the rear-guard of Lee\u0027s army. The defence of Richmond during the long years of the War (a defence which was carried on chiefly from the entrenchments of Petersburg), by the skill of the engineers and by the patient courage of the troops, had been magnificent. It must always take a high rank in the history of war operations. The skilful use made of positions of natural strength, the high skill shown in the construction of works to meet first one emergency and then another, the economic distribution of constantly diminishing resources, the clever disposition of forces, (which during the last year were being steadily reduced from month to month), in such fashion that at the point of probable contact there seemed to be always men enough to make good the defence, these things were evidence of the military skill, the ingenuity, the resourcefulness, and the enduring courage of the leaders. The skill and character of Lee and his associates would however of course have been in vain and the lines would have been broken not in 1865, but in 1863 or in 1862, if it had not been for the magnificent patience and heroism of the rank and file that fought in the grey uniform under the Stars and Bars and whose fighting during the last of those months was done in tattered uniforms and with a ration less by from one quarter to one half than that which had been accepted as normal. On the second of April, the Stars and Stripes are borne into Richmond by the advance brigade of the right wing of Grant\u0027s army under the command of General Weitzel. There was a certain poetic justice in the decision that the responsibility for making first occupation of the city should be entrusted to the coloured troops. The city had been left by the rear-guard of the Confederate army in a state of serious confusion. The Confederate general in charge (Lee had gone out in the advance hoping to be able to break his way through to North Carolina) had felt justified, for the purpose of destroying such army stores (chiefly ammunition) as remained, in setting fire to the storehouses, and in so doing he had left whole quarters of the city exposed to flame. White stragglers and negroes who had been slaves had, as would always be the case where all authority is removed, yielded to the temptation to plunder, and the city was full of drunken and irresponsible men. The coloured troops restored order and appear to have behaved with perfect discipline and consideration. The marauders were arrested, imprisoned, and, when necessary, shot. The fires were put out as promptly as practicable, but not until a large amount of very unnecessary damage and loss had been brought upon the stricken city. The women who had locked themselves into their houses, more in dread of the Yankee invader than of their own street marauders, were agreeably surprised to find that their immediate safety and the peace of the town depended upon the invaders and that the first battalions of these were the despised and much hated blacks. Upon the 4th of April, against the counsel and in spite of the apprehensions of nearly all his advisers, Lincoln insisted upon coming down the river from Washington and making his way into the Rebel capital. There was no thought of vaingloriousness or of posing as the victor. He came under the impression that some civil authorities would probably have remained in Richmond with whom immediate measures might be taken to stop unnecessary fighting and to secure for the city and for the State a return of peaceful government. Thomas Nast, who while not a great artist was inspired to produce during the War some of the most graphic and storytelling records in the shape of pictures of events, made a drawing which was purchased later by the New York union League Club, showing Lincoln on his way through Main Street, with the coloured folks of the town and of the surrounding country crowding about the man whom they hailed as their deliverer, and in their enthusiastic adoration trying to touch so much as the hem of his garment. The picture is history in showing what actually happened and it is pathetic history in recalling how great were the hopes that came to the coloured people from the success of the North and from the certainty of the end of slavery. It is sad to recall the many disappointments that during the forty years since the occupation of Richmond have hampered the uplifting of the race. Lincoln\u0027s hope that some representative of the Confederacy might have remained in Richmond, if only for the purpose of helping to bring to a close as rapidly as possible the waste and burdens of continued war, was not realised. The members of the Confederate government seem to have been interested only in getting away from Richmond and to have given no thought to the duty they owed to their own people to cooperate with the victors in securing a prompt return of law and order. On the 9th of April, came the surrender of Lee at Appomattox, four years, less three days, from the date of the firing of the first gun of the War at Charleston. The muskets turned in by the ragged and starving files of the remnants of Lee\u0027s army represented only a small portion of those which a few days earlier had been holding the entrenchments at Petersburg. As soon as it became evident that the army was not going to be able to break through the Federal lines and begin a fresh campaign in North Carolina, the men scattered from the retreating columns right and left, in many cases carrying their muskets to their own homes as a memorial fairly earned by plucky and persistent service. There never was an army that did better fighting or that was better deserving of the recognition, not only of the States in behalf of whose so-called \"independence\" the War had been waged, but on the part of opponents who were able to realise the character and the effectiveness of the fighting. The scene in the little farm-house where the two commanders met to arrange the terms of surrender was dramatic in more ways than one. General Lee had promptly given up his own baggage waggon for use in carrying food for the advance brigade and as he could save but one suit of clothes, he had naturally taken his best. He was, therefore, notwithstanding the fatigues and the privations of the past week, in full dress uniform. He was one of the handsomest men of his generation, and his beauty was not only of feature but of expression of character. Grant, who never gave much thought to his personal appearance, had for days been away from his baggage train, and under the urgency of keeping as near as possible to the front line with reference to the probability of being called to arrange terms for surrender, he had not found the opportunity of securing a proper coat in place of his fatigue blouse. I believe that even his sword had been mislaid, but he was able to borrow one for the occasion from a staff officer. When the main details of the surrender had been talked over, Grant looked about the group in the room, which included, in addition to two staff officers who had come with Lee, a group of five or six of his own assistants, who had managed to keep up with the advance, to select the aid who should write out the paper. His eye fell upon Colonel Ely Parker, a brigade commander who had during the past few months served on Grant\u0027s staff. \"Colonel Parker, I will ask you,\" said Grant, \"as the only real American in the room, to draft this paper.\" Parker was a full-blooded Indian, belonging to one of the Iroquois tribes of New York. Grant\u0027s suggestion that the United States had no requirement for the horses of Lee\u0027s army and that the men might find these convenient for \"spring ploughing\" was received by Lee with full appreciation. The first matter in order after the completion of the surrender was the issue of rations to the starving Southern troops. \"General Grant,\" said Lee, \"a train was ordered by way of Danville to bring rations to meet my army and it ought to be now at such a point,\" naming a village eight or nine miles to the south-west. General Sheridan, with a twinkle in his eye, now put in a word: \"The train from the south is there, General Lee, or at least it was there yesterday. My men captured it and the rations will be available.\" General Lee turns, mounts his old horse Traveller, a valued comrade, and rides slowly through the ranks first of the blue and then of the grey. Every hat came off from the men in blue as an expression of respect to a great soldier and a true gentleman, while from the ranks in grey there was one great sob of passionate grief and finally, almost for the first time in Lee\u0027s army, a breaking of discipline as the men crowded forward to get a closer look at, or possibly a grasp of the hand of, the great leader who had fought and failed but whose fighting and whose failure had been so magnificent.","sourceLink":"http://novel.tingroom.com/mingren/1529/45668.html","bookId":42,"book":{"id":42,"title":"Abraham Lincoln","description":"简介： 亚伯拉罕林肯（Abraham Lincoln，1809年2月12日－1865年4月15日），美国政治家、思想家，黑人奴隶制的废除者。第16任美国总统，其任总统期间，美国爆发内战，史称南北战争，林肯坚决反对国家分裂。他废除了叛乱各州的奴隶制度，颁布了《宅地法》、《解放黑人奴隶宣言》...","cover":"https://cunovel.com/defaultCover.png","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/1529","creation":"Aug 1, 2019 12:18:13 AM","modification":"Aug 1, 2019 12:18:13 AM"}}
