{"id":27256,"no":23,"title":"CHAPTER XXII. NEARING THE GOAL.","content":"\"I suppose Miss Netta is in bed?\" Hilda asked, as she entered the house. \"Yes, miss; she and Miss Purcell went to their rooms soon after ten o\u0027clock.\" Hilda ran upstairs to Netta\u0027s room. \"Are you awake, Netta?\" she asked, as she opened the door. \"Well, I think I was asleep, Hilda; I didn\u0027t intend to go off, for I made sure that you would come in for a chat, as usual, when you got back; but I think I must have dozed off.\" \"Well, if you had been so sound asleep that I had had to violently wake you up, I should have done so. I have had my chance, Netta. Simcoe and his friend were in a box opposite to ours, and I have learned where Walter is.\" \"That is news indeed,\" Netta exclaimed, leaping up; \"that is worth being awakened a hundred times for. Please hand me my dressing-gown. Now let us sit down and talk it over comfortably.\" Hilda then repeated the whole conversation that she had overheard. \"Splendid!\" Netta exclaimed, clapping her hands; \"and that man was right, dear, in feeling uncomfortable when your glasses were fixed on his face, though he little guessed what reason he had for the feeling. Well, it is worth all the four years you spent with us to have learned to read people\u0027s words from their lips. I always said that you were my best pupil, and you have proved it so now. What is to be done next?\" \"We shall need a general council for that!\" Hilda[Pg 275] laughed. \"We must do nothing rash now that success seems so close; a false move might spoil everything.\" \"Yes, we shall have to be very careful. This bargeman may not live near there at all; though no doubt he goes there pretty often, as letters are sent there for him. Besides, Simcoe may have someone stationed there to find out whether any inquiries have been made for a missing child.\" \"Yes, I see that we shall have to be very careful, Netta, and we must not spoil our chances by being over hasty.\" They talked for upwards of an hour, and then went to their beds. The next morning Roberts took a note to Dr. Leeds. It contained only a few lines from Hilda: \"My Dear Dr. Leeds: We have found a most important clew, and are going to have a consultation, at which, of course, we want you to be present. Could you manage to be at Mr. Pettigrew\u0027s office at three o\u0027clock? If so, on hearing from you, I will send to him to make an appointment.\" The answer came back: \"I congratulate you heartily, and will meet you at three o\u0027clock at Pettigrew\u0027s office.\" A note was at once sent off to the lawyer\u0027s to make the appointment, and the girls arrived with Miss Purcell two or three minutes before the hour, and were at once shown into Mr. Pettigrew\u0027s room, where Mr. Farmer immediately joined them. \"I will wait a minute or two before I begin,\" Hilda said. \"I have asked Dr. Leeds to join us here. He has been so very kind throughout the whole matter that we thought it was only fair that he should be here.\" \"Certainly, I thoroughly agree with you. I never thought that terrible suspicion of his well founded, but he certainly took immense pains in collecting information[Pg 276] of all sorts about these native poisons, and since then has shown the greatest desire to assist in any way.\" A minute later Dr. Leeds was shown in. \"Now, Miss Covington,\" Mr. Farmer said, \"we are ready to hear your communication.\" Hilda then related what she had learned at the opera. \"Really, Miss Covington,\" Mr. Farmer continued, \"it is a thousand pities that you and your friend cannot utilize your singular accomplishment in the detective line. You ought to make a fortune by it. I have, of course, heard from my partner of the education that you had in Germany, and of your having acquired some new system by which you can understand what people are saying by watching their lips, but I certainly had no conception that it could be carried to such an extent as you have just proved it can. It is like gaining a new sense. Now I suppose you have come to us for advice as to what had best be done next.\" \"That is it, Mr. Farmer. It is quite evident to us that we must be extremely careful, for if these people suspect that we are so far on their track, they might remove Walter at once, and we might never be able to light upon a clew again.\" \"Yes, I see that. Of course, if we were absolutely in a position to prove that this child has been kept down near Pitsea with their cognizance we could arrest them at once; but, unfortunately, in the words you heard there was no mention of the child, and at present we have nothing but a series of small circumstantial facts to adduce. You believe, Mr. Pettigrew tells me, that the man who calls himself John Simcoe is an impostor who has no right to the name, and that General Mathieson was under a complete delusion when he made that extraordinary will. You believe that, or at any rate you have a suspicion that, having got the General to make the will, he administered some unknown drug that finally caused his death. You believe that, as this child alone stood between him and the inheritance, he had him carried off with the assistance of the other man. You[Pg 277] believe that the body the coroner\u0027s jury decided to be that of Walter Rivington was not his, and that the child himself is being kept out of the way somewhere in Essex, and you believe that the conversation that you most singularly overheard related to him. \"But, unfortunately, all these beliefs are unsupported by a single legal fact, and I doubt very much whether any magistrate would issue a warrant for these men\u0027s arrest upon your story being laid before him. Even if they were arrested, some confederate might hasten down to Pitsea and carry the child off; and, indeed, Pitsea may only be the meeting-place of these conspirators, and the child may be at Limehouse or at Chatham, or at any other place frequented by barges. Therefore we must for the present give up all idea of seizing these men. Any researches at Pitsea itself are clearly attended by danger, and yet I see no other way of proceeding.\" \"It seems,\" Dr. Leeds said, \"that this other man, who appears to have acted as Simcoe\u0027s agent throughout the affair, took the alarm the other day, and instead of taking a trap as usual from Tilbury, returned to the station, took the ferry across to Gravesend, and then, as we suppose, came up to town again, told Simcoe that he found he was watched, and that Simcoe must himself take the matter up. Evidently, by what Miss Covington overheard, he had instructed him where and how to communicate with this bargeman, or in case of necessity to find him. I should think that the first step would be to withdraw the men now on watch, for it is possible that they may also send down men to places in the locality of Pitsea. In point of fact, your men have been instructed to make no such inquiries, but only to endeavor to trace where Simcoe\u0027s agent drives to. Still, I think it would be as well to withdraw them at once, as they can do no further good.\" Mr. Pettigrew nodded. \"I know nothing of Pitsea,\" the doctor went on, \"but I do know Hole Haven. When I was walking the hospital, three or four of us had a little sailing-boat, and[Pg 278] used to go out from Saturday until Monday morning. Hole Haven was generally the limit of our excursions. It is a snug little harbor for small boats, and there is a comfortable old-fashioned little inn there, where we used to sleep. The coastguards were all sociable fellows, ready to chat with strangers and not averse to a small tip. Of course the same men will not be there now, nor would it be very safe to ask questions of them; for no doubt they are on friendly terms with the men on the barges which go up and down the creek. I might, however, learn something from them of the ways of these men, and I should think that, on giving my card to the petty officer in charge, I could safely question him. I don\u0027t suppose that he would know where this man Nibson has his headquarters. If he lives at Rochester, or Chatham, or at Limehouse, or Shadwell, he certainly would not know him; but if he lives at Pitsea he might know him. I fancy they keep a pretty sharp lookout on the barges. I know that the coastguard told me that there was still a good deal of smuggling carried on in the marshes between Leigh and Thames Haven. I fancy, from what he said, that the Leigh fishermen think it no harm to run a few pounds of tobacco or a keg of spirit from a passing ship, and, indeed, as there are so many vessels that go ashore on the sands below, and as they are generally engaged in unloading them or helping them to get off, they have considerable facilities that way. At any rate, as an old frequenter of the place and as knowing the landlord—that is to say if there has been no change there—no suspicion could fall upon me of going down there in reference to your affair. To-day is Friday. On Sunday morning, early, I will run down to Gravesend, hire a boat there, and will sail down to Hole Haven. It will be an outing for me, and a pleasant one; and at least I can be doing no harm.\" \"Thank you very much indeed, Dr. Leeds,\" Hilda said warmly; \"that is a splendid idea.\" On Sunday evening Dr. Leeds called at Hyde Park Gardens to report his day\u0027s work.[Pg 279] \"I think that my news is eminently satisfactory. I saw the petty officer in command of the coastguard station, and he willingly gave me all the information in his power. He knew the bargee, Bill Nibson. He is up and down the creek, he says, once and sometimes twice a week. He has got a little bit of a farm and a house on the bank of the creek a mile and a half on this side of Pitsea. They watch him pretty closely, as they do all the men who use the creek; there is not one of them who does not carry on a bit of smuggling if he gets the chance. \"\u0027I thought that was almost given up,\u0027 I said. \u0027Oh, no; it is carried on,\u0027 he replied, \u0027on a much smaller scale than it used to be, but there is plenty of it, and I should say that there is more done that way on the Thames than anywhere else. In the first place, Dutch, German, and French craft coming up the channels after dark can have no difficulty whatever in transferring tobacco and spirits into barges or fishing-boats. I need hardly say it is not ships of any size that carry on this sort of business, but small vessels, such as billy-boys and craft of that sort. They carry their regular cargoes, and probably never bring more than a few hundredweight of tobacco and a dozen or so kegs of spirits. It is doubtful whether their owners know anything of what is being done, and I should say that it is generally a sort of speculation on the part of the skipper and men. On this side the trade is no doubt in the hands of men who either work a single barge or fishing-boat of their own, or who certainly work it without the least suspicion on the part of the owners. \"\u0027The thing is so easily arranged. A man before he starts from Ostend or Hamburg, or the mouth of the Seine, sends a line to his friends here, at Rochester or Limehouse or Leigh, \"Shall sail to-night. Expect to come up the south channel on Monday evening.\" The bargeman or fisherman runs down at the time arranged, and five or six miles below the Nore brings up and shows a light. He knows that the craft he expects will not be[Pg 280] up before that time, for if the wind was extremely favorable, and they made the run quicker than they expected, they would bring up in Margate Roads till the time appointed. If they didn\u0027t arrive that night, they would do so the next, and the barge would lay there and wait for them, or the fishermen would go into Sheerness or Leigh and come out again the next night. \"\u0027You might wonder how a barge could waste twenty-four or forty-eight hours without being called to account by its owners, but there are barges which will anchor up for two or three days under the pretense that the weather is bad, but really from sheer laziness. \"\u0027That is one way the stuff comes into the country, and, so far as I can see, there is no way whatever of stopping it. The difficulty, of course, is with the landing, and even that is not great. When the tide turns to run out there are scores, I may say hundreds, of barges anchored between Chatham and Gravesend. They generally anchor close in shore, and it would require twenty times the number of coastguards there are between Chatham and Gravesend on one side, and Foulness and Tilbury on the other, to watch the whole of them and to see that boats do not come ashore. \"\u0027A few strokes and they are there. One man will wait in the boat while the other goes up onto the bank to see that all is clear. If it is, the things are carried up at once. Probably the barge has put up some flag that is understood by friends ashore; they are there to meet it, and in half an hour the kegs are either stowed away in lonely farmhouses or sunk in some of the deep ditches, and there they will remain until they can be fished up and sent off in a cart loaded with hay or something of that sort. You may take it that among the marshes on the banks of the Medway and Thames there is a pretty good deal done in the way of smuggling still. We keep a very close eye upon all the barges that come up here, but it is very seldom that we make any catch. One cannot seize a barge like the Mary Ann, that is the boat belonging to Nibson, with perhaps sixty tons of manure or[Pg 281] cement or bricks, and unload it without some specific information that would justify our doing so. Indeed, we hardly could unload it unless we took it out into the Thames and threw the contents overboard. We could not carry it up this steep, stone-faced bank, and higher up there are very few places where a barge could lie alongside the bank to be unloaded. We suspect Nibson of doing something that way, but we have never been able to catch him at it. We have searched his place suddenly three or four times, but never found anything suspicious.\u0027 \"\u0027May I ask what family the man has?\u0027 I said. \"He shook his head. \u0027There is his wife—I have seen her once or twice on board the barge as it has come in and out—and there is a boy, who helps him on the barge—I don\u0027t know whether he is his son or not. I have no idea whether he has any family, but I have never seen a child on the barge.\u0027 \"All this seemed to be fairly satisfactory. I told him that we suspected that a stolen child was kept in Nibson\u0027s house, and asked him whether one of his men off duty would, at any time, go with me in a boat and point out the house. He said that there would be no difficulty about that. My idea, Miss Covington, was that it would be by far the best plan for us to go down with a pretty strong party—that is to say, two or three men—and to go from Gravesend in a boat, arriving at Hole Haven at eleven or twelve o\u0027clock at night. I should write beforehand to the coastguard officer, asking him to have a man in readiness to guide us, and then row up to the house. In that way we should avoid all chance of a warning being sent on ahead from Pitsea, or from any other place where they might have men on watch. \"I mentioned this to the officer, and he said, \u0027Well, I don\u0027t see how you could break into the man\u0027s house. If the child is not there you might find yourself in a very awkward position, and if Nibson himself happened to be at home he would be perfectly justified in using firearms.\u0027 I said of course that was a point I must[Pg 282] consider. It is indeed a point on which we must take Mr. Pettigrew\u0027s opinion. But probably we shall have to lay an information before the nearest magistrate, though I think myself that if we were to take the officer into our confidence—and he seemed to me a bluff, hearty fellow—he would take a lot of interest in the matter, and might stretch a point, and send three or four men down after dark to search the place again for smuggled goods. You see, he has strong suspicions of the man, and has searched his place more than once. Then, when they were about it, we could enter and seize Walter. Should there be a mistake altogether, and the child not be found there, we could give the officer a written undertaking to hold him free in the very unlikely event of the fellow making a fuss about his house being entered.\" The next morning Hilda again drove up with Netta to see Mr. Pettigrew. \"We must be careful, my dear; we must be very careful,\" he said. \"If we obtain a search warrant, it can only be executed during the day, and even if the coastguards were to make a raid upon the place, we, as civilians, would not have any right to enter the house. I don\u0027t like the idea of this night business—indeed, I do not see why it should not be managed by day. Apparently, from what Dr. Leeds said, this Hole Haven is a place where little sailing-boats often go in. I don\u0027t know much of these matters, but probably in some cases gentlemen are accompanied by ladies, and no doubt sometimes these boats go up the creeks. Now, there must be good-sized boats that could be hired at Gravesend, with men accustomed to sailing them, and I can see no reason why we should not go down in a party. I should certainly wish to be there myself, and think Colonel Bulstrode should be there. You might bring your two men, and get an information laid before an Essex magistrate and obtain a warrant to search this man\u0027s place for a child supposed to be hidden there. By the way, I have a client who is an Essex magistrate; he lives near Billericay. I will have an information drawn out, and will go myself[Pg 283] with it and see him; it is only about five miles to drive from Brentwood Station. If I sent a clerk down, there might be some difficulty, whereas, when I personally explain the circumstances to him, he will, I am sure, grant it. At the same time I will arrange with him that two of the county constabulary shall be at this place, Hole Haven, at the time we arrive there, and shall accompany us to execute the warrant. Let me see,\" and he turned to his engagement book, \"there is no very special matter on for to-morrow, and I am sure that Mr. Farmer will see to the little matters that there are in my department. By the way, it was a year yesterday since the General\u0027s death, and we have this morning been served with a notice to show cause why we should not proceed at once to distribute the various legacies under his will. I don\u0027t think that refers to the bequest of the estates, though, of course, it may do so, but to the ten thousand pounds to which Simcoe is clearly entitled. Of course, we should appear by counsel in any case; but with Walter in our hands we can bring him to his knees at once, and he will have to wait some time before he touches the money. We cannot prevent his having that. He may get five years for abducting the child, but that does not affect his claim to the money.\" \"Unless, Mr. Pettigrew, we could prove that he is not John Simcoe.\" \"Certainly, my dear,\" the lawyer said, with an indulgent smile. \"Your other theories have turned out very successful, I am bound to admit; but for this you have not a shadow of evidence, while he could produce a dozen respectable witnesses in his favor. However, we need not trouble ourselves about that now. As to the abduction of the child, while our evidence is pretty clear against the other man, we have only the fact against Simcoe that he was a constant associate of his, and had an immense interest in the child being lost. The other man seems to have acted as his intermediary all through, and so far as we actually know, Simcoe has never seen the child since he was taken away. Of course, if Walter can prove[Pg 284] to the contrary, the case is clear against him; but without this it is only circumstantial, though I fancy that the jury would be pretty sure to convict. And now, how about the boat? Who will undertake that? We are rather busy at present, and could scarcely spare a clerk to go down.\" \"We will look after that, Mr. Pettigrew; it is only an hour\u0027s run to Gravesend, and it will be an amusement for us. We will take Roberts down with us. What day shall we fix it for?\" \"Well, my dear, the sooner the better. I shall get the warrant to-morrow, and there is no reason why the constable should not be at Hole Haven the next day, at, say, two in the afternoon. So if you go down to-morrow and arrange for a boat, the matter may as well be carried out at once, especially as I know that you are burning with anxiety to get the child back. Of course this rascal of a bargeman must be arrested.\" \"I should think that would depend partly on how he has treated Walter,\" Hilda said. \"I don\u0027t suppose he knows who he is, or anything of the circumstances of the case; he is simply paid so much to take charge of him. If he has behaved cruelly to him it is of course right that he should be punished; but if he has been kind to him I don\u0027t see why he should not be let off. Besides, we may want him as a witness against the others.\" \"Well, there is something in that. Of course we might, if he were arrested, allow him to turn Queen\u0027s evidence, but there is always a certain feeling against this class of witness. However, we needn\u0027t discuss that now. I suppose that we ought to allow an hour and a half or two hours to get to this place from Gravesend, but you can find that out when you hire the boat. Of course, it will depend a good deal on which way the tide is. By the way, you had better look to that at once; for if it is not somewhere near high tide when we get to Hole Haven there may not be water enough to row up the creek.\"[Pg 285] He called in one of the clerks, and told him to go out to get him an almanac with a tide-table. \"I want to know when it will be high water the day after to-morrow at Gravesend,\" he said. \"I can tell you that at once, sir. When I came across Waterloo Bridge this morning at a quarter to nine the tide was running in. I should say that it was about half-flood, and would be high about twelve o\u0027clock. So that it will be high about half-past one o\u0027clock on Wednesday. It is about three-quarters of an hour earlier at Gravesend. I don\u0027t know whether that is near enough for you, sir?\" \"Yes, that is near enough, thank you. So, you see,\" he went on after the clerk had left the room, \"the tide will be just about high when you get to Gravesend, and you will get there in about an hour, I should say. I don\u0027t know exactly how far this place is, but I should say seven or eight miles; and with a sail, or, if the wind is contrary, a couple of oars, you will not be much above an hour, and I should think that there will be still plenty of water in the creek. You had better see Colonel Bulstrode. As joint trustee he should certainly be there.\" They drove at once to the Colonel\u0027s and found him in. He had not heard of the discovery Hilda had made, and was greatly excited at the prospect of so soon recovering Walter, and bringing, as he said, \"the rascals to book.\" The next morning they went down with Roberts to Gravesend, to engage a large and roomy boat with two watermen for their trip. Just as they were entering Hyde Park Gardens, on their return, a man passed them. Roberts looked hard at him, and then said, \"If you don\u0027t want me any more now, miss, I should like to speak to that man; he is an old fellow-soldier.\" \"Certainly, Roberts. I shall not want you again for some time.\" Roberts hurried after the man. \"Sergeant Nichol,\" he said, as he came up to him, \"it is years since I saw you last.\"[Pg 286] \"I remember your face, if I do not remember your name,\" the man said. \"I am Tom Roberts. I was in your company, you know, before you went onto the staff.\" \"I remember you now, Roberts,\" and the two shook hands heartily. \"What are you doing now? If I remember right, you went as servant to General Mathieson when you got your discharge.\" \"Yes; you see, I had been his orderly for two or three years before, and when I got my discharge with my pension, I told him that I should like to stop with him if he would take me. I was with him out there for five years after; then I came home, and was with him until his death, and am still in the service of his niece, Miss Covington, one of the young ladies I was with just now. And what are you doing?\" \"I am collector for a firm in the City. It is an easy berth, and with my pension I am as comfortable as a man can wish to be.\" So they chatted for half an hour, and when they parted Roberts received a hearty invitation to look in at the other\u0027s place at Kilburn. \"Both my boys are in the army,\" he said, \"and likely to get on well. My eldest girl is married, my youngest is at home with her mother and myself; they will be pleased to see you too. The missus enjoys a gossip about India, and is always glad to welcome any old comrade of mine.\" \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3138/86282.html","bookId":824,"book":{"id":824,"title":"The Lost Heir","description":"简介： A number of soldiers were standing in the road near the bungalow of Brigadier-General Mathieson, the officer in command of the force in the cantonments of Benares and the surrounding district....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3138","creation":"Aug 1, 2019 12:19:35 AM","modification":"Aug 1, 2019 12:19:35 AM"}}
