{"id":87659,"no":14,"title":"Page 14","content":"Mark didn\u0027t dare take \"Nefertiti\" to Montresse House-there was no way he would invite her into the home where Lauren and her friends had found safety. Nor could he take her out to Sean\u0027s house, for the same reason. He would never risk the lieutenant and his fam ily\u0027s safety by bringing such a creature in.\\n\\n At least she seemed to have decided that he was dangerous to her, and she was quiet and well-behaved, accepting his lead as he moved down the street, trying to find a cafe with a courtyard and plenty of room-and sunlight.\\n\\n She protested when he chose a place and picked ouut a table. His chair was in shadow. Hers was not.\\n\\n \"Sit,\" he commanded.\\n\\n \"I\u0027m sitting.\"\\n\\n \"Talk.\"\\n\\n \"What do you want me to say?\"\\n\\n \"I want to know where you go to sleep.\"\\n\\n \"I sleep...different places.\"\\n\\n \"Who did this to you?\" he asked her.\\n\\n She waved a hand in the air dismissively. \"Who knows? Someone with money.\"\\n\\n He leaned back, shaking his head. \"You\u0027re a liar. You never worked in that club until you became a vampire. And you go somewhere in particular at night.\"\\n\\n She stared at him sulkily just as a waitress came to their table and looked enquiringly at Mark. \"Order,\" he said with a shrug. Nefertiti smiled at the waitress. \"He\u0027s so rude. But he\u0027s so good in bed that I don\u0027t care,\" she said sweetly.\\n\\n The waitress, an older woman with graying hair, stared at the two of them as if she\u0027d just been faced with the dregs of society.\\n\\n \"An ice tea, please,\" he said.\\n\\n \"I\u0027m hungry,\" Nefertiti whined.\\n\\n \"Then eat.\"\\n\\n \"He really is so commanding,\" she told the waitress. \"I\u0027ll have a hamburger.\"\\n\\n \"Medium? Medium-well?\" the waitress asked.\\n\\n Nefertiti offered her a sugary smile. \"Raw, please.\"\\n\\n \"You mean...rare? The health code suggests-\"\\n\\n \"Not rare. Raw. No bun, thanks.\"\\n\\n \"I can\u0027t give you a raw hamburger. The health code-\"\\n\\n Mark slapped a large bill on the table. \"Please just bring her a raw hamburger.\"\\n\\n With a disapproving look, the waitress left them.\\n\\n \"Where are you from?\" Mark demanded, leaning closer to her.\\n\\n \"Bourbon Street.\"\\n\\n \"Where are you from?\" he repeated.\\n\\n She smiled. \"Houma, originally. But now I\u0027m from Bourbon Street.\"\\n\\n \"So you were created on Bourbon Street?\"\\n\\n \"Ooh. Smart fella.\"\\n\\n \"So where do you go at night?\"\\n\\n \"Wherever I choose.\"\\n\\n He had the water pistol aimed at her beneath the table and let go with a short spray. She nearly jumped out of the chair. \"Bastard!\" she hissed at him.\\n\\n The waitress returned with a plate holding a raw hamburger. It was barely on the table before Nefertiti was digging into it with her fingers. The waitress made a soft sound, clearly not intended for them to heard, that was filled with disgust.\\n\\n \"Maybe you can be helped,\" Mark suggested when the waitress had gone.\\n\\n Nefertiti stopped eating for a moment and stared at him, then shook her head. \"No. I died, and I rose. There is no help.\"\\n\\n He realized suddenly that she was looking past him, over his shoulder. He turned around but saw nothing. In that split second, she was up and running.\\n\\n \"Stop!\" he shouted.\\n\\n She only kept running. He followed, practically leaping over a table to keep up with her. She turned down a side street, then into an alley. \"Stop!\" he yelled again.\\n\\n At that moment a toddler came running out of a door onto the sidewalk in front of her.\\n\\n Nefertiti stared, then grabbed the child and turned to look Mark straight in the eye.\\n\\n The little boy started to cry. From inside the house, they could hear a woman\u0027s voice calling, \"Ryan? Ryan! Where are you?\"\\n\\n Nefertiti shook her head at Mark with a curious, almost wistful smile.\\n\\n \"Don\u0027t!\" he cried.\\n\\n She opened her mouth and began to lower it, fangs extended, to the crying toddler\u0027s throat.\\n\\n He shot her with a long, continuous spray. She let out a screech of agony and dropped the boy. Smoke and steam rose from her skin, and she fell, hardly recognizable anymore as a human being but instead a writhing, shifting form, wretchedly decayed.\\n\\n He heard the sound of police sirens.\\n\\n Disgusted, Mark turned and quickly escaped the alley. He heard the mother shouting, calling the boy\u0027s name, then screaming in bone-chilling horror, no doubt as she stumbled onto Nefertiti\u0027s remains..\\n\\n As he turned onto Delphine Street, Mark saw a police cruiser, lights flashing, pass him.\\n\\n And he heard the flutter of wings overhead.\\n\\n As he walked quickly away, he thought over what had happened and realized that the woman who called herself Nefertiti had preferred extinction at his hands to facing her master and being branded a traitor.\\n\\n As he walked, he remembered hanging up on Sean back at the club. Cursing, he drew out his phone and punched in the lieutenant\u0027s cell number.\\n\\n Lauren was torn. The scream demanded-self-preservation demanded-that she run. At the same timer, she needed to know why someone was screaming. But most of all, she knew that if Deanna were to have a chance, she couldn\u0027t leave her alone again.\\n\\n That last option won out. She rushed over to Deanna\u0027s bed, wondering if whatever was happening was only a ruse to trick everyone into leaving her friend alone and vulnerable.\\n\\n Deanna\u0027s IV was still connected to her arm. She still lay on her white pillow and sheets as she had for what seemed like forever. The princess. Unmoving.\\n\\n Swallowing, her fear nearly paralyzing her, Lauren picked up Deanna\u0027s hand and fumbled for the pulse in her wrist.\\n\\n It was there, regular and strong. She breathed a sigh of relief.\\n\\n But what the hell was going on?\\n\\n Lauren had been concentrating so hard on Deanna that it was several seconds before she realized that someone had come into the room behind her.\\n\\n As she turned around, wary and tense, she heard the door to the room slam shut.\\n\\n He was there.\\n\\n Stephan. Stephan Delanskiy. Standing now at the foot of the bed. Ink dark hair fell over his forehead, contrasting with the doctor\u0027s white coat he was wearing. \"How is my patient?\" he asked very softly.\\n\\n Lauren looked toward the open window. Shouts and cries were coming from the hallway; the hospital seemed to have turned into Bedlam. But Stephan Stephan Delanskiy seemed oblivious to all that. She didn\u0027t know where he had come from, if he had stepped into the room from the hall, or if he had come through the window.\\n\\n But it didn\u0027t really matter. All that mattered was that he was there.\\n\\n She stared at him and flipped the cross she was wearing out from under her shirt.\\n\\n He smiled. \"That will not stop me, you know.\"\\n\\n \"Maybe so, but you\u0027re there, and I\u0027m here.\"\\n\\n \"Because you must come to me.\"\\n\\n \"I will never come to you.\"\\n\\n \"Eventually, you will.\" He laughed softly. \"I have my ways of doing things. Methods. Even madness, you might say. You see, this is a war. Whatever skirmish I may lose to my enemy, in the end, it is a war, and I will win. And you will come to me, because I know you.\"\\n\\n \"You cause suffering and death,\" she told him. \"You hurt people. You nearly killed my friend. You\u0027re evil, and you will not win.\"\\n\\n He smiled and shook his head, as if explaining things to a small child. \"What in life has ever led you to believe that what you call \u0027evil\u0027 cannot win? Take that silly cross around your neck. I have seen it before, and it failed to stop me then, just as it will now. He is not the salvation you think he is. And I am not death, but rather, eternal life.\"\\n\\n \"Tell that to the women you\u0027ve beheaded,\" she said softly.\\n\\n He made a dismissive sound. \"They did not deserve to live.\"\\n\\n \"You\u0027re wrong. They didn\u0027t deserve to be murdered.\"\\n\\n They could both hear footsteps then; someone was running down the toward Deanna\u0027s room.\\n\\n \"You will come to me,\" he told her again, his smile cold and certain.\\n\\n There was the sound of something slamming heavily against the door. Instinctively, Lauren looked in that direction just as the door burst open.\\n\\n Mark was there, stranding in the doorway, his gaze quickly darting around the room. He rushed over to her, drawing her close to him, his arms around her.\\n\\n \"He was here,\" he said huskily, his tone certain.\\n\\n \"Yes.\" She couldn\u0027t help it. She was trembling, even though Stephan had vanished as suddenly as he\u0027d appeared.\\n\\n \"Deanna?\"\\n\\n \"She seems to be all right.\"\\n\\n \"And...you?\"\\n\\n \"I\u0027m fine, too.\"\\n\\n He let out a sigh of relief. For a moment he seemed so weary that she longed to hold him forever, but now, more than ever, she was afraid to leave Deanna\u0027s side.\\n\\n \"What\u0027s happening here?\" she demanded.\\n\\n As if in answer, another scream echoed from down the hall.\\n\\n Even between them, Sean realized, he and Bobby couldn\u0027t manage to hold the woman.\\n\\n Leticia Lockwood was slim and delicately built, but at this moment her strength was unimaginable.\\n\\n \"I can\u0027t hold her!\" Bobby cried.\\n\\n Sean had gotten off the elevator just in time to see Bobby trying to wrench Leticia away from a gurney, where she was rabidly attacking a bag marked Type O Positive that was attached to a line transfusing into an apparently post-op gentleman of advanced years. Bobby was already sporting a swollen jaw, and hospital employees were scurrying just to get out of the way.\\n\\n \"Hey,\" Sean said firmly, grabbing hold of Leticia\u0027s shoulder as she writhed like an animal beneath Bobby.\\n\\n She screamed, a bloodcurdling sound that was horrible to hear. Then, with astounding ease, she threw Bobby clear across the hall.\\n\\n \"Damn it, stop! I don\u0027t want to shoot you!\" Sean roared.\\n\\n He might as well not have bothered. Leticia was up and flying at a hapless intern who was standing by, aghast.\\n\\n \"Shit!\" Sean swore and went tearing after her.\\n\\n He tackled her, and they hit the floor together.\\n\\n She shoved him, and he fared no better than Bobby.\\n\\n She was off again, this time making a leap for the frozen and panic-stricken head nurse, who was standing behind the desk.\\n\\n Wincing, Sean drew his weapon and fired a warning shot.\\n\\n Everyone screamed-except Leticia, who didn\u0027t even pause.\\n\\n Before Sean had a chance to shoot again, Mark Davidson came running out of Deanna\u0027s room. He saw Leticia, saw her intended victim, and took a flying leap over the desk. He caught Leticia by the shoulders and shoved her forward, crashing into a rolling cart filled with medications. Bottles and vials went flying everywhere.\\n\\n Sean waited, expecting Davidson to go flying just as he and Bobby had, but there was only silence.\\n\\n Nothing.\\n\\n He strode to the desk and looked over. Mark was straddling the girl, staring down at her and talking soothingly. \"Someone get her something quickly-a major league tranquilizer,\" Sean said.\\n\\n The head nurse, who had appeared almost catatonic with fear, suddenly sprang to life. She fumbled on the floor, searching through the wrapped needles and the different vials. In a second she was at Mark\u0027s side. Leticia began to thrash again, forcing her back, but Mark seized the hypodermic from her, and quickly inserted the needle. In a second, Leticia\u0027s wild and frantic eyes closed, and she went limp.\\n\\n Mark stayed as he was for several long seconds. Then he eased back.\\n\\n Sean strode over to him. \"You all right?\"\\n\\n \"Yeah.\"\\n\\n Suddenly hospital personnel were everywhere.\\n\\n \"I can\u0027t believe it,\" the head nurse said, stricken. \"It\u0027s Leticia. She\u0027s one of our finest nurses.\"\\n\\n \"She went insane,\" one of the interns said.\\n\\n \"Like a rabid dog!\" another claimed.\\n\\n \"Let\u0027s get her into a bed,\" an intern said.\\n\\n \"You\u0027re going to find that she needs a transfusions, and she needs it fast,\" Mark said.\\n\\n \"Are you a doctor, young man?\" the head nurse demanded.\\n\\n Mark looked up at her. \"I know what she needs,\" he said quietly. The nurse frowned as Mark rose and lifted Leticia into his arms. \"A room?\" he said.\\n\\n The head nurse just nodded. The young intern who had first suggested that she needed a bed followed Mark into an empty room and spoke quickly to the nurse. \"Pull up her chart. Her blood type must be on record.\"\\n\\n The nurse stared at him.\\n\\n \"Do it. Now.\"\\n\\n She jumped, shooting a disapproving glance at Mark, and hurried back out to the hall.\\n\\n Sean stood in the door, watching, then felt a tap on his shoulder. He turned to see Bobby standing behind him.\\n\\n \"Lauren is here, in Deanna\u0027s room. I\u0027ll be with her.\"\\n\\n \"Thanks, Bobby.\"\\n\\n Sean looked at Mark, who was standing next to the bed where Leticia now lay, completely out. \"Will the transfusion do it?\" he asked quietly.\\n\\n Mark shook his head, his uncertainty clear.\\n\\n The intern, who was checking Leticia\u0027s pulse, said, \"I think she\u0027ll be all right. She must have been under the influence of some heavy duty drug. We\u0027ll do a tox screen and find out what the hell is going on. She\u0027s one of our best nurses. I can\u0027t imagine Leticia...she never even smoked pot, sings in her church choir...\"\\n\\n A commotion in the hallway began to grow into a din. Sean stepped out to see what was going on and found patients milling around curiously and the staff trying to get them calmed down and back into their rooms.\\n\\n \"Folks, it\u0027s all over. Everything\u0027s all right,\" Sean said.\\n\\n A middle-aged woman in a hospital gown that left her more than a little exposed, suddenly pointed and started screaming.\\n\\n Sean turned toward the gurney with the post op patient. The man was still unconscious, but\\n\\n Leticia had apparently gotten her teeth into the blood bag, because blood was sprayed all over the man and the wall.\\n\\n \"It\u0027s all right. It\u0027s all right, Mrs. Ruben,\" a nurse assured her.\\n\\n An orderly quickly went over to the gurney. \"I need help here,\" he called.\\n\\n \"People, please,\" Sean said. \"Get back into your rooms. Let the hospital staff get things cleaned up.\"\\n\\n \"Someone stabbed him!\" Mrs. Ruben screamed.\\n\\n \"He wasn\u0027t stabbed,\" Sean said patiently. \"It\u0027s just a spill.\"\\n\\n \"A spill like murder! Blood red murder!\" the woman shouted.\\n\\n \"Murder!\" someone else repeated.\\n\\n Sean groaned. \"Stop it!\" he snapped, using all his authority. \"There\u0027s been no murder,\" he said, all the while knowing the words might well be a lie. \"Get back to your rooms.\"\\n\\n To his relief, the patients began to obey.\\n\\n With Mark in with Leticia Lockwood and the staff suddenly finding both courage and their senses, Sean strode across to Deanna\u0027s room.\\n\\n Lauren was perched by her friend\u0027s side.\\n\\n Bobby was standing, hands on his hips, looking like a crouched tiger ready to spring in any direction.\\n\\n Sean walked over to the bed. \"She all right?\" he asked Lauren.\\n\\n \"No change,\" she told him.\\n\\n As he nodded, Mark Davidson returned to the room. \"We have to get Deanna out of here,\" he said flatly. \"Sean, there\u0027s a Judy Lockwood across the hall with Leticia. She wants to talk to you.\"\\n\\n Sean walked to the door, pausing on the way to ask Mark, \"And what the hell do I tell her?\"\\n\\n Mark took a deep breath. \"I have absolutely no idea,\" he admitted, then smiled. \"Hey, you\u0027re the cop.\" Then he turned serious again. \"But we have to get Deanna out of this place.\"\\n\\n Sean, wincing, strode across the hall.\\n\\n What the hell was he going to say to the woman? Your niece, your decent, sweet, God-fearing niece, was possessed by a vampire?\\n\\n He just hoped he wouldn\u0027t end up having to stake her.\\n\\n Lauren wasn\u0027t quite sure how Mark managed to convince Deanna\u0027s doctors that she would be better cared for her at home. At first the doctor in charge-called back in from a day\u0027s fishing excursion, wearing a cap with a bouncing bass-was adamant that she wasn\u0027t ready to be released, not while she was still in a coma.\\n\\n Lauren swore she could care for her, but the doctor kept shaking his head.\\n\\n Then Mark began to talk. He didn\u0027t say anything she hadn\u0027t said herself, but somehow he was more convincing. Maybe it was a guy thing.. She usually hated that. But at the moment she couldn\u0027t be too upset, because she was getting what she wanted.\\n\\n The release papers were signed, and arrangements made for a registered nurse to come by three times a day. An ambulance was hired to transport her from the hospital to the house on Bourbon Street.\\n\\n Lauren rode in the ambulance with Deanna. Sean, Bobby and Mark followed by car. The paramedics helped settle Deanna in, then left.\\n\\n Heidi was still upset and on edge, but she was behaving normally again, and she was ready to be a little mother hen, clucking over Deanna. She assured Stacey and Bobby that she would be taking over Deanna\u0027s care and would make sure they didn\u0027t impose on anyone, and that she would protect her friend against any evil.\\n\\n Lauren noticed that Mark seemed to find that final claim, especially, doubtful. He had a hushed conversation with Stacey in the hallway, and Lauren suspected Stacey was assuring him that she had gotten Heidi to understand the danger facing them.\\n\\n \"I really think Heidi is going to be okay,\" she whispered to Mark, as he came back into the room. She kept her voice down because Heidi was close by, concentrating on making sure that Deanna\u0027s pillow was properly plumped.\\n\\n He stared at her as she spoke, seeming distant and tense.\\n\\n \"Really,\" she said, catching his arm and leading him toward the door. \"She\u0027s herself again.\"\\n\\n Mark sighed, shaking his head. \"And Sean told me about Judy Lockwood saying Leticia wouldn\u0027t stay out all night or miss work. Don\u0027t you see? He gets to the people he uses. He literally gets into their blood.\"\\n\\n Sean Canady came up the stairs, staring at Mark. \"We\u0027ve got another corpse,\" he said.\\n\\n \"Headless?\" Lauren asked, swallowing.\\n\\n \"No. And found in a courtyard, not the Mississippi.\" He turned back to Mark. \"They\u0027re having a hard time discerning how she originally met her demise. She\u0027s pretty well decayed. Apparently she\u0027s been dead for months.\"\\n\\n \"A fraternity prank?\" Lauren asked, hoping against hope. But then she saw the way Sean and Mark were looking at one another.\\n\\n \"Vampires only explode and turn to dust if they\u0027ve been dead long enough that their body would have decayed already. Apparently we have a few fairly fresh kills on our hands.\"\\n\\n \"I think Lauren\u0027s idea of a fraternity prank makes sense. At least, that\u0027s the story I\u0027d go with for the press,\" Mark told Sean.\\n\\n \"Hell,\" Sean groaned.\\n\\n \"We should go, don\u0027t you think?\" Mark said to him.\\n\\n \"To the morgue?\" Sean asked.\\n\\n \"To the hospital. We\u0027ve got to see if we can talk to Leticia.\" He turned to Lauren. \"Stay here. And please, Don\u0027t leave this house.\"\\n\\n \"I won\u0027t. Deanna and Heidi are both here,\" she said.\\n\\n \"And Bobby and Stacey,\" Sean told her. \"And I\u0027m going to tell Big Jim that the band will have to do without him for a few nights. Call me if anything, anything at all, happens.\" \"Absolutely,\" she swore.\\n\\n She nodded, turned and took a seat on the bed next to Deanna, as if to show both men that she wasn\u0027t going anywhere.\\n\\n Sun streamed in from the balcony. The air-conditioner hummed.\\n\\n The only odd thing at all was the fact that Stacey had strung cloves of garlic all the way around the windows and the French doors that led to the balcony.\\n\\n The room smelled like a pizzeria. But there were far worse scents, Lauren had discovered.\\n\\n Like blood.\\n\\n Sean was quite a helpful guy, Mark noted dryly to himself. The cop was his passage into the places he needed to go.\\n\\n Like Leticia\u0027s room, where Sean had stationed an officer by the door while Deanna\u0027s release was being handled.\\n\\n When they entered, Mark saw that Leticia was shackled to the bed, and Judy Lockwood was still there, seated by her niece\u0027s side in the big hospital chair that turned into a bed. She was hummed as she knitted a sweater.\\n\\n Mark noticed that Judy had brought her own kind of defense. The window sill was littered with a bit of dirt, which he knew was some kind of mojo Judy thought might work to keep her niece safe. There was also a huge cross on the bedside stand.\\n\\n \"How\u0027s she doing?\" Sean asked.\\n\\n \"Sleeping like a baby,\" Judy told him. She didn\u0027t miss a stitch as she answered, then smiled at Sean. \"Thank you for listening to me.\"\\n\\n Sean nodded. \"This is a friend of mine, Ms. Lockwood. Mark Davidson. I think you met him earlier\"\\n\\n Judy studied him. \"All right,\" she said after a moment. \"Are you going to help us, then, Mr. Mark?\"\\n\\n \"I\u0027m going to do my best. I\u0027ll need to speak with Leticia when she wakes up. I\u0027m hoping she can tell me something about where she\u0027s been.\"\\n\\n Judy nodded. \"You may take a seat, young man.\"\\n\\n \"I\u0027ll leave you, Mark, and get down to the mor-station,\" Sean said. \"Judy, feel free to call me any time.\"\\n\\n \"I will, Lieutenant,\" she said firmly, her eyes on Mark. \"And I thank you again,\" she added softly.\\n\\n Sean left with a nod to Mark, who turned to Judy\\n\\n \"Ms. Lockwood, are her clothes in the closest?\"\\n\\n She nodded.\\n\\n \"May I look at them?\"\\n\\n She stared at him for a long time. \"They say you calmed her down. The cops couldn\u0027t hold her. No one could. You calmed her down.\"\\n\\n \"Um...yes.\"\\n\\n He was startled when she reached out and grabbed him. \"Is she going to be all right?\" she demanded tensely.\\n\\n This woman was somehow in the know, Mark thought. Maybe she didn\u0027t even know what she understood; maybe she just had special instincts. But somehow she knew that more was going on here than it seemed.\\n\\n \"I sincerely hope so,\" he said.\\n\\n \"I love this girl,\" Judy said with quiet vehemence. \"Understand this: I love this girl more than my own life. I love her enough to kill her if need be. Do you understand what I\u0027m saying, young man?\"\\n\\n \"She needs a lot of blood,\" he said softly. \"A lot.\"\\n\\n Judy leaned back, eyeing him warily. \"She\u0027s been getting that.\"\\n\\n \"She needs to be...watched.\"\\n\\n \"I won\u0027t leave her side.\"\\n\\n He hesitated. \"You have to be very careful. You have to...watch whoever comes in here.\"\\n\\n \"I can do that,\" Judy assured him.\\n\\n He nodded.\\n\\n \"Her things are all in the closet,\" Judy told him.\\n\\n He thanked her.\\n\\n Judy\u0027s uniform gave him little to go on; it was splotched with blood, but he had expected that. Then he checked her shoes. The soles were thickly caked with dark muck and swamp grass.\\n\\n He set the shoes back where they\u0027d been. He was surprised that Stephan hadn\u0027t made a clean kill of the nurse. A small miracle, he thought, then winced, thinking about the day.\\n\\n About the decaying corpse that was now at the morgue.\\n\\n Nefertiti.\\n\\n \"I\u0027ll be praying for my girl,\" Judy said, her fingers busy at her knitting once again. \"I\u0027ll be praying for her. You\u0027ll be praying, too, won\u0027t you, Mark?\" She stared straight at him.\\n\\n \"Yes,\" he said simply.\\n\\n \"You go on now,\" she told him. \"I\u0027ll be here. Day and night. Come what may. You can count on me,\" she said.\\n\\n He smiled then walked over to the table, found paper and pen, and scribbled down his number. \"If she wakes up...\"\\n\\n \"I\u0027ll call you.\"\\n\\n \"Thank you.\"\\n\\n Mark left the hospital. As he did, he saw night was coming.\\n\\n His cell phone rang. It was Sean.\\n\\n \"Meet me at the morgue.\"\\n\\n \"Now?\"\\n\\n \"It\u0027s as good a time as any.\"\\n\\n \"Lauren.\"\\n\\n Lauren jumped. She had dozed off in a chair.\\n\\n She looked across the room, thinking Heidi, who was relaxing in another chair, had spoken.\\n\\n Heidi stared at her.\\n\\n Then they both stared at Deanna.\\n\\n Lauren blinked.\\n\\n This time it seemed Deanna really was conscious. Lauren and Heidi both leaped up, almost crashing into each other in their rush to reach Deanna\u0027s side.\\n\\n \"Hey!\" Heidi said.\\n\\n \"Deanna,\" Lauren breathed.\\n\\n \"\u0027m thirsty,\" Deanna murmured.\\n\\n \"I\u0027ve got it,\" Heidi immediately said.\\n\\n Lauren smiled and lifted Deanna\u0027s head so Heidi could hold the glass in place. Deanna took an eager sip.\\n\\n \"Go slow,\" Lauren warned.\\n\\n Deanna nodded, drank, and sagged back against her pillow.\\n\\n Her eyes closed for a minute, then flew open again.\\n\\n \"Jonas,\" she said.\\n\\n \"Jonas,\" Lauren repeated blankly. Then she frowned. Where was Jonas? He had stayed by Deanna\u0027s side for so long, but today...\\n\\n Deanna had been alone, all alone, while Bobby had battled with Leticia, while pure madness had broken out....\\n\\n Where had Jonas been?\\n\\n \"He\u0027s been with me, hasn\u0027t he?\" Deanna asked softly.\\n\\n \"Yes, honey, he hung around,\" Heidi assured her, smoothing back her hair.\\n\\n Deanna stared at Lauren. \"Jonas is good,\" she said firmly.\\n\\n Then why the hell had he disappeared right when Deanna needed him most? Lauren wondered.\\n\\n Bernie Gibbs was on night duty at the morgue. His job was to sit at the desk and deal with whatever the doctors might need help with, and sign the paperwork for whatever dear souls might depart this world in the darkness. Since the doctors never needed help at night, mainly he read books and signed for bodies when they were brought in.\\n\\n He was often on night duty. Actually, he liked it, liked the silence. He\u0027d gotten through three years at Tulane by working here. He heard about some weird stuff now and then, but it didn\u0027t bother him any. He\u0027d always been the kind of kid who could sit through the most gruesome horror movie. Now that he was premed, he\u0027d already seen a hell of a lot worse anything Hollyweird could come up with.\\n\\n Tonight he was in pretty good shape. He had borrowed a popular new spy thriller from the library, and it was just as engrossing as the reviews had promised. He was actually glad to be at work, where the stiffs never interrupted him just when he was at the best part of a book.\\n\\n He gotten one call from Lieutenant Canady, who\u0027d said he would be coming by. He hadn\u0027t explained why, just told Bernie to keep an eye out for him. But that was cool. Canady was a good guy. He was hell on wheels if you were a crook, but if you were just an average Joe, schlepping along, he didn\u0027t mind what you did with your free time. But Canady hadn\u0027t shown yet.\\n\\n There was a sudden noise-right when his spy was meeting up with his Asian nemesis. It startled him from his concentration on the book, and he cocked his head to listen.\\n\\n Nothing.\\n\\n He wondered what the hell the noise had been. Something must have fallen in back. He turned his attention back to his book, but he couldn\u0027t help wondering what could have fallen?\\n\\n He set his book down, swearing softly. Had a door been left open? Or did they have rats or something?\\n\\n Shit.\\n\\n He decided he\u0027d better check it out.\\n\\n He stood, and looked around. He didn\u0027t have a weapon. Attendants at the morgue didn\u0027t usually have problems with their...charges. But what if some jerk had broken in? He looked around and saw his book. \"Great,\" he muttered aloud. He could just see the headline. Courageous Night Attendant at Morgue Foils Thief with Spy Novel\\n\\n No, the book wasn\u0027t good enough.\\n\\n There were all kinds of scalpels and saws in the autopsy rooms, but he didn\u0027t want to take a chance of coming across an intruder before he could get to a weapon. He opened the drawer to his desk. Aha! A letter opener.\\n\\n Clutching it in his hand, he stood. He looked toward the door to the street and noted that it was securely locked. He started down the hallway.\\n\\n A glance into the first room showed him that everything was sterile and pristine.\\n\\n And smelling...sanitized.\\n\\n Like a morgue.\\n\\n A place of death.\\n\\n Hardly a surprise, he thought with a shrug, and he moved on.\\n\\n He found nothing. At last he came to the large insulated stainless steel doors that led to the morgue\u0027s current occupants.\\n\\n He opened the door to what was essentially a giant refrigerator and looked around. Nothing. No, wait.\\n\\n Something.\\n\\n Shit!\\n\\n There was movement on one of the gurneys. Damn it, they did have rats! Big rats, if the movement he was seeing gave any clue.\\n\\n Rats-or a frat brother, trying to freak him out, he thought. He shook his head and walked to the gurney.\\n\\n \"Asshole,\" he said, pulling back the sheet.\\n\\n But no frat brother was waiting to leap up and yell \"Boo!\"\\n\\n He\u0027d seen the corpse earlier. It was the one that had been discovered by a woman chasing after her kid, and it was months dead and decaying. The eyes were...gone. Eaten by insects or who knew what. Most of the flesh had been rotted away, and what was left clinging to the bones looked as if it had been burned. In fact, the smell of burning flesh had hovered around the body. She-because it was a she-had scarcely been recognizable as a human being.\\n\\n But now...\\n\\n A sound like...like insects gnawing on flesh and bone was coming from the corpse, but that wasn\u0027t the cause\\n\\n It was flesh and bone, all right. Flesh and bone that appeared to be repairing themselves. As he stared, watching blood vessels appear, muscles take form....\\n\\n Her eyes-eyes that hadn\u0027t been there at all earlier-suddenly opened, and she stared at him.\\n\\n Stared at him.\\n\\n And then she smiled.\\n\\n Smiled, only it wasn\u0027t a smile, it was like a snarl, and she was baring her teeth, but they weren\u0027t teeth at all, they were fangs. She looked like a huge asp, her horrid maw of a mouth opening, and he knew that she meant to sink those fangs into his jugular.\\n\\n He screamed.\\n\\n And he struck, batting at her face with his hand and trying to stab her with the letter opener. But those teeth were still coming....\\n\\n Then, suddenly, he felt something heavy smash down on his head. Stars burst before his eyes, and he crashed to the floor.\\n\\n He thought vaguely that he heard someone groan \"Son of a bitch,\" but he wasn\u0027t sure. And then the world went quiet, as if a black curtain had fallen from the sky, and all seemed to be eternal darkness. \\n\\n","sourceLink":"https://allnovel.net/blood-red/page-14.html","bookId":2266,"book":{"id":2266,"title":"Blood Red","description":"Storyline: When a fortune-teller shows bridesmaid Lauren Crow an omen of her gruesome death, she and her friends laugh it off as cheesy theatrics--until women begin disappearing in the night. Even as the streets become more dangerous, Lauren finds herself lusting after a man who is himself dangerous-- and quite possibly crazy. Mark Davidson prowls the city by night armed with crosses and holy water, in search of vampires, whose existence, he insists, is real. He is as irresistibly drawn to Lauren as she is to him, and not only because she\u0027s the image of his murdered fiancee. But Mark\u0027s frightening obsession with finding his lover\u0027s killer merely hides a bitter vendetta that cuts deeper than grief over a lost love. \\n As Lauren wrestles with desire and disbelief, sinister shadows lengthen over New Orleans, threatening her friends and foretelling a battle that may spell the end of the city\u0027s uneasy truce between the living and the undead.\\n","cover":"https://allnovel.net/images/blood-red.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/blood-red.html","creation":"Oct 5, 2019 8:58:31 AM","modification":"Oct 5, 2019 5:23:02 PM"}}
