{"id":76086,"no":26,"title":"Page 26","content":"Two days went by like this. Erique came every afternoon and brought us delicious and rustic-looking French groceries and looked at us helplessly, sometimes pointing at the clock or shaking a bottle of milk in a meaningful way. We never had any idea what he was trying to say. The only time we could ever understand was when he showed us a tiny dead scorpion, laughed, then took off his shoe, and shook it. This baffled us at first, but since he did it every time he left us, we slowly began to realize that we had to shake out our shoes before we stepped into them because they might be filled with scorpions.\\n\\n We were safe and well fed and generally looked after, but slowly going crazy. Or so Marylou thought, from the number of times she diagnosed me from the rocking chair in our bedroom. Over those days and nights I had: generalized anxiety disorder, ADHD, body dysmorphic disorder, adjustment disorder, and borderline kleptomania (because I kept using her brush).\\n\\n And then I was depressed. Now you’re all caught up. This was day three.\\n\\n “You aren’t enjoying this either,” I said. “So I guess either we’re both abnormal or we’re both depressed. And why’d you bring that with you? That’s not exactly vacation reading.”\\n\\n “It is if you want a four point oh. And what else is there to do?”\\n\\n She had a good point. I was staring at an issue of French Vogue from 1984. I mean, it was fun looking at the big hair, but you can only do that for so long. I set it aside and picked up the useless little pay-as-you-go French cell phone Claude had gotten us (because our American ones didn’t work right and would have cost about a million dollars a second if they had).\\n\\n “Maybe it’s the house that’s messing up the phone,” I said, not believing that for a second. The last time I had seen a signal, we were at the train station, ten or more miles away. “There’s got to be somewhere around here where a cell phone works. I have to find out.”\\n\\n “Feel free,” Marylou said, flicking her hand but not looking up. “Go try.”\\n\\n “Doesn’t this freak you out at all?” I said. “Three days. He said it would take him, like, one.”\\n\\n “He never said that. He said he’d be here as soon as he could. He has someone bringing us food twice a day—really good food—and we’re in a beautiful house….”\\n\\n “Beautiful?” I repeated.\\n\\n “…we’re in a house in the middle of the French countryside. It’s important to try to adapt to a different way of life, a different pace. Quiet is good.”\\n\\n I shuddered.\\n\\n “I hate quiet,” I said.\\n\\n She flipped a page, to whatever disorder it is that is characterized by a hatred of being in quiet, remote places.\\n\\n “Why don’t you come?” I asked.\\n\\n “Frogs,” she said. “I’m fine here.”\\n\\n I went outside and sat down on the path with my legs out in front of me and let the little frogs jump over my ankles. They really seemed to like this. My ankles were clearly the best thing that had happened in tiny frog land for a while. It felt better to be outside at least and out of the airless house. I started walking back to the road. It was a pretty view, no question. But even the prettiest view will wear on your nerves if you’re feeling very cut off and bored and uncertain about what the hell is going on. So while I appreciated the soft yellow sunlight spread out over the white hills around us, the bright stripes of purple lavender crops, and the heady smell of pine…what I wanted to see were bars in my cell phone display.\\n\\n I walked for at least two miles, with nothing but the beautiful view to keep me company. No people, no signal. I passed through an olive orchard, the trees heavy with fruit. I saw some fuzzy little animal scamper across the path. Otherwise, nothing.\\n\\n I finally came to a small red cottage, one with an actual person milling around in front of it. I say milling because that’s really what he was doing. I’d never seen real milling before. Done right, real milling has a shambling quality to it, a true aimlessness that can be felt by any spectator. He was circling the lawn at the front of the house.\\n\\n The miller was nice enough looking, in his twenties or thirties, with longish, artsy hair. He was covered in dirt, on his knees and shorts and hands, like he’d just been working in the garden. There was a plastic basketful of large tomatoes, peppers, and eggplants sitting on the stone front step. He had a look of total confusion on his face, and a nervous way of smoking, like he just couldn’t get enough nicotine and had to suck in quick, greedy gulps. He saw me, blinked a few times, waved stiffly, and said bonjour. I said bonjour back…but when he started speaking rapid-fire French, I shook my head and came closer. \\n\\n","sourceLink":"https://allnovel.net/vacations-from-hell/page-26.html","bookId":2716,"book":{"id":2716,"title":"Vacations from Hell","description":"Storyline: Life\u0027s a beach . . . and then you\u0027re undead? \\n In this must-have collection, five of today\u0027s hottest writers—Libba Bray (A Great and Terrible Beauty), Cassandra Clare (City of Bones), Claudia Gray (Evernight), Maureen Johnson (13 Little Blue Envelopes), and Sarah Mlynowski (Bras \u0026 Broomsticks)—tell supernatural tales of vacations gone awry. Lost luggage is only mildly unpleasant compared to bunking with a witch who holds a grudge. And a sunburn might be embarrassing and painful, but it doesn\u0027t last as long as a curse. Of course, even in the most hellish of situations, love can thrive. . . . \\n From light and funny to dark and creepy, these stories have something for everyone. You definitely won\u0027t want to leave this collection at home!\\n","cover":"https://allnovel.net/images/vacations-from-hell.jpg","author":"Libba Bray","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/vacations-from-hell.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 10:36:20 AM"}}
