{"id":76095,"no":35,"title":"Page 35","content":"“You have to call the police,” Marylou said, for what had to be the tenth time.\n “We must secure him first,” he said. “Please make sure that it is tight.”\n Marylou didn’t look happy, but she got down on her knees behind Gerard and tied him up, knotting the rope over and over. Gerard winced but never once took his eyes from Henri’s face.\n “So why don’t we take your car into town?” Gerard asked. “You want to turn me in to the police, go ahead.”\n “No petrol. I was going to walk and get some more in the morning. Now…”\n For a moment he seemed distracted by the sight of Tom Cruise on his tiny television, but soon he refocused on the situation at hand.\n “You’ve been giving these girls some trouble,” he said. “You’ve snuck into my house. What exactly are you doing, Gerard?”\n “Open my bag and see.”\n Henri pulled Gerard’s ragged messenger bag closer with his foot, bent and pulled open the snap with one hand, and dumped the contents to the floor. The candy bars and water bottles were in there; Gerard must have picked them back up. There was also a utility blade.\n “What is this?” Henri said, holding it up.\n “Well,” I said quickly, “we have a knife too.”\n “Charlie!” Marylou yelled, wheeling around to stare at me.\n “Do you?” Henri asked, sounding profoundly unconcerned.\n “Because of him,” Marylou said, pointing at Gerard. “We brought it for protection.”\n I tried to communicate “We would not have stabbed you, or at least I wouldn’t have” with my eyes, but that seemed a hard sentiment to get across. I’m not even sure if Gerard cared at this point. We were all armed to the teeth, but Henri was the most armed, and Gerard was tied to a chair, so the knife count was moot.\n Anyway, there was a much bigger problem in that bag, and Henri was just getting to it. He had reached the bundle of plastic bags and was unraveling them with a series of sharp shakes.\n Then the hand hit the floor. Gerard and I knew what it was, but Henri and Marylou had to take a better look.\n “Is that a dead bird?” Marylou asked, grimacing.\n “It doesn’t look like a bird,” Henri said grimly. He figured it out fairly quickly, I think. It took Marylou another moment, and then she screamed. In my ear.\n “I found that in the garden, just outside of this house,” Gerard said. “Did the dog dig eet up, Henri? Or was eet some other animal? Did the dog try to stop you when you killed your wife? Did you even know what you were doing? Where is your wife, Henri? Where is your wife?”\n The silence that followed had a horrible, sucking quality to it. Marylou’s gasps were snuffed out in a moment. The air was heavy with the onion sting, and the tension made it suddenly, painfully hot.\n Henri picked up the remote control and switched off the television.\n “I think it is safer if you two stay upstairs,” Henri said, mostly to Marylou. “There is a good lock on the front bedroom door. Take your sister and go there.”\n “I’m not leaving,” I heard myself say. I was completely convinced that if we walked away, Henri would kill Gerard. There was no way I was leaving him bound and helpless.\n “Go,” Henri said. And there was a note in his voice that told me that this is what I had to do or he would shoot Gerard right now. I could see Gerard from behind quietly straining at the ropes that bound him. Marylou had me by the arm. Her nails were digging in, and she was crying and saying, “Come on, Charlie; come on, Charlie” over and over. Gerard managed to turn his head enough to look at me. He was afraid. But he nodded, telling me to go. I let Marylou drag me up the steps.\n The bedroom was stripped in the same eerie way as the bathroom. There were no sheets, no blankets, no curtains. Marylou was trembling but maintained her poise, pacing the room. I heard muffled voices from downstairs, but it was hard to hear and all in French. It sounded calm, though.\n “Marylou,” I said. “It’s not Gerard. I lied. He never attacked me. I wasn’t running from him.”\n “What?” she said, wheeling around.\n “It’s too complicated to explain….”\n “Try!”\n “It was Henri,” I snapped. “That hand. It’s Henri…. It’s his wife…her hand. Gerard was trying to warn us away. I didn’t think you’d believe me so I said he attacked me.”\n “So you’re saying that Henri killed his wife….”\n “And probably his dog,” I added. \n","sourceLink":"https://allnovel.net/vacations-from-hell/page-35.html","bookId":2716,"book":{"id":2716,"title":"Vacations from Hell","description":"Storyline: \n Life\u0027s a beach . . . and then you\u0027re undead? \n In this must-have collection, five of today\u0027s hottest writers—Libba Bray (A Great and Terrible Beauty), Cassandra Clare (City of Bones), Claudia Gray (Evernight), Maureen Johnson (13 Little Blue Envelopes), and Sarah Mlynowski (Bras \u0026 Broomsticks)—tell supernatural tales of vacations gone awry. Lost luggage is only mildly unpleasant compared to bunking with a witch who holds a grudge. And a sunburn might be embarrassing and painful, but it doesn\u0027t last as long as a curse. Of course, even in the most hellish of situations, love can thrive. . . . \n From light and funny to dark and creepy, these stories have something for everyone. You definitely won\u0027t want to leave this collection at home!\n \n","cover":"https://allnovel.net/images/vacations-from-hell.jpg","author":"Libba Bray","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/vacations-from-hell.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 10:36:20 AM"}}
