{"id":76105,"no":45,"title":"Page 45","content":"“Fun?” Phillip echoes. “I didn’t come all the way here, Carol, to shop for cheap handicrafts and stare at a floating log some idiot tour guide claims is a crocodile.”\\n\\n “But Phillip—” My mom reaches out for his hand and accidentally knocks over the glass bowl of fruit salad beside his plate. Phillip jumps up, swearing, even though none of it has gotten on him.\\n\\n Mom looks dismayed. “I’m so sorry—”\\n\\n Phillip doesn’t answer her. He’s staring coldly at the remains of the fruit salad on the tiles at his feet. “Look at this mess.”\\n\\n “Phillip.” On the verge of tears my mom gets down on her knees, scrabbling with her fingers at the slippery bits of fruit and broken glass. I wonder where the staff is, but they seem to be hanging back, sensing the delicacy of the situation.\\n\\n “Mom, don’t,” I say, but she ignores me. She has cut herself on the glass, the blood dripping down on the mess of squashed fruit and juice splashed across the ground. I look over at Evan, wondering if he’ll say anything. He’s always liked my mother, or at least I thought he did. But he stares silently at his plate and avoids my eyes.\\n\\n That night I lie awake in my four-poster bed, staring at the ceiling. The mosquito netting, white as the veil of a bride, drifts in the faint breeze from the air conditioner. I can hear Phillip’s voice on the other side of the wall rising and falling like a wave as it grows angrier and angrier. My mother’s voice runs a faint point-counterpoint to his shouting: as his voice rises, hers gets more and more quiet. I watch a shining green beetle make its way across the stucco wall, its feelers reaching out delicately for something it can touch.\\n\\n We don’t go to Black River in the morning, of course. Phillip takes his book out to the pool and sits glowering in the shade. My mom stays inside, sunglasses over her eyes and a big hat casting dark shadows over her face, but despite the glasses I can still see that her eyes are swollen from crying.\\n\\n Evan doesn’t get up until noon, and when he does, he comes out of his room yawning, in board shorts and flip-flops. His hair looks lighter than before, as if the sun has already bleached out some of its color. I’m lying in the hammock on the deck, a magazine open on my lap; when I see him, I set it down and go over to him, lowering my voice as I get closer. “How did you sleep last night?” I ask, hoping he can read my eyes, wondering if he heard the same thing I did.\\n\\n “Fine.” He’s not reading my eyes; his own sky blue ones are darting around nervously. Maybe he’s wondering if they’re watching us, if they’re talking about how we stand too close to each other, talk too softly. But no. They don’t notice anything. They never have.\\n\\n I had met Phillip a bunch of times before my mother finally brought me over to his house, but that was the first time I’d ever realized how serious they were. Phillip was still trying to impress us both back then. He still thought there was some point in getting on my good side. He would come to our house dressed up in a suit, with a bunch of flowers for my mom and something for me—always something dumb and inappropriate, like a shiny barrette or a CD of bubblegum pop music. It was like he thought all teenage girls were the same and liked the same things, but he was trying, my mother said and besides he didn’t know anything about girls—he only had a son. And even though I knew that, even though I knew Phillip had a son my age, I never gave him the slightest thought until that night, when my mom hurried me up the lighted walk to Phillip’s front door and rang the bell, smiling nervously at me the whole time.\\n\\n And Evan opened the door. He smiled when he saw me. “Hi,” he said. “You must be Violet.”\\n\\n I stood there on the front steps without saying a word. I felt stunned, as if I’d fallen off a high tree branch and hit the ground hard, knocking all the wind out of me. There was just no way that this boy, who I watched every day at school, whose every mannerism I’d memorized—the way he flicked his hair out of his eyes or fiddled with his watch when he was bored—was the offspring of Phillip. Boring, tight-lipped, sallow-faced Phillip couldn’t possibly have a son who looked like that.\\n\\n I didn’t even care that Evan didn’t recognize me. Didn’t care that he didn’t seem to know we even went to the same school.\\n\\n “Are you going down to the beach?” he asks now. “I’ll come with you.”\\n\\n I shrug. There’s really no way to stop him. “Okay.”\\n\\n There are baskets of beach towels on the deck, brightly striped as candy canes. Evan drapes one around his shoulders as we head down the sandy path to the beach. It’s deserted again today, empty sand stretching away into the distance. It looks like an ad for some honeymoon destination, someplace where you can kiss on the beach with no one watching. \\n\\n","sourceLink":"https://allnovel.net/vacations-from-hell/page-45.html","bookId":2716,"book":{"id":2716,"title":"Vacations from Hell","description":"Storyline: Life\u0027s a beach . . . and then you\u0027re undead? \\n In this must-have collection, five of today\u0027s hottest writers—Libba Bray (A Great and Terrible Beauty), Cassandra Clare (City of Bones), Claudia Gray (Evernight), Maureen Johnson (13 Little Blue Envelopes), and Sarah Mlynowski (Bras \u0026 Broomsticks)—tell supernatural tales of vacations gone awry. Lost luggage is only mildly unpleasant compared to bunking with a witch who holds a grudge. And a sunburn might be embarrassing and painful, but it doesn\u0027t last as long as a curse. Of course, even in the most hellish of situations, love can thrive. . . . \\n From light and funny to dark and creepy, these stories have something for everyone. You definitely won\u0027t want to leave this collection at home!\\n","cover":"https://allnovel.net/images/vacations-from-hell.jpg","author":"Libba Bray","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/vacations-from-hell.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 10:36:20 AM"}}
