{"id":4183,"no":22,"title":"Part 2 Chaptear 9 The Seizure of the “Osprey”","content":"Frere’s fishing expedition had been unsuccessful, and in consequence prolonged. The obstinacy of his character appeared in the most trifling circumstances, and though the fast deepening shades of an Australian evening urged him to return, yet he lingered, unwilling to come back empty-handed. At last a peremptory signal warned him. It was the sound of a musket fired on board the brig: Mr. Bates was getting impatient; and with a scowl, Frere drew up his lines, and ordered the two soldiers to pull for the vessel.\n The Osprey yet sat motionless on the water, and her bare masts gave no sign of making sail. To the soldiers, pulling with their backs to her, the musket shot seemed the most ordinary occurrence in the world. Eager to quit the dismal prison-bay, they had viewed Mr Frere’s persistent fishing with disgust, and had for the previous half hour longed to hear the signal of recall which had just startled them. Suddenly, however, they noticed a change of expression in the sullen face of their commander. Frere, sitting in the stern sheets, with his face to the Osprey, had observed a peculiar appearance on her decks. The bulwarks were every now and then topped by strange figures, who disappeared as suddenly as they came, and a faint murmur of voices floated across the intervening sea. Presently the report of another musket shot echoed among the hills, and something dark fell from the side of the vessel into the water. Frere, with an imprecation of mingled alarm and indignation, sprang to his feet, and shading his eyes with his hand, looked towards the brig. The soldiers, resting on their oars, imitated his gesture, and the whale-boat, thus thrown out of trim, rocked from side to side dangerously. A moment’s anxious pause, and then another musket shot, followed by a woman’s shrill scream, explained all. The prisoners had seized the brig. “Give way!” cried Frere, pale with rage and apprehension, and the soldiers, realizing at once the full terror of their position, forced the heavy whale-boat through the water as fast as the one miserable pair of oars could take her.\n * * * * * *\n Mr. Bates, affected by the insidious influence of the hour, and lulled into a sense of false security, had gone below to tell his little playmate that she would soon be on her way to the Hobart Town of which she had heard so much; and, taking advantage of his absence, the soldier not on guard went to the forecastle to hear the prisoners singing. He found the ten together, in high good humour, listening to a “shanty” sung by three of their number. The voices were melodious enough, and the words of the ditty — chanted by many stout fellows in many a forecastle before and since — of that character which pleases the soldier nature. Private Grimes forgot all about the unprotected state of the deck, and sat down to listen.\n While he listened, absorbed in tender recollections, James Lesly, William Cheshire, William Russen, John Fair, and James Barker slipped to the hatchway and got upon the deck. Barker reached the aft hatchway as the soldier who was on guard turned to complete his walk, and passing his arm round his neck, pulled him down before he could utter a cry. In the confusion of the moment the man loosed his grip of the musket to grapple with his unseen antagonist, and Fair, snatching up the weapon, swore to blow out his brains if he raised a finger. Seeing the sentry thus secured, Cheshire, as if in pursuance of a preconcerted plan, leapt down the after hatchway, and passed up the muskets from the arm-racks to Lesly and Russen. There were three muskets in addition to the one taken from the sentry, and Barker, leaving his prisoner in charge of Fair, seized one of them, and ran to the companion ladder. Russen, left unarmed by this manoeuvre, appeared to know his own duty. He came back to the forecastle, and passing behind the listening soldier, touched the singer on the shoulder. This was the appointed signal, and John Rex, suddenly terminating his song with a laugh, presented his fist in the face of the gaping Grimes. “No noise!” he cried. “The brig’s ours”; and ere Grimes could reply, he was seized by Lyon and Riley, and bound securely.\n “Come on, lads!” says Rex, “and pass the prisoner down here. We’ve got her this time, I’ll go bail!” In obedience to this order, the now gagged sentry was flung down the fore hatchway, and the hatch secured. “Stand on the hatchway, Porter,” cries Rex again; “and if those fellows come up, knock ’em down with a handspoke. Lesly and Russen, forward to the companion ladder! Lyon, keep a look-out for the boat, and if she comes too near, fire!”\n As he spoke the report of the first musket rang out. Barker had apparently fired up the companion hatchway.\n * * * * * *\n When Mr. Bates had gone below, he found Sylvia curled upon the cushions of the state-room, reading. “Well, missy!” he said, “we’ll soon be on our way to papa.”\n Sylvia answered by asking a question altogether foreign to the subject. “Mr. Bates,” said she, pushing the hair out of her blue eyes, “what’s a coracle?”\n “A which?” asked Mr. Bates.\n “A coracle. C-o-r-a-c-l-e,” said she, spelling it slowly. “I want to know.”\n The bewildered Bates shook his head. “Never heard of one, missy,” said he, bending over the book. “What does it say?”\n “‘The Ancient Britons,’” said Sylvia, reading gravely, “ ‘were little better than Barbarians. They painted their bodies with Woad’— that’s blue stuff, you know, Mr. Bates —‘and, seated in their light coracles of skin stretched upon slender wooden frames, must have presented a wild and savage appearance.’”\n “Hah,” said Mr. Bates, when this remarkable passage was read to him, “that’s very mysterious, that is. A corricle, a cory “— a bright light burst upon him. “A curricle you mean, missy! It’s a carriage! I’ve seen ’em in Hy’ Park, with young bloods a-drivin’ of ’em.”\n “What are young bloods?” asked Sylvia, rushing at this “new opening”.\n “Oh, nobs! Swell coves, don’t you know,” returned poor Bates, thus again attacked. “Young men o’ fortune that is, that’s given to doing it grand.”\n “I see,” said Sylvia, waving her little hand graciously. “Noblemen and Princes and that sort of people. Quite so. But what about coracle?”\n “Well,” said the humbled Bates, “I think it’s a carriage, missy. A sort of Pheayton, as they call it.”\n Sylvia, hardly satisfied, returned to the book. It was a little mean-looking volume — a “Child’s History of England”— and after perusing it awhile with knitted brows, she burst into a childish laugh.\n “Why, my dear Mr. Bates!” she cried, waving the History above her head in triumph, “what a pair of geese we are! A carriage! Oh you silly man! It’s a boat!”\n “Is it?” said Mr. Bates, in admiration of the intelligence of his companion. “Who’d ha’ thought that now? Why couldn’t they call it a boat at once, then, and ha’ done with it?” and he was about to laugh also, when, raising his eyes, he saw in the open doorway the figure of James Barker, with a musket in his hand.\n “Hallo! What’s this? What do you do here, sir?”\n “Sorry to disturb yer,” says the convict, with a grin, “but you must come along o’ me, Mr. Bates.”\n Bates, at once comprehending that some terrible misfortune had occurred, did not lose his presence of mind. One of the cushions of the couch was under his right hand, and snatching it up he flung it across the little cabin full in the face of the escaped prisoner. The soft mass struck the man with force sufficient to blind him for an instant. The musket exploded harmlessly in the air, and ere the astonished Barker could recover his footing, Bates had hurled him out of the cabin, and crying “Mutiny!” locked the cabin door on the inside.\n The noise brought out Mrs. Vickers from her berth, and the poor little student of English history ran into her arms.\n “Good Heavens, Mr. Bates, what is it?”\n Bates, furious with rage, so far forgot himself as to swear. “It’s a mutiny, ma’am,” said he. “Go back to your cabin and lock the door. Those bloody villains have risen on us!” Julia Vickers felt her heart grow sick. Was she never to escape out of this dreadful life? “Go into your cabin, ma’am,” says Bates again, “and don’t move a finger till I tell ye. Maybe it ain’t so bad as it looks; I’ve got my pistols with me, thank God, and Mr. Frere’ll hear the shot anyway. Mutiny? On deck there!” he cried at the full pitch of his voice, and his brow grew damp with dismay when a mocking laugh from above was the only response.\n Thrusting the woman and child into the state berth, the bewildered pilot cocked a pistol, and snatching a cutlass from the arm stand fixed to the butt of the mast which penetrated the cabin, he burst open the door with his foot, and rushed to the companion ladder. Barker had retreated to the deck, and for an instant he thought the way was clear, but Lesly and Russen thrust him back with the muzzles of the loaded muskets. He struck at Russen with the cutlass, missed him, and, seeing the hopelessness of the attack, was fain to retreat.\n In the meanwhile, Grimes and the other soldier had loosed themselves from their bonds, and, encouraged by the firing, which seemed to them a sign that all was not yet lost, made shift to force up the forehatch. Porter, whose courage was none of the fiercest, and who had been for years given over to that terror of discipline which servitude induces, made but a feeble attempt at resistance, and forcing the handspike from him, the sentry, Jones, rushed aft to help the pilot. As Jones reached the waist, Cheshire, a cold-blooded blue-eyed man, shot him dead. Grimes fell over the corpse, and Cheshire, clubbing the musket — had he another barrel he would have fired — coolly battered his head as he lay, and then, seizing the body of the unfortunate Jones in his arms, tossed it into the sea. “Porter, you lubber!” he cried, exhausted with the effort to lift the body, “come and bear a hand with this other one!” Porter advanced aghast, but just then another occurrence claimed the villain’s attention, and poor Grimes’s life was spared for that time.\n Rex, inwardly raging at this unexpected resistance on the part of the pilot, flung himself on the skylight, and tore it up bodily. As he did so, Barker, who had reloaded his musket, fired down into the cabin. The ball passed through the state-room door, and splintering the wood, buried itself close to the golden curls of poor little Sylvia. It was this hair’s -breadth escape which drew from the agonized mother that shriek which, pealing through the open stern window, had roused the soldiers in the boat.\n Rex, who, by the virtue of his dandyism, yet possessed some abhorrence of useless crime, imagined that the cry was one of pain, and that Barker’s bullet had taken deadly effect. “You’ve killed the child, you villain!” he cried.\n “What’s the odds?” asked Barker sulkily. “She must die any way, sooner or later.”\n Rex put his head down the skylight, and called on Bates to surrender, but Bates only drew his other pistol. “Would you commit murder?” he asked, looking round with desperation in his glance.\n “No, no,” cried some of the men, willing to blink the death of poor Jones. “It’s no use making things worse than they are. Bid him come up, and we’ll do him no harm.” “Come up, Mr. Bates,” says Rex, “and I give you my word you sha’n’t be injured.”\n “Will you set the major’s lady and child ashore, then?” asked Bates, sturdily facing the scowling brows above him.\n “Yes.”\n “Without injury?” continued the other, bargaining, as it were, at the very muzzles of the muskets.\n “Ay, ay! It’s all right!” returned Russen. “It’s our liberty we want, that’s all.”\n Bates, hoping against hope for the return of the boat, endeavoured to gain time. “Shut down the skylight, then,” said he, with the ghost of an authority in his voice, “until I ask the lady.”\n This, however, John Rex refused to do. “You can ask well enough where you are,” he said.\n But there was no need for Mr. Bates to put a question. The door of the state-room opened, and Mrs. Vickers appeared, trembling, with Sylvia by her side. “Accept, Mr. Bates,” she said, “since it must be so. We should gain nothing by refusing. We are at their mercy — God help us!”\n “Amen to that,” says Bates under his breath, and then aloud, “We agree!”\n “Put your pistols on the table, and come up, then,” says Rex, covering the table with his musket as he spoke. “And nobody shall hurt you.”\n \n \n","sourceLink":"http://novel.tingroom.com/mingren/799/600.html","bookId":144,"book":{"id":144,"title":"For the Term of His Natural Life 无期徒刑","description":"简介： My Dear Sir Charles, I take leave to dedicate this work to you, not merely because your nineteen years of political and literary life in Australia render it very fitting that any work written by a resident in the colonies, and having to do...","cover":"http://novel.tingroom.com/file/upload/201403/18/08-33-37-49-1.jpg","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/799","creation":"Aug 1, 2019 12:18:19 AM","modification":"Aug 1, 2019 12:18:19 AM"}}
