{"id":74178,"no":15,"title":"Page 15","content":"\"Could you spell Glen Severn, please?\"\n The woman spelled it for her. Natalie thanked her, and said goodbye.\n The telephone company had no record of a Jeffries in Glen Severn, Pennsylvania.\n MISS SHERIDAN\u0027S, she had written. In Connecticut. She had no idea where it was in Connecticut. Or whether anyone would be there in July. Natalie called the Branford Public Library; they checked their reference books, and located Miss Sheridan\u0027s for her, in Westgarden, Connecticut. Information gave her the number.\n She poured another Coke, took off her shoes, stretched her feet, and dialed Miss Sheridan\u0027s with the fingers on her other hand crossed.\n \"Miss Sheridan\u0027s School, hello.\" Funny, the change in inflections, Natalie thought. Miss Sheridan\u0027s must be a classy place. The woman put three syllables into \"hello.\"\n She went through the lies again. Looking for a cousin she\u0027d lost track of. Julie Jeffries. Would have graduated in, oh, probably 1962.\n The woman was cheerful and friendly. \"Well,\" she said, \"you\u0027ve called the right person. I\u0027m the alumnae secretary. Just a moment, please. I\u0027ll check.\"\n A long moment. Natalie sipped her Coke and drew faces on her paper, girls\u0027 faces with long dark hair and straight bangs.\n \"Hello there.\" Three syllables again. \"Yes, I have it here. Julie Jeffries. I got out the 1962 yearbook, too, so that I could look her up. She did graduate that year. Goodness, wasn\u0027t she a pretty thing? It says under her picture that her ambition was to be a model.\"\n The woman chuckled. \"That\u0027s unusual, for girls from Miss Sheridan\u0027s. I wonder if she succeeded.\n \"I\u0027m terribly sorry, though, that we have no current address for her. She simply hasn\u0027t responded to any of our alumnae mailings. Some girls just don\u0027t, you know. They marry, or take a job, and lose interest—\"\n \"What\u0027s the last address you have?\"\n \"Let me see. That would be Glen Severn, Pennsylvania. Perhaps her family still lives there, and you could call them?\"\n Natalie sighed, thanked her, and hung up.\n She sat by the telephone for a long time, idly filling in spaces on the paper with circles and lines. You get almost there, she thought, frustrated, and then you\u0027re not there at all, like one of those dreams where you\u0027re running after something that keeps getting farther and farther away.\n I should just give up. I don\u0027t know what else to try. She doesn\u0027t want to be found.\n Dumb, Paul had said. You should have tried the church.\n Well, thought Natalie, when in doubt or trouble, turn to the church. She called information again, in Glen Severn, Pennsylvania, and got the number of the town\u0027s only Episcopal church.\n \"Saint Bartholomew\u0027s,\" came the pleasant greeting. (Need a prayer? thought Natalie. Or a hymn? Short sermon, perhaps? How about a mother, long lost?)\n She launched into her playscript of lies. Their name was Jeffries. I\u0027m not even positive they were Episcopalians, but I thought perhaps—\n The woman interrupted her suddenly. \"Oh, you\u0027re talking about Margaret! Goodness, I got a card from her the other day! What a coincidence! Let\u0027s see, it\u0027s right here on my desk—Do you want her address, or her phone number, or both?\"\n Natalie gulped. \"Let me make sure it\u0027s the right person, please. This is Mrs. Clement Jeffries—\"\n \"Yes, I know, dear. We\u0027ve been friends for a long time. Oh, I hated to see her move away. Goodness, Julie was married in this church. But you know, when Clement died, Margaret just—\"\n \"Oh, wait. I\u0027m sorry to interrupt you. But actually, it\u0027s Julie that I\u0027m looking for. Do you by any chance—\"\n \"Oh, I\u0027m sorry. I don\u0027t have Julie\u0027s address. But here, I\u0027ll tell you how to reach Margaret, and then she can tell you how to get in touch with Julie.\"\n \"Thank you.\" Natalie picked up her pen again, and wrote it down carefully as the woman spoke. Margaret Jeffries was back in Detroit. Back where she had lived before they came to Simmons\u0027 Mills. Before they had brought Julie to Simmons\u0027 Mills to live. Before Julie...\n She wrote it down, drew a box around it, drew arrows pointing to the box, thanked the woman, hung up, looked at the name Margaret Jeffries, realized it was her own grandmother, burst into tears, and couldn\u0027t pick up the telephone again.\n 24\n THE PHONE RANG in the kitchen while they were at dinner, and Dr. Armstrong sighed. \"I\u0027m not on call this weekend. I\u0027m going to watch television tonight. It can\u0027t be for me.\"\n \"Not for me,\" said Nancy, with her mouth full. \"Steve\u0027s mad at me, and I just talked to Debbie, and—\"\n \"I\u0027ll get it,\" said Kay Armstrong, putting down her fork. \"And whoever it\u0027s for owes me a big favor.\"\n They could hear her soft voice in the kitchen, talking for a long time. Then the resolute click of the receiver being replaced. Then silence.\n \"Mom?\" called Natalie. \"You coming back?\"\n Her mother returned to the dining room, pale, walking as a blind person does, carefully, through familiar places, without seeing. She sat back down.\n \"It\u0027s Tallie,\" she said, in a voice small as a child\u0027s. \"I don\u0027t know, I never thought—\"\n She took a deep breath. \"It\u0027s such a surprise. I just always thought of Tallie as—oh, Alden, she\u0027s very ill. That was a doctor in Bar Harbor.\n \"Let me try to remember exactly what he said. It was such a shock. Tallie.\n \"The doctor\u0027s name was Baldwin. Stan Baldwin. He says he knows you, Alden.\"\n Dr. Armstrong nodded. \"He\u0027s a good man. What did he say about Tallie?\"\n \"She has pneumonia. Fortunately she had enough sense to call for help—I\u0027m so glad we made her put that phone in, Alden. Just imagine, if—\" She shuddered. \"Well, anyway, Sonny went to the island and brought her over to Bar Harbor, to the hospital. Dr. Baldwin said they\u0027ve done X-rays, and blood tests, and that she has lobar pneumonia, in both lungs. How bad is that, Alden?\"\n \"It can be very serious, Kay. But she\u0027s in a good hospital, with a good doctor. What else did he say?\"\n \"Not much. Her temperature is down, some, from what it was. They\u0027ve started fluids intravenously, and penicillin. She asked, of course, that he not bother us. But I told him I\u0027d come.\"\n \"I\u0027ll take you, Mom,\" said Natalie quickly.\n Kay Armstrong looked around uncertainly. \"Nancy, can you and Dad manage? Oh, that\u0027s silly. Of course you can. Thank you, Nat. We can leave first thing in the morning and be there by noon.\"\n \"How did she seem, when you saw her last month, Natalie?\" asked her father.\n Natalie smiled. \"She was great, Dad. Very well, and strong. We went swimming, even, in that icy water. She said that any year now she\u0027ll be a glamorous old lady. But she sure didn\u0027t seem like an old lady when I was there.\"\n Now, in the hospital bed, Tallie did look old. And small. There is something about hospital beds, thought Natalie, that shrinks people. It isn\u0027t fair, to diminish them like that.\n But chagrin expanded Tallie. \"I feel so foolish,\" she said weakly, taking their hands in hers. \"And I hate it that you had to come all this way to see me like this. But I confess that I\u0027m glad you came. I feel better already, just seeing the two of you.\"\n \"Don\u0027t talk, Tallie,\" said Kay, smoothing her mother\u0027s hair. \"Just rest. I\u0027m going to find Dr. Baldwin, and talk to him. Nat, you stay here and keep her company, but don\u0027t let her talk, okay?\" She left the room.\n \"How\u0027s it going, Natalie?\" asked Tallie when they were alone. \"I\u0027ve been so curious. I was hoping you\u0027d write.\"\n \"Shhhh,\" said Natalie. \"Mom said not to talk.\"\n \"Oh, hell,\" said Tallie. \"I\u0027m beginning to feel better already, now that I have something to interest me. You can\u0027t imagine how boring a hospital is. And tacky. Will you look, Natalie, at these hideous green walls? Now tell me what\u0027s going on with you?\"\n Natalie sat down. \"Well, it\u0027s been strange, Tallie. I made this very long trip, to the town where I was born. And I found out lots of things—about the town, about my mother. Her name was Julie.\"\n Tallie raised an eyebrow. \"Not bad, for a name. Bet she was beautiful, too.\"\n Natalie smiled. \"I saw pictures of her, Tallie. She looked like me, but she was different. She was very beautiful—I don\u0027t mean to sound conceited, after saying she looked like me.\"\n Tallie laughed. \"Don\u0027t be silly. How was she different?\"\n Natalie pondered. \"It\u0027s hard to say. I haven\u0027t figured it out myself. But there was something about her that didn\u0027t fit into the small town. She was smiling, in most of the pictures, but something was wrong.\"\n \"She was pregnant.\" Tallie chuckled. \"Of course something was wrong.\"\n \"No.\" Natalie shook her head slowly. \"Before that. I could see it in the pictures. She wasn\u0027t like the other girls, the ones she went to school with, the ones who lived in the town. Even before she became pregnant.\"\n \"Where is she now?\" Tallie\u0027s eyes were bright with interest.\n Natalie sighed. \"I don\u0027t know. She left, after I was born. Her whole family moved away. I can find out where she is, I think, just by making a phone call, but I haven\u0027t been able to bring myself to make it. I\u0027m not sure why. Suddenly I\u0027m not sure that I want to intrude on her life.\"\n Tallie rested, thinking. \"You know, Nat,\" she said finally, \"if you don\u0027t do it now, after getting this far, you\u0027ll regret it.\"\n \"I know that. But it\u0027s as if—well, I\u0027ve grown to like her, Tallie.\"\n \"Surely you\u0027re not afraid that you\u0027ll like her better than your own parents?\"\n Natalie laughed. \"No, it\u0027s not that. To be honest, I don\u0027t even think of her as my mother. I think of her as—this is really strange, Tallie—\"\n \"You think of her as yourself. That\u0027s not strange at all. But you don\u0027t want to be disappointed.\"\n \"Yes. I guess that\u0027s really it.\"\n \"Natalie, go find her. Even if you\u0027re disappointed, you won\u0027t be sorry. I, Tallie Chandler, guarantee it.\"\n Natalie sat quietly for a minute, and then nodded. \"Okay. And you, Tallie, you take care of yourself. You\u0027re going to be all better soon. I, Natalie Armstrong, guarantee that.\"\n They grinned at each other.\n Natalie and her mother stayed four days in Bar Harbor. Tallie grew increasingly stronger; Dr. Baldwin said on the fourth day that her lungs were completely clear, and that she\u0027d been afebrile for twenty-four hours.\n \"What does that mean?\" asked Natalie.\n \"It means she has no fever. That she\u0027s well,\" said Dr. Baldwin. \"She\u0027s a tough lady. But she\u0027s going to be very weak for a while. She can\u0027t go back alone to that island. Could you take her home with you, to Branford, for a while?\"\n \"She wouldn\u0027t go,\" Natalie and her mother said, in unison.\n \"I know it.\" Dr. Baldwin laughed. \"I thought I\u0027d suggest it anyway. But she\u0027s done nothing for two days except talk about how soon she can get back to the island. Seems the blueberries are almost ready for picking.\"\n \"Well,\" said Kay Armstrong slowly, \"I haven\u0027t picked blueberries for years. I\u0027ll go with her, and stay for a while. What do you think, Nat? You girls can manage at home, can\u0027t you? Keep Dad fed?\"\n Natalie nodded.\n When she had settled her mother and grandmother together in the island house, with promises from them both that they would call if there were any problems, she drove back to Branford alone. \n","sourceLink":"https://allnovel.net/find-a-stranger-say-goodbye/page-15.html","bookId":2710,"book":{"id":2710,"title":"Find a Stranger, Say Goodbye","description":"Storyline: \n Natalie Armstrong has all a girl could want: beauty and intelligence, a loving family and a great boyfriend. But something is missing; the answer to a most important question: \"Who is my mother?\"To find that answer seventeen-year-old Natalie begins a journey that she hopes will lead to the identity of her biological mother. And what if Natalie finds her? What will happen when they meet face-to-face?\n \n","cover":"https://allnovel.net/images/find-a-stranger-say-goodbye.jpg","author":"Lois Lowry","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/find-a-stranger-say-goodbye.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 10:29:59 AM"}}
