{"id":74180,"no":17,"title":"Page 17","content":"\"I wonder,\" Natalie asked shyly, \"if you could tell me how to find this address.\" She showed the woman the card on which she had written Julie Hutchinson\u0027s address. \"Is it within walking distance from here?\" \"Oh, I would think so, unless you\u0027re in a hurry,\" the woman told her. \"That would be just between Park and Madison—closer to Park. Do you know New York?\" Natalie smiled and shook her head. Can\u0027t she see the hayseeds in my hair? she thought. \"Well, you\u0027re on Fifth, now, and 65th. You want to walk north on Fifth—\" she pointed—\"until you get to 79th. That will be up by the Metropolitan.\" She looked at Natalie, expecting some kind of recognition. Natalie looked blank. \"You don\u0027t know the Metropolitan Museum of Art?\" Natalie shook her head. \"Goodness. If you have time while you\u0027re here, do stop in there. They\u0027re having a special exhibition this month, of impressionists. Here, I\u0027ll give you a brochure.\" The woman handed her a brochure on thick textured paper, with a reproduction, on the front, of a pastel and hazy painting of a woman holding a child. \"Now, when you get to 79th, which is up by the museum, turn right. Go one block and cross Madison, and then in the second block, almost to Park, you\u0027ll find this address.\" \"Thank you.\" \"I don\u0027t think there\u0027s any possible way that you could get lost. But if you do, just get a taxi.\" The woman smiled at her. Help, thought Natalie, suddenly panicky. Should I give her a tip? I\u0027ve given everyone else a tip. The taxi driver. The doorman. The bellboy. But the woman had turned away pleasantly and was talking to a dapper man in a pinstriped suit who wanted to know if a telegram had come for him from Oslo. Natalie made her way to the street and began walking north. 28 WELL, SHE THOUGHT. Here I am. And, as usual, not knowing what to do next. She stood uncertainly on the wide sidewalk and looked again at the building. It was an apartment building, older than many in the neighborhood, smaller than most, and thoroughly elegant. A gray-haired doorman in a brass-buttoned green uniform stood at the doorway and spoke occasionally to the few people who entered or left. He helped a young woman in a white uniform with an English baby carriage and exchanged a few laughing remarks with her as she started off toward Central Park with her charge. Then he opened the door of an arriving taxi, took the packages marked Bonwit Teller from a middle-aged lady in a deep blue linen dress, and escorted her into the building. He looked at Natalie curiously. I have to get out of here. If Julie Hutchinson comes out of that building, I am going to faint. She walked slowly back toward Fifth Avenue, idly leafing through the brochure from the Metropolitan Museum. On the last page, it mentioned the hours that the museum was open and the fact that it contained a restaurant. Suddenly Natalie was very hungry. It was already two o\u0027clock; she had left Maine early in the morning, and hadn\u0027t eaten since dawn. She crossed Madison Avenue and headed toward Fifth and the museum. It\u0027s nice, she thought, finally to have a destination. Even if it is only for lunch. Seated with her salad and iced tea beside the shallow pool and its tall, thin sculptured figures, she thought over her alternatives carefully. I could go back to the apartment building and simply pay her a visit. Except that I would be too scared. And it wouldn\u0027t be fair to her, to do it without any warning. Cancel that idea. I could go back to the hotel and call her on the phone. Except I\u0027m scared to do that, too. How can I explain things on the phone? She might hang up on me. I could write her a note. I should have done that before I came. But I was afraid she wouldn\u0027t answer. If I mailed it right now, she would get it tomorrow. I think. I could ask her to call me. I could explain how far I\u0027ve come. She would have a little time to think, and then she\u0027d call. And if she didn\u0027t get it tomorrow? The next day is Sunday; no mail deliveries on Sundays. And I have to leave Sunday, anyway. I can\u0027t waste this trip. I have to do something. (I could sit here surrounded by sculpture and people and cry. That\u0027s what I feel like doing.) Then, as quickly and clearly as one of the water drops falling from the fountains of the shallow pool, she realized what she would do. I\u0027ll write a note, and I\u0027ll give it to the doorman in the green uniform. I\u0027ll go back to the hotel, and wait for her to call. If she doesn\u0027t call? She will. Because she\u0027s my mother. There was no one waiting for tables; it was three o\u0027clock now, and the lunch crowds had passed. Natalie got another glass of iced tea, and took from her pocketbook the stationery that she had found in her room at the hotel. It was pale gray, embossed at the top with the name and address—and phone number—of the hotel. \"Dear Mrs. Hutchinson,\" she wrote. That doesn\u0027t seem right, she thought. Well, what should I say? Dear Mother? No way. She took out a second sheet of paper and wrote firmly, \"Dear Julie.\" The rest came surprisingly easily. This will come as a surprise to you, and I hope not an unpleasant one. My name is Natalie Armstrong. I am the child to whom you gave birth in September 1960, in Simmons\u0027 Mills. I am now seventeen years old. For the past two months I have been trying to find you. Now finally here I am, a few blocks away from you, and I am at a loss about what I should do next. I don\u0027t want to disrupt your own life in any way. My life, too, is a happy one. But I want so much to see you, and to talk. Perhaps all these years you have been wondering, too, as I have. I will be at the hotel for the rest of the afternoon and evening. Would you call me, there? Please. Sincerely, Natalie She folded the paper, sealed it in the pale gray envelope, wrote \"Mrs. E. Phillips Hutchinson\" on the outside, left the museum, walked down the long steps, across Fifth Avenue, down to 79th Street, across Madison, and back to the apartment building. The doorman was hailing a taxi for a man and a teen-aged boy who had just come from the building. \"Excuse me,\" she said to him, after the taxi slid away from the curb and eased itself into the traffic. \"Yes?\" He smiled. \"I have a note that I\u0027d like delivered to Mrs. Hutchinson,\" said Natalie, a little nervously. The doorman looked at his watch. \"It\u0027s almost four,\" he said. \"I believe she\u0027ll be back very soon. Would you like to wait in the lobby?\" \"Oh, no,\" said Natalie. She took the note from her pocketbook, and gave it to him, with a dollar bill. \"Please, would you just give this to her when she comes back?\" \"Certainly,\" he said. \"Anything else?\" \"Yes,\" replied Natalie, suddenly exhausted. \"Would you get me a taxi, please?\" The streets were a blur as she sank against the creased, scarred leather of the taxi seat. Now, she thought, I\u0027ll have to rehearse what I\u0027m going to say. But there wasn\u0027t time. She had barely entered her room at the hotel and taken off her shoes, when the phone rang. Natalie\u0027s stomach lurched as if she were on the top of a ferris wheel, at the place where you begin to slide over into the downward curve, and the ground disappears for a moment, so that you hang in space and feel for an instant as if you will fall. She took a deep breath, cleared her throat, and picked up the phone on the third ring. \"Hello?\" Natalie said. \"Natalie? This is Julie Hutchinson.\" The voice was uncertain, soft, carefully modulated, sophisticated, and friendly. Oh, thank you, thought Natalie. Thank you for the friendliness. Tears formed in her eyes and fell on her cheeks, released in a surge from the tentative bondage that had held them there somewhere in her head all day. \"Yes, this is Natalie. Oh, I\u0027m sorry—\" she said, realizing that the tears were obvious in her voice. \"It\u0027s just that—\" \"I know. I know. It\u0027s all right.\" There was a sudden shakiness to Julie\u0027s voice, as well. \"I\u0027m okay,\" said Natalie, wiping her face with the back of her hand, like a small child. \"I just didn\u0027t know if you would call at all, and I didn\u0027t know what I would say if you did, and—\" \"Natalie. That\u0027s a lovely name.\" \"Thank you. It\u0027s my grandmother\u0027s name but no one ever calls her that. Everyone calls my grandmother Tallie; they always have, and—\" I\u0027m babbling, thought Natalie, embarrassed. \"You know, I saw your taxi leaving. My own pulled up just behind yours, and when George gave me your note, he pointed and said that you had just left.\" \"I didn\u0027t want to see you. He said you\u0027d be back soon, and I didn\u0027t want to take you by surprise like that.\" \"Thank you. Your note, in itself, was a surprise, of course. In fact, I\u0027ve been sitting here reading it again and again. But, Natalie, it never occurred to me not to call.\" \"I\u0027m so glad,\" Natalie whispered. \"I confess I\u0027m at a complete loss. I have no idea how you ever found me. Do you live in New York? Of course not; you\u0027re at the hotel. Where have you come from?\" \"Maine,\" said Natalie. \"I\u0027ve never left Maine. I\u0027ve lived there all my life.\" She could hear Julie sigh. \"Natalie, it was such a long, long time ago. But I have wondered. For years, I\u0027ve wondered. I don\u0027t know if you realize this, but when you were born, I was just—well, I was only—\" Her voice broke. \"I know,\" said Natalie. \"You were very young. Younger than I am now.\" \"And I couldn\u0027t—\" Julie\u0027s voice shook. \"There was just no way—I wanted to—\" \"I know,\" said Natalie. \"I understand. It doesn\u0027t matter. What matters is that finally I found you. And we can talk.\" \"Natalie,\" Julie said, \"I don\u0027t quite know how to go about this. You can understand, can\u0027t you, that it would be a little awkward for me to invite you here?\" \"Yes, of course. But I can see you, can\u0027t I?\" \"How long can you stay in New York?\" \"Until Sunday.\" She could hear Julie thinking, in the silence. \"And you\u0027re all alone?\" \"Yes.\" \"My goodness. Listen, Natalie, don\u0027t try to go out for dinner tonight. Not by yourself. Have dinner in the hotel. I wish I could invite you here, but we have company coming, and I just don\u0027t see how—\" \"It\u0027s all right. I was planning to have dinner here, anyway.\" \"Well, then. Here\u0027s what we\u0027ll do. I\u0027ll meet you for lunch tomorrow. Have you ever been in New York before?\" \"No. I\u0027m overwhelmed by it.\" Julie laughed. \"I should think so. I was, too, once. Oh, there\u0027s so much I\u0027d like to show you, and we won\u0027t have time. Let me see. Do you know the Russian Tea Room?\" Natalie chuckled. \"I don\u0027t know anything.\" \"Of course not. I forgot for a minute. Well, take a cab tomorrow, around one, to the Russian Tea Room. That\u0027s West 57th Street, near Carnegie Hall. I\u0027ll meet you there. Now, don\u0027t try to walk or take a subway. It won\u0027t be very expensive to take a taxi, and it\u0027s much safer.\" \"Okay.\" Natalie wrote down the name of the restaurant, and the address. \"Natalie, do you need any money?\" \"Oh, no. That\u0027s not a problem.\" \"Well, I don\u0027t know how you chose your hotel, but do you realize it\u0027s one of the most expensive in New York?\"","sourceLink":"https://allnovel.net/find-a-stranger-say-goodbye/page-17.html","bookId":2710,"book":{"id":2710,"title":"Find a Stranger, Say Goodbye","description":"Storyline: Natalie Armstrong has all a girl could want: beauty and intelligence, a loving family and a great boyfriend. But something is missing; the answer to a most important question: \"Who is my mother?\"To find that answer seventeen-year-old Natalie begins a journey that she hopes will lead to the identity of her biological mother. And what if Natalie finds her? What will happen when they meet face-to-face?","cover":"https://allnovel.net/images/find-a-stranger-say-goodbye.jpg","author":"Lois Lowry","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/find-a-stranger-say-goodbye.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 10:29:59 AM"}}
