{"id":34491,"no":1,"title":"PREFACE","content":"Bearing in mind Emerson\u0027s saying that every action admits of being outdone, and around every circle another may be drawn, we none the less believe that a comparison of Sebastian Bach, Frederic Chopin and Richard Strauss, will show that, because of excellences peculiar to his day, and also individual excellences, no one of these three epoch-makers wholly outdoes, wholly encircles either of the others. Rather is he a link of a chain in which Beethoven, Wagner, and certain others are indispensable. That chain had beginning in the remote past, but, because inadequate, many early links are now broken. Of musicians prior to Bach, Gregory and Palestrina alone have endured the strain of time. The inadequacy of the old, true of not another art, proves music to be virtually an achievement of the last two and one-half centuries. This brief term, a mere fraction of that which must be allowed to certain of the sister arts, argues for music a very considerable period of future development. Comparison of the Gregorian Chants with the Wagnerian scores may bring doubt upon this statement, but, since the advent of Richard Strauss, it seems probable that the musician of the future will smile at the ideals of our contemporary composers. What were the tendencies whose centering in one master mind produced the great classical beginnings of modern music, we would show in our estimate of Bach. The tendencies eventuating in the free style of the romanticist, and the abandon of the ultra school, we would indicate in our estimate of Chopin. And, because of present tendencies, what direction tonal development will yet take, we shall endeavor to ascertain in our estimate of Richard Strauss.","sourceLink":"http://novel.tingroom.com/duanpian/2799/77441.html","bookId":1265,"book":{"id":1265,"title":"Three Great Epoch-Makers in Music","description":"简介： Bearing in mind Emerson\u0027s saying that every action admits of being outdone, and around every circle another may be drawn, we none the less believe that a comparison of Sebastian Bach, Frederic Chopin and Richard Strauss, will show that, because of ex...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2799","creation":"Aug 1, 2019 12:24:44 AM","modification":"Aug 1, 2019 12:24:44 AM"}}
