{"id":34697,"no":19,"title":"XIX THE CUSTODIAN","content":"When the river is low, a broad, flat stone lying a little way from shore at the foot of our lawn becomes an instrument of music. In the day it plays now a rhapsody of sun, now a nocturne of cloud, now the last concerto, Opus Eternal. In the night it becomes a little friendly murmur, a cradle song, slumber spell, neighbour to the Dark, the alien Dark who very likely grows lonely, being the silent sister, whereas the Light goes on blithely companioned of us all. But if I were the Dark and owned the stars, and the potion which quickens conscience, and the sense of the great Spirit brooding, brooding, I do not know that I would exchange and be the Light. Still, the Light has rainbows and toil and the sun and laughter.... After all, it is best to be a human being and to have both Light and Darkness for one\u0027s own. And it is concerning this conclusion that the river plays on its instrument of music, this shallow river \"—to whose falls Melodious birds sing madrigals.\" [Pg 310] I have heard our bank cat-birds in the willows sing madrigals to the stone-music until I wanted to be one of them—cat-bird, madrigal, shallows, or anything similar. But the human is perhaps what all these are striving to express, and so I have been granted wish within wish, and life is very good. Life was very good this summer afternoon when half the village gathered on our lawn above the singing stone, at Miggy\u0027s and Peter\u0027s \"Announcement Supper.\" To be sure, all Friendship Village had for several days had the news and could even tell you when the betrothal took place and where; but the two were not yet engaged, as Miggy would have said, \"out loud.\" \"What is engaged?\" asked Little Child, who was the first of my guests to arrive, and came bringing an offering of infinitesimal flowers which she finds in the grass where I think that they bloom for no one else. \"It means that people love each other very much—\" I began, and got no further. \"Oh, goody grand,\" cried Little Child. \"Then I\u0027m engaged, aren\u0027t I? To everybody.\" Whenever she leads me in deep water, I am accustomed to invite her to a dolphin\u0027s back by bidding her say over some song or spell which I have taught her. This afternoon while we waited on the lawn and her little voice went among the charmed[Pg 311] words, something happened which surely must have been due to a prank of the dolphin. For when she had taken an accurate way to the last stanza of \"Lucy,\" Little Child soberly concluded:— \"\u0027She lived unknown, and few could know When Lucy ceased to be; But she is in her grave, and what\u0027s The difference to me!\u0027\" But, even so, it was charming to have had the quiet metre present. I hope that there is no one who has not sometime been in a company on which he has looked and looked with something living in his eyes; on a company all of whom he holds in some degree of tenderness. It was so that I looked this afternoon on those who came across the lawn in the pleasant five o\u0027clock sun, and I looked with a difference from my manner of looking on that evening of my visit to the village, when I first saw these, my neighbours. Then I saw them with delight; now I see them with delight-and-that-difference; and though that difference is, so to say, partly in my throat, yet it is chiefly deep in my understanding. There came my Mis\u0027 Amanda Toplady, with her great green umbrella, which she carries summer and winter; Mis\u0027 Postmaster Sykes, with the full-blooming stalk of her tuberose pinned on her left shoulder; Mis\u0027 Holcomb-that-was-Mame-Bliss in the pink nun\u0027s veiling of the Post-office hall[Pg 312] supper; and my neighbour, who had consented to come, with: \"I donno as that little thing would want I should stay home. Oh, but do you know, that\u0027s the worst—knowin\u0027 that the little thing never saw me and can\u0027t think about me at all!\" And there came also those of whom it chances that this summer I have seen less than I should have wished: the Liberty sisters, in checked print. \"It don\u0027t seem so much of a jump out of mournin\u0027 into wash goods as it does into real dress-up cloth,\" gentle Miss Lucy says. And Abigail Arnold, of the Home Bakery, who sent a great sugared cake for to-day\u0027s occasion. \"Birthday cakes is correct,\" she observed, \"an\u0027 weddin\u0027 cake is correct. Why ain\u0027t engagement cakes correct—especially when folks get along without the ring? I donno. I always think doin\u0027 for folks is correct, whether it\u0027s the style or whether it ain\u0027t.\" And Mis\u0027 Photographer Sturgis, with a new and upbraiding baby; Mis\u0027 Fire Chief Merriman in \"new black, but not true mournin\u0027 now, an\u0027 anyway lit up by pearl buttons an\u0027 a lace handkerchief an\u0027 plenty o\u0027 scent.\" And Mis\u0027 \"Mayor\" Uppers who, the \"mayor\" not returning to his home and the tickets for the parlour clock having all been sold, to-day began offering for sale tickets on the \"parlour \u0027suit,\u0027 brocade\u0027 silk, each o\u0027 the four pieces a differ\u0027nt colour and all as bright as new-in-the-store.\" And though we all understood what she was doing and she knew[Pg 313] that we all knew, she yet drew us aside, one after another, to offer the tickets for sale privately, and we slipped the money to her beneath our handkerchiefs or our fans or our sewing. We all had our sewing—even I have become pleasantly contaminated and have once or twice essayed eyelets. Though there was but an hour to elapse before supper-time and the arrival of the \"men-folks,\" we settled ourselves about the green, making scallops on towels, or tatting for sheet hems, or crocheted strips for the hems of pillow-slips. Mis\u0027 Sykes had, as she almost always does have, new work which no one had ever seen before, and new work is accounted of almost as much interest as a new waist and is kept for a surprise, as a new waist should be kept. Little Child, too, had her sewing; she was buttonhole-stitching a wash-cloth and talking like a little old woman. I think that the little elf children like best to pretend in this way, as regular, arrant witches feign old womanhood. \"Aunt Effie is sick,\" Little Child was telling Mis\u0027 Toplady; \"she is sick from her hair to her slippers.\" I had a plan for Little Child and for us all; that after supper she should have leaves in her hair and on her shoulders and should dance on the singing stone in the river. And Miggy, whose shy independence is now become all shyness, was in the[Pg 314] house, weaving the leaves, and had not yet appeared at her party at all. Then one of those charming things happened which surely have a kind of life of their own and wake the hour to singing, as if an event were a river stone, and more, round which all manner of faint music may be set stirring. \"Havin\u0027 a party when I ain\u0027t lookin\u0027!\" cried somebody. \"My, my. I don\u0027t b\u0027lieve a word of what\u0027s name—this evolution business. I bet you anything heaven is just gettin\u0027 back.\" And there was Calliope, in her round straw hat and tan ulster, who in response to my card had hastened her imminent return. \"Yes,\" she said, when we had greeted her and put her in a chair under the mulberry tree, \"my relation got well. At least, she ain\u0027t sick enough to be cross, so \u0027most anybody could take care of her now.\" Calliope laughed and leaned back and shut her eyes. \"Land, land,\" she said, \"I got so much to tell you about I don\u0027t know where to begin. It\u0027s all about one thing, too—somethin\u0027 I\u0027ve found out.\" Mis\u0027 Amanda Toplady drew a great breath and let fall her work and looked round at us all. \"Goodness,\" she said, \"ain\u0027t it comfortable—us all settin\u0027 here together, nobody\u0027s leg broke, nobody\u0027s house on fire, nor none of us dead?\" [Pg 315] \"\u0027Us all settin\u0027 here together,\u0027\" Calliope repeated, suddenly grave amid our laughter, \"that\u0027s part of what I\u0027m comin\u0027 to. I wonder,\" she said to us, \"how you folks have always thought of the City? Up till I went there to stay this while I always thought of it as—well, as the City an\u0027 not so much as folks at all. The City always meant to me big crowds on the streets—hurryin\u0027, hurryin\u0027, eatin\u0027, eatin\u0027, and not payin\u0027 much attention to anything. One whole batch of \u0027em I knew was poor an\u0027 lookin\u0027 in bakery windows. One whole batch of \u0027em I knew was rich an\u0027 sayin\u0027 there has to be these distinctions. And some more I knew was good—I always see \u0027em, like a pretty lady, stoopin\u0027 over, givin\u0027. And some more I knew was wicked an\u0027 I always thought of them climbin\u0027 in windows. And then there was the little bit o\u0027 batch that knows the things I want to know an\u0027 talks like I\u0027d like to talk an\u0027 that I\u0027d wanted an\u0027 wanted to go up to the City an\u0027 get with. \"Well, then I went. An\u0027 the first thing, I see my relative wa\u0027n\u0027t rich nor poor nor bad nor good nor—the way I mean. Nor her friends that come to see her, they wan\u0027t either. The ones I took for rich talked economy, an\u0027 the ones I thought was poor spent money, an\u0027 the good ones gossiped, an\u0027 they all jabbered about music and pictures that I thought you couldn\u0027t talk about unless you knew[Pg 316] the \u0027way-inside-o\u0027-things, like they didn\u0027t know. The kinds seemed all mixed up, and all of \u0027em far away an\u0027 formal, like—oh, like the books in a library when you can\u0027t think up one to draw out. I couldn\u0027t seem to get near to anything. \"Then one night I done what I\u0027d always wanted to do. I took two dollars an\u0027 went to the theatre alone an\u0027 got me a seat. I put on the best I had, an\u0027 still I didn\u0027t feel like I was one of \u0027em, nor one of much of anybody. The folks on the car wasn\u0027t the way I meant, an\u0027 I felt mad at \u0027em for bein\u0027 differ\u0027nt. There was a smilin\u0027 young fellow, all dressed black an\u0027 expensive, an\u0027 I thought: \u0027Put you side of Peter Cary an\u0027 there wouldn\u0027t be anybody there but Peter.\u0027 And when I got inside the theatre, it was just the same: one awful collection of dressed-up hair an\u0027 dressed-down backs an\u0027 everybody smilin\u0027 at somebody that wasn\u0027t me and all seemin\u0027 so sure of themselves. Specially the woman in front of me, but I guess it always is specially the woman in front of you. She was flammed out abundant. She had trimmin\u0027s in unexpected places, an\u0027 a good many colours took to do it, an\u0027 a cute little chatter to match. It come to me that she was more than different from me: she was the otherest a person can be. An\u0027 I felt glad when the curtain went up. \"Well, sir,\" Calliope said, \"it was a silly little play—all about nothin\u0027 that you could lay much[Pg 317] speech to. But oh, they was somethin\u0027 in it that made you get down on your hands and knees in your own heart and look around in it, and look. They was an old lady and a young mother and a child and a man and a girl—well, that don\u0027t sound like much special, does it? And that\u0027s just it: it wasn\u0027t much special, but yet it was all of everything. It made \u0027em laugh, it made \u0027em cry, it made me laugh and cry till I was ashamed and glad and grateful. And when the lights come up at the end, I felt like I was kind of the mother to everything, an\u0027 I wanted to pick it up an\u0027 carry it off an\u0027 keep care of it. And it come over me all of a sudden how the old lady and the young mother an\u0027 man an\u0027 girl, man an\u0027 girl, man an\u0027 girl was right there in the theatre, near me, over an\u0027 over again; an\u0027 there I\u0027d been feelin\u0027 mad at \u0027em for seemin\u0027 far off. But they wasn\u0027t far off. They\u0027d been laughin\u0027 and cryin\u0027, too, an\u0027 they knew, just like I knew, what was what in the world. My, my. If it\u0027d been Friendship I\u0027d have gone from house to house all the way home, shakin\u0027 hands. An\u0027 as it was, I just had to speak to somebody. An\u0027 just then I see the flammed-out woman in front of me, that her collar had come open a little wee bit up top—not to notice even, but it give me an excuse. And I leaned right over to her and I says with all the sympathy in me:— [Pg 318] \"\u0027Ma\u0027am, your neck is peepin\u0027.\" \"She looked around su\u0027prised and then she smiled—smiled \u0027most into laughin\u0027. And she thanked me sweet as a friend an\u0027 nodded with it, an\u0027 I thought: \u0027Why, my land, you may have a baby home.\u0027 I never had thought of that. An\u0027 then I begun lookin\u0027 at folks an\u0027 lookin\u0027. An\u0027 movin\u0027 up the aisles, there wasn\u0027t just a theatre-lettin\u0027-out. They was folks. And all over each one was the good little things they\u0027d begun rememberin\u0027 now that the play was over, or the hurt things that had come back onto \u0027em again.... An\u0027 out on the street it was the same. The folks had all got alive and was waitin\u0027 for me to feel friendly to \u0027em. Friendly. The young fellows in the cars was lovers, just like Peter. An\u0027 everybody was just like me, or anyhow more alike than differ\u0027nt; and just like Friendship, only mebbe pronouncin\u0027 their words some differ\u0027nt an\u0027 knowin\u0027 more kinds of things to eat. It seems to me now I could go anywhere an\u0027 find folks to be nice to. I don\u0027t love Friendship Village any the less, but I love more things the same way. Everything, \u0027most. An\u0027 I tell you I\u0027m glad I didn\u0027t die before I found it out—that we\u0027re all one batch. Do you see what I mean—deep down inside what I say?\" Calliope cried. \"Does it sound like anything to you?\" To whom should it sound like \"anything\" if not to us of Friendship Village? We know. [Pg 319] \"Honestly,\" said that great Mis\u0027 Amanda Toplady, trying to wipe her eyes on her crochet work, \"Whoever God is, I don\u0027t believe He wants to keep it a secret. He\u0027s always \u0027most lettin\u0027 us know. I \u0027most knew Who He is right then, while Calliope was talkin\u0027.\" \"I \u0027most knew Who He is right then, while Calliope was talkin\u0027.\" ... I said the words over while the men crossed the lawn, all arriving together in order to lighten the trial of guesthood: Dear Doctor June, little Timothy Toplady, Eppleby Holcomb, Postmaster Sykes, Photographer Jimmie Sturgis, Peter, and Timothy, Jr., and the others. Liva Vesey was already in the kitchen with Miggy and Elfa, and I knew that, somewhere invisible, Nicholas Moor was hovering, waiting to help dish the ice-cream. When the little tables, each with its bright, strewn nasturtiums, were set about the lawn, Miggy reluctantly appeared from the kitchen. She was in the white frock which she herself had made, and she was, as I have said, a new Miggy, not less merry or less elfin, but infinitely more human. It was charming, I thought, to see how she and Peter, far from tensely avoiding each other, went straight to each other\u0027s side. With them at table were Liva and Timothy, Jr., now meeting each other\u0027s eyes as simply as if eyes were for this purpose. [Pg 320] \"I \u0027most knew Who He is right then, while Calliope was talkin\u0027\" ... I thought again as we stood in our places and Doctor June lifted his hands to the summer sky as if He were there, too. \"Father,\" he said, \"bless these young people who are going to belong to each other—Thou knowest their names and so do we. Bless our being together now in their honour, and be Thou in our midst. And bless our being together always. Amen.\" And that was the announcement of Miggy\u0027s and Peter\u0027s betrothal, at their Engagement Party. Little Child, who was sitting beside Calliope, leaned toward her. \"How long will it take for God to know,\" she asked, \"after Doctor June sent it up?\" Calliope put her arm about her and told her. \"Then did He get here since Doctor June invited Him?\" Little Child asked. \"You think, \u0027way deep inside your head, an\u0027 see if He isn\u0027t here,\" I heard Calliope say. Little Child shut her eyes tightly, and though she did open them briefly to see what was on the plate which they set before her, I think that she found the truth. \"I \u0027most know,\" she said presently. \"Pretty near I know He is. I guess I\u0027m too little to be sure nor certain. When I\u0027m big will I know sure?\"[Pg 321] \"Yes,\" Calliope answered, \"then you\u0027ll know sure.\" \"I \u0027most knew Who He is while Calliope was talkin\u0027\" ... I said over once more. And suddenly in the words and in the homely talk and in the happy comradeship I think that I slipped between the seeing and the knowing, and for a moment stood very near to the Custodian—Himself. The Custodian Who is in us all, Who speaks, now as you, now as I, most clearly in our human fellowship, in our widest kinship, in the universal togetherness. Truly, it is not as my neighbour once said, for I think that God has many and many to \"neighbour with,\" if only we would be neighbours. Presently, as if it knew that it belonged there, the sunset came, a thing of wings and doors ajar. Then Miggy fastened the leaves in Little Child\u0027s hair and led her down to dance on the broad, flat stone which is an instrument of music. Above the friendly murmur of the shallows the little elf child seemed beckoning to us others of the human voices on the shore. And in that fair light it was as if the river were some clear highway, leading from Friendship Village to Splendour Town, where together we might all find our way. The End","sourceLink":"http://novel.tingroom.com/jingdian/1799/52257.html","bookId":1055,"book":{"id":1055,"title":"Friendship Village Love Stories","description":"简介： Although it is June, the Little Child about whom I shall sometimes write in these pages this morning brought me a few violets. June violets. They sound unconvincing and even sentimental. However, here they are in their vase; and they are all white bu...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1799","creation":"Aug 1, 2019 12:24:16 AM","modification":"Aug 1, 2019 12:24:16 AM"}}
