{"id":25449,"no":29,"title":"XXVIII.—ATHENS.","content":"IN the thought of the least classical reader, Attica occupies a space almost as large as the rest of the world. He hopes that it will broaden on his sight as it does in his imagination, although he knows that it is only two thirds as large as the little State of Rhode Island. But however reason may modify enthusiasm, the diminutive scale on which everything is drawn is certain to disappoint the first view of the reality. Who, he asks, has made this little copy of the great Athenian picture? \n \n When we came upon deck early in the morning, the steamer lay in the land-locked harbor of the peninsula of Pir鎢s. It is a round, deep, pretty harbor; several merchant and small vessels lay there, a Greek and an Austrian steamer, and a war-vessel, and the scene did not lack a look of prosperous animation. About the port clusters a well-to-do village of some ten thousand inhabitants, many of whom dwell in handsome houses. It might be an American town; it is too new to be European. There, at the entrance of the harbor, on a low projecting rock, are some ruins of columns, said to mark the tomb of Themistocles; sometimes the water nearly covers the rock. There could be no more fitting resting-place for the great commander than this, in sight of the strait of Salamis, and washed by the waves that tossed the broken and flying fleet of Xerxes. Beyond is the Bay of Phalerum, the more ancient seaport of the little state. And there—how small it seems!—is the plain of Athens, enclosed by Hymettus, Pentelicus, and Parnes. This rocky peninsula of Pir鎢s, which embraced three small harbors, was fortified by Themistocles with strong walls that extended, in parallel lines, five miles to Athens. Between them ran the great carriage-road, and I suppose the whole distance was a street of gardens and houses. \n \n A grave commissionnaire,—I do not know but he would call himself an embassy,—from one of the hotels of Athens, came off and quietly took charge of us. On our way to the shore with our luggage, a customs officer joined us and took a seat in the boat. For this polite attention on the part of the government our plenipotentiary sent by the officer (who did not open the trunks) three francs to the treasury; but I do not know if it ever reached its destination. We shunned the ignoble opportunity of entering the classic city by rail, and were soon whirling along the level and dusty road which follows the course of the ancient Long Wall. Even at this early hour the day had become very warm, and the shade of the poplar-trees, which line the road nearly all the way, was grateful. The fertile fields had yet the freshness of spring, and were gay with scarlet poppies; the vines were thrifty. The near landscape was Italian in character: there was little peculiar in the costumes of the people whom we met walking beside their market-wagons or saw laboring in the gardens; turbans, fezes, flowing garments of white and blue and yellow, all had vanished, and we felt that we were out of the Orient and about to enter a modern city. At a half-way inn, where we stopped to water the horses, there was an hostler in the Albanian, or as it is called, the Grecian national, costume, wearing the fustanella and the short jacket; but the stiff white petticoat was rumpled and soiled, and I fancied he was somewhat ashamed of the half-womanly attire, and shrank from inspection, like an actor in harlequin dress, surprised by daylight outside the theatre. \n \n This sheepish remnant of the picturesque could not preserve for us any illusions; the roses blooming by the wayside we knew; the birds singing in the fields we had heard before; the commissionnaire persisted in pointing out the evidences of improvement. But we burned with a secret fever; we were impatient even of the grateful avenue of trees that hid what we at every moment expected to see. I do not envy him who without agitation approaches for the first time, and feels that he is about to look upon the Acropolis! There are three supreme sensations, not twice to be experienced, for the traveller: when he is about to behold the ancient seats of art, of discipline, of religion,—Athens, Rome, Jerusalem. But it is not possible for the reality to equal the expectation. \"There!\" cried the commissionnaire, \"is the Acropolis!\" A small oblong hill lifting itself some three hundred and fifty feet above the city, its sides upheld by walls, its top shining with marble, an isolated fortress in appearance! The bulk of the city lies to the north of the Acropolis, and grows round to the east of it along the valley of the Ilissus. \n \n In five minutes more we had caught a glimpse of the new excavations of the Keramicus, the ancient cemetery, and of the old walls on our left, and were driving up the straight broad Hermes Street towards the palace. Midway in the centre of the street is an ancient Byzantine church, which we pass round. Hermes Street is intersected by 苚lus Street; these two cut the city like a Greek cross, and all other streets flow into them. The shops along the way are European, the people in the streets are European in dress, the caf閟, the tables in front of hotels and restaurants, with their groups of loungers, suggest Paris by reminding one of Brussels. Athens, built of white stone, not yet mellowed by age, is new, bright, clean, cheerful; the broad streets are in the uninteresting style of the new part of Munich, and due to the same Bavarian influence. If Ludwig I. did not succeed in making Munich look like Athens, Otho was more fortunate in giving Athens a resemblance to Munich. And we were almost ashamed to confess how pleasant it appeared, after our long experience of the tumble-down Orient. \n \n We alighted at our hotel on the palace place, ascended steps decked with flowering plants, and entered cool apartments looking upon the square, which is surrounded with handsome buildings, planted with native and exotic trees, and laid out in walks and beds of flowers. To the right rises the plain fa鏰de of the royal residence, having behind it a magnificent garden, where the pine rustles to the palm, and a thousand statues revive the dead mythology; beyond rises the singular cone of Lycabettus. Commendable foresight is planting the principal streets with trees, the shade of which is much needed in the long, dry, and parching summer. \n \n From the side windows we looked also over the roofs to the Acropolis, which we were impatient and yet feared to approach. For myself, I felt like deferring the decisive moment, playing with my imagination, lingering about among things I did not greatly care for, whetting impatience and desire by restraining them, and postponing yet a little the realization of the dream of so many years,—to stand at the centre of the world\u0027s thought, at the spring of its ideal of beauty. While my companions rested from the fatigue of our sea voyage, I went into the street and walked southward towards the Ilissus. The air was bright and sparkling, the sky deep blue like that of Egypt, the hills sharp and clear in every outline, and startlingly near; the long reach of Hymettus wears ever a purple robe, which nature has given it in place of its pine forests. Travellers from Constantinople complained of the heat: but I found it inspiring; the air had no languor in it; this was the very joyous Athens I had hoped to see. \n \n When you take up the favorite uncut periodical of the month, you like to skirmish about the advertisements and tease yourself with dipping in here and there before you plunge into the serial novel. It was absurd, but my first visit in Athens was to the building of the Quadrennial Exposition of the Industry and Art of Greece,—a long, painted wooden structure, decked with flags, and called, I need not say, the Olympium. To enter this imitation of a country fair at home, was the rudest shock one could give to the sentiment of antiquity, and perhaps a dangerous experiment, however strong in the mind might be the subtone of Acropolis. The Greek gentleman who accompanied me said that the exhibition was a great improvement over the one four years before. It was, in fact, a very hopeful sign of the prosperity of the new state; there was a good display of cereals and fruits, of silk and of jewelry, and various work in gold and silver,—the latter all from Corfu; but from the specimens of the fine arts, in painting and sculpture, I think the ancient Greeks have not much to fear or to hope from the modern; and the books, in printing and binding, were rude enough. But the specimens from the mines and quarries of Greece could not be excelled elsewhere; the hundred varieties of exquisite marbles detained us long; there were some polished blocks, lovely in color, and you might almost say in design, that you would like to frame and hang as pictures on the wall. Another sign of the decadence of the national costume, perhaps more significant than its disappearance in the streets, was its exhibition here upon lay figures. I saw a countryman who wore it sneaking round one of these figures, and regarding it with the curiosity of a savage who for the first time sees himself in a mirror. Since the revolution the Albanian has been adopted as the Grecian costume, in default of anything more characteristic, and perhaps because it would puzzle one to say of what race the person calling himself a modern Greek is. But the ridiculous fustanella is nearly discarded; it is both inconvenient and costly; to make one of the proper fulness requires forty yards of cotton cloth; this is gathered at the waist, and hangs in broad pleats to the knees, and it is starched so stiffly that it stands out like a half-open Chinese umbrella. As the garment cannot be worn when it is the least soiled, and must be done up and starched two or three times a week, the wearer finds it an expensive habit; and in the whole outfit—the jacket and sleeves may be a reminiscence of defensive armor—he has the appearance of a landsknecht above and a ballet-girl below. \n \n Nearly as rare in the streets as this dress are the drooping red caps with tassels of blue. The women of Athens whom we saw would not take a premium anywhere for beauty; but we noticed here and there one who wore upon her dark locks the long hanging red fez and gold tassel, who might have attracted the eye of a roving poet, and been passed down to the next age as the Maid of Athens. The Athenian men of the present are a fine race; we were constantly surprised by noble forms and intelligent faces. That they are Greek in feature or expression, as we know the Greek from coins and statuary, we could not say. Perhaps it was only the ancient Lacedemonian rivalry that prompted the remark of a gentleman in Athens, who was born in Sparta, that there is not a drop of the ancient Athenian blood in Athens. There are some patrician families in the city who claim this honorable descent, but it is probable that Athens is less Greek than any other town in the kingdom; and that if there remain any Hellenic descendants they must be sought in remote districts of the Morea. If we trusted ourselves to decide by types of face, we should say that the present inhabitants of Athens were of Northern origin, and that their relation to the Greeks was no stronger than that of Englishmen to the ancient Britons. That the people who now inhabit Attica and the Peloponnesus are descendants of the Greeks whom the Romans conquered, I suppose no one can successfully claim; that they are all from the Slavonians, who so long held and almost exclusively occupied the Greek mainland, it is equally difficult to prove. All we know is, that the Greek language has survived the Byzantine anarchy, the Slavonic conquest, the Frank occupation; and that the nimble wit, the acquisitiveness and inquisitiveness, the cunning and craft of the modern Greek, seem to be the perversion of the nobler and yet not altogether dissimilar qualities which made the ancient Greeks the leaders of the human race. And those who ascribe the character of a people to climate and geographical position may expect to see the mongrel inheritors of the ancient soil moulded, by the enduring influences of nature, into homogeneity, and reproduce in a measure a copy of that splendid civilization of whose ruins they are now unappreciative possessors. \n \n Beyond the temporary Olympium, the eye is caught by the Arch of Hadrian, and fascinated by the towering Corinthian columns of the Olympicum or Temple of Jupiter. Against the background of Hymettus and the blue sky stood fourteen of these beautiful columns, all that remain of the original one hundred and twenty-four, but enough to give us an impression of what was one of the most stately buildings of antiquity. This temple, which was begun by Pisistratus, was not finished till Hadrian\u0027s time, or until the worship of Jupiter had become cold and sceptical. The columns stand upon a terrace overlooking the bed of the Hissus; there coffee is served, and there we more than once sat at sundown, and saw the vast columns turn from rose to gray in the fading light. \n \n Athens, like every other city of Europe in this age of science and Christianity, was full of soldiers; we saw squads of them drilling here and there, their uniforms sprinkled the streets and the caf閟, and their regimental bands enlivened the town. The Greeks, like all the rest of us, are beating their pruning-hooks into spears and preparing for the millennium. If there was not much that is peculiar to interest us in wandering about among the shops, and the so-called, but unroofed and not real, bazaars, there was much to astonish us in the size and growth of a city of over fifty thousand inhabitants, in forty years, from the heap of ruins and ashes which the Turks left it. When the venerable American missionaries, Dr. Hill and his wife, came to the city, they were obliged to find shelter in a portion of a ruined tower, and they began their labors literally in a field of smoking desolation. The only attractive shops are those of the antiquity dealers, the collectors of coins, vases, statuettes, and figurines. Of course the extraordinary demand for these most exquisite mementos of a race of artists has created a host of imitations, and set an extravagant and fictitious price upon most of the articles, a price which the professor who lets you have a specimen as a favor, or the dealer who calmly assumes that he has gathered the last relics of antiquity, mentions with equal equanimity. I looked in the face of a handsome graybeard, who asked me two thousand francs for a silver coin, which he said was a Solon, to see if there was any guile in his eye; but there was not. I cannot but hope that this race which has learned to look honest will some time become so. \n \n Late in the afternoon we walked around the south side of the Acropolis, past the ruins of theatres that strew its side, and ascended by the carriage-road to the only entrance, at the southwest end of the hill, towards the Pir鎢s. We pass through a gate pierced in the side wall, and come to the front of the Propyl鎍, the noblest gateway ever built. At the risk of offending the travelled, I shall try in a paragraph to put the untravelled reader in possession of the main features of this glorious spot. \n \n The Acropolis is an irregular oblong hill, the somewhat uneven summit of which is about eleven hundred feet long by four hundred and fifty feet broad at its widest. The hill is steep on all sides, and its final spring is perpendicular rock, in places a hundred and fifty feet high. It is lowest at the southwest end, where it dips down, and, by a rocky neck, joins the Areopagus, or Mars Hill. Across this end is built the Propyl鎍, high with reference to the surrounding country, and commanding the view, but low enough not to hide from a little distance the buildings on the summit. This building, which is of the Doric order, and of pure Pentelic marble, was the pride of the Athenians. Its entire front is about one hundred and seventy feet; this includes the central portico (pierced with five entrances, the centre one for carriages) and the forward projecting north and south wings. In the north wing was the picture-gallery; the south wing was never completed to correspond, but the balance is preserved by the little Temple of the Wingless Victory, which from its ruins has been restored to its original form and beauty. The Propyl鎍 is approached by broad flights of marble steps, which were defended by fortifications on the slope of the hill. The distant reader may form a little conception of the original splendor of this gateway from its cost, which was nearly two and a half millions of dollars, and by remembering that it was built under the direction of Pericles at a time when the cost of a building represented its real value, and not the profits of city officials and contractors. \n \n Passing slowly between the columns, and with many a backward glance over the historic landscape, lingering yet lest we should abruptly break the spell, we came into the area. Straight before us, up the red rock, ran the carriage-road, seamed across with chisel-marks to prevent the horses\u0027 hoofs from slipping, and worn in deep ruts by heavy chariot-wheels. In the field before us a mass of broken marble; on the right the creamy columns of the Parthenon; on the left the irregular but beautiful Ionic Erechtheum. The reader sees that the entrance was contrived so that the beholder\u0027s first view of the Parthenon should be at the angle which best exhibits its exquisite proportions. \n \n We were alone. The soldier detailed to watch that we did not carry off any of the columns sat down upon a broken fragment by the entrance, and let us wander at our will. I am not sure that I would, if I could, have the temples restored. There is an indescribable pathos in these fragments of columns and architraves and walls, in these broken sculptures and marred inscriptions, which time has softened to the loveliest tints, and in these tottering buildings, which no human skill, if it could restore the pristine beauty, could reanimate with the Greek idealism. \n \n And yet, as we sat upon the western steps of the temple dedicated to Pallas Athene, I could imagine what this area was, say in the August days of the great Panathenaic festival, when the gorgeous procession, which I saw filing along the Via Sacra, returning from Eleusis, swept up these broad steps, garlanded with flowers and singing the hymn to the protecting goddess. This platform was not then a desolate stone heap, but peopled with almost living statues in bronze and marble, the creations of the genius of Phidias, of Praxiteles, of Lycius, of Clecetas, of Myron; there, between the two great temples, but overtopping them both, stood the bronze figure of Minerva Promachus, cast by Phidias out of the spoils of Marathon, whose glittering helmet and spear-point gladdened the returning mariner when far at sea, and defied the distant watcher on the Acropolis of Corinth. First in the procession come the sacrificial oxen, and then follow in order a band of virgins, the quadriga, each drawn by four noble steeds, the 閘ite of the Athenian youth on horseback, magistrates, daughters of noble citizens bearing vases and pater?, men carrying trays of offerings, flute-players and the chorus, singers. They pass around to the entrance of the Parthenon, which is toward the east, and those who are permitted enter the naos and come into the presence of the gold-ivory statue of Minerva. The undraped portions of this statue show the ivory; the drapery was of solid gold, made so that it could be removed in time of danger from a public enemy. The golden plates weighed ten thousand pounds. This work of Phidias, since it was celebrated as the perfection of art by the best judges of art, must have been as exquisite in its details as it was harmonious in its proportions; but no artist of our day would dare to attempt to construct a statue in that manner. In its right, outstretched hand it held a statue of Victory, four cubits high; and although it was erected nearly five hundred years before the Christian era, we are curious to notice the already decided influence of Egyptian ideas in the figure of the sphinx surmounting the helmet of the goddess. \n \n The sun was setting behind the island of Salamis. There was a rosy glow on the bay of Phalerum, on the sea to the south, on the side of Hymettus, on the yellow columns of the Parthenon, on the Temple of the Wingless Victory, and on the faces of the ever-youthful Caryatides in the portico of the Erechtheum, who stand reverently facing the Parthenon, worshipping now only the vacant pedestal of Athene the Protector. What overpowering associations throng the mind as one looks off upon the crooked strait of Salamis, down upon the bare rock of the Areopagus; upon the Pnyx and the bema, where we know Demosthenes, Solon, Themistocles, Pericles, Aristides, were wont to address the populace who crowded up from this valley, the Agora, the tumultuous market-place, to listen; upon the Museum Hill, crowned by the monument of Philopappus, pierced by grottos, one of which tradition calls the prison of Socrates,—the whole history of Athens is in a nutshell! Yet if one were predetermined to despise this mite of a republic in the compass of a quart measure, he could not do it here. A little of C鎠ar\u0027s dust outweighs the world. We are not imposed upon by names. It was, it could only have been, in comparison with modern naval engagements, a petty fight in the narrow limits of that strait, and yet neither the Persian soldiers who watched it from the Acropolis and in terror saw the ships of Xerxes flying down the bay, nor the Athenians, who had abandoned their citadel and trusted their all to the \"wooden walls\" of their ships, could have imagined that the result was laden with such consequences. It gives us pause to think what course all subsequent history would have taken, what would be the present complexion of the Christian system itself, if on that day Asiatic barbarism had rendered impossible the subsequent development of Grecian art and philosophy. \n \n We waited on the Acropolis for the night and the starlight and the thousand lights in the city spread below, but we did not stay for the slow coming of the midnight moon over Hymettus. \n \n On Sunday morning we worshipped with the Greeks in the beautiful Russian church; the interior is small but rich, and is like a private parlor; there are no seats, and the worshippers stand or kneel, while gilded and painted figures of saints and angels encompass them. The ceremony is simple, but impressive. The priests are in gorgeous robes of blue and silver; choir-boys sing soprano, and the bass, as it always is in Russian churches, is magnificent. A lady, tall, elegant, superb, in black faced and trimmed with a stuff of gold, sweeps up to the desks, kisses the books and the crucifix, and then stands one side crossing herself. We are most of us mortal, and all, however rich in apparel, poor sinners one day in the week. No one of the worshippers carries a prayer-book. There is reading behind the screen, and presently the priests bring out the elements of communion and exhibit them, the one carrying the bread in a silver vessel on his head, and the other the wine. The central doors are then closed on the mysterious consecration. At the end of the service the holy elements are brought out, the communicants press up, kiss the cross, take a piece of bread, and then turn and salute their friends, and break up in a cheerful clatter of talk. In contrast to this, we attended afterwards the little meeting, in an upper chamber, of the Greek converts of the American Mission, and listened to a sermon in Greek which inculcated the religion of New England,—a gospel which, with the aid of schools, makes slow but hopeful progress in the city of the unknown God. \n \n The longer one remains in Athens the more he will be impressed with two things: the one is the perfection of the old art and civilization, and what must have been the vivacious, joyous life of the ancient Athenians, in a climate so vital, when this plain was a garden, and these beautiful hills were clad with forests, and the whispers of the pine answered the murmurs of the sea; the other is the revival of letters and architecture and culture, visible from day to day, in a progress as astonishing as can be seen in any Occidental city. I cannot undertake to describe, not even to mention, the many noble buildings, either built or in construction, from the quarries of Pentelicus,—the University, the Academy, the new Olympium,—all the voluntary contributions of wealthy Greeks, most of them merchants in foreign cities, whose highest ambition seems to be to restore Athens to something of its former splendor. It is a point of honor with every Greek, in whatever foreign city he may live and die, to leave something in his last will for the adornment or education of the city of his patriotic devotion. In this, if in nothing else, they resemble the ancient patriots who thought no sacrifice too costly for the republic. Among the ruins we find no palaces, no sign that the richest citizen used his wealth in ostentatious private mansions. Although some of the Greek merchants now build for themselves elegant villas, the next generation will see the evidences of their wealth rather in the public buildings they have erected. In this little city the University has eighty professors and over twelve hundred students, gathered from all parts of Greece; there are in the city forty lady teachers with eight hundred female pupils; and besides these there are two gymnasiums and several graded schools. Professors and teachers are well paid, and the schools are free, even to the use of books. The means flow from the same liberality, that of the Greek merchants, who are continually leaving money for new educational foundations. There is but one shadow upon this hopeful picture, and that is the bigotry of the Greek church, to which the government yields. I do not now speak of the former persecutions suffered by the Protestant missionaries, but recently the schools for girls opened by Protestants, and which have been of the highest service in the education of women, have been obliged to close or else \"conform\" to the Greek religion and admit priestly teachers. At the time of our visit, one of the best of them, that of Miss Kyle of New York, was only tolerated from week to week under perpetual warnings, and liable at any moment to be suppressed by the police. This narrow policy is a disgrace to the government, and if it is continued must incline the world to hope that the Greeks will never displace the Moslems in Constantinople. \n \n In the front of the University stands a very good statue of the scholar-patriot Korais, and in the library we saw the busts of other distinguished natives and foreigners. The library, which is every day enriched by private gifts, boasts already over one hundred and thirty thousand volumes. As we walked through the rooms, the director said that the University had no bust of an American, though it had often been promised one. I suggested one of Lincoln. No, he wanted Washington; he said he cared to have no other. I did not tell him that Washington was one of the heroes of our mythic period, that we had filled up a tolerably large pantheon since then, and that a century in America was as good as a thousand years in Byzantium. But I fell into something of a historic revery over the apparent fact that America is as yet to Greece nothing but the land of Washington, and I rather liked the old-fashioned notion, and felt sure that there must be somewhere in the United States an antiquated and rich patriot who remembered Washington and would like to send a marble portrait of our one great man to the University of Athens. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1573/46691.html","bookId":1273,"book":{"id":1273,"title":"In The Levant","description":"简介： IN the winter and spring of 1875 the writer made the tour of Egypt and the Levant. The first portion of the journey is described in a volume published last summer, entitled My Winter on the Nile, among Mummies and Moslems; the second in the following...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1573","creation":"Aug 1, 2019 12:24:45 AM","modification":"Aug 1, 2019 12:24:45 AM"}}
