{"id":74627,"no":2,"title":"Page 2","content":"They were beautiful, and when Kat and Hale joined them, she too forgot that the other dancers existed. Hale was with her. Just the two of them. And Kat actually stopped thinking. She forgot about the jobs they had to do, the things she had to steal. When Hale pulled to a sudden stop, Kat thought he might kiss her. Dip her. Spin her. She was bracing herself, mentally preparing for it all, and she was ready—she really was—for anything but his pulling her close and whispering, “Kat, it’s time.” “Right. I…” Kat jerked upright and stumbled over the words. “I have to go to the bathroom.” And then she was gone, pushing past waiters carrying trays and women slipping lipsticks into handbags as they returned to their partners. Kat rushed into the ladies’ room and stood there gripping the sink and staring into the mirror, trying to catch her breath. “Kat?” Hale yelled through the door. “Kat! I’m coming in.” But he didn’t wait for her to answer. A woman came out of one of the stalls just as Hale burst through the door. She gasped but didn’t scream, and Hale gave her a very Hale-ish grin, so the woman hurriedly rinsed her hands and left without a word. “Are you okay?” he asked as soon as they were alone. Kat felt her breathing start to rev again. She heard a sound—a bang, bang, bang—beating like the telltale heart. “Kat?” Hale asked. Slowly, he brought a hand to her face and pushed a stray hair away from her eyes. “Thanks for the dance,” he said just as—bang—the noise came again. Kat shuddered and looked out the window. The apartment building she had seen when they’d first arrived was coming into view as the restaurant continued its rotation, so Kat took a deep breath and reached for the glass. “Are we ready?” Gabrielle asked, sliding into the room, a crossbow, black backpack, and fifty feet of military-grade cable in tow. Kat nodded. “Let’s go.” “You look freaked,” Gabrielle whispered while she unpacked their gear and Kat stripped off her dress to reveal the black catsuit she wore beneath it. Hale was busy at the window, so Kat whispered back, “There was tango,” which was answer enough for Gabrielle. “We’re coming into position,” Hale said, then handed the crossbow to Gabrielle, who took aim at the building that was slowly moving into direct line with the bathroom window. “We only have fifteen minutes,” he reminded them. “I know,” Kat said. A knock came on the door just as Gabrielle shot an arrow, sending the cable spiraling across the street to lodge in the mortar above the apartment’s window. She clipped a strap from the belt around her waist onto the outstretched line. “See you on the other side, Kitty Kat,” Gabrielle said with a smile, and a moment later she was zooming into the black. Kat climbed onto the ledge as soon as Gabrielle was clear, but Hale had to help her reach up to grab the cable and attach it to the belt at her waist. She was still dangling there when the knock came again. “Sir,” a familiar voice said from the other side of the door. “Sir, are you in there?” “Hold on,” Hale told Kat, and unlocked the door. “Marcus?” Hale’s valet wore his usual dark gray suit. His posture, as always, was perfect, but there was something decidedly different about the man who stood on the other side of the ladies’ room door. He stepped carefully inside and looked at Hale. “Excuse me, sir. If I could have a moment…” “Sure, Marcus,” Kat said, still dangling, swaying more than eighty stories in the air. “Take your time.” Hale walked to where Marcus stood, and listened while the butler whispered. Kat couldn’t read his lips, but there was no mistaking the look on Hale’s face as he turned toward her. “I gotta go.” “Go?” Kat yelled. She tried to wiggle free of her harness, but the cable was too high and Hale was already reaching for her arms, holding her steady as he kissed her forehead. “Where are you going?” “I’ll call you in a few days and…” He trailed off as if he had no idea what was supposed to come next. “I’ll call you.” “You said that already! Hale. Hale!” Kat tried to grab him, but he was out of reach, Marcus at his side, disappearing behind the closing door. And through it all, Kat’s heart kept pounding. The clock kept ticking. So Kat pushed away from the window, zooming into the night. Chapter 3 The old brownstone in Brooklyn was not, technically, Katarina Bishop’s home, but Kat was a girl for whom technicalities rarely—if ever—applied. The building itself belonged to a corporation that was a part of a conglomerate that was purchased by a shell company in 1972, and won in a poker game in ’73 by Kat’s uncle Eddie. And yet his name did not appear on any titles or tax rolls. Utilities were listed in the names of a half dozen different aliases and paid in full on the fifteenth of every month. As far as the city of New York was concerned, the building was the property of a ghost, a figment, a very prompt and responsible illusion. But Kat knew better. Kat knew the building belonged to a legend. When she pushed open the back door and stepped into the kitchen, Kat was certain what she was going to find. The lights were on and the stove was hot. A pair of ancient Dutch ovens sat over low heat, but for the moment, she and Gabrielle were alone as they carried in the small crate that they’d brought from Buenos Aires. Rich, sweet smells washed over Kat, so she sank onto a chair and put the crate on the table. They’d gone all the way to Argentina for the painting that lay inside, but Kat felt no sense of accomplishment or relief. The couriers would come for it tomorrow, and in the meantime, Kat was tired and drained and happy to be at least temporarily finished. “Okay, Kitty Kat, spill it.” Gabrielle walked to the old refrigerator, threw open the door, and studied the food inside. “I’ve been beside you for five thousand miles, and, trust me…you’re in something of a mood.” Kat thought about her cousin’s words, but she didn’t try to deny them. Changing the subject would be futile, and as tired as she was, there was no use in trying to run. So Kat rested her arms on the crate and her chin on her arms, and thought about all the things she didn’t like in that moment. Her head hurt. Her back hurt. Her hands hurt (but that was her own fault for doing zip-line work with no gloves). They were the typical aches and pains of any thief a day off the job, and none of them, Kat realized, could possibly compare to the pain inside her heart, so she took a deep breath and whispered, “Hale left me.” “He didn’t leave you, leave you,” Gabrielle said. “He just made a rapid and ill-timed departure.” “He left,” Kat snapped. “He had a sudden change of plans.” “Do I have to remind you, Gabrielle, that he left me hanging? Literally. Are you seriously not furious right now?” “Oh, I’m mad at him,” Gabrielle said. She stirred the contents of the largest pot. “I’m just a little surprised that you’re mad at him.” “What does that mean?” “It means, dear cousin, that I wouldn’t expect you to be angry. I would expect you to wonder why.…” Kat had spent twenty-four hours and a very long plane ride across most of two continents fuming at Hale for running off without a moment of thought or a word of explanation. But Gabrielle was right. Why would he leave so suddenly? Why would he jeopardize her safety and their job? Why would Hale, the boy who had been willing to do almost anything to be a part of her world for over two years, suddenly flee without a single clue as to where he might be going? Somewhere in the house, a door slammed. The floor creaked. On the stove, the contents of the Dutch ovens began to boil. And Kat’s cousin raised an eyebrow. “Are you going to tell him?” Gabrielle asked. “Or should I?” “Tell me what?” the old man said, but he didn’t really stop for an answer. “Do not stir my goulash, Gabrielle.” He moved to the stove slowly, like he’d been dozing in his easy chair and his legs weren’t quite working yet. But even with his gray hair and ratty, moth-eaten cardigan, there was something in Kat’s great-uncle’s eyes—a gravity that could make even a great thief tremble. “So,” he asked again, “tell me what?” “It’s good to see you too, Edward,” Gabrielle said in her uncle’s native tongue. Then she pulled a noodle out of one of the pots, plopped it into her mouth, and took her seat at the table. “So, Katarina, what is wrong?” Uncle Eddie sprinkled some oregano into a pot and stirred, but didn’t look back. “Was it the access? High-rises can be tricky.” “Access was fine, Uncle Eddie,” Kat said. “The exit, then,” he said. “The exit wasn’t a problem.” Kat ran her fingers along the rough pine of the crate, and didn’t bother asking how her uncle had known the details of the job in Buenos Aires. Uncle Eddie knew everything. He eyed the crate on the table. Kat could see him calculating the value of the painting that lay inside when he asked, “And so you bring me a box I cannot have, and a problem I cannot solve, is that it?” “The job was fine, Uncle Eddie,” Kat said. “It’s just that—” “Hale ran off in the middle of it.” “Gabrielle,” Kat snapped. “What?” Gabrielle said. “It’s the truth. I’m sure Uncle Eddie won’t kill him. He’ll probably just maim him a little.” “No,” Eddie said. “I won’t.” “Okay,” Gabrielle said. “So he’ll maim him a lot. But Hale can take it. I’m sure between Eddie and your dad, Hale’s just looking at a few broken—” “No, Gabrielle.” Eddie’s voice was stern. “I will do nothing of the kind.” “But…” Gabrielle gave her uncle a confused glance. “I value a young man who values family.” “We are Hale’s family,” Gabrielle said. “No.” Eddie picked up the newspaper that lay beside the stove and tossed it onto the kitchen table. “We’re not.” Kat didn’t reach for it. She didn’t have to. The headline was big and bold and looming in black and white: WORLD’S SIXTH WEALTHIEST WOMAN COMATOSE IN MANHATTAN HOME. “Is this…?” Kat couldn’t pull her eyes away from the photo that accompanied the words. The woman wore her white hair in an elegant updo, a diamond broach at the base of her neck, as she sat beneath a Monet that, if Kat were to guess, was most definitely the real one. “That, my dear, is Hazel Hale,” Uncle Eddie said. “She is your young man’s grandmother.” “She’s in a coma?” Gabrielle asked, turning the paper to get a better view. “She was,” Eddie said. “At six o’clock this morning she died.”","sourceLink":"https://allnovel.net/perfect-scoundrels-heist-society-3/page-2.html","bookId":2406,"book":{"id":2406,"title":"Perfect Scoundrels (Heist Society #3)","description":"Storyline: Perfect Scoundrels (Heist Society #3) Katarina Bishop and W.W. Hale the fifth were born to lead completely different lives: Kat comes from a long, proud line of loveable criminal masterminds, while Hale is the son of one of the most seemingly perfect dynasties in the world. If their families have one thing in common, it\u0027s that they both know how to stay under the radar while getting-or stealing-whatever they want. No matter the risk, the Bishops can always be counted on, but in Hale\u0027s family, all bets are off when money is on the line. When Hale unexpectedly inherits his grandmother\u0027s billion dollar corporation, he quickly learns that there\u0027s no place for Kat and their old heists in his new role. But Kat won\u0027t let him go that easily, especially after she gets tipped off that his grandmother\u0027s will might have been altered in an elaborate con to steal the company\u0027s fortune. Forced to keep a level head as she and her crew fight for one of their own, Kat comes up with an ambitious and far-reaching plan that only the Bishop family would dare attempt. To pull it off, Kat is prepared to do the impossible, but first, she has to decide if she\u0027s willing to save her boyfriend\u0027s company if it means losing the boy.","cover":"https://allnovel.net/images/perfect-scoundrels-heist-society-3.jpg","author":"Ally Carter","type":"Mystery","source":"allnovel","link":"https://allnovel.net/perfect-scoundrels-heist-society-3.html","creation":"Oct 5, 2019 8:58:41 AM","modification":"Oct 5, 2019 10:31:39 AM"}}
