{"id":34086,"no":31,"title":"CHAPTER XXX THE SCHOOL A SUCCESS","content":"Charleston, January, 1867. WE are now well on in the second year of the school, and it is no longer an experiment but a great success. Mamma’s methods and judgment have been fully justified. The “young Ladies” have behaved entirely like young ladies, and never done any of the things I feared. I have the delight of having Mlle. Le Prince established in the house, and French the language of the school, in a modified way, that is, there are no punishments for speaking English, but if a girl is really in earnest about learning, she speaks French, and if she is not it does not matter. I am getting to delight in teaching, and my little class learns amazingly. April, ’67. I have had a grand winter; Mary and Serena came for a long visit and went out during the season. They had the most beautiful Paris ball-dresses. It is impossible to describe the effect produced by these beautiful women in their beautiful costumes. Every one was nicely dressed, for all the girls{317} and their mothers had become expert dressmakers, with few exceptions. But the frocks were generally of the simplest muslins, sweet and fresh, but not such as would be worn in the great world to a full-dress ball; and when these creations, which would have been thought brilliant in any ballroom burst upon us, we were filled with admiration and wonder. I had risen to the dignity of two silk dresses this year, and felt very grand before the appearance of the Paris toilets. At the beginning of the war, mamma had packed all of Della’s and her best clothes, for which she knew they would have no use while refugees, in two large trunks, and they had been sent up the Pee Dee River to Morven in a flat with a load of rice. The flat had struck a snag and sunk, and the trunks had remained under water a long time, so that almost everything was ruined, but in looking over the mass of mildewed stuffs, I found two dresses of mamma’s, which I asked her to give me, as I thought I could make something of them. One was a very heavy thick black silk, with stripes of satin about two inches wide, every two inches apart, the stripes running across, or bayadere, as it was called then. But this was no longer the fashion; so I ripped up{318} the very ample full skirt, and after washing it three times to get off the stains of the muddy river water in which it had lain so long, I sewed the breadths together, matching the stripes so exactly that no one could imagine that it had been done. Then I cut the most beautiful long skirt by a Paris pattern, gored like an umbrella at the top, and flaring out into the most wonderful long train, which was stiffened with buckram, so that as you danced it slid along the waxed floor, even when your partner backed you all over the room; then the low-necked waist, which did fit beautifully, was trimmed with thread lace, and was sewed to the skirt. I thought the effect was regal. The other was a very heavy purple satin brocaded so as to make the effect of a purple satin covered with black lace. This was harder to wash and cleanse than the black, but I worked at it in the holidays, and ended by succeeding in making it too a thing of beauty, and felt that I was provided with apparel suitable to my character as chaperon. My friends were more beautiful than ever this season. I had become perfectly devoted to Serena, and she had showed that she returned the feeling, for in sending to Paris for their seaso{319}n’s toilets she had sent for six beautifully fine pocket-handkerchiefs for me, with my monogram most elaborately embroidered on them, the finest, most beautiful handkerchiefs I have had in my long life, I have one still just as a memento of her affection; beauty, spoiled and adored by men as she was, she had to divert some of the cotton money sent to Paris from her own finery to give me this delight. They were not at school this year, and I found it much harder to maintain my authority and dignity with them. Serena was terribly strong, and one day when she wanted to do something to which I would not consent, she came into my room, to make a last appeal to me; I was only half dressed, and she picked me up and threw me up in the air, and as she caught me, said: “Now will you let me?” I panted out: “Now less than ever.” She threw me up once more and left the room. There was a tale of her wishing to get her father’s consent to some plan, and holding him over the banister of the second-story piazza, saying she would drop him unless he yielded to her will; of course she did not get her wish. She was a grand woman, and no wonder she counted her victims by scores.{320} I wish I had time to tell of my many friends; they were all such nice men, who had fought through the war, and now were not ashamed to take any kind of honest work to enable them to help their mothers and sisters. There were literally butchers and bakers, and candlestick-makers, but all thorough, true gentlemen, and most of them beautiful dancers. The only public balls we had that year were the three balls given by the Cotillion Club. They were in the South Carolina Hall, with a fine waxed floor and good band of music, but very mild refreshments. The private parties were too delightful; the young men of the family giving the party always waxed the floor, and they became experts in doing it, and that was really the sole thing absolutely necessary to the success of a party. We were sure of good music, for there were four or five girls going into society that played delightfully for dancing. The refreshments generally consisted of rolls, handed in dishes of exquisite china, and water in very dainty glasses. At one or two houses we had the rare treat of coffee, but that did not often happen, and when the rolls appeared just before the German, they were very welcome, and greatly enjoyed, for we were all working hard,{321} and living none too high. In the winter the only recreation, except the dancing, was walking on the Battery in the afternoon. We made engagements for this, just as we did for a German, generally with girl friends, for the men at work did not get off for the afternoons. A run on the Battery in the early dusk, or just at sunset, after a hard day’s teaching was something heavenly, and when you had a friend near enough to enjoy silence nothing could be more perfect. Before the war my father never let us walk on the Battery on Sunday afternoon, for he said it was only fair for the darkies to have it that evening, and after the war no one walked there that afternoon, for it was thronged with negroes. The regular promenade for us that afternoon after church, for every one went to church morning and afternoon in those days, was down a very narrow, rough pavement to the west end of Tradd Street, to what was then Chisolm’s Mill, beyond all the houses, where the street was simply a roadway, with the marsh behind, and the broad salt river in front. Along the road piles of logs and lumber had been dumped here and there. To this spot the élite of Charleston wended their way, lads and lasses, two and two, and sat on the logs in place of benches, and watched the sun{322} slowly sink into the gorgeous clouds, which swallowed it up all too quickly, proclaiming the end of our happy day of Rest. Many a momentous conversation was murmured on those logs, with the strong, pungent smell of the marshes borne to us by the brisk, fresh breezes. Many a life contract was sealed there. Somehow it was easier to speak freely in those surroundings, all telling of work and toil, no beauty but God’s great lavish glory of sun and clouds and river and sky. What mattered money and income and fashion? Surely to love God and work and do your duty to the best of your ability, holding the strong, firm hand of the woman you loved, was to make the best of your life, and would insure a blessing upon it. No one will ever know how many troths were plighted there, nor how many lives, starting out with that simple, childlike faith, in the saving power of love and duty (that word so greatly scorned now), were justified in their confidence, and were noble and happy, and have brought up families of whom they may well be proud. I can never forget the shock of my first proposal, which took place down there. I had worked so hard before I left the country to prevent the asking of that question, and had succeeded so well, knowing all{323} the time in my secret heart that I had done so because I doubted my power to say no with sufficient firmness if the fateful words were spoken, had put all such thoughts out of my mind entirely; I went out as a chaperon, enjoying myself as a married woman would do; I knew there was only one man in the world that I would ever marry, and not quite sure that I could even marry him, but I forgot that other people did not know that. I had a great deal of attention and a great many friends, but never thought of them as possible lovers; so when one evening, sitting on a pile of squared logs which were far from comfortable, watching the tide come in, with the most glorious sunset clouds reflected in the water, and we had stopped talking for some time, and my thoughts were far away, Mr. Blank asked me to marry him, I just gasped with horror and exclaimed: “Oh, how awful! How could you spoil all our delightful friendship in this way! I am so distressed!” But he said: “Miss Bessie, this is very extraordinary conduct on your part! What did you think that I was coming to see you all the time for, and playing chess regularly once a week for, and following you about all the time at the parties, and doing everything in the world I could for you for?{324} I have never cared for any one else, and I never thought you could fail to understand my devotion.” “Oh,” I repeated, “it is too awful! You know, your dear sister was my best friend, and I liked you because of that, and I thought that was what made you like me, and I liked to be with you because you looked like her and reminded me of her; I have missed her so ever since she died. But now I see how blind and selfish I have been.” We had an awful walk home and parted at the steps, and he never came to see me again. As the days passed and he did not come to see me, mademoiselle, who had become devoted to me and watched my visitors with intense interest, said to me: “Où est donc ce bon M. Blanc? Il ne vient plus! J’espère que vous ne l’avez pas renvoyé! Il était si bel homme, et si gentil! Je ne pense pas que vous ayez la chance d’attirer un si bon parti encore!” This experience was a blow, and destroyed my confidence in and enjoyment of my friends; my eyes had been opened, and I was more careful in accepting men’s friendship as if they were girls. Nearly all the men in town fell victims to my beautiful friends, and when they left to go to their{325} new home in Virginia things were very flat, and the men very gloomy. My diary is at an end and I am very hazy and uncertain about dates. When we went this summer for the holidays up to my brother, at the log house in Plantersville, we took Mlle. le Prince with us, as she had nowhere to go, and I devoted a good deal of my time to studying French with her. We read “Les Travailleurs de la Mer,” and I remember very distinctly her disgust and disappointment; she would exclaim: “Appeler cela un roman! Où est donc l’amour?” Never having had any love-affair of her own, she was unwilling to read any book which did not supply her craving for love-stories, and she saw no beauty in Victor Hugo’s masterpiece. I cannot be sure, but I think it was this winter that General Sickles was put in command of Charleston. He took a big house in Charlotte Street, and soon after he got established there he brought his little daughter to mamma and asked to enter her at the school as a day-scholar, and mamma accepted her pleasantly as such. But it made quite a commotion; the feeling of many in the community was that mamma should have refused to take her. Those who were so bold as to speak to her on the subject were careful not to repeat{326} their indiscretion. One lady, however, was bold enough to say that she did not desire such association for her daughter, and my mother told her then she had best remove her daughter from school, which she did. There never was a more pathetic little figure than that of the new scholar; very pale, very thin and tall, about ten she looked, and dressed in the deepest, plainest black, with none of the natural gaiety of a child; it was said she had just lost her mother, but there was no way of getting behind the wall of childish reserve which this young spirit had been able to build around her inner being. My mother taught her altogether herself, for she did not fit into any of the classes, and mamma was deeply interested in her. The last year we were in Charleston the St. Cecilia Society began to revive, and determined to give two balls. This was a great event, and every one began to think about a ball dress. I, being like the immortal Mrs. Gilpin, who, “though on pleasure bent, had a frugal mind,” had bought a good piece of white alpaca, and constructed a frock of that, trimmed with handsome scarlet silk-velvet ribbon, which had trimmed an opera-cloak of my sister’s, made in Paris, which had gone down in the river with the other fine clothes. It{327} was a miracle that the velvet survived the ordeal, and was still beautiful after being steamed, and I was delighted with my frock when it was finished. Mamma had not ever seemed to think about my clothes, but the idea of a St. Cecilia Ball roused her to ask: “Bessie, have you a suitable dress for the approaching ball?” “Yes, mamma, I have a very nice frock.” “What is it?” “A white alpaca trimmed with red velvet, and I have covered my slippers with red velvet to match.” Mamma exclaimed in horror: “An alpaca dress for a St. Cecilia Ball! Impossible! I cannot consent to your going so unsuitably dressed.” Then I burst out most improperly: “It is too late now to say that. I have spent my hard-earned money for the frock, and it is finished. I got it because it would last better than a muslin, and when it gets dirty I can have it dyed for a day frock. You used to take great interest in Della’s clothes and choose them all, because she was pretty, but as I am ugly you have never cared what I put on.” Poor mamma was terribly shocked, and said so; then she said: “I certainly will see that you have a proper outfit for this occasion.{328}” True to her word, she went out, bought and had made by Mrs. Cummings, the best dressmaker in town, a real ball dress. White tulle over white silk, and trimmed with wreaths of little fine white flowers. When I went to try it on I could scarcely believe my eyes, and found it hard to sleep that night for thinking of it. Mrs. Cummings promised to have it sent by seven o’clock Thursday, the night of the ball. I waited and looked anxiously; eight came, no dress, and finally at nine I sent the others off to the ball and went to bed. I felt I had been well punished for my wicked outburst of temper; but perhaps few can understand how I suffered, for few, I think, have the intense love of pleasure which I had in my youth. I could, and did, throw myself, heart and soul into my work, whatever it was, but I threw myself with equal vehemence into my play when the work was over. In two weeks’ time came the next St. Cecilia, and I went and wore my beautiful ball dress, but I had a very chastened feeling all the evening. The frock was a dream, quite short, with little pleatings of tulle, from the waist to the bottom; the waist fitted perfectly, and mamma had fulfilled her promise of an outfit, for she had bought white kid slippers (one and a half was then my number) and a pair of white kid gloves, some{329}thing I had never even dreamed of; so for once I was properly attired according to the ideas of the great world, and mamma was very pleased when I went to show myself to her before going. We still walked to all entertainments in our boots, our slippers, carefully wrapped up, being intrusted to our escort, who received them with a kind of reverence mingled with joy, at having committed to his care a part of one’s vital belongings. This was only for real balls, however; at the little informal dances which we had very often, we danced in our walking shoes, always waxing the soles thoroughly before going into the dancing-room. This important service was also rendered by one’s escort, and was regarded almost in the light of an accolade. In the rather laborious life that I led, never any fire in my bedroom, never any hot water, I suffered terribly from chilblains, and my hands and feet were often greatly swollen, so that I could not get on my shoes; then, instead of staying away, I asked mamma if she would lend me her best shoes. This was mamma’s only extravagance; she was a very tall woman with beautiful hands and feet, long and narrow, and common shoes did not fit her at all, so she had her boots made to order, at what to us seemed an enormous price; she wore fives, much too long for her, as she liked{330} them that way, but fitting perfectly in every other way. I could see that it was a supreme sacrifice on her part to lend me those, her most precious possession, but she consented, and I went off to a dance at the Dessaussure’s, arrayed in my black silk and mamma’s shoes, and enjoyed my comfortable feet immensely; I had stuffed the toes with cotton, as it was only in the length they were too big, and when people stepped on my foot, as was often the case that first evening that I wore them, as I had not got accustomed to managing feet so much longer than usual, they would apologize humbly and hope they had not hurt me too badly, I always answered: “You have not hurt me at all; that was only my shoe you stepped on, not my foot”—to their great amusement. One day a man said: “I was asked a conundrum that is going the rounds last night: what young lady has the biggest shoe and the smallest foot in town?” All this is very trivial and very silly, but as I make the effort to recall the past, all these foolish details come, and I just put them down.","sourceLink":"http://novel.tingroom.com/jingdian/2027/57794.html","bookId":632,"book":{"id":632,"title":"Chronicles of Chicora Wood","description":"简介： As I sit in the broad piazza, watching the closing of the day, I gaze into the vistas of moss-draped giant oaks. All is mystery, the mystery of nature, the mystery of the ages. These oaks, still strong, still beautiful, have seen generations pass. Th...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2027","creation":"Aug 1, 2019 12:19:04 AM","modification":"Aug 1, 2019 12:19:04 AM"}}
