{"id":31414,"no":2,"title":"Chapter 2","content":"GALLIO N the 804th year of the foundation of Rome, and the 13th of the principality of Claudius C?sar, Junius Ann?us Novatus was proconsul of Achaia. Born of a knightly family of Spanish origin, a son of Seneca the Rhetor and of the chaste Helvia, a brother of Ann?us Mela, and of the famed Lucius Ann?us, he bore the name of his adoptive father, the Rhetor Gallio, exiled by Tiberius. In his mother’s veins flowed the same blood as that of Cicero, and he had inherited from his father, together with immense wealth, a love of letters and of philosophy. He studied the works of the Greeks even more assiduously than those of the Latins. His mind was a prey to noble aspiration. He was an interested student of nature and of what appertains to her. The activity of his intelligence was so keen that he enjoyed being read to while in his bath, and that, even when joining in the chase, he was wont to carry with him his tablets of wax and his stylus. During the leisure moments which he managed to secure in the intervals of most serious duties and most important works, he wrote books on subjects relating to nature, and composed tragedies. His clients and his freedmen loudly proclaimed his gentleness. His was indeed a genial character. He had never been known to give way to a fit of anger. He looked upon violence as the worst and most unpardonable of weaknesses. All deeds of cruelty were held in execration by him, save when their true character escaped him owing to the consecration of custom and of public opinion. He frequently discovered, amid the severities rendered sacred by ancestral usage and sanctified by the laws, revolting excesses against which he raised his voice in protest, and which he would have attempted to sweep away, had not the interests of the State and the common welfare been objected from all quarters. In those days, conscientious magistrates and honest functionaries were not few and far between throughout the Empire. There were indeed a number as honest and as impartial as Gallio himself, but it is to be doubted whether another could be found so humane. Entrusted with the administration of that Greece despoiled of her riches, her pristine glory departed, and fallen from her freedom so full of life into an idle tranquillity, he remembered that she had formerly taught the world wisdom and the fine arts, and his treatment of her combined the vigilance of a guardian with the reverence of a son. He respected the liberties of the cities and the rights of individuals. He showed honour to those who were truly Greeks by birth and education, regretting that their numbers were sorely restricted, and that his authority extended for the greater part over an infamous rabble of Jews and Syrians; yet he remained equitable in dealing with these Asiatics, laying unction to his soul for what he considered a meritorious endeavour. He dwelt in Corinth, the richest and most densely populated city of Roman Greece. His villa, built in the time of Augustus, enlarged and embellished since then by the pro-consuls who had governed the province in succession, stood on the furthermost western slopes of the Acrocorinthus, whose foliaged summit was crowned by the Temple of Venus and the groves where dwelt her priests. It was a somewhat spacious mansion surrounded by gardens studded with bushy trees, watered by springs, ornamented with statues, alcoves, gymnasia, baths, libraries, and altars consecrated to the gods. He was strolling in it on a certain morn, according to his wont, with his brother Ann?us Mela, discoursing on the order of nature and the vicissitudes of fortune. The sun was rising, hazy in its white splendour in the roseate heavens. The gentle undulations of the hills of the Isthmus concealed the Saronic shore, the Stadium, the sanctuary of the sports, and the eastern harbour of Cenchre?. Between the fallow slopes of the Geranean range and the crimson twin-peaked Helicon, one could, however, obtain a glimpse of the quiescent blue waters of the Alcyonium Mare. In the distance, and to the north, glistened the three snow-capped summits of Parnassus. Gallio and Mela proceeded together as far as the edge of the elevated foreground. At their feet spread Corinth standing on an extensive plateau of pale yellow sand, and sloping gently towards the spumous fringe of the Gulf. The pavements of the forum, the columns of the basilica, the tiers of the hippodrome, the white steps of the porches sparkled, while the gilded roofs of the temples flashed dazzling rays. Vast and new, the town was intersected with straight-running streets. A wide road descended to the harbour of Lech?um, whose shore was fringed with warehouses and whose waters were covered with ships. To the west, the atmosphere reeked with the smoke of the iron-foundries, while the streams ran black from the pollution of the dye-houses, and on that side, forests of pine extending to the edge of the horizon, were lost to sight in the skies. Gradually, the town awoke from its slumbers. The strident neighing of a horse rent the morning calm, and soon were heard the muffled rumblings of wheels, shouting of waggoners, and the chanting voices of women selling herbs. Emerging from their hovels amid the ruins of the Palace of Sisyphus, aged and blind hags bearing copper vessels on their heads, and led by children, wended their way to draw water from the Pirene fountain. On the flat roofs of the houses abutting the grounds of the proconsul, Corinthian women were spreading linen to dry, and one of them was castigating her child with leek-stalks. In the hollow road leading to the Acropolis, a semi-nude old bronze-coloured man, prodded the rump of an ass laden with salad herbs and chanted between the stumps of his teeth and in his unkempt beard, a slave-song: “Toil, little ass, As I have toiled. Much good will it do you: You may be sure of it.” Meanwhile, at the sight of the town resuming its daily labour, Gallio fell a-musing over the earlier Corinth, the lovely Ionian city, opulent and joyous until the day when she witnessed the massacre of her citizens by the soldiery of Mummius, her women, the noble daughters of Sisyphus, sold at auction, her palaces and temples the prey of flames, her walls razed to the ground, and her riches piled away into the Liburnian ships of the Consul. “Hardly a century ago,” he remarked, “the work wrought by Mummius still stood revealed in all its horror. The shore which you see, brother mine, was more of a desert than the Libyan sands. The divine Julius rebuilt the town wrecked by our arms, and peopled it with freedmen. On this very strand, where the illustrious Bacchiad? formerly revelled in their haughty indolence, poor and rude Latins settled, and Corinth entered upon a new lease of life. She grew rapidly, and realised how to take advantage of her position. She levies tribute on all ships which, whether from the East or from the West, cast anchor in her two harbours of Lech?um and Cenchre?. Her population and wealth increase apace under the ?gis of the Roman peace. “What blessings has not the Empire bestowed throughout the world! To the Empire is due the profound tranquillity which the countryside enjoys. The seas are swept of pirates, and the highways of robbers. From the befogged Ocean to the Permulic Gulf, from Gades to the Euphrates, the trading of merchandise proceeds in undisturbed security. The law protects the lives and property of all. Individual rights must not be infringed upon. Liberty has henceforth no other limits than its lines of defence, and is circumscribed for its own security alone. Justice and reason rule the world.” Unlike his two brothers, Ann?us Mela had not intrigued for honours. Those who loved him, and their name was legion, for he was ever in his intercourse affable and extremely pleasant, attributed his detachment from public affairs to the moderation of a mind attracted by the blessings of tranquil obscurity, a mind which had no other care than the study of philosophy. But those who observed him with greater insight were under the impression that he was ambitious after his own fashion, and that like M?cenas, he, a simple knight, was consumed with the envy of enjoying the same consideration as the consuls. Lastly, certain evil-minded individuals believed that they discerned in him the greed of the Senecas for the riches which they affected to despise, and thus did they explain to themselves that Mela had for a long time lived in obscurity in Betica, giving himself up entirely to the management of his vast estates, and that subsequently summoned to Rome by his brother the philosopher, he had devoted himself to the administration of the finances of the Empire, rather than go in the quest of high judiciary or military posts. His character could not be readily determined from his utterances, for he spoke the language of the Stoics, a language equally adapted for the concealment of the weaknesses of the mind and the revelation of the grandeur of one’s sentiments. It was in those days the height of elegance to utter virtuous discourse. At any rate, there is no doubt that Mela spoke his thoughts. He replied to his brother that, although not versed in public affairs like himself, he had had occasion to admire the power and wisdom of the Romans. “They reveal themselves,” he said, “in the most remote parts of our own Spain. But it is in a wild pass of the mountains of Thessaly that I have been made to appreciate at its highest the beneficent majesty of the Empire. I had come from Hypata, a town renowned for its cheeses, and whose women were notorious for witchcraft, and I had been riding for some hours along mountain paths, without coming across a human face. Overcome by the heat and fatigue, I tethered my horse to a tree by the road, and lay down under an arbutus-bush. I had been resting there a short while only, when there came along a lean old man bowed down under a load of branches. Utterly exhausted, he tottered in his steps, and just as he was about to fall, exclaimed: ‘C?sar.’ On hearing such an invocation escape the lips of a poor woodcutter in this stony solitude, my heart overflowed with veneration for the tutelary City, which inspires, even unto the farthermost lands, the most rustic of minds with so great a conception of its sovereign providence. But sadness and a feeling of distress mingled with my admiration, brother mine, when I reflected upon the injury and insults to which the inheritance of Augustus and the fortune of Rome were exposed through men’s folly and the vices of the century.” “I have witnessed on the spot, brother mine,” replied Gallio, “the crimes and follies which sadden your mind. My cheek has blanched under the gaze of the victims of Caius from my seat in the Senate. I have held my peace, as I did not despair of better days. I am of the opinion that good citizens should serve the Republic under bad princes rather than shirk their duty in a useless death.” As Gallio was uttering these sentiments, two men, still in their youth and wearing the toga, came up to him. The one was Lucius Cassius, of a Roman family, plebeian but ancient, and having attained distinction. The other, Marcus Lollius, son and grandson of consuls, and moreover of a knightly family, which had sprung from the free town of Terracina. Both had frequented the schools of Athens, and acquired a knowledge of the laws of nature of which those Romans who had not been in Greece were totally ignorant. At the present moment, they were studying in Corinth the management of public affairs, and the proconsul surrounded himself with them as an ornamental adjunct to his magistracy. Somewhat behind them, the Greek Apollodorus, wearing the short cape of the philosophers, bald of head, and with Socratic beard, sauntered along, with uplifted arm and gesticulating fingers, discussing with himself. Gallio welcomed all three of them in kindly fashion. “The rose of dawn is already fading,” he said, “and the sun is beginning to shed its steeled darts. Come along, my good friends, to the coolness of the shady foliage beyond.” Saying this, he led them along the banks of a stream whose babbling murmur invited peaceful reflections, until they had reached an enclosure of verdant bushes in the midst of which lay in a hollow an alabaster basin filled with limpid waters on whose surface floated the feather of a dove, which had just bathed in them, and which was now cooing plaintively from a branch. They took their seats on a semicircular marble bench supported by griffins. Laurel and myrtle bushes blended their shadows about it. Statues encircled the enclosure. A wounded Amazon gracefully coiled her arm about her head. Grief appeared a thing of beauty on her lovely face. A shaggy Satyr was playing with a goat. A Venus, emerging from the bath, was drying her wetted limbs along which a shudder of pleasurable emotion seemed to run. Near by, a youthful Faun was smilingly placing a flute to his lips. His face was partly concealed by the branches, but his shining belly glistened amid the leafage. “That Faun seems animated,” remarked Marcus Lollius. “One could imagine that a gentle breathing was causing his bosom to heave.” “He is true to life, Marcus,” said Gallio. “One expects to hear rustic melodies flow from his flute. A Greek slave carved him out of the marble, in imitation of an ancient model. The Greeks formerly excelled in the making of these fanciful statues. Several of their efforts in this style are justly renowned. There is no gainsaying it: they have found the means of giving august traits to the gods and of expressing in both marble and bronze the majesty of the masters of the world. Who but admires the Olympian Zeus? And yet, who would care to be Phidias!” “No Roman would assuredly care to be Phidias,” exclaimed Lollius, who was spending the fortune he had inherited from his ancestry in ornamenting his villa at Pausilypum with the masterpieces of Phidias and Myron brought over from Greece and Asia. Lucius Cassius was of the same opinion. He argued with some warmth that the hands of a free man were not made to wield the sculptor’s chisel or the painter’s brush, and that no Roman citizen would condescend to the degrading work of casting bronze, hewing marble into shape, and painting forms on a wall. He professed admiration for the manners of the ancient times, and vaunted at every opportunity the ancestral virtues. “Men of the stamp of Curius and Fabricius cultivated their lettuce-beds, and slept under thatched roofs,” he said. “They wot of no other statue than the Priapus carved in the heart of a box-tree, who, protruding his vigorous pale in the centre of their garden, threatened pilferers with a terrible and shameful punishment.” Mela, who was well versed in the annals of Rome, opposed to this opinion the example of an old patrician. “In the days of the Republic,” he pointed out, “that illustrious man, Caius Fabius, of a family issued from Hercules and Evander, limned with his own hand on the walls of the Temple of Salus paintings so highly prized that their recent loss, on the destruction of the temple by fire, has been considered a public misfortune. It is moreover related that he did not doff his toga when painting, thus to indicate that such work was not unworthy of a Roman citizen. He was given the surname of Pictor, which his descendants were proud to bear.” Lucius Cassius replied with vivacity: “When painting victories in a temple, Caius Fabius had in mind those victories, and not the painting of them. No painters existed in Rome in those days. Anxious that the doughty deeds of his ancestors should for ever be present to the gaze of the Romans, he set an example to the artisans. But just as a pontiff or an ?dile lays the first stone of an edifice, without exercising for that the trade of a mason or of an architect, Caius Fabius executed the first painting Rome boasted of, without it being permissible to number him with the workmen who earn their livelihood by painting on walls.” Apollodorus signified approval of this speech with a nod, and, stroking his philosophic beard, remarked: “The sons of Ascanius are born to rule the world. Any other care would be unworthy of them.” Then, speaking at some length and in well-rounded sentences, he sang the praises of the Romans. He flattered them because he feared them. But in his innermost being, he felt nothing but contempt for their shallow intelligences so devoid of finesse. He beslavered Gallio with praise in these words: “Thou hast ornamented this city with magnificent monuments. Thou hast assured the liberty of its Senate and of its people. Thou hast decreed excellent regulations for trade and navigation, and thou dispensest justice with even tempered equity. Thy statue shall stand in the Forum. The title shall be granted to you of the second founder of Corinth, or rather Corinth shall take from you the name of Ann?a. All these things are worthy of a Roman, and worthy of Gallio. But, do not think that the Greeks have an exaggerated affection for the manual arts. If many of them are engaged in painting vases, in dyeing stuffs, and in modelling figures, it is through necessity. Ulysses constructed his bed and his ship with his own hands. At the same time, the Greeks proclaim that it is unworthy of a wise man to give himself up to futile and gross arts. In his youth, Socrates followed the trade of a sculptor, and modelled an image of the Charites still to be seen on the Acropolis of Athens. His skill was certainly not of a mediocre order, and, had he so wished, he could, like the most renowned artists, have portrayed an athlete throwing a discus or bandaging his head. But he abandoned like works to devote himself to the quest of wisdom, as commanded by the oracle. Henceforth, he attached himself to young men, not for the purpose of measuring the proportions of their bodies but solely to teach them that which is honest. He preferred those whose soul was beautiful to those of perfect form, differing in this respect from sculptors, painters and debauchees, who consider only external beauty, despising the inner comeliness. You are aware that Phidias engraved on the great toe of his Jupiter the name of an athlete, because he was handsome, and without considering whether he was pure.” “Hence it is,” was Gallio’s summing up, “that we do not sing the praises of sculptors, while bestowing them on their works.” “By Hercules!” exclaimed Lollius, “I do not know whether to admire most that Venus or that Faun. The goddess seems to reflect coolness from the water still dripping from her. She is truly the desire of gods and men; do you not fear, Gallio, that some night, a lout concealed in your grounds may subject her to an outrage similar to the one inflicted by a profane youth, so it is reported, on the Aphrodite of the Cnidians? The priestesses of her temple discovered one morning traces of the outrage on the body of the goddess, and travellers affirm that from that day until now she bears the indelible mark of her defilement. The audacity of the man and the patience of the Immortal One are to be wondered at.” “The crime did not remain unpunished,” affirmed Gallio. “The sacrilegious profaner flung himself into the sea, and fell on the rocks a shapeless mass. He was never again seen.” “There can be no doubt,” resumed Lollius, “that the Venus of Cnidus surpasses all others in beauty. But the artisan who carved the one in your grounds, Gallio, knew how to make marble plastic. Look at that Faun; he is laughing, and saliva moistens his teeth and his lips; his cheeks have the fresh bloom of the apple: his whole body glistens with youth. However, I prefer the Venus to the Faun.” Raising his right arm, Apollodorus said: “Most gentle Lollius, just think a bit, and you will fain admit that a like preference is pardonable in an ignorant individual who follows his instincts and who reasons not, but that it is not permitted to one as wise as yourself. That Venus cannot be as beautiful as that Faun, for the body of woman enjoys a perfection lesser than that of man, and the copy of a thing which is less perfect can never equal in beauty the copy of a thing that is more perfect. No doubt can assuredly exist, Lollius, that the body of woman is less beautiful than that of man, since it contains a less beautiful soul. Women are vain, quarrelsome, their mind occupied with trifles and incapable of elevated thoughts, while sickness oftentimes obscures their intellect.” “And yet,” remarked Gallio, “both in Rome and in Athens, virgins and matrons have been held worthy of presiding over sacred rites and of placing offerings on the altars. Nay more, the gods have at times selected virgins to give utterance to their oracular words, or to reveal the future to men. Cassandra wore the bands of Apollo about her head and prophesied the discomfiture of the Trojans. Juturna, to whom the love of a god gave immortality, was entrusted with the guardianship of the fountains of Rome.” “Quite true,” replied Apollodorus. “But the gods sell dearly to virgins the privilege of interpreting their wishes, and of announcing future events. While conferring on them the power of seeing that which is hidden, they deprive them of their reason and inflict madness on them. I will, however, Gallio, grant you that some women are better than some men and that some men are less good than some women. This arises from the fact that the two sexes are not as distinct and separate from each other as one would believe, and that, quite on the contrary, there is something of man in many women, and of woman in many a man. The following is the explanation of this commingling: “The ancestors of the men who nowadays people the earth sprang from the hands of Prometheus, who, to give them shape, kneaded the clay as does the potter. He did not confine himself to shaping with his hands a single couple. Far too prudent and too industrious to cause the entire human race to grow from one seed and from a single vessel, he undertook the manufacture of a multitude of women and men, in order to secure at once to humanity the advantage of numbers. In order better to carry out so difficult a work, he modelled separately at the outset all the parts which were to constitute both male and female bodies. He fashioned as many lungs, livers, hearts, brains, bladders, spleens, intestines, matrices and generative organs as were required, and, lastly, he made with subtle art, and in sufficient quantity, all the organs by means of which human beings might breathe freely, feed themselves, and enjoy the reproduction of the species. He forgot neither muscles, tendons, bones, blood nor fluids. He next cut out skins, intending to place in each one, as in a sack, the requisite articles. All these component parts of men and women were duly finished, and nothing remained but to put them together, when he was of a sudden invited to partake of supper at the residence of Bacchus. He went thither, crowned with roses, and indulged too freely in libations to the god, returning with tottering steps to his workshop. His brain befogged with the fumes of wine, his eyesight dimmed, and his hands shaky, he resumed his task, greatly to our misfortune. The distribution of organs among human beings seemed to him an easy enough pastime. He knew not what he was about, and was perfectly contented with his job, however badly he accomplished it. He was constantly and inadvertently allotting to woman that which was proper to man, and to man the things pertaining to woman. “Thus it came about that our first parents were composed of ill-assorted pieces which did not harmonise. And, having mated by choice or at haphazard, they produced beings as incoherent as themselves. Thus has it come about, through the Titan’s fault, that we see so many virile women and so many effeminate men. This also explains the contradictory characteristics to be met with in the firmest of minds and how it is that the most determined character is perpetually false to itself. And, finally, this is why we are all at variance with our own selves.” Lucius Cassius expressed condemnation of this fable, because it did not teach man to conquer himself, but on the contrary induced him to yield to nature. Gallio pointed out that the poets and philosophers gave a different interpretation as to the origin of the world and the creation of mankind. “The fables told by the Greeks,” he said, “should not be believed in too blindly, nor should we hold as truthful, Apollodorus, what they state in particular concerning the stones thrown by Pyrrha. The philosophers are not in accord among themselves as to the principle presiding over the creation of the world, and leave us in doubt as to whether the earth was produced by water, by air, or, as seems more credible, by the subtile heat. But the Greeks wish to know all things, and so they forge ingenious falsehood. How much better it is to confess our ignorance. The past is as much concealed from us as is the future; we are circumscribed by two dense clouds, in the forgetfulness of what was, and in the uncertainty of what shall be. And yet we suffer ourselves to be the playthings of an inquisitive desire to become acquainted with the causes of things, and a consuming anxiety incites us to ponder over the destinies of mankind and of the world.” “It is true,” sighed Cassius, “that we are everlastingly striving to penetrate the impenetrable future. We toil at this quest with all our might, and call to our aid all kinds of means. Anon we think to attain our object by meditation; again, by prayer and ecstasy. Some of us consult the oracles of the gods; others, fearing not to do that which is forbidden, appeal to the augurs of Chald?a, or try the Babylonian spells. Futile and sacrilegious curiosity! For, of what advantage would be to us the knowledge of future things, since they are inevitable! Nevertheless the wise men, still more so than the vulgar herd, feel the desire of delving into the future and of, so to speak, hurling themselves into it. It is doubtless because they hope thus to escape the present which inflicts on them so much that is sad and distasteful. Why should not the men of to-day be goaded with the desire of fleeing from these wretched times? We are living in an age replete with deeds of cowardice, abounding in ignominious acts, and fertile in crimes.” Cassius spoke at some length in depreciation of the times in which he lived. He lamented the fact that the Romans, fallen from their ancient virtues, no longer found any pleasure except in the consumption of the oysters of the Lucrine lake and of the birds of Phasis river, and that they had no taste except for mummers, chariot-drivers, and gladiators. He deplored the ills which the Empire was suffering from, the insolent luxury of the great, the contemptible avidity of the clients, and the savage depravity of the multitude. Gallio and his brother agreed with him. They loved virtue. Nevertheless, they had nothing in common with the patricians of old who, having no other care than the fattening of their swine, and the performance of the sacred rites, conquered the world for the better administration of their farms. This nobility of the byre, instituted by Romulus and Remus, was long since extinct. The patrician families created by the divine Julius and by the Emperor Augustus, had passed away. Intelligent men from all the provinces of the Empire had stepped into their places. Romans in Rome, they were nowhere strangers. They greatly surpassed the old Cethegus family by their refined minds and humane feelings. They did not regret the Republic; they did not regret liberty, the recollection of which recalled simultaneously proscriptions and civil wars. They honoured Cato as the heroic figure of another age, without wishing to see so exalted a type of virtue arise on top of fresh ruins. They looked upon the Augustan epoch and the first years of Tiberius as the happiest the world had ever known, since the Golden Age had existed in the imagination of the poets only. They lamented the fact that the new order of things, which had promised the world a long reign of felicity, should have so promptly burdened Rome with an unheard of shame unknown even to the contemporaries of Marius and Sulla. They had, during the madness of Caius, seen the best citizens branded with a hot iron, sentenced to the mines, to labour on the roads, thrown to wild beasts, fathers compelled to be present at the agony of their children, and men shining by their virtues, such as Cremutius Cordus, suffer themselves to die of starvation, in order to cheat the tyrant of their death. To Rome’s shame, be it said, Caligula respected neither his sisters nor the most illustrious dames. And, what filled these rhetors and philosophers with as great an indignation as the one they felt over the rape of the matrons and the assassination of the best citizens, were the crimes perpetrated by Caius against eloquence and letters. This madman had conceived the idea of destroying the poems of Homer, and had caused to be removed from all bookshelves the writings, the portraits, and the names of Virgil and of Livy. Finally, Gallio could not forgive him for having compared the style of Seneca to mortar without cement. They dreaded Claudius in a somewhat lesser degree, but despised him the more for all that. They ridiculed his pumpkin-like head and his seal-like voice. That old savant was not a monster of wickedness. The worst they could reproach him with was his weakness. But, in the exercise of the sovereign power, such weakness became at times as cruel as the cruelty of Caius. They also bore domestic grievances against him. If Caius had held Seneca up to ridicule, Claudius had banished him to Corsica. It is true that he had subsequently recalled him to Rome and conferred a pr?torship on him. But they showed him no gratitude for having thus carried out the behests of Agrippina, in ignorance of what he was commanding. Indignant but long suffering, they left it to the Empress to determine the fate of the aged man, and the choice of the new prince. Many rumours were current to the shame of the unchaste and cruel daughter of Germanicus. They heeded them not, and sang the praises of the illustrious woman to whom the Senecas owed the termination of their misfortune and their rise in honours. As will oftentimes happen, their convictions were in harmony with their interests. A painful experience of public life had left unshaken their trust in the régime established by the divine Augustus, a régime placed on a firmer basis by Tiberius, and under which they filled high positions. They were reckoning on a new master to redress the evils engendered by the masters of the Empire. Gallio produced from the folds of his toga a roll of papyrus. “Dear friends,” he said, “I have learnt this morning, through letters from Rome, that our young prince has married Octavia, the daughter of C?sar.” A murmur of approval greeted the news. “We should indeed,” continued Gallio, “congratulate ourselves over a union, by virtue of which the prince, combining with his former qualifications those of husband and of son-in-law, becomes henceforth the equal of Britannicus. My brother Seneca never ceases praising in his letters to me the eloquence and gentleness of his pupil who sheds lustre on his youth by pleading before the Senate in the presence of the Emperor. He has not yet completed his sixteenth year, yet he has already won the cases of three unfortunate or guilty cities—Ilion, Bolonia, and Apamea.” “He has not then,” asked Lucius Cassius, “inherited the evil disposition of the Domitians, his ancestors?” “Indeed he has not,” replied Gallio. “It is Germanicus who lives anew in him.” Ann?us Mela, who was not looked upon as a sycophant, joined in the praise of the son of Agrippina. His praises appeared affecting and sincere, since he pledged them, so to speak, on the head of his son, who was still of tender age. “Nero is chaste, modest, of a kindly disposition, and religious. My little Lucan, who is dearer to me than my eyes, was his play- and school-mate. Together they practised declamation in the Greek and Latin languages. Together they attempted to indite verse. Never did Nero, in the course of these contests of skill at versification, manifest the slightest symptom of jealousy. Quite the contrary, he enjoyed praising his rival’s verses, which, in spite of his tender age, revealed traces here and there of a consuming energy. He sometimes seemed happy to be surpassed by the nephew of his teacher. Such was the charming modesty of the prince of youth! Poets will some day compare the friendship of Nero and Lucan with that of Euryalus and Nisus.” “Nero,” the proconsul went on to say, “displays with the ardour of youth a gentle and merciful spirit. Time will but strengthen such virtues. “Claudius, when adopting him, has wisely acquiesced in the hope expressed by the Senate and the wish of the people. In so doing, he has removed from the Imperial succession a child overwhelmed by the shame of his mother, and has now, by giving Octavia to Nero, secured the accession of a youthful C?sar whom Rome will delight in. The respectful son of an honoured mother, the zealous disciple of a philosopher, Nero, whose adolescence is illumined with the most agreeable qualities, Nero, our hope and the hope of the world, will remember, when clad in purple, the teachings of the Portico, and will rule the universe with justice and moderation.” “We welcome the omen,” remarked Lollius. “May an era of happiness dawn upon the human race!” “’Tis difficult to predict the future,” said Gallio. “Still, we experience no doubts regarding the eternity of the City. The oracles have promised Rome an empire without end, and it would be sacrilegious not to put our faith in the gods. Shall I reveal to you my fondest hope? I joyfully expect the time when peace will reign for ever on the earth, following upon the chastising of the Parthians. Yes indeed, we may, without fear of deceiving ourselves, herald the end of war so hated by mothers. Who is there to disturb the Roman peace henceforth? Our eagles have spread to the confines of the universe. All the nations have experienced our strength and our mercy. The Arab, the Sab?an, the dweller on the slopes of the H?mus, the Sarmatian who quenches his thirst with the blood of his steed, the Sygambri of the curly locks, the woolly-headed Ethiopian, all come in hordes to worship Rome their protectress. Whence would new barbarians spring? Is it likely that the icy plains of the North or the burning sands of Libya hold in store enemies of the Roman nation? All Barbarians, won over to our friendship, will lay down their arms, and Rome, the white-haired great-grandmother, tranquil in her old age, will see the nations respectfully grouped about her as her adopted children, dwelling in harmony and love.” All signified their approval of the foregoing sentiments, excepting Cassius, who shook his head in disagreement. He felt a pride in his military ancestry while the glory of arms, so greatly extolled by poets and rhetors, kindled his enthusiasm. “I doubt, my friend Gallio,” he commented, “that nations will ever cease to hate and fear one another. To tell the truth, I should not desire such a consummation. Did war cease, what would become of strength of character, grandeur of soul, and love of country? Courage and devotion would be virtues out of date.” “Rest assured, Lucius,” said Gallio, “that when men shall cease to conquer one another, they will strive to subdue their own selves. That is the most virtuous attempt they can make, and the most noble use to which they can put their bravery and magnanimity. Yes indeed, the august mother whose wrinkles and whose hairs, blanched by centuries, we worship, Rome, will establish universal peace. Then shall the enjoyment of life be realised. Life under certain conditions is worth living. Life is a tiny flame between two infinite shadows; ’tis our share of the divine essence. During the term of his life, a man is similar to the gods.” While Gallio was thus discoursing, a dove perched itself on the shoulder of the Venus, whose marble contours gleamed among the myrtles. “My dear Gallio,” said Lollius with a smile, “the bird of Aphrodite takes delight in thy words. They are gentle and full of gracefulness.” A slave approached, bearing cool wine, and the friends of the proconsul discoursed of the gods. Apollodorus was of opinion that it was not easy to grasp their nature. Lollius doubted their very existence. “When thunder peals,” he said, “it all depends upon the philosopher whether it is the cloud or the god who has thundered.” Cassius, however, did not countenance such thoughtless arguments. He believed in the gods of the Republic. While entertaining doubts as to the extent of their providence, he asserted their existence, as he did not wish to differ from humanity on an essential point. And to support his belief in the faith of his ancestors, he had recourse to an argument he had learnt from the Greeks. “The gods exist,” he said. “Men have formed their idea of what they are like. Now, it is impossible to conceive an image not based on reality. How would it be possible to see Minerva, Neptune, and Mercury, were there neither Mercury, nor Neptune, nor Minerva?” “You have convinced me,” said Lollius mockingly. “The old woman who sells honey-cakes in the Forum, outside the basilica, has seen the god Typhon, he with the shaggy head of an ass, and a monster belly. He threw her on her back, threw her clothes over her ears, chastised her while keeping time to each resounding blow, and left her for dead, after polluting her in a disgusting fashion. She has herself told how, even as Antiope, she had been favoured with the visit of an immortal god. It is certain that the god Typhon exists, since he committed an outrage on an old cake-selling hag.” “In spite of thy mockery, Marcus, I do not doubt the existence of the gods,” resumed Cassius. “And I believe that they enjoy a human form, since it is under that form that they always show themselves to us, whether we slumber or whether we are awake.” “It would be better,” remarked Apollodorus, “to say that men possess the divine form, since the gods existed before them.” “My dear Apollodorus,” exclaimed Lollius. “You forget that Diana was first worshipped under the form of a tree, and that several important gods have the shape of an unhewn stone. Cybele is represented, not as a woman should be, with two breasts, but with several teats like a bitch or a sow. The sun is a god, but being too hot to assume the human form, he has taken the shape of a ball; he is a round god.” Ann?us Mela gently censured this academic jesting. “All that is related about the gods,” he said, “should not be taken literally. The vulgar herd calls wheat Ceres, and wine Bacchus. But where is to be found the man crazy enough to believe that he drinks and eats a god? Let us indulge in a more exalted knowledge of the divine nature. The gods are but the several parts of nature, and they are all lost in one god, who is nature in its entirety.” The proconsul signified his approval of the words of his brother, and speaking in a serious strain, defined the attributes of divinity. “God is the soul of the world; this soul spreads to all parts of the universe, infusing motion and life into it. This soul, a creative flame, penetrating the inert mass of matter, gave shape to the world, governing and preserving it. Divinity, an active force, is essentially good. The matter which it has put to good use, being inert and passive, is bad in certain of its parts. God has been powerless to change its nature. This explains the origin of the evil in the world. Our souls are particles of the divine fire into which they will some day be merged. Consequently, God is within us and he dwells in particular in the virtuous man whose soul is not hampered with gross materialism. This wise man, in whom God dwells, is God’s equal. He should not implore him, but contain him within himself. And what madness it is to pray to God! What an act of impiety it is to petition him! It is tantamount to believing that it is possible to enlighten his intelligence, to change his heart, and to persuade him to mend his behaviour. It is displaying ignorance of the necessity governing his immutable wisdom. He is subjected to Destiny, or, to be more accurate, he is Destiny. His ways are laws to which he is like ourselves subjected. For once that he commands, he obeys for ever. Free and powerful in his submission, it is to himself that he shows obedience. All the happenings in the world are the manifestations of sovereign intentions originating with himself. His helplessness against himself is infinite.” Gallio’s speech was applauded by his hearers. Apollodorus, however, craved permission to submit a few objections. “You are right, Gallio,” he said, “when you believe that Jupiter is at the mercy of Anankè and I hold with you that Anankè is the first among the immortal goddesses. But it appears to me that your god, above all admirable in his compass and his perpetuity, had better intentions than luck when he created the world, since he found nothing better wherewith to knead it than a rebellious and ingrate substance, and that the material betrays the workman. I cannot but feel for him over his discomfiture. The potters of Athens are more fortunate. They procure, for the purpose of making vases, a delicate and plastic clay which readily takes and preserves the contours they give it. Hence do their goblets and amphor? present an agreeable form. Their curves are graceful, and the painter limns with ease figures pleasing to the eye, such as old Silenus bestriding his ass, the toilet of Aphrodite, and the chaste Amazons. When I come to think of it, Gallio, I am of the opinion that if your god was less fortunate than the potters of Athens, ’tis for the reason that he lacked wisdom and that he was a poor artisan. The material at his disposal was not of the best. Still, it was not devoid of all serviceable properties, as you have yourself confessed. Nothing is absolutely good or absolutely bad. A thing may be bad if put to a certain use, while it may be excellent in some other. It would be waste of time to plant olive-trees in the clay used in fashioning amphor?. The tree of Pallas would not grow in the light and pure soil of which are made the beautiful vases which our victorious athletes receive, blushing the while with pride and modesty. It seems to me, Gallio, that your god, when fashioning the world with a material that was not suitable for the undertaking, was guilty of the mistake which a vine-dresser of Megara would be committing, were he to plant a vine in modelling clay, or were some worker in ceramics to select for the making of amphor? the stony soil which affords nutriment to the clusters of the grape-vine. Your god, you say, made the universe. He ought certainly to have given form to some other thing, in order to make suitable use of his material. Since the substance, as you assert, proved rebellious to him, either through its inherent inertia, or through some other bad quality, should he have persisted in putting it to a use it could not respond to, and, as the saying goes, carve his bow out of a cypress? The secret of industry does not consist in accomplishing much, but in doing good work. Why did he not content himself with creating some small thing, say a gnat, or a drop of water, but finish it to perfection? “I might add further remarks about your god, Gallio, and ask you, for instance, if you do not entertain a fear that from his constant rubbing against matter, he may wear out, just as a millstone becomes worn in the long run in the course of grinding wheat. But such questions are not to be solved in a hurry, and the time of a proconsul is precious. Permit me at least to say to you that you are not justified in believing that your god rules and preserves the world, since, according to your own admission, he deprived himself of intelligence after having become acquainted with all things; of will-power, after having willed all things, and of power, following upon his ability to do what he saw fit. Herein again lay, on his part, a serious mistake, for he was thus an instrument in depriving himself of the means of correcting his imperfect work. So far as I am concerned, I am inclined to believe that god is in reality, not the one you have conceived, but indeed the matter he discovered on a certain day, and which the Greeks have styled chaos. You are mistaken in your belief that matter is inert. It is ever in motion, and its perpetual activity keeps life a-going throughout the universe.” Thus spake the philosopher Apollodorus. Gallio, who had listened to his speech with some degree of impatience, denied that he had fallen a victim to the mistakes and contradictions with which the Greek charged him. But he failed in refuting successfully the arguments of his opponent, as his intellect was not a subtle one and because he demanded principally of philosophy the means of rendering men virtuous, and because he was interested in useful truths only. “Try to grasp, Apollodorus,” he said, “that God is none other than nature. Nature and himself are one. God and Nature are the two names of a single being, just as Novatus and Gallio designate one and the same man. God, if you prefer, is divine reason commingling with the earth. You need have no fear that he will wear out through this amalgamation, since his tenuous substance participates of the fire which consumes all matter while remaining unchanged. “But should, nevertheless,” proceeded Gallio, “my doctrine embrace ill-assorted ideas, do not blame me for it, my dear Apollodorus, but rather give me praise because I suffer a few contradictions to find a place in my mind. Were I not conciliatory as regards my own ideas, were I to confer upon a single system an exclusive preference, I could no longer tolerate the freedom of every opinion; having destroyed my own freedom of thought, I could not readily tolerate it in the case of others, and I should forfeit the respect due to every doctrine established or professed by a sincere man. The gods forbid that I should see my opinion prevail to the exclusion of any other, and exercise an absolute sway on other minds. Conjure up a picture, my dear friends, of the state of manners and morals, were a sufficient number of men firmly to believe that they were the sole possessors of the truth, if, by some impossible chance, they were thoroughly agreed as to that truth. A too narrow piety among the Athenians, who are nevertheless full of wisdom and of doubt, was the cause of the banishment of Anaxagoras and of the death of Socrates. What would happen were millions of men enslaved by one solitary idea concerning the nature of the gods? The genius of the Greeks and the prudence of our ancestors made allowance for doubt, and tolerated the worship of Jupiter under several names. No sooner should a powerful sect come on this ailing earth and proclaim that Jupiter has one name only, than blood would flow the world over, and no longer would there be but one Caius whose madness should threaten the human race with death. All the men of such a sect would be so many Caiuses. They would face death for a name. For a name, they would kill, since it is rather in the nature of men to kill than to die on behalf of what seems to them true and most excellent. Hence it is better to base public order on the diversity of opinions, than to seek to establish it on a universal consent to one and the same belief. A like unanimous consent could never be realised, and in seeking to obtain it, men would become stupid and maddened. For, indeed, the most patent truth is but a vain jangle of words to the men on whom it is attempted to impose it. You would compel me to believe a thing which you understand, but which passes my understanding. You would thus be forcing upon me not a thing that is intelligible, but one that is incomprehensible. And I am nearer you when holding a different belief, one which I understand. For, in that case, both of us are making use of our reason, and we both possess an intelligent comprehension of our own belief.” “Enough of all this,” remarked Lollius. “Educated men will never combine for the purpose of stifling all other doctrines to the advantage of a single one. As to the vulgar herd, who cares to teach it that Jupiter has six hundred names, or a single one?” Cassius, slow of utterance, and of a serious turn of mind, spoke next. “Beware, Gallio,” he said, “lest the existence of God, such as expounded by you, be not in contradiction with the beliefs of our forefathers. It matters little, after all, whether your arguments are better or worse than those of Apollodorus. What we have to consider is the fatherland. To its religion does Rome owe her virtues and her power. To destroy our gods is to compass our own destruction.” “You need not fear, my friend,” rejoined Gallio with some show of animation, “have no fear, I repeat, that I deny in an insolent spirit the heavenly protectors of the Empire. The only divinity which the philosophers acknowledge embodies within itself all the gods, just as humanity embraces all men. The gods whose worship was instituted by the wisdom of our forefathers, Jupiter, Juno, Mars, Minerva, Quirinus, and Hercules, constitute the most august parts of the universal providence, and no less than the whole do these parts exist. No, indeed, I am not an impious man, nor inimical to the laws. None respects the sacred things more than Gallio.” No one seemed disposed to dispute these ideas. Thereupon Lollius, bringing the conversation back to its starting-point, remarked: “We have been seeking to penetrate the veil of the future. What are man’s destinies, according to you, my friends, after his demise?” In reply to this question, Ann?us Mela promised immortality to heroes and wise men, while denying it to the common of mankind. “It passes belief,” he said, “that misers, gluttons, and mean-spirited men should possess an immortal soul. Could so singular a privilege be the portion of coarse and silly oafs? I cannot entertain such a thought. It would be an insult to the majority of the gods to believe that they have decreed the immortality of the boor who wots only of his goats and cheeses, or of the freedman, richer than Cr?sus, who had no other cares in the world than to check the accounts of his stewards. Why, good gods, should they be provided with a soul? What sort of a figure would they present among heroes and wise men in the Elysian fields? These wretches, like so many others here below, are incapable of realising humanity’s short-spanned life. How could they realise a life of longer duration? Vulgar souls are snuffed out at the hour of death, or they may for a while whirl about our globe, to vanish in the dense strata of the atmosphere. Virtue only, by making man the equal of the gods, makes them participate in their immortality. To quote the poet: “‘Illustrious virtue never descends into the Stygian shades. Lead a hero’s life, and the fates will not consign thee to the pitiless river of forgetfulness. When comes thy last day, glory will open to thee the path of heaven.’ “Let us realise our condition. We must all die, and all that we are must die. The man of shining virtue simply escapes the common destiny by becoming god, and by obtaining his admission into Olympus among the Heroes and the Gods.” “But he is not conscious of his own apotheosis,” said Marcus Lollius. “There does not exist upon earth a slave or a barbarian who is not aware that Augustus is a god. But Augustus knows it not. Hence it is that our C?sars journey reluctantly towards the constellations, and even now we see Claudius near with blanched face these shadowy honours.” Gallio shook his head, and remarked, “The poet Euripides has said: “‘We love the life which is revealed unto us upon earth, since we know of no other.’ “Everything that is related concerning the dead is open to doubt, and is bound up with fables and falsehoods. Nevertheless, I believe that virtuous men attain an immortality of which they are fully cognisant. Let it be clearly understood that they achieve it by their own efforts, and not as a recompense conferred by the gods. By what right should the immortal gods degrade a virtuous man to the extent of rewarding him? The leading of a blameless life is its own reward, and no prize is there worthy of virtue, which is its own reward. Let us leave to vulgar souls, that they may thereby sustain their wretched fortitude, the dread of punishment, and the hope of a reward. Let us love virtue for its own sake. Gallio, if what the poets tell of the infernal regions be true, if after your death you are arraigned before the tribunal of Minos, you may say to him: “Minos shall not judge me. By my actions have I been judged.”” “How,” inquired Apollodorus the philosopher, “can the gods give to men an immortality they themselves do not enjoy?” Apollodorus, indeed, did not believe in the immortality of the gods, or rather that their sway over the world should be exercised for all time. He proceeded to develop the reasons for his belief. “The reign of Jupiter,” he said, “began after the Golden Age. We know through the traditions preserved for us by the poets that the son of Saturn succeeded to his father in the governing of the world. Now, everything that had a beginning must have an end. It is foolish to suppose that anything finite in one part can be infinite in another. It would then become necessary to call it finite and infinite as a whole, which would be absurd. Anything possessed of an extreme point can be measured from that point itself, and could not in any way cease to be measured at any point of its extent, without changing its nature, and the proper of what is measurable is to be comprised between two extreme points. We may therefore make up our minds that the reign of Jupiter will end just as did that of Saturn. As ?schylus has said: “‘Jupiter is subordinate to Anankè. He cannot escape his fate.’” Gallio thought the same, for reasons derived from the observation of nature. “I consider with you, Apollodorus, that the reigns of the gods are not immortal, and the observation of the celestial phenomena inclines me to this belief. The heavens, as well as the earth, are subject to corruption, and the divine palaces, liable to ruin just as the dwellings of mankind, crumble under the weight of the centuries. I have seen stones fall from the aerial regions. They were blackened and corroded by fire, and bore testimony to a celestial conflagration. “The bodies of the gods, Apollodorus, are not any more exempt from injury than their dwellings. If it be true, as Homer teaches, that the gods, inhabitants of Olympus, impregnate the flanks of goddesses and mortal women, it is assuredly because they are not themselves immortal, in spite of their life’s span being greater than that of mankind, and hence it is patent that fate subjects them to the necessity of transmitting a life which they may not enjoy for ever. “In truth,” said Lollius, “it is hardly to be conceived that immortals should produce children in the same way as human beings and animals, or even that they should possess organs adapted to such a purpose. But perhaps the loves of the gods owe their origin to the mendacity of the poets.” Apollodorus persisted in his assertion that the reign of Jupiter would some day cease, supporting his opinion with subtile reasons. He prophesied that Prometheus would succeed the son of Saturn. “Prometheus,” replied Gallio, “was set free by Hercules with the consent of Jupiter, and he enjoys in Olympus the happiness he owes to his foresight and to his love of mankind. Nothing will ever happen to change his happy fate.” Apollodorus asked him: “Who then, according to you, Gallio, shall inherit the thunder which sets the world a-quaking?” “Although it may seem audacious to answer this question,” replied Gallio, “I think I am competent to do so, and to name Jove’s successor.” As he spoke, an officer of the basilica, whose duty it was to call cases, approached him, and informed him that some suitors were waiting for him in court. The proconsul asked if the matter was one of paramount importance. “It is a most petty case, Gallio,” replied the officer of the basilica. “A man from the harbour of Cenchre? has just dragged a stranger before your tribunal. They are both Jews and of humble condition. They are quarrelling over some barbarian custom or some gross superstition, as is the wont of Syrians. Here is the minute of their case. It is all Punic to the clerk who wrote it. “The plaintiff sets forth, Gallio, that he is the head of the assembly of the Jews or, as one says in Greek, of the synagogue, and he begs justice of you against a man from Tarsus, who, recently settled at Cenchre?, goes every Saturday to the synagogue, for the purpose of speaking against the Jewish law. ‘It is a scandal and an abomination, which thou shalt put an end to,’ says the plaintiff, and he clamours for the integrity of the privileges belonging to the children of Israel. The defendant claims for all those who believe his teachings adoption and incorporation into the family of a man named Abraham, and he threatens the plaintiff with the divine ire. You see, Gallio, that the case is a petty and ambiguous one. It rests with you to decide whether you will take the case yourself, or whether you will leave it to be judged by a lesser magistrate.” The proconsul’s friends begged him not to disturb himself for so miserable an affair. “I make it my duty,” he said in response to their prayers, “to follow in this respect the rules laid down by the divine Augustus. I must therefore try personally, not only important cases, but also smaller ones, when the jurisprudence concerning them has not been determined. Certain light cases recur daily and are of importance, if only for their frequency. It is meet that I should personally try one of each class. A judgment rendered by a proconsul serves as an example, and establishes a precedent in law.” “You deserve praise, Gallio,” said Lollius, “for the zeal you display in the fulfilment of your consular duties. But, acquainted as I am with your wisdom, I doubt whether it is agreeable for you to render justice. That which men honour with this title is really an administration of base prudence and of cruel revenge. Human laws are the daughters of fear and anger.” Gallio protested feebly against this definition. He did not admit that human laws bore the character of real justice, saying: “The punishment of crime consists in its commission. The penalty added thereto by the laws is superfluous, and does not fit the crime. However, since through the fault of mankind laws there are, we should apply them equitably.” Thereupon he told the officer of the court that he would proceed to the tribunal very shortly, and, turning towards his friends, he said: “To speak truly, I have a special reason for looking into this case with my own eyes. I must not neglect any opportunity of keeping an eye on these Jews of Cenchre?, a turbulent, rancorous race, which shows contempt for the laws, and which it is not easy to hold in check. If ever the peace of Corinth should be troubled, it will be by them. This port, where all the ships of the East come to anchor, conceals amid a congested mass of warehouses and taverns, a countless horde of thieves, eunuchs, soothsayers, sorcerers, lepers, desecraters of graves, and assassins. It is the haunt of every abomination and of every form of superstition. Isis, Eschmoun, the Ph?nician Venus, and the god of the Jews, are all worshipped there. I am alarmed at seeing those unclean Jews multiply, rather in the way of fishes than in that of mankind. They swarm about the miry streets of the harbour like crabs under the rocks.” “What is more dreadful is that they infest Rome to a like extent,” exclaimed Lucius Cassius. “To great Pompey’s own door must be laid the crime of introducing this plague of leprosy into the City. He it was who committed the wrong of not treating as did our ancestors the prisoners he brought from Jud?a for his triumphal entry into the City, and they have peopled the right bank of the Tiber with their base spawn. Dwelling about the base of the Janiculum, amid the tanneries, the gut-works, and the fermenting-troughs, in the suburbs whither flock all the abominations and horrors of the world, they earn their livelihood at the vilest of trades, unloading lighters, selling rags and refuse, and exchanging matches for broken glasses. Their women tell fortunes in the houses of the wealthy; their children beg from the frequenters of Egeria’s groves. As you rightly said, Gallio, hostile to the human race and to themselves, they are ever fomenting sedition. A few years back, the followers of a certain Chrestus or Cherestus raised bloody riots among the Jews. The Porta Portuensis was put to fire and sword, and C?sar was compelled to exercise severe repression, in spite of his forbearance. He expelled from Rome the leaders of the movement.” “Full well do I know it,” said Gallio. “Several of these exiles came to Cenchre?, among others a Jew and a Jewess from the Pontus, who still dwell there, following some humble trade. I believe that they weave the coarse stuffs of Cilicia. I have not learnt anything noteworthy in regard to the partisans of Chrestus. As to Chrestus himself, I am ignorant of what has become of him, and whether he is still of this world.” “I am as ignorant on this score as you are, Gallio,” resumed Lucius Cassius, “and no one will ever know it. These vile wretches do not so much as attain celebrity in the annals of crime. Moreover, there are so many slaves of the name of Chrestus that it would be no easy matter to distinguish a particular one amid the throng. “It is but a trifling matter that the Jews should cause tumult within the low purlieus where their number and their lowliness protect them from supervision. They swarm through the city, they ingratiate themselves into families, and are everywhere a source of trouble. They shout in the Forum on behalf of the agitators who pay them, and these despicable foreigners incite the citizens to a hatred of one another. Too long have we endured their presence in popular assemblages, and for a long time now have public speakers avoided running counter to the opinion of these wretches, for fear of their insults. Obstinate in the observance of their barbarian law, they wish to subject others to it, and they find adepts among the Asiatics, and even among the Greeks. And, what is hardly to be credited, they impose their customs on the Latins themselves. There are, in the City, whole quarters where all the shops are closed on their Sabbath day. Oh the shame of Rome! And, while corrupting the lowly folk among whom they dwell, their kings, admitted into C?sar’s palace, insolently practise their superstitions, and set to all citizens a detestable and noted example. Thus do the Jews inoculate Italy on all sides with an oriental venom.” Ann?us Mela, who had travelled over the whole of the Roman world, sought to make his friends realise the extent of the evil they deplored. “The Jews corrupt the whole world,” he said. “There is not a Greek city, there are hardly any barbarian towns where work does not cease on the seventh day, where lamps are not lit, where their keeping of fast-days is not followed, and where the abstaining from the flesh of certain animals is not observed in imitation of them. “I have met in Alexandria an aged Jew not lacking in intelligence, who was even versed in Greek literature. He rejoiced at the progress of his religion in the Empire. ‘In proportion to the knowledge foreigners acquire of our laws,’ he told me, ‘do they find them pleasant, and they conform readily to them, both Romans and Greeks, those who dwell on the mainland and the people of the isles, Eastern and Western nations, Europe and Asia.’ The ancient one spoke perhaps with some degree of exaggeration. Still one sees a number of Greeks yielding to the beliefs of the Jews.” Apollodorus sharply denied such to be the case. “The Greeks who judaise,” he said, “are not to be met with except amid the dregs of the populace, and among the barbarians wandering about Greece, as brigands and tramps. The followers of the Stammerer may, however, have persuaded some few ignorant Greeks, by inducing them to believe that the ideas of Plato are to be found in the Hebrew scriptures. Such is the lie which they strive to spread.” “It is a fact,” replied Gallio, “that the Jews recognise an only, invisible, almighty god, who has created the earth. But they are far from worshipping him with wisdom. They publicly proclaim that this god is the enemy of all that is not Jewish, and that he will not tolerate in his temple either the effigies of the other gods, or the statue of C?sar, or his own images. They regard as impious those who fashion out of perishable matter a god the image of man. Various reasons, some of them good and in harmony with the ideas which we conceive in regard to the divine providence, are adduced why this god should not be given expression to in marble or in bronze. But what can be thought, dear Apollodorus, of a god sufficiently inimical to the Republic that he will not admit in his sanctuary the statues of the Prince? How conceive a god who takes offence at the honours rendered to other gods? And what opinion can one have of a nation which credits its gods with like sentiments! The Jews look upon the gods of the Latins, Greeks and Barbarians as hostile gods, and they carry superstition to the point of believing that they possess a full and complete knowledge of God, one to which nothing can be added, and from which nothing can be subtracted. “As you are aware, my dear friends, it is not sufficient to tolerate every religion; we should honour them all, believe that all are sacred, that they are all coequal in the sincerity of those professing them, and that similar to arrows shot from various points towards the same goal, they all meet in the bosom of God. Alone the religion which only tolerates itself, cannot be endured. Were it to be permitted to spread, it would absorb all others. Nay, so unsociable a religion is not a religion, but rather an abligion, and no longer a bond that unites pious men, but one severing that sacred bond. It is the most impious of things. Can, indeed, a greater insult be offered to the deity than to worship it under a particular form, while at one and the same time dooming it to execration under all the other forms it assumes in the eyes of men? “What! Because I sacrifice to Jupiter crowned with a bushel, I am to forbid a foreigner from sacrificing to a Jupiter whose head of hair, similar to the flower of the hyacinth, drops uncrowned over his shoulders; and that, impious man that I should be, I should still consider myself a worshipper of Jupiter! No, by all means no! The religious man bound to the immortal gods is equally bound to all men by the religion which embraces both the earth and the heavens. Odious is the error of the Jews who believe they are pious in that they worship their god alone!” “They suffer themselves to be circumcised in his honour,” spoke Ann?us Mela. “In order that this mutilation should not be noticed, it is necessary, when frequenting the public baths, for them to conceal that which should neither be made a display of, nor covered as a thing of shame. For it is alike ridiculous for a man to pride himself on, or to be ashamed of, what he shares in common with all men. We have good cause to dread, my friends, the progress of Judaic customs in the Empire. There is, however, no cause to fear that Romans and Greeks will adopt circumcision. It passes belief that this custom is likely to make its way among the Barbarians who, however, would feel the disgrace of it to a lesser degree, since they are, for the greater part, absurd enough to reckon as disgraceful for a man to appear before his fellow men in a state of nudity.” “While I think of it!” exclaimed Lollius. “When our gentle Canidia, the flower of the matrons of the Esquiline, sends her beautiful slaves to the hot baths, she compels them to wear drawers, as she grudges everybody even a view of what is most dear to her about their bodies. By Pollux, she will be the cause of their being taken for Jews, an insulting supposition, even for a slave.” Lucius Cassius resumed, revealing the irritation which consumed him: “I cannot say whether the Jewish folly will overtake the whole world. But it is past endurance that this madness should spread among the ignorant, that it should be tolerated in the Empire, that this f?tid race, which has descended to every form of turpitude, absurd and sordid in its manners and customs, impious and villainous in its laws, and execrated by the immortal gods, should be suffered to exist. The obscene Syrian is corrupting the City of Rome. We have cast aside with contempt our ancient usages, and the salutary methods of discipline of our ancestors. We no longer serve these masters of the earth, who conquered it for us. Which of us still believes in the haruspices? Who is there with any respect for the augurs? Who shows reverence to Mars and the divine Twins? Oh the sad neglect of our religious duties! Italy has repudiated her indigenous gods, and her tutelary genii. She is henceforth on all sides at the mercy of foreign superstitions, and is handed over defenceless to the impure horde of oriental priests. Alas, did Rome conquer the world only to be conquered by the Jews? Warnings have assuredly not been lacking. The overflowing of the Tiber and the grain famine are certainly not doubtful manifestations of the divine ire. No day passes without its sinister presage. The earth quakes, the sun is veiled, while lightning flashes in a clear sky. Wonders follow upon wonders. Birds of ill omen have been seen to perch on the summit of the Capitol. An ox has been heard to speak on the Etruscan shore. Women have brought forth monsters; a wailing voice has sounded amid the recreations of the theatre. The statue of Victory has dropped the reins of her chariot.” “The hosts of the celestial palaces,” remarked Lollius, “have strange ways of making themselves heard. If they desire a little more incense, or sigh for a few more fat offerings, let them say so plainly, instead of expressing their wishes by means of thunder, clouds, crows, bronze statues, and two-headed children. Moreover, you must admit, Lucius, theirs is a far too one-sided part when they presage the evils threatening us, since, in the natural course of things, not a day goes by but what brings some individual or public misfortune.” Gallio exhibited distress at the sorrows of Cassius. “Claudius,” he remarked, “Claudius, although he is always dozing, has deeply felt this great peril. He has complained to the Senate of the contempt into which ancient usages have been suffered to fall. Alarmed at the progress of foreign superstitions, the Senate has, on his recommendation, re-established haruspices. But it is not sufficient that the observance of the ceremonial rites of worship should be restored; rather is it necessary once more to instil into men’s hearts their primitive purity. The souls of virtuous men constitute the proper shrine of the gods in this world. Give a home within your hearts to past virtues once more, simplicity, good faith, love of the public welfare, and the gods will immediately re-enter them. You shall then yourselves be temples and altars.” He spoke, and, taking leave of his friends, entered his litter, which, for some little time past, had been awaiting him near a clump of myrtle-bushes to convey him to the tribunal. His friends had risen from their seats, and leaving the grounds, followed leisurely behind him under a double portico, so disposed as to afford shadow at all hours of the day, and leading from the walls of the villa to the basilica where the proconsul dispensed justice. By the way, Lucius Cassius expressed to Mela his regret at the oblivion into which the ancient methods of discipline had fallen. Marcus Lollius, placing a hand on the shoulder of Apollodorus, said: “It seems to me that neither our gentle Gallio nor Mela, nor even Cassius, have stated their reasons for their deep hatred of the Jews. I think I know, and I am going to tell you, most dear Apollodorus. The Romans who offer up to the gods a white sow ornamented with white bands, execrate the Jews who refuse to partake of pork. It is not in vain that the fates sent to the pious ?neas a white female boar as a presage. Had the gods not studded with oaks the wild realms of Evander and Turnus, Rome would not be to-day the mistress of the world. The acorns of Latium fattened the swine whose flesh has alone appeased the insatiable hunger of the magnanimous descendants of Remus. Our Italians, whose bodies are built on boars and pigs, feel offended at the proud abstinence of the Jews, who persist in casting aside as unclean victuals the fat sounders, beloved of old Cato, which furnish food to the masters of the Universe.” Thus discoursing pleasantly, and enjoying the kindly shade, the four friends reached the furthermost end of the portico, when of a sudden the Forum appeared before them in a glitter of light. At that early hour, it was all astir with the coming and going of noisy crowds. In the centre of the square stood a bronze Minerva on a pedestal on which were sculptured the Muses, and to the right and to the left stood a Mercury and a bronze Apollo, the work of Hermogenes of Cythera. A Neptune with a green beard arose from the centre of a basin. At the feet of the god, a dolphin vomited forth water. The Forum was surrounded in all directions by monuments, the high columns and the arches of which revealed the Roman style of architecture. Facing the portico by way of which Mela and his friends had come, the Propyl?, surmounted by two gilded chariots, formed the boundary of the public square, and led, by way of marble steps, to the broad and straight road of the harbour of Lech?um. On either side of these heroic gates rose in kingly fashion the painted pediments of the sanctuaries, the Pantheon, and the temple of Artemis of Ephesus. The temple of Octavia, the sister of Augustus, dominated the Forum, and looked upon the sea. Between it and the basilica ran an insignificant little street. The building rose over two stories of arcades supported by pillars flanked with Doric half-columns forming a square. The Roman style, which stamped its character upon all the other buildings of the city, was patent. There remained of the pristine Corinth nothing but the calcined ruins of an old temple. The lower arcades of the basilica were open and served as shops to sellers of fruit, vegetables, oil, wine and fried foods, to bird-fanciers, jewellers, booksellers, and barbers. Money-changers sat at little tables laden with gold and silver coins. From the gloomy hollow of these stalls emerged shouts, laughter, hailings, the noise of disputes, and pungent odours. On the marble steps, wherever their slabs were tinted blue by the shade, loafers shook dice or tossed knuckle-bones, suitors paced to and fro with anxious mien, sailors gravely looked for the pleasures upon which they should squander their wages, while quidnuncs read news from Rome written for them by frivolous Greeks. Blended with this crowd of Corinthians and foreigners, numerous blind beggars persistently obtruded themselves, as well as callow and rouged youths, matchsellers and crippled sailors from whose necks depended a picture of the wreck of their ships. Doves flew in flocks from the roof of the basilica down to the large open spaces on which the sun shone, and picked up grain between the cracks of the heated flagstones. A girl of twelve, dark and velvety as a pansy of Xanthus, placed on the ground her little brother, as yet unable to walk, put beside him a chipped bowl filled with porridge and a wooden spoon, saying to him: “Eat, Comatas, eat and keep quiet, or that red horse will have you.” Then, holding an obolus in her hand, she ran towards the fish-dealer, whose wrinkled face and naked breast, the colour of saffron, appeared amid baskets lined with seaweed. While she was thus engaged, a dove hovering about the little Comatas got its talons entangled in the child’s locks. The boy began to cry, and to call his sister to his help, screaming in a voice choked with sobs: “Joessa! Joessa!” But Joessa heard him not. She was rummaging in the old man’s baskets, amid the fish and the shell-fish, for something that would improve the taste of her stale bread. Naturally she did not pick out a peacock-fish or a smaris, whose flesh is most delicate, but which cost money. She brought away in the hollow of her gown, which she had tucked up, three handfuls of sea-urchins and sticklebacks. Meanwhile little Comatas, his mouth wide open, and drinking his own tears, was still bawling: “Joessa! Joessa!” Unlike Jove’s eagle, the bird of Venus did not carry off little Comatas into the glorious skies. It left him on the earth, taking with it in its flight, between its pink talons, three golden hairs from his matted locks. The child, with cheeks glistening with tears and begrimed with dust, clenching his wooden spoon in his tiny fists, was sobbing beside his overturned bowl. Ann?us Mela, followed by his three friends, had reached the top of the basilica’s steps. Alike heedless of the noise and stir of the idle multitude, he was imparting information to Cassius in regard to the future renovation of the universe. “On a day determined by the gods,” he said, “the things existing to-day, whose order and disposition claim our attention, will be destroyed. Stars will clash with stars, all matters composing the earth, the air, and the waters will be consumed in one conflagration. Human souls, imperceptible débris amid the universal destruction, will be resolved anew into their primitive elements. An entirely new world....” As he uttered the words, Ann?us Mela stumbled against a sleeper stretched out in the shade. It was an old man who had artistically gathered about his dust-covered body the ragged remnants of his cloak. His wallet, his sandals, and his stick lay beside him. The proconsul’s brother, ever courteous and kindly, even to men of the lowliest class, was about to apologise, but the recumbent individual did not allow him time to do so. “Try and see where you put your feet, you brute,” he exclaimed, “and give alms to the philosopher Posocharis.” “I perceive a wallet and a stick,” smilingly replied the Roman, “but so far I do not see any philosopher.” Just as he was about to toss a piece of silver to Posocharis, Apollodorus stayed his hand, saying: “Do not give him anything, Ann?us. It is not a philosopher; nay, not even a man.” “But I am one,” replied Mela, “if I give him money, and he is a man if he takes this coin. For, alone among all animals, man does both these things. And can you not see that for the sake of a small coin I satisfy myself that I am a better man than he? Your master teaches that he who gives is better than he who receives.” Posocharis took the coin. Then he hurled coarse invectives at Ann?us Mela and his companions, stigmatising them as arrogant and as debauchees, and referring them to the jugglers and harlots who walked past them with undulating hips. Then, baring to the navel his hairy body, and drawing over his face his tattered cloak, he once more stretched himself out at full length on the pavement. “Would it not interest you,” asked Lollius of his companions, “to hear those Jews expound their dispute in the pr?torium?” They replied that they entertained no such curiosity, preferring to stroll under the portico, while waiting for the proconsul, who would doubtless not be long in coming out. “I am with you, my friends,” said Lollius. “We shall not miss anything very interesting.” “Moreover,” he went on to say, “the Jews who have come from Cenchre? to accompany the suitors are not all in the basilica. Here comes one who is recognisable by his beaked nose and his forked beard. He is in as fine a state of frenzy as Pythia herself.” Lollius was pointing with both look and finger at a lean stranger, poorly clad, who was vociferating under the portico, in the midst of a railing mob. “Men of Corinth, you place a vain trust in your wisdom, which is naught but madness. You follow blindly the precepts of your philosophers who teach you death, and not life. You do not observe the natural law, and in order to punish you, God has delivered you unto unnatural vices....” A sailor, who had just joined the group of spectators, recognised the man, for, with a shrug of the shoulders, he muttered: “Why, ’tis Stephanas, the Jew of Cenchre?, who brings once more some extraordinary piece of news from his trip to the skies, into which he ascended, if we are to credit him.” And Stephanas was teaching the people. “The Christian is not bound by law and concupiscence. He is exempt from damnation through the mercy of God, who sent his only son to assume a sinful body, in order to destroy sin. But ye shall only be delivered if, breaking with the flesh, you live according to the spirit. “The Jews observe the laws, and believe that they are saved by their works. But it is their faith which saves them, and not their works. Of what use is it to them to be circumcised in fact, if their heart is uncircumcised? “Men of Corinth, glory in the faith, and ye shall be incorporated into the family of Abraham.” The mob was beginning to laugh and jeer at these obscure utterances. Still the Jew continued prophesying in hollow tones. He was announcing a great manifestation of wrath and the all-destroying fire which was to consume the earth. “And these things shall come to pass in my lifetime,” he cried, “and I shall witness them with mine own eyes. The hour has come for us to awaken from our sleep. The night has passed, and the day is dawning. The Saints will rejoice in Heaven, and those who have not believed in Jesus crucified shall perish.” Then, promising the resurrection of the body, he invoked Anastasis, amid the jeers of the hilarious crowd. Just then, a leather-lunged man, Milo the baker, a member of the Corinthian Senate, who for some time past had been listening to the Jew with impatience, came up to him, took him by the arm, and shaking him roughly said: “Cease, you wretch, spouting idle words. All this is children’s fables and nonsense fit to capture a woman’s mind. How canst thou, on the strength of thy dreams, indulge in such foolery, casting aside all that is beautiful, and taking pleasure in what is evil only, without even deriving any advantage from thy hatred? Renounce your strange phantasies, your perverse designs, your gloomy forebodings, lest a god abandon you to the crows, to punish you for your imprecations against this city and the Empire.” The citizens applauded Milo’s speech. “He speaks truly,” they shouted. “Those Syrians have but one design: they seek to weaken our fatherland. They are the enemies of C?sar.” A number of them abstracted from the fruiterers’ stalls gourds and locust-beans, others picked up oyster-shells, and flung them at the apostle, who was still vaticinating. Thrown down the steps of the portico, he wended his way through the Forum, shouting, amid a storm of hooting, insults, and blows, pelted with dirt, bleeding, and half naked: “My Master has said it, we are the sweepings of the world.” And he exulted in his joy. The children pursued him on the Cenchre? road, yelling. “Anastasis! Anastasis!” Posocharis was not sleeping. Hardly had the friends of the proconsul gone away, when he raised himself upon his elbow. Seated on a step, a short distance from him, the swarthy Joessa was crunching between her teeth the shell of a sea-urchin. The cynic hailed her and showed her the glittering piece of silver he had just received. Then, having readjusted his rags and tatters, he rose, slipped his feet into his sandals, picked up his stick and wallet, and went down the steps. Joessa went up to him, relieved him of his wallet full of holes, which she gravely placed on her shoulder, as if to carry it as an offering to the august Cypris, and followed the old man. Apollodorus saw them taking the Cenchre? road with the object of reaching the cemetery of the slaves, and the place of execution conspicuous from afar by the swarms of crows which hovered over the crosses. The philosopher and the young girl knew there a clump of arbutus always deserted, and favourable to dalliance with Eros. At the sight of this, Apollodorus, pulling Mela by the flap of his toga, remarked: “Just look. No sooner has that cur received your alms than he decoys a child, in order to mate with her.” “Which goes to prove,” answered Mela, “that I gave money to the kind of man who knows full well what to do with it.” Meanwhile, the brat Comatas, squatting on the heated flagstone and sucking his thumbs, was laughing at the sight of a pebble glistening in the sun. “Besides,” resumed Mela, “you must admit, Apollodorus, that the way in which Posocharis makes love is not a bit philosophical. The dog is assuredly wiser than our young debauchees of the Palatine, who love amid perfumes, tears, and laughter, with languor or with passion...” As he spoke, a hoarse clamour arose in the pr?torium, deafening to the ears of the Greek and the three Romans. “By Pollux!” exclaimed Lollius, “the suitors whose case our friend Gallio is trying are shouting like dockers, and it seems to me that together with their growls a stench of sweat and onions reaches us.” “Nothing is more true,” quoth Apollodorus. “But, were Posocharis a philosopher instead of the dog he is, far from sacrificing to the Venus of the cross-roads, he would flee from the whole breed of women, and attach himself solely to some youth, whose eternal comeliness he would contemplate merely as the expression of an inner beauty more noble and more precious.” “Love,” resumed Mela, “is an abject passion. It disturbs the reason, destroys noble impulses, and diverts the most elevated ideas to the vilest cares. It has no place in a sensible mind. As the poet Euripides teaches us....” Mela did not finish his sentence. Preceded by lictors, who pushed the crowd aside, the proconsul came out of the basilica, and went up to his friends. “I have not been away from you long,” he said. “The case which I was summoned to try was as meagre as could be, and ridiculous in the extreme. On entering the pr?torium, I found it invaded by a motley crowd of the Jews who, in their sordid shops along the wharves of the harbour of Cenchre?, sell carpets, stuffs, and petty articles of silver and gold jewellery to the sailors. The atmosphere was filled with their shrill yelping, and with a pungent odour of goat. It was with difficulty that I could grasp the meaning of their words, and it cost me an effort to understand that one of those Jews, Sosthenes by name, who styled himself the chief of the synagogue, was charging with impiety another Jew, the latter, repulsively ugly, bandy-legged, and blear-eyed, and named Paul or Saul, a native of Tarsus, who has for some time past been exercising in Corinth his trade of weaver, and has gone into partnership with certain Jews expelled from Rome, for the weaving of tent-cloths and Cilician garments in goat-hair. They all spoke at once, and in very bad Greek. I made out, however, that this Sosthenes imputed as a crime to this Paul that he had entered the house wherein the Jews of Corinth are in the habit of meeting every Saturday, and had spoken with the object of seducing his co-religionists, and of persuading them to worship their god in a fashion contrary to their law. I had heard enough. So having, not without difficulty, silenced them, I informed them that had they come to me to complain of some matter of wrong or of some deed of violence wherefrom they might have suffered injury, I should have listened to them with patience, and with all the necessary attention; but, since their case turned simply upon a question of words, and a disagreement in regard to their law, it concerned me not, and that I could not be judge of such matters. I thereupon dismissed them with these words: ‘Settle your quarrels among yourselves, as best you see fit.’” “What did they say to that?” asked Cassius. “Did they submit with good grace to so wise a decision?” “It is not in the nature of brutes,” replied the proconsul, “to relish wisdom. Those fellows greeted my decision with harsh murmurings of which, as you may well imagine, I took no notice. I left them shouting and struggling at the foot of the tribunal. From what I could see, most of the blows fell to the plaintiff. He will be left for dead, if my lictors do not interfere. These Jews from the harbour are great ignoramuses, and like most ignorant people, not enjoying the faculty of supporting with arguments the truth of what they believe, they know no other argument than kicks and fisticuffs. “The friends of that little deformed and blear-eyed Jew named Paul seem to be particularly clever at that kind of controversy. Ye gods! How they got the better of the chief of the synagogue, raining blows on him, and trampling him under their feet! But I do not doubt that had the friends of Sosthenes been the stronger of the two parties, they would have treated Paul as the friends of Paul treated Sosthenes.” Mela congratulated the proconsul. “You were right, brother mine, in sending those wretched litigants about their business.” “Could I do otherwise?” replied Gallio. “How could I have decided between that Sosthenes and that Paul who are the one as stupid and as rabid as the other?... If I treat them with contempt, do not, my friends, think that is because they are poor and humble, because Sosthenes reeks of salted fish, or for the reason that Paul’s fingers have become worn in weaving carpets and tent-cloth. No, Philemon and Baucis were poor, yet worthy of the highest honours. The gods did not disdain being entertained at their frugal board. Wisdom raises a slave above his master. Nay, a virtuous slave is superior to the gods. If he is their equal in wisdom, he surpasses them in the beauty of the accomplishment. Those Jews are to be despised simply because they are boorish, and that no image of the divinity is reflected in them.” A smile overspread the countenance of Marcus Lollius at these word. “Truly, the gods,” he said, “would hardly frequent the Syrians who infest the harbours, amid the sellers of fruit and the strumpets.” “The Barbarians themselves,” resumed the proconsul, “possess some knowledge of the gods. Not to mention the Egyptians, who, in the olden days, were men filled with piety, there is not in wealthy Asia a nation which has not worshipped Diana, Vulcan, Juno, or the mother of the ?ne?des. They give these divinities strange names, confused forms, and sometimes offer up to them human sacrifices, but they recognise their power. Alone are the Jews ignorant of the providence of the gods. I know not whether that Paul, whom the Syrians also call Saul, is as superstitious as the others, and as obstinate in his errors. I know not what obscure idea he conceives of the immortal gods, and to tell the truth, I am not concerned to know it. What is there to be learned of those who know nothing! It amounts, to put it plainly, to educating oneself in ignorance. I gathered from some of his confused expressions in my presence and in reply to his accuser, that he joins issue with the priests of his nation, that he repudiates the religion of the Jews, and that he worships Orpheus under an assumed name which has escaped me. What makes me suppose this, is that he speaks with respect of a god, or rather of a hero, who is supposed to have descended into Hades, and to have reascended into the heavens, after having wandered among the pallid shades of the dead. He may perhaps have set himself to worship some subterranean Mercury. I should, however, feel more inclined to believe that he worships Adonis, for I think I heard him say that, following in the steps of the women of Byblos, he wept over the sufferings and the death of a god. “These youthful gods, who die and come to life again, abound on Asiatic soil. The Syrian courtesans have brought several of them to Rome, and these celestial youths please, more than is proper, our respectable women. Our matrons do not blush to celebrate their mysterious rites in private. My Julia, so prudent and so self-contained, has repeatedly asked me how much should be believed of them. ‘What kind of a god,’ have I answered her with indignation, ‘what can be the god who takes delight in the stealthy homage of a married dame? A woman should know no other friends than those of her husband. And do not the gods stand first in order among our friends?’” “Does not this man of Tarsus,” inquired the philosopher Apollodorus, “pay reverence rather to Typhon, whom the Egyptians call Sethon? It is said that a god with an ass’s head is shown honour by a certain Jewish sect. This god can be no other than Typhon, and I should not be surprised if the weavers of Cenchre? held a secret intercourse with the Immortal, who, according to our gentle Marcus, committed so disgusting an outrage on the old woman who sold cakes.” “I know not,” resumed Gallio. “They do indeed say that a number of Syrians meet to celebrate in secret the worship of a god with a donkey’s head. It may be that Paul is one of them. But what matters the Adonis, the Mercury, the Orpheus, or the Typhon of that Jew? He will never reign over any but the female fortune-tellers, the usurers, and the sordid traders who spoil the sailors in seaports. At the very utmost will he be able to win over, in the suburbs of the big cities, a few handfuls of slaves.” “Oho! Oho!” exclaimed Marcus Lollius in an outburst of laughter, “can you see that hideous Paul founding a religion of slaves? By Castor, it would indeed be a miraculous novelty! Should perchance the god of the slaves (may Jove avert the omen!) climb up into Olympus and expel therefrom the gods of the empire, what would he do in turn? In what way would he exercise his power over the astonished world? I should enjoy seeing him at work. He would no doubt keep up the Saturnalia during the entire course of the year. He would open to gladiators the road to the highest honours, establish the prostitutes of the Suburra in the temple of Vesta, and perhaps make of some wretched straggling village in Syria the capital of the world.” Lollius might have followed up his jest for some time had Gallio not interrupted him. “Marcus,” he said, “do not entertain the hope of witnessing these marvellous novelties. Although men are capable of stupendous acts of folly, it is not a little Jew weaver who could seduce them with his bad Greek and his tales about a Syrian Orpheus. The slaves’ god could but foment uprisings and servile wars, which would be promptly put down in blood, and he would soon perish himself, together with his worshippers, in an amphitheatre, under the teeth of wild beasts, to the plaudits of the Roman people. “Enough of Paul and Sosthenes. Their mind would not be of any help to us in the quest we were engaged upon ere they so untowardly interrupted us. We were seeking to know the future the gods have in store for us, not for you, dear friends, or for me in particular (for we are prepared to endure all that is to be), but for the fatherland and for the human race which we love and towards which we feel kindly. It is not that Jew weaver, with his inflamed eyelids, who could tell us, whatever Marcus may think, the name of the god who is to dethrone Jupiter.” Gallio broke off his speech to dismiss the lictors, who stood motionless in line before him, shouldering their fasces. “We require neither the rods nor the axes,” he remarked with a smile. “Speech is our only weapon. May the day come when the universe shall know no others. If you are not tired, my friends, let us walk towards the Pirene fountain. We shall find midway an old fig-tree under which, so it is related, the betrayed Medea meditated her cruel revenge. The Corinthians hold the tree in reverence, in memory of that jealous queen, and suspend votive tablets from its branches, for Medea never brought them but good. It has cleft the earth with its branches, which have thrown out roots, and it is still crowned with a luxuriant foliage. Seated in its shade, we can while away time with conversation till our bath-hour.” The children, weary of pursuing Stephanas, were playing at knuckle-bones by the roadside. The apostle was striding along rapidly, when he came across, near the place of execution, a band of Jews, who had come up from Cenchre? to ascertain the judgment rendered by the proconsul in regard to the synagogue. They were friends of Sosthenes, and were greatly irritated against the Jew of Tarsus and his adherents because they sought to change the law. Noticing the man, who was wiping with his sleeve his eyes blinded with blood, they thought they recognised him, and one of them, pulling him by the beard, asked him if he were not Stephanas, the companion of Paul. Proudly he answered: “Behold him!” He was quickly thrown to the ground, and trampled under foot. The Jews were picking up stones and shouting: “He is a blasphemer! Stone him!” A couple of the most zealous tore up the milestone sunk by the Romans, and were endeavouring to heave it at him. The stones fell with a dull thud on the skinny bones of the apostle, who yelled: “Oh the delight of these wounds! Oh the joy of these sufferings! Oh the refreshment of this torture! I behold Jesus.” A few steps farther off, under an arbutus, and to the murmurings of a spring, old Posocharis was pressing in his arms the smooth flanks of Joessa. Annoyed at the disturbance, he growled with a choking voice, with head buried in the hair of the young girl: “Begone, you low brutes, and do not trouble a philosopher’s pastime.” After a few minutes, a centurion who was passing along the now deserted road, raised Stephanas from the ground, made him swallow a mouthful of wine, and gave him linen wherewith to bandage his wounds. While this was going on, Gallio, sitting with his friends under Medea’s tree, was saying: “If you wish to know the successor of the master of gods and men, meditate the words of the poet: “‘Jove’s spouse shall bring forth a son more powerful than his father.’ “This line designates, not the august Juno, but the most illustrious among the noble women with whom consorted the Olympian who so often changed his form and his loves. It seems to me assured that the government of the universe is to fall to the lot of Hercules. This opinion has long since taken root in my mind, by reasons derived not only from the poets, but from philosophers and men of science. I have, so to speak, greeted by anticipation the accession of the son of Alcmene, in the climax of my tragedy of Hercules on ?ta, ending with the following words: “‘Hail, great conqueror of monsters, and pacifier of the world; be propitious unto us! Cast thy gaze upon the earth, and if some monster of a new kind strike terror into mankind, destroy it with a thunderbolt. Better than thy father wilt thou know how to hurl thunder.’ “I augur favourably of the coming reign of Hercules. During his life upon earth, he displayed a spirit patient and inclined to elevated thoughts. When the time comes for thunder to arm his hand, he will not suffer a new Caius to govern the Empire with impunity. Virtue, ancient simplicity, courage, innocence, and peace will reign with him. Thus do I prophesy.” And Gallio, having risen, took leave of his friends with these words: “Fare ye well, and love me.” \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3186/87210.html","bookId":848,"book":{"id":848,"title":"The White Stone","description":"简介： FEW Frenchmen, united in friendship, who were spending the spring in Rome, were wont to meet amid the ruins of the disinterred Forum. They were Josphin Leclerc, an Embassy Attach on leave; M. Goubin, licenci s lettres, an annotator; Nicole Langelier,...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3186","creation":"Aug 1, 2019 12:23:35 AM","modification":"Aug 1, 2019 12:23:35 AM"}}
