{"id":89751,"no":33,"title":"Page 33","content":"I woke up in the dark. Someone was carrying me. I knew who that someone was, even without the aching, burning agony of my back.\\n\\n I wanted to struggle, but I fought the urge. Better to let him think I was still out. Maybe I could surprise him and...\\n\\n I wasn\u0027t sure what.\\n\\n The air was cool on my face. We were inside, but not a building. I heard a shoe scrape dirt, then crunch something dry and old.\\n\\n Like a bone.\\n\\n Hell. The mine. I guess I was going to see what lay behind that pile of human bones.\\n\\n \"You can stop pretending. I know you\u0027re awake.\"\\n\\n His voice slid out of the night like a slowly slithering snake. I lifted my head, but I couldn\u0027t distinguish anything in a darkness so complete it pressed against my skin like velvet.\\n\\n His voice had always been seductive, soothing. Even now, when I knew the truth, that voice could still make me want to do things that were illegal in several southern states.\\n\\n I gave myself a mental slap. He had bartered the lives of everyone I\u0027d ever loved. He had sold his soul to the dark side.\\n\\n I wished I had a light saber and a good connection to the force.\\n\\n I\u0027d have to make do with my hands and my wits. I didn\u0027t think they were going to be enough.\\n\\n A light flickered up ahead. Dim, wavering, like a candle around a corner. I could see the low ceiling, the ancient wooden pillars, the dust, dirt, a few bones. If I wanted to, I could turn my head and see his face.\\n\\n I just didn\u0027t want to.\\n\\n \"Put me down,\" I ordered.\\n\\n He ignored me and kept walking toward the light, which grew bigger and brighter, illuminating an arched doorway. We went through and into a room with a bed, suitcase, table, and chairs.\\n\\n Someone had been living here. I knew who.\\n\\n I straggled and he laughed, then let me go. I tumbled onto the floor, gained my feet, and scrambled away.\\n\\n Hector Menendez appeared exactly the same as he had two years ago. Handsome, exotic, suave.\\n\\n Except now I recognized the beast hovering at the back of his eyes.\\n\\n \"You aren\u0027t going to get away from me this time, querida. It is your destiny to be my mate.\"\\n\\n \"I don\u0027t think so.\"\\n\\n He shrugged, unconcerned. \"It\u0027s still three nights until the full moon. Jessie will find me before then.\"\\n\\n His thin lips lifted. \"Jessie and her Indian lover will not return from their trip to see Cora Kopway.\"\\n\\n I blinked.\\n\\n \"The idiot I sent to kill them in the forest was no better than the one I sent to bite you. I thought if they were dead it would confuse everyone, give me more time to do what I had to. I should have ripped their throats out myself.\"\\n\\n I winced as memories threatened.\\n\\n \"You think I\u0027m a fool?\" he continued. \"I know everything you\u0027ve done. Everything.\"\\n\\n I certainly hoped not.\\n\\n \"A bartender, Leigh? An Irishman, no less. You insult me.\"\\n\\n \"He\u0027s one of you.\"\\n\\n \"He\u0027s a peon. A weakling. I\u0027m going to be a god.\"\\n\\n \"You wish.\"\\n\\n \"I don\u0027t have to wish. I am more than halfway there.\"\\n\\n I had to get out of here. Save Jessie. Save Will. Myself while I was at it. Sadly, Hector stood between me and the door. I had no weapon, and he was stronger than me, even without the super-duper shape-shifting shit.\\n\\n \"You think I don\u0027t know what Damien has been doing?\" he asked. \"He thinks he\u0027s thinning the pack, but he\u0027s only given me more power with every death. I\u0027ve been stalking him as he\u0027s been stalking the others, gaining the strength of those he kills under the moon.\"\\n\\n Well, that cleared a few things up.\\n\\n \"How did you discover the Legend of the Power Eater?\" I asked.\\n\\n I couldn\u0027t imagine Hector, who despite his own minority heritage had very little patience for any others\u0027, studying Ojibwe folklore.\\n\\n He sat on the bed. He was wearing something different than Cowboy had been. I recalled the boots splitting open as he changed. His clothes must have, too.\\n\\n We\u0027d been right about shifting between human forms.\\n\\n Gee, give us a cigar. I wondered what else he could do, then decided I really didn\u0027t want to know.\\n\\n \"Once upon a time, I was a lowly half-breed.\" At my confused frown, he shook his head. \"Half-Hispanic, half-white. I fit in nowhere. Not even my mother loved me enough to stay. I decided I wanted power. I wasn\u0027t going to get it through money or politics, but I could get it through death and destruction, which worked out well for me, because I liked it.\"\\n\\n While he spoke, my gaze darted around the room, searching for a way to escape. I didn\u0027t find one, so I needed to keep him talking.\\n\\n \"How did you learn of the legend?\" I repeated.\\n\\n \"I\u0027ve traveled most of my life. Seen many things. When people stumble on something they can\u0027t explain, their mind rationalizes. Mine did not. I looked for the truth. There\u0027s another world that exists after the moon rises. I wanted to be a part of it. I hired someone to find out the best way for me to do that.\"\\n\\n \"And then?\"\\n\\n \"I ate him.\"\\n\\n I gaped at his matter-of-fact tone. \"But he... I mean, uh - \"\\n\\n \"He wasn\u0027t an enemy?\" Hector shrugged. \"Consider him a freebie. Practice, if you will, for the main event.\"\\n\\n \"Which was?\"\\n\\n \"You know what I did, Leigh.\"\\n\\n \"Petite blond women, flesh of the enemy, sold your soul, sacrifice.\"\\n\\n \"Very good.\"\\n\\n \"One thing I don\u0027t understand. Why didn\u0027t you kill me?\"\\n\\n \"Querida, how could I kill the woman meant to be my mate?\"\\n\\n \"But - \" I pointed at my hair, or what was left of it.\\n\\n \"It is a shame you felt the need to disfigure yourself, but when you are Weendigo, like me, that will not matter.\"\\n\\n I tried again. \"If petite blond women were your enemy, then why not me?\"\\n\\n \"Because I knew from the moment you spoke to me that you were destined to be mine.\"\\n\\n \"Why?\"\\n\\n \"You came to me. No one else ever had.\"\\n\\n No one? I found that hard to believe. Hector was nuts, but he was handsome. Was I the only idiot who hadn\u0027t seen the rot beneath the flower?\\n\\n \"And because you came to me,\" he continued, \"I knew you saw past my heritage, my poverty and shame. I knew you loved me, even when you said you did not.\"\\n\\n \"You thought I wouldn\u0027t care that you were a serial killer, a cannibal, the murderer of my family?\"\\n\\n \"Those things were means to an end. So I could become Weendigo. So I could make us the alpha pair.\\n\\n We will live forever, querida. Together.\"\\n\\n Not.\\n\\n \"How did you find me?\"\\n\\n \"Were you hiding?\" He appeared amused.\\n\\n \" Jdger-Suchers are... I mean we - \"\\n\\n \"Are supposed to be a secret. True. To the general public. But the werewolves know you exist. Your friend Man-denauer is something of a legend, maybe a bogeyman. So are you, Leigh. When I make you one of us, werewolves all over the globe will cheer.\"\\n\\n \"I\u0027m so glad they\u0027ll approve,\" I muttered.\\n\\n \"Ever sarcastic. It\u0027s one of your charms.\"\\n\\n I chose to ignore that. If he found my sarcasm charming, I was in big trouble. Oh, wait. I was in big trouble.\\n\\n \"I still don\u0027t understand how we ended up in the same town. At this time of year.\"\\n\\n I needed to keep him talking until I figured out what to do or someone found me. Which could take quite a while.\\n\\n \"I brought you to Crow Valley.\" He tilted his head and the light caught his blue eyes. For an instant the irises appeared red, as if a camera flash had gone off or a demon waited inside. \"I thought you knew that.\"\\n\\n \"Brought me?\"\\n\\n \"It wasn\u0027t hard. I control this town. I am the alpha here already. I tell them who to kill. They bring the bones to this place.\"\\n\\n Ding, ding, ding. The light went on.\\n\\n \"No human remains, no FBI,\" I murmured.\\n\\n Hector just smiled.\\n\\n \"But dead wolves would bring the DNR at the least.\"\\n\\n \"Jager-Suchers eventually,\" he agreed.\\n\\n \"How did you know they\u0027d send me?\"\\n\\n \"You are the best, querida. Who else would they send?\"\\n\\n Gee, it paid to be at the top of my field.\\n\\n \"I don\u0027t understand why the other werewolves would follow you. You\u0027re murdering your own kind for power.\"\\n\\n \"Oh, they don\u0027t know it\u0027s me.\"\\n\\n \"What?\"\\n\\n \"Any wolf that\u0027s seen me kill one of them is dead.\"\\n\\n \"How are you going to explain becoming supreme fur boy?\"\\n\\n \"By the time they figure out what I\u0027m up to, I\u0027ll be unstoppable, and they\u0027ll be happy about it.\"\\n\\n \"You think?\"\\n\\n \"Of course.\" He winked. \"Because I\u0027ll be giving them you.\"\\n\\n \"Excuse me?\"\\n\\n \"The most successful werewolf-hunting Jdger-Sucher next to Edward Mandenauer will be the werewolf queen. You won\u0027t be killing them anymore. They\u0027ll lie down at my feet and roll over.\"\\n\\n \"And if someone figures this out before then?\"\\n\\n \"I\u0027ll just give them Fitzgerald. He\u0027s going to have to go anyway.\"\\n\\n My heart stuttered and seemed to stop. \"W-why?\"\\n\\n \"He touched you. He dies.\" Hector shrugged. \"I need a sacrifice for the night of the blood moon. Damien will do nicely.\"\\n\\n I\u0027d wondered how much I cared for Damien; now I knew. The thought of him dying practically paralyzed me.\\n\\n The entire time Hector and I had been talking I was desperately searching for, frantically trying to think of, a way out. My heart thundered and my hands shook. But at least I no longer felt like fainting.\\n\\n Until Hector got off the bed and came toward me. I did not want him touching me.\\n\\n \"Are you ready?\"\\n\\n \"F-for what?\"\\n\\n \"To become.\"\\n\\n My mouth fell open. I must have looked like a supreme idiot. \"But - but the ceremony takes place on the night of the hunter\u0027s moon.\"\\n\\n He strode closer. I took a step back. \"Of course it does.\"\\n\\n \"Then what - why?\"\\n\\n His slim manicured hand reached out and grabbed me so fast I didn\u0027t have time to run. As if I could. His breath brushed my face and I shuddered. The black lights flashed again. So much for not feeling faint.\\n\\n \"Come here.\"\\n\\n He drew me forward. I had enough sense left to hold back. Hector made an impatient sound. \"I must tie you up, querida.\"\\n\\n He tugged me to his bed and shoved me onto it. I struggled, but in minutes I was bound hand and foot.\\n\\n My judo expertise was worthless. Boy, did I miss my gun.\\n\\n Since the only weapon I had left was words, I used them. \"You have to tie me down to do me. Pretty pathetic, Hector.\"\\n\\n He merely smiled. I hated that smile.\\n\\n \"You are under the mistaken impression that I plan to do you tonight.\"\\n\\n I blinked.\\n\\n \"But as much as I might enjoy it, that would be wasteful. I will take you under the full moon, as every werewolf watches. But before that happens, we must address one minor point.\"\\n\\n \"What\u0027s that?\" I aimed for a strong, confident voice; what I got was near to a whimper.\\n\\n \"As kinky as it might be for you, there is no cross-species mating.\"\\n\\n Remembering my conversation with Damien, I started to get an idea of what Hector was after. I tugged at the ropes, but it didn\u0027t do me any good.\\n\\n \"For the ceremony to take place on the night of the blood moon, you must already be one of us.\"\\n\\n Oh, hell. I hadn\u0027t thought of that.\\n\\n Hector needed to bite me now.\\n\\n \\n\\n","sourceLink":"https://allnovel.net/night-creature-hunter-s-moon-nightcreature-2/page-33.html","bookId":2089,"book":{"id":2089,"title":"Night Creature: Hunter\u0027s Moon (Nightcreature #2)","description":"Storyline: Hunter\u0027s Moon(Night Creature series book 2) \\n eigh Tyler was once a kindergarten teacher with starry-eyed dreams-dreams that turned into nightmares when the biggest mistake she ever made came back to tear her world apart. Now, Leigh lives only for the hunt. Werewolves are her prey, and love is no longer an option. Leigh has been called to Wisconsin for something big. As long as it means killing fanged and furry demons, she\u0027s up for it. But the worst is yet to come, because something stronger and smarter than the average beast is on the prowl...and it\u0027s doing Leigh\u0027s work for her. Intoxicating and intriguing, Damien Fitzgerald is making Leigh question her vow never to let another man into her bed, or her heart. Every moment with him brings forth familiar-and dangerous-urges. Urges that may prove too strong to resist. Leigh\u0027s job is a dance with death, and she has no intention of letting Damian become involved and get hurt. Especially now that she knows her enemy is watching from the forest. Waiting for her first wrong step...\\n","cover":"https://allnovel.net/images/night-creature-hunter-s-moon-nightcreature-2.jpg","author":"Lori Handeland","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/night-creature-hunter-s-moon-nightcreature-2.html","creation":"Oct 5, 2019 8:58:19 AM","modification":"Oct 5, 2019 5:37:10 PM"}}
