{"id":89727,"no":9,"title":"Page 9","content":"\"What did you do?\" Jessie whispered. The clearing was awash with blood. There were body parts all over the place. The very air was still, not a twitter from the birds. I had a hard time tearing my eyes from the sight. It reminded me of home. I flinched and turned my back. No, not home. There the blood had shone crimson beneath electric lights. The bodies had been human. Here the blood had dried to brown beneath the morning sun. Nothing to be afraid of. No similarity at all. No reason to hyperventilate. \"Leigh?\" \"I shot them. That\u0027s all.\" \"Then what happened?\" I forced myself to look at the clearing again. The sight bothered me less and less. I could admire the pure fury and amazing strength it must have taken to do such a thing. I\u0027d often wished I could kill them more than once. Someone, or rather something, had. I inched closer. My foot squished in the blood-drenched grass. I grimaced. It was going to be a little hard to make a bonfire out of this mess, but I\u0027d manage. I continued around the circle, observing, cataloging, for all the good it did me. I knew there\u0027d been nine dead wolves. But now it didn\u0027t appear as if there was enough left to make one. \"What happened last night?\" Jessie continued to speak softly. I understood the need. The clearing was a haunted place. Something wasn\u0027t right. I could feel it, and she could, too. Quickly I told her about the hunt, leaving out the reason I\u0027d been driven to kill, leaving out my mocking shouts and kamikaze behavior. Some things were on a need-to-know basis, and she didn\u0027t need to know. However, when I got to the part about the brown wolf, she interrupted me. \"Are you sure he was a werewolf?\" \"Of course. Why?\" \"I just wondered how real wolves react to werewolves.\" \"They don\u0027t like them.\" \"Enough to do this?\" She jerked a thumb at the mess. I frowned. \"No. Real wolves usually turn tail and run. They sense werewolves aren\u0027t like them; they\u0027re other. Wolves are a lot of things, but dumb isn\u0027t one of them.\" \"Do you think the brown werewolf did this?\" I considered the idea. That the werewolf had killed another was strange enough. I found it hard to believe he would go berserk and eat nine of his own kind, but anything was possible. This was, after all, a werewolf. \"He could have.\" \"Why didn\u0027t you kill him?\" Jessie asked. I\u0027d been asking myself that since last night. I only had one excuse, and in the light of day, in the light of what we\u0027d found in the clearing, it didn\u0027t sound very convincing, but I told her anyway. \"Your boyfriend said maybe they want us to kill them.\" \"You couldn\u0027t remember that before you played out your Terminator fantasy?\" I shrugged. \"Oops.\" Jessie snorted. I think she was starting to like me. It took us the better part of the afternoon to erase the evidence of whatever had happened in the clearing. The J-S accelerant got the fire going despite the mushy nature of the ground. Jessie and I made sure no sparks ignited the surrounding dry grass or lush trees. As we waited for the last of the embers to die, Jessie spoke. \"He ate them.\" Since she was stating the obvious, I didn\u0027t bother to answer. \"This is too weird for me,\" she continued, \"and when werewolves start acting weird - \" \"Werewolves are weird by definition.\" \"True. But they have their behavior patterns, same as real wolves. They might be human on one side of the moon, but on the other they\u0027re animals, and animals that behave unpredictably mean trouble.\" She\u0027d get no argument from me. \"We need to talk to Will.\" \"Maybe you do, but I think I can manage a few more hours without him.\" \"Funnier and funnier,\" she muttered as she headed back toward the bar. There were already cars in the parking lot when we emerged from the forest. \"A regular gold mine,\" I observed. \"What\u0027s the attraction?\" \"Can\u0027t say.\" \"And you thought this would be a good place for me to stay why?\" Jessie shrugged. \"You hunt at night, so the noise won\u0027t bother you. It\u0027s quiet during the day, when you sleep, and so busy, no one\u0027s going to notice you coming and going. If they do, they\u0027ll be too drunk to care. Or at least drunk enough to easily convince they didn\u0027t see anything at all.\" Though I hated to admit it, she\u0027d chosen well. As we got in her car, Cowboy got out of his, a huge Cadillac that appeared too big for his body. But then what wouldn\u0027t? He limped toward the door. I hadn\u0027t noticed a limp last night. Maybe his boots were too tight. \"Who\u0027s that?\" Jessie asked. \"Cowboy.\" \"So that\u0027s Cowboy.\" She watched him until he disappeared inside. \"He\u0027s on my watch list.\" 1 blinked. \"Of werewolves?\" \"Troublemakers. I have to at least pretend to perform the job I was hired for.\" She started the car and performed a wide turn that brought us around the back of the tavern. My gaze was captured by Damien\u0027s cabin, then by a flicker of white in the trees behind it. He emerged from the forest, fully clothed for a change, and leaned against the corner of the building. Our eyes met. He lifted his hand. My chest tightened as my belly danced with an excitement I hadn\u0027t felt for far too many years. I was in big trouble if the mere sight of him got me all hot and bothered. I needed to be very, very careful about how I handled Damien Ftizgerald and my inexplicable lust for him. Jessie hit the gas and took off down Good Road at a steady clip. My teeth clicked together, narrowly missing my tongue as she flew over an incline. I forced my mind away from Damien, not an easy task, and back to our stalled conversation. \"What did Cowboy do that got him on the Crow Valley troublemakers list?\" \"He\u0027s a fighter. I\u0027d say classic Napoleon complex, but that would be too obvious. He likes to get drunk and kick ass, but he\u0027s not particular about whose ass he kicks - man, woman, child, dog, he\u0027s an equal opportunity Napoleon.\" Note to self: Stay away from Cowboy. We reached Main Street and Jessie headed toward her apartment. I\u0027d seen the town in the evening. I hadn\u0027t been impressed. By day, Crow Valley wasn\u0027t so bad. Clean, charming even, with necessary businesses and frivolous shops coexisting side by side. \"Coffee,\" I said in a desperate voice as we zoomed past the coffee shop. \"You don\u0027t want their coffee. Prissy latte crap at three bucks a pop?\" I turned my head and sighed as the coffee shop receded. \"Baby,\" she sneered. \"You haven\u0027t lived until you\u0027ve tried Cadotte\u0027s coffee. If you\u0027re nice, I\u0027ll have him make you some.\" \"An earring wearer and a coffee maker, be still my heart.\" Her eyes narrowed. \"I said be nice.\" \"I don\u0027t think I know how.\" \"Learn.\" She stopped the squad car in front of the police station. \"I just have to check in.\" \"Isn\u0027t that what this is for?\" I tapped the car radio. \"When it works.\" Now that she said that, I hadn\u0027t heard even a flicker of static from the radio during the entire drive, let alone any call for One Adam Twelve. She disappeared into the station. Curious, I followed, stopping so suddenly just inside that the door hit me in the ass. \"I\u0027ve stepped into The Andy Griffith Show,\" I blurted. The sheriff\u0027s office resembled the one in Mayberry. Desk, jail cell, telephone, filing cabinets. I half-expected Otis to be sleeping on the military-issue cot. Jessie looked up from her desk and scowled. \"Be thankful. Hardly anything ever happens here.\" \"Except the odd werewolf attack.\" \"There is that.\" \"And Cowboy\u0027s Napoleon complex.\" \"That, too.\" She pushed the button on her message machine. You have no new messages. \"See?\" she said. \"No dispatcher? No deputy?\" \"If anyone needs me, they call my cell phone or they leave a message. No need for a dispatcher.\" For some reason, that comment made her sad. \"And Barney Fife?\" I asked. \"Elwood Dahlrimmple.\" \"You\u0027re kidding.\" \"I wish.\" She rubbed her forehead. \"He\u0027s been here since... the stone age maybe. His hands shake more than a leaf in a windstorm.\" \"And you let him carry a gun?\" \"Not with any bullets in it.\" She was serious, and suddenly pretending to be with the Department of Natural Resources didn\u0027t sound so bad. \"Can\u0027t you fire him?\" I asked. \"I mean, you are the boss.\" \"Now why would I want to fire Elwood? Everyone knows him; they love him. They try not to cause problems while he\u0027s on duty.\" \"And he\u0027s too out of it to question what you\u0027re up to.\" \"Bingo. I don\u0027t need help being the sheriff of a town of four hundred.\" \"If they were just people.\" \"Now you\u0027re catching on.\" \"Which is where I come in.\" \"Never said you weren\u0027t smart.\" Actually, I thought she had, but I wasn\u0027t going to bring that up. \"Let\u0027s go to my place.\" Jessie was already at the door. \"How do you know Will\u0027s there?\" \"Where else would he be? He\u0027s got work to do.\" She turned out to be right. Will was home, sitting at the kitchen table, surrounded by papers and books. More were strewn across the floor. His computer was up and running, printing pages even as he muttered and pecked at the keys. His glasses were on top of his head; he squinted at the screen; a pencil rested behind each ear. What a geek. I glanced at Jessie just in time to catch the dopey look of love cross her face. I slammed the door. He jumped; she scowled. \"Honey, I\u0027m home!\" I called. Will smiled, stood, and came toward us with his hand outstretched. \"Leigh, nice to see you.\" I wished I could say the same. I stared at the long vicious scratch on his forearm, then lifted my gaze to the overly large bandage on his neck. My mind went back to last night - the werewolves battling, biting, bleeding. The next thing I knew, my gun was pointed at his chest.","sourceLink":"https://allnovel.net/night-creature-hunter-s-moon-nightcreature-2/page-9.html","bookId":2089,"book":{"id":2089,"title":"Night Creature: Hunter\u0027s Moon (Nightcreature #2)","description":"Storyline: Hunter\u0027s Moon(Night Creature series book 2) eigh Tyler was once a kindergarten teacher with starry-eyed dreams-dreams that turned into nightmares when the biggest mistake she ever made came back to tear her world apart. Now, Leigh lives only for the hunt. Werewolves are her prey, and love is no longer an option. Leigh has been called to Wisconsin for something big. As long as it means killing fanged and furry demons, she\u0027s up for it. But the worst is yet to come, because something stronger and smarter than the average beast is on the prowl...and it\u0027s doing Leigh\u0027s work for her. Intoxicating and intriguing, Damien Fitzgerald is making Leigh question her vow never to let another man into her bed, or her heart. Every moment with him brings forth familiar-and dangerous-urges. Urges that may prove too strong to resist. Leigh\u0027s job is a dance with death, and she has no intention of letting Damian become involved and get hurt. Especially now that she knows her enemy is watching from the forest. Waiting for her first wrong step...","cover":"https://allnovel.net/images/night-creature-hunter-s-moon-nightcreature-2.jpg","author":"Lori Handeland","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/night-creature-hunter-s-moon-nightcreature-2.html","creation":"Oct 5, 2019 8:58:19 AM","modification":"Oct 5, 2019 5:37:10 PM"}}
