{"id":2981,"no":6,"title":"Chapter 5 Country and Town","content":"The first nine years of my life, without a break, I spent in the country. During the next seven years I returned there every summer, sometimes also at Christmas and Easter. I was closely bound to Yanovka and all its environs until I was nearly eighteen. Throughout the early part of my childhood the influence of the country was paramount. In the next period, however, it had to defend itself against the influence of the town, and was forced to retreat all along the line. \n \n The country made me familiar with agriculture, the flour-mill, and the American sheafbinding machine. It brought me into close contact with peasants, the ones who lived near by and came to the flour-mill, and those far-away ones from the Ukrainian districts, who came with a scythe and a bag behind their backs. Much of my country life vanished from my memory or was shoved into the subconscious, but at every new turn some small part of it would emerge, often to help me greatly. The country brought me face to face with the various types of decadence in the gentry, and the types of capitalist aggrandizement. It revealed to me the natural coarseness of many aspects of human relationships, and intensified my feeling for that other urban type of culture, at once more advanced and more contradictory. \n \n It was on my very first vacation that the contrast between town and country impressed itself on my mind. On my journey home I was all impatience. My heart was beating with joy. I longed to see everything again, and to be seen. At Novy-Bug I was met by my father. I showed him my school report, proudly displaying my high marks, and explained that now I was in the first grade and therefore I had to have a full-dress uniform. We were driving by night, in a covered wagon, with a young mill assistant in the place of the coachman. On the steppe, particularly in the dells, one felt a slight draft of cold, misty air, which made my father wrap me in a huge Cossack cloak. I was intoxicated with the change of environment, with the drive, the recollections, the new impressions, and was very talkative, running on about the school, the public baths, my friend Kostya R., the theatre, and so on. I gave full descriptions first of the Nazar Stodolya, and then of The Tenant with a Trombone. My father, sometimes awake, sometimes asleep, listened to me, and laughed quite a bit. The young as sistant shook his head from time to time, and turning to my father said: “What a story!” \n \n Toward morning I fell asleep, and woke up at Yanovka. Our house looked terribly small to me now; the home-made wheat bread seemed gray, and the whole routine of country life seemed at once familiar and strange. I described the theatre to my mother and sisters, but not nearly so fervently as I had to my father. In the workshop I found Victor and David so changed I could scarcely recognize them they had grown bigger and stronger. But they thought me different, too. From the first they began to address me with the more respectful “vy” (you), at which I protested. “Well, what else can I call you?” retorted David. “You are now a learned man.” During my absence Ivan Vasilyevich had married. The servants’ kitchen had been rebuilt and served him as a house, while a new hut behind the machine-shop had been made over into a kitchen. \n \n These were not the most important things, however. Some thing new had grown up like a wall between myself and the things bound up with my childhood. Everything seemed the same and yet quite different. Objects and people looked like counterfeits of themselves. Of course, certain things had changed during the year. But others seemed changed largely because I saw them with different eyes. After my first return home, I began to grow away from my family. At first the breach revealed itself in trivialities, but as the years went on it became more and more serious and far-reaching. \n \n The conflicting influences of town and country colored the entire period of my school life. In the town my relations with other people were, I felt, more constant. With the exception of a few conflicts, however violent, such as those with the teachers of French and Russian, I got along peacefully under the school and family discipline. This should be attributed not only to the mode of life in the Schpentzer household, in which sensible strictness and comparatively high standards in personal relations were the rule, but also to the whole system of life in the city. To be sure, its contradictions were no less marked than those of country life in fact they were greater but in town they were more disguised, controlled, and regulated. People of different classes in town came into contact with one another only in their business relations; outside of these they did not exist for one another. In the country every body lived in open view of everybody else. The relationship between a master and a servant stood out there like a spring in an old couch. My own behavior in the country was more unbalanced and quarrelsome. There were several occasions when I quarrelled even with Fanny Solomonovna, who, on her visits to Yanovka, sometimes cautiously sided with my mother or sisters; and yet in town my relations with her were not only friendly but even affectionate. These clashes sometimes sprang up out of mere trifles. On other occasions, however, some thing much more important was at their source. \n \n In a freshly laundered duck suit, with a leather belt that had a brass buckle, and a white cap with a glittering yellow badge, I felt that I was simply magnificent. And I had to show everybody. Together with my father, I drove into the field on a day when the harvesting of winter wheat was at its peak. The head mower Arkhip, looking at once sullen and kindly, was leading the way over the hill, followed by eleven mowers and twelve women binders. Twelve scythes were cutting the wheat and the sultry air as well. Arkhip’s feet were wrapped in pieces of cloth tightened by a button. The women binders wore torn skirts, or simply shirts of unbleached cotton. From a distance the sound of the mowing-scythes was as if the hot air itself were ringing. \n \n “Well, well, let’s see what this winter wheat is like,” said Father, taking Arkhip’s scythe and stepping into his place. I watched him excitedly. Father made simple, homely movements, as if he were not actually working but only getting ready to begin, and his steps were light and tentative as if he were looking for a place to get a better swing. His scythe was also moving simply, without any swagger about it, and even or so it seemed not quite firmly. And yet it was cutting very low and very evenly, with each swift shave laying the ears in a straight belt running along on his left. Arkhip looked on with one eye, clearly approving Father’s skill. The attitude of the others varied. Some seemed to be sympathetic, as if they thought the old fellow were no mere novice, while others were indifferent, as if feeling that it was no great achievement to mow what was one’s own, and in order to show off, at that. Probably I did not translate their thoughts into exact words, but I had an intense realization of the complicated mechanics of their relations. \n \n After Father had left for another field, I also made an attempt to wield the scythe. “Strike the hay on your heel, boy, on your heel; keep your toes free, don’t press.” But in my excitement I couldn’t quite see where that heel of mine actually was, and on the third swing of the scythe my toes dug right into the earth. “That will soon finish the scythe, if you go on like this,” said Arkhip. “You’d better learn from your father.” A woman binder, dark-faced and covered with dust, gave me a sneering look. I stepped out of the ranks with decided haste, still in my badge-adorned cap, from under which sweat was coming down in streams. “Go and eat cakes with your mother,” came mockingly from behind. It was Mutuzka. I knew that mower, with a skin as dark as his boots. This was his third year at Yanovka. He lived in the village, had his wits about him, was sharp with his tongue, and on occasion in the preceding year, in my hearing and for my special benefit, had spoken nasty but very apt words about his masters. His smartness and daring appealed to my imagination, but his unbridled and shameless scoffing made me boil with impotent hatred. I should have liked to say something to him that would win him over to my side, or, on the contrary, to pull him up with a sharp word of command, but I did not know what to say. \n \n As I returned home from the field I saw a barefooted woman at our door-step. She was sitting on the ground, leaning against the wall, having apparently not courage enough to sit on the stone step. She was the mother of a half-witted shepherd boy, Ignatka, and she had walked seven versts to our house to get one rouble that was owed her. But there was no one in the house, and she could not get her rouble; so she had to wait until evening. It made my heart tighten to look at that figure the embodiment of poverty and submission. \n \n It was no better next year; in fact, it was worse. I was returning home after a game of croquet when I met my father in the courtyard. He had just arrived from the fields, all cov ered with dust, worn out and in a bad humor. A peasant, a piebald little man, was stumping behind him on bare, black-heeled feet. “For the Lord’s sake, please let me have my cow,” he kept saying, swearing that he would do everything to keep it away from the fields. Father answered: “Your cow may eat only ten kopecks’ worth of grain, but it will do ten roubles’ worth of damage.” The peasant kept on beseeching, and in his pleas one could feel his hatred. The scene stirred me to my very marrow. The genial mood I had carried away from the croquet court with its fringe of pear-trees, where I had routed my sisters with flying colors, instantly gave way to a feeling of intense despair. I slipped past my father into my bedroom, and falling flat on the bed, gave myself up to tears, despite my status of a boy of the second grade. Father walked through the hall into the dining-room, with the little peasant pattering behind him up to the door-step. I could hear their voices. Then the peasant left. Mother came from the mill I could recognize her voice at once; the sound of plates being prepared for dinner came through, and I heard Mother calling me. \n \n But I did not answer, and went on weeping. Tears were beginning to yield a sense of blissful pleasure. Then the door opened, and Mother bent over me. \n \n “What’s the matter, Lyovochka?” \n \n I made no answer. Mother and Father whispered something to one another. \n \n “Are you upset about that peasant? But we gave him back his cow, and we did not fine him.” \n \n “I am not upset about that at all,” I answered from under the pillow, painfully ashamed of the cause of my tears. \n \n “And we didn’t fine him,” Mother said again, with emphasis. \n \n It was Father who had guessed the cause of my sorrow and told Mother. Father noticed much in passing, with one quick glance. \n \n One day when Father was away, a police sergeant, a rude, greedy, and arrogant creature, came down and demanded the workers’ passports. He found two overdue. Immediately he called their owners from the field and declared them under arrest, for conveyance to their homes as prisoners. One of them was an old man whose brown neck was shrivelled into deep folds; the other was his young nephew. They dropped to their parched knees on the earthen floor of the hall, first the old man, then the younger one, and bowed their heads to the ground. They kept saying: “Do be merciful don’t ruin us, sir!” The fat and sweating sergeant played with his sword, drank cold milk that had been brought to him from the cellar, and answered: “I give mercy only on feast-days, and this is a week day.” I felt as if I were sitting on fire, and in a broken voice let fall some words of protest. “You’d better mind your own business, young man,” the sergeant remarked with stern deliberation, while my elder sister waved her finger at me warningly. The sergeant left with the two laborers. \n \n During my vacation I attended to the bookkeeping, that is, I took turn about with my elder brother and sister, entering in the books the names of laborers employed, the terms of employment, and payments made, whether in kind or in cash. I often assisted my father when wages were paid out, and on those occasions there were sudden, brief flashes of temper between us, which remained suppressed only because of the presence of the laborers. There was never any cheating in the making up of the accounts, but the terms of employment were always interpreted harshly. The laborers, particularly the older ones, sensed that the boy was on their side, and this annoyed Father. \n \n After our clashes, I would go out with a book and would stay away even through dinner. On one such occasion, I was caught in a storm in the fields. There was a continuous cracking of thunder, the steppe rain was gurgling in rivulets, and lightning kept flashing from all sides as if trying to get at me. I went on pacing up and down, all soaked through, in shoes that yelped like dogs, and in a cap that looked like a waterspout. When I returned home I was greeted with side long glances and silence. Sister gave me a change of dry clothes and something to eat. \n \n Returning to town after the vacations, I was usually accompanied by my father. As a rule we did not take a porter but carried our luggage ourselves. Father carried the heavier bags, and by his back and distended arms I could see that he was straining himself. I felt sorry for him and tried to carry as much as I could. But when we happened to have with us a heavy box full of gifts from home for the relatives in Odessa, we hired a porter. Father was stingy with his tips, the porter was dissatisfied, and shook his head angrily. I always felt very pained about this. When I travelled alone and had to resort to porters, I spent my pocket-money in no time, looking anxiously into the porter’s eyes, and always afraid to give too little. This was a reaction against the closeness at home, and it has persisted throughout my life. \n \n In the country as well as in the town, I lived in a petty-bourgeois environment where the principal effort was directed toward acquisition. In this respect, I cut myself off both from the country of my early childhood and from the town of my youth. The instinct of acquisition, the petty-bourgeois outlook and habits of life from these I sailed away with a mighty push, and I did so never to return. \n \n In the spheres of religion and nationality, there was no opposition between the country and the town; on the contrary, they complemented one another in various respects. In my father’s family there was no strict observance of religion. At first, appearances were kept up through sheer inertia: on holy days my parents journeyed to the synagogue in the colony; Mother abstained from sewing on Saturdays, at least within the sight of others. But all this ceremonial observance of religion lessened as years went on as the children grew up and the prosperity of the family increased. Father did not believe in God from his youth, and in later years spoke openly about it in front of Mother and the children. Mother preferred to avoid the subject, but when occasion required would raise her eyes in prayer. \n \n When I was about seven or eight years old, belief in God was still regarded in the family as something officially recognized. On one occasion a visiting guest before whom my parents, as was their wont, were boasting about their son, making me show my sketches and recite poetry, asked me the question: \n \n “What do you know of God?” \n \n “God is a sort of man,” I answered without hesitation. \n \n But the guest shook his head: “No, God is not a man.” \n \n “What is God?” I asked him in my turn, for besides man I knew only animals and plants. The guest, my father, and my mother exchanged glances with an embarrassed smile, as always happens among grown-ups when children begin to shake the most firmly established conventions. \n \n “God is spirit,” said the guest. Now it was I who looked with a smile of confusion at my seniors, trying to read in their faces whether they were serious or joking. But no, it was not a joke. I bowed my head before their knowledge. Soon I got used to the idea that God was spirit. As became a little savage, I connected God with my own “spirit,” calling it “soul,” and already knowing that “soul,” that is, “breath,” ends when death comes. 1 I did not yet know, however, that this doctrine bore the name of “animism.” \n \n On my first vacation at home, when I was getting ready to go to sleep on the sofa in the dining-room, I got into a discussion about God with the student Z., who was a visiting guest at Yanovka and slept on the divan. At that time I was not quite sure whether God did exist or not, and did not worry much about it, though I did not mind finding a definite answer. \n \n “Where does the soul go after death?” I asked Z., bending over the pillow. \n \n “Where does it go when a man is asleep?” came the answer. \n \n “Well, it is then still . . . ” I argued, trying to keep awake. \n \n “And where does the soul of the horse go when he drops dead?” Z. persisted in his attack. \n \n This answer satisfied me completely, and I fell into a contented sleep. \n \n In the Schpentzer family, religion was not observed at all, not counting the old aunt, who did not matter. My father, however, wanted me to know the Bible in the original, this being one of the marks of his parental vanity, and therefore I took private lessons in the Bible from a very learned old man in Odessa. My studies lasted only a few months and did little to confirm me in the ancestral faith. A suggestion of a double meaning in the words of my teacher, concerning some text in the Bible which we were studying, prompted me to ask a question which I worded very cautiously and diplomatically: “If we accept, as some do, that God does not exist, how did the world come to be?” \n \n “Hm,” muttered the teacher, “but you can turn this question against him as well.” In this ingenious way did the old man express himself. I realized that the instructor in religion did not believe in God, and this set my mind completely at rest. \n \n The racial and religious composition of my realschule was very heterogeneous. Religion was taught respectively by a Russian orthodox priest, a Protestant parson, a Catholic priest, and a Jewish instructor. The Russian priest, a nephew of the archbishop, with the reputation of being a favorite with ladies, was a young and strikingly good-looking man, resembling the portraits of Christ — only of the drawing-room type; he had gold spectacles and abundant golden hair, and was, in brief, impossibly handsome. Before the lesson in religion was to begin, boys of different persuasions would divide into separate groups, and those not of the orthodox Russian faith would leave the classroom, sometimes under the very nose of the Russian priest. On such occasions he put on a special expression, in which contempt was only slightly softened by true Christian forbearance, as he watched the boys walk out. \n \n “Where are you going?” he would ask some boy. \n \n “We are Catholics,” came the answer. \n \n “Oh, Catholics!” he repeated, nodding his head, “I see, I see . . . And you?” \n \n “We are Jews.” \n \n “Oh, Jews, I see, Jews! Just so, just so!” \n \n The Catholic priest came like a black shadow, always appearing right against the wall and disappearing so inconspicuously that throughout all my years there I could never get a look at his shaven face. A good-natured man by the name of Ziegelman instructed the Jewish boys in the Bible and the history of the Jewish people. These lessons, conducted in Russian, were never taken seriously by the boys. \n \n In my mental equipment, nationality never occupied an in dependent place, as it was felt but little in everyday life. It is true that after the laws of 1881, which restricted the rights of Jews in Russia, my father was unable to buy more land, as he was so anxious to do, but could only lease it under cover. This, however, scarcely affected my own position. As son of a prosperous landowner, I belonged to the privileged class rather than to the oppressed. The language in my family and household was Russian-Ukrainian. True enough, the number of Jewish boys allowed to join the schools was limited to a fixed percentage, on account of which I lost one year. But in the school I was always at the top of the grade and was not personally affected by the restrictions. \n \n In my school there was no open baiting of nationalities. To some extent the variety of national elements, not only among the boys but among the masters as well, acted as an important check on such policies. One could sense, however, the existence of a suppressed chauvinism which now and again broke through to the surface. The teacher of history, Lyubimov, showed marked partisanship when questioning a Polish boy about the Catholic persecution of orthodox Russians in White Russia and Lithuania. Mizkevic, a lanky, dark-skinned boy, turned green and stood with his teeth set, without uttering a word. “Well, why don’t you speak?” Lyubimov encouraged him, with an expression of sadistic pleasure. One of the boys burst out: “Mizkevic is a Pole and a Catholic.” Feigning surprise, Lyubimov drawled: “Is that so? We don’t differentiate between nationalities here.” \n \n It hurt me quite as much to see the concealed cad in Lyubimov’s attitude toward Poles, as to see the spiteful captiousness of Burnande with Germans, or the Russian priest’s nodding of his head at the sight of Jews. This national inequality probably was one of the underlying causes of my dissatisfaction with the existing order, but it was lost among all the other phases of social injustice. It never played a leading part not even a recognized one in the lists of my grievances. \n \n The feeling of the supremacy of general over particular, of law over fact, of theory over personal experience, took root in my mind at an early age and gained increasing strength as the years advanced. It was the town that played the major r?le in shaping this feeling, a feeling which later became the basis for a philosophic outlook on life. When I heard boys who were studying physics and natural history repeat the superstitious notions about “unlucky” Monday, or about meeting a priest crossing the road, I was utterly indignant. I felt that my intelligence had been insulted, and I was on the verge of doing any mad thing to make them abandon their shameless superstitions. \n \n While the Yanovka people were spending many weary hours trying to measure the area of a field which had the shape of a trapezoid, I would apply Euclid and get my answer in a couple of minutes. But my computation did not tally with the one obtained by “practical” methods, and they refused to believe it. I would bring out my geometry text-book and swear in the name of science; I would get all excited and use harsh words and all to no purpose. People refused to see the light of reason, and this drove me to despair. \n \n I engaged in a frantic argument with our village mechanic, Ivan Vasilyevich, who persisted in his belief that he could build a perpetual-motion machine. \n \n The law of the conservation of energy seemed to him merely a fanciful idea which had nothing to do with his problem. “That is all book, and this is practice,” he would say. My mind refused to understand or reconcile itself to the fact that men could reject incontrovertible truths in order to accept errors and absurd fancies. \n \n Later, the feeling of the supremacy of the general over the particular became an integral part of my literary and political work. The dull empiricism, the unashamed, cringing worship of the fact which is so often only imaginary, and falsely interpreted at that, were odious to me. Beyond the facts, I looked for laws. Naturally, this led me more than once into hasty and incorrect generalizations, especially in my younger years when my knowledge, book-acquired, and my experience in life were still inadequate. But in every sphere, barring none, I felt that I could move and act only when I held in my hand the thread of the general. The social-revolutionary radicalism which has become the permanent pivot for my whole inner life grew out of this intellectual enmity toward the striving for petty ends, toward out-and-out pragmatism, and toward all that is ideologically without form and theoretically ungeneralized. \n \n I will try to look back, in retrospect, at myself. The boy no doubt was ambitious, quick-tempered, and probably a hard person to get along with. I do not think that he had a feeling of superiority over his schoolmates when he entered the school. \n \n Of course in the country they showed him off proudly to the guests; but then there was no one else to compare him with, and the town boys who came to Yanovka always had the superior advantage of being “gymnasists”; they were older, as well, so that they could be seen only from below. The school, however, is a place where rivalry is bitter. From the moment that he found himself at the top of his grade, and quite a distance be yond the boy next behind him, the little visitor from Yanovka felt that he could do better than the others. The boys who became his friends acknowledged his leadership. This could not fail to have some effect on his character. The masters also approved of him, and some, like Krizhanovsky, even singled him out for special attention. On the whole, however, the masters treated him well but without any special interest. The boys were divided: there were good friends among them, there were also enemies. \n \n The boy was not lacking in self-criticism. In this he was inclined to be a little too captious. He was dissatisfied with his intellectual equipment and with some of his peculiarities of character. With time this became even more aggravated. Fiercely, he would catch himself in the act of telling a lie; or he would taunt himself because he had not read all the books that the others mentioned so casually. It is obvious that this was very close to vanity. The thought that he must become better and more intelligent than the rest and acquire a wide knowledge of books, weighed constantly on his mind. He thought about the purpose of Man, and of his own purpose. \n \n One evening, Moissey Filippovich, passing by, stopped and asked me, with feigned solemnity: “What do you think of life, old man?” He often resorted to this mock rhetorical manner that was both pompous and ironic. But this time, I felt as if I were touched to the quick. Yes, I was indeed thinking of life, only I did not know enough to apply this name to my boyish fears for the future. My mentor must have overheard my thoughts. “I seem to have touched the sore spot,” he said, changing his tone. Then he slapped me gently on the shoulder, and went to his room. \n \n Did the Schpentzer family have any political views? Those of Moissey Filippovich were moderately liberal, in a humanitarian way. They were lightly touched by vague socialist sympathies, tinged with Populist and Tolstoyan ideas. Political subjects were never openly discussed, especially in my presence; probably that was because they were afraid that I might say something censurable at school, and get myself in trouble. And when casual reference to what was going on or had taken place within the revolutionary movement was made in the grown-ups’ conversation, such as, for example, “This was in the year of the assassination of Czar Alexander II,” it had the ring of a past as far removed as if they had said, “This was in the year Columbus discovered America.” The people who surrounded me were outside of politics. \n \n During my school years I held no political views, nor for that matter had I any desire to acquire them. At the same time my subconscious strivings were tinged by a spirit of opposition. I had an intense hatred of the existing order, of injustice, of tyranny. Whence did it come? It came from the conditions existing during the reign of Alexander III; the high-handedness of the police; the exploitation practised by landlords; the grafting by officials; the nationalistic restrictions; the cases of injustice at school and in the street; the close contact with children, servants and laborers in the country; the conversations in the workshop; the humane spirit in the Schpentzer family; the reading of Nekrassov’s poems and of all kinds of other books, and, in general, the entire social atmosphere of the time. This oppositional mood was revealed to me cuttingly in my contact with two classmates, Rodzevich and Kologrivov. \n \n Vladimir Rodzevich was the son of a colonel, and was for a time the second highest in our grade. He persuaded his parents to allow him to invite me to their house on a Sunday. I was received with a certain dryness, but courteously. The colonel and his wife spoke to me very little and as if they were scrutinizing me. During the three or four hours which I spent with the family I stumbled several times upon something that was strange and disconcerting to me, and even inimical; it happened when the conversation casually touched on the subject of religion and the authorities. There was a tone of conservative piety about that house that I felt like a blow on the chest. Vladimir’s parents did not let him visit me in my home, and the link between us was broken. After the first revolution in Odessa, the name of Rodzevich, a member of the Black-Hundred, probably one of the members of this family, was fairly well known. \n \n The case of Kologrivov was even more poignant. He entered the school in the second grade, after Christmas, and was conspicuous among the boys as a tall and awkward stranger. He was gifted with incredible industry; he learned things by heart, anything and everything, whenever he could. By the end of the first month his mind was completely groggy from incessant memorizing. When he was called on by the geography teacher to recite the map lesson, without even waiting for the question he started right in: “Jesus Christ left his command to the world . . . ” It is necessary only to mention that the following hour was to be a lesson in religion. \n \n In conversation with this Kologrivov, who treated me, as the first in the grade, not without respect, I made some critical remarks about the principal and somebody else. “How can you speak of the principal in this way?” asked Kologrivov, sincerely indignant. “And why not?” I answered, with a surprise that was even more sincere. “But he is our chief. If the chief orders you to walk on your head, it is your duty to do as you are told, and not criticise him.” He said it in just that way. I was astonished by this expression of a formula. It did not occur to me then that the boy was obviously repeating what he must have heard in his feudal home. And although I had no views of my own, I felt that it would be as impossible for me to accept certain views as to eat wormy food. \n \n Along with the suppressed hostility to the political order in Russia, I began to create, in my imagination, an idealized picture of the foreign world — of Western Europe and America. From scattered remarks and descriptions, I began to visualize a culture which was high in itself and included everybody with out exception. Later this became part and parcel of my conception of ideal democracy. Rationalism implied that if any thing was accepted as theory, it was of course carried out in practice. For this reason it seemed incredible that people in Europe could have superstitions, that the church could exercise a great influence there, that in America the whites could persecute the negroes. This idealized picture of the Western world, imperceptibly absorbed from my environment of liberal smug citizenship, persisted later on when I was already formulating revolutionary views. I should probably have been greatly surprised in those years if I had heard if it had been possible to hear it that the German Republic which is crowned with a Social-Democratic government admits monarchists within its borders but refuses the right of asylum to revolutionaries. Fortunately, since that time many things have ceased to surprise me. Life has beaten rationalism out of me and has taught me the workings of dialectics. Even Hermann Müller can no longer surprise me. \n \n \n","sourceLink":"http://novel.tingroom.com/mingren/986/29739.html","bookId":117,"book":{"id":117,"title":"My Life","description":"简介： My Life was originally published in 1930 by Charles Schribners Sons, NY. Transcription and HTML markup for the Trotsky Internet Archive by David Walters in 1998.Readers should note that the translation uses a form of written English combining both th...","cover":"http://novel.tingroom.com/file/upload/201403/05/10-33-09-69-1.jpg","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/986","creation":"Aug 1, 2019 12:18:17 AM","modification":"Aug 1, 2019 12:18:17 AM"}}
