{"id":77384,"no":17,"title":"Page 17","content":"CHAPTER 17\\n\\n Bree\\n\\n I left the diner later that afternoon and noticed that it felt markedly cooler–still warm and mostly summer-like, even thought it was the beginning of September, but I thought the feel of fall was in the air. The leaves were just beginning to change color here and there and I saw jeans and sweaters in my near future. I paused at my car. Did that mean I was going to stay here? I\u0027d been in Pelion less than a month, but already I was starting to think of it as home. I\u0027d have to think about it all. For right now, I didn\u0027t feel any rush.\\n\\n I opened the door to my car and suddenly felt a light tap on my shoulder. I startled, inhaling a sharp breath and whirling around. A pair of golden brown eyes met me. For the briefest portion of a second, I was confused, as my eyes scanned the beautiful face under a head of short, dark, cropped hair. Archer. I breathed out, laughing and putting my hand to my chest.\\n\\n He smiled. Sorry.\\n\\n I laughed again. It\u0027s okay. I just didn\u0027t hear you approach. I furrowed my brow. What are you doing here?\\n\\n I\u0027m here for you, he said, stuffing his hands in his pockets and looking down at his shoes for a second before bringing his hands out of his pockets and back up. Is that okay? He kept his head bowed, but looked up at me, squinting slightly. My stomach flipped.\\n\\n Yeah, that\u0027s okay, I said, smiling at him. I got the bouquet you left for me. I loved it.\\n\\n He nodded, smiling a small smile, but then his face took on a worried expression. I\u0027m sorry about yesterday, he said, raking his hand through his short hair. I should explain, I–\\n\\n Archer, I said, grabbing his hand to stop him from speaking, how about that cooking lesson tonight and we can talk then? Would that be okay?\\n\\n He studied me for a second and then nodded, yes, sticking his hands back in his pockets and glancing around nervously.\\n\\n I smiled. Okay, great… good. I\u0027ll go home and get cleaned up and bike over.\\n\\n He nodded again, yes.\\n\\n Get in, I said, pointing to my car. I\u0027ll drive you home.\\n\\n He looked at my car like it was a flying saucer. No, I\u0027ll walk.\\n\\n I frowned at him. Archer, honestly. Why walk when I can drive you?\\n\\n He started to back away. I\u0027ll see you in a little while.\\n\\n I just looked at him until he turned and started walking away. Well, suit yourself then, I thought. It was then that I noticed all the people looking my way curiously, walking by slowly, not even trying to hide their nosiness. Geez, small towns could be seriously annoying. Was there any privacy here at all?\\n\\n I got in my car and drove home.\\n\\n Once I got to my cottage, I took a quick shower and pulled on my pale yellow linen shorts and my favorite, white tank top. I dried my hair partway and tied it back loosely, leaving a few strands out to frame my face. I took a few extra minutes in front of the mirror, wanting to look nice for Archer, and feeling excited flutters in my tummy at the thought of spending time with him.\\n\\n Twenty minutes later, Phoebe and I pulled up to Archer\u0027s open gate, wheeled inside, and I closed it behind us.\\n\\n As usual, Phoebe took off across the yard, in search of Kitty and the puppies that were now following after their mama as she went on covert missions all over the property. I smiled to myself. I think I would have liked to meet Uncle Nate.\\n\\n Archer came out of his house and smiled at me, and I grinned back, walking toward him. It was going to take me some time to get used to his new look. God, he was gorgeous. Granted, his clothes were still a little odd for a twenty-something guy who… wait, how old was Archer anyway?\\n\\n About twenty feet from him, I signed, How old are you?\\n\\n He looked confused for a second, and then looked off in the distance as if he was calculating and said, Twenty-three.\\n\\n I stopped, frowning. Why do you look confused?\\n\\n He shook his head slightly. Uncle Nate didn\u0027t exactly celebrate birthdays so I forget the year sometimes. My birthday is December second.\\n\\n I didn\u0027t know what to say to that. No one had celebrated his birthday? All these years? It seemed like a relatively simple thing and yet for some reason, it made my heart squeeze painfully.\\n\\n I\u0027m sorry, Archer, I said when I got right up to him.\\n\\n He shrugged as if it was neither here nor there. Come inside?\\n\\n I nodded.\\n\\n \"By the way,\" I said, following behind him into his house, \"you don\u0027t know anything about my loose front stair do you?\" I had noticed that it wasn\u0027t loose anymore when I had gotten home from work earlier. There was no way George Connick would know about that. I hadn\u0027t called him. The last person who\u0027d been up my stairs was Archer.\\n\\n He looked back at me and turned his body slightly. It was dangerous, he said. I went over and fixed it earlier today. It only took a few minutes.\\n\\n I breathed out. \"Thank you. That was really thoughtful.\" God, this man. He was going to kill me with sweetness overload.\\n\\n He simply nodded as if it had been nothing.\\n\\n When we got inside, he took my hand and led me to the couch and we both sat down. I looked at him expectantly. Looking at this big, beautiful man, with a body many men spent hours at the gym for, sitting in front of me looking so shy and uncertain, was something I could hardly wrap my mind around–and yet it made my heart pick up speed and warmth rush through my veins. He looked slightly uncomfortable, but he took a deep breath and signed, About yesterday… I–\\n\\n Archer, I interrupted, you don\u0027t have to explain. I think I understand–\\n\\n No, you don\u0027t, he interrupted back. He rubbed his hand over his new, short hair. Bree, I\u0027m not… he let out a sigh, clenching his jaw slightly. I\u0027m not experienced with… His eyes bored into mine, shining with intensity. I felt that intensity between my thighs. I couldn\u0027t help it, my body reacted to him whether I asked it to or not.\\n\\n Can I ask you a question? He said, those same red spots appearing high on his cheekbones. God, he was beautiful to me.\\n\\n Anything.\\n\\n Did you… want me to kiss you yesterday? Did you want me to touch you? His lips parted slightly, and he watched me for my answer like his life depended on it.\\n\\n Yes, I said without hesitation. I had played games with guys in the past. Games of flirtation and hard-to-get, but with Archer, I didn\u0027t give it a second thought. Complete honesty was the only thing I would give him. I would never purposefully hurt this beautiful, sensitive, wounded man more than he had already been hurt.\\n\\n He let out a breath on a loud whoosh. I wanted to kiss you, to touch you. I just didn\u0027t know… if you wanted that too–\\n\\n I smiled, looking up at him through my lashes. Archer, I said, taking his hand and bringing it to my heart, which was beating wildly in my chest. \"Do you feel that?\" I whispered, using my voice since my hands held his against me. \"This is how you affect me. My heart is pounding, because I want you to kiss me so badly that I can barely breathe.\"\\n\\n His eyes widened, his pupils dilated so large that his golden brown eyes looked dark brown. Something almost palpable passed between us. He looked from my eyes to my mouth and back to my eyes again. I didn\u0027t move, instinctively knowing that it meant something to him to take the lead here. I sat still, my eyes roaming to his mouth too. He licked his lips and that small movement sent a spark of electricity straight between my legs. I squeezed them together lightly, trying to relieve the ache that was building there.\\n\\n Kiss me, kiss me, I chanted in my mind, the tension building so much that when his head finally started slowly moving toward mine, I almost groaned in relief.\\n\\n He moved toward me, his lips parting slightly, the look on his face a mix between uncertainty and blatant lust. I\u0027d never forget that look–as long as I lived, I\u0027d never forget the sheer beauty of the expression on Archer\u0027s face. Next time it wouldn\u0027t be the same. Once he had kissed me, his first kiss, this I knew, it would never be the same again. I drank it in, memorized it, made it a part of me. And then his lips reached mine and I did groan, a breathless sound that came unbidden up my throat. His eyes opened and for a second he paused, his eyes growing even darker before he pressed his lips firmly against mine, closing his eyes once more. I closed mine too and soaked in the feel of his soft lips tasting mine, experimenting, brushing softly and then pressing again. After several seconds, he moved his body closer to mine and his tongue swept across the seam of my lips to which I immediately opened, inviting him in without reservation. His tongue entered my mouth tentatively and I used my own to tangle with his. He pressed his body even closer and a small exhale released from his mouth to mine, as if he was breathing life into me. And maybe he was. Maybe he had been all along.\\n\\n He laid me back gently on the couch, his mouth never disconnecting from mine and he leaned over me, tilting his head. The kiss went deeper as his tongue continued to sweep inside my mouth, mine meeting his in a slow, erotic dance.\\n\\n And nothing had ever felt more right.\\n\\n The delirious relief that bloomed in my heart at the feeling of how much I wanted this man above me, kissing me, almost made me want to weep with happiness.\\n\\n After several minutes, he pulled away, breathless, sucking in air and looking into my eyes. I stared back at him and smiled, but instead of smiling back, he pressed his lips back to mine and brought his hands up and raked his fingers through my hair, gripping gentle handfuls. It felt so good that I moaned again, pressing my hips upward into his hard body. I could feel his erection, hard and thick, and I wiggled until it was pressed right where I needed it, the heat of it radiating through the material of his jeans and the thin material of my linen shorts. He expelled another small puff of air into my mouth and I drank it down, knowing that it was a moan that didn\u0027t have sound.\\n\\n He pressed his erection down gently and broke his lips from mine to look down questioningly into my face, to see if I was okay with what he was doing. His gentleness and his concern with what I desired made my heart squeeze tightly, and I smiled a small smile. \"Yes,\" I breathed out. \"Yes.\"\\n\\n He resumed kissing me and now added the gentle rolling of his hips so that his erection moved over my * in delicious circles. I wondered if he knew that the movements that were bringing him pleasure were bringing me pleasure too. I made a point to express what I loved about what he was doing, by panting into his mouth and pressing my hips up into him. He adjusted his movements according to my reactions, and the fact that he was so in tune with my own pleasure, sent another bolt of arousal to my core, causing my * to tingle and swell, the blood pulsing furiously there. I thought dazedly how much of this dance between a man and a woman was pure instinct, pure unspoken communication.\\n\\n As he moved above me, my stiff nipples rubbed on his chest, causing more sparks to shoot downward.\\n\\n Another burst of air came out of his mouth and at the feel of it, my body tightened deliciously, and I shuddered in release, breaking free from his mouth and crying out, my chest arching back.\\n\\n I felt him shudder too and then go still above me, his breathing ragged. When I opened my eyes, he was staring at me, a look of pure, awestruck wonder. He sat up, still looking at me and signed, Was that supposed to happen? Just from kissing, I mean?\\n\\n I laughed and nodded, bringing my hands up. Yes, I said, I mean, yes, sometimes that happens.\\n\\n I leaned up and kissed him lightly on his mouth. When I leaned back, his face broke into a huge grin. Oh God, my heart. My heart couldn\u0027t take those grins. They were too much–too beautiful and too overwhelming.\\n\\n I laughed at the slightly smug look on his face. I wasn\u0027t going to tell him that coming in your pants wasn\u0027t exactly something to be smug about, because the truth of it was, I didn\u0027t think I\u0027d ever been half as turned on as I had been on this couch with him a few minutes before. So, he could be smug for now. I laughed again, with happiness and kissed him lightly again.\\n\\n I leaned back and said, I\u0027m not going to give you that cooking lesson right now. I\u0027m going to cook for you. I want to take care of you tonight. Is that okay?\\n\\n He studied me, something warm and gentle coming into his beautiful eyes and he nodded simply, yes.\\n\\n While Archer washed up, I made myself at home in his small kitchen and got to work preparing a meal for him. It was the first time I had cooked in almost a year, but I felt nothing except happy and satisfied as I chopped and mixed and prepared, humming as I worked. Archer came in and poured potato chips into a small bowl and took a container of onion dip out of his refrigerator and set it on the counter. Appetizer, he said, smiling.\\n\\n Fancy. I laughed, and then pushed a few chips aside to get to one that had folded over during the frying process. Those were my favorite. They were slightly crunchier and were perfect to use as a little scoop for the dip. I popped it into my mouth and grinned at him, getting back to work.\\n\\n We didn\u0027t talk much as I cooked, as my hands were busy, but Archer seemed content just to watch me, standing with one narrow hip propped against the counter. I glanced at him a couple times, standing there with his arms crossed on his chest and a small, happy smile on his face.\\n\\n Several times he pulled me to him and kissed me deeply, and looked awestruck again when I didn\u0027t stop him. Then I grinned and found another folded chip and popped it into my mouth.\\n\\n When dinner was done, I set his small table and we sat down, and I dished up the food. Archer grabbed my hand and said, Thank you for this, looking almost like a little boy who didn\u0027t quite know how to express what he truly meant. Thank you, he repeated. I understood what that simple thank you meant though. No one had taken care of him in a long time.\\n\\n He took a bite and sat back, and his face took on that same dreamy expression that had been on his face after our first kiss. I grinned. Good?\\n\\n He nodded his head, still chewing. You were right, you\u0027re a really good cook.\\n\\n I smiled. Thank you. I used to cook at our deli. My dad and I came up with all of the recipes. We used to cook and bake together.\\n\\n I stared off behind Archer picturing my dad flicking flour at my face and then pretending it was an accident. I smiled slightly–the memory bringing a warmth to my chest, not the tightness I had experienced over the last six months whenever my dad\u0027s memory came to mind.\\n\\n You okay? Archer asked, looking at me concerned. My lips curved into a wider smile, and I grabbed Archer\u0027s hand, squeezing it lightly.\\n\\n Yeah, I\u0027m good.\\n\\n Suddenly rain started falling gently outside the kitchen window and I looked over, furrowing my brow slightly. I looked back at Archer when I saw his hands moving in my peripheral vision.\\n\\n It\u0027s not supposed to storm tonight, he said, obviously reading my mind.\\n\\n I breathed out, and smiled, relaxing my shoulders.\\n\\n Archer studied me, grabbing my hand and squeezing it.\\n\\n I got up and went to his front door, calling to Phoebe, who was already on the porch. I brought her inside and she settled herself on the rug in the living room.\\n\\n I returned to the table and Archer and I got back to our food, neither one of us saying anything for a couple of minutes as we both continued eating.\\n\\n After we\u0027d eaten, Archer helped me clear the dishes and clean up the kitchen. As I dried a plate he had just washed, I said, \"Archer, something happened at the diner today that I wanted to ask you about.\"\\n\\n He looked over at me, his hands in the sudsy water and nodded.\\n\\n I set the dry plate in the cabinet and signed, A woman came into the diner today and… I paused, thinking about my wording. She didn\u0027t threaten me exactly–more like a warning, I guess. But she told me to stay away from you.\\n\\n Archer was staring intently at my hands, and his eyes darted to my face, his brows furrowing. He cocked his head to the right, but he looked wary almost as if he knew what I was about to say.\\n\\n Victoria Hale? I said and immediately, his jaw hardened and he turned his head, looking down into the sudsy water. He was still for several seconds before he brought the pan he had been scrubbing up out of the water and threw it into the other, empty side of the sink, causing a loud, sudden clattering sound and making me startle.\\n\\n He brought his wet hands back and raked them through his hair, then stood stock still, that same tick in his jaw clenching and relaxing again and again.\\n\\n I touched his arm gently, and he didn\u0027t look at me, although his body relaxed slightly.\\n\\n I drew my hand back and paused for a second, taking in his tense body and strained expression, thinking that I\u0027d never seen Archer Hale angry. I\u0027d seen him wary, and shy, and uncertain, but never angry. I wasn\u0027t sure what to do.\\n\\n He took a deep breath, but said nothing, looking over my shoulder, his mind suddenly somewhere far away.\\n\\n Will you tell me about her, Archer?\\n\\n His eyes darted back to me, clearing. He took another deep breath and nodded, yes.\\n\\n We dried our hands and left the last of the dishes in the sink, moving into the main room. I sat down next to him on the couch and waited for him to speak.\\n\\n After a second, he looked at me and said, When my uncle was dying, his head seemed to… clear a little sometimes.\\n\\n He drifted off again for a second, gazing over my shoulder momentarily and then snapping back to the present. His eyes found mine again.\\n\\n It was almost like that cancer ate up some of whatever it was that made him… different mentally. He had these moments of normalcy that I\u0027d never witnessed in him before, or at least not for extended periods of time.\\n\\n Sometimes during those times, he would confess things to me–about all kinds of stuff. Things that he had done in his life, how he had loved my mother… A brief flash of pain crossed his features before he went on.\\n\\n One day, I came into his room and found him crying, and he pulled me over to him and kept telling me how sorry he was. When I asked him why, he told me that when I was in the hospital right after I was shot, he brought one hand up to his scar unconsciously, rubbing it gently and then brought his hand back down, the doctors told him that my voice box could possibly be repaired, but that there was a limited time frame in which to do it. He paused again, his jaw clenching a few more times, bitterness filling his expression.\\n\\n But then he told me how he\u0027d told Victoria about the scheduled surgery, and she started planting it in his head that it would be better if I couldn\u0027t speak. If I couldn\u0027t speak, I couldn\u0027t be questioned. She exploited his paranoia so that he cancelled the surgery and missed the opportunity for me to ever talk again.\\n\\n I sucked in a breath, horrified. Why? I asked. Why would she do that? Why wouldn\u0027t she want you to speak?\\n\\n He shook his head, looking away for a second. Because I know things that she doesn\u0027t want shared. Or maybe she just hates me. Maybe both. I\u0027ve never really figured it out. He shook his head again. But it doesn\u0027t really matter.\\n\\n I furrowed my brow, confused. Archer, surely she knows that you can write–that you can communicate if you want to. What is it that she doesn\u0027t want shared?\\n\\n He took a deep breath. It doesn\u0027t matter, Bree. It\u0027s nothing I\u0027d ever talk about anyway. That\u0027s the worst part about it. She took my one opportunity to be normal, to be a real person, to live a life like other people do–and all for nothing. I would have never told her damn secret anyway.\\n\\n Archer, I grabbed his hands, bringing them to my heart as I had done earlier. You are a real person, you can live a life like other people do. Who told you you can\u0027t? It felt like my heart was cracking. This sweet, smart, gentle man thought so little of himself.\\n\\n He looked down, shaking his head, unable to respond to me, because I held his hands against my chest.\\n\\n I didn\u0027t ask him more about the secret he held against Victoria. I knew that Archer would confide in me as he felt comfortable. He had lived his life alone and isolated, with no one to talk to for so long. Just like me with the cooking and the intimacy… baby steps. In our own ways, we were both learning to trust.\\n\\n I did have one final question though. I let go of his hands and signed, Why would she tell me you\u0027re violent? It was almost ludicrous. Archer was the gentlest man I had ever met.\\n\\n She came out here after my uncle died, after she\u0027d seen me in town a couple times. I have no idea why, and I don\u0027t care. I was angry, and hurting. I pushed her out my gate. She fell on her ass. He looked ashamed, although he had no need to, at least not in my book.\\n\\n I pursed my lips. I understand, Archer. She deserved it and much more, too. I\u0027m sorry.\\n\\n He looked over at me, studying my face. He tilted his head, something seeming to come into focus in his eyes. You didn\u0027t pay her any attention. You asked me about her after we… kissed.\\n\\n I nodded my head. I know you, I said simply.\\n\\n He looked like he was working out a puzzle. You believed me over her immediately?\\n\\n Yes, I said. Absolutely.\\n\\n We stared at each other for a couple beats and then his face broke into one of those heart-stopping grins. I almost groaned, heat racing through my veins. That smile was mine–I was going to wager that no one had made Archer Hale smile like that in a long, long time. I felt greedy and possessive of that beautiful smile. I grinned back.\\n\\n Can we kiss some more? he asked, his eyes shining with desire.\\n\\n I laughed.\\n\\n What? he said.\\n\\n Nothing, I answered. Nothing at all. Come here.\\n\\n We made out on Archer\u0027s couch for a long time. But it was sweet and gentler this time, our intense need from earlier quenched for the time being. We learned each other\u0027s mouths, memorized each other\u0027s taste, and just enjoyed the intimacy of kissing, lips to lips, breath to breath.\\n\\n When we opened our eyes and he stared down at me, smoothing my hair back and tucking a piece behind my ear, his eyes told me everything that his voice couldn\u0027t. We communicated a thousand words, without a single one being spoken.\\n\\n Later, after the gentle rain shower had dwindled to nothing, Archer walked me home, wheeling my bike next to him, Phoebe sitting quietly in the basket.\\n\\n He grabbed my hand, looking at my shyly and smiling as I smiled back, feeling my heart swell in my chest.\\n\\n Then he kissed me on my front steps, a kiss so sweet and gentle that my heart ached and I could feel his soft lips on my own long after he had walked away and turned the corner out of sight. \\n\\n","sourceLink":"https://allnovel.net/archer-s-voice/page-17.html","bookId":1846,"book":{"id":1846,"title":"Archer\u0027s Voice","description":"Storyline: A New York Times, USA Today, and Wall Street Journal bestselling book. Archer\u0027s Voice is a full-length, standalone romance. \\n When Bree Prescott arrives in the sleepy, lakeside town of Pelion, Maine, she hopes against hope that this is the place where she will finally find the peace she so desperately seeks. On her first day there, her life collides with Archer Hale, an isolated man who holds a secret agony of his own. A man no one else sees. \\n Archer\u0027s Voice is the story of a woman chained to the memory of one horrifying night and the man whose love is the key to her freedom. It is the story of a silent man who lives with an excruciating wound and the woman who helps him find his voice. It is the story of suffering, fate, and the transformative power of love.\\n","cover":"https://allnovel.net/images/archer-s-voice.jpg","author":"Mia Sheridan","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/archer-s-voice.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 3:36:48 PM"}}
