{"id":11744,"no":10,"title":"CHAPTER IX","content":"Honolulu—King Lunalilo—Chinese Leprosy—Kooma’s Reminiscences of Father Damien—Molokai—The Leper-Hunters—Father Damien at Molokai—Robert Stevenson’s Open Letter to Dr C. M. Hyde AFTER Samoa I think the Sandwich Isles are the most attractive islands in the Pacific. They are mountainous and the summits of Hawaii—pronounced Ha-wy-ee—rise to fourteen or fifteen thousand feet. All the islands of the group are volcanic, and rich both in live and extinct craters. I should not be surprised if some day the bowels of the Sandwich Group suddenly exploded and blew the isles to smithereens! When, from the sea, you sight the coast, its promontories covered with coco-palms and gorgeous tropical trees, waving over slopes that lead down to lazy, shore-curling waves, you think of the Biblical Garden of Paradise. Native hut homes, conical-shaped, with tiny verandahs, peep out of the bamboo and clumps of bananas beneath mighty bread-fruit trees. I stayed several weeks in the Sandwich Group. The natives are mirthful and well dressed, far in advance of the Marquesan and Solomon islanders. They are all Christians, but decidedly immoral according to European codes. Honolulu is a well-shaded city, with the spires of advanced civilisation rising. Missionaries are there in plenty, and possibly they feel thankful that barbarian ideas of virtue have given them a profession on islands of tropical beauty, whereon they can live in extreme comfort while they work among, and are kind to, the natives. While there I saw the palace of the Hawaiian queen, who I think was the widow of King Kale-Conalain. She was as polished as a Parisian prima donna. I also saw the new king, Lunalilo, a fine-looking Hawaiian, six feet high, full-lipped and very majestic-looking. He was dressed in a frock-coat and fashionable felt hat. As he appeared before the people and stood on the palace steps, the crowds waved and cheered as the British do to their King and Queen. The Hawaiian climate is healthy; but Chinese leprosy attacks the natives and the white population, which consists of French, English, Kanakas negroes, Chinamen and ex-convicts. Swarms of mosquitoes find the Sandwich Isles a happy hunting ground for their race, and are one of its drawbacks. I toured on the island steamer Kilanea to all the various isles, and then stopped near Honolulu with Kooma, who was a Hawaiian. He was an old man, yet straight figured, well tattooed and with intelligent eyes. His high brow denoted intellectual qualities which were usually conspicuous through their absence from the heads of his race. Hawaiians are like all the South Sea Islanders, and have a deeply rooted hatred for work. As they have embraced Christianity, heathen songs have ceased, and now, like caged birds on the polished perches of civilisation, they sit and quote, parrot-like, all that the missionaries teach them. Kooma at that time had no calling. He was aged, and had reared up a large family, and his athletic sons, who worked on shipping wharves at Honolulu, repaid Kooma for his past kindness. He had several married daughters also. I was not very well off at the time and gladly accepted the old Hawaiian’s offer to let me occupy rooms in his home at a charge that nicely suited the state of my exchequer. Kooma had known Father Damien[4] intimately, that heroic leper priest who had devoted his life to combating heathenism and nursing the lepers on the Isle of Molokai, and had, a year or so before, died of the dreaded disease. So I was fortunately able to hear, directly from him, details of deep interest to me concerning the life and character of the celebrated priest, who had emigrated from Louvain as a missionary to Honolulu, and after a strenuous life of self-sacrifice lay in his grave near his stricken children on the lonely lazaretto isle, Molokai. 4. Joseph Damien de Veuster was born at Tremeloo, a small peasant village near Louvain, in 1840; and in peaceful scenes that are now ravaged by the relentless tramp of materialistic battalions he, as a boy, dreamed and fed his imagination and intense genius for helping humanity. He died on 15th April 1889. It appeared that my friend had known Damien many years before he went to Molokai; had officiated as his servant, and helped the missionary build some of the extemporised churches and homes at Kohala and elsewhere. Sitting by his side, by the window of his humble homestead, while native children romped under the palms out in the hot sunlight, I talked to Kooma of many things, and hearing that he had known Father Damien I at once plied him with questions. “Was Damien a kind and good man, Kooma?” I asked, and then, with much pride that he was able to give me information concerning such a popular white man, he blew whiffs of tobacco through his thin, wrinkled lips and answered: “I have cut wood and dug hundreds of post-holes for the great white priest, and he no pay me.” “Did not pay you?” I said, astonished. “No,” he answered. “I knew that he was poor and had no money, and so I work for no wages.” After many questions and replies which dealt chiefly with the Hawaiian’s own character and importance, I gathered that Kooma had collected firewood for the lonely priest, and had done many services for him, both as a friend and a servant, out of a good heart, for it appeared that Damien was not by any means an austere man or master, but one who worked with those around him in a spirit of good comradeship. If anyone imposed upon the natives and Damien heard of it, he would hotly resent the imposition, and with flashing eyes shout and fight for their rights as though they were his own children. Years before Damien went to Molokai a handsome Hawaiian girl, who lived at Kahalo, loved a Society Island youth who had, with his parents, emigrated to the Sandwich Islands. The father of the maid disliked the youth, who was an idle, good-for-nothing fellow, and so would not encourage the lad’s attentions to his daughter. For some time the lovers met in secret, for love laughs at locksmiths in Hawaii as well as elsewhere. One night, as Damien sat by his fireside in his lonely hut having his humble meal, the love-sick maid appeared at his door. Crossing her hands on her breast, she bowed, half frightened, and after much hesitation pleaded to the Catholic Father on the youth’s behalf, begging him to help her, for she was in great distress; and knowing that Damien was a great missionary and priest of the white God, she suddenly fell on her knees and confessed all. She was in trouble through the lad, and, telling Damien this, she laid her head on his knee and cried bitterly; for the kindness of his eyes soothed her and made her feel like a little child. Gently bidding her to rise, the Father told her to cease from troubling, and said: “Go, my child, home; tell thy father all; also that thou hast told this thing to me, and I will come and see him.” The priest did all that he promised; and the next evening the sinful youth who had brought sorrow to Ramao, for that was her name, appeared before the hut door wherein lived Father Damien and, shamefaced, hung his head for a long while. Kooma, who sat telling me all this, added: “And the great white Father put the spirit of Christ in Juno’s (the lad’s) heart; for he became good, and worked hard, and was forgiven for that which he did, and they were happy and had many children; and I learnt to love Juno in his manhood, for he was a good father and kind to the maid who was my daughter!” And, saying all this, he pushed the window higher up and pointed to a tall maid who, in her ridi robe, came singing down the track by the jungle ferns. On her bare shoulders she humped baskets of live fish which had been just caught below in the sea. “She,” Kooma said, “is my granddaughter, and was the unborn child of the fallen maid whom Father Damien was kind to”; and there she stood in the doorway and gazed on us both with laughing, sparkling eyes, bare from the waist upwards, excepting for a thread of beads hanging at her breast and a Catholic cross, with a tiny figure of the Virgin Mary, swinging below. I looked at her with deep interest, and thought of the kindness of the missionary priest, dead in his grave at Molokai. Kooma showed me a Bible which had been given him by Father Damien. It was well thumb-marked, torn, and pencilled by the priest at those pages where he had made my friend memorise different passages. On the front leaf was Damien’s signature. On my handing the sacred gift back to the Hawaiian he carefully placed it at the bottom of his chest; and I knew that it would be no use my attempting to get it from him, however much I might want the book. Many interesting things did I learn from my stay at this native’s house, for night after night I would get him in a reminiscent mood. It appeared that as time wore on the young priest, who was a handsome, healthy-looking man, became somewhat subdued and saddened, and aged considerably in the space of three or four years. At times he was morose and unapproachable, though afterwards he would gaze with kindly eyes on those whom he might have spoken to in anger. “Did he ever go away?” I asked Kooma, and he answered: “Sometimes he would go for one or two days, and often at night-time go off wandering alone in the forestlands about his house; and night after night at sunset he would sit with his chin on his hands and gaze toward the seaward sunset, with eyes that saw far away.” And then Kooma added: “And I would say, ‘Master, shall I get thee more firewood?’ and he would not answer, but would steadily gaze on, and I could see the tears in his eyes, and I knew that he sorrowed over that which I knew not of.” So earnest was Kooma’s manner that, as he told me these things, I saw the past, the lonely hut home and the exiled priest gazing into the sunset, sick at heart as he dreamed of his childhood’s home across the world. I wondered somewhat, and thought over the stories Raeltoa of Samoa had told me, which I have written about in my earlier book of reminiscences. For Raeltoa the Samoan had also known Father Damien, as, of course, hundreds of natives did, and had told me, unasked, of his kindness and heart-felt sorrow for those who hid from the leper captors as they searched for the stricken people. For leprosy had wiped out thousands of the natives of the Sandwich Islands and elsewhere. When once the victims revealed the purplish-yellow patch on their bodies they were doomed, for no cure was, or is, known for the scourge of leprosy. In Kooma’s house dwelt a chief who lived in Oahu. He had elephantiasis, which had swelled his legs to three times their normal size. He used to sit under the pandanus-trees reading his Bible as I talked with Kooma, and I was extremely pleased to hear, on inquiring, that his complaint was not contagious; for when he squatted with his knees up in front of him, so swollen were his limbs that his body and head were hidden from view. But to go back to Kooma’s reminiscences. “What happened before Father Damien went away to the Leper Isle of Molokai?” I asked, and Kooma answered: “He became most sad, and then wished many of my people who had the leper patch good-bye, and promised to go one day and see them, and made them happier with smiles and promises; and often he would go a long way off to comfort those whose relatives had been taken to the dreaded lazaretto.” “Did you see Father Damien after he had gone to the lazaretto?” I asked. “Yes,” he replied; “and he looked most sad and very, very much older: and I asked him of my sister, whom he had seen at Molokai, for she was stricken with the plague, and he said, ‘Kooma, your sister is happy; the spirit is well, though the flesh, which is nothing, is ill.’” Then Kooma told me much of the doings of the Flemish priest: how he had toiled incessantly for the welfare of his native children, ministering to their souls; and how his influence had soothed their hearts, hearts that still half nursed the old traditions; for the Hawaiians were originally a wild race, and still their songs told of heathen mythology, of mighty warriors, of love and ravishment, and of cannibalistic times, so Damien’s task of reforming them was no easy one. For many years the dreadful scourge had crept, with its fatal grip, over the whole of the Sandwich Group, and as time went on it became so prevalent that the Hawaiian Government decided that the best step to take to stay the horror of fetid rot which was annihilating the race was to isolate all those afflicted with the disease and send them to Molokai. Molokai was a lonely, half-barren isle surrounded by rough, beaten shores of crag and fortress reef that for ever withstood the charges of the seas as eternally they clashed, broke and moaned through the caves of the death-stricken isle, echoing and mingling with the moan of memories and deathly cries that faded on the dying lips of the plague-stricken men, women and children who rotted till they became lipless skeletons, still alive in their tomb—the grey, gloomy lazaretto of the Leper Isle. Terrible was the grief of the natives as those employed to separate the lepers sought out all those who were spotted with the livid leper patch. Father Damien’s heart was sick within him as he heard the lamentations of forced farewells, as, standing by their captors, helpless men and women, gazing over their shoulders, looked into the eyes of those they loved and went away for ever! Father Damien, who had devotedly administered comfort to the stricken ones who were scattered over the isle, saw and felt deeply the grief of those around him; but he was powerless to help the unhappy people; he knew the enforced separation was decreed by the authorities, and was for the best. It was well known that many of the unfortunate victims were hidden away in the forest-lands, or in caves by the shores: maidens secreting their lovers, and lovers hiding the pleading maids, husbands their wives, and wives their children. Often in the night, as the dread inquisition discovered some trembling, hidden victim, a scream would break the silence of the jungle as the victim was muffled, gagged and taken away; for the leper-hunters were not the tenderest and most poetical of men. Money was their reward for all the lepers they captured, and the men hired for the job were chosen for their evil reputations and the expression of brutality on their dark faces. Father Damien’s heart was indeed wretched over the fate of his children. As Kooma the Hawaiian sat telling me all this, and the shadows fell and the island nightingale sang up in the pandanus-trees, I watched his earnest face and listened attentively, for I knew that I was hearing the truth of much that was hidden from the world. I learnt that the sad priest would sit at night for hours under the coco-palms, deep in thought, and have no sleep, so troubled was he over the fate of the flock that he loved; and many times did he help the afflicted ones, and long and deeply did he hesitate ere he told the authorities that which he had to tell, and which his tender heart stayed him from telling. As Kooma told me this I saw that his memories of the priest were sincere and loving enough. Then he called out “Pooline! Pooline!” and a native girl came and poked her head in at the doorway; it was his granddaughter, whom Father Damien had christened. They had called her after Damien’s sister Pauline (which they pronounced Pooline); for the priest often spoke of his sister in Flanders, and told Kooma that some day she would come out to him to share his work and help him in it, and several times he wrote home and asked her to think the matter over. Few were surprised when at length Father Damien volunteered to go to Molokai and administer faith and comfort to his lost children in exile. He taught them to be patient as he walked amongst them and crept by the lazaretto huts of death, knitting their shrouds and gazing with kind eyes on their faces till they ceased to see and feel, and he buried them. Lonely indeed those nights must have been as, alone with grief and silence, his bent form hammered and hammered, beating out the muffled notes that drove in coffin nails: for he made the last beds of his dead children, digging their graves and burying with his own hands many scores of the stricken dead, until he at last succumbed to the scourge himself. He lies buried with those he died for, and has, let us hope, found a reward for his self-sacrifice in heaven. From Kooma I heard much of Damien’s true character, his love of justice and his impulsiveness in hastening to help the weak, regardless of all consequences. Once, while Father Damien was eating his supper, a Hawaiian appeared at the door and said, “Master, trouble has befallen me and my home”; and then told the priest of a tragedy that had occurred. A native girl through jealousy had stabbed another who had sought her lover, and was either hiding in the forest or shore caves or had killed herself. All night the native and Father Damien searched, and at length the girl was found almost lifeless, covered in blood, on the shore reefs seaward from Kilanea, her body lying half on the sands and half in the waves. She had slashed herself and had nearly bled to death. Damien carried the girl for miles in his arms, bandaged her and saved her life; also the life of the girl she had stabbed so viciously in her jealousy. When they were both well again he brought them together, made them embrace each other and swear to forget all, with the result that they became greater friends through being erstwhile enemies. Each secured a lover to her liking, and ever blessed the great Father who had befriended them instead of handing them over to the authorities at Honolulu—authorities whom Damien hated, for they moved on material lines and looked upon cruel force as the best means of discouraging crime, and on kindness as insanity more dangerous than the crime it forgave. In a corner of Father Damien’s lonely little homestead he kept the cherished letters that arrived from his homeland across the sea. Night after night he would take those letters out and read them through again, and then tenderly place them in a small pot and hide them beneath his trestle bed. They were letters from his sister Pauline and other relatives in Flanders. One night he sought them and they were missing. Great was Father Damien’s grief, and even rage flushed his face as he demanded of Kooma if he knew of their whereabouts. For hours he searched, “and never was the Master in so great a temper; he look much fierce and his eyes fire and then cry,” said Kooma, as I listened. “What did he do then?” I asked. “Did he find the letters?” “Yes,” said Kooma, “he did find letters: a dog that Father Damien had been kind to had smelt and pawed them up and run off with the pot, which we found in the scrub. The great Father was then good to us and did ask me to forgive him for that which he said; which I did do; and the dog too he forgave; and Father Damien once more smiled, stroked the shaggy thief, and it sat up, looked at the Father’s eyes, wagged its tail and was happy.” I often heard a lot of discussion about Father Damien’s life and work, sometimes between rough island traders, and sometimes between men of the conventional middle class. A few of the former had met Father Damien, or knew those who were acquainted with him, but most of them expressed opinions from hearsay and the low or high order of their own instincts. Robert Louis Stevenson’s celebrated open letter to Dr Hyde had much to do with the popular nature of the controversy and the growing enthusiasm for the self-sacrifice of the dead priest. For those who may not know the exact facts I relate them here. After Father Damien’s death Robert Louis Stevenson, whilst cruising in the South Seas, happened to read a paper that contained a letter written by Dr Hyde, of Honolulu, to the Rev. Mr Gage, of Sydney, who in turn sent it to The Sydney Presbyterian for publication. Here is the letter: To The Rev. H. B. Gage. Honolulu, 2nd August 1889. Dear Brother,—In answer to your inquiries about Father Damien, I can only reply that we who knew the man are surprised at the extravagant newspaper laudations, as if he was a most saintly philanthropist. The simple truth is, he was a coarse, dirty man, headstrong and bigoted. He was not sent to Molokai, but went there without orders; did not stay at the leper settlement before he became one himself, but circulated freely over the whole island (less than half the island is devoted to lepers), and he came often to Honolulu. He had no hand in the reforms and improvements inaugurated, which were the work of our Board of Health, as occasion required and means were provided. The leprosy of which he died should be attributed to his vices and carelessness. Others having done much for the lepers, our own ministers, the Government physicians and so forth, but never with the Catholic idea of meriting eternal life. Yours, etc., C. M. Hyde. (Published in The Sydney Presbyterian, 26th October 1889.) When Robert Louis Stevenson read the above letter, and the comments upon it, he was deeply incensed, and wrote a defence of the priest about which the world knows. Mr Melville, whom I met at Apia, told me an interesting story about Robert Louis Stevenson and his championship of Father Damien. While Mr Melville was a passenger on a ship, the Lubeck, I think, he sat near Stevenson, who was dining in the saloon. The conversation touched on Father Damien and Dr Hyde’s letter, and when a passenger revealed by his remarks that he was half willing to believe Hyde, Stevenson almost shouted and insulted him. The passenger, irritated, persevered with his opinions and said something further, whereupon Stevenson said: “Some of you men still make one think of the danger of Christ’s mission and His risks on earth,” or something to that effect. On this the passenger answered: “Mr Stevenson, you forget yourself,” and Stevenson immediately replied: “I would to God that some of you fellows would forget yourselves and remember the virtues of others.” When Mr Melville told me this I smiled, for from my own personal recollections of Robert Louis Stevenson I knew that he did not need a battalion of supporters to help him maintain his own opinion when he felt that he upheld a noble purpose: for Stevenson was a fearless, though gentle soul, even apart from his literary life and work. Indeed Damien found in him a kindred and worthy champion. Not always are men able so well to express outwardly that which they beautifully write and feel. As I have said, much rumour and discussion followed both Dr Hyde’s letter and Stevenson’s powerful retaliation, and it was not uncommon for Catholic and Protestant divines engaged in arguments on the matter to come even to blows. Now all men admit that Dr Hyde’s letter of denunciation was indirectly one incentive that drew the attention and praise of the world at large to the heroism of the martyr priest, and was responsible for Robert Louis Stevenson’s reply and vindication of him. Personally I do not think Dr Hyde was as deliberately hypocritical as Rumour has painted him. Of course this does not imply that Robert Louis Stevenson’s counter-denunciation of Hyde’s epistle was unjust or too fierce; he wrote as the first champion voice, and wrote from the white-hot intensity of indignation over what he felt was a deadly wrong done to the memory of a great man. This can, too, in the consciousness of man’s fallibility, be applied to motive on the other side, for Dr Hyde, of Honolulu, also wrote to his friend, the Rev. Mr Gage, from a firm belief in his heart that rumour was truth and Father Damien’s memory was not deserving of “extravagant laudation.” Many others of his own denomination had devoted their lives to the lepers, both on the islands and at the lazaretto at Molokai, and so Dr Hyde’s great sin was in believing that which he was told and remembering the self-sacrifice of his own brethren who had also toiled on behalf of the lepers. The voice of Rumour has many forked tongues of envy and the carelessness of thoughtless scandal. Our religion is founded on the sorrow and disastrous result of its tongue, for did not Christ suffer crucifixion through this weakness in mankind? Through doubt and envy to this day some nations believe one side, and others the other; and are there not millions now who do not believe in that which our religion is founded on? Was Dr Hyde so wicked? I for one do not think so. Do we know what he thought after he had written that mighty atom of a letter? What were his reflections, misgivings and regrets over his first belief and hasty conclusions, and over that celebrated blazing challenge of Stevenson’s to the world, revealing in words of fire the complete vindication of Damien’s life, work and Christ-like heroic virtue? We can imagine what he felt like, for we all make mistakes, but not with such drastic results. The stern note of intense application to a set purpose reveals in Stevenson’s letter the fact that he felt that Damien needed an immediate champion. Stevenson was at heart a Christian man, in the full, true sense of the word, and I have not the slightest doubt that after his open letter had fulfilled the purpose which he intended it to fulfil, and the first heat of his just indignation had cooled down, he himself would have withdrawn it from publication, if he could have done so, and let the whole matter slumber; for he of all men would not have wished vindictive roots to spread and twine about the hearts of men who thus would strangely nourish the very thoughts that their creed specially preaches against. Stevenson well knew man’s weakness, and the bigotry of men who differ on religious subjects and are opposed to each other by the difference of creed. Certainly the imputations of undeserved praise which were suddenly hurled at the self-exiled priest’s reputation only served one end: to bring out, if possible in brighter relief, the splendid heroism of Father Damien’s life, both before and after his going back to Molokai. Even had it been bitterly proved that the Flemish missionary was not a spiritual saint, but fallible flesh and blood flowing through earthly channels, which resisted, but did not always overthrow, temptation, still he would stand before us a beautiful man (and he was a man); and to do all that he did, and still have the weaknesses of mankind, makes the martyr stand out greater to our eyes than if he did his wonderful life’s work through some effortless, inborn virtue of heavenly inheritance. The sad peasant priest of Louvain has been dead these many years; he lived and died without ambition, and only in heaven may know the earthly fame he achieved. Well may we believe how beautifully he would smile, forgive and touch with his lips the brows of his erring detractors, with the same spirit that made him live and die for his fellow-men with the certainty of one final reward—a stricken leper’s grave in far away Kalawao, on Molokai Isle. Out of grey crags by warder-seas they creep With wailing voices as the stars steal by; Dead men—fast rotting on dark shores of sleep, Their earthly eyes still shape the shadowed sky! Poor skeletons, they moan, laugh, grin and weep; In loathsome amorous arms some still lie. Entombed, they curse the sun—Time’s cruel dial Above that vault—the South Sea Leper Isle. Hark to the midnight scream! Then silence after Of desolation voiced by waves that leap By sepulchres—damp huts of sheltered rafter, Where dreaming dead men shout thro’ shroudless sleep! As windy trees wail dreams of long-dead laughter; As o’er each wattle hut the night winds sweep, And dying eyes watch ships out o’er the night, Pass shores of death with port-holes gleaming bright! ’Twas on that Charnel-isle, with watching eyes He toiled for dead men who still heard the waves Beat shoreward: saw the South Sea white moonrise Bathe their-to-be forgotten flowerless graves! Exiled pale hero-priest! Full oft their cries Smote his sad listening ears; like unto caves That voice the mournful tone of ocean’s roll, Infinity entombed sang in his soul. Lonely as God, he sat: enthroned o’er pain Brave music made of desolation’s sorrow, Christ-like gazed on the deathless, crying slain! His eyes breathed light—foretelling some bright morrow Till from their tombs they rose—the dead again! Dark skeletons of woe, they rose to borrow Life from Molokai’s hero:—men denied That leper-priest—like Christ—when Damien died.","sourceLink":"http://novel.tingroom.com/duanpian/3060/84563.html","bookId":994,"book":{"id":994,"title":"A Vagabond\u0027s Odyssey","description":"简介： The path to hell is paved with good intentions.Looking reflectively over this second instalment of my autobiography, I perceive that I am such a genuine vagabond that I have even travelled along in my reminiscences without caring for the material nic...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3060","creation":"Aug 1, 2019 12:24:07 AM","modification":"Aug 1, 2019 12:24:07 AM"}}
