{"id":11749,"no":15,"title":"CHAPTER XIV","content":"Memories and Reflection—A Picture of Robert Louis Stevenson—German Appreciation—Of Norman Descent—A Cannibal’s Execution—An Australian Sundowner—A Voltaire of the Southern Seas—Types DREAMING over New Zealand days and the many types and characters I have met destroys the continuity of actual events: my thoughts digress for a moment to various experiences and pictures which my memory has recorded. Memories, in the perspective of dead Time, vary with our moods. Sometimes the figures and events stand out vividly, and at other times are illusive, and seem some sad, intangible thing far away in the background of life. The old bushman’s red beard and twinkling eyes; the squatting savages by their huts; the sensitive mouths and wondering eyes of the native girls; old scallawags; beachcombers; the noise of sailors on ships in the bay; Horncastle’s jovial face aglow with joy and drink; the palm-clad shores, and Apia’s primitive town, seem far-off dreams. I can still see Robert Louis Stevenson in Samoa; his tall, bony form, attired in white trousers, shirt and old shoes only, stands on the beach. His hand is arched over his watching eyes, his loose scarf blows out behind him to the gusty trade wind, as he stares seaward at the fading schooner that takes some friend away for ever. He looks like some memorial figure, the statue of a half poet, half pioneer gazing with aching eyes across the sea. The wind stirs the wisp of dark hair on the high, pale brow; the head is hatless and perfectly still, but the fine eyes are alive and full of far-away thoughts. Now he moves away and goes up the shore, and does not even see the smile of recognition on the face of the trading ship’s skipper, who passes with a Samoan sailor and one other. Like the memory of some tragical living picture it all flashes across my mind. I could think it all unreal, some far-off rocky, beautiful unknown isle, set in the seas of my imagination, as I paint the stars, the skies, the breaking waves, the ships and the sailors coming into the harbour, or once more going seaward. At other times Samoa’s Isles come back vividly, and just as a sailor, far away at sea, stands on the fo’c’sle head and watches the big clouds shift on the horizon as they break and suddenly reveal blue tropical skies over the outstretched, unknown continent’s shores of singing waves and palm forests, so I see the past, and the figures move. The winds stir the trees, and the magical, musical voices of savage men and women sing and laugh, in a world that is now The Arabian Nights’ Entertainments of my boyhood. As you can imagine, I have met many strange types of men and women in my travels, types both good and bad. I tramped many, many weary miles in the Australian bush when I was fifteen years of age. Often I tramped alone, when I could not get a congenial comrade. I was sometimes very lucky; and my reminiscences of those good comrades are the lights that shine down the dark tracks far away as I remember their eyes. One was a man of about thirty years of age. He was exceedingly cheerful and full of song and devilment. I can still see his refined face aglow as he sits under the scorched gum-trees smashing swamp mosquitoes on his hand or singing his favourite songs in a quiet, manly voice. We stayed together for two or three days at a sheep station, where the boss was a German. He was all right. But there were two German women and a son there too. When I played the violin to them, and turned around for the welcome and expected applause, they said: “Vell, dat vash little nize”; and then they shook their Teutonic square heads and, with their eyes and hands lifted to the shanty roof, said: “But, O-ez! you shoulds hear zem play that tunezz in Germanhy—O-o-o-o-e-z-z-z-z-z ze diff-er-enze!” Then my boyish blood warmed up and I said: “Germans can’t play the violin. Paganini wasn’t a German. No German ever played except by science.” “Mein Gott! Mein Gott! O, haves you never vash heards Vons Kriessburgh? He play that same tuenz vich you just now play so—phoo!”—here they shrugged their shoulders with disgust at my performance—“like dis,” and the two German women, who had faces like pasty pumpkins with glass eyes stuck in them, and the son, with his big moustache twirled at the ends, lifted their hands and eyes to the roof to express the ecstatic memory of the German’s violin-playing. Their mouths went “O, o-ez-e-z-z-z-z-z-z-ez,” emitting a strange sound that faded away in complete exhaustion as they sank down on to the three chairs like three puppets. Not only violin-playing, but everything, was wonderful in German art. If one said, “What a nice picture,” or “What nice butter,” they’d raise their eyebrows and sigh out that old crescendo, “O, O-e-z-z-z,” and say: “Have yous never, never tasted German butter?” It was the same with eggs, beef, pork, men, boots, girls or any d——d thing! My congenial comrade went off to New Zealand, and I ran across another one, who was most uncongenial for a time. We were tramping across the bush-lands, looking for work on stations and secretly hoping that we were not wanted. My friend was a short, thick-set, thick-necked fellow about two years older than I, with a slightly elevated, protruding chin and a mouth that talked from morn till night about his ancestry. I forget now whether he said they were descendants of Julius C?sar’s invading horde or of William the Conqueror. Anyway our friendship was one incessant argument. I was just on six feet high, full of health and independent strength, and I found that I was supposed to walk beside him with my head hanging for shame because I was only a “common Englishman.” We were on a lonely bush track; ragged gum-trees fenced the broken sky-lines for miles and miles around us. The only onlookers were parrots and cockatoos, like vividly coloured leaves overhead. There was no sight or sound of human habitation in that vast, sombre solitude as we tramped along together. A feeling of grim exultation seemed to suddenly seize me. Once more I swallowed another pill of insult, and I looked down sideways at my blue-blooded companion. I thought of my ancestral forefathers, and wondered if his ancestors had robbed my ancestors, and ravaged their lands and castles—my possible birthright! He did not know what I was thinking of as he talked away. His short legs strutted along the track with the toes turned up, his nose and chin also inclined skyward, as once more he reminded me of my plebeian origin. Suddenly!—— Well, I’ll not tell you all, for why should we be proud of the animalistic strain that sometimes dominates our natures? Why be proud that suddenly a bolt seemed to fall from the blue, and one of the reputed descendants of the first Kaiser Bill got his deserts, and lay with his back in the dust, his Imperial nose and semi-conscious eyes staring half vacantly up at the Australian sky, while plebeian, old pioneer England, with a swag on his back, tramped away and faded on the horizon—triumphant—alone! Ere sunset darkened the sky I lay ambushed in a clump of wattles by the forest, then peeped and saw my comrade coming slowly down the track with his toes turned down. I repented and thought: “Even if it’s true, he cannot help being the descendant of bloodthirsty ravishers, who killed old men and robbed my country’s churches. No, even he cannot help himself.” So I crept out and told him I repented, and once more we tramped along as comrades. So silent was he about William the Conqueror that you would have thought such a man had never lived. He admitted that night, as we sat by the camp fire, when I had explained my feelings to him, that his descent was only a family rumour. Hearing that, I truly forgave him, and we lifted the billy can of cold tea and drank a united toast to the memory of Caractacus and Boadicea, and death to all descendants of the first great bloated Kaiser Bill who dare prove to us their murderous, cowardly ancestry! Lake Rotorua and Mokoia Island, N.Z. I met yet another gentleman of ancient emigrant blood in Tahiti. He was a gigantic old chap, a chief. I slept in his hut with four American runaway sailors, who were waiting with me for the next boat to call, so that we could clear out. Night after night that old chief would sit and tell us of the wonderful earlier days, when he was the great king of the inland dominions, loved by all the tribes for his bravery and justice, and had had a special envoy sent out by Queen Victoria to represent her appreciation to the one true Christian monarch of the Southern Seas. He had fine eyes, and they flashed as he told of these old days, and his tattooed frame swelled majestically over many a wild memory. He even shed tears as he sang to us old far-off songs of dead heroes, mighty chiefs and tender maids he had eaten at the cannibalistic festive board. One night we returned to the hut and found that the great monarch had bolted off with all our possessions; even my last shirt had gone! Two weeks later he was caught by the gendarmes; then we heard that he was a ferocious cannibal of low origin, and that they had been trying to catch him for twelve months. He had killed a native boy, strangled him in the forest, and eaten him. Before we left we heard that he had been shot by the French Commissioners. About six weeks after, while I was walking along the beach at Apia, I met him. He ran for his life, before my friend and I got a chance to recover from our astonishment and run in the opposite direction. The hired native sharpshooters had deliberately missed him, and the old scoundrel had fallen dead till nightfall only! Another time I met an old dilapidated sundowner, a real specimen of the Australian bush-lands. It was miles up country where I first met him, sitting under his gum-trees by a creek making his billy boil. He gave me a hot drink and I gave him a tobacco plug; and as the billy boiled up again he said: “Where yer bound for?” “Anywhere,” I answered. “Wall, yer better come with me to Coomiranta Creek, ten miles off the western track, by Wangarris Yards; we can get plenty tucker there; and then on to the Sandy Hills and across Dead Girl’s Flat into Hompy Bom, that leads across Gum Creek into Dead Crow’s Paddock, two miles or more from Dead Man’s Hollow. Then strike the gullies by Riley’s ranch, and there we can get another stock of tucker. He’s a real all right ’un Riley is, and not too bad either.” And so he rambled on, as he wiped his grizzly grey beard, a beard so thick with spittle and tobacco juice that it acted as a kind of fly-catcher for him; the buzzing insects flapped their wings and struggled with their tangled feet in that awful hairy web till they were swept into Eternity by his brushing hand. Indeed his companionship was greatly esteemed by me, for as we tramped along under the sweltering sun I walked beside him untormented by the mosquitoes and the myriads of hissing flies that like a swarm of honeybees kept on his side, following his monstrous bushy beard as we travelled south. His whole life was centred on the various stations by the known tracks and the grades of generosity in the hearts of the overseers and stockmen. These sundowners arrive at the stations at sunset and appeal for work just as the day’s work is finished and bolt off at daybreak into the bush, with their old brown blanket on their backs. Stolid old men some of them, they are real derelicts of the old days. They look like grey-bearded figure-heads of ships, fixed on weary, ragged bodies, as with their pipes in their mouths they pass and fade across the oceans of scrub, spinifex and sand, buccaneers on the high seas of Australian bush. My old sundowner hardly ever spoke as we wandered along under the gum-trees, as the magpies sat on the twigs and chuckled, and bees moaned in the bush flowers of the hollows. We arrived in a bush town of about twenty wooden houses and two shops that sold all humanity requires. I played the violin, and he was delighted when I gave him all the money which he collected in his vast broad-rimmed hat. “I say, matey, chum up with me,” he said, as his long-sleeping commercial eye opened and stared at the money. But I didn’t chum up with him; I was not built for a sundowner. I recall how he always said his prayers after he had tucked his blanket around his body and laid his head on the heaped bush grass. He was old then. I suppose he’s long been dead now, and lies somewhere in those far-away bush-lands. I’ve seen some strange types in my time; but what are those types compared to the normal tribes I’ve seen and played to, laughed, loved and squabbled with. Little brown children clothed only in moonlight and sunlight, singing cheerfully by the South Sea breakers under the dark-fingered coco-palms. Sad little faces, some like deserted baby angels, looking up into my face—my children! Dishevelled, strange old bush mothers, crooning to their buds of humanity, tiny brown clinging hands and moving mouths at their kind, softly feeding brown breasts—my mothers! Old tattooed chiefs and grim-looking kings; rough-haired semi-savage girls; and youths jabbering in strange tongues, with hushed, secret voices, over the terrible white plague that had entered and stricken their primitive city of huts; the white-faced, fierce-looking invaders from across the seas. Ravishers of their maidens! The scum of the Western cities prowling about the villages that had become the hot-beds of lust and sin’s terrible paradise. Missionaries, with melancholy, hollow voices, who seldom knew anything of the intense inner life of humanity and the great philosophy of happiness. Superstitious, bigoted old chiefs cursing the white man’s Bible. Philosophical old brown men with high brows and keen dark eyes reflectively nodding their heads. South Sea Oldenburgs striving to convince grim South Sea Spinozas. Stalwart, dark tattooed Schopenhauers shouting about wind-baggery. I can see again the ironical heathen chief sitting by his palatial hut. He is clever, a Voltaire of the Southern Seas. His strong face is tattooed; grim-looking are his little eyes as he grins and looks at the Marquesan coat-of-arms which he has invented and placed at his door—a large empty rum barrel and on top of it a Christian Bible! I see the pretty Samoan girl, Millancoo, with lovely dreaming eyes and thick bronzed hair, with a red and white hibiscus flower stuck in at each side. Her brown limbs and figure are the perfection of graceful beauty, dressed only in a little blue chemise. She eloped with a “noble white man” to the Gilbert Isles, and committed suicide when he left her, ere her first-born could creep to her bosom and taste the only milk of human kindness it would most probably have ever known. Earnest-faced Tippo, her sister, sits on the slope. Happy as night with its stars is she, with six little dark, plump children with demon-like eyes romping all round her. She has married an uncivilised nigger from Timbuctoo! O happy girl! How the natives chided and sneered at her at first for not marrying a great white lord as her sister did! Beautiful women, and men also, I have met in strange places. I have found them in the hovels and among the scum of life, and sometimes in the palatial home of affluence. Convicts of New Caledonia in the calaboose or toiling in chains, breathing, yet as dead as dust, with hollow, sad eyes, corpses from La Belle France—my poor brothers! Old men and women begging by the kerb-side in the far-away civilised Isle of the Western Seas! The old man in rags, a skeleton on tottering feet, shivering, going down the cold, windy, main road of the lighted suburb, singing, with a palsied old mouth, some song that God composed ere Christ came. He is my beloved comrade; bury me with him, so that the flowers over us may twine in our dead dust and find mutual sympathy. I have seen multitudes of commercial burglars, wealthy villains, who fought so valiantly to save their own lives that they have received the commercial V.C. for valour—and penniless, profligate angels, fighting side by side in the battle of nations—that battle wherein the bullets cause mortal wounds, though many years pass before they send the bloodless corpses to heaven—or hell. I have seen old, ragged, hideous, long-dead women still sitting by the attic’s hearth fire, sipping the gin bottle—sweet-fumed opium for their spectral dreams. As they stare at the embers burning in the red glow they see their own girlhood faces smile once more back into their bleared eyes, with remembered beauty, happiness and glorious faith. Old roués too dream somewhere—the men who made the vows to those drunken old women and never kept them—may they sleep well, but never wake! I have heard the majestic cathedral organ thunder its rolling music to the roof as the beggar passed by the massive, nail-studded door on swollen feet, rubbed his cold skeleton hands together and spat viciously. No food in his body, and his soul—well, why should he worry about his soul? I have seen the great shocked multitude open their eyes aghast, and heard the tremendous crash, the clatter of the hail of stones, when the voice said: “He that is without sin among you, let him first cast a stone at her.” O wonderful goodness! O icy, stony virtue. Ah! not only in the wild Australasian bush or in the Southern Seas is the great drama of life enacted; the great drama that makes your heart cold, and the old warm belief become encrusted with icicles, as you dream over the strange lot of the wandering, lost children. I’ve laid me down deep in the bush to sleep, And wrapt my body in the sunset’s blaze. Then wondered why He made sad wings for days To fly away—and all our world to weep. Like to a myriad birds blown round sunset In song, I thought I watched God’s careworn Face Brushed by bright wings—the unborn human race Who did not want their mortal birth—just yet! I heard the growing flowers cry in the night, And trees—that whisper of old cherished things. And still the startled, hurried rush of wings— It was the stars sighed out—upon their flight. O Troubadours, O Stars, what sing you of? O wandering minstrels, is it to God’s plan You sing?—or to the exiled heart of man Who pays with death’s blind eyes and cherished love? But still the children cry upon the plain Beside a grave; and still the cheerful king Grows fat; and sad old men say: “Anything, O God, except to live this life again!” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3060/84568.html","bookId":994,"book":{"id":994,"title":"A Vagabond\u0027s Odyssey","description":"简介： The path to hell is paved with good intentions.Looking reflectively over this second instalment of my autobiography, I perceive that I am such a genuine vagabond that I have even travelled along in my reminiscences without caring for the material nic...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3060","creation":"Aug 1, 2019 12:24:07 AM","modification":"Aug 1, 2019 12:24:07 AM"}}
