{"id":29142,"no":9,"title":"CHAPTER VIII. DANIEL RECEIVES SOME VALUABLE ADVICE","content":"Peter Harvey, in his interesting volume of “Reminiscences of Daniel Webster,” relates many incidents for which he was indebted to the free and friendly communications of Mr. Webster himself. One of these I will transfer to my pages, as it will be likely to amuse my young readers. I can do no better than quote it without alteration from Mr. Harvey’s book. \n \n “Mr. Webster was once telling me about a plain-spoken neighbor of his father, whose sons were schoolmates of his own. The neighbor had moved into the neighborhood of Hanover, where he had opened a little clearing, and had settled upon a piece of comparatively barren land. After Daniel had been in college several months his father said to him, \n \n “‘John Hanson is away up there somewhere. I should like to know how he is getting along. I think you had better find him out, and go and see him.’ \n \n “So Daniel inquired about, and soon found out pretty nearly where Hanson lived. \n \n “‘One Saturday afternoon,’ related Mr. Webster, ’I thought I would trudge up there through the woods, and spend Sunday with my old friends. After a long, tedious walk I began to think I should never find the place; but I finally did, and when I got there I was pretty well tired out with climbing, jumping over logs, and so on. The family were not less delighted than surprised to see me, but they were as poor as Job’s cat. They were reduced to the last extreme of poverty, and their house contained but one apartment, with a rude partition to make two rooms. \n \n “’I saw how matters were; but it was too late to go back, and they seemed really glad to see me. They confessed to me that they had not even a cow, or any potatoes. The only thing they had to eat was a bundle of green grass and a little hog’s lard, and they actually subsisted on this grass fried in the hog’s fat. But it was not so bad after all. They fried up a great platter of it, and I made my supper and breakfast off it. About a year and a half afterwards, just before graduating, I thought that, before leaving Hanover, I would go and pay another visit to the Hansons. I found that they had improved somewhat, for they now had a cow and plenty of plain, homely fare. I spent the night there, and was about to leave the next morning, when Hanson said to me, \n \n “’“Well, Daniel, you are about to graduate. You’ve got through college, and have got college larnin’, and now, what are you going to do with it?” \n \n “’I told him I had not decided on a profession. \n \n “’“Well,” said he, “you are a good boy; your father was a kind man to me, and was always kind to the poor. I should like to do a kind turn to him and his. You’ve got through college, and people that go through college either become ministers, or doctors, or lawyers. As for bein’ a minister I would never think of doin’ that; they never get paid anything. Doctorin’ is a miserable profession; they live upon other people’s ailin’s, are up nights, and have no peace. And as for bein’ a lawyer, I would never propose that to anybody. Now,” said he, “Daniel, I’ll tell you what! You are a boy of parts; you understand this book-larnin’, and you are bright. I knew a man who had college larnin’ down in Rye, where I lived when I was a boy. That man was a conjurer; he could tell by consultin’ his books and study if a man had lost his cow where she was. That was a great thing, and if people lost anything, they would think nothin’ of payin’ three or four dollars to a man like that, so as to find their property. There is not a conjurer within a hundred miles of this place; and you are a bright boy, and have got this college larnin’. The best thing you can do, Daniel, is to study that, and be a conjurer!”’” \n \n We can imagine the serious, earnest tone in which this advice was given, and we may easily suppose that Daniel found it hard not to laugh when the climax was reached. We can hardly imagine the advice to have been taken. If, in place of Daniel Webster, the great lawyer, and the defender of the Constitution, we had Daniel Webster, the famous conjurer, it would be a ludicrous transformation. There are few persons who do not consider themselves qualified to give advice, but when my young readers are advised about the serious business of life, let them consider whether the advice comes from one who is qualified by wisdom and good judgment to give it. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1669/49199.html","bookId":1192,"book":{"id":1192,"title":"From Farm Boy to Senator","description":"简介： But thirty years have elapsed since the death of Daniel Webster, and there is already danger that, so far as young people are concerned, he will become an historic reminiscence....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1669","creation":"Aug 1, 2019 12:24:34 AM","modification":"Aug 1, 2019 12:24:34 AM"}}
