{"id":6665,"no":3,"title":"Chapter 2 Self-Fulfilment as the Ground of Ethics","content":"IT will be convenient to begin by discussing the ethical theory that is usually associated with philosophical idealism. I am not concerned to give a full historical account of this great system as it was expounded by particular thinkers, but only to state and criticize what I take to be the essential basis of all idealist ethical theories. And this I seek to do because. though this basic idea appears to me subtly false in one respect, in others it is immensely significant. Criticism of idealist ethics is apt to be more pert than shrewd; and I am reluctant to seem to join in the outcry. But it is very necessary to criticize certain aspects of the theory if we are to profit by it as a whole; and with this aim I shall single out that presentation of it which seems most clear and rigorous, namely. the ethics of Bradley; and I shall try to show that its solution of the basic problems is dependent on the use of the word ‘self’ in two different senses, namely sometimes as experient, and sometimes as that which is experienced. \\n\\n A. Pleasure and the Enduring Self \\n\\n \\n\\n Bradley’s first concern in ethics is to criticize hedonism, the theory that goodness is identical with pleasure. This he effects by a psychological analysis of ‘pleasure’ and of ‘self’, in order to reach an understanding of ‘desiring one’s own pleasure’. The self for the hedonist is a series of momentary mental states; and the pleasure that is sought is the longest possible sequence of the intensest possible momentary states of being pleased. But, in fact, says Bradley, the self that is to be pleased is not a series of discrete moments. It is an enduring unitary thing, in some important sense identical to-day and yesterday and to-morrow. If this were not so, there would be no point in sacrificing to-day’s pleasure for the prospect of a keener or longer pleasure to-morrow. The self of to-day and the self of to-morrow would be as mutually indifferent as the self of Brown and the self of Jones. The pleasure that I have in the prospect of to-morrow’s pleasure is dependent on the fact that the self to be pleased to-morrow is the same self as the self to be denied to-day. And I choose to-morrow’s pleasure because I expect therein the fulfilment of the self which is identical on both days. The prospect of to-morrow’s pleasure is pleasant to-day because to-morrow’s pleasure, when it occurs, will be a felt state of fulfilment of the enduring self. Thus pleasure is essentially a felt state of self-fulfilment, whether in small matters or great. \\n\\n \\n\\n Sometimes small fulfilments may be sought to the exclusion of greater fulfilments, as when the schoolboy forgets the consequences of over-eating, or when the adult ignores his generous impulses for the sake of his egoistic impulses. For the self has various kinds of needs; but all of them are aspects of the need for continuance, expansion, fullness of being. We may, of course, take pleasure in acts which do not, in the circumstances, make for our self-fulfilment. But the fact that we do get pleasure in such acts is apparently due to the fact that, at some time or other, acts of such a kind have generally made for self-fulfilment, whether in ourselves or our ancestors. Pleasure is thus seen to be not identical with, but a sign or symptom of, self-fulfilment. Displeasure, pain, grief, are signs or symptoms of self-negation. That which we desire is not, in general, pleasure, but self-fulfilment. And the felt realization of self-fulfilment may be conveniently called happiness. It is true then, that, though we do not always desire pleasure, we do always desire happiness. And further we may say that pleasure is in fact desirable only when, and in that, it does actually arise from self-fulfilment; and pain is undesirable only when, and in that, it does actually arise from self-negation2 \\n\\n B. The Social Self \\n\\n \\n\\n But the self which a man cannot but seek to fulfil is not simply his private self, which stands over against the selves of others. For the normal man is essentially social. It is a plain matter of fact that he cannot be happy in merely fulfilling his own person while ignoring others. The content of his self is very much more than his private person with its egoistic needs. He includes within himself at least some few intimate other persons, and cannot attain self-fulfilment apart from the fulfilment of these. And this is true even if he is a thoroughly selfish man; even if, whenever his private needs conflict with the needs of his friends, he always sacrifices the latter. For such a person sacrifices one part of himself in order to fulfil another part. Thus he inevitably falls short of self-fulfilment; for he does need the fulfilment of his friends, even though he may desire more eagerly the fulfilment of his own private ends. \\n\\n \\n\\n But indeed a man’s private ends, and his private self, are mere abstractions. For, according to the theory that we are considering, every man is intrinsically, not extrinsically, social. His social relations are internal to him, not external. There is nothing whatever in him which is not social as well as private. If he were not by nature a social animal, and by nurture a social mind, he would be something radically different from what he is. His most private acts are determined by his social environment, and would be other kinds of acts in another society. The content of every one of his desires owes its character on the one hand to his social environment, and on the other to an inherited nature, which is itself the product of a social ancestry, and demands in him a social fulfilment. Through heredity and environment society has made him. He simply is society (so we are told), thinking and willing in the particular centre called by his name. When he seeks to be nothing but his private centre, he seeks to be something which he cannot be without denying the major part of himself, without ceasing to be what he really is. \\n\\n \\n\\n The idiot alone succeeds in denying his social nature. But even his nature is social in essence; since he, like us all, is social in origin. He has indeed no social interest, and seeks no social fulfilment; yet he is such that there can be no happiness for him without the exercise of the social rudiments or vestiges of his nature. It is irrational in him to ignore his internal relatedness to society. For a private mind is not merely, nor primarily, a private mind. It is potentially the mind of society; and its interests are potentially the interests of society. In Bradley’s words, society ‘is the objective mind which is subjective and self-conscious in its citizens: it feels and knows itself in the heart of each.\u0027 3 \\n\\n \\n\\n It is in terms of the essentially social nature of every self that orthodox ethics describes moral obligation. In the first place it is insisted that moral obligation is in fact felt, and that it is not to be denied or explained away. Human beings do feel that they ought to behave in certain manners or serve certain ends, whether (in the ordinary sense) they want to or not. But moral obligation cannot be merely obedience to a law externally imposed, since, unless the agent himself recognizes the rightness of the law, he is not moral in obeying it. Moral obedience must be free obedience. To be moral we must ourselves will the good. Yet the good is not just whatever we actually will, or whatever we desire on the whole and in the long run. For the essence of morality is to distinguish between what we happen to desire and what is intrinsically good, and to seek to conform our desire to the good. Thus there is a dilemma. For, if we are to be moral, we must will the good, and yet when we are moral we may have to do what we desire not at all to do. Moral behaviour must be on the one hand freely willed, and on the other hand obedient. \\n\\n C. The Actual Will and the Real Will \\n\\n \\n\\n This dilemma is said to be avoided by the theory of the actual will and the real will. Actually I may be intensely desiring to do what I know to be wrong, while really, in my heart of hearts, according to my true nature, I will to do only the right. Potentially, or at heart, we are all moral beings, who will only the good. When I desire to do what I know to be wrong, the ‘I’ that desires so is only a mood, a partial, limited, somnolent mood, of the true ‘I’, who will only the good. \\n\\n \\n\\n We shall understand the theory better, and subsequently be able to criticize it more justly, if at this point we study an important double distinction upon which it is based, namely on the one hand the distinction between will and desire, and on the other that between the actual will and the real will. A desire is a subjective attitude or act, which mayor may not express fully the individual’s will, mayor may not take into account all the needs which occur within his actual mental content. Thus a man may desire a glass of beer even while his will, his deliberate decision in relation to the circumstances of his whole life, is to refrain from alcohol. And under the stress of temptation the momentary impulse may possibly triumph over his will. \\n\\n \\n\\n But in addition to the distinction between desire and will there is the distinction between the actual will and the real will. Both wills are in some sense objective, in that both are mental content, not mental process; though exponents of the theory sometimes seem to impute to the actual will characteristics which belong to process rather than content. For certainly in a sense the individual’s real will and his actual will are not equally objective. His actual will is constituted, or at any rate determined, by those needs which he actually recognizes (or seems to himself to discover), within his actual mental content, with all its limitations, and errors, and prejudices. His actual will, therefore, is thus far shot through with subjectivity. But his real will is for the objective good, and is without subjective limitation or bias. Implicit in the form of his actual will, though not explicitly willed, and certainly incompatible with many of his desires, is the will to be a fully-grown personality; and since this goal cannot be attained while any discord or limitation remains within his mental content, his real will is necessarily for the objective good. What he really needs, and therefore what at bottom he really wills, is, in the last resort, his fulfilment as the universal self. \\n\\n \\n\\n Thus the real will, which is the good will, is identical in us all, and characterizes the true self of each. It is identical, not as a particular threaded through other particulars, but as a universal identical in its instances. Each of us is distinct and individual, and the real Will expresses itself differently in each of us; but in all it is a fundamental identity of form. Our actual wills are merely incomplete, partial, and so far unreal, approximations to the real will; since in respect of our limitations and prejudices we fail to fulfil our true nature as rational beings. Yet some limitation we must have. The real Will must be expressed in some particular manner or other. Only by being a peculiar and distinctive individual can a man be actual at all. \\n\\n \\n\\n It is now possible to see more clearly the relations of desire and will. A desire may fall short even of the actual Will, or it may truly express the actual Will; or again, in so far as the actual Will may be in some respects identical with the real Will, a desire may express not only the actual will but also the real will, may in fact be a morally right desire. Of course the actual will cannot be, even in any one respect, exhaustively identical with the real Will, since they are organic wholes of different character. Every expression of each must therefore be transfused by, or characterized by, the distinctive whole that each is. Yet they may approximate in certain respects sufficiently to involve identical actions. \\n\\n \\n\\n On this theory, then, moral choice is free activity on the part of the true self, since it expresses the real will of the individual. But on the other hand it is activity in conformity with an objective principle. It is obedience to something other than the desire or whim of the moment, and to something greater than any mood which is not expressive of the whole self. It is free conformity to the will implied in the objective content. It is obligation on the part of a partial self, or mood, to the whole and true self. \\n\\n \\n\\n If these two selves were distinct centres of consciousness, there could be no obligation felt by the one towards the other. But they are only distinct as a temporary mood is distinct from the whole united self. The lesser self is an unreal abstraction. Its logical fulfilment is that it should become the higher. While I am only my partial, momentary self, I am indeed seeking some things which it is my true nature to seek; but I am seeking them while I ignore other things which it is also my true nature to seek. In the glamour of my partial mood I neglect the greater, more real objects, without which I cannot be my true self. \\n\\n \\n\\n The ground of obligation, then, is not external law; it is the self, the real self which alone can fulfil even the partial self of the actual will, and the fleeting selves of momentary desires. I must be moral, according to this view, because only so can I fulfil myself, be my true self. But what kind of a self is it that demands fulfilment? We have seen that it is not the sequence of my states of mind. I do not fulfil myself by gaining pleasures and avoiding pains. Nor am I merely to contrive harmonious satisfaction for my actual instincts, or my actual interests of whatever kind, in such a way as to achieve as much satisfaction as possible with as little internal conflict as possible. My actual self, as we have seen, cannot be permanently satisfied by the mere satisfaction of its actual cravings. It can only be satisfied by being transformed into a greater self. It cannot permanently rest content with its own private fulfilment, considered as the fulfilment of one person among others. For if it fulfils itself at the expense of others, or even merely without fulfilling others, it violates its own true nature, which is social. Part of its actual content remains unfulfilled. And even if it had never partaken of a social environment, part of its inherited nature would cry out in vain for fulfilment. \\n\\n \\n\\n But the ground of obligation is not merely in our inheritance of social impulses; it lies in our rational nature. We are able to take an outside view of ourselves, to transcend the bias of our own subjectivity, and regard ourselves and others as equally objective. For each active self is an approximation to a universal self which should include all actual selves as members within itself4. If my private self were to attain this perfection, this universality of content, it would no longer be limited by the merely negative private idiosyncrasies that it has now. It would be the self of no particular person, but the self of mankind, nay the self of the universe. And in so far. as my self is not this universal self it is logically incomplete. It implies an immensity beyond its actual content. In isolation from all that it implies it is not real but an abstraction; just as a living hand considered in isolation from the rest of the living body is unreal, an abstraction. \\n\\n \\n\\n It follows, then, that though our actual wills differ, the real will in us all is identical, since it is the will for the one universal good. For in the first place the real will in each transcends his private needs, and is the will of the society in which he lives. This does not mean that it is, so to speak, the voice of the majority speaking in him, or the resultant of all the actual wills of his compatriots. It is rather the good will, the best will, which is implied in all actual wills, but may be very different from the voice of the majority. It is the best will, in being simply the will for the fulfilment of the whole nature of the society, which (we are told) is not simply the sum of the natures of all its members. The general will of the society, or the spirit of the nation, is something immanent in each individual, a universal type of which each individual is an imperfect instance. And so the individual is only fulfilled by identifying his actual will with this general will, which is his logical completion. Our end, says Bradley, ‘is the realization of the good will which is superior to ourselves; and again the end is self-realization. Bringing these together, we see the end is the realization of ourselves as the will which is above ourselves.\u00275 This good will, in which alone we can fulfil ourselves, must be objective, not dependent on anyone’s liking. And it must be universal, above all particulars and prejudices. And finally it must be concrete, not abstract. It must be realized in and through particular acts of particular persons. Thus society is said to be strictly an organism. And the will of society is ‘the self-realization of the whole body, because it is one and the same will which lives and acts in the life and action of each.’ But also it is ‘the self-realization of each member, because each member cannot find the function which makes him himself apart from the whole to which be belongs; to be himself he must go beyond himself.’ \\n\\n D. My Station and its Duties \\n\\n \\n\\n Practical results follow from this emphasis on the will of society. “The supreme moral precept turns out to be to fulfil’ my station and its duties.\u00276 True it is a duty, says Bradley, \u0027standing on the basis of the existing, and in harmony with its general spirit, to try to make, not only oneself, but also the world better, or rather, and in preference, one\u0027s own world better.\u00277 But it is wrong, .starting from oneself, from ideals in one’s own head to set oneself and them against the moral world.’ For the moral world, he holds, is real: our private ideals are not. On the other hand the community of which a man is a member ‘may be in a confused or rotten condition8.\u0027 And indeed, the best community is not perfect. Consequently, we are told, the morals of each nation must be criticized in the light of the morals of all others. \\n\\n \\n\\n For indeed the real will, which it is our true nature to will, is not simply the will of our society. Societies themselves are but approximations to a more general ‘will of mankind’. And this in turn is but an approximation to the universal will, which we may call the will of God. This it is which is the real will, identical in us all. This it is which is the sanction of our moral obligation, which imposes a duty on us to realize an ideal for the world. And this ideal is to be realized on the one hand in faithful fulfilment of our station and its duties, and on the other in striving to better even the will of the society in which we live. \\n\\n \\n\\n But it is admitted (in the theory which we are considering) that there are certain ends to be fulfilled which cannot be justified as mere means to the fulfilment of society. These are the activities of art, and of scientific and philosophical inquiry. Such pursuits are judged good in themselves, and a society is judged partly in respect of its achievement in these spheres. In explanation of this we are told that these activities are modes of self-fulfilment, and that’ the moral end is to realize the self, and all forms of realizing of the self are seen to fall within the sphere of morality9.’ \\n\\n E. Summary \\n\\n \\n\\n The foundation of the whole theory is evidently this: obligation arises from the recognition by the actual self that it is incomplete, incoherent. The whole of duty is thus the duty to realize oneself. But we are told that ‘“realize yourself” does not mean merely \"be a whole\", but \"be an infinite whole10\".\u0027 It is not sufficient to avoid contradiction within the self. It is necessary also to embrace all things within oneself, and form one’s will in relation not to a parish but the universe. And this necessity arises from the fact that inevitably there are contradictions in the narrower self which entail the wide self for their resolution. \\n\\n \\n\\n Such in brief is Bradley’s theory of ethics. Now it may be that other idealists would not accept Bradley’s account of ethics without serious modification. Bradley has described his theory with his customary rigour and precision. I confess that the pure essence of all idealist ethical theories seems to me to be contained in Bradley, and that the suggested modifications seem often merely to obscure the issue, This, however, is a historical question with which I am not here concerned. What does concern me is to show that the theory described in this chapter needs not merely to be modified but, so to speak, to be turned back to front. \\n\\n \\n\\n Bradley’s theory reaches very far beyond hedonism. Not only is it based on a sounder psychology, but also, in deriving obligation from the self as content rather than the self as feeling, it more nearly does justice to the nature of moral experience. But I shall now argue that it does not carry through this objectification of obligation to its proper conclusion. In so far as it seems to solve the ethical problem at all, it does so by means of the concept of self-fulfilment; and this is plausible only because by means of the ambiguity of ‘self’ the object of knowledge is infected with the subjectivity of the moral agent. Thus the agent in fulfilling his content seems to be merely fulfilling himself, and the problem of obligation is evaded. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/kehuan/1079/32293.html","bookId":215,"book":{"id":215,"title":"A Modern Theory of Ethics","description":"简介： WHETHER this book is modern in the good sense or the bad sense of that irritating word is for the reader to judge. I have tried to produce an ethical theory which should be both impregnated by the polliniferous wind of contemporary thought, and yet n...","cover":"https://cunovel.com/defaultCover.png","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/1079","creation":"Aug 1, 2019 12:18:25 AM","modification":"Aug 1, 2019 12:18:25 AM"}}
