{"id":99350,"no":28,"title":"Page 28","content":"\n “Then came the plague. And for those of us caught in it, suddenly there was just one group: the outcasts. Or the losers, or the freaks, or whatever you call people that the rest of the world wishes would go away. Like I said earlier, we waited almost three years even to have a school in Deadtown. When we got one, cliques didn’t seem so important anymore. Hey, we were all outcasts together, so why make life hard for each other? In my school now, I’m friends with kids I never would have spoken to back in Revere. Most of my classmates are zombies, but there are some werewolves, too. Sounds like a really bad horror movie, right? Deadtown High: Zombies vs. Werewolves. But you know what? We get along.\n “And you know why? Because now we want to learn stuff. Not just from our classes, but from each other. My friend Brendan knows everything about computers, and he’s also teaching me martial arts.” She did a karate move that brought more laughs and scattered applause. “My best friend, Jenna, she’s an awesome negotiator who never met an argument she couldn’t resolve. My other friend Sharon, who’s a werewolf, is into finance and makes these amazing predictions about the stock market. People come to me for fashion tips, which you’d expect”—she twirled to show off her outfit—“but also to learn how to get rid of their personal demons. Because kids have their own demons to wrestle with. And I learned about demons from the best demon slayer in the business, who, by the way, happens to be a shapeshifter.”\n My doubts about Tina as demon-slaying expert were squashed by the lump in my throat.\n “So, in conclusion, my point is this. Most things about being previously deceased well and truly suck. But for me, there’s been one good thing, and that’s the ability to look past stupid, meaningless differences and come together to support and learn from each other. And if us kids can do that at the DA-1 school, we can all do it.” She looked around, as if expecting applause, but the audience was silent, every face watching her. “So . . . um . . . go, unity!” As she pumped a fist in the air, the applause came, along with cheers and more pumping fists. Tina grinned and clasped her hands above her head, like a prizefighter. Then she skipped to the edge of the stage. Kane, standing, shook her hand, before she went down the steps. Kane went to the microphone to introduce the next speaker.\n I skirted the edge of the crowd and caught up with Tina a couple of minutes later. When she saw me, she threw her arms around me in a hug that nearly broke my ribs.\n “Nice job,” I said, once I could breathe again. “The audience loved it.”\n “Yeah, they did, didn’t they? I practiced, like, a gazillion times. Kane said not to say ‘like’ and ‘you know’ and ‘stuff’ and, you know, other stuff. That was hard. But I think I did okay.”\n “You did great.”\n “Thanks.” Tina grinned, still riding high on the applause. “Anyway, I’ve gotta go. I’m getting interviewed. It’s just PNN, so it’s not like anyone will watch, but hey, TV is TV.”\n “You never know who might see it.” The Paranormal News Network’s largest audience was in Deadtown, but it was available nationwide. “Have fun.”\n “I will.” But she didn’t move away. She bit her lip and looked almost shy. “Um, Kane told me your aunt is visiting.”\n “That’s right. We picked her up at the airport tonight.”\n “Did she . . .” Tina glanced around. “Did she come to my speech?”\n “She’s asleep in my apartment.”\n “Oh. I guess she must have been tired after flying across the ocean and all.”\n “She did have a very long day. We’ll watch for your interview on PNN tomorrow.”\n “Awesome. They’ll probably show part of my speech, too.” The shy look returned. “Um, do you think it would be okay if I came over to see her? You know, to say hello and whatever.”\n “I’m sure Mab would love to see you. Just call first.”\n “Really?” She bounced on her toes, looking more like the Tina I knew. “Cool. Okay, I’ll call tomorrow. Talk to you then.” Another hug, and she disappeared into the meeting house while once again I checked for cracked ribs.\n SEVERAL MORE SPEAKERS, ROUSING BURSTS OF MUSIC FROM an all-paranormal brass band between them, took the stage. All of Deadtown’s main paranormal groups were represented: zombies, werewolves, and even vampires, who weren’t normally into things like unity and togetherness. Most moving was Clyde, who’d traded his doorman’s uniform for a cleric’s robe. “I know that many of you lost your faith after the plague,” he said. “Certainly, I’ve struggled with my own. Despite that, or perhaps because of it, I’d like to offer a simple prayer. Even if you don’t believe, I hope you’ll listen to the spirit that moves these words.” By the time he’d finished his quiet, dignified appeal to heal breaches and bring people together, I was wiping tears from my cheeks. The female zombie beside me put an arm around my shoulder. If zombies could cry, there wouldn’t have been a dry eye in the audience.\n Then it was Kane’s turn. He praised the speakers and thanked the audience for coming. He described some of the work he’d been doing to secure paranormal rights through lobbying and the courts. “I’m not going to talk about winning this fight,” he said. “Fighting, warfare, battles—those are the wrong metaphors. If we try to fight, we will lose. We will lose in more ways than one. First, we possess neither the weapons nor the numbers to win an actual war. The forces that oppose us would smash our homes, our businesses, take away what little freedom we now have. Even worse, to my way of thinking, is that we would lose our ability to define ourselves. ‘Look at them,’ the powers-that-be would say. ‘They’re monsters. All they understand is violence. We have to destroy them—they give us no choice.’”\n A couple of shouts came from the back of the crowd. A fight? Hecklers? From where I stood I couldn’t see what was going on. Kane stared in that direction for a moment, then continued.\n “What we face is not a fight,” he said, “but it is a struggle. Think of the difference. Any thug can pick a fight.”\n “Fight! Fight! Fight!” What at first sounded like an echo of Kane’s word turned into a chant. “Fight! Fight! Fight!” The voices came from multiple directions. I heard scuffling behind me and turned around to see a big zombie take a swing at a werewolf who wore a SECURITY T-shirt.\n Kane raised his voice. “Struggle demands sacrifice. It demands discipline. It demands looking beyond the immediate situation to our long-term goal.”\n The security werewolf snarled and launched himself at the zombie. All around, scuffles broke out. Groups of zombies threw themselves at those standing at the edges of the crowd. It looked like a coordinated effort to interrupt Kane’s speech.\n The security werewolf and the zombie he was fighting crashed to the ground beside me. A bronze dagger was already in my hand. I didn’t remember unsheathing it, but my burning demon mark urged me to use it. Now. Cut up the damn zombie’s face. He wanted a fight? He’d picked the right rally.\n Unity, my ass. I’d teach this assclown a lesson.\n “STOP!” A thunderous roar exploded from the platform. It shook the ground and echoed off the buildings. Everyone froze. A thousand pairs of eyes turned to the platform.\n Kane stood tall, his face a mask of barely constrained fury. His silver hair shining under the stage lights, he looked like an avenging angel. This was not a werewolf to be messed with. This was strength and power given form.\n Kane took advantage of the crowd’s silence. “This is exactly what they expect of us,” he said in a low, deadly voice. “I thought we were coming together tonight for unity. Apparently not. So tell me, if you don’t want unity, what do you want?”\n He waited. Silence reigned for three, maybe four seconds. Then a voice yelled, “Kill all the bloodbags!”\n Kane’s gaze zeroed in on the heckler. “Really? That’s what you want? Because if that’s your goal, you can’t complain when they start dropping bombs on Deadtown.” He gestured, waving his arms around to imitate a fascist dictator on crack. “‘They’re our enemies! Kill them all!’ If that’s the attitude you take, are you surprised when the other side looks at you the same way? The same anger. The same hatred. The same feeling of ‘All our problems would be solved if only those other bastards didn’t exist.’”\n Again he waited. This time, the heckler stayed quiet. Kane shifted his stance, his gaze sweeping across the crowd. I put my dagger away, willing the heat in my demon mark to cool. Nobody shook hands and started singing “Kumbaya,” but no one threw a punch, either. A few zombies slunk away from the crowd’s edges.\n “Struggle, my friends,” Kane said at last. “Not fighting the norms. And for God’s sake not fighting each other—there’s nothing they’d like more. But struggle. It’s how we’ll make our voice heard. It won’t be easy, but we have to show we’ll never give up. Because our goal—no matter how long it takes—is to be equal participants in society. That’s my vision. But we have to be in it together. Because if you’re not with me . . .” He didn’t seem to know how to finish that sentence. He dropped the microphone, which landed with a thunk and squeal, and walked to the edge of the stage.\n He hadn’t made it down the first step before the chanting started up again. But this time, the chant wasn’t “Fight! Fight! Fight!” Instead, a thousand voices called out his name.\n “Kane! Kane! Kane!”\n Even the zombie who’d attacked the security werewolf was chanting it.\n “Kane! Kane! Kane!”\n Kane stopped, his hand on the railing. He turned back to the crowd.\n “Kane! Kane! Kane!”\n I added my voice to the chant. We clapped with each repetition. All of Deadtown chanted in one voice, until the word exploded into a tumult of cheering. \n","sourceLink":"https://allnovel.net/hellhound-deadtown-5/page-28.html","bookId":2613,"book":{"id":2613,"title":"Hellhound (Deadtown #5)","description":"Storyline: \n Hellhound (Deadtown #5) \n They call it Deadtown: the city’s quarantined section for its inhuman and undead residents. Most humans stay far from its borders—but Victory Vaughn, Boston’s only professional demon slayer, isn’t exactly human… \n Boston’s zombies have suddenly become inexplicably violent—horror movie-style—resulting in a catastrophic all-out battle against humans. More troubling to Vicky is that she’s had dreams and visions of herself fighting alongside the demons. At least, she hopes they’re just visions—otherwise, that puts her on the front lines of the wrong side of the war. \n Vicky’s not surprised to discover that Pryce, her demi-demon cousin and loathed adversary, is behind the outbreak of the zombie plague, having formed an unholy pact with the Old Ones. Now, as the violence escalates and alliances shift, Vicky knows she’s the only one who can stop the plague. Unless the pack of hellhounds on her trail finds her first.\n \n","cover":"https://allnovel.net/images/hellhound-deadtown-5.jpg","author":"Nancy Holzner","type":"Horror","source":"allnovel","link":"https://allnovel.net/hellhound-deadtown-5.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:40:19 PM"}}
