{"id":99374,"no":52,"title":"Page 52","content":"\n Hand moves. I jump back, hiss. Tense, ready to run.\n “Shh. It’s all right.” Human sounds are quiet, soft. Not fighting sounds. Hand turns, opens. I sniff more. Good smells. Milky.\n “I don’t want to scare you off, so I’ll move real slow.” Hand goes away. I stretch forward, feet planted, sniffing. Too close. I back up. Tense, watching.\n “My, you are a skittish one. But I can tell you’re hungry. Here, how about this?”\n Something is on the ground. Milk smell is strong. In my belly, hunger roars. Food, close by. Crouch. Step forward. Milk smell fills my nose. Another step.\n Stop. Where is human? Will she fight me for this milk?\n No. She’s backed away, sits on steps. Watches. I watch back. Want to taste the milk. She stays still, doesn’t move.\n “Go ahead, kitty.” Soft sounds, quiet sounds.\n One paw forward. Stop. Look up. She sits and watches. I step, then again. I taste the milk. Good. Hunger wants more, wants it all. I drink, milk good and wet on my tongue. Stop. Look. Human sits. My milk. Mine. I drink it all, lick up each drop.\n “Gone already? Poor thing. You must be starving. I’ll get you some more.”\n Hand reaches. My food! Mine! I want to scratch, bite. Protect my food. Mine. But soft sounds continue, soothing. Food in my belly feels good. No scratching. No biting. Milk dish gone. I lick my muzzle. I sit and groom.\n “Here you go.” Good smell. Milk again. Mine. I lap fast, drinking goodness.\n A touch on my head.\n No! I jump back. Spit. Hiss. No touching!\n “All right, all right. I guess you don’t like to be petted. I’ll just watch you drink your milk.”\n Human backs off, sits. Milk smells good. I come forward, drink. No more touches. Just noises. Quiet, nice. “I wish I could keep you. But I don’t think you’d like living in an apartment. I’ll leave some milk out for you, though. Here, on the back porch. And an old pillow you can use for a bed. Maybe I’ll see you in the morning.”\n Milk dish empty. Goes away. Comes back full. Human goes inside, light goes off. Darkness. Milk. Full belly. Warm.\n I clean my fur, licking all over. Warm. Full. Clean.\n I find a soft place and curl up to sleep.\n THAT NIGHT, I DREAMED OF RUNNING HARD ON FOUR PAWS down dark alleyways. I dreamed of fighting, of eating, of watching small creatures—birds, mice—and then pouncing. Eventually, the dream changed. A big gray tomcat, stinking of piss and musk, challenged me. We fought; he tore my leg. As the pain grew, another cat attacked. Then another, and still another. They bit me all over, tearing my flesh, ripping out my sleek fur in bloody clumps. Pain raked my body and twisted my limbs. My body swelled and stretched.\n Energy blasted out.\n I was awake. It was dark—no, dim. I could see my hands clasping each other inches from my face. Was it twilight? Dawn, maybe. I remembered darkness, but was that experience or dream? My body tried to curl itself on a pillow, but mostly I lay on rough wood planks. I sat up and tried to figure out where I was.\n “How . . . how did you do that?”\n The voice—a woman’s—made me jump. I picked up the pillow I’d been sleeping on and held it in front of my bare torso while I looked around to see who’d spoken.\n I was on the back porch of a triple-decker. A woman stood at the door, watching me with wide eyes. She had short hair, like mine, and she wore a blue bathrobe over striped pajamas. One of her hands clutched the doorframe; the other gripped a saucer. Behind her was a brightly lit, warm-looking kitchen.\n “You, um, must be cold,” she said. She set the saucer on a counter behind her and unbelted her robe. “Here.” She handed it to me.\n “Thanks.” I took the robe and managed to get it around me while still clutching the pillow to my front. Clothes never survive a shift. You’d think that after all these years I’d be used to returning to my human form without a stitch of clothing, but there was something inherently awkward about making naked conversation with a stranger. Especially a stranger who’d just witnessed an ordinary-looking cat transform into a person.\n I set the pillow on the porch floor and stood, pulling the belt tight around my waist. “Thanks,” I repeated, trying to work some cat hair off my tongue without being obvious about it. I let her question of “how?” hang unanswered between us. There wasn’t any easy way to explain. Instead, I offered a weak smile as my mind tried to sort out all the images and impressions that crowded it. The SWAT raid. Dead bodies. Pryce. Limbo. More dead bodies. Shifting. Running. Hunger. Fighting. Milk and warmth.\n It was the dead bodies that haunted me.\n I had to call Kane, find out what was happening. But Daniel’s cell phone was long gone. I hadn’t had it in Limbo, and it sure as hell wouldn’t have survived the energy blasts of my shifts.\n “Can I use your phone?” I asked. If that went well, maybe I’d push my luck and borrow some clothes.\n “I thought you were a cat.” She twisted around to see the saucer of milk on the counter.\n “I was. I’m a shapeshifter.” Something about this woman was familiar. I raised my head and sniffed the air between us. Her scent made me feel warm and safe. “You fed me.”\n “We get a lot of strays around here. Usually they run away from me.” She made no move from where she stood. “I’m Kaysi.”\n “Hi, Kaysi.” I hesitated. Should I tell her my name? Pryce had said the police believed I’d attacked the SWAT team. If he was telling the truth—a big if—my name and picture would be all over the news.\n Kaysi made my decision for me. “You’re Vicky, aren’t you? I read about you in the paper. It said Vicky somebody, a shapeshifter.”\n Uh-oh. “Listen, Kaysi, I don’t want to bother you. If I could just use your phone to make one quick call, maybe borrow some clothes, I’ll be out of here in five minutes. It’ll be like you never saw me.”\n “Never saw you? How could I forget seeing . . . that?” Lost for words, she gestured at the spot on her back porch where a blast of energy had transformed a sleeping cat into a naked, disoriented woman.\n Somewhere down the street, a car engine started. Kaysi leaned out and looked around. Then she beckoned to me. “You’d better come inside.”\n THE LINOLEUM FLOOR OF KAYSI’S KITCHEN FELT TOASTY under my bare feet. Cream-colored walls glowed warmly in the overhead light. A clock told me it was a little before seven. Beside the clock hung a calendar that showed three kittens snuggling in a basket. As I looked around, I could see that Kaysi was a big-time cat lover. The mug she held, the dishtowel beside the sink, the pot holders over the stove, the placemats on the kitchen table—all were adorned with pictures of cats. Cats sleeping, cats frolicking, cats sitting and staring through half-closed eyes. No wonder she’d been kind enough to feed a twitchy stray.\n A newspaper lay on the table, open to a two-page spread whose headline shouted “Massacre in East Boston.” It showed a picture of the factory, surrounded by police cars. And there was a photo of me—the one from my paranormal ID card. It looked like a mug shot.\n “You were there.” Kaysi gestured toward the paper.\n I nodded. What could I say?\n “The story says the police are looking for you. It says you’re armed and dangerous.”\n “Well, at least you know I’m not armed.” I smiled my goofiest grin, hoping it made me look harmless, and turned the bathrobe pockets inside out. “Kaysi, I won’t lie to you. I was there supporting the SWAT team. Something went wrong. I blacked out, and I don’t know what happened after that.”\n “I don’t think you’re dangerous. You know why?” She stretched out her hands, showing backs crisscrossed with thin white scars. “We have lots of wild cats in this neighborhood. I like to help them. They eat the food I leave out, but whenever I try to get near them, they do this. They scratch and bite.” She turned her hands back and forth, examining them, then picked up her mug. “The cat I fed last night didn’t do that. She spit and backed away, but she didn’t scratch or bite me, not even a nip. She was wary, but she wasn’t mean.” Kaysi sipped, her expression thoughtful. “Animals are purer than people. They don’t lie or try to hide who they are. And that cat was you. I don’t believe you’d hurt anyone.”\n I didn’t know how to reply. Her clear blue eyes were trusting, sure.\n “Anyway,” Kaysi said, setting her empty mug in the sink, “you can stay here as long as you like. I won’t tell anyone. You must be hungry.” She glanced at the saucer that still sat on the counter. “Would you like a, um, a glass of milk?”\n “I’d love some coffee if you can spare it. Black, please.”\n A tiger kitten chased an unraveling ball of string around the mug Kaysi handed me. The coffee inside was strong and hot. She pointed out the phone and said she’d go look for some clothes that might fit me. What she meant was that she was giving me privacy to make my call.\n “I won’t be more than a couple of minutes,” I said.\n “Take your time.” She disappeared down a hallway. A door closed.\n Kane has a special prepaid phone, registered under a false name, for emergencies—like now. I pressed *67 to mask Kaysi’s number and called the emergency phone. As I dialed, I thought about what Kaysi had said. Her simple love of animals had convinced her I wasn’t a killer. I only wished I could be as certain.\n KANE PICKED UP ON THE FIRST RING. “ARE YOU SAFE?”\n “For now.”\n “Good. Don’t tell me where you are.” He didn’t have to explain why. If he didn’t know where I was, he wouldn’t have to lie about it to the cops. “Vicky, that botched raid is all over the news. What happened?”\n “I don’t know. I was in the van, listening over the two-way radio. Something went wrong . . . there was a scream. So I went in. But when I reached the fighting . . . I blacked out. When I came to, it looked like a slaughterhouse. Kane, the whole team was dead.” \n","sourceLink":"https://allnovel.net/hellhound-deadtown-5/page-52.html","bookId":2613,"book":{"id":2613,"title":"Hellhound (Deadtown #5)","description":"Storyline: \n Hellhound (Deadtown #5) \n They call it Deadtown: the city’s quarantined section for its inhuman and undead residents. Most humans stay far from its borders—but Victory Vaughn, Boston’s only professional demon slayer, isn’t exactly human… \n Boston’s zombies have suddenly become inexplicably violent—horror movie-style—resulting in a catastrophic all-out battle against humans. More troubling to Vicky is that she’s had dreams and visions of herself fighting alongside the demons. At least, she hopes they’re just visions—otherwise, that puts her on the front lines of the wrong side of the war. \n Vicky’s not surprised to discover that Pryce, her demi-demon cousin and loathed adversary, is behind the outbreak of the zombie plague, having formed an unholy pact with the Old Ones. Now, as the violence escalates and alliances shift, Vicky knows she’s the only one who can stop the plague. Unless the pack of hellhounds on her trail finds her first.\n \n","cover":"https://allnovel.net/images/hellhound-deadtown-5.jpg","author":"Nancy Holzner","type":"Horror","source":"allnovel","link":"https://allnovel.net/hellhound-deadtown-5.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:40:19 PM"}}
