{"id":74858,"no":12,"title":"Page 12","content":"Chapter 11\\n\\n Beau\\n\\n The moment I heard Ashton’s car crank, I threw the phone in my hand against the wall. It fell to the floor in pieces. I knew how it felt. Shattered. Broken. Destroyed. I’d been so sure she loved me. Even though she’d never uttered the words, I’d been so damn sure she wanted me, not my perfect, polished cousin. Never before in my life had I hated Sawyer, but right now, I hated him. I hated him for taking her. I hated him for controlling her. I hated him because he had her love.\\n\\n A roar filled the room and I barely recognized the angry snarl coming from my mouth. I wouldn’t be able to stay here. How could I watch them? How could I go to school and see him touch her? Hold her hand? Oh God, kiss her mouth! Did she care she’d just destroyed me? Had this all been a little game to her? Pass the time with the bad boy while the prince is away?\\n\\n DAMMIT, ASH.\\n\\n My mangled cell phone began ringing. Panicked it could be her, that she could’ve changed her mind, I ran over to it and fumbled with the battery, holding it in place while I pressed the accept button several times before it worked. The screen was black.\\n\\n “Hello.”\\n\\n “Guess who’s home early and ready to get your lazy ass in the gym pumping weights first thing in the morning?” Sawyer’s chipper voice came over the line and I fought the instinct to throw the phone against the wall again. What did I say to him? How did I begin to act like I was happy he was home?\\n\\n “Beau? You there?”\\n\\n “Yeah, I’m here.”\\n\\n “What is it with everyone? Could someone act happy about me coming home early?”\\n\\n I tampered down the small ray of hope trying to break into my thoughts. Surely he didn’t mean Ashton. “I’m sure your . . . Ash is happy you’re back,” I said. I wondered if he noticed I’d stopped myself from calling her his girlfriend. I wasn’t able to accept that anymore. He let out a frustrated sigh.\\n\\n “No, she seemed distracted. I just found out about her Grana. Man, I hate I wasn’t here. I guess she’s upset about that and I’m being selfish wishing she’d acted happy about seeing me. Have you seen her? Is she doing okay?”\\n\\n I had to be careful. She’d made her decision. Didn’t mean I couldn’t change her mind but I had to be careful. I had to protect her.\\n\\n “She’s upset. We’ve bumped into each other some. She helped me and Nicole out one night when I’d had too much to drink. Gave us a ride home. I also went to the church last night to pay my respects and all. I remember her Grana. She was good to me.”\\n\\n Sawyer sighed. “Thanks, man. I appreciate you going. I know it meant a lot to Ash.” I slammed my fist against the wall. I didn’t need him to thank me. I hadn’t done it for him.\\n\\n “Well, I’ll see ya at the funeral then?”\\n\\n No, I wasn’t ready to see them together. Watching Sawyer touch her might send me into a blind rage at her Grana’s funeral.\\n\\n “I got some stuff to do. I went last night but you’re back and I did my duty.”\\n\\n “Okay. Well, thanks again. I’m not kidding about the weight room tomorrow morning. I need to get your beer gut in shape.”\\n\\n “Sure, see ya then.”\\n\\n I dropped the broken pieces of my phone onto the coffee table. I needed to make a plan. I needed to think about this. Had I screwed up by letting her go? Had she wanted me to stop her? Ashton Gray was going to drive me mad.\\n\\n Ashton\\n\\n “You told Sawyer he was welcome to come eat with us tonight, didn’t you?”\\n\\n Dad stood at the door of my bedroom. I’d come home from the funeral and went straight to the shower so I could cry in private. Once the water ran cold, I’d dried up my tears and forced myself to get a grip. What would Grana have told me to do? Would she have told me to go with my heart? Or would she have seen the wisdom in my decision? I thought back to the way Beau had reacted to my words. What had I expected him to do? Fall at my feet in tears? I should be happy he’d handled it so well. I didn’t have hurting him to add to my guilt.\\n\\n “Yes. He’ll be here at six.” I sat up from my reclined position on my bed. Dad seemed pleased with that answer.\\n\\n “You’ve been so closed off from the world this summer. I’m really relieved Sawyer’s home.”\\n\\n I forced a smile so Dad wouldn’t guess anything was amiss. He walked away and closed my door behind him. I laid back on the bed and stared at the ceiling, wondering how I was going to face Sawyer with the guilt of what I’d done weighing on me so heavily.\\n\\n I loved Sawyer. My actions didn’t appear as if I did, but I did love him. The problem was, I wasn’t in love with him. I hadn’t realized there were different kinds of love you could feel for a boy. Sawyer was everything I respected. He was sweet and caring. I never had to worry he would leave me or hurt me. He was impossible not to love. Unfortunately, he had a girlfriend who was a big huge fake. He deserved to know what a fake I was, but how did I go about explaining to him I put on a show for him, for my parents, for the whole dang town? I couldn’t tell Sawyer anything. Word got around fast in a small town. My mother would be devastated. My dad would be furious. I’d hurt them both and for what? A guy who didn’t even care enough to respond to me when I broke things off with him? My heart had been breaking and he had been texting someone. Probably Nicole. The thought of Beau with Nicole made me nauseous.\\n\\n Picking up my phone for the thousandth time since I’d left Beau’s, I checked to see if he had texted me. It was pointless. He wasn’t going to. I’d seen the look in his eyes. He hadn’t fought me. It didn’t make sense. Before I’d pushed him away he was ready to tell Sawyer himself, and he knew how Sawyer was going to react. Had he just been trying to ease my guilt? Had I just given him an easy out? Had he realized he wasn’t really in love with me but the idea of me? Tears welled up in my eyes. Pulling my knees up to my chest I buried my head against them and cried silently. Nothing would ever be the same. I’d ruined myself. My heart would always belong to someone who didn’t want it and Sawyer would be wasting his love on someone who didn’t deserve it. He deserved so much more than a girlfriend who wanted someone else.\\n\\n The doorbell rang and I sat there listening as Sawyer came inside and talked to my father. Wiping the tears from my eyes, I headed to the bathroom to clean myself up before I went downstairs to greet him and pretend like I was okay.\\n\\n “Here, let me clean this up. You haven’t seen Sawyer in weeks. Go on ahead and go. I know you want to spend some time together.” This wasn’t my dad. He normally wanted us to stay right here under them or at least out on the front porch. Rarely did he encourage us to go off and spend time together. Apparently he was more worried about Beau than I’d thought. But then he had reasons to be worried about Beau. Maybe it was parents’ intuition.\\n\\n Sawyer stood up with his plate and cup in hand, always the gentleman. Not only does he clean up his spot at the table, he also loads his used dishes in the sink. Samantha Vincent had trained her son well. Or at least that was what Mom always said.\\n\\n “Thank you both for dinner. It was delicious.” Sawyer smiled at both my parents then turned to me and winked before taking his dishes to the dishwasher. He wasn’t as tall as Beau. I’d never really paid attention to that before. They had so many similarities in their appearance but then they were so different. Sawyer’s dark brown hair was long enough that it brushed his collar and curled along the ends. His lips weren’t as full as Beau’s but his shoulders were broader. They’d always joked that he had the stronger arm when it came to throwing a football but Beau had the stronger arm when it came to throwing a punch. I glanced down at Mom who was smiling the silly happy smile she gets when Sawyer’s around. The guilt in my chest grew. She would never smile over my being with Beau.\\n\\n “Such a good boy,” she said.\\n\\n I forced my hundredth smile of the night and nodded. Sawyer walked up beside me and took my hand.\\n\\n “I’ll have her home by eleven, sir,” he said, looking at my dad.\\n\\n “Oh don’t worry about the time. I know you two have a lot of catching up to do.”\\n\\n Sawyer appeared as surprised as me. If I didn’t know better I’d think Dad was popping some of Mom’s anxiety pills.\\n\\n The moment Sawyer closed the door to his shiny one-year-old Dodge truck he reached over and took my hand to pull me up beside him. There was no stick shift in the way in Sawyer’s truck.\\n\\n “God, I’ve missed you,” he whispered before grabbing my face and kissing me softly on the mouth. It was just as nice as I’d remembered. Sweet and gentle and very comfortable. I reached up and threaded my fingers through his thick hair and tried out some of my new kissing moves on him to see if I could get the earth-shattering sensation Beau’s kisses always produced. Sawyer made a sound that reminded me of a growl and dropped his hands to my waist to pull me closer to him. But still, it just remained . . . nice.\\n\\n Finally he pulled back, breathing hard, and rested his forehead on mine.\\n\\n “That was . . . wow.” I smiled, wishing I could agree. “If I’d been forced to stay away from you another week I think I’d have lost it. I love my family but I was having serious Ashton withdrawals.” The guilt inside twisted cruelly. Tears stung my eyes and I laid my head on his chest. He was just so good.\\n\\n “Ash, something is wrong. I could see it inside at the table. You looked so sad and your parents are acting differently.”\\n\\n “Losing Grana was a shock. A hard blow to all of us. I think Dad might have slipped one or two of Mom’s anxiety meds because I’ll agree he’s acting odd. But I’m just dealing. I’m sorry I’m so depressing and you just got home.”\\n\\n He squeezed my shoulder. “It’s okay. I understand.”\\n\\n He backed out of the drive and headed toward his house. We were going down to the hole. I didn’t have to ask. It was secluded and safe. He’d probably call his dad and let him know we were back there. Just to make sure all of his bases were covered. Parking wasn’t something we would ever be caught doing. It would sully his reputation and we couldn’t have that. I could hear the mocking tone in my thoughts and I closed my eyes to silently scold myself. The bad girl might not go back in her cage without a fight this time.\\n\\n The truck jostled us around as we made our way slowly over the unpaved path. There was no light out at the hole. The lights from the truck lit up the dirt road and different small animals scurried out of our way. Once we broke through the tree-covered path the moonlight shimmered on the water up ahead and Sawyer came to a stop. His hand reached up and shut off the engine before he tilted his head down to gaze at me.\\n\\n “I’m sorry I wasn’t here, Ash. Losing your Grana like that had to be awful. Are you mad at me for being away?” Not what I needed—Sawyer feeling guilty when he had absolutely no reason to. It made me feel like pond scum.\\n\\n “Of course I’m not mad at you, Sawyer. I wish you could have returned to a happy, cheerful girlfriend. You don’t deserve this.”\\n\\n He patted my knee and I studied his hand. It wasn’t as big as Beau’s or as tanned.\\n\\n “It’s okay. I know the old Ash will show up again once you finish mourning.” He paused and I glanced up at him. A small frown line appeared on his forehead. Something was bothering him. I’d known him most of my life and I knew that look.\\n\\n “A few of the ladies from church mentioned Beau holding your hand at the wake.” He let out a forced chuckle. “It bothered them and they thought I should know.”\\n\\n Instead of panicking I got angry. Stupid busybodies. This was exactly what I’d known would happen. Everyone would jump on the Sawyer bandwagon and start bad-mouthing Beau. Like Beau needed them to dislike him anymore than they already did. I wanted to howl in frustration. Instead I took a calming breath and counted backwards from ten in my head. Every once in a while the counting thing took the edge off. When I was sure I could respond without sounding livid I said the first thing that came to my mind.\\n\\n “When we were kids Beau was just as close to me as you were. He sat on my Grana’s porch just as many times as you did. He ate my Grana’s cookies and played Uno with her just like you. She was a part of his childhood. One of the few bright spots. He knew you were gone and he knew I would be devastated. So he came to the church and asked me if I’d gone up to see her. I admitted I hadn’t and wasn’t sure I could. He then encouraged me to go say my goodbyes and said he’d walk with me. I guess he saw the fear in my eyes and he reached down and took my hand. Then we walked together to the front of the church. He let my hand go and stepped back while I had my last few moments of closure with Grana. Then he took my hand and walked me out of the church because, like you, he knows when I’m about to lose it. And he knows the little girl inside enough to know I didn’t want to break down in front of everyone and have them hovering around me.”\\n\\n We sat in silence for a few minutes. I’d heard the anger in my tone. No doubt he had too.\\n\\n “Remind me to thank him for watching out for my girl. I owe him one. It’s about time you two realized you were best friends for most of your life. I always felt a little guilty it had ended.”\\n\\n There he went again talking about how he felt guilty. I just wanted to go home and bury myself under the covers. This was too much to deal with right now. The guilt, the anger, the frustration, the pain—it was all going to drive me insane. \\n\\n","sourceLink":"https://allnovel.net/the-vincent-boys-the-vincent-boys-1/page-12.html","bookId":1996,"book":{"id":1996,"title":"The Vincent Boys (The Vincent Boys #1)","description":"Storyline: The Vincent Boys (The Vincent Boys #1) \\n Ashton is getting tired of being good, of impressing her parents and playing ideal girlfriend to Sawyer Vincent. Sawyer is perfect, a regular Prince Charming, but when he leaves town for the summer, it’s his cousin Beau who catches Ashton’s eye. Beau is the sexiest guy she’s ever seen, and even though he’s dangerous, Ashton is drawn to him. \\n Beau loves his cousin like a brother, so the last thing he wants to do is make a move on Sawyer’s girl. Ashton is off-limits, absolutely. That’s why he does his best to keep his distance, even though he’s been in love with her forever. When Ashton wants to rekindle their childhood friendship in Sawyer’s absence, Beau knows he should say no. \\n Ashton and Beau don’t want to hurt Sawyer. But the more they try to stay away from each other, the more intense their urges become. It’s getting way too hard to resist....\\n","cover":"https://allnovel.net/images/the-vincent-boys-the-vincent-boys-1.jpg","author":"Abbi Glines","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-vincent-boys-the-vincent-boys-1.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 10:32:37 AM"}}
