{"id":74859,"no":13,"title":"Page 13","content":"Chapter 12\n We walked toward the bonfire. I’d decided against telling Sawyer about Ryan’s stupid drunken episode last week. It was over now and it hadn’t been so bad after all. Of course Ryan touching me was gross but I’d ended the evening with Beau playing pool. The memory of him grinning across the pool table at me as I set up my shot caused my heart to ache. I missed him so much.\n As we made our way into the clearing several people stopped Sawyer and welcomed him home. Everyone wanted to talk football. I smiled and appeared to be waiting patiently while scanning the crowd for Beau. I hadn’t seen him since I’d walked out of his trailer without a goodbye. Every night since then I’d laid in my bed holding my phone, willing him to call or at least text me. But he hadn’t. The idea that things would go back to the way they had been before terrified me. I couldn’t be with him the way I wanted but I didn’t want to lose everything. My anger at the way he’d dismissed me had dimmed. Now I just wanted to see him. Talk to him. See him smile at me.\n “Come on, I see Beau and Nicole over there,” Sawyer said as he slipped his hand behind my back and led me over to a small group of football players and their girlfriends. The group was sitting on the tailgate of a few trucks and three old tractor tires they’d hauled out here years ago for seating. A small fire crackled in the middle of the group, putting a warm glow on all their faces.\n “Sawyer. The man has returned,” Ethan Payne said, grinning from his spot on the tailgate of his truck. Brooke Milery snuggled up against him and lifted a hand to wiggle her bright pink nails at us in greeting. They’d broken up last spring but apparently they were back together or heading in that direction. Her legs were draped over his lap and his hand was tucked snugly between her thighs.\n “Come talk to us. Tell us how you’re going to lead us to State,” said Toby Horn, who I knew played cornerback because he’d intercepted a pass at the state championship game last year then ran it in by jumping over two tackles before making a touchdown to win us the game. After the game his status level had risen. Which would explain why the head cheerleader, Kayla Jenkins, was sitting in his lap. She’d been determined to get Beau’s attention last year. It appeared as if she had moved on.\n “I’m not the one who nailed the win at the last state game,” Sawyer reminded him as he leaned against the truck and pulled me back against him.\n “You know that’s right. I think we need to make sure coach gives our star corner some more wide receiver action,” Ethan piped in.\n “Agreed,” Sawyer replied.\n They continued to talk football but I couldn’t pay attention. Beau was directly across from me. It was taking all my will power not to look at him. I smiled and tried not to appear stiff, although I felt uncomfortable with Sawyer’s arms wrapped around my waist. Sawyer leaned down and kissed my temple casually while he talked. I heard something about a blitz and upping the practice time. But all my focus was on not staring at Beau.\n “Earth to Ashton,” Kayla’s voice broke into my thoughts. I jerked my head up and stared directly at her. She seemed to be waiting on me to reply.\n “Um, I didn’t hear you, sorry,” I said, feeling the blush creep up my neck. She giggled and twirled a long red curl around her finger.\n “I asked you if you wanted to be one of the spirit girls this year. Maybe this year our quarterback will actually accept a spirit girl if he gets to choose you.”\n Spirit girls were girls the cheerleaders added to their numbers so every football player would have a girl to make him goodies on game day. Off the record, spirit girls also happened to help their player with his homework, order him a pizza to be delivered to the school for lunch, and some unofficial things like back massages and other “hands on” activities. The starters always picked their spirit girl then the rest of the players went in a hat and the spirit girls drew names.\n “Um, yes, of course,” I replied.\n Sawyer chuckled. “Then Ash is mine.”\n Kayla smiled but she seemed more annoyed than amused. “We’re assigning each girl two players this year. So you’ll have one more boy to take care of too. The boys haven’t picked yet but I doubt anyone else chooses you since you’re Sawyer’s. You’ll have to draw a name.”\n Nicole laughed and I instantly tensed, preparing for her rude comment. Without thinking I glanced over toward the sound of her laughter and immediately wished I hadn’t. Beau was sitting on the ground leaning up against a tractor tire with his legs bent and wide open. Right in between his muscular jean-clad legs sat Nicole. She had one arm wrapped around his neck and the other one resting on his knee. It would have been easier if she’d just stood up and punched me in the gut. Maybe whacked me around a few times. At the moment the pain would be a welcome distraction to the tightness taking over my chest.\n Beau’s eyes locked on mine. After everything we’d been through together I hoped I would see some small shred of . . . oh . . . I don’t know. Just something. But he didn’t look phased by me at all. It was as if those two weeks never happened. I swallowed the lump in my throat.\n “You know, Ashton, I’ve always wondered what it is you do so right that keeps Sawyer on such a tight leash. I mean you’ve got to be hiding some hidden talent from us.” Nicole’s words were slurred but they were loud and I was positive everyone heard her. Even people not in the little group surrounding us. My stomach turned and twisted. God, I hoped I didn’t get sick.\n “It isn’t one thing, Nic, she’s perfect at everything she does.” Sawyer’s voice sounded as calm and nice as always.\n Nicole snarled, “Doubt that. You just forgot what a good time feels like.”\n Sawyer tensed, his arms tightened around me as if he was protecting me. I’d always wondered what Sawyer had done with Nicole in the seventh grade. At times I’d been jealous when she looked at him as if she knew him in ways I didn’t. But then he would be so careful not to do anything other than kiss me I figured he had to be as chaste as I was. “Was” being the important word here.\n “Shut up, Nicole.” The words hadn’t been Sawyer’s. Beau’s deeper voice snapped out the order. Nicole giggled again and leaned forward to shake her braless boobs at Sawyer.\n “You remember how much fun it was, don’t ya Saw. We had lots of fun,” she slurred.\n “Shut the hell up, Nicole,” Beau growled angrily, pushing her away from him. I should be hurt that my boyfriend wasn’t as inexperienced as I’d thought. The fact he’d been unable to keep his hands off Nicole and didn’t have any problem not touching me should bother me. It didn’t. All I felt was relief at seeing Beau pushing Nicole off of him.\n “What’s the matter? You don’t like hearing about how your cousin had me first? Hmmmm . . . don’t be jealous, baby. You’re the only one who’s getting in my pants tonight.” Nicole attempted to purr but her slurring kind of made it sound more like she was moaning.\n Sawyer moved from behind me and took my arm to pull me away. I felt Beau’s eyes on me and I glanced back at him. In that moment I could see the Beau I’d thought loved me. His eyes said he was sorry as he pushed Nicole away absently. Not once did he break eye contact with me as Sawyer led me into the pecan orchard. There was pain in those eyes that haunted my dreams. I gave him a sad smile before turning to follow my boyfriend into the shadows of the trees. The light from the fire disappeared as did the noise. The moon managed to peek through the branches, shedding enough light to keep us from walking into a tree or tripping over a fallen branch.\n “Ash, I’m so sorry,” Sawyer said, pulling me into his arms once we got to his truck. “She’s a vile human being and why I ever dated her I don’t know. I wish Beau would get rid of her.” He kissed the top of my head like I was a child he needed to comfort. I didn’t feel like crying. But I wanted to know why. For so long I thought he was without sin and I was the one who needed to be tamed, but that hadn’t been true.\n “Did you have sex with her, Sawyer?” I asked, staring up at him. The guilty expression on his face answered my question for me. He cupped the side of my face with his hand.\n “Ash, it was a long time ago. She was my first girlfriend and although she was pretty wild for a thirteen-year-old we were still young. Of course we didn’t have sex,” he said.\n “You obviously did something. You hardly touch me yet it sounds like you did a lot more than kissing with Nicole.”\n Sawyer frowned. He hadn’t been expecting me to voice my feelings. I normally reassured him when he was upset. I never wanted to ruffle his feathers. Make life easy for Sawyer had been my mantra for so long. Well, that part of this charade I was living was long gone. No more patting him on the back.\n “Ashton, I made some bad decisions with Nicole. She pushed me to do some things. I gave in. But you, you’re different. You’re good. It isn’t about sex with us.”\n How could you be in love with someone and not want sex? We were human. He was a teenage boy, for crying out loud. He had hormones.\n “Are you not attracted to me that way? I mean I know I don’t have Nicole’s body and I won’t be winning any beauty contest, but if you love me then I would think sex with me would appeal to you.”\n Three weeks ago I wouldn’t have had the nerve to say these things. Being with Beau had changed me so much.\n Sawyer’s expression was somewhere between shock and confusion.\n “Ashton, I respect you. You deserve respect. You’re everything I ever wanted in a girl. You’re not just some girl I’m filling my high school years with. I intend to marry you one day.”\n Marry him? What? Really? Oh GOD.\n He smiled at the shocked expression on my face. “I love you, Ashton. I intend to keep you forever. I’m very attracted to you. I just don’t want my future wife to lose her virginity in the bed of a truck.”\n Beau\n This was bullshit. She wasn’t happy. I could see it all over her face. Hell, she’d been so damn stiff while Sawyer stood there holding her it was impossible not to notice. It had also driven me mad. I hated seeing her so uncomfortable. Then Nicole had opened her stupid mouth and upset her more. I wanted to believe that she deserved all this but I couldn’t. Something was wrong. I’d been wrong not to question her when she’d come to me. My stupid pride had let her walk away. I’d fucked that up good.\n “Stop being so mean,” Nicole said, leaning on my arm in an attempt to keep from falling on her face. I grabbed her by the shoulders and pushed her down to sit on the tire behind us. She couldn’t stand up without support and I didn’t want to feel her hands on me. The look in Ash’s eyes when her gaze had met mine had made every place Nicole touched feel cheap and dirty. I wanted her away from me.\n “What’s going on with you and Ash?” Kayla’s question snapped me out of my inner turmoil and I shifted my gaze to meet her curious one. Damn. Leave it to a female to see what no one else notices.\n “Nothing is going on with me and Ash.”\n She raised an eyebrow in disbelief. “Hmmm, whatever, Beau,” she replied before lifting her red solo cup to her lips. The girl had always been nosy.\n “Can you get Nic home?” I asked Ethan, stepping far enough away that she couldn’t paw at me.\n Ethan shrugged. “Yeah, I guess. If she comes on to me are you gonna kick my ass tomorrow?”\n “Nah, enjoy yourself.”\n Ethan smirked and shook his head. I didn’t wait around to see what other stupid comments came out of his mouth.\n I headed for my truck. Staying here was impossible. I’d only come because I’d known she would be here. Wanting to see her had been my sole purpose for putting up with Nicole and Sawyer. I missed her. I missed her so fucking much. After the sad smile and hopeful look in her eyes as she walked away I had a new sense of hope that maybe this wasn’t over. Maybe I still had a chance. \n","sourceLink":"https://allnovel.net/the-vincent-boys-the-vincent-boys-1/page-13.html","bookId":1996,"book":{"id":1996,"title":"The Vincent Boys (The Vincent Boys #1)","description":"Storyline: \n The Vincent Boys (The Vincent Boys #1) \n Ashton is getting tired of being good, of impressing her parents and playing ideal girlfriend to Sawyer Vincent. Sawyer is perfect, a regular Prince Charming, but when he leaves town for the summer, it’s his cousin Beau who catches Ashton’s eye. Beau is the sexiest guy she’s ever seen, and even though he’s dangerous, Ashton is drawn to him. \n Beau loves his cousin like a brother, so the last thing he wants to do is make a move on Sawyer’s girl. Ashton is off-limits, absolutely. That’s why he does his best to keep his distance, even though he’s been in love with her forever. When Ashton wants to rekindle their childhood friendship in Sawyer’s absence, Beau knows he should say no. \n Ashton and Beau don’t want to hurt Sawyer. But the more they try to stay away from each other, the more intense their urges become. It’s getting way too hard to resist....\n \n","cover":"https://allnovel.net/images/the-vincent-boys-the-vincent-boys-1.jpg","author":"Abbi Glines","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-vincent-boys-the-vincent-boys-1.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 10:32:37 AM"}}
