{"id":976,"no":2,"title":"Part 1 Introduction","content":"You are about to have an extraordinary experience. You are about to have a conversation with God. Yes, yes. I know.. .that’s not possible. You probably think (or have been taught) that’s not possible. One can talk to God, sure, but not with God. I mean, God is not going to talk back, right? At least not in the form of a regular, everyday kind of conversation!\\n\\n That’s what I thought, too. Then this book happened to me. And I mean that literally. This book was not written by me, it happened to me. And in your reading of it, it will happen to you, for we are all led to the truth for which we are ready.\\n\\n My life would probably be much easier if I had kept all of this quiet. Yet that wasn’t the reason it happened to me. And whatever inconveniences the book may cause me (such as being called a blasphemer, a fraud, a hypocrite for not having lived these truths in the past, or—perhaps worse—a holy man), it is not possible for me to stop the process now. Nor do I wish to. I have had my chances to step away from this whole thing, and I haven’t taken them. I’ve decided to stick with what my instincts are telling me, rather than what much of the world will tell me, about the material here.\\n\\n Those instincts say this book is not nonsense, the overwork-ing of a frustrated spiritual imagination, or simply the self-justification of a man seeking vindication from a life misled. Oh, I’ve thought of all of those things—every one of them. So I gave this material to a few people to read while it was still in manuscript form. They were moved. And they cried. And they laughed for the joy and the humor in it. And their lives, they said, changed. They were transfixed. They were empowered.\\n\\n Many said they were transformed.\\n\\n That’s when I knew this book was for everyone, and that it had to be published; for it is a wonderful gift to all those who truly want answers and who truly care about the questions; for all those who have embarked upon quests for truth with sincerity of heart, longing of soul, and openness of mind. And that’s pretty much all of us.\\n\\n This book addresses most, if not all, of the questions we have ever asked about life and love, purpose and function, people and relationships, good and evil, guilt and sin, forgiveness and redemption, the path to God and the road to hell ...everything. It directly discusses sex, power, money, children, marriage, divorce, life work, health, the hereafter, the before-now... everything. It explores war and peace, knowing and not knowing, giving and taking, joy and sorrow. It looks at the concrete and the abstract, the visible and the invisible, the truth and the untruth.\\n\\n You could say that this book is “God’s latest word on things,” although some people might have a little trouble with that, particularly if they think that God stopped talking 2,000 years ago or that, if God has continued communicating, it’s been only with holy men, medicine women, or someone who has been meditating for 30 years, or good for 20, or at least half-decent for 10 (none of which categories includes me).\\n\\n The truth is, God talks to everybody. The good and the bad. The saint and the scoundrel. And certainly all of us in between. Take you, for instance. God has come to you many ways in your life, and this is another of them. How many times have you heard the old axiom: When the student is ready, the teacher will appear? This book is our teacher.\\n\\n Shortly after this material began happening to me, I knew that I was talking with God. Directly, personally. Irrefutably. And that God was responding to my questions in direct pro-portion to my ability to comprehend. That is, I was being answered in ways, and with language, that God knew I would understand. This accounts for much of the colloquial style of the writing and the occasional references to material I’d gath-ered from other sources and prior experiences in my life. I know now that everything that has ever come to me in my life has come to me from God, and it was now being drawn together, pulled together, in a magnificent, complete response to every question I ever had.\\n\\n And somewhere along the way I realized a book was being produced—a book intended for publication. Indeed, I was told specifically during the latter part of the dialogue (in February 1993) that three books would actually be produced, and that:\\n\\n \\n\\n 1. The first would deal mainly with personal topics, focusing on an individual’s life challenges and opportunities.\\n\\n 2. The second would deal with more global topics of geo-political and metaphysical life on the planet, and the challenges now facing the world.\\n\\n 3. The third would deal with universal truths of the highest order, and the challenges and opportunities of the soul.\\n\\n \\n\\n This is the first of those books, completed in February 1993. For clarity I should explain that, as I transcribed this dialogue by hand, I underlined or circled words and sentences which came to me with particular emphasis—as if God were booming them out—and these were later placed in italics by the typesetter.\\n\\n I need now to say that I am—having read and reread the wisdom contained here—deeply embarrassed by my own life, which has been marked by continued mistakes and misdeeds, some very shameful behaviors, and some choices and decisions which I’m certain others consider hurtful and unforgivable. Though I have profound remorse that it was through others’ pain, I am unspeakably grateful for all that I have learned, and found that I have still yet to learn, because of the people in my life. I apologize to everybody for the slowness of that learning. Yet I am encouraged by God to grant myself forgiveness for my failings and not to live in fear and guilt but to always keep trying—keep on trying—to live a grander vision.\\n\\n I know that’s what God wants for all of us.\\n\\n \\n\\n Neale Donald Walsch\\n\\n Christmas 1994\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/zongjiao/243/584.html","bookId":36,"book":{"id":36,"title":"与神对话 Conversations With God","description":"简介： Conversations with God (CwG) is a sequence of books written by Neale Donald Walsch, written as a dialogue in which Walsch asks questions and God answers.The first book of the Conversations with God series, Conversations with God, Book 1: An ...","cover":"https://cunovel.com/defaultCover.png","type":"Religious","link":"http://novel.tingroom.com/zongjiao/243","creation":"Aug 1, 2019 12:18:11 AM","modification":"Aug 1, 2019 12:18:11 AM"}}
