{"id":1004,"no":30,"title":"Part 2 Chapter 12","content":"That’s wonderful. What You said there is just wonderful. I wish the world could get that. I wish the world could under-stand, could believe. This book will help that. You are helping that. So you are playing a role, you are doing your part, in raising the Collective Consciousness. That is what all must do. Yes. Can we move to a new subject now? I think it’s important that we talk about this attitude—this idea of things—which You said a while back that You wanted to fairly present. The attitude to which I am referring is this attitude, held by many people, that the poor have been given enough; that we must stop taxing the rich—penalizing them, in effect, for working hard and “making it”—to provide even more for the poor. These people believe that the poor are poor basically be-cause they want to be. Many don’t even attempt to pull themselves up. They would rather suckle at the government teat than assume responsibility for themselves. There are many people who believe that redistribution of the wealth—sharing—is a socialistic evil. They cite the Com-munist Manifesto—”from each according to his ability, to each according to his need”—as evidence of the satanic origin of the idea of ensuring the basic human dignity of all through the efforts of everyone. These people believe in “every man for himself.” If they are told that this concept is cold and heartless, they take refuge in the statement that opportunity knocks at the door of everyone equally; they claim that no man operates under an inherent disadvantage; that if they could “make it,” everybody can—and if someone doesn’t, “it’s his own damn fault.” You feel that is an arrogant thought, rooted in ungratefulness. Yes. But what do You feel? I have no judgment in the matter. It is simply a thought. There is only one question of any relevance regarding this or any other thought. Does it serve you to hold that? In terms of Who You Are and Who You seek to Be, does that thought serve you? Looking at the world, that is the question people have to ask. Does it serve us to hold this thought? I observe this: There are people—indeed, entire groups of people—who have been born into what you call disadvantage. This is observably true. It is also true that at a very high metaphysical level, no one is “disadvantaged,” for each soul creates for itself the exact people, events, and circumstances needed to accomplish what It wishes to accomplish. You choose everything. Your parents. Your country of birth. All the circumstances surrounding your re-entry. Similarly, throughout the days and times of your life you continue to choose and to create people, events, and circumstances designed to bring you the exact, right, and perfect opportunities you now desire in order to know yourself as you truly are. In other words, no one is “disadvantaged,” given what the soul wishes to accomplish. For example, the soul may wish to work with a handicapped body or in a repressive society or under enormous political or economic constraints, in order to produce the condi-tions needed to accomplish what it has set out to do. So we see that people do face “disadvantages” in the physical sense, but that these are actually the right and perfect conditions metaphysically. As a practical matter, what does that mean to us? Should we offer help to the “disadvantaged,” or simply see that, in truth, they are just where they want to be and thus allow them to “work out their own Karma”? That’s a very good—and a very important—ques-tion. Remember first that everything you think, say, and do is a reflection of what you’ve decided about yourself; a statement of Who You Are; an act of creation in your deciding who you want to be. I keep returning to that, because that is the only thing you are doing here; that is what you are up to. There is nothing else going on, no other agenda for the soul. You are seeking to be and to experience Who You Really Are—and to create that. You are creating yourself anew in every moment of Now. Now, within that context, when you come across a person who appears, in relative terms as observed within your world, to be disadvantaged, the first ques-tion you have to ask is: Who am I and who do I choose to be, in relationship to that? In other words, the first question when you encoun-ter another in any circumstance should always be: What do I want here? Did you hear that? Your first question, always, must be: What do I want here?—not: What does the other person want here? That’s the most fascinating insight I have ever received about the way to proceed in human relationships. It also runs against everything I’ve ever been taught. I know. But the reason your relationships are in such a mess is that you’re always trying to figure out what the other person wants and what other people want—in-stead of what you truly want. Then you have to decide whether to give it to them. And here is how you decide: You decide by taking a look at what you may want from them. If there’s nothing you think you’ll want from them, your first reason for giving them what they want disappears, and so you very seldom do. If, on the other hand, you see that there is something you want or may want from them, then your self-survival mode kicks in, and you try to give them what they want. Then you resent it—especially if the other person doesn’t eventually give you what you want. In this game of I’ll Trade You, you set up a very delicate balance. You meet my needs and I’ll meet yours. Yet the purpose of all human relationships—rela-tionships between nations as well as relationships be-tween individuals—has nothing to do with any of this. The purpose of your Holy Relationship with every other person, place, or thing is not to figure out what they want or need, but what you require or desire now in order to grow, in order to be Who you want to Be. That is why I created Relationship to other things. If it weren’t for this, you could have continued to live in a vacuum, a void, the Eternal Allness whence you came. Yet in the Allness you simply are and cannot expe-rience your “awareness”- as anything in particular be-cause, in the Allness, there is nothing you are not. So I devised a way for you to create anew, and Know, Who You Are in your experience. I did this by providing you with: 1. Relativity—a system wherein you could exist as a thing in relationship to something else. 2. Forgetfulness—a process by which you willingly submit to total amnesia, so that you can not know that relativity is merely a trick, and that you are All of It. 3. Consciousness—a state of Being in which you grow until you reach full awareness, then becoming a True and Living God, creating and experiencing your own reality, expanding and exploring that reality, changing and re-creating that reality as you stretch your consciousness to new limits—or shall we say, to no limit. In this paradigm, Consciousness is everything. Consciousness—that of which you are truly aware—is the basis of all truth and thus of all true spirituality. But what is the point of it all? First You make us forget Who We Are, so that we can remember Who We Are? Not quite. So that you can create Who You Are and Who You Want to Be. This is the act of God being God. It is Me being Me—through. you! This is the point of all life. Through you, I experience being Who and What I Am. Without you, I could know it, but not experience it. Knowing and experiencing are two different things. I’ll choose experiencing every time. Indeed, I do. Through you. I seem to have lost the original question here. Well, it’s hard to keep God on one subject. I’m kind of expansive. Let’s see if we can get back. Oh, yes—what to do about the less fortunate. First, decide Who and What You Are in Relationship to them. Second, if you decide you wish to experience your-self as being Succor, as being Help, as being Love and Compassion and Caring, then look to see how you can best be those things. And notice that your ability to be those things has nothing to do with what others are being or doing. Sometimes the best way to love someone, and the most help you can give, is to leave them alone or empower them to help themselves. It is like a feast. Life is a smorgasbord, and you can give them a big helping of themselves. Remember that the greatest help you can give a person is to wake them up, to remind them of Who They Really Are. There are many ways to do this. Sometimes with a little bit of help; a push, a shove, a nudge ... and sometimes with a decision to let them run their course, follow their path, walk their walk, without any interference or intervention from you. (All parents know about this choice and agonize over it daily.) What you have the opportunity to do for the less fortunate is to re-mind them. That is, cause them to be of a New Mind about themselves. And you, too, have to be of a New Mind about them, for if you see them as unfortunate, they will. Jesus’ great gift was that he saw everyone as who they truly are. He refused to accept appearances; he refused to believe what others believed of themselves. He always had a higher thought, and he always invited others to it. Yet he also honored where others chose to be. He did not require them to accept his higher idea, merely held it out as an invitation. He dealt, too, with compassion—and if others chose to see themselves as Beings needing assistance, he did not reject them for their faulty assessment, but allowed them to love their Reality—and lovingly assisted them in playing out their choice. For Jesus knew that for some the fastest path to Who They Are was the path through Who They Are Not. He did not call this an imperfect path and thus con-demn it. Rather he saw this, too, as “perfect”—and thus supported everyone in being just who they wanted to be. Anyone, therefore, who asked Jesus for help re-ceived it. He denied no one—but was always careful to see that the help he gave supported a person’s full and honest desire. If others genuinely sought enlightenment, hon-estly expressing readiness to move to the next level, Jesus gave them the strength, the courage, the wis-dom to do so. He held himself out—and rightly so—as an example and encouraged people, if they could do nothing else, to have faith in him. He would not, he said, lead them astray. Many did put their faith in him—and to this day he helps those who call upon his name. For his soul is committed to waking up those who seek to be fully awake and fully alive in Me. Yet Christ had mercy on those who did not. He therefore rejected self-righteousness and—as does his Father in heaven—made no judgments, ever. Jesus’ idea of Perfect Love was to grant all persons exactly the help they requested, after telling them the kind of help they could get. He never refused to help anyone, and least of all would he do so out of a thought that “you made your bed, now lie in it.” Jesus knew that if he gave people the help they asked for, rather than merely the help he wanted to give, that he was empowering them at the level at which they were ready to receive empowerment. This is the way of all great masters. Those who have walked your planet in the past, and those who are walking it now. Now I am confused. When is it disempowering to offer help? When does it work against, rather than for, another’s growth? When your help is offered in such a way that it creates continued dependence, rather than rapid inde-pendence. When you allow another, in the name of compas-sion, to begin to rely on you rather than rely on them-selves. That is not compassion, that is compulsion. You have a power compulsion. Because that sort of helping is really power-tripping. Now this distinction can be very subtle here, and sometimes you don’t even know you are power-tripping. You really believe you are simply doing your best to help another.., yet be careful that you are not simply seeking to create your own self-worth. For to the extent that you allow other per-sons to make you responsible for them, to that extent you have allowed them to make you powerful. And that, of course, makes you feel worthy. Yet this kind of help is an aphrodisiac which seduces the weak. The goal is to help the weak grow strong, not to let the weak become weaker. This is the problem with many government assis-tance programs, for they often do the latter, rather than the former. Government programs can be self-per-petuating. Their objective can be every bit as much to justify their existence as to help those they are meant to assist. If there were a limit to all government assistance, people would be helped when they genuinely need help but could not become addicted to that help, substituting it for their own self-reliance. Governments understand that help is power. That is why governments offer as much help to as many people as they can get away with—for the more people government helps, the more people help the govern-ment. Whom the government supports, supports the gov-ernment. Then there should be no redistribution of wealth. The Communist Manifesto is satanic. Of course, there is no Satan, but I understand your meaning. The idea behind the statement “From each accord-ing to his ability, to each according to his need” is not evil, it is beautiful. It is simply another way of saying you are your brother’s keeper. It is the implementation of this beautiful idea that can become ugly. Sharing must be a way of life, not an edict imposed by government. Sharing should be voluntary, not forced. But—here we go again!—at its best, government is the people, and its programs are simply mechanisms by which the people share with many others, as a “way of life.” And I would argue that people, collectively through their political systems, have chosen to do so because people have observed, and history has shown, that the “haves” do not share with the “have-nots.” The Russian peasant could have waited until hell froze over for the Russian nobility to share its wealth—which was usually gained and enlarged through the hard work of peasants. The peasants were given just enough to subsist on, as the “incentive” to keep working the land—and make the land barons richer. Talk about a dependency relationship! This was an I’ll-help -you-only-if-you-help-me arrangement more exploitive and more obscene than anything ever invented by government! It was this obscenity against which the Russian peasants revolted. A government which ensured that all people were treated equally was born out of the people’s frustration that the “haves” would not give to the “have-nots” of their own accord. It was as Marie Antoinette said of the starving masses clamoring beneath her window in rags, while she lounged in a gold inlaid tub on a bejeweled pedestal, munching imported grapes: “Let them eat cake!” This is the attitude against which the downtrodden have railed. This is the condition causing revolution and creating governments of so-called oppression. Governments which take from the rich and give to the poor are called oppressive, while governments which do nothing while the rich exploit the poor are repressive. Ask the peasants of Mexico even today. It is said that twenty or thirty families—the rich and powerful elite—literally run Mexico (principally because they own it!), while twenty or thirty million live in utter deprivation. So the peasants in 1993-94 undertook a revolt, seeking to force the elitist govern-ment to recognize its duty to help the people provide the means for a life of at least meager dignity. There is a difference between elistist governments and governments “of, by, and for the people.” Are not people’s governments created by angry people frustrated over the basic selfishness of human nature? Are not government programs created as a remedy for man’s unwill-ingness to provide a remedy himself? Is this not the genesis of fair housing laws, child labor statutes, support programs for mothers with dependent children? Wasn’t Social Security government’s attempt to provide for older people something that their own families would not or could not provide? How do we reconcile our hatred of government control with our tack of willingness to do anything we don’t have to do when there are no controls? It is said that some coal miners worked under horrible conditions before governments required the filthy rich mine owners to clean up their filthy mines. Why didn’t the owners do so themselves? Because it would have cut into their profits! And the rich didn’t care how many of the poor died in unsafe mines to keep the profits flowing—and growing. Businesses paid slave wages to beginning workers before governments imposed minimum wage requirements. Those who favor going back to the “good old days” say, “So what? They provided jobs, didn’t they? And who’s taking the risk, anyway? The worker? No! The investor, the owner, takes all the risks! So to him should go the biggest reward!” Anyone who thinks that the workers on whose labors the owners depend should be treated with dignity is called a communist. Anyone who thinks that a person should not be denied housing because of skin color is called a socialist. Anyone who thinks that a woman should not be denied employment opportunities or promotion simply because she’s the wrong sex is called a radical feminist. And when governments, through their elected repre-sentatives, move to solve these problems that people of power in society steadfastly refuse to solve themselves, those govern-ments are called oppressive! (Never by the people they help, incidentally. Only by the people who refuse to provide the help themselves.) Nowhere is this more evident than in health care. In 1992 an American President and his wife decided it was unfair and inappropriate for millions of Americans to have no access to preventative health care; that notion started a health care debate which catapulted even the medical profession and the insurance industry into the fray. The real question is not whose solution was better: the plan proposed by the Administration or the plan proposed by private industry. The real question is: Why didn’t private industry propose its own solution long ago? I’ll tell you why. Because it didn’t have to. No one was complaining. And the industry was driven by profits. Profits, profits, profits. My point, therefore, is this. We can rail and cry and com-plain all we want. The plain truth is, governments provide solutions when the private sector won’t. We can also claim that governments are doing what they are doing against the wishes of the people, but so long as people control the government—as they do to a large extent in the United States—the government will continue to pro-duce and require solutions to social ills because the majority of the people are not rich and powerful, and therefore legislate for themselves what society will not give them voluntarily. Only in countries where the majority of the people do not control the government does government do little or nothing about inequities. So, then, the problem: How much government is too much government? And how much is too little? And where and how do we strike the balance? Whew! I’ve never seen you go on like this! That’s as long as you’ve held the floor in either of our two books. Well, you said this book was going to address some of the larger, global problems facing the family of man. I think I’ve laid out a big one. Eloquently, yes. Everyone from Toynbee to Jefferson to Marx has been trying to solve it for hundreds of years. Okay—What’s Your solution? We are going to have to go backwards here; we are going to have to go over some old ground. Go ahead. Maybe I need to hear it twice. Then we’ll start with the fact that I have no “solu-tion.” And that is because I see none of this as problem-atical. It just is what it is, and I have no preferences regarding that. I am merely describing here what is observable; what anyone can plainly see. Okay, You have no solution and You have no preference. Can You offer me an observation? I observe that the world has yet to come up with a system of government which provides a total solu-tion—although the government in the United States has come the closest so far. The difficulty is that goodness and fairness are moral issues, not political ones. Government is the human attempt to mandate good-ness and ensure fairness. Yet there is only one place where goodness is born, and that is in the human heart. There is only one place where fairness can be conceptualized, and that is in the human mind. There is only one place where love can be experienced truly, and that is in the human soul. Because the human soul is love. You cannot legislate morality. You cannot pass a law saying “love each other.” We are now going around in circles, as we have covered all of this before. Still, the discussion is good, so keep plugging away at it. Even if we cover the same ground twice or three times, that is okay. The attempt here is to get to the bottom of it; see how you want to create it now. Well then, I’ll ask the same question I asked before. Aren’t all laws simply man’s attempt to codify moral concepts? Is not “legislation” simply our combined agreement as to what is “right” and “wrong”? Yes. And certain civil laws—rules and regula-tions—are required in your primitive society. (You un-derstand that in nonprimitive societies such laws are unnecessary. All beings regulate themselves.) In your society, you are still confronted with some very elemen-tary questions. Shall you stop at the street corner before proceeding? Shall you buy and sell according to certain terms? Will there be any restrictions on how you behave with one another? But truly, even these basic laws—prohibitions against murdering, damaging, cheating, or even run-ning a red light—shouldn’t be needed and wouldn’t be needed if all people everywhere simply followed the Laws of Love. That is, God’s Law. What is needed is a growth in consciousness, not a growth of government. You mean if we just followed the Ten Commandments we’d be all right! There’s no such thing as the Ten Commandments. (See Book 1 for a complete discussion of this.) God’s Law is No Law. This is something you cannot under-stand. I require nothing. Many people cannot believe Your last statement. Have them read Book 1. It completely explains this. Is that what You are suggesting for this world? Complete anarchy? Iam suggesting nothing. lam merely observing what works. I am telling you what is observably so. And no, I do not observe that anarchy—the absence of govern-ance, rules, regulations, or limitations of any kind—would work. Such an arrangement is only prac-tical with advanced beings, which I do not observe human beings to be. So some level of governance is going to be required until your race evolves to the point where you naturally do what is naturally right. You are very wise to govern yourselves in the in-terim. The points you made a moment ago are salient, unassailable. People often do not do what is “right” when left to their own devices. The real question is not why do governments im-pose so many rules and regulations on the people, but why do governments have to? The answer has to do with your Separation Con-sciousness. The fact that we see ourselves as separate from each other. Yes. But if we aren’t separate, then we are One. And doesn’t that mean we are responsible for each other? Yes. But doesn’t that disempower us from achieving individual greatness? If I am responsible for all others, then the Commu-nist Manifesto was right! “From each according to his ability, to each according to his need.” That is, as I’ve already said, a very noble idea. But it is robbed of its nobility when it is ruthlessly enforced. That was the difficulty with communism. Not the con-cept, but its implementation. There are those who say that the concept had to be forced because the concept violates the basic nature of man. You’ve hit the nail on the head. What needs to be changed is the basic nature of man. That’s where the work must be done. To create the consciousness shift of which You’ve spoken. Yes. But we’re going around in circles again. Would not a group consciousness cause individuals to be disempowered? Let’s look at it. If every person on the planet had basic needs met—if the mass of the people could live in dignity and escape the struggle of simple sur-vival—would this not open the way for all of humankind to engage in more noble pursuits? Would individual greatness really be suppressed if individual survival were guaranteed? Must universal dignity be sacrificed to individual glory? What kind of glory is obtained when it is achieved at the expense of another? I have placed more than sufficient resources on your planet to ensure adequate supplies for all. How can it be that thousands starve to death each year? That hundreds go homeless? That millions cry out for simple dignity? The kind of help that would end this is not the kind of help which disempowers. If your well-off say they do not want to help the starving and the homeless because they do not want to disempower them, then your well-off are hypocrites. For no one is truly “well off” if they are well off while others are dying. The evolution of a society is measured by how well it treats the least among its members. As I have said, the challenge is to find the balance between helping people and hurting them. Any guidelines You can offer? An overall guideline might be this: When in doubt, always err on the side of compassion. The test of whether you are helping or hurting: Are your fellow humans enlarged or reduced as a result of your help? Have you made them bigger or smaller? More able or less able? It has been said that if you give everything to individuals, they will be less willing to work for it themselves. Yet why should they have to work for the simplest dignity? Is there not enough for all? Why should “work-ing for it” have to do with anything? Isn’t basic human dignity the birthright of every-one? Oughtn’t it be? If one seeks more than minimum levels—more food, bigger shelters, finer coverings for the body—one can seek to achieve those goals. But ought one have to struggle to even survive—on a planet where there is more than enough for everyone? That is the central question facing humankind. The challenge is not to make everyone equal, but to give everyone at least the assurance of basic survival with dignity, so that each may then have the chance to choose what more they want from there. There are those who argue that some don’t take that chance even when it is given them. And they observe correctly. This raises yet another question: to those who don’t take the opportunities pre-sented to them, do you owe another chance, and another? No. If I took that attitude, you would be lost to hell forever. I tell you this: Compassion never ends, love never stops, patience never runs out in God’s World. Only in the world of man is goodness limited. In My World, goodness is endless. Even if we don’t deserve it. You always deserve it! Even if we throw Your goodness back in Your face? Especially if you do (“If a man slaps you on the right cheek, turn and offer him your left. And if a man asks you to go one mile with him, go with him twain.”) When you throw My goodness back in My face (which, by the way, the human race has done to God for millennia), I see that you are merely mistaken. You do not know what is in your best interest. I have compas-sion because your mistake is based not in evil, but in ignorance. But some people are basically evil. Some people are intrin-sically bad. Who told you that? It is my own observation. Then you cannot see straight. I have said it to you before: No one does anything evil, given his model of the world. Put another way, all are doing the best they can at any given moment. All actions of everyone depend on the data at hand. I have said before—consciousness is everything. Of what are you aware? What do you know? But when people attack us, hurt us, damage us, even kill us for their own ends, is that not evil? I have told you before: all attack is a call for help. No one truly desires to hurt another. Those who do it—including your own governments, by the way—do it out of a misplaced idea that it is the only way to get something they want. I’ve already outlined in this book the higher solution to this problem. Simply want nothing. Have prefer-ences, but no needs. Yet this is a very high state of being; it is the place of Masters. In terms of geopolitics, why not work together as a world to meet the most basic needs of everyone? We’re doing that—or trying. After all these thousands of years of human history, that’s the most you can say? The fact is, you have barely evolved at all. You still operate in a primitive “every man for himself” mentality. You plunder the Earth, rape her of her resources, exploit her people, and systematically disenfranchise those who disagree with you for doing all of this, calling them the “radicals.” You do all this for your own selfish purposes, be-cause you’ve developed a lifestyle that you cannot maintain any other way. You must cut down millions of acres of trees each year or you won’t be able to have your Sunday paper. You must destroy miles of the protective ozone which covers your planet, or you cannot have your hairspray. You must pollute your rivers and streams beyond repair or you cannot have your industries to give you Bigger, Better, and More. And you must exploit the least among you—the least advantaged, the least educated, the least aware—or you can not live at the top of the human scale in unheard-of (and unnecessary) luxury. Finally, you must deny that you are doing this, or you cannot live with yourself. You cannot find it in your heart to “live simply, so that others may simply live.” That bumper sticker wisdom is too simple for you. It is too much to ask. Too much to give. After all, you’ve worked so hard for what you’ve got! You ain’t giving up none of it! And if the rest of the human race—to say nothing of your own children’s children—have to suffer for it, tough bananas, right? You did what you had to do to survive, to “make it”—they can do the same! After all, it is every man for himself, is it not? Is there any way out of this mess? Yes. Shall I say it again? A shift of consciousness. You cannot solve the problems which plague hu-mankind through governmental action or by political means. You have been trying that for thousands of years. The change that must be made can be made only in the hearts of men. Can You put the change that must be made into one sen-tence? I already have several times. You must stop seeing Cod as separate from you, and you as separate from each other. The only solution is the Ultimate Truth: nothing exists in the universe that is separate from anything else. Everything is intrinsically connected, irrevocably inter-dependent, interactive, interwoven into the fabric of all of life. All government, all politics, must be based on this truth. All laws must be rooted in it. This is the future hope of your race; the only hope for your planet. How does the Law of Love You spoke of earlier work? Love gives all and requires nothing. How can we require nothing? If everyone in your race gave all, what would you require? The only reason you require anything is be-cause someone else is holding back. Stop holding back! This could not work unless we all did it at once. Indeed, a global consciousness is what is required. Yet, how will that come about? Somebody has to start. The opportunity is here for you. You can be the source of this New Consciousness. You can be the inspiration. Indeed, you must be. I must? Who else is there?","sourceLink":"http://novel.tingroom.com/zongjiao/243/612.html","bookId":36,"book":{"id":36,"title":"与神对话 Conversations With God","description":"简介： Conversations with God (CwG) is a sequence of books written by Neale Donald Walsch, written as a dialogue in which Walsch asks questions and God answers.The first book of the Conversations with God series, Conversations with God, Book 1: An ...","cover":"https://cunovel.com/defaultCover.png","type":"Religious","link":"http://novel.tingroom.com/zongjiao/243","creation":"Aug 1, 2019 12:18:11 AM","modification":"Aug 1, 2019 12:18:11 AM"}}
