{"id":1023,"no":49,"title":"Part 3 Chapter 9","content":"Life must be kind of like school. I can remember being ex-cited every fall about the first day of school—and, at the end of the year, thrilled to be getting out.\\n\\n \\n\\n Precisely! Exactly! You’ve hit it. That’s it exactly.\\n\\n Only life is not a school.\\n\\n \\n\\n Yes, I remember. You explained all that in Book 1. Until then, I thought that life was a “school,” and that we had come here to “learn our lessons.” You helped me tremendously in Book 1 to see that this was a false doctrine.\\n\\n \\n\\n I’m glad. That’s what we’re trying to do here with this trilogy—bring you to clarity. And now you’re clear about why and how the soul can be overjoyed after “death” without necessarily ever regretting “life.”\\n\\n But you asked a larger question before, and we should revisit it.\\n\\n \\n\\n I’m sorry?\\n\\n \\n\\n You said, “If the soul is so unhappy in the body, why doesn’t it just leave?”\\n\\n \\n\\n Oh, yes.\\n\\n \\n\\n Well, it does. And I don’t mean only at “death,” as I’ve just explained. But it does not leave because it is unhappy. Rather, it leaves because it wishes to regener-ate, rejuvenate.\\n\\n \\n\\n Does it do this often?\\n\\n \\n\\n Every day.\\n\\n \\n\\n The soul leaves the body every day? When?\\n\\n \\n\\n When the soul yearns for its larger experience. It finds this experience rejuvenating.\\n\\n \\n\\n It just leaves?\\n\\n \\n\\n Yes. The soul leaves your body all the time. Continu-ally. Throughout your life. This is why We invented sleep.\\n\\n \\n\\n The soul leaves the body during sleep?\\n\\n \\n\\n Of course. That is what sleep is.\\n\\n Periodically throughout your life the soul seeks reju-venation, refueling, if you will, so that it can continue lumbering along in this carrier you call your body.\\n\\n You think it is easy for your soul to inhabit your body? It is not! It may be simple, but it is not easy! It is a joy, but it is not easy. It is the most difficult thing your soul has ever done!\\n\\n The soul, which knows a lightness and a freedom which you can’t imagine, yearns for that state of being again, just as a child who loves school can yearn for sum-mer vacation. just as an adult who yearns for company can also, while having company, yearn to be alone. The soul seeks a true state of being. The soul is lightness and freedom. It is also peace and joy. It is also limitlessness and painlessness; perfect wisdom and perfect love.\\n\\n It is all these things, and more. Yet it experiences precious few of these things while it is with the body. And so it made an arrangement with itself. It told itself it would stay with the body as long as it needs to in order to create and experience itself as it now chooses—but only if it could leave the body whenever it wished!\\n\\n It does this daily, through the experience you call sleep.\\n\\n \\n\\n “Sleep” is the experience of the soul leaving the body?\\n\\n \\n\\n Yes.\\n\\n \\n\\n I thought we fell asleep because the body needed rest.\\n\\n \\n\\n You are mistaken. It is the other way around. The soul seeks the rest, and so, causes the body to “fall asleep.”\\n\\n The soul literally drops the body (sometimes right where it is standing) when it is tired of the limits, tired of the heaviness and lack of freedom of being with the body.\\n\\n It will just leave the body when it seeks “refueling”; when it becomes weary of all the nontruth and false re-ality and imagined dangers, and when it seeks, once again, reconnection, reassurance, restfulness, and re-awakening for the mind.\\n\\n When the soul first embraces a body, it finds the ex-perience extremely difficult. It is very tiring, particularly for a newly arriving soul. That is why babies sleep a lot.\\n\\n When the soul gets over the initial shock of being at-tached to a body once more, it begins to increase its tol-erance for that. It stays with it more.\\n\\n At the same time, the part of you called your mind moves into forgetfulness-just as it was designed to do. Even the soul’s flights out of the body, taken now on a less-frequent, but still usually daily, basis do not always bring the mind back to remembrance.\\n\\n Indeed, during these times the soul may be free, but the mind may be confused. Thus, the whole being may ask: “Where am I? What am I creating here?” These searchings may lead to fitful journeys; even frightening ones. You call these trips “nightmares.”\\n\\n Sometimes just the opposite will occur. The soul will arrive at a place of great remembering. Now the mind will have an awakening. This will fill it with peace and joy—which you will experience in your body when you return to it.\\n\\n The more your whole being experiences the reas-surance of these rejuvenations—and the more it re-members what it is doing, and trying to do, with the body—the less your soul will choose to stay away from the body, for now it knows that it came to the body for a reason, and with a purpose. Its desire is to get on with that, and to make best use of all the time with the body that it has.\\n\\n The person of great wisdom needs little sleep.\\n\\n \\n\\n Are You saying you can tell how evolved a person is by how much sleep that person needs?\\n\\n \\n\\n Almost, yes. You could almost say that. Sometimes a soul chooses to leave the body just for the sheer joy of it, though. It may not be seeking reawakening for the mind or rejuvenation for the body. It may simply be choosing to re-create the sheer ecstasy of knowing the Oneness. So it would not always be valid to say that the more sleep a person gets, the less evolved that person is.\\n\\n Still, it is not a coincidence that as beings become more and more aware of what they are doing with their bodies-and that they are not their bodies, but that which is with their bodies—they become willing and able to spend more and more time with their bodies, and thus appear to “need less sleep.”\\n\\n Now some beings even choose to experience both the forgetfulness of being with the body, and the one-ness of the soul, at once. These beings can train a part of themselves to not identify with the body while they are still with the body, thus experiencing the ecstasy of knowing Who They Really Are, without having to lose human wakefulness in order to do it.\\n\\n \\n\\n How do they do this? How can I do this?\\n\\n \\n\\n It is a question of awareness, of reaching a state of total awareness, as I said before. You cannot do totally aware, you can only be totally aware.\\n\\n \\n\\n How? How? There must be some tools You can give me.\\n\\n \\n\\n Daily meditation is one of the best tools with which to create this experience. With it, you can raise your life energy to the highest chakra . . . . . and even leave your body while you are “awake.”\\n\\n In meditation you place yourself in a state of readi-ness to experience total awareness while your body is in a wakened state. This state of readiness is called true wakefulness. You do not have to be sitting in meditation to experience this. Meditation is simply a device, a “tool,” as you put it. But you do not have to do sitting medita-tion in order to experience this.\\n\\n You should also know that sitting meditation is not the only kind of meditation there is. There is also stop-ping meditation. Walking meditation. Doing medita-tion. Sexual meditation.\\n\\n This is the state of true wakefulness.\\n\\n When you stop in this state, simply stop in your tracks, stop going where you are going, stop doing what you are doing, just stop for a moment, and just “be” right where you are, you become right, exactly where you are. Stopping, even just for a moment, can be blessed. You look around, slowly, and you notice things you did not notice while you were passing them by. The deep smell of the earth just after it rains. That curl of hair over the left ear of your beloved. How truly good it feels to see a child at play.\\n\\n You don’t have to leave your body to experience this. This is the state of true wakefulness.\\n\\n When you walk in this state, you breathe in every flower, you fly with every bird, you feel every crunch beneath your feet. You find beauty and wisdom. For wisdom is found wherever beauty is formed. And beauty is formed everywhere, out of all the stuff of life. You do not have to seek it. It will come to you.\\n\\n And you don’t have to leave your body to experi-ence this. This is the state of true wakefulness.\\n\\n When you “do” in this state, you turn whatever you are doing into a meditation, and thus, into a gift, an of-fering, from you to your soul, and from your soul to The All. Washing dishes, you enjoy the warmth of the water caressing your hands, and marvel at the wonder of both water, and warmth. Working at your computer, you see the words appear on the screen in front of you in re-sponse to the command of your fingers, and exhilarate over the power of the mind and body, when it is har-nessed to do your bidding. Preparing dinner, you feel the love of the universe which brought you this nourish-ment, and as your return gift, pour into the making of this meal all the love of your being. It does not matter how extravagant or how simple the meal is. Soup can be loved into deliciousness.\\n\\n You don’t have to leave your body to experience this. This is the state of true wakefulness.\\n\\n When you experience sexual energy exchange in this state, you know the highest truth of Who You Are. The heart of your lover becomes your home. The body of your lover becomes your own. Your soul no longer imagines itself separate from anything.\\n\\n You don’t have to leave your body to experience this. This is the state of true wakefulness.\\n\\n When you are in readiness, you are in wakefulness. A smile can take you there. A simple smile. Just stop everything for one moment, and smile. At nothing. just because it feels good. Just because your heart knows a secret. And because your soul knows what the secret is. Smile at that. Smile a lot. It will cure whatever ails you.\\n\\n You are asking me for tools, and lam giving them to you.\\n\\n Breathe. That is another tool. Breathe long and deep. Breathe slowly and gently. Breathe in the soft, sweet nothingness of life, so full of energy, so full of love. It is God’s love you are breathing. Breathe deeply, and you can feel it. Breathe very, very deeply, and the love will make you cry.\\n\\n For joy.\\n\\n For you have met your God, and your God has in-troduced you to your soul.\\n\\n \\n\\n Once this experience has taken place, life is never the same. People talk of having “been to the mountain top,” or having slipped into sublime ecstasy. Their be-ingness is changed forever.\\n\\n \\n\\n Thank You. I understand. It is the simple things. The simple acts, and the purest.\\n\\n \\n\\n Yes. But know this. Some people meditate for years and never experience this. It has to do with how open one is, how willing. And also, how able to move away from any expectation.\\n\\n \\n\\n Should I meditate every day?\\n\\n \\n\\n As in all things, there are no “shoulds” or “shouldn’ts” here. It is not a question of what you should do, but what you choose to do.\\n\\n Some souls seek to walk in awareness. Some recog-nize that in this life most people are sleepwalking; un-conscious. They are going through life without consciousness. Yet souls who walk in awareness choose a different path. They choose another way.\\n\\n They seek to experience all the peace and joy, limit-lessness and freedom, wisdom and love that Oneness brings, not just when they have dropped the body and it has “fallen” (asleep), but when they have risen the body up.\\n\\n It is said of a soul which creates such an experience, “His is risen.”\\n\\n Others, in the so-called “New Age,” term this a pro-cess of “consciousness raising.”\\n\\n It doesn’t matter what terms you use (words are the least reliable form of communication), it all comes down to living in awareness. And then, it becomes total awareness.\\n\\n And what is it of which you eventually become to-tally aware? You eventually become totally aware of Who You Are.\\n\\n \\n\\n Daily meditation is one way you may achieve this. Yet it requires commitment, dedication—a decision to seek inner experience, not outer reward.\\n\\n And remember, the silences hold the secrets. And so the sweetest sound is the sound of silence. This is the song of the soul.\\n\\n If you believe the noises of the world rather than the silences of your soul, you will be lost.\\n\\n \\n\\n So daily meditation is a good idea.\\n\\n \\n\\n A good idea? Yes. Yet know again what I have just said here. The song of the soul may be sung many ways. The sweet sound of silence may be heard many times.\\n\\n Some hear the silence in prayer. Some sing the song in their work. Some seek the secrets in quiet contem-plation, others in less contemplative surroundings.\\n\\n When mastery is reached—or even intermittently experienced—the noises of the world can be muffled, the distractions quieted, even in the midst of them. All of life becomes a meditation.\\n\\n All of life is a meditation, in which you are contem-plating the Divine. This is called true wakefulness, or mindfulness.\\n\\n Experienced in this way, everything in life is blessed. There is struggle and pain and worry no more. There is only experience, which you may choose to label in any way you wish. You may choose to label all of it perfec-tion.\\n\\n So use your life as a meditation, and all the events in it. Walk in wakefulness, not as one asleep. Move with mindfulness, not mindlessly, and do not tarry in doubt and fear, neither in guilt nor self-recrimination, yet re-side in permanent splendor in the assurance that you are grandly loved. You are always One with Me. You are forever welcome. Welcome home.\\n\\n For your home is in My heart, and Mine in yours. I invite you to see this in life as you will surely see it in death. Then you will know that there is no death, and\\n\\n \\n\\n that what you have called life and death are both part of the same unending experience.\\n\\n We are all that is, all that ever was, and all that ever will be, world without end.\\n\\n \\n\\n Amen.\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/zongjiao/243/631.html","bookId":36,"book":{"id":36,"title":"与神对话 Conversations With God","description":"简介： Conversations with God (CwG) is a sequence of books written by Neale Donald Walsch, written as a dialogue in which Walsch asks questions and God answers.The first book of the Conversations with God series, Conversations with God, Book 1: An ...","cover":"https://cunovel.com/defaultCover.png","type":"Religious","link":"http://novel.tingroom.com/zongjiao/243","creation":"Aug 1, 2019 12:18:11 AM","modification":"Aug 1, 2019 12:18:11 AM"}}
