{"id":1029,"no":55,"title":"Part 3 Chapter 15","content":"I want to tell you, My dearest children, that this mat-ter of Who You Are, and Who You Choose To Be, is of great importance. Not only because it sets the tone of your experience, but because it creates the nature of Mine.\\n\\n All of your life you have been told that God cre-ated you. I come now to tell you this: You are creating God.\\n\\n That is a massive rearrangement of your under-standing, I know. And yet it is a necessary one if you are to go about the true work for which you came.\\n\\n This is holy work We are up to, you and I. This is sa-cred ground We walk.\\n\\n This is The Path.\\n\\n In every moment God expresses Himself in, as, and through you. You are always at choice as to how God will be created now, and She will never take that choice from you, nor will She punish you for making the “wrong” choice. Yet you are not without guidance in these matters, nor will you ever be. Built into you is an internal guidance system that shows you the way home. This is the voice that speaks to you always of your high-est choice, that places before you your grandest vision. All you need do is heed that voice, and not abandon the vision.\\n\\n Throughout your history I have sent you teachers. During every day and time have My messengers brought you glad tidings of great joy.\\n\\n Holy scriptures have been written, and holy lives have been lived, that you might know of this eternal truth: You and I are One.\\n\\n Now again I send you scriptures—you are holding one of them in your hands. Now again I send you messengers, seeking to bring you the Word of God.\\n\\n Will you listen to these words? Will you hear these messengers? Will you become one of them?\\n\\n That is the great question. That is the grand invita-tion. That is the glorious decision. The world awaits your announcement. And you make that announce-ment with your life, lived.\\n\\n The human race has no chance to lift itself from its own lowest thoughts until you lift yourself to your own highest ideas.\\n\\n Those ideas, expressed through you, as you, create the template, set the stage, serve as a model for the next level of human experience.\\n\\n You are the life and the way. The world will follow you. You are not at choice in this matter. It is the only matter in which you have no free choice. It is simply The Way It Is. Your world will follow your idea about yourself. Ever it has been, ever it will be. First comes your thought about yourself, then follows the outer world of physical manifestation.\\n\\n What you think, you create. What you create, you become. What you become, you express. What you express, you experience. What you experience, you are. What you are, you think.\\n\\n The circle is complete.\\n\\n The holy work in which you are engaged has really just begun, for now, at last, you understand what you are doing.\\n\\n It is you who have caused yourself to know this, you who have caused yourself to care. And you do care now, more than ever before, about Who You Really Are. For now, at last, you see the whole picture.\\n\\n Who you are, I am.\\n\\n You are defining God.\\n\\n I have sent you—a blessed part of Me—into physical form that I might know Myself experientially as all that I know Myself to be conceptually. Life exists as a tool for God to turn concept into experience. It\\n\\n exists for you to do the same. For you are God, doing this.\\n\\n I choose to re-create Myself anew in every single moment. I choose to experience the grandest version of the greatest vision ever I had about Who I Am. I have created you, so that you might re-create Me. This is Our holy work. This is Our greatest joy. This is Our very rea-son for being.\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/zongjiao/243/637.html","bookId":36,"book":{"id":36,"title":"与神对话 Conversations With God","description":"简介： Conversations with God (CwG) is a sequence of books written by Neale Donald Walsch, written as a dialogue in which Walsch asks questions and God answers.The first book of the Conversations with God series, Conversations with God, Book 1: An ...","cover":"https://cunovel.com/defaultCover.png","type":"Religious","link":"http://novel.tingroom.com/zongjiao/243","creation":"Aug 1, 2019 12:18:11 AM","modification":"Aug 1, 2019 12:18:11 AM"}}
