{"id":69307,"no":120,"title":"Page 120","content":"Rugby players and the whole rugby-player look are definitely in, along with frilly chiffons, neo-hippie patchworks and shaved heads; because of Liam and Noel Gallagher, I notice beards are more in vogue than they were last time I was here, which causes me to keep touching my face vacantly, feeling naked and vulnerable and so lost I almost step on two Pekingese puppies a bald neo-hippie rugby player with a beard is walking when I collide with him on Bond Street. I think about calling Tamara, a society girl I had a fling with last time she was in the States, but instead debate the best way of putting a positive spin on the Jamie Fields situation if F. Fred Palakon ever calls. Thunderstorms start rumpling my hair and I dash into the Paul Smith store on Bond Street, where I purchase a smart-looking navy-gray raincoat. Everything But the Girl\u0027s \"Missing\" plays over everything, occasionally interrupted by feel-good house music, along with doses of Beck\u0027s \"Where It\u0027s At\" and so on and so on.\\n\\n I\u0027m also being followed by a guy wearing wraparound black sunglasses who looks like he should be in a soap opera-handsome, with a too-chiseled chin and thick swept-up black hair-and resembles maybe a moddish Christian Bale, suspiciously blase in a long black Prada overcoat, seemingly up to no good and vaguely plasticine.\\n\\n Regrets: I never should have turned down that Scotch ad.\\n\\n Mental note: eyeliner on men seems fairly cool this season.\\n\\n At Masako I\u0027m slumped in a velvet booth in back picking at sushi that tastes like ham, and the Christian Bale guy sits at a table for four up front in the deserted restaurant, grinning distantly, a camcorder sitting on an empty chair next to him, and doom music piped in through the stereo system fails to cheer anybody up.\\n\\n When I walk up to him holding a San Pellegrino bottle, he pays his check and takes a final sip of cold sake, smiling arrogantly at me.\\n\\n \"You want my autograph? Is that it?\" I\u0027m asking and then my voice gets babyish. \"Stop following me. Just leave me the f**k alone, okay?\" A pause, during which he gets up and I back away. \"Or else I\u0027ll pour this San Pellegrino all over your head-got it?\"\\n\\n He just answers silently with a so-what? expression.\\n\\n I watch as he glides confidently outside to where a boxy blue Jeep Commando waits at the curb in front of Masako, its windows tinted black, blocking out the face of the driver. Outside, I take note of various Tex-Mex restaurants, the postapocalyptic mood, my pseudoreality, then head back to the Four Seasons, where all I really want to do is take my shirt off.\\n\\n 12\\n\\n Outside the Four Seasons obligatory paparazzi share cigarettes, glance idly at me as I stand there pretending to ruffle through my pockets for my room key while they wait for the occasional Town Car or limousine to roll up and dispense anyone snapworthy, which today does not include me. Inside: Ralph Fiennes is shaking hands with a twenty-year-old movie producer who I\u0027m sure someone I know has boned and Gabriel Byrne is simultaneously talking on a cell phone, being interviewed by People magazine and sipping a large cup of tea. In other words: it\u0027s all happening, it\u0027s all familiar. The only void: no message from Palakon, which doesn\u0027t relieve me in the way I imagined it would. I push the door to my suite open, turn on MTV-and with a ping, Everything But the Girl floats through the room, which right now is totally arctic. Shivering uncontrollably I push a bunch of Japanese fashion magazines scattered across the bed into a pile and then I\u0027m flopping down, pulling the covers over me, dialing the kitchen for a protein shake and to see what time the hotel\u0027s gym closes.\\n\\n Movement across the room causes me to whirl around.\\n\\n Jamie Fields: legs slung over a floral-patterned swivel chair, wearing an ultrafashionable Prada camisole top, shimmery black disco pants, black stiletto shoes, black Armani sunglasses, and her face is masklike, but after my initial shock I\u0027m projecting something vaguely apologetic it and she confirms this by removing the sunglasses, stoplight-red onto Hard Candy polish on her nails.\\n\\n Jamie notices how distracting they are. \"I know-it\u0027s ugly,\" she sighs, lighting a cigarette. \"It\u0027s for the movie.\"\\n\\n \"Which one?\" I\u0027m asking.\\n\\n She shrugs, exhaling. \"Both?\"\\n\\n \"How did you get in here?\" I ask.\\n\\n \"I\u0027m well acquainted with certain key staff members at the Four Seasons,\" she says casually. \"They know me. They let me do whatever I want. It\u0027s a perk. Let\u0027s leave it at that.\"\\n\\n I pause before asking, \"Are you going to start flailing around again?\"\\n\\n \"No. I\u0027m sorry about all of that.\"\\n\\n Another pause. \"What happened back there?\"\\n\\n \"Oh, I just thought you were someone else,\" she mutters. \"Forget about it. Anywa-a-a-ay...\" \\n\\n","sourceLink":"https://allnovel.net/glamorama/page-120.html","bookId":2683,"book":{"id":2683,"title":"Glamorama","description":"Storyline: The author of American Psycho and Less Than Zero continues to shock and haunt us with his incisive and brilliant dissection of the modern world. In his most ambitious and gripping book yet, Bret Easton Ellis takes our celebrity obsessed culture and increases the volume exponentially. \\n Victor Ward, a model with perfect abs who exists in magazines and gossip columns and whose life resembles an ultra-hip movie, is living with one beautiful model and having an affair with another. And then it\u0027s time to move on to the next stage. But the future he gets is not the one he had in mind.\\n","cover":"https://allnovel.net/images/glamorama.jpg","author":"Bret Easton Ellis","type":"Thriller","source":"allnovel","link":"https://allnovel.net/glamorama.html","creation":"Oct 5, 2019 8:59:06 AM","modification":"Oct 5, 2019 10:09:36 AM"}}
