{"id":69337,"no":150,"title":"Page 150","content":"\"Why didn\u0027t you check it for me?\" Bentley whines. \"Jesus, Bobby.\" \"I didn\u0027t know I was going to stay.\" Bobby shrugs, staring at me.\n After I\u0027m seated at a table with Donatella Versace, Mark Vanderloo, Katrine Boorman, Azzedine Alaia, Franca Sozzani and the Belgian iconoclast and we\u0027ve all laughed at other people\u0027s expense and smoked dozens of cigarettes and waiters have cleared away platcs of food that were barely looked at let alone touched and all of us have whispered secret things to the person on our left, Jamie walks by the table with a joint and asks for a light from Donatella, who\u0027s sitting next to me, and Jamie-while pretending to talk to Donatella, who\u0027s talking to Franca-tells me that Bobby is leaving for Beirut tomorrow and then he\u0027s traveling on to Baghdad and Dublin, where he\u0027s meeting with a member of a Virginia paramilitary group, and he\u0027ll be back in five days. I\u0027m listening intently as she says this and she\u0027s encouraging me to laugh gaily and she relays this information in such a way that if you were across the room-as Bobby is now-you would assume she was telling Donatella how terrific Victor looks or contemplating aloud how fabulous her life turned out and Jamie takes just one hit off the joint before leaving it for the rest of the table to smoke and my foot has fallen asleep, and limping away, trying to follow her, I bump into slow-moving silhouettes and shadows and I notice Bentley making a dashing exit with the Prada backpack and then the rock group Autour de Lucie starts tuning up, about to perform their first song, a cover of the Who\u0027s \"Substitute.\"\n 35\n ABBA\u0027s \"Voulez-Vous\" blasts out over the sound track and in front of Les Bains a white Range Rover waits and in the front passenger seat the director from another film crew is going over tonight\u0027s sequence while in back various assistants staring intently ahead communicate on wireless headphones with the second unit, which has already set up at the designated site. With the Prada backpack slung over his shoulder Bentley hops into the Range Rover as it pulls away, followed by a black Citroen, toward the Boulevard Saint-Germain. Cafe Flore has been canvassed all week and a detailed description of its layout yielded the best table to leave the Prada backpack at. Bentley studies the following scene on two pieces of fax paper, memorizes his lines.\n The cab drops Bentley off a block away from Cafe Flore and he walks quickly, purposefully, over to that outside table just off the sidewalk where Brad, the actor playing the NYU film student Bentley picked up at La Luna last week, is sitting with two friends-Seattle waif boys who attended Camden with Brad-and they\u0027re all stylishly chewing gum and smoking Marlboros, slouching in their seats with perfect hair, and an empty Starbucks cup sits in the middle of the table and by Brad\u0027s feet is a Gap bag filled with newly bought T-shirts. \"Ooh, let\u0027s play dress-up,\" Brad says when he sees Bentley maneuvering toward the table in his Versace tuxedo.\n Cafe Flore is packed, shimmering, every table filled. Bentley notices this with a grim satisfaction but Bentley feels lost. He\u0027s still haunted by the movie Grease and obsessed with legs that he always felt were too skinny though no one else did and it never hampered his modeling career and he\u0027s still not over a boy he met at a Styx concert in 1979 in a stadium somewhere in the Midwest, outside a town he has not been back to since he left it at eighteen, and that boy\u0027s name was Cal, who pretended to be straight even though he initially fell for Bentley\u0027s looks but Cal knew Bentley was emotionally crippled and the fact that Bentley didn\u0027t believe in heaven didn\u0027t make him more endearing so Cal drifted off and inevitably became head of programming at HBO for a year or two. Bentley sits down, already miked, in a crimson-and-forest-green chair and lights a cigarette. Next to them Japanese tourists study maps, occasionally snap photos. This is the establishing shot.\n \"Hey Bentley,\" Brad says. \"This is Eric and Dean. They went to Camden and are both aspiring models. We\u0027ve been comparing diets.\"\n \"So that\u0027s why I thought you all looked so cool,\" Bentley says, the Camden reference causing him to flash on Victor and what\u0027s in store for him.\n \"Laurent Gamier is spinning tonight at Rex,\" Brad says hopefully.\n \"Maybe, maybe,\" Bentley says, nodding, exhaling smoke, and then, looking over at the tattoo circling Dean\u0027s wrist, \"Nice.\"\n \"Do you have it?\" Brad asks, referring to the Ecstasy Bentley was supposed to bring to Cafe Flore.\n \"I\u0027m going to have to go to Basil\u0027s flat,\" Bentley says offhandedly, smiling at Dean again.\n \"Oh man,\" Brad groans, disappointed. \"That\u0027ll take forever.\" \n","sourceLink":"https://allnovel.net/glamorama/page-150.html","bookId":2683,"book":{"id":2683,"title":"Glamorama","description":"Storyline: \n The author of American Psycho and Less Than Zero continues to shock and haunt us with his incisive and brilliant dissection of the modern world. In his most ambitious and gripping book yet, Bret Easton Ellis takes our celebrity obsessed culture and increases the volume exponentially. \n Victor Ward, a model with perfect abs who exists in magazines and gossip columns and whose life resembles an ultra-hip movie, is living with one beautiful model and having an affair with another. And then it\u0027s time to move on to the next stage. But the future he gets is not the one he had in mind.\n \n","cover":"https://allnovel.net/images/glamorama.jpg","author":"Bret Easton Ellis","type":"Thriller","source":"allnovel","link":"https://allnovel.net/glamorama.html","creation":"Oct 5, 2019 8:59:06 AM","modification":"Oct 5, 2019 10:09:36 AM"}}
