{"id":69344,"no":157,"title":"Page 157","content":"\"It\u0027s about attitude as lifestyle, \"Jamie\u0027s saying.\\n\\n \"You\u0027re starting to sound like a Calvin Klein ad, baby, and I don\u0027t like it,\" Bobby growls.\\n\\n Jamie waves playfully at the camera until Bobby\u0027s asked about his involvement with Amnesty International. I turn away, notice Dennis Rodman striding confidently around the room in a loincloth, a giant pair of wings and a diamond nose ring. When I turn back to the table the VJ is asking Bentley how he likes Paris.\\n\\n \"I love everything but the Americans,\" Bentley yawns, being vaguely entertaining. \"Americans are notoriously inept at foreign languages. My idea of tedium? Listening to some nitwit from Wisconsin try and order a glass of ice at Deux Magots.\"\\n\\n From behind me I hear the segment director say to someone, \"We\u0027re not running that.\"\\n\\n \"You should let people proceed at their own pace, Bentley,\" Jamie says gently, leaning in, plucking an unlit cigarette from his hand. \"Don\u0027t have a tizzy.\"\\n\\n \"What are you all wearing?\" the VJ asks, lights and a camera swinging around to the rest of us. \"Just go with it.\"\\n\\n It\u0027s freezing in Natacha, everyone\u0027s breath is steaming and we\u0027re waving away flies, the floor littered with piles of confetti, and the smell of shit is even more pervasive after I do a couple of hits from the packet of coke that I reluctantly hand back to Bentley. Markus Schenkenberg, who thinks he\u0027s my friend but who is not, pulls a chair up next to mine, another photo op, another black snakeskin jacket to show off, another chance for him to tell me, \"We\u0027re not infallible, Victuh.\"\\n\\n \"Is that on the record or off the record?\"\\n\\n Markus yawns as Beatrice Dalle catwalks by, then glances back over at me.\\n\\n \"He\u0027s a terrorist,\" I tell Markus, motioning to Bobby.\\n\\n \"No,\" Markus says, shaking his head. \"He doesn\u0027t look like a terrorist. He\u0027s way too gorgeous.\"\\n\\n Reject the hype, girlfriend,\" I sigh, slouching deeper into my chair. \"That guy\u0027s a terrorist.\"\\n\\n \"No,\" Markus says, shaking his head. \"I know terrorists. That guy doesn\u0027t look like a terrorist.\"\\n\\n \"You\u0027re a daredevil,\" I yawn, giving him shark eye. \"You\u0027re a total renegade.\"\\n\\n \"I\u0027m a little out of control,\" Markus admits. \"I\u0027m thinking of jamming out right now.\"\\n\\n \"He\u0027s the villain,\" I sigh.\\n\\n Someone from Camden is leaning into Jamie, a French guy named Bertrand who was Sean Bateman\u0027s roommate, whispering something in her ear, both of them staring at me. Jamie keeps nodding until Bertrand says something that causes her to stiffen up and stop nodding and she has to push Bertrand away, her face falling apart. Bertrand glares at me while folding back into the crowd. Mario Sorrenti and David Sims materialize, surrounding Markus. Bobby starts tablehopping with Shoshanna Lonstein, a former Talking Head, the magician David Blaine and Snoopy Jones. In tears, Tammy runs away from Bruce, who has China Chow perched on his knees, and a dealer Bentley sent over named the Grand Poobah whispers \"Have you been experienced?\" in my ear and arrangements are made.\\n\\n 32\\n\\n A shot of Scotch tape being applied with rubber gloves to a white metal gas canister. This shot-with the camera slowly pulling back-is intercut with one of me taking a shower, slowly soaping my chest, my legs, the camera gliding gratuitously up over my ass, water cascading down the flexing muscles in my back. Another shot of the thick metal canister sitting on a Hans Wegner ottoman. A quick montage of my character dressing-slipping on Calvin Klein boxer-jockeys, a lime-green Prada turtleneck, a Yohji Yamamoto suit with a close-up of the label for the audience\u0027s gratification. A close-up of my face, a hand entering the frame to slip on a pair of black Ray-Bans (an instance of well-paid product placement). Another close-up: a Xanax tablet placed on my tonglic, a bottle of Volvic water tilted toward my lips. A shot of the gas canister being packed into a Louis Vuitton tote bag.\\n\\n An exterior shot of Hozan. A brief interior shot of me eating a late lunch and in this shot the Christian Bale guy walks past me but I don\u0027t notice because I\u0027m concentrating on the patrolmen walking by carrying submachine guns, because I\u0027m distracted by the arm that has fallen asleep. Shots of me moving down Rue de Fourey toward the Seine. A shot of me on Pont Marie crossing the Ile Saint-Louis with Notre Dame looming up above me, the sky gray and overcast. Then I\u0027m crossing the Seine onto the Left Bank. A shot of me turning right on Boulevard Saint-Germain. A shot of me descending into a metro station. This shot lingers for several seconds on a crowd of straggling tourists. \\n\\n","sourceLink":"https://allnovel.net/glamorama/page-157.html","bookId":2683,"book":{"id":2683,"title":"Glamorama","description":"Storyline: The author of American Psycho and Less Than Zero continues to shock and haunt us with his incisive and brilliant dissection of the modern world. In his most ambitious and gripping book yet, Bret Easton Ellis takes our celebrity obsessed culture and increases the volume exponentially. \\n Victor Ward, a model with perfect abs who exists in magazines and gossip columns and whose life resembles an ultra-hip movie, is living with one beautiful model and having an affair with another. And then it\u0027s time to move on to the next stage. But the future he gets is not the one he had in mind.\\n","cover":"https://allnovel.net/images/glamorama.jpg","author":"Bret Easton Ellis","type":"Thriller","source":"allnovel","link":"https://allnovel.net/glamorama.html","creation":"Oct 5, 2019 8:59:06 AM","modification":"Oct 5, 2019 10:09:36 AM"}}
