{"id":69357,"no":170,"title":"Page 170","content":"that my breath is steaming as I keep staring down at Jamie and Bobby sleeping on the bed.\n On Bobby\u0027s shoulder is a tattoo, black and shapeless, I never noticed before.\n A QE2 flashback, a montage with strobe lights.\n The smell of the sea, an October afternoon, the Atlantic moving slowly below us, midnight, meeting Marina outside Club Lido, her voice raspy from crying, the fog machines, Marina backlit in front of a bathroom drawer, how shy she seemed at the railing, how purposefully she moved around my cabin, the hooded parka.\n There was the hair hanging over Marina\u0027s face. And there was the hooded parka.\n There was the tattoo, black and shapeless, on her right shoulder blade.\n This tattoo did not exist the afternoon we first met.\n You never saw Marina\u0027s face that night.\n \"You have to go to London,\" a voice whispered.\n That night, you never touched her body.\n You understand that something incomplete is being revealed.\n An unscheduled stop mid-crossing.\n Someone climbs aboard a ship.\n A girl you didn\u0027t save was doomed.\n It\u0027s all very clear but you have to keep guessing.\n It\u0027s what you don\u0027t know that matters most. This is what the director told you.\n I dress, then stagger outside.\n When I look back up at the house he\u0027s standing in a bedroom window. He\u0027s looking down at me. He\u0027s holding a finger to his lips. He\u0027s saying \"Shhh.\"\n 26\n Because metro service doesn\u0027t begin until 5:30 I\u0027m walking aimlessly through a dark early-morning fog, staggering for long stretches, until automatic timers turn the streetlights off and clubs are just closing and a figure, a specter, strolling by smiles venomously at me and in the fog the outlines of glass and concrete towers keep shifting shapes and without thinking about direction I find myself walking toward the Eiffel Tower, through the Parc du Champ de Mars and then across the Seine on the Pont d\u0027Iena and then past the Palais de Chaillot. A pigeon bursts out of the fog, leaving a swirling trail behind. Without warning, leaning against a black Citroen, in the fog, is the Christian Bale look-alike.\n \"Victor?\" he asks, rock-faced, subdued. He\u0027s wearing a black cardigan, ankle boots, a Prada overcoat.\n Silently I walk up to him, the streets littered with confetti, the fog locking in on us.\n \"Someone wants to see you,\" he says simply.\n I just nod and without any prodding get into the back of the Citroen, lying flat across the seat, then curling up once the car starts moving, and I\u0027m making noises in the backseat, sometimes weeping. He tells me not to crack up. He remarks delicately about an opening in my destiny. But I\u0027m paying minimal attention, listening to him as closely as I would listen to a brick, a tree, a pile of sand. Finally, absurdly, I ask, \"Do you know who I am?\" On the radio: something emblematic of where I\u0027m at in this moment, something like \"Don\u0027t Fear the Reaper\" or \"I\u0027m a Believer.\"\n A hotel on Avenue Kleber.\n Following the Christian Bale guy down a hallway lined with photos of mostly dead celebrities, I\u0027m so drowsy I can barely keep up with him and the lights above us keep flickering chicly and at the far end we arrive at a door covered with a thin sheet of frost.\n Inside the room all the lights are dimmed, and sitting at a desk, Sky TV glowing soundlessly on a large-screen television behind him, legs primly crossed, smoking a cigarette, is F. Fred Palakon.\n I appear seemingly nonplussed.\n \"Hello, Victor,\" Palakon says. \"How are things?\" he asks menacingly. \"Remember me?\"\n The Christian Bale guy closes the door behind us, then locks it.\n Palakon gestures toward the edge of the bed. After I sit down, facing him, he recrosses his legs, regarding me unfavorably. It\u0027s freezing in the hotel room and I rub my hands together to keep them warm.\n \"I got... lost,\" is all I say, shamefully.\n \"Well, not really,\" Palakon says. \"Not what you\u0027d technically call \u0027lost,\u0027 but I suppose there\u0027s some truth in your statement.\"\n I\u0027m staring at the carpet, at the patterns revealing themselves in the carpet, and I keep rubbing my hands together to keep them warm.\n \"I see you\u0027ve taken up with quite a crowd,\" Palakon says. \"I shouldn\u0027t be surprised. A hip, happening, gorgeous young thing like yourself, all alone in Paris.\" He says this with such harsh articulation that I have to flinch and look away. \"I see you have a tan.\"\n \"Palakon, I-\"\n \"Mr. Ward, please don\u0027t say anything,\" Palakon warns. \"Not yet.\"\n \"Palakon, you never called me in England,\" I say in a rush. \"What was I supposed to do?\" \n","sourceLink":"https://allnovel.net/glamorama/page-170.html","bookId":2683,"book":{"id":2683,"title":"Glamorama","description":"Storyline: \n The author of American Psycho and Less Than Zero continues to shock and haunt us with his incisive and brilliant dissection of the modern world. In his most ambitious and gripping book yet, Bret Easton Ellis takes our celebrity obsessed culture and increases the volume exponentially. \n Victor Ward, a model with perfect abs who exists in magazines and gossip columns and whose life resembles an ultra-hip movie, is living with one beautiful model and having an affair with another. And then it\u0027s time to move on to the next stage. But the future he gets is not the one he had in mind.\n \n","cover":"https://allnovel.net/images/glamorama.jpg","author":"Bret Easton Ellis","type":"Thriller","source":"allnovel","link":"https://allnovel.net/glamorama.html","creation":"Oct 5, 2019 8:59:06 AM","modification":"Oct 5, 2019 10:09:36 AM"}}
