{"id":69358,"no":171,"title":"Page 171","content":"\"That is because I was informed you never checked into the Four Seasons,\" Palakon says sharply. \"How were we supposed to call you when we had no idea where you were?\"\n \"But... that\u0027s not true,\" I say, sitting up. \"Who told you that? I mean, what are you talking about, Palakon?\"\n \"It means that there are no records of you ever staying at the Four Seasons,\" Palakon says. \"It means that if someone tried to contact you at the Four Seasons we were simply told that neither a Mr. Victor Ward nor a Mr. Victor Johnson was staying there.\" An icy pause. \"What happened to you, Victor?\"\n \"But I checked in,\" I\u0027m protesting. \"The driver who picked me up in Southampton saw me check in.\"\n \"No, Victor,\" Palakon says. \"The driver saw you walk in. He did not see you check in.\"\n \"This is wrong,\" I\u0027m muttering.\n \"All attempts to get in touch with you at the Four Seasons proved fruitless,\" Palakon says, glaring. \"When we finally tried to make actual physical contact, as in searching the hotel for you, we came up with nothing.\"\n \"Ask him,\" I say, pointing at the Christian Bale guy, standing behind me. \"He\u0027s been following me ever since I got to London.\"\n \"Not really,\" Palakon says. \"He lost you that night after you were at Pylos and didn\u0027t find you again until the other night, when he spotted you at the opera.\" Pause. \"With Jamie Fields.\"\n I don\u0027t say anything.\n \"But because of your actions let\u0027s just say his part has been beefed up considerably.\"\n \"Palakon,\" I start. \"I don\u0027t care about the money anymore. I just want to get the hell out of here.\"\n \"That\u0027s very noble, Mr. Ward, but you were supposed to get Jamie Fields out of London and back to the States,\" Palakon says. \"Not traipse off to Paris. So the money-as of now-is beside the point.\"\n Looking down again, I mutter, \"I traipsed, I traipsed, I admit it, I traipsed...\"\n \"Why are you...\" Palakon sighs, looks up at the ceiling, curved and stained, and then, thoroughly annoyed, back at me. \"Why are you in Paris, Mr. Ward?\"\n I\u0027m still muttering, \"I traipsed, I traipsed...\"\n \"Mr. Ward,\" Palakon snaps. \"Please.\"\n \"What else do you know?\" I ask. \"How did you find me?\"\n Palakon sighs again, puts his cigarette out, runs his hands over the jacket of a very natty suit.\n \"Since you had mentioned that you were going to follow that girl you met on the ship to Paris, we simply pursued a few theories.\"\n \"Who is \u0027we,\u0027 Palakon?\" I ask hesitantly.\n \"Does the third person alarm you?\"\n \"Who\u0027s... the third person?\"\n \"Mr. Ward, what is the situation as of now?\"\n \"The... situation is... the situation is...\" Grasping, unable to figure it out, I just give up. \"The situation is out of my control.\"\n Palakon takes this in. \"That\u0027s too bad.\" After a thoughtful pause, he asks, gently, \"Can it be remedied?\"\n \"What does that... mean?\" I ask. \"Remedied? I told you-it\u0027s out of my control.\"\n Palakon runs a hand along the desk he\u0027s sitting at and then, after a long pause, asks, \"Are you in any position to fix things?\"\n \"I don\u0027t know.\" I\u0027m vaguely aware of my feet and arms slowly falling asleep as I sit slumped on the edge of the bed. \"I\u0027m not sure.\"\n \"Well, let\u0027s start with does she trust you?\" he asks. \"Is she willing to leave? Is she coming back to the States?\" Another pause. \"Is she in love with you?\"\n \"We\u0027ve... been intimate,\" I say hollowly. \"I\u0027m not sure-\"\n \"Congratulations,\" Palakon says. \"So you\u0027ve become a duo. How cute. How\"-he tilts his head-\"apropos.\"\n \"Palakon, I don\u0027t think you know what\u0027s going on.\" I swallow. \"I don\u0027t think you\u0027re in the same movie,\" I say carefully.\n \"Just get Jamie Fields out of Paris,\" Palakon says. \"Just get her back to New York. I don\u0027t care how you do it. Promise her things, marry her, perform a kidnapping, whatever.\"\n I\u0027m exhaling steam. \"She has... a boyfriend.\"\n \"That has never been an impediment for you before, Mr. Ward,\" Palakon says. \"Who is it? Who\u0027s she seeing? Someone in that house? Not Bruce Rhinebeck. And it can\u0027t be Bentley Harrolds.\"\n \"It\u0027s Bobby Hughes,\" I say hollowly.\n \"Ah, of course,\" Palakon says. \"I\u0027d forgotten about him.\" \n","sourceLink":"https://allnovel.net/glamorama/page-171.html","bookId":2683,"book":{"id":2683,"title":"Glamorama","description":"Storyline: \n The author of American Psycho and Less Than Zero continues to shock and haunt us with his incisive and brilliant dissection of the modern world. In his most ambitious and gripping book yet, Bret Easton Ellis takes our celebrity obsessed culture and increases the volume exponentially. \n Victor Ward, a model with perfect abs who exists in magazines and gossip columns and whose life resembles an ultra-hip movie, is living with one beautiful model and having an affair with another. And then it\u0027s time to move on to the next stage. But the future he gets is not the one he had in mind.\n \n","cover":"https://allnovel.net/images/glamorama.jpg","author":"Bret Easton Ellis","type":"Thriller","source":"allnovel","link":"https://allnovel.net/glamorama.html","creation":"Oct 5, 2019 8:59:06 AM","modification":"Oct 5, 2019 10:09:36 AM"}}
