{"id":69365,"no":178,"title":"Page 178","content":"Sam Ho and Victor Ward in dozens of positions, straining and naked, a p**n ographic montage. Bentley leans back, satisfied, hands behind his head, a movie pose even though no camera is around to capture it. \"Would you like to see another file?\" Bentley asks, but it\u0027s really not a question because he\u0027s already tapping keys. \"Let\u0027s see,\" he muses. \"Which one?\" A flash. A command is tapped. A list appears, each entry with a date and file number. \"VICTOR\" CK Show \"VICTOR\" Telluride w/S Ulrich \"VICTOR\" Dogstar concert w/K Reeves \"VICTOR Union Square w/L Hynde \"VICTOR\" Miami, Ocean Drive \"VICTOR\" Miami, lobby, Delano \"VICTOR\" QE2 series \"VICTOR\" Sam Ho series VICTOR Pylos w/S Ho \"VICTOR\" Sky Bar w/Rande Gerber \"VICTOR\" GQ Shoot wq Fields, M Bergin \"VICTOR\" Cafe Flore w/Brad, Eric, Dean \"VICTOR\" Institute of Political Studies \"VICTOR\" New York, Balthazar \"VICTOR\" New York, Wallflowers \"VICTOR\" Annabel\u0027s w/ J Phoenix \"VICTOR\" 80th and Park w/A Poole \"VICTOR\" Hell\u0027s Kitchen w/Mica, NYC As Bentley continuously scrolls down the screen it becomes apparent that this list goes on for pages and pages. Bentley starts tapping keys, landing on new photos. He enhances colors, adjusts tones, sharpens or softens images. Lips are digitally thickened, freckles are removed, an ax is placed in someone\u0027s outstretched hand, a BMW becomes a Jaguar which becomes a Mercedes which becomes a broom which becomes a frog which becomes a mop which becomes a poster of jenny McCarthy, license plates are altered, more blood is spattered around a crime-scene photo, an uncircumciscd penis is suddenly circumcised. Tapping keys, scanning images, Bentley adds motion blur (a shot of \"Victor\" jogging along the Seine), he\u0027s adding lens flair (in a remote desert in eastern Iran I\u0027m shaking hands with Arabs and wearing sunglasses and pouting, gasoline trucks lined up behind me), he\u0027s adding graininess, he\u0027s erasing people, he\u0027s inventing a new world, seamlessly. \"You can move planets with this,\" Bentley says. \"You can shape lives. The photograph is only the beginning.\" After a long time passes, I say in a low voice, staring silently at the computer, \"I don\u0027t want to hurt your feelings, but... I think you suck.\" \"Were you there or were you not?\" Bentley asks. \"It all depends on who you ask, and even that really doesn\u0027t matter anymore.\" \"Don\u0027t...\" But I forget what I was going to say. \"There\u0027s something else you need to see,\" Bentley says. \"But you should take a shower first. Where have you been? You look like shit. In the shower, breathing erratically, I\u0027m flashing over the two files in the giant list containing my name with the most recent dates. \"VICTOR\" Washington DC w/Samuel Johnson (father) \"VICTOR\" Washington DC w/Sally Johnson (sister) 22 After the shower, I\u0027m led downstairs at gunpoint (which Bobby thought was excessive, needless, but not Bruce Rhinebeck) to a room hidden within a room in what I assume is some kind of basement in the house in the 8th or the 16th. This is where the French premier\u0027s son, chained to a chair, is slowly being poisoned. He\u0027s naked, gleaming with sweat, confetti floats on a puddle of blood congealing on the floor beneath him. His chest is almost completely blackened, both ni**les are missing, and because of the poison Bruce keeps administering he\u0027s having trouble breathing. Four teeth have been removed and wires are stretching his face apart, some strung through broken lips, causing him to look as if he\u0027s grinning at me. Another wire is inserted into a wound on his stomach, attaching itself to his liver, lashing it with electricity. He keeps fainting, is revived, faints again. He\u0027s fed more poison, then morphine, as Bentley videotapes. It smells sweet in the room underground and I\u0027m trying to avert my eyes from a torture saw that sits on top of a Louis Vuitton trunk but there\u0027s really nowhere else to focus and music piped into the room comes from one of two radio stations (NOVA or NRJ). Bruce keeps yelling questions at the actor, in French, from a list of 320, all of them printed out in a thick stack of computer paper, many of them repeated in specific patterns, while Bobby stares levelly from a chair out of camera range, his mouth downturned. The French premier\u0027s son is shown photographs, glares wildly at them. He has no idea how to respond. \"Ask him 278 through 291 again,\" Bobby mutters at one point. \"At first in the same sequence. Then repeat them in C sequence.\" He directs Bruce to relax the mouth wires, to administer another dose of morphine.","sourceLink":"https://allnovel.net/glamorama/page-178.html","bookId":2683,"book":{"id":2683,"title":"Glamorama","description":"Storyline: The author of American Psycho and Less Than Zero continues to shock and haunt us with his incisive and brilliant dissection of the modern world. In his most ambitious and gripping book yet, Bret Easton Ellis takes our celebrity obsessed culture and increases the volume exponentially. Victor Ward, a model with perfect abs who exists in magazines and gossip columns and whose life resembles an ultra-hip movie, is living with one beautiful model and having an affair with another. And then it\u0027s time to move on to the next stage. But the future he gets is not the one he had in mind.","cover":"https://allnovel.net/images/glamorama.jpg","author":"Bret Easton Ellis","type":"Thriller","source":"allnovel","link":"https://allnovel.net/glamorama.html","creation":"Oct 5, 2019 8:59:06 AM","modification":"Oct 5, 2019 10:09:36 AM"}}
