{"id":69418,"no":231,"title":"Page 231","content":"\"Sally?\" I\u0027m breathing hard, my voice tight. \"Who is this?\" she asks suspiciously. \"It\u0027s me,\" I gasp. \"It\u0027s Victor.\" \"Uh-huh,\" she says dubiously. \"I\u0027d really prefer it-whoever this is-if you would stop calling.\" \"Sally, it\u0027s really me, please-\" I gasp. \"It\u0027s for you,\" I hear her say. The sound of the phone being passed to someone else.\" \"Hello?\" a voice asks. I don\u0027t say anything, just listen intently. \"Hello?\" the voice asks again. \"This is Victor Johnson,\" the voice says. \"Who is this?\" Silence. \"It\u0027d be really cool if you stopped bothering my sister,\" the voice says. \"Okay?\" Silence. \"Goodbye,\" the voice says. A click. I\u0027m disconnected. 10 Davide wants some privacy. He hands me a sweater, suggesting I go for another walk. The girl is smoking a cigarette, sitting naked on a plush tan couch. She glances over at me, waiting. Numb, I comply. At the door, standing in the hallway, I ask Davide, \"How do you know I\u0027ll come back?\" \"I trust you,\" he says, smiling, urging me out. \"Why?\" I ask. \"Because,\" he says, gesturing, still smiling, \"you have no place to go.\" The way he says this is so charming I just nod and actually thank him. \"Thank you,\" I say to Davide. Behind him the girl walks toward the bed. She stops, twisting her muscular body, and whispers something urgently in Italian to Davide. Davide closes the door. I hear him lock it. 11 I take the service elevator down to the lobby and outside it\u0027s night and the streets are wet and water drips down the facades of the buildings I pass but it\u0027s not raining. A taxi cruises by. I step out of the way of fast-skating Rollerbladers. And I\u0027m still feeling filmed. How many warnings had I ignored? 12 Back at the hotel, an hour later. I take the service elevator up to my floor. I move slowly down the empty hallway. At my room, I pull out a key, knocking first. There\u0027s no answer. The key slips into the lock. I push the door open. Davide lies naked in a pile in the bathroom. No specific visible wound, but his skin is broken in so many places I can\u0027t tell what happened to him. The floor beneath Davide is washed over with blood, dotted with smashed hotel china. Dramatic lightning from outside. There\u0027s no sign of the girl. Blaming myself, I walk downstairs to the bar. 13 In a nearby room in the Principe di Savoia a propmaster is loading a 9mm mini-Uzi. 14 Sinead O\u0027Connor was singing \"The Last Day of Our Acquaintance and it was either 11:00 or 1:00 or maybe it was 3:15 and we were all lying around Gianni\u0027s pool in the big house on Ocean Drive and there were about twenty of us and everyone was talking into a cell phone and doing dope and I had just met Chloe earlier that week. She was lying on a chaise longue, burning under the sun, and her lips were puffy from collagen injections and my skull was on fire from a hangover caused by a dozen mango daiquiris and I was carefully eyeing the forty-carat diamond she was wearing, and the lemonade I was drinking stung my mouth and everyone was saying \"So what?\" and there had been a cockroach sighting earlier and people were basically becoming unglued. There were boys everywhere-slim, full-lipped, big-bulged, sucking in their cheeks-and there were also a couple of rock stars and a teenage g*y guy from Palestine bragging about a really cool stone-throwing he\u0027d attended in Hebron. All of this under a calm gumball-blue sky. And Sinead O\u0027Connor was singing \"The Last Day of Our Acquaintance\" and a girl lying across from me was positioned in such a way that I could see her anus and she would reach under her bikini bottom and scratch it, then bring her fingers to her face and lightly smell them. On a huge Bang Olufsen TV that had been wheeled out, an episode of \"The X-Files\" was playing where someone\u0027s dog had been eaten by a sea serpent and for some reason everyone was reading a book called The Amityville Horror and tired from last night\u0027s premiere for a new movie called Autopsy 18-the guy hunched over the Ouija board, the girl just back from Madonna\u0027s baby shower, the kid playing with a cobra he\u0027d bought with a stolen credit card. A big murder trial was going on that week in which the defense team convinced me that the victim-a seven-year-old girl fatally beaten by her drunken father-was actually guilty of her own death. Mermaids had been spotted during a swim before dawn. \"Could you kill somebody?\" I heard a voice ask.","sourceLink":"https://allnovel.net/glamorama/page-231.html","bookId":2683,"book":{"id":2683,"title":"Glamorama","description":"Storyline: The author of American Psycho and Less Than Zero continues to shock and haunt us with his incisive and brilliant dissection of the modern world. In his most ambitious and gripping book yet, Bret Easton Ellis takes our celebrity obsessed culture and increases the volume exponentially. Victor Ward, a model with perfect abs who exists in magazines and gossip columns and whose life resembles an ultra-hip movie, is living with one beautiful model and having an affair with another. And then it\u0027s time to move on to the next stage. But the future he gets is not the one he had in mind.","cover":"https://allnovel.net/images/glamorama.jpg","author":"Bret Easton Ellis","type":"Thriller","source":"allnovel","link":"https://allnovel.net/glamorama.html","creation":"Oct 5, 2019 8:59:06 AM","modification":"Oct 5, 2019 10:09:36 AM"}}
