{"id":69227,"no":40,"title":"Page 40","content":"\"I really need to see this, Dad.\"\n \"When were you in Miami?\"\n \"I haven\u0027t been to Miami in months,\" I stress. \"This is so sad-mistaking your own flesh and blood, your own son, a-\"\n \"Victor,\" my father says calmly, \"your name was in the caption below the photo.\"\n \"I don\u0027t think that was me, dude.\"\n \"Well,\" he starts lightly, \"if it wasn\u0027t you, Victor, then who was it?\"\n \"I will have to check this out, baby.\"\n \"And what\u0027s with your last name?\" he asks. \"You\u0027re still sticking with Ward?\"\n \"I thought changing my last name was your idea, bro.\"\n \"It seemed like a good idea at the time,\" he murmurs, delicately opening a folder containing press clippings, faxes of press clippings, photos of me.\n \"This is a quote from\"-my father turns a blurry fax over-\"from the New York Times Styles section, actually. A smallish article about you, and this pull quote: `In the uterus of love we are all blind cave fish.\u0027 Is this true, Victor? Could you please explain the term `uterus\u0027 in the context of that sentence? And also if blind cave fish actually exist?\"\n \"Oh boy-a two-parter. Dude, this is so bogus,\" I sigh. \"The press always distorts what I say.\"\n \"Well, what are you saying?\"\n \"Why are you so literal-minded?\"\n \"A CK One ad. Here it looks as if there are two guys-though what the hell do I know, it could be two gals-and yes, they\u0027re kissing each other and you\u0027re looking on with your hands down the front of your pants. Why are your hands down the front of your pants? Is this gesture supposed to tell us that CK One is a reliable product?\"\n \"Sex sells, dude.\"\n Chapter Five\n \"I see.\"\n \"The better you look, the more you see.\"\n \"Here\u0027s an interview from, um, YouthQuake-and by the way, congratulations on making the cover, wearing an eye shadow that\u0027s a lovely shade of brown-\"\n \"It\u0027s terra-cotta,\" I sigh. \"But whatever.\"\n \"-and they ask you who you would most like to have lunch with, and your answers are: the Foo Fighters, astrologist Patric Walker-who is dead, incidentally-and (this isn\u0027t a misprint, right?) the Unabomber?\"\n I stare back at him. \"So?\"\n \"You want to have lunch with... the Unabomber?\" he asks. \"Is this valuable information? Do we really need to know this about you?\"\n \"What about my fans?\"\n \"Another quote attributed to you, unless this is another distortion: `Washington, D.C., is the stupidest city in the world, with the, like, dumbest people in it.\u0027\"\n \"Oh Dad-\"\n \"I work and live in Washington, D.C., Victor. What you say and do actually affects my life, and because of what my life is like, it can be acutely embarrassing for me.\"\n \"Dad-\"\n \"I just wanted to point this out.\"\n \"Spare me, please.\"\n \"It also says here that you\u0027re in a band called Pussy Beat, which used to be called\"-he gulps-\"Kitchen Bitch.\"\n \"We\u0027ve changed the name. We\u0027re the Impersonators now.\"\n \"Oh Jesus, Victor. It\u0027s just that whole crowd-\"\n \"Dad, I freaked out when Charlie and Monique tattooed their baby. Jeez-what? You think I\u0027m some kind of delinquent?\"\n \"Add to this that your sister says outtakes of you from that Madonna book are showing up on the Internet-\"\n \"Dad, it\u0027s all under control.\"\n \"How can you say that?\" he asks. \"It\u0027s just tacky, Victor. Very tacky.\"\n \"Dad, life is tacky.\"\n \"But you don\u0027t need to win first prize.\"\n \"So what you\u0027re saying, basically, is that I\u0027m a mixed bag.\"\n \"No,\" he says. \"Not exactly.\"\n \"So I guess more cash is out of the question?\"\n \"Victor, don\u0027t do this. We\u0027ve been over that many, many times.\"\n I pause. \"So I guess more cash is out of the question?\"\n \"I think the trust should suffice.\"\n \"Hey, New York\u0027s expensive-\"\n \"Then move.\"\n \"Oh my god, get real.\"\n \"What are you trying to tell me, Victor?\"\n \"Dad.\" I breathe in. \"Let\u0027s face it. I\u0027m broke.\"\n \"You have a check coming in a couple of days.\"\n \"It\u0027s gone.\"\n \"How can the check be gone if you haven\u0027t even received it yet?\" \n","sourceLink":"https://allnovel.net/glamorama/page-40.html","bookId":2683,"book":{"id":2683,"title":"Glamorama","description":"Storyline: \n The author of American Psycho and Less Than Zero continues to shock and haunt us with his incisive and brilliant dissection of the modern world. In his most ambitious and gripping book yet, Bret Easton Ellis takes our celebrity obsessed culture and increases the volume exponentially. \n Victor Ward, a model with perfect abs who exists in magazines and gossip columns and whose life resembles an ultra-hip movie, is living with one beautiful model and having an affair with another. And then it\u0027s time to move on to the next stage. But the future he gets is not the one he had in mind.\n \n","cover":"https://allnovel.net/images/glamorama.jpg","author":"Bret Easton Ellis","type":"Thriller","source":"allnovel","link":"https://allnovel.net/glamorama.html","creation":"Oct 5, 2019 8:59:06 AM","modification":"Oct 5, 2019 10:09:36 AM"}}
