{"id":69233,"no":46,"title":"Page 46","content":"\"I personally think a cocktail-mix version of `Shiny Happy People\u0027 is hopping-\"\\n\\n \"REM is classic rock, Victor,\" Conrad says patiently. \"We do not do classic-rock covers.\"\\n\\n \"Oh god, I want to kill myself,\" Fergy moans.\\n\\n \"Hey-but the good news, everyone, is that Courtney Love\u0027s over thirty,\" I say happily.\\n\\n \"Okay. I feel better.\"\\n\\n \"What kind of royalties is Courtney getting from Nirvana sales?\" Aztec asks Fergy.\\n\\n \"Was there a prenup?\" Fergy wonders.\\n\\n Shrugs all around.\\n\\n \"So,\" Fergy concludes, \"since Kurt\u0027s demise maybe nothing.\"\\n\\n \"Hey, come on-Kurt Cobain didn\u0027t die,\" I say. \"His music lives on in all of us.\"\\n\\n \"We really need to focus on new material, guys,\" Conrad says.\\n\\n \"Well, can we at least write one song without a shitty reggae beat that starts off with the line `I was a trippin in da crack house late last night\u0027?\" I ask. \"Or `Dere\u0027s a rat in da kitchen-what I gonna do?\u0027\"\\n\\n Aztec pops open a Zima and restrums his Fender contemplatively.\\n\\n \"When\u0027s the last time you guys made a demo?\" I ask, noticing Chloe on the cover of the new Manhattan File next to the latest Wired and the copy of YouthQuake with me on the front, totally defaced with purple ink.\\n\\n \"Last week, Victor,\" I hear Conrad say through gritted teeth.\\n\\n \"That\u0027s a million years ago,\" I murmur, flipping around for the article about her. It\u0027s all blah blah blah-the last year of doing runway shows, the Lancome contract, her diet, movie roles, denying the rumors about heroin addiction, Chloe talking about wanting to have kids (\"A big playpen, the whole thing,\" she\u0027s quoted), a photo of us at the VH 1 Fashion and Music Awards, with me staring vacantly into the camera, a photo of Chloe at the Doppelganger party celebrating the Fifty Most Fabulous People in the World, Baxter Priestly trailing behind her-and I\u0027m trying to remember what my relationship with Lauren Hynde was like back at Camden or if there even was one, as if, right now, in the loft on Bond Street, it matters.\\n\\n \"Victor,\" Conrad\u0027s saying, hands on hips, \"a lot of bands are in the music biz for the totally wrong reasons: to make money, to get laid-\"\\n\\n \"Whoa, wait a minute, Conrad.\" I hold my hands out, sitting up. \"These are the wrong reasons? Really? Let me just get this straight.\"\\n\\n \"All you do here, Victor, is drink beer and reread magazines that you or your girlfriend happen to be in this month,\" Conrad says, looming over me.\\n\\n \"And you\u0027re all so lost in the past, man\", I say wearily. \"Captain Beefheart records? Yoghurt? What the f**k is like going in here, huh?\" I exclaim. \"And Jesus, Aztec-cut your toenails! Where are your f**king morals? What do you even do besides going to f**king poetry reading at Fez? Why don\u0027t you go to a f**king gym or something?\"\\n\\n \"I get enough exercise,\" Aztec says dubiously.\\n\\n \"Rolling a joint isn\u0027t exercise, guy,\" I say. \"And shave off that goddamn facial hair. You look like a f**king billy goat.\"\\n\\n \"I think it\u0027s time you calm down, Victor,\" Aztec says, \"and take your place with the glitterati.\"\\n\\n \"I\u0027m just offering you an escape from that whole stale hippie vibe.\"\\n\\n Fergy looks over at me and shivers vaguely.\\n\\n \"You\u0027re jeopardizing our friendship, dude,\" I say, though it emerges from my mouth without a lot of concern.\\n\\n \"You\u0027re never here long enough, Victor, to jeopardize anything!\" Conrad shouts.\\n\\n \"Oh spare me,\" I mutter, getting up to leave.\\n\\n \"Just go, Victor,\" Conrad sighs. \"No one wants you here. Go open your big tacky club.\"\\n\\n I grab my portfolio and bag of CDs and head toward the door.\\n\\n \"You all feel this way?\" I\u0027m asking, standing over Fitz, who wipes his nose on the ice-hockey jersey he\u0027s using as a pillow, eyes closed, sleeping serenely, dreaming about cartons of methadone. \"I bet Fitz wants me to stay. Don\u0027t you, Fitz?\" I ask, leaning down, trying to shake him awake. \"Hey Fitz, wake up.\"\\n\\n \"Don\u0027t even try, Victor,\" Fergy yawns.\\n\\n \"What\u0027s wrong with the Synthman?\" I ask. \"Besides spending his teen years in Goa.\"\\n\\n \"He went on a Jagermeister binge last night,\" Conrad sighs. \"He\u0027s on ibogaine now.\"\\n\\n \"And so?\" I ask, still prodding Fitz.\\n\\n \"And for breakfast Ecstasy cut with too much heroin.\"\\n\\n \"Too much?\"\\n\\n \"Too much heroin.\" \\n\\n","sourceLink":"https://allnovel.net/glamorama/page-46.html","bookId":2683,"book":{"id":2683,"title":"Glamorama","description":"Storyline: The author of American Psycho and Less Than Zero continues to shock and haunt us with his incisive and brilliant dissection of the modern world. In his most ambitious and gripping book yet, Bret Easton Ellis takes our celebrity obsessed culture and increases the volume exponentially. \\n Victor Ward, a model with perfect abs who exists in magazines and gossip columns and whose life resembles an ultra-hip movie, is living with one beautiful model and having an affair with another. And then it\u0027s time to move on to the next stage. But the future he gets is not the one he had in mind.\\n","cover":"https://allnovel.net/images/glamorama.jpg","author":"Bret Easton Ellis","type":"Thriller","source":"allnovel","link":"https://allnovel.net/glamorama.html","creation":"Oct 5, 2019 8:59:06 AM","modification":"Oct 5, 2019 10:09:36 AM"}}
