{"id":69234,"no":47,"title":"Page 47","content":"\"Instead of like...\"\n \"The right amount of heroin, Victor.\"\n \"Christ,\" I mutter.\n \"Oh boy, Victor.\" Conrad smirks. \"Farm living\u0027s the life for you.\"\n \"I\u0027d rather be a farmer than hang out with people who drink their own blood, you f**king hippie vampires.\"\n \"Fitz is also suffering from binocular dysphoria and carpal tunnel syndrome.\"\n \"Shine on, you crazy diamond.\" I rummage in my coat pocket and start handing out free drink tickets. \"Well, I guess I\u0027m here to tell you I\u0027m quitting the band and these are only good between 11:46 and 12:01 tonight.\"\n \"So that\u0027s it?\" Conrad asks. \"You\u0027re just quitting?\"\n \"I give you my blessing to continue,\" I say, placing two free-drink tickets on Fitz\u0027s leg.\n \"Like you even care, Victor,\" Conrad says.\n \"I think this is good news, Conrad,\" Fergy says, shaking the Magic 8 Ball. \"I think, Far out. In fact Magic 8 Ball says `Far Out\u0027 too.\" He holds the ball up for us to see.\n \"It\u0027s just this whole indie-rock scene equals yuck,\" I say. \"Y\u0027know what I\u0027m saying?\"\n Conrad just stares at Fitz.\n \"Conrad, hey, maybe we should go bungee jumping with Duane and Kitty this weekend,\" Aztec says. \"How about it, Conrad? Conrad?\" Pause. \"Conrad?\"\n Conrad continues to stare at Fitz, and as I\u0027m leaving he says, \"Has anybody realized that our drummer is the most lucid person in this band?\"\n 17\n Walking up Lafayette unable to shake off the feeling of being followed and stopping on the corner of East Fourth I catch my reflection superimposed in the glass covering of an Armani Exchange ad and it\u0027s merging with the sepia-toned photo of a male model until both of us are melded together and it\u0027s hard to turn away but except for the sound of my beeper going off the city suddenly goes quiet, the dry air crackling not with static but with something else, something less. Cabs lumber by silently, someone dressed exactly like me crosses the street, three beautiful girls pass by, each maybe sixteen and eyeing me, trailed by a thug with a camcorder, the muted, dissonant strains of Moby float from the open doors of the Crunch gym across the street where on the building above it a giant billboard advertises in huge black block letters the word TEMPURA. But someone\u0027s calling \"Cut!\" and the noise from the construction site of the new Gap behind me and the beeper going off-for some freaky reason it\u0027s the number of Indochine-moves me toward a phone booth where before dialing I imagine a naked Lauren Hynde striding toward me in a suite at the Delano with a deeper sense of purpose than I can muster. Alison picks up.\n \"I need to make a reservation,\" I say, trying to disguise my voice.\n \"I\u0027ve got something I want to tell you,\" she says.\n \"What?\" I gulp. \"Y-you used to be a man?\"\n Alison knocks the phone on a hard surface. \"Oh sorry, that\u0027s my call-waiting. I\u0027ve gotta go.\"\n \"That didn\u0027t sound like, uh, call-waiting, baby.\"\n \"It\u0027s a new kind of call-waiting. It simulates the sound of someone who\u0027s dating a useless ass**le angrily knocking their phone against a wall.\"\n \"Essential, baby, you\u0027re essential.\"\n \"I want you here at Indochine within two minutes.\"\n \"I\u0027m inundated, baby, totally inundated.\"\n \"What is this? Big-word day?\" she snaps. \"Just get that ass over here.\"\n \"That ass has got to... see someone.\"\n \"Jesus, Victor, the pregnant pause combined with `someone\u0027 can only mean one person: that idiot you date.\"\n \"Baby, I\u0027ll see you tonight,\" I fake-purr.\n \"Listen, I have Chloe\u0027s number right in front of me, baby, and-\"\n \"She\u0027s not at home, Medusa.\"\n \"You\u0027re right. She\u0027s at Spy Bar shooting a Japanese TV commercial and-\"\n \"Damnit, Alison, you-\"\n \"-I\u0027m in a mood to screw things up. I need to be distracted from that mood, Victor,\" Alison warns. \"I need to be distracted from screwing things up.\"\n \"You\u0027re so phony, baby, it stings,\" I sigh. \"Ouch,\" I add. \"That was for, um, emphasis.\"\n \"Oh Chloe, I\u0027m so sorry. He came on to me. He was un animale. He told me he doesn\u0027t even wuv you.\"\n \"What\u0027s your sick little point, baby?\"\n \"I just don\u0027t want to share you anymore, Victor,\" Alison says, sighing as if she could care less. \"I\u0027m pretty sure I came to that conclusion at the Alfaro show.\" \n","sourceLink":"https://allnovel.net/glamorama/page-47.html","bookId":2683,"book":{"id":2683,"title":"Glamorama","description":"Storyline: \n The author of American Psycho and Less Than Zero continues to shock and haunt us with his incisive and brilliant dissection of the modern world. In his most ambitious and gripping book yet, Bret Easton Ellis takes our celebrity obsessed culture and increases the volume exponentially. \n Victor Ward, a model with perfect abs who exists in magazines and gossip columns and whose life resembles an ultra-hip movie, is living with one beautiful model and having an affair with another. And then it\u0027s time to move on to the next stage. But the future he gets is not the one he had in mind.\n \n","cover":"https://allnovel.net/images/glamorama.jpg","author":"Bret Easton Ellis","type":"Thriller","source":"allnovel","link":"https://allnovel.net/glamorama.html","creation":"Oct 5, 2019 8:59:06 AM","modification":"Oct 5, 2019 10:09:36 AM"}}
