{"id":69237,"no":50,"title":"Page 50","content":"\"That\u0027s so cool,\" I say, gazing at thin sheets of light-blue ice that cover an entire wall, lie in patches on the bar and on the mirrors behind the bar. Someone walks by in a parka.\n \"And I\u0027d like to open a restaurant in the shape of a giant scarab.\"\n We both stand there staring at the egg and then I slowly walk away, explaining, \"My cafe au lait\u0027s a little too foamy, guy.\"\n The makeup team has finished and they leave Chloe alone and I move over to where she\u0027s staring at us in a giant portable mirror that sits in the middle of the table, magazines scattered everywhere around her, some with Chloe\u0027s face on the cover.\n \"What\u0027s with the glasses?\" she asks.\n \"Reef says it\u0027s fashionable to look like an intellectual this season.\" It\u0027s so cold our breath frosts, comes out in puffs.\n \"If someone asked you to eat your own weight in Silly Putty, would you do that too?\" she asks quietly.\n \"I\u0027m a-buggin\u0027, I\u0027m a-jumpin\u0027, baby.\"\n \"Victor, I\u0027m so glad you know what\u0027s important and what\u0027s not.\"\n \"Thanks, babe.\" I lean in to kiss her neck but she flinches and whispers something about disturbing powder, so I end up placing my lips on top of her scalp.\n \"What am I smelling?\" I ask.\n \"I\u0027ve been using vodka to lighten my hair,\" she says sadly. \"Bongo got a whiff at the Donna Karan show and started muttering the Serenity Prayer.\"\n \"Don\u0027t sweat it, baby. Remember that all you have to do is say cheese about two hundred times a day. That\u0027s it!\"\n \"Being photographed six hours straight is sheer torture.\"\n \"Who\u0027s the dude in the corner, baby?\" I gesture toward the guy on the tatami mat.\n \"That\u0027s La Tosh. We go way back. I\u0027ve known him for weeks. We met over a spring roll at Kin Khao.\"\n \"Tres jolie.\" I shrug.\n \"Supposedly he\u0027s one of Rome\u0027s best-connected psychos,\" she sighs. \"Do you have any cigarettes?\"\n \"Hey, what happened to the nicotine patch you were gonna wear today?\" I ask, concerned.\n \"It was making me all wobbly on the runway.\" She takes my hand and looks up into my face. \"I missed you today. Whenever I\u0027m really tired I miss you.\"\n I lean in, hug her a little, whisper into her ear. \"Hey-who\u0027s my favorite little supermodel?\"\n \"Take those glasses off,\" she says sourly. \"You look like somebody who\u0027s trying too hard. You look like Dean Cain.\"\n \"So what\u0027s the story?\" I remove the frames, slip them back into their case.\n \"Alison Poole has called about ten times today,\" Chloe says, looking around the table for cigarettes. \"I haven\u0027t called her back. Do you have any idea what she wants?\"\n \"No, baby. Why?\"\n \"Well, didn\u0027t you see her at the Alfaro show?\"\n \"Baby, I wasn\u0027t at the Alfaro show.\" I pull a small piece of confetti from her hair.\n \"Shalom said she saw you there.\"\n \"Shalom needs new contacts, then, baby.\"\n \"So why are you visiting me?\" she asks. \"Are you sure you don\u0027t have a cigarette?\"\n I check all my pockets. \"I don\u0027t think so, baby.\" I find a pack of Mentos, offer her one. \"Um, I just wanted to stop in, say hello, the usual. I\u0027ve gotta be back at the club, meet this DJ we desperately need for the party tonight and then I\u0027ll see you at Todd\u0027s show.\"\n \"I\u0027ve got to be out of here in forty minutes if I\u0027m going to make it for hair.\" She takes a sip from a Fruitopia bottle.\n \"God, it\u0027s freezing in here,\" I say, shivering.\n \"This week has been hell, Victor,\" Chloe says blankly. \"Maybe the most hellish week of my life.\"\n \"I\u0027m here for you, baby.\"\n \"I know I should be comforted by that,\" she says. \"But thank you anyway.\"\n \"I\u0027ve just been so swamped today, baby, it\u0027s totally scary,\" I say. \"I\u0027ve just been so totally swamped.\"\n Chapter Six\n \"We really need to treat ourselves to a vacation,\" Chloe says.\n \"So what\u0027s the story, baby?\" I try again. \"What\u0027s this thing about?\" I ask, gesturing toward the crew, the egg, the guy on the tatami mat.\n \"I\u0027m not sure, but Scott is supposed to be some kind of phantom- android obsessed with curry-the spice-and we have a fight about whatever people who look like us have fights about and I throw a cube, some kind of-oh, I don\u0027t know-a cube at him and then, according to the script, he \u0027flees.\u0027\" \n","sourceLink":"https://allnovel.net/glamorama/page-50.html","bookId":2683,"book":{"id":2683,"title":"Glamorama","description":"Storyline: \n The author of American Psycho and Less Than Zero continues to shock and haunt us with his incisive and brilliant dissection of the modern world. In his most ambitious and gripping book yet, Bret Easton Ellis takes our celebrity obsessed culture and increases the volume exponentially. \n Victor Ward, a model with perfect abs who exists in magazines and gossip columns and whose life resembles an ultra-hip movie, is living with one beautiful model and having an affair with another. And then it\u0027s time to move on to the next stage. But the future he gets is not the one he had in mind.\n \n","cover":"https://allnovel.net/images/glamorama.jpg","author":"Bret Easton Ellis","type":"Thriller","source":"allnovel","link":"https://allnovel.net/glamorama.html","creation":"Oct 5, 2019 8:59:06 AM","modification":"Oct 5, 2019 10:09:36 AM"}}
