{"id":69252,"no":65,"title":"Page 65","content":"\"Oh shit\" She stumbles up and grabs her robe off the floor and then she\u0027s running down the hallway, calling out, \"Get dressed- Damien\u0027s here.\"\n \"Oh shit, baby.\" Panicked, I sit up, misjudge my place on the bed and fall off. I immediately pull my pants up and tuck my boner, aching and still stiff and wet, back into my Calvins.\n \"He\u0027s early,\" she groans, racing back into the room. \"Shit!\"\n \"Early for what?\" I ask.\n When I turn around she\u0027s at the closet, tearing through dresses and stacks of sweaters until finally she finds a black ladies\u0027 hat-cool-looking, with a tiny red flower embroidered on its side-and she studies it for a nanosecond before shoving it at me. \"Here.\"\n \"What?\" I\u0027m asking. \"This is your idea of a disguise?\"\n \"Tell him you came by to pick it up for Chloe,\" she says. \"And wipe your face off.\"\n \"Lauren, baby,\" I say. \"Chill out.\"\n \"You shouldn\u0027t have come over.\" She starts moving down the hallway. \"I\u0027m an idiot for not throwing you out.\"\n \"I thought we were having a pretty good time,\" I say, following her.\n \"Well, that\u0027s not what we should\u0027ve been doing,\" she yells. \"That\u0027s not what we should\u0027ve been doing,\" she whispers.\n \"Hey, don\u0027t say that.\"\n \"Let\u0027s just find a place to stand and call it a weak moment,\" she says. \"You shouldn\u0027t have come over.\"\n \"Baby, you\u0027ve established that-I get it, okay?\" I follow her into the living room and find a casual place to position myself.\n \"No, stand here,\" Lauren says, tying the sash on her robe.\n \"As if we\u0027re-oh god-talking.\"\n \"Okay, what do you want to talk about?\" I ask, calming down. \"How hard you make my dick?\"\n \"Just give me that damn hat back.\"\n \"Chloe would more likely wear a rotting log around her neck.\"\n \"She dates you, so what do you know?\"\n Damien walks in, holds up the cigar in his hand and says, \"Hey baby, don\u0027t worry, it\u0027s not lit.\" They don\u0027t bother to kiss and in a really serene way Damien nods at me, gives a cute little wave and says, \"Hey Victor.\"\n \"Hey Damien.\" I give a cute little wave back.\n \"You\u0027re everywhere today, huh?\"\n \"Everywhere at once-that\u0027s me.\"\n \"Victor,\" Lauren says. \"Tell Chloe she can return this to me anytime, okay, Victor?\" She hands me back the hat.\n \"Yeah, sure, Lauren. Um, thanks.\" I look at the hat, turning it around in my hands, inspecting it. \"Nice... hat.\"\n \"What\u0027s that?\" Damien asks.\n \"A hat,\" Lauren says.\n \"For who?\" he asks.\n \"Chloe,\" Lauren and I say at the same time.\n \"Victor came by to pick it up for her,\" she finishes.\n \"When\u0027s she gonna wear that?\" Damien asks. \"What\u0027s the urgency?\"\n \"Tonight,\" I say. \"She\u0027s going to wear it tonight.\"\n The three of us look at each other and something weird, something a little too intimate, passes between us, so we all look back at the hat.\n \"I can\u0027t look at this hat anymore,\" Lauren says. \"I have to take a shower.\"\n \"Baby, wait,\" Damien says. \"I\u0027m in a real rush. We have to talk about something.\"\n \"I thought we already discussed what you want to discuss,\" she says tightly.\n \"Victor,\" Damien says, ushering Lauren out of the room. \"We\u0027ll be right back.\"\n \"No problemo, guys.\"\n I check my messages: Gavin Palone, Emmanuelle Beart, someone from Brillstein-Grey, someone else who I\u0027ve decided looks good with his new goatee. It\u0027s freezing in the apartment. Everything suddenly seems slightly exhausting, vaguely demanding: the lifting of a spoon, the draining of a champagne flute, the glance that means you should go, even pretending to sleep. There\u0027s a room somewhere and in that room all the tables are empty but all of them are reserved. I check the time. Next to my watch is a stray piece of confetti I\u0027m too tired to brush off and I could really use some chips and salsa since I\u0027m famished. I know who you are and I know what you said.\n At the bar Damien pours himself a shot of Patron tequila and stares forlornly at his cigar. \"She won\u0027t let me smoke in here.\" He pauses. \"Well, not cigars.\" I\u0027m aware for the first time that Damien\u0027s actually sort of really good-looking and in this light I can\u0027t even tell he has extensions; his hair looks thick and black and strong, and I\u0027m touching my jaw, limply, to see if it feels as hollowed out as Damien\u0027s looks. \n","sourceLink":"https://allnovel.net/glamorama/page-65.html","bookId":2683,"book":{"id":2683,"title":"Glamorama","description":"Storyline: \n The author of American Psycho and Less Than Zero continues to shock and haunt us with his incisive and brilliant dissection of the modern world. In his most ambitious and gripping book yet, Bret Easton Ellis takes our celebrity obsessed culture and increases the volume exponentially. \n Victor Ward, a model with perfect abs who exists in magazines and gossip columns and whose life resembles an ultra-hip movie, is living with one beautiful model and having an affair with another. And then it\u0027s time to move on to the next stage. But the future he gets is not the one he had in mind.\n \n","cover":"https://allnovel.net/images/glamorama.jpg","author":"Bret Easton Ellis","type":"Thriller","source":"allnovel","link":"https://allnovel.net/glamorama.html","creation":"Oct 5, 2019 8:59:06 AM","modification":"Oct 5, 2019 10:09:36 AM"}}
