{"id":69272,"no":85,"title":"Page 85","content":"Bursting out the door, I\u0027m confronted by a crowd so enormous that everyone in it is hidden and when I appear everything grows calm and then, slowly at first, they start shouting my name and seconds later they\u0027re screaming to be allowed in and I dive into the throng, pushing through it, constantly turning around, saying \"Hello\" and \"Excuse me\" and \"You look great\" and \"It\u0027s cool, baby,\" and once I\u0027m through the maze of bodies I spot the two of them down the block: Baxter trailing after Chloe, trying to subdue her, and she keeps breaking away, rocking the cars parked along the curb, hysterical, setting off their alarms each time she falls against one, and I\u0027m taking in air in great gulps, panic-stricken but laughing too.\n I try to run past Baxter to get to Chloe but he whirls around when he hears me approaching and grabs my jacket, wrestling me against the wall of a building, shouting into my face while I\u0027m helplessly staring at Chloe, \"Get out of here, Victor, just leave her the f**k alone,\" and Baxter\u0027s smiling as he\u0027s shouting this, traffic pulsing behind him, and when Chloe turns to glare at me, Baxter-who\u0027s stronger than I ever could have imagined-seems secretly pleased. Over his shoulder Chloe\u0027s face is ravaged, tears keep pouring from her eyes.\n \"Baby,\" I\u0027m shouting. \"That wasn\u0027t me-\"\n \"Victor,\" Baxter shouts, warning me. \"Let it go.\"\n \"It\u0027s a hoax,\" I\u0027m shouting.\n Chloe just stares at me until I go limp and finally Baxter relaxes too and a cab behind Chloe slows down and Baxter quickly breaks into a jog and when he reaches Chloe he takes her arm and eases her into the waiting cab but she looks at me before she falls into it, softening, slipping away, deflated, unreachable, and then she\u0027s gone and a smirking Baxter nods at me, casually amused. Then total silence.\n Girls hanging out the window of a passing limousine making catcalls knock my legs back into motion and I run toward the club where security guards stand behind the barricades barking orders into walkie-talkies and I\u0027m panting as I climb through the crowd and then I\u0027m pulled by the doormen back onto the stairs leading up to the entrance, cries of grief billowing up behind me, steam from the klieg lights rising up into the sky and filling the space above the crowd, and I\u0027m moving through the metal detectors again and running up one flight of stairs and then another, heading up to Damien\u0027s office, when suddenly I slam into a column on the third floor.\n Damien\u0027s escorting Lauren to a private staircase that will lead them down a back exit onto the street and Lauren looks like she\u0027s breathing too hard-she actually seems thinner-as Damien talks rapidly into her ear even though her face is so twisted up it doesn\u0027t seem like she can comprehend anything Damien\u0027s saying as he closes the door behind them.\n I rush downstairs to the first floor again, alarmingly fast, struggling through the crowd, too many people passing by, indistinct faces, just profiles, people handing me flowers, people on cellular phones, everyone moving together in a drunken mass, and I\u0027m pushing through the darkness totally awake and people just keep dimly rolling past, constantly moving on to someplace else.\n Outside again I push through the crowd avoiding anyone who calls my name and Lauren and Damien seem miles away as they vanish into a limousine and I shout \"Wait\" and I\u0027m staring too long at the car as it disappears into the mist surrounding Union Square and I keep staring until some tiny thing in me collapses and my head starts clearing.\n Everything looks washed out and it\u0027s cold and the night suddenly stops accelerating: the sky is locked in place, fuzzy and unmoving, and I\u0027m stumbling down the block, then stopping to search my jacket for a cigarette, when I hear someone call my name and I look across the street at a limousine and Alison standing beside it, her face expressionless, and at her feet, on leashes, are Mr. and Mrs. Chow. When they see me their heads snap up and they start leaping, straining at their leashes excitedly, teeth bared, yapping, and I\u0027m just standing there dumbly, touching my swollen lip, a bruised cheek.\n Smiling, Alison drops the leashes.\n Chapter Nine\n Florent: a narrow, bleak 24-hour diner in the meat-packing district and I\u0027m feeling grimy, slumped at a table near the front, finishing the coke I picked up at a bar in the East Village sometime in the middle of the night where I lost my tie, and a copy of the News is spread out in front of me, open to the Buddy Seagull column I\u0027ve been studying for hours, uselessly since it reveals nothing, and behind me something\u0027s being filmed, a camera crew\u0027s setting up lights. I had gone by my place at around 4 but someone suspiciously well coiffed-a handsome guy, twenty-five, maybe twenty-six-was hanging out in front of the building, smoking a cigarette like he\u0027d been waiting there a very long time, and another guy-someone in the cast I hadn\u0027t met yet-sat in a black \n","sourceLink":"https://allnovel.net/glamorama/page-85.html","bookId":2683,"book":{"id":2683,"title":"Glamorama","description":"Storyline: \n The author of American Psycho and Less Than Zero continues to shock and haunt us with his incisive and brilliant dissection of the modern world. In his most ambitious and gripping book yet, Bret Easton Ellis takes our celebrity obsessed culture and increases the volume exponentially. \n Victor Ward, a model with perfect abs who exists in magazines and gossip columns and whose life resembles an ultra-hip movie, is living with one beautiful model and having an affair with another. And then it\u0027s time to move on to the next stage. But the future he gets is not the one he had in mind.\n \n","cover":"https://allnovel.net/images/glamorama.jpg","author":"Bret Easton Ellis","type":"Thriller","source":"allnovel","link":"https://allnovel.net/glamorama.html","creation":"Oct 5, 2019 8:59:06 AM","modification":"Oct 5, 2019 10:09:36 AM"}}
