{"id":12089,"no":117,"title":"CHAPTER CXIV. THE COOK WAITS UPON SIR RICHARD BLUNT AND HEARS NEWS.","content":"It took a quarter of an hour to reach the coach from the door of Mrs. Lovett\u0027s shop, a distance that in twenty steps any one might have traversed; and, oh! what a quarter of an hour of horrible suffering that was to the wretched woman, whose crimes had so infuriated the populace, that with one voice they called for her death! Mrs. Lovett\u0027s Escort To The Gallows. Mrs. Lovett\u0027s Escort To The Gallows. The coach door was opened, and Crotchet pushed his prisoner in. Mr. Green, and the other officer and the cook followed her. \"I will go on the box,\" said Crotchet. \"Very well,\" said Green, \"but be mindful of your own safety, Crotchet.\" \"All\u0027s right. There ain\u0027t any more o\u0027 my sort in London, and I know I am rather a valuable piece o\u0027 goods. Has anybody got the rope ready for the lady?\" \"Here you are,\" said a man, \"I have one.\" \"You get up behind then,\" said Crotchet, \"for of course you know we shall soon want you.\" \"Yes, I will. That\u0027s right! It\u0027s all right, friends. I am to get up behind with the rope. Here\u0027s the rope!\" \"Three cheers for the rope!\" cried somebody, and the cheers were given with deafening violence. What will not a mob give three cheers for—ay, or any number of cheers you like to name? A piece of poor humanity in tinsel and fine linen, called a king or queen—a popular cry—a murderess—a rope—anything will suffice. Surely, Mr. Crotchet, you know something of the people! \"Now,\" said Crotchet to the coachman, \"are you as bold as brass, and as strong as an iron file?\" The coachman looked puzzled, but Mr. Crotchet pursued his queries. \"Will these \u0027osses, if they is frightened a bit, cut along quick?\" \"Rather,\" said the coachman. \"The blessed fact is, that they won\u0027t cut along unless you do frighten them a bit; and as for me being an old file and having lots o\u0027 brass, I doesn\u0027t consider as I\u0027m a bit worser nor my neighbours.\" \"You is as hignorant as a badger!\" said Crotchet. \"Make yourself easy and give me the reins. The mobs o\u0027 people thinks as we is a going to hang the woman at the corner of Fleet Market, but if I lives another ten minutes, she will be in Newgate. There may be something of a scuffle, and if anything happens to you, or to the coach or the \u0027osses, the county will pay handsomely, so now give me the reins. You may not like to whip through them, but I haven\u0027t the least objection.\" The coachman looked scared and nervous, but he gave up the reins and the whip to Crotchet, and then leaning back on the box, he waited with no small trepidation the result of the expected disturbance, while he had only Mr. Crotchet\u0027s word that the county would pay for handsomely. The short distance from the corner of Bell Yard to the end of Fleet Market was rapidly traversed, and when that interesting point was reached, the dense mass of people set up another shout, and began to surround the lamp-post that was there, and to fill up all the avenues. \"Get the rope up,\" said Crotchet. \"Yes, yes. Hurrah! hurrah! Pull her out, and hang her!\" The highly interesting process of getting the rope fixed upon the little projecting piece of iron, upon which the lamplighter was wont to rest his ladder, had the effect that Crotchet expected, namely, to attract general attention; and then, taking advantage of the moment, he seized the whip and used it with such effect upon the horses, that, terrified and half maddened, they set off with the coach at a tearing gallop. For a moment or two—and in that moment or two Mr. Crotchet with his prisoner got to the corner of the Old Bailey—the mob were so staggered by this unexpected elopement of the hackney-coach, that not a soul followed it. The idea that the horses had of their own accord started, being probably alarmed at the links, was the first that possessed the people, and many voices called out loudly— \"Pull \u0027em in—pull \u0027em in! Saw their heads off!\" But when they saw Mr. Crotchet fairly turn into the Old Bailey, the trick that had been played upon them became apparent; and one yell of indignation and rage burst from the multitude. The pursuit was immediate; but Mr. Crotchet had too much the start of the mob, and long before the struggling infuriated people, impeding each other as they tore along, had reached the corner of the Old Bailey, Mrs. Lovett was in the lobby of the prison, and the officers safely with her. She looked like a corpse. The colour of her face was that of soiled white wax. But mobs, if they cannot wreak their vengeance upon what may be, for distinction\u0027s sake, called the legitimate object of their displeasure, will do so upon something else; and upon reaching the door of Newgate, and finding there was no sort of chance of getting hold of Mrs. Lovett, they took the horses out of the hackney-coach, and started them off through the streets to go where they liked; and then, dragging the coach to Smithfield, they then and there made a bon-fire of it, and were very much satisfied and delighted, indeed. \"Now, mum,\" said Crotchet to Mrs. Lovett, \"didn\u0027t I say I\u0027d bring yer to the old stone jug as safe as ninepence?\" She only looked at him vacantly; and then, glaring around her with a shudder, she said— \"And this is Newgate!\" \"Just a few,\" said Crotchet. The governor at this moment made his appearance, and began to give orders as to where Mrs. Lovett should be placed. A slight change of colour came over her face, as she said— \"Shall I see Todd?\" \"Not at present,\" said the governor. \"I should like to see him to forgive him; for no doubt it is to him that I owe this situation. He has betrayed me!\" The look which she put on when she uttered the words \"I should like to see him to forgive him,\" was so truly demoniac, that it was quite clear if she did see Todd, that whether she were armed or not, she would fly upon him, and try to take his life; and although in that she might fail, there would be very little doubt but that, in the process of failure, she would inflict upon him some very serious injury. It was not likely, though, that the officials of Newgate would indulge her with an opportunity. \"You had better all of you wait here,\" said the governor to Mr. Crotchet, and the officers, and the cook, \"until the mob is gone.\" \"The street is quite clear, sir,\" said a turnkey, \"They have taken the coach to knock it to pieces, I suppose, sir.\" \"And I\u0027m done up at last!\" said the coachman, wringing his hands, for he had, in fear for his own safety, made his way into the lobby of Newgate along with Mr. Crotchet; \"I\u0027m done up at last!\" \"Not at all,\" said the governor. \"We would not have lost such a prisoner as this Mrs. Lovett, for the worth of fifty coaches. Every penny of your loss will be made good to you. There is a guinea, in the meantime—go home, and do not distress yourself upon the subject, my good fellow.\" Upon this the coachman was greatly comforted, and with Mr. Crotchet and the officers, he left the lobby of Newgate at the same moment that Mrs. Lovett was led off into the interim of that gloomy and horrible abode. The object of the officer was now to get to the private office of Sir Richard Blunt as soon as possible, and let him know of the successful capture of Mrs. Lovett. Sir Richard, too, it will be remembered, had left a special message with the cook to repair to his office as soon as he could after his release from his bondage in Bell Yard, so that the liberated cook, who felt that he owed that liberation to the advice and assistance of Sir Richard, did not scruple to obey the directions of the magistrate at once. The private-office of Sir Richard, it will be recollected, was in Craven Street, at the bottom of the Strand. Upon the route there, Mr. Crotchet and the cook held a long and very serious discourse about the proceedings of Mrs. Lovett, and if the cook was able to tell the active and enterprising Crotchet much that was curious regarding the underground operations at Mrs. Lovett\u0027s, he, in return, received some curious edifying information concerning the lady\u0027s business connexion with Sweeney Todd, with the particulars of which the cook had been completely ignorant. By the time they reached Craven Street, therefore, the cook\u0027s eyes were considerably opened, and many matters that had been to him extremely obscure, became all at once quite clear, so that he was upon the whole far from sorry for the companionship of the eccentric Crotchet on the road down the Strand to the magistrate\u0027s private office. Sir Richard was at home, and anxiously expecting them, so that upon the first hint of their presence they were introduced to him, and he received the report of the officer with evident satisfaction. \"Thank God,\" he said, \"two of the greatest malefactors the world ever saw are now in the hands of justice.\" \"Yes,\" said Crotchet. \"They are cotched.\" \"You may depend all of you,\" added Sir Richard, \"that your conduct and great skill in exertions in this affair shall be by me communicated to the Secretary of State, who will not leave you unrewarded. Pray wait for me in the outer room, I have some private business with this gentleman.\" The officers were a little surprised to hear Sir Richard Blunt call Mrs. Lovett\u0027s cook, \"this gentleman;\" but they of course took no notice of the circumstance while in the presence of their principal, and in a few moments the magistrate was alone with the cook. From a cupboard in his room, then Sir Richard Blunt took wine and other refreshments, and laid them before the cook, saying— \"Refresh yourself, my friend; but for your own sake, as your fare has been but indifferent for some time, I beg you to be sparing.\" \"I will, sir. I owe you much—very much!\" \"You are free now.\" \"I—am—sir.\" \"And yet you are very unhappy.\" The cook started and changed colour slightly. He filled, for himself, a glass of wine, and after drinking it he heaved a sigh, as he said— \"Sir, I am unhappy. I do not care how soon the world and I part, sir. The hope—the dream of my life has gone from me. All that I lived for—all that I cherished as the brightest expectation of joy in this world has passed away like a vapour, and left not a rack behind. I am unhappy, and better, far better, would it have been for me if Sweeney Todd had taken my life, or if by some subtle poison, Mrs. Lovett had shuffled me out of the world—I am unhappy.\" \"Indeed! And you really think you have nothing in this world now to live for?\" \"I do. But it is not a thought only. It is a knowledge—it is a fact that cannot be gainsaid or controverted. I tell you, sir, that I can never now hope to realise the happiness which was the day-dream of my existence, and which has passed from me like a dream, never—never to come again. It was in the despair contingent upon such thoughts and feelings, that I went to Mrs. Lovett and became her slave; but now I will be off far away from England, and on some foreign shore I will lay my bones.\" \"But, my good sir, you will be wanted on the trial of your old friend, Mrs. Lovett.\" \"Cannot you hang the woman without my help?\" \"Yes, I think we might, but so material a witness to her infamy as yourself cannot be dispensed with. Of course I do not pretend to be a conjuror, or to say to any man—\u0027You shall be happy in spite of all your prognostications to the contrary;\u0027 but from what you have told me of your story, I must confess that to my perception you take much too gloomy a view of your condition.\" \"Too gloomy!\" exclaimed the cook, as he filled himself up another glass of wine. \"Too gloomy! My dear, sir, you don\u0027t know how I loved that girl—you don\u0027t know how I—I—But it is no matter now—all that is past. Oh God! that she should be false to me—she of all persons in the great world!\" \"And so you will let this little disappointment of the heart, place you in your youth quite beside all possible enjoyment? Is this wise, sir? Is it even manly?\" The poor cook was silent for a few moments, and then in a voice of deep emotion, he said— \"Sir, you don\u0027t know how much I loved her. You do not know how I pictured to myself happiness with her alone. You do not know, sir, how, even when death stared me in the face, I thought of her and her only, and how—But no matter—no matter, sir. She is false, and it is madness to speak of her. Let her go, sir. It is just possible that in the time to come, I may outlive the despair that now fills my heart.\" \"You surely will.\" \"I do not think it. But I will hope that I may.\" \"And have you really no hope—no innate lurking supposition in your mind, that you may be doing her an injustice in your suspicions of her faith?\" \"Suspicions?\" \"Ay, sir, suspicions, for even you must admit that you know nothing.\" \"Know nothing, sir?\" \"Absolutely nothing. You will find, if you come to consider the affair, that, as I say, you know nothing, but suspect much; and so upon mere suspicion you will make your future life miserable. I would not so bend to circumstances if the whole world stood up before me, and told me I was right in my dread thoughts of one whom I had loved.\" The poor cook glanced at Sir Richard Blunt, and for the space of about half a minute, not one word passed between them. Then in a low voice, the cook said— \"You have read Romeo and Juliet, sir?\" \"Yes—what then?\" \"There is one line there, in which we read that \u0027He jests at scars who never felt a wound.\u0027\" \"Well, how would you apply that line to the present circumstances?\" \"I would say you have never loved, sir, and I have loved.\" \"A broad assumption that, my friend,\" said Sir Richard Blunt, \"a very broad assertion, indeed. But come, I have to spare a short time. Will you, in recompense for what I have done for you, relate to me more fully than you have done, how it is that you suspect her whom you loved of falsehood to you?\" \"Do not say loved, sir; I love her still.\" \"I am glad to hear it. I pray you to go on, and tell me now all, if you feel that you can have sufficient confidence in me, and that you can view me with a sufficient friendly feeling.\" \"Oh, sir, why do you doubt me? Do I not owe to you my life? Do I not owe it to you that I escaped the death that without a doubt was designed for me by Todd? and was it not by your persevering, that at length I had patience enough to wait until the proper time had come for my release, when it could be accomplished without the shadow of a doubt as to the result?\" \"Well,\" said Sir Richard Blunt, with a smile, \"I hope then that I have established some claim upon you; so now tell me your story, my friend, and at the end of it I will, from my experience, do what I can to bring you substantial comfort.\" \"You shall hear all, sir,\" said the cook, \"but comfort and I have parted long since, I fear, from each other for ever.\" \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3276/89674.html","bookId":510,"book":{"id":510,"title":"The String of Pearls","description":"简介： The Romance of The String of Pearls having excited in the Literary world an almost unprecedented interest, it behoves the author to say a few words to his readers upon the completion of his labours....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3276","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
