{"id":11985,"no":13,"title":"CHAPTER XIII. JOHANNA\u0027S INTERVIEW WITH ARABELLA WILMOT, AND THE ADVICE.","content":"Alas! poor Johanna, thou hast chosen but an indifferent confidante in the person of that young and inexperienced girl to whom it seems good to thee to impart thy griefs. Not for one moment do we mean to say, that the young creature to whom the spectacle-maker\u0027s daughter made up her mind to unbosom herself, was not all that any one could wish as regards honour, goodness, and friendship. But she was one of those creatures who yet look upon the world as a fresh green garden, and had not yet lost that romance of existence which the world and its ways soon banish from the breasts of all. She was young, even almost to girlhood, and having been the idol of her family circle, she knew just about as little of the great world as a child. But while we cannot but to some extent regret that Johanna should have chosen such a confidant and admirer, we with feelings of great freshness and pleasure proceed to accompany her to that young girl\u0027s house. Now, a visit from Johanna Oakley to the Wilmots was not so rare a thing, that it should excite any unusual surprise, but in this case it did excite unusual pleasure, because they had not been there for some time. And the reason that she had not, may well be found in the peculiar circumstances that had for a considerable period environed her. She had a secret to keep which, although it might not proclaim what it was most legibly upon her countenance, yet proclaimed that it had an existence, and as she had not made Arabella a confidant, she dreaded the other\u0027s friendly questions of the young creature. It may seem surprising that Johanna Oakley had kept from one whom she so much esteemed, and with whom she had made such a friendship, the secret of her affections; but that must be accounted for by a difference of ages between them to a sufficient extent in that early period of life to show itself palpably. That difference was not quite two years, but when we likewise state, that Arabella was of that small, delicate style of beauty, which makes her look like a child, when even upon the very verge of womanhood, we shall not be surprised that the girl of seventeen hesitated to confide a secret of the heart to what seemed but a beautiful child. The last year, however, had made a great difference in the appearance of Arabella, for, although she still looked a year or so younger than she really was, a more staid and thoughtful expression had come over her face, and she no longer presented, at times when she laughed, that child-like expression, which had been as remarkable in her as it was delightful. She was as different looking from Johanna as she could be, for whereas Johanna\u0027s hair was of a rich and glossy brown, so nearly allied to black that it was commonly called such; the long waving ringlets that shaded the sweet countenance of Arabella Wilmot were like amber silk blended to a pale beauty. Her eyes were nearly blue, and not that pale grey, which courtesy calls of that celestial colour, and their long, fringing lashes hung upon a cheek of the most delicate and exquisite hue that nature could produce. Such was the young, loveable, and amiable creature who had made one of those girlish friendships with Johanna Oakley that, when they do endure beyond the period of almost mere childhood, endure for ever, and become one among the most dear and cherished sensations of the heart. The acquaintance had commenced at school, and might have been of that evanescent character of so many school friendships, which, in after life, are scarcely so much remembered as the most dim visions of a dream; but it happened that they were congenial spirits, which, let them be thrown together under any circumstances whatever, would have come together with a perfect and a most endearing confidence in each other\u0027s affections. That they were school companions was the mere accident that brought them together, and not the cause of their friendship. Such, then, was the being to whom Johanna Oakley looked for counsel and assistance; and notwithstanding all that we have said respecting the likelihood of that counsel being of an inactive and girlish character, we cannot withhold our meed of approbation to Johanna, that she had selected one so much in every way worthy of her honest esteem. The hour at which she called was such as to ensure Arabella being within, and the pleasure which showed itself upon the countenance of the young girl, as she welcomed her old playmate, was a feeling of the most delightful and unaffecting character. \"Why, Johanna,\" she said, \"you so seldom call upon me now, that I suppose I must esteem it as a very special act of grace and favour to see you.\" \"Arabella,\" said Johanna, \"I do not know what you will say to me when I tell you that my present visit is because I am in a difficulty, and want your advice.\" \"Then you could not have come to a better person, for I have read all the novels in London, and know all the difficulties that anybody can possibly get into, and, what is more important, too, I know all the means of getting out of them, let them be what they may.\" \"And yet, Arabella, scarcely in all your novel reading will you find anything so strange and so eventful as the circumstances, I grieve to say, it is in my power to record to you. Sit down, and listen to me, dear Arabella, and you shall know all.\" \"You surprise and alarm me by that serious countenance, Johanna.\" \"The subject is a serious one. I love.\" \"Oh! is that all? So do I; there\u0027s a young Captain Desbrook in the King\u0027s Guards. He comes here to buy his gloves; and if you did but hear him sigh as he leans over the counter, you would be astonished.\" \"Ah! but, Arabella, I know you well. Yours is one of those fleeting passions that, like the forked lightning, appear for a moment, and ere you can say behold, is gone again. Mine is deeper in my heart, so deep, that to divorce it from it would be to destroy its home for ever.\" \"But, why so serious, Johanna? You do not mean to tell me that it is possible for you to love any man without his loving you in return?\" \"You are right there, Arabella. I do not come to speak to you of a hopeless passion—far from it; but you shall hear. Lend me, my dear friend, your serious attention, and you shall hear of such mysterious matters.\" \"Mysterious!—then I shall be in my very element. For know that I quite live and exult in mystery, and you could not possibly have come to any one who would more welcomely receive such a commission from you; I am all impatience.\" Johanna then, with great earnestness, related to her friend the whole of the particulars connected with her deep and sincere attachment to Mark Ingestrie. She told her how, in spite of all circumstances which appeared to have a tendency to cast a shadow and blight upon their young affection, they had loved, and loved truly; how Ingestrie, disliking, both from principle and distaste, the study of the law, had quarrelled with his uncle, Mr. Grant, and then how, as a bold adventurer, he had gone to seek his fortunes in the Indian seas; fortunes which promised to be splendid, but which might end in disappointment and defeat, and that they had ended in such calamities most deeply and truly did she mourn to be compelled to state. And she concluded by saying— \"And now, Arabella, you know all I have to tell you. You know how truly I have loved, and how, after teaching myself to expect happiness, I have met with nothing but despair; and you may judge for yourself, how sadly the fate, or rather the mystery, which hangs over Mark Ingestrie, must deeply affect me, and how lost my mind must be in all kinds of conjecture concerning him.\" The hilarity of spirits which had characterised Arabella in the earlier part of their interview, entirely left her as Johanna proceeded in her mournful narration, and by the time she had concluded, tears of the most genuine sympathy stood in her eyes. She took the hands of Johanna in both her own, and said to her— \"Why, my poor Johanna, I never expected to hear from your lips so sad a tale. This is most mournful, indeed very mournful; and, although I was half inclined before to quarrel with you for this tardy confidence—for you must recollect that it is the first I have heard of this whole affair—but now the misfortunes that oppress you are quite sufficient, Heaven knows, without me adding to them by the shadow of a reproach.\" \"They are indeed, Arabella, and believe me, if the course of my love ran smoothly, instead of being, as it has been, full of misadventures, you should have had nothing to complain of on the score of want of confidence; but I will own I did hesitate to inflict on you my miseries, for miseries they have been, and, alas! miseries they seem destined to remain.\" \"Johanna, you could not have used an argument more delusive than that. It is not one which should have come from your lips to me.\" \"But surely it was a good motive to spare you pain?\" \"And did you think so lightly of my friendship that it was to be entrusted with nothing but what wore a pleasant aspect? True friendship surely is best shown in the encounter of difficulty and distress. I grieve, Johanna, indeed, that you have so much mistaken me.\" \"Nay, now you do me an injustice: it was not that I doubted your friendship for one moment, but that I did indeed shrink from casting the shadow of my sorrows over what should be, and what I hope is, the sunshine of your heart. That was the respect which deterred me from making you a confidant of, what I suppose I must call, this ill-fated passion.\" \"No, not ill-fated, Johanna. Let us still believe that the time will come when it will be far otherwise than ill-fated.\" \"But what do you think of all that I have told you? Can you gather from it any hope?\" \"Abundance of hope, Johanna. You have no certainty of the death of Ingestrie.\" \"I certainly have not, as far as regards the loss of him in the Indian seas; but, Arabella, there is one supposition which, from the first moment that it found a home in my breast, has been growing stronger and stronger, and that supposition is, that this Mr. Thornhill was no other than Mark Ingestrie himself.\" \"Indeed! Think you so? That would be a strange supposition. Have you any special reasons for such a thought?\" \"None—further than a something which seemed ever to tell my heart from the first moment that such was the case, and a consideration of the improbability of the story related by Thornhill. Why should Mark Ingestrie have given him the string of pearls and the message to me, trusting to the preservation of this Thornhill, and assuming, for some strange reason, that he himself must fall?\" \"There is good argument in that, Johanna.\" \"And, moreover, Mark Ingestrie told me he intended altering his name upon the expedition.\" \"It is strange; but now you mention such a supposition, it appears, do you know, Johanna, each moment more probable to me. Oh, that fatal string of pearls!\" \"Fatal, indeed! for if Mark Ingestrie and Thornhill be one and the same person, the possession of those pearls has been the temptation to destroy him.\" \"There cannot be a doubt upon that point, Johanna, and so you will find in all tales of love and of romance, that jealousy and wealth have been the sources of all the abundant evils which fond and attached hearts have from time to time suffered.\" \"It is so; I believe, it is so, Arabella; but advise me what to do, for truly I am myself incapable of action. Tell me what you think it is possible to do, under those disastrous circumstances, for there is nothing which I will not dare attempt.\" \"Why, my dear Johanna, you must perceive that all the evidence you have regarding this Thornhill, follows him up to that barber\u0027s shop in Fleet-street, and no farther.\" \"It does, indeed.\" \"Can you not imagine, then, that there lies the mystery of his fate; and, from what you have yourself seen of this man, Todd, do you think he is one who would hesitate even at murder?\" \"Oh, horror! my own thoughts have taken that dreadful turn, but I dreaded to pronounce the word which would embody them. If, indeed, that fearful-looking man fancied that, by any deed of blood, he could become possessed of such a treasure as that which belonged to Mark Ingestrie, unchristian and illiberal as it may sound, the belief clings to me that he would not hesitate to do it.\" \"Do not, however, conclude, Johanna, that such is the case. It would appear from all you have heard and seen of these circumstances, that there is some fearful mystery; but do not, Johanna, conclude hastily that that mystery is one of death.\" \"Be it so, or not,\" said Johanna, \"I must solve it, or go distracted. Heaven have mercy upon me!—for even now I feel a fever in my brain that precludes almost the possibility of rational thought.\" \"Be calm, be calm—we will think the matter over calmly and seriously; and who knows but that, mere girls as we are, we may think of some adventitious mode of arriving at a knowledge of the truth; and now I am going to tell you something, which your narrative has recalled to my mind.\" \"Say on, Arabella, I shall listen to you with deep attention.\" \"A short time since, about six months, I think, an apprentice of my father, in the last week of his servitude, was sent to the west-end of the town, to take a considerable sum of money; but he never came back with it, and from that day to this we have heard nothing of him, although, from inquiry that my father made, he ascertained that he received the money, and that he met an acquaintance in the Strand, who parted from him at the corner of Milford-lane, and to whom he said that he intended to call at Sweeney Todd\u0027s, the barber, in Fleet-street, to have his hair dressed, because there was to be a regatta on the Thames, and he was determined to go to it whether my father liked or not.\" \"And he was never heard of?\" \"Never. Of course, my father made every inquiry upon the subject, and called upon Sweeney Todd for the purpose; but, as he declared that no such person had ever called at his shop, the inquiry there terminated.\" \"\u0027Tis very strange.\" \"And most mysterious; for the friends of the youth were indeed indefatigable in their searches for him; and, by subscribing together for the purpose, they offered a large reward to any one who could or would give them information regarding his fate.\" \"And was it all in vain?\" \"All; nothing could be learned whatever. Not even the remotest clue was obtained, and there the affair has rested, in the most profound of mysteries.\" Johanna shuddered, and for some few moments the two young girls were silent. It was Johanna who broke that silence, by exclaiming— \"Arabella, assist me with what advice you can, so that I may set about what I purpose with the best prospect of success and the least danger; not that I shrink on my own account from risk, but if any misadventure were to occur to me, I might thereby be incapacitated from pursuing that object, to which I will now devote the remainder of my life.\" \"But what can you do, my dear Johanna? It was but a short time since there was a placard in the barber\u0027s window to say that he wanted a lad as an assistant in his business, but that has been removed, or we might have procured some one to take the situation for the express purpose of playing the spy upon the barber\u0027s proceedings.\" \"But, perchance, still there may be an opportunity of accomplishing something in that way, if you knew of any one that would undertake the adventure.\" \"There will be no difficulty, Johanna, in discovering one willing to do so, although we might be long in finding one of sufficient capacity that we could trust; but I am adventurous, Johanna, as you know, and I think I could have got my cousin Albert to personate the character, only that I think he\u0027s rather a giddy youth, and scarcely to be trusted with a mission of so much importance.\" \"Yes, and a mission likewise, Arabella, which, by a single false step, might be made frightfully dangerous.\" \"It might indeed.\" \"Then it will be unfair to place it upon any one but those who feel most deeply for its success.\" \"Johanna, the enthusiasm with which you speak awakens in me a thought which I shrink from expressing to you, and which, I fear, perhaps more originates from a certain feeling of romance, which, I believe, is a besetting sin, than from any other cause.\" \"Name it, Arabella; name it.\" \"It would be possible for you or I to accomplish the object, by going disguised to the barber\u0027s, and accepting such a situation, if it were vacant, for a period of about twenty-four hours, in order that during that time an opportunity might be taken of searching in his house for some evidence upon the subject nearest to your heart.\" \"It is a happy thought,\" said Johanna, \"and why should I hesitate at encountering any risk, or toil, or difficulty, for him who has risked so much for me? What is there to hinder me from carrying out such a resolution? At any moment, if great danger should beset me, I can rush into the street, and claim protection from the passers-by.\" \"And moreover, Johanna, if you went on such a mission, remember you go with my knowledge, and that consequently I would bring you assistance, if you appeared not in the specified time for your return.\" \"Each moment, Arabella, the plan assumes to my mind a better shape. If Sweeney Todd be innocent of contriving anything against the life and liberty of those who seek his shop, I have nothing to fear; but if, on the contrary, he be guilty, danger to me would be the proof of such guilt, and that is a proof which I am willing to chance encountering for the sake of the great object I have in view; but how am I to provide myself with the necessary means?\" \"Be at rest upon that score. My cousin Albert and you are as nearly of a size as possible. He will be staying here shortly, and I will secure from his wardrobe a suit of clothes, which I am certain will answer your purpose. But let me implore you to wait until you have had your second interview with Colonel Jeffery.\" \"That is well thought of; I will meet him, and question him closely as to the personal appearance of this Mr. Thornhill; beside, I shall hear if he has any confirmed suspicion on the subject.\" \"That is well, you will soon meet him, for the week is running on; and let me implore you, Johanna, to come to me the morning after you have so met him, and then we will again consult upon this plan of operations, which appears to us feasible and desirable.\" Some more conversation of a similar character ensued between these young girls; and upon the whole, Johanna Oakley felt much comforted by her visit, and more able to think calmly as well as seriously upon the subject which engrossed her whole thoughts and feelings; and when she returned to her own home, she found that much of the excitement of despair which had formerly had possession of her, had given way to hope; and with that natural feeling of joyousness, and that elasticity of mind which belongs to the young, she began to build in her imagination some airy fabrics of future happiness. Certainly, these suppositions went upon the fact that Mark Ingestrie was a prisoner, and not that his life had been taken by the mysterious barber; for although the possibility of his having been murdered had found a home in her imagination, still to her pure spirit it seemed by far too hideous to be true, and she scarcely could be said really and truly to entertain it as a matter which was likely to be true. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3276/89570.html","bookId":510,"book":{"id":510,"title":"The String of Pearls","description":"简介： The Romance of The String of Pearls having excited in the Literary world an almost unprecedented interest, it behoves the author to say a few words to his readers upon the completion of his labours....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3276","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
