{"id":12110,"no":138,"title":"CHAPTER CXXXV. THE CHASE THROUGH SMITHFIELD, AND THE MURDER.","content":"They were afraid to speak, were those two murderers, as they now stood trembling in the passage of the Governor\u0027s house in Newgate. They could only be conscious of each other\u0027s presence by the hard breathing which their fears gave rise to, and as Lupin had extinguished the little light, the most intense darkness reigned around them. Bang—bang—bang! went the knocker upon the door of the Governor\u0027s house again. \"Lost—lost!\" said Todd. If Lupin was not the most hardened villain of the two, he was certainly at that moment the most courageous. He aimed a blow at Todd in the dark to give effect to his admonition for silence; but it did not take effect. Todd, however, was quite still now, and in the course of a few moments the knock at the door was repeated a third time. Then Lupin whispered to Todd— \"Keep yourself up as close against the wall as you can. Some one will come to the door, and you can throttle whoever it is, while I take the key of the little lock from them.\" \"Yes,\" said Todd, faintly. The word had hardly escaped his lips, when a flash of light from above came streaming down into the passage, and from each side of the door, close to the passage wall, against which they screwed themselves into as small a compass as possible, they saw a man approaching. The person who came to answer the knock at the Governor\u0027s door was evidently only just roused from sleep, for he was looking heavy, and yawning as he came. The candle he carried swayed to and fro in his hand, and it was very unlikely that he would see anything that was not remarkably close to his nose. \"Ah, dear me\" he yawned. \"Can\u0027t people come at reasonable times? Who\u0027d be a Governor\u0027s clerk, I wonder, to—ah, dear!—get up at all hours of the night in Newgate. Ah, heigho!\" Mr. Lupin wanted to say only two words to Todd, and those were \"Kill him;\" but he was afraid even to whisper them, lest Todd should not be equally discreet in reply. He knew he could whisper softly enough; but he thought his companion might not be so accomplished in that particular, so he was silent. Before the individual who had announced himself to be the Governor\u0027s clerk could get into the passage down the flight of stairs, the person on the outside of the door got impatient, and executed another rather startling rap. \"Oh, bother you,\" said the clerk. \"I only wish you were at the bottom of the Thames. I\u0027m coming, stupid; don\u0027t you see the light through the little bit of glass at the top of the door, that—ah, dear! how gapish I am—you keep hammering away there, as if you thought we were all deaf or stupid?\" The clerk was evidently wakening up, but as he carried the light right in front of his eyes, he had not the smallest chance of seeing either Mr. Todd or Lupin, and in that way he reached the passage, or hall it might be called from courtesy. To be sure, how could he for one moment suspect to find two of the most notorious criminals in all Newgate snugly hidden in the hall? We must consider how very improbable such a thing was, before we blame the clerk for any imprudence in the matter. The grand object of Lupin, who kept his sharp little ferret-looking eyes upon the clerk as he descended, was to note if he had a key with him at all; if he had, there could be no doubt of its being the key of the little lock that had so baffled his, Lupin\u0027s, attempts to open it, upon the door of the Governor\u0027s house. To his great satisfaction he saw that, dangling from the clerk\u0027s finger by a piece of tape, he did carry a key, and Lupin at once naturally concluded it was the one he wanted. \"Only just let me find out now,\" said the clerk, \"that this is something about nothing, and won\u0027t I make a riot about it in the morning. To rouse a fellow out of his bed, it is really too bad, as if any kind of thing could not be just as well done in the day time as in the middle of night. Now stupid, who are you?\" These last words he addressed to the person outside, by placing his mouth close to the keyhole. A voice responded something, the only recognisable word of which was \"donkey.\" \"What do you say?\" cried the clerk, again. \"You are—a—a—donkey, do you say?\" \"No,\" said the voice from the outside through the key-hole. \"But you are.\" \"Oh, am I, you infernal vagabond? I\u0027ll soon let you know what\u0027s what, I will, you rascal.\" With this the clerk began to open the door, and the moment he got the key in the little lock, so that Mr. Lupin was thoroughly aware it was the one he wanted, he sprung upon the unfortunate clerk, and dashing his head against the door, which was heavily plated with iron, he knocked him insensible in a moment. To open the lock was the work of an instant, and the door creaked upon its hinges. \"Who are you?\" said Lupin. \"A messenger from the Secretary of State,\" said the man on the outside, \"and I shall report your insolence.\" \"Don\u0027t,\" said Lupin. \"Indeed, I shall.\" \"Then take that.\" With the file he dealt him a frightful wound in the face, and then they both rolled down the whole flight of steps together, for Mr. Lupin had overbalanced himself with that blow. Todd sprang over them both, and gained the open street, just as a watchman who was opposite began to spring his rattle at seeing such a scuffle going on at the Governor\u0027s door. The messenger from the Secretary of State, notwithstanding his wound, grappled with Lupin, but that rascal got hold of him by his hair, and knocked his head against the pavement until he was quite dead. Then rising, he cried— \"Through Smithfield, Todd! Follow me.\" \"I will,\" said Todd, and off they both set, pursued by the single watchman, who had happened to be the sole witness to the whole affair, and who, finding himself outstripped by the two men, wisely stopped at the corner of Giltspur Street to spring his rattle, which he did with a vengeance that soon brought others to his assistance. \"An escape from Newgate!\" the watchman kept crying—\"An escape from Newgate! There they go—through Smithfield; two men, one very big and the other not so big! An escape from Newgate!\" The Astonished Watchman.—Leaving Newgate Behind. The Astonished Watchman.—Leaving Newgate Behind. These cries soon sent about a dozen persons on the trail of the fugitives, and as the alarm was understood at the prison, four of the most bold and skillful men upon the premises at once started in pursuit. From the watchman who still stood at the end of Giltspur Street, they heard in what direction the prisoners had gone, and they did not lose a moment in dashing after them, calling out as they went— \"Fifty pounds reward for two prisoners escaped from Newgate! Fifty pounds reward for them!\" These words summoned up many an idler who was trying to dream away the night in the pens of Smithfield, and the officers soon got together a rabble host for the pursuit of Todd and his villanous companion. But these officers with their fifty pounds reward were rather late in the field. It was the few persons who first heard the rattle and the outcries of the watchman, who were close upon the heels of the men, and they kept them well in sight right across Smithfield and so on towards Barbican. Todd heard the shouts of the pursuers, but he did not look back, for fear of losing time by so doing; and the fact was, that Mr. Lupin was so fleet of foot that it required all the exertion of Todd to keep up with him at all. Upon any less exciting occasion it is extremely doubtful if Todd could have kept up such a race; but as it was, he seemed to lose his wind, and then in some mysterious way to get on without any at all. Mr. Lupin crossed Aldersgate Street, and dashed down Barbican. He then turned down the first opening he came to on the right, and he did so, not because he was making for any known place of safety, but because he knew that a labyrinth of small streets were thereabouts, amid the intricacies of which he hoped to baffle his pursuers; and it was certainly under the circumstances very good policy in him to take the course he did. From the moment of so abruptly turning out of Barbican, they were both out of sight of their pursuers, who had been able to keep them steadily in view up to this; but although that was the case, they were not without their perils, for a watchman met them both and aimed a blow at Lupin\u0027s legs with his stick, crying in an Irish brogue— \"Stop that, my beauty—Stop that any way!\" Lupin sprang upon him like an enraged tiger, and turning the stick from his hands, he laid him flat with one blow of it and on he rushed, carrying it with him as a defence against the attack of any one else. They now turned a corner and met a string of half-drunken gents of the period, arm-in-arm, and occupying the whole breadth of the pavement. Lupin avoided them by swerving into the road-way, but they caught hold of Todd, crying— \"Here\u0027s the devil. Let\u0027s make him an offer for his tail!\" Certainly, Sweeney Todd was not at that moment disposed for trifling, and he laid about him with his immense fists in such style that the gents were all rolling in the kennel in a moment or two; and then, however, before Todd could again reach Mr. Lupin so closely as he had been, he heard a loud shout of— \"There\u0027s one of them. Come on!—Come on!\" That was no drunken shout, and Todd immediately felt that the danger was imminent. He rushed on at increased speed, and just got up to Lupin at the corner. They turned it together, and then Todd managed to say— \"They come—they come!\" \"Officers?\" said Lupin. \"Yes, I think so. On—on. Oh, push on!\" \"This way.\" Lupin crossed the road, and sprung down a narrow court; but even as he did so, came that voice, crying— \"There they go. Stop them—stop them! There they go! Fifty pounds reward!\" A frightful oath burst from Todd\u0027s lips, as he emerged from the court still close upon the heels of Lupin. They were now in a tolerably wide street, and they saw but one individual in it, and he was evidently, by the curious manner in which he sometimes favoured the curb-stone by walking upon it for a few paces, and then lumbered up against the house, just a little gone in intoxication. This individual, after some fumbling in his pocket, produced a latch key, and having staggered up the steps of a house, he made some ineffectual attempts to open the door. \"Hold!\" said Todd to Lupin. \"Anything is better than this race for life. We can hide in the passage of that house until the pursuit is past. Come.\" \"A good thought,\" said Lupin. By this time the inebriated individual had succeeded in opening the street-door with his latch-key, and he was so elated at having performed the feat, that he stopped to laugh before he entered the house. The moment, however, that he did get into the passage, Todd sprung up the steps, and very adroitly placed his foot against the door, so that when the person from within slammed it as he thought shut, it was a good two inches off that condition. It was then amusing to hear him, with drunken gravity and precision, as he thought, shooting the bolts into their sockets, after which, often tumbling on his way, he went along the passage, and up stairs. Todd opened the door. \"Come,\" he said. \"All\u0027s right,\" said Lupin. \"Stop thief! Stop thief!\" cried a chorus of voices at the corner of the street. \"Indeed,\" said Lupin, \"The Lord be good to you all.\" He stepped into the house after Todd, and very quietly closed the door. The passage was profoundly dark, and there they both stood, those two convicted murderers, listening to what was taking place outside their place of refuge. They heard the sounds of several voices, and it was quite evident that just about that spot the pursuers were baffled, and did not know now which course to take after the fugitives, who were so snugly ensconced so near them. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3276/89695.html","bookId":510,"book":{"id":510,"title":"The String of Pearls","description":"简介： The Romance of The String of Pearls having excited in the Literary world an almost unprecedented interest, it behoves the author to say a few words to his readers upon the completion of his labours....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3276","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
