{"id":12143,"no":171,"title":"CHAPTER CLXVII. TODD MEETS WITH A LITTLE ROUGH WEATHER IN THE CHANNEL.","content":"Todd almost thought that he was saved, when he felt himself fairly upon the deck of the Lively William. It seemed to him such a miracle to get so far, that his faith in completely getting the better of his enemies increased wonderfully. \"Oh, this is a relief,\" he said. \"This is, indeed, a vast relief.\" \"What do you mean?\" said one of the men of the cart to him, as he eyed him keenly. Todd was very anxious not to excite any suspicion that he was other than what he had represented himself to be; so he answered quickly— \"I mean that it is a relief to get out of the small boat into the ship. Ever so little a distance in a boat disagrees with me.\" \"Oh, that\u0027s it, is it?\" \"Yes; and if you have no particular objection, I will go below at once. I daresay the cabin accommodation is very good on board the Lively William.\" \"Oh, quite wonderful!\" said the captain. \"If you will come with me Mr.—a—a—what\u0027s your name?\" \"Wilkins,\" said Todd. \"Oh, Mr. Wilkins. Well, if you will come with me, I shall have the very great pleasure of showing you what a capital berth we can give you.\" \"Thank you,\" said Todd, and then, rather timidly, for the staircase down which the captain dived seemed to Todd better adapted for poultry than for human beings, he carefully followed his new friend. The cabin of the Lively William was a woful place. Any industrious house-wife would have sneered at it as a linen-cupboard; and if it had been mentioned as a store-room in any establishment of pretentions, it would have excited universal reprobation. It had a roof which nobbed Todd\u0027s head if he attempted to stand upright; and the walls sloped to the shape of the sides of the Lively William. The window was a square hole, with a sliding shutter; and the furniture would have made the dingiest broker\u0027s shop in London blush to own it. \"This is the state cabin,\" said the captain. \"Really?\" said Todd. \"Why, don\u0027t you see it is by its size and looks? You won\u0027t often see in a craft of this size a handsomer cabin than that of the Lively William.\" \"I dare say not,\" said Todd. \"It will do very well for me, my friend. When a man is travelling, he must not be very particular, as it is soon over.\" \"That true; but now I want to say something to you, if you please, that\u0027s rather particular. It\u0027s quite clear to me and my mate, that you want to get out of England as quickly as possible. What you have done, or what you haven\u0027t is not much matter to us, except, so far as that, we daresay you have swindled the public to a tolerable tune. We don\u0027t mean to take you for nothing.\" \"Nor do I wish you,\" said Todd. \"Nothing can possibly be further from my thoughts.\" \"Very good; then, in a word, we don\u0027t intend to do the thing unhandsome; and you shall have all the capital accommodation that the Lively William can give you to the Port of Havre for twenty pounds.\" \"Twenty pounds?\" \"Yes. If you think it is too much, you may go on shore again, and there is no harm done, you know.\" \"Oh, no—no. That is, I cannot help thinking it is a large price; and if I were to say I thought otherwise, you would not believe me; but as I really wish to go, and you say you will not take less, I must give it.\" \"Very good. That\u0027s settled, then. We shall be off at ebb-tide, and I only hope we shall have good luck, for if we do, we ought to make Havre, at all events, this time to-morrow.\" \"I hope we shall.\" \"Keep up your heart, and make yourself comfortable. Here\u0027s lots of the most amusing books on this shelf. Let me see. Here is the \u0027Navy List\u0027 for about ten years ago, and here\u0027s a \u0027Ready-reckoner,\u0027 and here is \u0027The Exciseman\u0027s Vade Mecum,\u0027 and here is a \u0027Chart of the Soundings of Baffin\u0027s Bay,\u0027 so you can\u0027t say you are out of books.\" \"Oh, how kind,\" said Todd. \"And you can order whatever you like to eat and drink, provided you don\u0027t think of anything but boiled beef, biscuits, and brandy.\" \"Oh, I shall do well enough. Rest is now what I want, and a quick voyage.\" \"Very good,\" said the captain. \"You will not be at all interrupted here, so you can lie down in this magnificent berth.\" \"What, on that shelf?\" \"Shelf? Do you call the state berth of the \u0027Lively William,\u0027 a shelf!\" \"Well—well, I dare say it is very comfortable, though the roof, I see, is only eight inches or so from one\u0027s nose. I am very much obliged. Oh, very!\" The captain now left Todd to himself and to his own thoughts, and as he really felt fatigued, he got into the state berth of the Lively William, which, to tell the truth, would have been very comfortable if it had only been a little wider and a little longer, and the roof higher, and not quite so damp and hard as it was. But, after all, what where all these little disagreeables, provided he, Todd, fairly escaped? If he once set his foot upon the shores of France, he felt that, with the great continent before him, he should be free, and he did not doubt for a moment getting in any capital a ready enough market among the Jews for the watches and jewellery that he had about him. The ship as the tide washed slowly by it, moved to and fro with a sluggish motion that rocked Todd to sleep, and he dropped off from a perception of the world and all its cares. How long he slept he knew not, but when he awoke all was darkness around him, and the first attempt he made to move brought his head into violent contact with the partition of his berth. Then Todd felt that the ship was tossing upon the water, and he could hear the dash and ripple of the sea pass her sides, while every now and then a loud splash against the closed shutter of the cabin-window warned him that that sea was not in one of its quietest moods. \"We are off!\" cried Todd, in the exultation of his spirits at that fact. \"We are off, and I am all but free.\" He attempted to get out of the berth, and he was materially assisted by a roll of the sea that sent him to the other side of the cabin, accompanied by a couple of stools and several articles that happened to be lying loose upon the floor. \"Murder!\" cried Todd. \"Hilloa!\" cried a gruff voice from the companion-way. \"Hilloa! What now?\" \"Oh, nothing,\" said Todd. \"Nothing. Where are we now? Oh, dear, what a thing it is to live in a cupboard that won\u0027t stand still.\" The gleam of a lantern flashed in Todd\u0027s eyes, and the captain came below with it swinging in his hand. He steadied himself against the table, which was firmly screwed to the floor, and hung the lantern to a short chain dependent from the cabin-roof. \"There,\" said the captain. \"The chandelier is alight now, and you will be able to see about you. Hilloa! Where are you now?\" \"Why, I rather think I fell off the shelf,\" said Todd. \"I beg your pardon, the state berth, I mean.\" \"Then you had better turn in again, for we shall have, I think, a squally sort of night rather. There are symptoms of a sou wester, and if so, you will know a little of what weather is in the Channel.\" \"Where are we now?\" said Todd, mournfully. \"About fifteen miles off the North Foreland, so we are tolerably quiet just yet; but when we turn the head of the land, it\u0027s likely enough we may find out what the wind means to say to us.\" While the captain spoke, he tugged on a complete suit of waterproof apparel, that seemed as thick and inflexible as so much armour covered with tar, and then up he went upon deck again, leaving Todd to the society of his own reflections and the chandelier. The Lively William was going on just then with a flowing sheet, so that she was carrying a tolerably even keel, and Todd was able to get up and reach his berth; but at the moment that he laid hold of the side of it to clamber in, the ship was tacked, and away went Todd to the opposite side of the state-cabin with the rug in his grasp that did duty as a counterpane in the berth. \"This will kill me,\" he groaned. \"Oh, this will kill me. But yet—yet I am escaping, and that is something. There will be a storm, but all ships are not lost that encounter storms.\" Todd made up his mind to remain where he was, jammed up against the cabin partition, until the ship should right itself sufficiently for him to make another effort to reach his berth. After a few minutes he thought he would make the attempt. \"Now,\" he said. \"Now, surely, I can do it. I will try. How the wind howls, to be sure, and how the waves dash against the ship\u0027s sides, as though they would stave in her timbers; but all is well, no doubt. I will try again.\" Very cautiously now Todd crept to his berth, and this time the winds and the waves were kind enough only to move the ship so that he knocked his head right and left a little, and managed then to scramble on to the little inconvenient shelf, with its damp mattress that served for a bed. \"Ah,\" said Todd, \"and there are people who might, if they liked, stay on land all their lives, and yet they pretend to prefer the sea. There\u0027s no accounting for tastes.\" By dint of jerking it a little from under him, Todd propped the mattress against the outer edge of the berth; so that provided the vessel did lurch in that direction, it was not so likely to tumble him out, and there he lay listening to the winds and the waves. \"A storm in the Channel!\" he muttered. \"From what that beast of a captain said, it appears we are to have one. Well, well, I have weathered many a storm on land, and now I must put up with one at sea.\" At this moment, there was a tremendous bustle upon deck, and some orders were issued that were quite unintelligible to Todd. There was, however, a great flapping of canvas, and a rattling of chains. The Lively William was weathering the South Foreland, and just going to do battle with half a gale of wind in the Channel. Up to this point, Todd had, with something approaching to resignation, put up with the disagreeables about him; and upon the principle of the song which states that— \"When a man travels, he mustn\u0027t look queer, If he meets a few rubs that he does not meet here,\" he regarded his position with philosophy; but now there came over him a dreadful sensation. A cold clammy dew burst out upon his face—all strength fled from his limbs, and with a deep groan, Todd began to feel the real horror of sea sickness. Nothing can be like sea sickness but death, and nothing can be like death but sea sickness. Todd had never suffered from that calamity before; and now that it came upon him, in all its aggravated horrors, he could not believe that it was a mere passing indisposition, but concluded that he must have been poisoned by the captain of the ship, and that his last hour was come. And now Todd would fain have made a noise, and called for help. He would have liked to fire one of his pistols in the face of that captain, provided he could but have got him to the side of his berth; but he had not strength left to utter a word above a whisper; and as for moving his hand to his pockets to get out his fire-arms, he could not so much as lift a finger. All Todd could do was to go on, and to get each moment worse and worse with that awful sensation of sickness, which resembles the sickness of the soul at parting from its mortal house, to which it had clung so long. The wind howled upon the deck and through the cordage of the vessel—the spray dashed over her bulwarks, and each moment the storm increased in fury. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3276/89728.html","bookId":510,"book":{"id":510,"title":"The String of Pearls","description":"简介： The Romance of The String of Pearls having excited in the Literary world an almost unprecedented interest, it behoves the author to say a few words to his readers upon the completion of his labours....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3276","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
