{"id":12001,"no":29,"title":"CHAPTER XXVII. THE CONSULTATION OF COLONEL JEFFERY WITH THE MAGISTRATE.","content":"The advice which his friend had given to Colonel Jeffery was certainly the very best that could have been tendered to him; and, under the whole of these circumstances, it would have been something little short of absolute folly to have ventured into the shop of Sweeney Todd without previously taking every possible precaution to ensure the safety of so doing. Sir Richard was within when they reached his house, and, with the acuteness of a man of business, he at once entered into the affair. As the colonel, who was the spokesman, proceeded, it was evident that the magistrate became deeply interested. Colonel Jeffery concluded by saying— \"You will thus, at all events, perceive that there is great mystery somewhere.\" \"And guilt, I should say,\" replied the magistrate. \"You are of that opinion, Sir Richard?\" \"I am, most decidedly.\" \"Then what would you propose to do? Believe me, I do not ask out of any idle curiosity, but from a firm faith, that what you set about will be accomplished in a satisfactory manner.\" \"Why, in the first place, I shall certainly go and get shaved at Todd\u0027s shop.\" \"You will venture that?\" \"Oh, yes; but do not fancy that I am so headstrong and foolish as to run any unnecessary risks in the matter—I shall do no such thing: you may be assured that I will do all in my power to provide for my own safety; and if I did not think I could do that most effectually, I should not be at all in love with the adventure; but, on the contrary, carefully avoid it to the best of my ability. We have before heard something of Mr. Todd.\" \"Indeed!—and of a criminal character?\" \"Yes; a lady once in the street took a fancy to a pair of shoe-buckles of imitation diamonds that Todd had on, when he was going to some city entertainment; she screamed out, and declared that they had belonged to her husband, who had gone out one morning, from his house in Fetter-lane, to get himself shaved. The case came before me, but the buckles were of too common a kind to enable the lady to persevere in her statement; and Todd, who preserved the most imperturbable coolness throughout the affair, was, of course, discharged.\" \"But the matter left a suspicion upon your mind?\" \"It did; and more than once I have resolved in my own mind what means could be adopted of coming at the truth: other affairs, however, of more immediate urgency have occupied me, but the circumstances you detail revive all my former feelings upon the subject; and I shall now feel that the matter has come before me in a shape to merit immediate attention.\" This was gratifying to Colonel Jeffery, because it not only took a great weight off his shoulders, but it led him to think, from the well-known tact of the magistrate, that something certainly would be accomplished, and that very shortly too, towards unravelling the secret that had as yet only appeared to be more complicated and intricate the more it was inquired into. He made the warmest acknowledgments to the magistrate for the courtesy of his reception, and then took his leave. As soon as the magistrate was alone, he rang a small hand-bell that was upon the table, and the summons was answered by a man, to whom he said— \"Is Crotchet here?\" \"Yes, your worship.\" \"Then, tell him I want him at once, will you?\" The messenger retired, but he presently returned, bringing with him about as rough a specimen of humanity as the world could have produced. He was tall and stout, and his face looked as if, by repeated injuries, it had been knocked out of all shape, for the features were most strangely jumbled together indeed, and an obliquity of vision, which rendered it always a matter of doubt who and what he was looking at, by no means added to his personal charms. \"Sit down, Crotchet,\" said the magistrate, \"and listen to me without a word of interruption.\" If Mr. Crotchet had no other good quality on earth, he still had that of listening attentively, and he never opened his mouth while the magistrate related to him what had just formed the subject matter of Mr. Jeffery\u0027s communication; indeed, Crotchet seemed to be looking out of the window all the while; but then Sir Richard knew the little peculiarities of his visual organs. When he concluded his statement, Sir Richard said— \"Well, Crotchet, what do you think of all that? What does Sweeney Todd do with his customers?\" Mr. Crotchet gave a singular and peculiar kind of grin, as he said, still looking apparently out of the window, although his eyes were really fixed upon the magistrate— \"He smugs \u0027em.\" \"What?\" \"Uses \u0027em up, yer worship; it\u0027s as clear to me as mud in a wine-glass, that it is. Lor\u0027 bless you! I\u0027ve been thinking he did that \u0027ere sort of thing a deuce of a while, but I didn\u0027t like to interfere too soon, you see.\" \"What do you advise, Crotchet? I know I can trust to your sagacity in such a case.\" \"Why, your worship, I\u0027ll think it over a bit in the course of the day, and let your worship know what I think. It\u0027s a awkward job rather, for a wariety of reasons, but howsomdever there\u0027s always a something to be done, and if we don\u0027t do it, I\u0027ll be hung if I know who can, that\u0027s all!\" \"True, true, you are right there; and, perhaps, before you see me again, you will walk down Fleet-street, and see if you can make any observations that will be of advantage in the matter. It is an affair which requires great caution indeed.\" \"Trust me, yer worship: I\u0027ll do it, and no mistake. Lor\u0027 bless you, it\u0027s easy for anybody now to go lounging about Fleet-street, without being taken much notice of; for the fact is, the whole place is agog about the horrid smell as has been for never so long in the old church of St. Dunstan.\" \"Smell—smell—in St. Dunstan\u0027s church! I never heard of that before, Crotchet.\" \"Oh, Lor\u0027 yes, it\u0027s enough to pison the devil himself, Sir Richard; and t\u0027other day when the blessed bishop went to \u0027firm a lot of people, he as good as told \u0027em they might all be damned first, afore he \u0027firm nobody in such a place.\" The magistrate was in a deep thought for a few minutes, and then he said suddenly— \"Well, well, Crotchet, you turn the matter over in your mind and see what you can make of it; I will think it over likewise. Do you hear?—mind you are with me at six this evening punctually; I do not intend to let the matter rest, and you may depend, that from this moment I will give it my greatest attention.\" \"Wery good, yer worship; wery good indeed; I\u0027ll be here, and something seems to strike me uncommon forcible that we shall unearth this fox very soon, yer worship.\" \"I sincerely hope so.\" Mr. Crotchet took his leave, and when he was alone the magistrate rose and paced his apartment for some time with rapid strides, as if he was much agitated by the reflections that were passing through his mind. At length he flung himself into a chair with something like a groan, as he said— \"A horrible idea forces itself upon my consideration—most horrible! most horrible! most horrible! Well, well, we shall see—we shall see. It may not be so: and yet what a hideous probability stares me in the face! I will go down at once to St. Dunstan\u0027s and see what they are really about. Yes, yes, I shall not get much sleep I think now, until some of these mysteries are developed. A most horrible idea, truly!\" The magistrate left some directions at home concerning some business calls which he fully expected in the course of the next two hours, and then he put on a plain, sad-coloured cloak and a hat destitute of all ornament, and left his house with a rapid step. He took the most direct route towards St. Dunstan\u0027s church, and finding the door of the sacred edifice yielded to the touch, he at once entered it; but he had not advanced many steps before he was met and accosted by the beadle, who said, in a tone of great dignity and authority— \"This ain\u0027t Sunday, sir; there ain\u0027t no service here to-day.\" \"I don\u0027t suppose there is,\" replied the magistrate; \"but I see you have workmen here. What is it you are about?\" \"Well, of all the impudence that ever I came near, this is the worstest—to ask a beadle what he is about; I beg to say, sir, this is quite private, and there\u0027s the door.\" \"Yes, I see it, and you may go out at it just as soon as you think proper.\" \"Oh, conwulsions! oh, conwulsions! This to a beadle.\" \"What is all this about?\" said a gentlemanly-looking man, stepping forward from a part of the church where several masons were employed in raising some of the huge flag-stones with which it was paved. \"What disturbance is this?\" \"I believe, Mr. Antrobus, you know me,\" said the magistrate. \"Oh, Sir Richard, certainly. How do you do?\" \"Gracious,\" said the beadle, \"I\u0027ve put my blessed foot in it. Lor\u0027 bless us, sir, how should I know as you was Sir Richard? I begs as you won\u0027t think nothing o\u0027 what I said. If I had a knowed you, in course I shouldn\u0027t have said it, you may depend, Sir Richard—I humbly begs your pardon.\" \"It\u0027s of no consequence—I ought to have announced myself; and you are perfectly justified in keeping strangers out of the church, my friend.\" The magistrate walked up the aisle with Mr. Antrobus, who was one of the churchwardens; and as he did so, he said, in a low, confidential tone of voice— \"I have heard some strange reports about a terrible stench in the church. What does it mean? I suppose you know all about it, and what it arises from?\" \"Indeed I do not. If you have heard that there is a horrible smell in the church after it has been shut up for some time, and upon the least change in the weather, from dry or wet, or cold or warm, you know as much as we know upon the subject. It is a most serious nuisance, and, in fact, my presence here to-day is to try and make some discovery of the cause of the stench; and you see we are going to work our way into some of the old vaults that have not been opened for some time, with a hope of finding out the cause of this disagreeable odour.\" \"Have you any objection to my being a spectator?\" \"None in the least.\" \"I thank you. Let us now join the workmen, and I can only now tell you that I feel the strongest possible curiosity to ascertain what can be the meaning of all this, and shall watch the proceedings with the greatest amount of interest.\" \"Come along then; I can only say, for my part, that, as an individual, I am glad you are here, and as a magistrate, likewise, it gives me great satisfaction to have you.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3276/89586.html","bookId":510,"book":{"id":510,"title":"The String of Pearls","description":"简介： The Romance of The String of Pearls having excited in the Literary world an almost unprecedented interest, it behoves the author to say a few words to his readers upon the completion of his labours....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3276","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
