{"id":12004,"no":32,"title":"CHAPTER XXX. MRS. LOVETT\u0027S COOK MAKES A DESPERATE ATTEMPT.","content":"There are folks who can and who will bow like reeds to the decrees of evil fortune, and with a patient, ass-like placidity, go on bearing the ruffles of a thankless world without complaining, but Mrs. Lovett\u0027s new cook was not one of those. The more destiny seemed to say to him—\"Be quiet!\" the more he writhed, and wriggled, and fumed, and could not be quiet. The more fate whispered in his ears—\"You can do nothing,\" the more intent he was upon doing something, let it be what it might. And he had a little something, in the shape of a respite too, now, for had he not baked a batch of pies, and sent them up to the devouring fangs of the lawyers\u0027 clerks in all their gelatinous, beauty and gushing sweetness, to be devoured. To be sure he had, and therefore having, for a space, obeyed the behests of his task-mistress, he could sit with his head resting upon his hands and think. Thought! What a luxury! Where is the Indian satrap—where the arch Inquisitor—where the grasping, dishonest, scheming employer who can stop a man from thinking?—and as Shakspeare, says of sleep, \"From that sleep, what dreams may come?\" so might he have said of thought, From that thought what acts may come? Now we are afraid that, in the first place, the cook, in spite of himself, uttered some expression concerning Mrs. Lovett of neither an evangelical or a polite character, and with these we need not trouble the reader. They acted as a sort of safety-valve to his feelings, and after consigning that fascinating female to a certain warm place, where we may fancy everybody\u0027s pie might be cooked on the very shortest notice, he got a little more calm. \"What shall I do?—what shall I do?\" Such was the rather vague question he asked of himself. Alas! how often are those four simple words linked together, finding but a vain echo in the over-charged heart. What shall I do? Ay, what!—small power had he to do anything, except the quietest thing of all—that one thing which Heaven in its mercy has left for every wretch to do if it so pleases him—to die! But, somehow or another, a man upon the up-hill side of life is apt to think he may do something rather than that, and our cook, although he was about as desperate a cook as the world ever saw, did not like yet to say die. Now, in that curious combination of passions, impulses, and prejudices in the mind of this man it would be a hard case if some scheme of action did not present itself, even in circumstances of the greatest possible seeming depression, and so, after a time, the cook did think of something to do. \"Many of these pies,\" he said to himself, \"are not eaten in the shop, ergo they are eaten out of the shop, and possibly at the respective houses of the purchasers—what more feasible mode of disclosing my position, and \u0027the secrets of my prison-house,\u0027 can there be than the enclosing a note in one of Mrs. Lovett\u0027s pies?\" After reviewing all the pros and cons of this scheme, there only appeared a few little difficulties in the way, but, although they were rather serious, they were not insurmountable. In the first place, it was possible enough that the unfortunate pie in which the note might be enclosed might be eaten in the shop, in which event the note might go down the throat of some hungry lawyer\u0027s clerk, and it might be handed to Mrs. Lovett, with a \"God bless me, ma\u0027am, what\u0027s this in the pie?\" and then Mrs. Lovett might, by a not very remote possibility, say to herself—\"This cook is a scheming, long-headed sort of a cook, and notwithstanding he does his duty by the pies, he shall be sent upon an errand to another and a better world,\" and in that case the delectable scheme of the note could only end in the total destruction of the unfortunate who conceived it. Objection the second was, that, although nothing is so easy as to say—\"Oh, write a note all about it,\" nothing is so difficult as to write a note about anything without paper, ink, and a pen. The cook rubbed his forehead, and cried— \"D——n it!\" This seemed to have the desired effect, for he at once recollected that he was supplied with a thin piece of paper for the purpose of laying over the pies if the oven should by chance be over heated, and so subject them to an over-browning process. \"Surely,\" he thought, \"I shall be able to make a substitute for a pen, and as for ink, a little coal and water, or—ah, I have it, black from my lights, of course. Ha—ha! How difficulties vanish when a man has thoroughly made up his mind to overcome them. Ha—ha! I write a note—I post it in a pie—some lawyer sends his clerk for a pie, and he gets that pie. He opens it and sees the note—he reads it—he flies to a police-office, and gets a private interview with a magistrate—a couple of Bow-street runners walk down to Bell Yard, and seize Mrs. Lovett—I hear a row in the shop, and cry—\u0027Here I am—I am here—make haste—here I am—here I am!\u0027 Ha—ha—ha—ha—ha—ha!\" \"Are you mad?\" The cook started to his feet— \"Who spoke—who spoke?\" \"I,\" said Mrs. Lovett, looking through the ingenious little wicket at the top of the door. \"What do you mean by that laughing? If you have gone mad, as one cook once did, death will be a relief to you. Only convince me of that fact, and in two hours you sleep the long sleep.\" \"I beg your pardon, ma\u0027am, I am not at all mad.\" \"Then why did you laugh in such a way that it reached even my ears above?\" \"Why, ma\u0027am, are you not a widow?\" \"Well?\" \"Well then, you could not have possibly looked at me as you ought to have done, or you would have seen that I am anything but a bad looking fellow, and as I am decidedly single, what do you say to taking me for better or for worse? The pie business is a thriving one, and, of course, if I had an interest in it, I should say nothing of affairs down below here.\" \"Fool!\" \"Thank you, madam, for the compliment, but I assure you, the idea of such an arrangement made me laugh, and at all events, provided I do my duty, you don\u0027t mind my laughing a little at it?\" Mrs. Lovett disdained any further conversation with the cook, and closed the little wicket. When she was gone he took himself seriously to task for being so foolish as to utter his thoughts aloud, but yet he did not think he had gone so far as to speak loud enough about the plan of putting the letter in a pie for her to hear that. \"Oh, no—no, I am safe enough. It was the laughing that made her come. I am safe as yet!\" Having satisfied himself fully upon this point, he at once set to work to manufacture his note. The paper, as he had said, was ready at hand. To be sure, it was of a thin and flimsy texture, and decidedly brown, but a man in his situation could be hardly supposed to stand upon punctilios. After some trouble he succeeded in making an apology for a pen by the aid of a piece of stick, and he manufactured some very tolerable ink, at least, as good as the soot and water commonly sold in London for the best \"japan,\" and then he set about writing his note. As we have an opportunity of looking over his shoulder, we give the note verbatim. \"Sir—(or Madam)—I am a prisoner beneath the shop of Mrs. Lovett, the pie female, in Bell Yard. I am threatened with death if I attempt to escape from my now enforced employment. Moreover, I am convinced that there is some dreadful secret connected with the pies, which I can hardly trust my imagination to dwell upon, much less here set it down. Pray instantly, upon receipt of this, go to the nearest police-office and procure me immediate aid, or I shall soon be numbered with the dead. In the sacred names of justice and humanity, I charge you to do this.\" The cook did not, for fear of accidents, put his name to this epistle. It was sufficient, he thought, that he designated his condition, and pointed out where he was. This note he folded into a close flat shape, and pressed it with his hands, so that it would take up a very small portion of room in a pie, and yet, from its size and nature, if the pie fell into the hands of some gourmand who commenced eating it violently, he could not fail to feel that there was a something in his mouth more indigestible than the delicate mutton or veal and the flaky crust of which Mrs. Lovett\u0027s delicacies were composed. Having proceeded thus far, he concluded that the only real risk he ran was, that the pie might be eaten in the shop, and the enclosure, without examination, handed over to Mrs. Lovett merely as a piece of paper which had insinuated itself where it had no right to be. But as no design whatever can be carried out without some risk or another, he was not disposed to give up his, because some contingency of that character was attached to it. The prospect of deliverance from the horrible condition to which he was reduced, now spread over his mind a pleasing calm, and he set about the manufacture of a batch of pies, so as to have it ready for the oven when the bell should ring.—Into one of them he carefully introduced his note. Oh, what an eye he kept upon that individual pie. How often he carefully lifted the upper crust, to have a peep at the little missive which was about to go upon an errand of life or death.—How he tried to picture to his mind\u0027s eye the sort of person into whose hands it might fall, and then how he thought he would listen for any sounds during the next few hours, which should be indicative of the arrest of Mrs. Lovett, and the presence of the police in the place. He thought, then, that if his laugh had been sufficiently loud when merely uttered to himself, to reach the ears of Mrs. Lovett, surely his shout to the police would be heard above all other sounds, and at once bring them to his aid. Tingle! tingle! tingle! went a bell. It was the signal for him to get a batch of pies ready for the oven. \"Good,\" he said, \"it is done.\" He waited until the signal was given to him to put them in to be cooked, and then, after casting one more look at the pie that contained his note, in went the batch to the hot air of the oven, which came out upon his face like the breath of some giant in a highly febrile state. \"\u0027Tis done,\" he said. \"\u0027Tis done, and I am saved!\" He sat down and covered his face with his hands, while delicious dreamy thoughts of freedom came across his brain. Green fields, trees, meadows and uplands, and the sweet blue sky, all appeared before him in bright and beautiful array. \"Yes,\" he said. \"Yes, I shall see them all once again.—Once again I shall look, perchance, upon the bounding deep blue sea. Once again I shall feel the sun of a happier clime than this fanning my cheek. Oh, liberty, liberty, what a precious boon art thou!\" Tingle! tingle! tingle! He started from his dream of joy. The pies are wanted; Mrs. Lovett knew well enough how long they took in doing, and that by this time they should be ready to be placed upon the ascending trap. Down it came. Open went the oven door, and in another minute the note was in the shop. The cook placed his hand upon his heart to still its tumultuous beating as he listened intently. He could hear the sound of feet above—only dimly though, through that double roof. Once he thought he heard high words, but all died away again, and nothing came of it.—All was profoundly still. The batch of pies surely were sold now, and in a paper bag he told himself his pie, par excellence, had gone perhaps to the chambers of some attorney, who would be rejoiced to have a finger in it; or to some briefless barrister, who would be rejoiced to get his name in the papers, even if it were only connected with a story of a pie. Yes, the dream of freedom still clung to the imagination of the cook, and he waited, with every nerve thrilling with expectation, the result of his plan. One, two, three hours had passed away, and nothing came of the pie or the letter. All was as quiet and as calm as though the malignant fates had determined that there he was to spend his days for ever, and gradually as in a frigid situation the narrow column of mercury in a thermometer will sink, sank his spirits—down—down—down! \"No—no,\" he said. \"No hope. Timidity or incredulity has consigned my letter to the flames, perhaps, or some wide-mouthed, stupid idiot has actually swallowed it. Oh that it had choked him by the way. Oh that it had actually stuck in his throat.—It is over, I have lost hope again. This horrible place will be my charnel-house—my family vault! Curses!—No—no. What is the use of swearing? My despair is past that—far past that—\" \"Cook!\" said a voice. He sprang up, and looked to the wicket. There was Mrs. Lovett gazing in at him. \"Cook!\" \"Well—well.—Fiend in female shape, what would you with me? Did you not expect to find me dead?\" \"Certainly not. Here is a letter for you.\" \"A—a—letter?\" \"Yes. Perhaps it is an answer to the one you sent in the pie, you know.\" The unfortunate grasped his head, and gave a yell of despair. The letter—for indeed Mrs. Lovett had one—was dropped upon the ground floor from the opening through which she conversed with her prisoner, and then, without another word, she withdrew from the little orifice, and left him to his meditation. \"Lost!—lost!—lost!\" he cried. \"All is lost. God, is this enchantment? Or am I mad, and the inmate of some cell in an abode of lunacy, and all this about pies and letters merely the delusion of my overwrought fancy? Is there really a pie—a Mrs. Lovett—a Bell Yard—a letter—a—a—a—damn it, is there such a wretch as I myself, in this vast bustling world, or is all a wild and fathomless delusion?\" He cast himself upon the ground, as though from that moment he gave up all hope and desire to save himself. It seemed as though he could have said— \"Let death come in any shape he may, he will find me an unresisting victim. I have fought with fate, and am, like thousands who have preceded me in such a contest—beaten!\" A kind of stupor came over him, and there he lay for more than two hours; but youth will overcome much, and the mind, like some depressed spring, will, in the spring of life, soon recover its rebound; so it was with the unhappy cook. After a time he rose and looked about him. \"No,\" he said, \"it is no dream. It is no dream!\" He then saw the letter lying upon the ground, which Mrs. Lovett had with such irony cast unto him. \"Surely,\" he said, \"she might have been content to tell me she had discovered my plans, without adding this practical sneer to it.\" He lifted the letter from the floor, and found it was addressed \"To Mrs. Lovett\u0027s Cook, Bell Yard, Temple Bar;\" and what made it all the more provoking was, that it seemed to have come regularly through the post, for there were the official seal and blue stamp upon it. Curiosity tempted him to open it, and he read as follows:— \"Sir—Having, in a most delicious pie, received the extraordinary communication which you inserted in it, I take the earliest opportunity of replying to you. The character of a highly respectable and pious woman is not, sir, to be whispered away in a pie by a cook. When the whole bench of bishops were proved, in black and white, to be the greatest thieves and speculators in the known world, it was their character that saved them, for, as people justly enough reasoned, bishops should be pious and just—therefore, a bishop cannot be a thief and a liar! Now, sir, apply this little mandate to Mrs. Lovett, and assure yourself; but no one will believe anything you can allege against a female with so fascinating a smile, and who attends to her religious duties so regularly. Reflect, young man, on the evil that you have tried to do, and for the future learn to be satisfied with the excellent situation you have. The pie was very good.\" I am, you bad young man, A Parishioner of St. Dunstan\u0027s, Sweeney Todd.\" \"Now was there ever such a piece of cool rascality as this?\" cried the cook, \"Sweeney Todd—Todd—Todd. Who the devil is he? This is some scheme of Mrs. Lovett\u0027s to drive me mad.\" He dashed the letter upon the floor. \"Not another pie will I make! No—no—no. Welcome death—welcome that dissolution which may be my lot, rather than the continued endurance of this terrible imprisonment. Am I, at my time of life, to be made the slave of such a demon in human shape as this woman? Am I to grow old and grey here, a mere pie machine? No—no, death a thousand times rather!\" Tears! yes, bitter scalding tears came to his relief, and he wept abundantly, but those tears were blessed, for as they flowed, the worst bitterness of his heart flowed with them, and he suddenly looked up, saying— \"I am only twenty-four.\" There was magic in the sound of those words. They seemed in themselves to contain a volume of philosophy. Only twenty-four. Should he, at that green and unripe age, get rid of hope? Should he, at twenty-four only, lie down and say—\"Let me die!\" just because things had gone a little adverse, and he was the enforced cook of Mrs. Lovett? \"No—no,\" he said. \"No, I will endure much, and I will hope much. Hitherto, it is true, I have been unsuccessful in what I have attempted for my release, but the diabolical cunning, even of this woman, may fail her at some moment, and I may have my time of revenge. No—no, I need not ask for revenge, justice will do—common justice. I will keep myself alive. Hope shall be my guiding star. They shall not subdue the proud spirit they have succeeded in caging, quite so easily, I will not give up, I live and have youthful blood in my veins, I will not despair. Despair? No—Hence, fiend!—I am as yet only twenty-four. Ha—ha! Only twenty-four.\"","sourceLink":"http://novel.tingroom.com/duanpian/3276/89589.html","bookId":510,"book":{"id":510,"title":"The String of Pearls","description":"简介： The Romance of The String of Pearls having excited in the Literary world an almost unprecedented interest, it behoves the author to say a few words to his readers upon the completion of his labours....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3276","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
