{"id":12032,"no":60,"title":"CHAPTER LVIII. THE GRAND CONSULTATION IN THE TEMPLE.","content":"With this sage aphorism, Ben effected a hasty retreat from the optician\u0027s house by the private door, so that he should not run the risk of encountering Mrs. Oakley, who had made her appearance by the shop way. When Johanna was alone, she once again read the little missive from the colonel; and then, burying her face in her hands, she tried still to think that it was possible he might have some good news to tell her. And yet, if such had been the case, would he not have written it? Would he, feeling for her as she knew he did, have kept her in a state of suspense upon such a subject? Ah, no. He would rather have, in spite of all obstacles, made his way into the shop, and called to her—\"Johanna, Mark Ingestrie lives,\" if he had really been in a position to say so much. As these thoughts chased each other through the mind of the young girl, she shed abundance of tears; and so absorbed was she in her grief, that she was not aware that any one was present, until she felt a light touch upon her shoulder, and upon starting round suddenly, she saw her friend Arabella Wilmot standing close to her. \"Johanna?\" \"Yes—yes, Arabella. I am here.\" \"Yes, dear Johanna. But you are weeping.\" \"I am—I am. To you these tears shall be no secret, Arabella. Alas! alas! You, who know my heart, know how much I have to weep for. You can bear with me. You are the only one in all the world whom I would willingly let see these bitter—bitter tears.\" At those words, Johanna wept afresh, and the heart of her young friend was melted; but recovering sooner than Johanna, Arabella was able to speak somewhat composedly to her, saying— \"Have you heard anything, Johanna, new?\" \"No—no. Except that Mr. Jeffery wishes to see me again to tell me something, and as he has not said in his letter what it is, I can guess it is no good news.\" \"Nay; is not that assuming too much?\" \"No—no. I know he would, if he had had any joyous intelligence for me, have written it. He would feel of what a suspense even a few hours would be upon such a subject. No, Arabella, I feel that what he has to say is some terrible confirmation of my worst fears.\" Arabella found it no easy task to combat this course of reasoning upon the part of Johanna. She felt its force, and yet she felt at the same time that it was somewhat incumbent upon her to resist it, and to make at least the endeavour to ward off the deep depression that had seized upon Johanna. \"Now listen to me,\" she said. \"Perhaps what Colonel Jeffery has to say to you is, after all, a something hopeful; but, at the same time, being only hopeful, and nothing positive, he may have felt how difficult it was to write it, without exciting undue effects in your mind, and so prefers saying it, when he can accompany it by all the little collateral circumstances which alone can give it its proper value.\" There was something like a gleam of sunshine in this idea. \"Do you understand me, dear Johanna?\" \"Yes—yes.\" Johanna spoke more firmly than before. The last argument of her friend had had all its weight with her, and had chased away many of the gloomy thoughts that had but a few moments before possessed her. What a strange compound is the human mind, and how singularly does it take its texture, cameleon-like, from surrounding circumstances? But a few moments since, and, to Johanna the brief epistle of the colonel was suggestive of nothing but despair. How different now was its aspect? Arabella Wilmot had, by a few simple words, placed it in a new light, so that it started to the imagination of Johanna symbols of life. \"Ah! you are hoping now,\" said Arabella. \"I am—I am. Perhaps it is as you say, Arabella. I will think it is.\" Miss Wilmot was now almost afraid that she had gone too far, and conjured up too much hope; but she could not bear the idea of dashing down again the fairy fabric of expectation she had moved in the bosom of Johanna, and merely added— \"Well, Johanna, since you find that the letter will, at all events, bear two interpretations, I am sure that, until you may be convinced it owns to the worst, you will be as composed as possible.\" \"I will. And now, Arabella, will you, and can you accompany me this evening to the Temple Gardens, to meet Colonel Jeffery?\" \"Yes, Johanna. I both can and will, if such is your wish.\" \"It is, Arabella, much my wish, for I feel that if what our friend, the colonel, has to say, should not be of a hopeful character, I should never be able to repeat it to you, so as to have your opinion of it.\" \"Then we will go together. But we will not pass that dreadful man\u0027s shop.\" \"Todd\u0027s?\" \"Yes.\" \"Why not, Arabella? I feel, the moment that I leave this house, as though some irresistible fascination dragged me there, and I think I could no more pass down Fleet Street without directing my eyes to that building, which perchance has proved fatal to poor Mark, than I could fly.\" \"But—but, I shrink from that man recognising us again.\" \"We will pass upon the other side of the way, Arabella; but do not say nay to me, for pass I must.\" There was such a frantic sort of earnestness in the manner in which Johanna urged this point, that Arabella no longer made any sort of opposition to it, and the two young girls soon arranged a time of meeting, when they would proceed together to the Temple Gardens, to give Colonel Jeffery the meeting he so much desired. As nothing of a very particular character occurred that day, we will at once follow Arabella and Johanna upon the mission, premising that the hours have slipped away which intervened between the time of Johanna receiving the note from Colonel Jeffery, and the time when, if she kept the appointment with him, it would be necessary for her to start from home to do so. Both the young girls made as great alterations in their attire as they could upon this occasion, so that they should not be strikingly recognisable again by Todd; and then Arabella reminding Johanna that the bargain between them was to pass upon the other side of the way, they both set off from the old spectacle-maker\u0027s. As they neared Fleet Street, the agitation of Johanna became more and more apparent, and Arabella was compelled to counsel her to calmness, lest the passers-by should notice how much she felt, from some cause to them unknown. \"My dear Johanna,\" she said. \"Your arm trembles in mine. Oh! pray be calm.\" \"I will—I will. Are we near?\" \"Yes. Let us cross.\" They reached the other side of the way from that on which Todd\u0027s shop was situated, to the great relief of Arabella, who as yet knew not of the placard that Todd had exhibited in his window, announcing the want of a pious youth. The sight of the shop, however, seemed to bring that circumstance to the mind of Johanna, and she told her young friend of it at once. \"Oh! Johanna,\" said Arabella, \"does it not seem as though—\" She paused, and Johanna looked enquiringly at her, saying— \"What would you say, Arabella? What would you say?\" \"Nothing now, Johanna. Nothing now. A thought struck me, and when we return from this meeting with your friend, the colonel, I will communicate it to you. Oh! do not look opposite. Do not.\" All such injunctions were thrown away upon Johanna. Look opposite she did, and as she herself had truly said, it would have been quite impossible for her to avoid the doing so, even if the greatest personal risk had been risked in the action. But Todd\u0027s shop, to look at from the other side of the way, presented no terrors. It simply presented the idea of a little barber\u0027s shop, of no very great pretensions, but of sufficient respectability, as barber\u0027s shops were in those days, not to make any decent person shrink from going into it. No doubt, in the crowd of Fleet Street—for Fleet Street was then crowded, although not to the extent it is now—Johanna and her friend passed quite unnoticed by Todd, even if he had been looking out. At all events, they reached Temple Bar without any obstruction or adventure. Finding, then, that they had passed the main entrance to the Temple, they went down the nearest adjacent street, and pursuing a circuitous route through some curious-looking courts, they reached their destination yet a little before the appointed hour. Colonel Jeffery, however, was not likely to keep Johanna Oakley waiting. \"There,\" said Arabella. \"Is that the colonel?\" Johanna looked up just as the colonel approached, and lifted his hat. \"Yes, yes.\" In another moment he was with them. There was a look upon the countenance of Colonel Jeffery of deep concern, and that look, at one glance that was bestowed upon it by Johanna Oakley, was quite sufficient to banish all hidden hopes that she might yet have cherished regarding the character of the news that he had to impart to her. Arabella Wilmot, too, was of the same opinion regarding the physiognomical expression of the colonel, who bowed to her profoundly. Johanna And Arabella Meet And Consult Colonel Jeffery, In Temple Gardens. Johanna And Arabella Meet And Consult Colonel Jeffery, In Temple Gardens. \"I have brought my dearest friend with me,\" said Johanna, \"from whom I have no secrets.\" \"Nor I,\" said the colonel, \"now that I hear she stands in such an enviable relation to you, Miss Oakley.\" Arabella slightly bowed; and Johanna fixing her eyes, in which tears were glistening, upon him, said— \"You have come to tell me that I may abandon all hope?\" \"No—no; Heaven forbid!\" A bright flush came over the face of the young girl, and clasping her hands, she said— \"Oh, sir, do not play with feelings that perhaps you scarcely guess at. Do not tamper with a heart so near breaking as mine. It is cruel—cruel!\" \"Do I deserve such a charge,\" said the colonel, \"even by implication?\" \"No—no,\" said Arabella. \"Recollect yourself, Johanna. You are unjust to one who has shown himself to be your friend, and a friend to him whom you hope to see again.\" Johanna held out her little child-like hand to the colonel, and looking appealingly in his face, she said— \"Can you forgive me? It was not I who spoke, but it was the agony of my heart that fashioned itself at the moment into words my better judgment and my better feelings will not own. Can you forgive me?\" \"Can I, Miss Oakley! Oh, do not ask me. God grant that I could make you happy.\" \"I thank you, sir, deeply and truly thank you; and—and—now—now—\" \"Now, you would say, tell me my news.\" \"Yes. Oh, yes.\" \"Then let us walk upon this broad path, by the river, while, in the first instance, I tell you that it was only from a deep sense of duty, and a feeling that I ought not, upon any consideration, to keep anything from you, that I came here to-day to give you some more information, and yet fresh information.\" \"You are very—very good to me, sir.\" \"No—no, do not say that, Miss Oakley. I am a friend. I am only very selfish; but, in brief, the lad who was in the barber\u0027s service at the time we think Mark Ingestrie called at the shop with the string of pearls in his possession, has told us all he knows upon the subject, freely.\" \"Yes—yes; and—and—\" \"He knows very little.\" \"But that little?\" \"Just amounts to this:—That such a person did come to the shop, and that he is quite clear that he never left it.\" \"Quite clear that he never left it!\" repeated Johanna—\"that he never left it. Quite clear that—that—\" She burst into tears, and clung to Arabella Wilmot for support. The colonel looked inexpressibly distressed, but he did not speak. He felt that any common-place topics of consolation would have been an insult; and he had seen enough of human feelings to know that such bursts of passionate grief cannot be stemmed, but must have their course, and that such tears will flow like irresistible torrents into the ocean of eternity. Arabella was greatly distressed. She had not expected that Johanna would have given way in such a manner, and she looked at Colonel Jeffery as though she would have said—\"Is it possible that you can say nothing to calm this grief?\" He shook his head, but made no reply in words. In a few moments, however, Johanna was wonderfully recovered. She was able to speak more composedly than she had done since the commencement of the interview. \"Tell me all, now,\" she said. \"I can bear to hear it all.\" \"You know all, Miss Oakley. The poor boy, in whose fate I have felt sufficiently interested to take him into my care, says that such a man as Thornhill did come to his master\u0027s shop. That he (the boy) was sent out upon some trivial errand, merely to get him out of the way, and that, pending his return, the visitor disappeared. He deposes to the fact of the dog watching the door.\" \"The dog?\" \"Yes. Thornhill, it seems, had a faithful dog with him.\" \"Ah, Arabella, we must have seen that dog.\" \"Has not the creature, then, fallen a victim to Todd\u0027s malevolence?\" \"We think not, sir,\" said Arabella. \"Go on—go on,\" said Johanna; \"what more?\" \"The boy states that he is certain he saw the hat of the visitor with the dog in Todd\u0027s house, after Todd had declared he had left, and proceeded to the city.\" \"The hat—the dog. Alas! alas!\" \"Nay, Miss Oakley, do not forget one thing, and that is, that neither you nor any one else have as yet identified this Mr. Thornhill as Mr. Ingestrie.\" \"No, not positively; but my heart tells me—\" \"Ah, Miss Oakley, the heart is the slave of the feelings and of the imagination. You must not always trust to its testimony or emotions upon cold fact.\" \"There is yet hope, then, Johanna,\" said Arabella. \"A bright hope for you to cling to, for, as this gentleman says, there is nothing positive to prove that Mr. Thornhill was Mark Ingestrie. I would not, were I you, abandon that hope on any account, while I lived, and could still clutch it. Would it not be a great thing, sir, if any papers or documents which this Thornhill might have had about him, could be recovered?\" \"It would indeed.\" Arabella at first seemed upon the point of saying something contingent upon this remark of the colonel\u0027s, or rather this acquiescence of his in her remark, but she thought better of it, and was silent, upon which Johanna spoke, saying— \"And that is really all, sir?\" \"It is, Miss Oakley.\" \"But will nothing be done? Will no steps be taken to bring this man, Todd to justice?\" \"Yes, everything will be done; and indeed, anything that can be done consistently with sound policy is actually now. Sir Richard Blunt, one of the most acute, active, and personally daring of the magistrates of London, has the affair in hand, and you may be quite assured that he will pursue it with zeal.\" \"And what is he doing?\" \"Collecting such evidence against Todd, that at a moment the law will be enabled to come upon him with a certainty that by no ingenious quibble can he escape.\" Johanna shuddered. \"I thank you, sir, from my heart,\" she said, \"for all the kindness and—and—I need not again trespass upon your time or your patience.\" \"Ah, Miss Oakley, will you deny me your friendship?\" \"Oh, no—no.\" \"Then why deny me the privilege of a friend to see you sometimes. If I cannot say to you anything positively of a consoling character regarding him whom you so much regret, I can at least share your sorrows, and sympathise with your feelings.\" Johanna was silent, but after a few moments she began to feel that she was acting both with harshness and injustice towards one who had been all that the kindest and most generous friend could be to her. She held out her hand to the colonel, saying— \"Yes, sir, I shall be always happy to see you.\" The colonel pressed her hand in his, and then turning to Arabella Wilmot, they parted at the garden.","sourceLink":"http://novel.tingroom.com/duanpian/3276/89617.html","bookId":510,"book":{"id":510,"title":"The String of Pearls","description":"简介： The Romance of The String of Pearls having excited in the Literary world an almost unprecedented interest, it behoves the author to say a few words to his readers upon the completion of his labours....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3276","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
