{"id":12057,"no":85,"title":"CHAPTER LXXXII. TODD VISITS THE COLONEL","content":"\"Well, Tobias,\" said Colonel Jeffery, as he entered the pretty, cheerful room into which the now convalescent boy had been removed. \"Well, Tobias, how are you now?\" \"Much better, sir. Oh, sir,—I—I—\" \"What would you say?\" \"I feel that when I see you, sir, I ought to say so much to convince you of how truly, and deeply grateful I am to you, and yet I can scarcely ever say a word about it. I pray for your happiness, sir, indeed I do. Your name and my mother\u0027s, and—and Minna Gray\u0027s, are always uttered to God by me.\" \"Now, Tobias,\" said Colonel Jeffery gravely. \"I am quite satisfied that as regards all that has passed, you feel as you ought to feel, and for my own part, I beg you to feel and to know that your saying anything about it only distresses me.\" \"Distresses you, sir?\" \"Yes, it does, indeed. I see your eyes are upon the door. You expect Minna, to day, I am sure.\" \"Yes, sir,—she—she—my mother was to bring her, sir.\" A ringing at a bell now came upon Tobias\u0027s ear, and his colour went and came fitfully. \"You are still very weak, my poor boy,\" said the colonel, \"but you are certainly much improved. Do you feel any confusion in your head now?\" \"None at all, only when I think of Todd suddenly, ever it makes me feel cold and sick, and something seems to rush through my heart.\" \"Oh, that will go away. That is nothing. There, I will draw up the blind for you. The evening is coming, and the sky is overclouded. You can see better now, and there is one coming whom I know you wish to lose no sight of.\" \"I hear her foot upon the stairs,\" said Tobias. \"Do you?—It is more than I do.\" \"Ah, sir, the senses are sharpened, I think, by illness.\" \"Not so much as by love. Tobias! do you hear her footstep now?\" \"Yes, and it is like music.\" He had his head on one side in an attitude of listening; and then with joy sparkling from every feature of his face, he spoke again— \"She comes—she comes. Ah, she comes fast. My own—my beautiful. She come—she comes.\" \"This is real love,\" said the colonel, and he stepped from the room. Nearly on the landing at the head of the stairs, he met Minna Gray. \"Welcome,\" he said as he held out his hand to her. \"You will find your young friend up and much better.\" Minna could only look her thanks. Mrs. Ragg was following her, and as the ascent of stairs was always rather a task to that good Lady, she was making a noise like a stranded grampus in breathing. \"Ah, colonel,\" she said, \"young legs get up stairs faster than old ones, sir, as you see. Well—well, there was a time when first I knew poor dear Ragg, who is of course dead and gone, quite premature.\" \"Exactly, Mrs. Ragg,\" said the colonel, as he rapidly descended the stairs. \"Did you ever, my dear, know such a strange man?\" said Mrs. Ragg to Minna. \"Who?\" \"The colonel, to be sure. So soon as I begin to tell him any little what do you call it. No it ain\u0027t nannygoat—that\u0027s ridiculous. It\u0027s—it\u0027s—what is it?\" \"Anecdote do you mean, Mrs. Ragg?\" \"Yes, to be sure. Well, as I was a saying, no sooner do I begin telling him a little nannygoat—no, I mean anecdote, than off he is like a shot.\" Minna smiled to herself, and she was far from wondering that the colonel was off like a shot, for well she knew, that when Mrs. Ragg did begin anything concerning the late Mr. Ragg, it usually lasted three quarters of an hour at the very least. \"Minna, Minna!\" called Tobias. \"I am here, Tobias.\" In another moment she was in the room. Truly it was a pleasant thing to see the face of Tobias, when, his sunshine, as he called Minna, came close to him, and in her soft voice asked him if he was better. \"Don\u0027t mind me,\" said Mrs. Ragg, \"I am going to darn a stocking or two. that\u0027s all. Just say what you both like. Young folks will be young folks. Bless me, I recollect just as if it were only yesterday, when I used to speak to poor departed Mr. Ragg, who is, premature, dead and gone, in a manner of speaking. Ah, dear me! How the world goes round and round—round and round, continually.\" Tobias and Minna were so well accustomed to the garrulity of Mrs. Ragg, and so well aware that she required no answer, that they let her talk on, and did not mind her, as she requested they would not; and so the evening grew apace, and the light gradually began to wane, as those two young loving hearts spoke together of the future, and indulged in that day dream of happiness which can only belong to youth and love. Todd is skulking round the angle of the garden wall, from which he can get a view of the colonel\u0027s house, and yet not be seen himself. The more he looked the more the desire grew upon him, notwithstanding the immense risk he ran of personal detection, by so doing, to get into the house, and finish the career of poor Tobias. He would have had no particular objection rather to have taken the life of Mrs. Ragg, if it could be easily and comfortably done. It has been said that there are folks in the world who never forgive any one for doing them a kindness; and such paradoxical views of human nature have been attempted to be laid down as truths; but whether this be so or not, is still to be proved, although it is certain that nothing stirs the evil passions of men who will inflict injury upon the innocent, as to find themselves baffled in their villany. From that moment the matter becomes a personal affair of vengeance. Hence, since Todd had become thoroughly aware that Tobias had escaped from the death he had intended for him at the mad-house, his rage against the boy knew no bounds. Indeed, the reader will conclude that it must have been a feeling of no ordinary strength, that, at such a busy and ticklish time, would take Todd to the colonel\u0027s house at all. It was revenge—bitter, uncompromising revenge! Now, you must know the colonel\u0027s house was one of those half-villa, half-mansion-like residences, that are so common in the neighbourhood of London. There was a kind of terrace in the front, and a garden with flowering shrubs, that had a pretty enough appearance, and which at night afforded abundance of shelter. It was by this front garden that Todd hoped to reach the house. When it was nearly dark, he slunk in, crouching down among the trees and shrubs, and crawling along like a serpent as he was. He soon came to a flight of stone steps that led to the kitchens. By the time Todd had got thus far, some of her domestic duties had called Mrs. Ragg to the lower part of the house. He saw by the fire-light that some one was going about the kitchen, close to the foot of the stone steps; but he could not exactly, by that dim and uncertain radiance, take upon himself to say that it was Mrs. Ragg. She soon lit a candle, though, and then all was clear. He saw the good lady preparing divers lights for the upper rooms. While Todd was half-way down the stone steps, peeping into the kitchen, one of the other servants of the house came into that receptacle for culinary articles, and commenced putting on a bonnet and shawl. Todd could not hear one word of what was said by Mrs. Ragg and this young woman who was getting ready to go out; but he saw them talk, and by their manner he felt convinced that it was only upon ordinary topics. If the young woman left the house by the steps upon which Todd was, and which it was more than likely she would do, his situation would be anything but a pleasant one, and discovery would be certain. To obviate the chance of this, he stepped back, and crouched down in among the shrubs in the garden. He was not wrong in his conjectures, for in a few moments the servant, who was going out, ascended the steps, and passed him so closely, that by stretching out his hand, he could, if he had been so minded, have touched her dress. In a short time she was out of ear-shot. Todd emerged from his concealment again, and crept down the steps, and once more peeped into the kitchen. Mrs. Ragg was still busy with the candles. He was just considering what he should do, when he heard the tramp of horses\u0027 feet in the road above. He ascended sufficient of the steps to enable himself to get a peep at what was going on. He saw a groom well mounted, and leading another horse. Then no other than Colonel Jeffrey himself, although he did not of his own knowledge, feel assured that it was him, come out at the front door of the house and mounted. \"Now, William,\" said the colonel, \"we must ride sharply.\" \"Yes, sir,\" said the groom. Another moment and they were gone. \"This is lucky,\" said Todd. \"It is not likely that there is any other room in the house; and if not, I have the game in my own hands.\" He crept down the remainder of the stone steps, and placed his ear quite close to the kitchen window. Mrs. Ragg was enjoying a little conversation to herself. \"Ah!\" she said, \"it\u0027s always the way—girls will be girls; but what I blame her for is, that she don\u0027t ask the colonel\u0027s leave at once, and say—\u0027Sir, your disorderly has won my infections, and may he come here and take a cup of tea?\u0027\" This was Greek to Todd. \"What is the old fool talking about,\" he muttered. \"But I will soon give her a subject that will last for her life.\" He now arrived at the door of the kitchen. It was very unlikely to be locked or otherwise fastened, so immediately after the young woman, who had left the house, and passed so close to him, Todd. Yet he listened for a few moments more, as Mrs. Ragg kept making observations to herself. \"Listeners hear no good of themselves, says the proverb, and at all events it was verified in this instance.\" \"Lor\u0027 a mussy,\" ejaculated Mrs. Ragg, \"how my mind do run upon that horrid old ugly monster of a Todd to day. Well, I do hope I shall never look upon his frightful face again, and how awful he did squint, too. Dear me, what did the colonel say he had with his vision—could it be—a something afixity? No that isn\u0027t it.\" \"Obliquity!\" said Todd, popping his head in at the kitchen door. \"It was obliquity, and if you scream or make the least alarm, I\u0027ll skin you, and strew this kitchen with your mangled remains!\" Mrs. Ragg sank into a chair with a melo-dramatic groan, that would have made her fortune over the water in domestic tragedy if she could have done it so naturally. Todd kept his eye upon her. That basilisk-like eye, which had fascinated the good woman often, and this time it acted as a kind of spell, for truly might he have said, or rather might some one have said for him, \"He held her with his glittering eye.\" Todd\u0027s first care now was to get between Mrs. Ragg and the kitchen door, lest upon some sudden impulse she should rise and flee. Then he folded his arms, and looked at her calmly, and with such a devilish smile as might have become Mephistopheles himself, while contemplating the ruin of a soul. He took from his pocket a razor. \"Mercy,\" gasped Mrs. Ragg. \"Where is Tobias?\" Todd Horrifies Mrs. Ragg. Todd Horrifies Mrs. Ragg. \"Up stairs. Back room, second floor, looking into the garden.\" \"Alone?\" \"No, Minna Grey is with him.\" \"Listen to me. If you stir from here until I come to you again, I will not only murder you, but Tobias likewise, and every one whom I meet with in this house. You know me, and can come to some opinion as to whether or not I am a man likely to keep my word. Remain where you are; move not, speak not, and all will be well.\" Mrs. Ragg slowly slid off her chair, and fell to the floor of the kitchen, where she lay, in what seemed a swoon. \"That will do as well,\" said Todd as he glanced at her, \"and yet as I return.\" He made a movement with his hand across his throat to indicate what he would do, and then feeling assured that he had little or, indeed, no opposition to expect in the house, he left the kitchen, and walked up stairs. When he reached the top of the kitchen stairs he paused to listen. All was very still in the house. \"\u0027Tis well,\" he said \"tis well. This deed of blood shall be done, and long before it can be thought that it was I who struck the blow, I shall be gone.\" Alas! After passing through so much! After being persued in so almost a miraculous manner from the murderous intentions of Todd, backed by the cupidity of Fogg, and his subordinate Watson, was poor Tobias yet to die a terrible death as a victim to the cruel passions of his relentless persecutor? No, we will not yet believe that such is to be the fate of poor honest Tobias, although at the present time, his prospects look gloomy. Todd may, and no doubt has taken as worthy lives, but we will hope that the hand of Providence will prevent him from taking this one. He reached the landing of the first floor, and he paused to listen again. He thought this time, that he heard the faint sound of voices above, but he was not quite sure. Otherwise all was quiet. This was a critical situation for Todd. If any one, who was a painter of pictures or of morals had but seen him, Sweeney Todd, as he there stood, they would no longer have doubted either that there was a devil, or that some persons in this world, were actuated by a devilish fiend. He looked the incarnate fiend!—the Mephistopheles of the imagination, such as he is painted by the German enthusiast. His laugh too? Was not that satanic? He set himself to listen to the voices that he heard in that quiet rooms and the sounds, holy and full of affection as they were, awakened no chord of answering feeling, in that bold, bad man\u0027s breast. He stood apart from human nature, a solitary being. A wreck upon the ocean of society \"None loving, and by none beloved.\" Who would be Sweeney Todd, for all the wealth, real or fabled, of a million Californias? \"He is here,\" he said, \"I know his voice. Tobias is here. Ah! he mentions the name of God. Ha! He is more fitting to go to that heaven he can talk of so glibly, but there is none. There is none! No, no! all that is a fable.\" Of course Todd could not believe in a divinity of goodness and mercy. If he had, what on earth could have saved him from absolute madness?","sourceLink":"http://novel.tingroom.com/duanpian/3276/89642.html","bookId":510,"book":{"id":510,"title":"The String of Pearls","description":"简介： The Romance of The String of Pearls having excited in the Literary world an almost unprecedented interest, it behoves the author to say a few words to his readers upon the completion of his labours....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3276","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
