{"id":12061,"no":89,"title":"CHAPTER LXXXVI. TODD RECEIVES TWO EXTRAORDINARY LETTERS, AND ACTS UPON THEM.","content":"Todd looked the picture of amazement. \"Two letters!\" he muttered, \"two letters to me, who seldom receive any? To me who have no acquaintances—no relations? Bah! It must be some mistake, or perhaps, after all, some infernal nonsense about the parish.\" He tore open the last received one, and read as follows:— \"Colonel Jeffery informs Sweeney Todd that, although from a variety of reasons he may not think proper to prosecute him for his recent outrage at his house, he will, upon a repetition of such conduct, at once hand him over to the police.\" Todd\u0027s countenance, during the perusal of this brief note, betrayed a variety of emotions; and when he had concluded it, he let it drop from his hands, and knitting his brows, he muttered— \"What does this mean?\" That there was—that there must be something much more than met the eye in this boasted clemency of the colonel towards him, he felt quite convinced; but what it was, he was puzzled to think for a time. At length, brightening up, he said— \"Yes, I have it. It is Tobias—it is Tobias. He cannot rid himself from the idea that I have some mysterious power of injuring his mother; and perhaps, after all, he may have made no disclosures to the colonel injurious to me.\" Comforted by this wide supposition, Todd picked up the letter again, and put it in his pocket carefully. \"It is as well,\" he said, \"for I shall not now be hurried. No, I shall not be at all hurried now, which I might have been.—Charley.\" \"Yes, sir.\" \"Trim the lamp.\" Johanna did so; and while the process was going on, Todd opened the other letter, it was as follows:— \"Sir,—We beg to inform you that our Hamburgh vessel in which you have done us the favour to take passage, will not sail until to-morrow night at four, God willing, and that consequently there will be no occasion for your coming on board earlier.—We are, sir, \"Your obedient servants, \"Brown, Buggins, Muggs, and Screamer.\" \"To Mr. S. Todd.\" Todd ground his teeth together in a horrible manner. He dashed the letter to the floor, and stamped upon it. \"Curse Brown and Buggins!\" he cried. \"I only wish I could dash out Muggs and Screamer\u0027s brains with Brown and Buggins\u0027s skulls. Confound them and their ships. May they all go to the bottom when I am out of them, and be smashed and d—d!\" Johanna was amazed at this sudden torrent of wrath. She could not imagine what had produced it, for Todd had read the letter in a muttering tone, that effectually prevented her from hearing any of it. Suddenly he rose and rushed into the back room, and bolted the door upon himself. He went to think what was best to be done. When he was alone he read both the letters again, and then he burst out into such a torrent of wrath against the ship-owners, that it was a mercy Johanna\u0027s ears were spared the dreadful words that came from his lips. Suddenly he saw a postscript at the foot of the ship-owner\u0027s letter, which he had at first overlooked. \"P. S.—The ship is removed to Crimmins\u0027s Wharf, but will be at her old moorings at time mentioned above.\" \"D—n Crimmins and his wharf, too!\" cried Todd. He flung himself into a chair, and sat for a time profoundly still. During that period he tried to make up his mind as to what it would be best for him, under the circumstances, to do. Many plans floated through his imagination. He could not for a long time bring himself to believe that the letter of the colonel\u0027s was anything but a feint to throw him off his guard in some way. At length he got into a calmer frame of mind. \"Shall I leave at once, or stay till to-morrow night, that is the question?\" He argued this with himself, pro and con. If he left he would have to secret himself somewhere all the following day, and the fact of his having left would make an active search, safe to be instituted for him, which would possibly be successful. Besides, how was he to conveniently set fire to his house, unless he was off on the moment that the flames burst forth? Then if he stayed he had Mrs. Lovett to encounter, but that was all; and surely he could put her off for a few hours? Surely she, of all people in the world, was not to run to a police-office and destroy both him and herself, just because she did not get some money at ten o\u0027clock that he had promised to hand to her. \"She shall be put off,\" he said, suddenly, \"and I will stay over to-morrow. I am safer here than anywhere else, of that I feel assured. If there are any suspicious whisperings about me at all, they will grow to loud clamours the moment I am gone, and then they may reach the ears of these ship-owners, and they may say at once, \u0027Why we have such a man with a passage taken in one of our Hamburgh ships.\u0027 Let them say that when the ship is some twenty hours gone with me on board, and I don\u0027t care; but with me on land, and the ship only to sail, instead of having actually sailed, it is quite a different matter.\" He rose from his seat. His mind was made up. He had not quite decided what he should say to Mrs. Lovett, but he had decided upon staying. \"Charley will live another day,\" he muttered; \"but to-morrow night he dies, and his body will be consumed with this house, and, I hope, a good part of Fleet-street. It will not be prudent to get him to assist now in disposing the combustibles to fire the house. He might speak of it before to-morrow night.\" Todd came out into the shop. \"Charley, my boy!\" How kindly he spoke! \"I am here, sir.\" \"You must not mind what I say when I am vexed. Many things happen to put me out of the way. Sometimes people that I have done I don\u0027t know how much for, turn out to be very ungrateful, and then I get chafed, you see, Charley.\" \"Yes, sir, no doubt.\" \"But, after I have retired to the parlour and prayed a little, my mind soon recovers its usual religious tone, and its wonted serenity; and for the sake of the Almighty, who, you know, is good to us all, Charley, I forgive all that is done to me, and pray for the wicked.\" Johanna shuddered. This hypocrisy sounded awful to her. \"Never go to rest, Charley, without saying your prayers. There\u0027s threepence for you. You can get yourself a bed in the neighbourhood for that amount somewhere, I daresay. I am very sorry I cannot accommodate you here, Charley. Now go away, and let me have you here by seven in the morning; and mind, above all things, cultivate a religious spirit, and do unto your neighbours as you would that your neighbours should do unto you.\" Johanna could not reply. \"Here is a tract that you can read before you go to sleep, if they allow you a candle, when you get a-bed. It is entitled \u0027Groans of Grace, or the Sinner Sifted,\u0027 a most godly production, from a pious bookseller in Paternoster-row, Charley.\" \"Yes,\" Johanna just managed to say. \"Now you may go.\" She darted from the shop. \"Hilloa! hilloa! Stop—stop, Charley! Stop—stop, will you? Confound you, stop! The infernal shutters are not up. Do you hear? I forgot them.\" Todd rushed to his door. He looked right and left, and over the way, and, in fact, everywhere, but no Charley was to be seen. The fact is, that Johanna, the moment she felt herself released from the shop, had darted over the way, and into the fruiterers, where she had found so friendly a welcome before, and all this was done in such a moment, that she was housed before Todd could get his shop-door open. \"Welcome!\" said a voice. She found it proceeded from the fruiterer\u0027s daughter, who had behaved so kindly to her. Johanna burst into tears. \"What has happened?—what has happened?\" cried the young girl. \"Nothing, now,\" said Johanna. \"But I cannot keep up longer than when I am in that shop. As soon as I am fairly out of the presence of that dreadful man, I feel ready to faint.\" \"Be of good cheer,\" said a deep-toned voice. She looked up, and saw Sir Richard Blunt. \"You here, sir?\" \"Yes, Johanna. I have been now for some time watching Todd\u0027s shop from our friend\u0027s first-floor window. I saw you dart across the road, and for the moment feared something had gone wrong. Did Todd get two letters?\" \"He did.\" \"They will, I hope, keep him quiet until another night. Dare you go back again, Johanna, to that place?\" \"Yes, if it be necessary; but he has told me to sleep out, and the gust of pleasure I felt at the permission, almost, I fear, betrayed me.\" \"He came to the door and looked furiously after you, but he did not see which way you had come. You were over here like a flash of light.\" \"He would have had me back again, then?—What could that be for?\" \"At all events, you shall not go until the morning, and not then, unless after a night\u0027s rest here, you feel that you can do so with a good heart.\" \"Oh yes, I will fulfil my mission.\" \"Todd is putting up his shutters,\" said the fruiterer, as he came in from his front shop. \"Ah, then the secret is out,\" said Sir Richard Blunt. \"That is what he wanted you back for, Johanna. He had forgotten at the moment all about the shutters you may depend. I am glad he spared you the trouble, at any rate. I do not like you to perform any service for such a rank villain as he is.\" \"It would not have been for him, sir.\" \"For who, then?\" \"For the dead. I feel that I am bound to bring to justice the murderer of Mark Ingestrie. When I was here last, sir, you strove to comfort me, by making me feel a sort of hope that he was not dead, but I cannot think that—I would that I could, but indeed I cannot, sir.\" \"Do not be too sure, Johanna.\" \"Nay, look at that.\" She laid before the magistrate the sleeve of the jacket that she had found at Todd\u0027s, and which fancy, for she certainly had no proof that way tending, told her had belonged to Mark Ingestrie. \"What is this?\" \"Look at it, sir. My heart tells me it was his!\" \"And so you suppose there was never but one sailor\u0027s jacket with ivory buttons on the wrist in the world, and never any one who wore one, but Mark Ingestrie?\" \"Nay, the place in which it was found brings conviction.\" \"Not at all. Do you forget there was such a person as Thornhill in the world, Johanna?\" \"No; but why will every one persist in fancying Thornhill and Ingestrie to be two persons, when I am convinced they were but one? Let who will identify this as part of Thornhill\u0027s apparel, and I will weep for Mark.\" \"I cannot just now shake this supposition.\" \"You never will.\" \"If I live I will, Johanna, I give you my word for so much. Pray who is the best to judge of such things? You, a young girl who have seen little or nothing of the world, and whose natural apprehension is rendered obscure by the conflict of your affections, or I whose business it is to come to an accurate conclusion of such matters? I repeat my conviction, that Thornhill was not Mark Ingestrie.\" \"Oh, if I could think so!\" \"You will.\" \"You have no doubt, sir, but Thornhill perished by the hand of Todd?\" \"None whatever.\" Johanna looked deeply affected. \"Come,\" added Sir Richard, \"you want both rest and refreshment, and you can have both here at this house. To-morrow I hope will end all your trials, my dear girl, and I shall live, I trust, to see you smile as you ought to smile, and to be as happy as only a very dim recollection of the past will make you.\" \"Ah, no—never happy.\" \"You must love some one. You must recover, and in the cares and joys of a new existence, you must only look back upon what has passed, as though you pondered upon the phantasma of some fearful dream; and when you see all around you smiling—\" \"It will be cruel for them to smile, sir; and it is now cruel of you to speak to me of loving another, when you know my affections are with Ingestrie, in that world to which he has gone before me, but to which I look forward to as the place of our happy meeting, where we shall part again no more.\" \"Well, I thought I could find you a lover that would be to your mind when all these affairs were over.\" \"Sir?\" \"Nay, be not offended. You know I am your sincere friend.\" \"I know you are, and that is what makes it so grievous to me to hear you talk in such a strain, sir.\" \"Then I will say no more.\" \"I thank you, Sir Richard; and I will forget what you have said, because I will recollect nothing from you, or committed with you, but kindness and consideration.\" Sir Richard smiled slightly for a moment, as he turned aside and spoke to his friend the fruiterer for some minutes in a low tone. The young girl who had before behaved with such kindness to Johanna, took her by the hand, and led her up-stairs. \"Come,\" she said, \"you shall tell me all you have suffered opposite since we parted last, and I will speak to you of him whom you love.\" \"You are too good to me.\" While all this was going on so close to him, Todd, with many oaths and execrations, was putting up his own shutters, which he did with a violence that nearly knocked the front of the window in. When he had finished, he walked into his house, and closing the door, he said, in a low tone— \"I must make up my mind what to say to Mrs. Lovett in the morning. I am afraid she will be hard to pacify.\" At this moment a man peered out from the inn gateway opposite, and said to himself— \"Now begins my watch. I dare say now Mrs. Lovett has some particular reason for watching this barber, though she did not tell me. However, a guinea for one night\u0027s work is not bad pay.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3276/89646.html","bookId":510,"book":{"id":510,"title":"The String of Pearls","description":"简介： The Romance of The String of Pearls having excited in the Literary world an almost unprecedented interest, it behoves the author to say a few words to his readers upon the completion of his labours....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3276","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
