{"id":12064,"no":92,"title":"CHAPTER LXXXIX. MR. OAKLEY IS IN DESPAIR AT THE LOSS OF JOHANNA.","content":"The anxiety of poor Mr. Oakley increased each moment as he and the preacher neared the house of Arabella Wilmot\u0027s friends. We regret to say that Mr. Lupin did enjoy the mental agony of the father; but it was in his nature so to do, and we must take poor humanity as we find it. It must be recollected that Mr. Lupin had, through Johanna, suffered great malefactions. The treatment he had received at the hands of Big Ben, although most richly deserved, had been on account of Johanna, and as regarded the old spectacle-maker himself, he had always occupied an antagonistic position as regarded Mr. Lupin. No wonder then, we say, that human nature, particularly in its evangelical variety, was not proof against the fascination of a little revenge. Now, Mr. Lupin felt so sure that he had made no mistake, but that it was no other than the fair Johanna whom he had seen in what he called the unseemly apparel, that he did not feel inclined to draw back for a moment in the matter. Curiosity, as well as a natural (to him) feeling of malignity, urged him to stick by the father in order that he might know the result of inquiries that he, Lupin, had no opportunity or excuse for making, but which Mr. Oakley might institute with the most perfect and unquestionable profundity. As we have before had occasion to remark, the distance between Oakley\u0027s shop and the residence of the friends of Arabella was but short, so that, at the speed which the excited feelings of the fond father induced him to adopt, he soon stood upon the threshold of the residence, beneath the roof of which he hoped, notwithstanding the news so confidently brought by Lupin, to find his much-loved, idolized child. \"You shall see,\" he said to Lupin, catching his breath as he spoke; \"you shall see how very wrong you are.\" \"Humph!\" said Lupin. \"You shall see,\" continued poor Oakley, still dallying with the knocker; \"you shall see what an error you have made, and how impossible it is that my child—my good and kind Johanna—could be the person you saw in Fleet-street.\" \"Ah!\" said Lupin. Mr. Oakley knocked at the door, and, as one of the family had seen him through the blinds of the parlour-window, he was at once admitted, and kindly received by those who knew him and his worth well. He asked, in an odd gasping manner, that Mr. Lupin might have permission to come in, which was readily granted; and with a solemn air, shaking his head at the vanities he saw in the shape of some profane statuary in the hall, the preacher followed Oakley to the dining-room. It was an aunt of Arabella\u0027s to whom they were introduced, and, with a smile, she said— \"Really, Mr. Oakley, a visit from you is such a rarity that we ought not to know how to make enough of you when you do come. Why, it must have been Christmas twelvemonths since you were last beneath this roof. Don\u0027t you remember when your dear, good, pretty Johanna won all hearts?\" \"Yes, yes,\" said Oakley, glancing triumphantly at Lupin. \"My dear child, whom all the world loves—God bless her!—She is pure, and good, and faultless as an angel.\" \"That, Mr. Oakley,\" said the lady, \"I believe she is. We are as fond of her here, and always as glad to see her, as though she belonged to us. Indeed, we quite envy you such a treasure as she is.\" Tears gushed into the grateful father\u0027s eyes, as he heard his child—his own Johanna—she who reigned all alone in his heart, and yet filled it so completely—so spoken of. How glad he was that there was some one besides himself present to hear all that, although that one was an enemy! With what a triumphant glance he looked around him. \"Humph!\" said Lupin. That humph recalled Oakley to the business of his visit, and yet how hot and parched his lips got, when he would have framed the all-important question, \"Is my child here?\"—and how he shook, and gasped for breath a moment before he could speak. At length, he found courage—not to ask if Johanna was there. No—no. He felt that he dared not doubt that. It would have been madness to doubt it, sheer insanity. So he put the question indirectly, and he contrived to say— \"I hope the two girls are quite well, quite—quite—well.\" \"Two girls!\" said the aunt. \"Two girls!\" \"Yes,\" gasped Oakley. \"Johanna and Arabella, you know—your Arabella, and my Johanna—my child.\" \"You ought to know, Mr. Oakley, considering that they are at your house, you know. I hope that neither of them have been at all indisposed? Surely that is not the case, and this is not your strange way of breaking it to us, Mr. Oakley?\" The bereaved father—yes, at that moment he felt that he was a bereaved father—clutched the arms of the chair upon which he sat, and his face turned of a ghastly paleness. He made an inarticulate effort to speak, but could only produce a strange gurgling noise. \"Gracious Heavens! he is ill,\" cried Arabella\u0027s aunt. \"No, madam,\" said Lupin. \"He is only convinced.\" \"Convinced of what?\" \"Of what he himself will tell you, madam.\" \"Help! help!\" cried Oakley. \"Help! My child—my Johanna—my beautiful child. Mercy—help. Give her to my arms again. Oh, no—no—no, she could not leave me thus. It is false—it is some desperate juggle! My child—my child, come once again to these arms.—God—God help me!\" Arabella\u0027s aunt rose in the greatest alarm, and rung the bell so sharply, that it brought everybody that was in the house to that room, and Mr. Lupin, when he saw what a congregation there was, rose up and said in a snuffling voice— \"Is there any objection to a prayer?\" \"The greatest at present, sir,\" said Arabella\u0027s aunt. \"Sir, there is a time for all things. The state of poor Mr. Oakley, now claims all our care. If you are his friend—\" At these words, Oakley appeared to shake off much of the prostrating effects of the first dreadful conviction, that what Lupin had told him was true, and he said— \"No—no, he is no friend—he is a bitter enemy. The enemy of my peace, and of my dear child. I am calmer now, and I demand—I implore, that that man be made to leave this house.\" \"Brother Oakley,\" said Lupin, \"you brought me here.\" \"And I now command you hence. Begone, villain, begone; go and exult over the heart-broken father\u0027s grief; go and tell the tale where you will. You cannot move me now—go—go—go.\" \"Truly I will go presently, but first of all, I say to you, brother Oakley, hardened sinner as you are, repent. Down upon your knees all of you, and join me in prayer, that the unbelievers may roll upon billows of burning brimstone, and that—\" \"Come,\" said a man, who happened to be in the house upon some domestic errand, \"Mrs. Wilmot says you are to go, and go you shall. Come, be off—I know who you are. You are the rascal that married the widow in Moorfields, but who, they say, has another wife in Liverpool. If you don\u0027t go, I shall give you in charge for bigamy, and the widow says she will spend her last penny in prosecuting you.\" Mr. Lupin Unmasked. Mr. Lupin Unmasked. To meet any one half so well informed about his affairs, would have been a terrible blow to Mr. Lupin; but when he found that this man, who was a kind of jobbing cabinet-maker, knew so much, his great goggle eyes opened to an alarming width, and he made a movement towards the door. Still, he did not like to go without saying something. \"Flee, ye wretches,\" he said, \"from the wrath to come! You will all go into the bottomless pit, you will, and I shall rejoice at it; and sing many songs of joy over you. Scoffers and mockers, I leave you all to your fate. The devil will have you all, and that is a great comfort and gratification to the elect and to the saints.\" With this, Mr. Lupin made a precipitate retreat, having achieved about as little in the way of satisfying his curiosity as could very well be conceived. It was a relief—a great relief to Mr. Oakley to be rid of such a witness to his feelings as Lupin; and when he had fairly gone, and the outer door was closed upon him, the spectacle-maker, with clasped hands, and countenance expressive of the greatest possible amount of mental agony, spoke— \"Dismiss all but ourselves, madam,\" he said. \"There\u0027s that to say which may be said to you alone, but which it would break my heart to say to many.\" The room was soon clear, and then Oakley continued in a low faltering voice to make those inquiries, each answer to which was so fatal to his peace of mind. \"Madam,\" he said, \"is not my child—my Johanna—here staying on a visit with Arabella?\" \"No, no—certainly not.\" This was so frightfully conclusive, that it was some few moments before he could go on; but when he did, he said— \"Is Arabella in the house?\" \"That, Mr. Oakley,\" replied the aunt, \"is a question I cannot answer you at the moment; but rest and compose yourself for a few moments, and I will ascertain myself if she be in or out, and if the latter, when she was last seen.\" \"I am much beholden to you, madam. I am a poor old man, much broken in spirit, and with but one strong tie to bind me to a world which has nearly done with me. That tie is the love of my dear child, Johanna. Alas! if that be broken, I am all adrift, and at the mercy of the winds and waves of evil fortune; and the sooner I close my eyes in the long sleep of death, the better for me and all who feel for me.\" \"Nay, Mr. Oakley, I look upon it as a thing almost criminal to despair. There is one maxim which I have learnt in my experience of life, and which I am sure you must have had abundant opportunities of learning likewise. It is, \u0027Never to trust to appearances.\u0027\" The old man looked at her with a saddened aspect. It was quite evident his feelings had been too strongly acted upon to make any philosophy available to him; and when she left the room to make the inquiries concerning Arabella, he wrung his hands, and wept. \"Yes,\" he said, \"yes, I am indeed alone now—a wreck—a straw upon the ocean of society. The sooner I drift in the grave now, the better for me, and all who pity the old man. Oh, Johanna—Johanna. My child—my beautiful, why did you not wait until I was dead before you left me? Then I should have slept calmly, and known nothing; but now my days and nights will be dreams of horror.\" The door opened and the aunt re-appeared. \"Arabella is not within,\" she said, \"and has not been seen for some hours now. When last seen her manner was evidently perturbed. But now, Mr. Oakley, sit down by me and tell me as clearly and as distinctly, all you know and all you fear. There are few evils in this world but there are some remedies for, and you shall have my true and calm opinion if you will tell me all.\" It is something astonishing, and yet one of the most ordinary of mental phenomena, to note what a power a cool and clear intellect will exert over one that is distracted and full of woe and clamorous grief. Mr. Oakley did sit down by the side of Arabella\u0027s aunt, and he told her all that happened the girl of which, of course, was the real or supposed appearance of Johanna in Fleet Street, in male attire. The collateral circumstances, such as the hurried and half frantic farewell of him in the shop by Johanna, and the misrepresentation by Arabella, that she (Johanna) was going to stop there, evidently made a deep impression upon the aunt. Her countenance changed visibly, as she said faintly— \"God help us all.\" \"Lost! lost,\" cried Oakley. \"Yes, you—even you, hopeful as you were, and hopeful as you would fain have made me—even you, now that you know all, feel that she is lost. God, indeed, only can help me now.\" \"No, Mr. Oakley,\" said the aunt, rallying, \"I will not yet trust to appearances, although I own that they are bad. I will come to no conclusion until I have seen Arabella, and got the truth from her. It is quite clear that there is some secret between the two young creatures. It is quite clear that there is something going on that we know nothing of, and to speculate upon which may only involve us in an inextricable labyrinth of conjectures. I say, there is some secret, but it may not be a guilty one.\" \"Not—not guilty?\" \"No, Mr. Oakley, there are many degrees of indiscretion to pass through ere the gulf of guilt is reached at last. I have faith in Arabella—I have faith in Johanna; and even now, admitting for a moment the truth of what that man whom you brought with you here, reports, Johanna may only have to be blamed for folly.\" \"Do—do you think he did so see her?\" \"I doubt it much.\" \"Mother,\" said a lad of fifteen, coming hastily into the room. \"Mother I—\" He paused upon seeing Mr. Oakley there, and stammered out some apology— \"He had only come to tell his mother that a whole suit of his clothes were missing from his room and that he could find them nowhere, and he could not make it out; and one of his hats was gone too, and a pair of shoes, and—\" Old Oakley fell back in his chair with a groan. \"She has them,\" he said. \"She has them. My child, whom I shall never see again, has them.\" \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3276/89649.html","bookId":510,"book":{"id":510,"title":"The String of Pearls","description":"简介： The Romance of The String of Pearls having excited in the Literary world an almost unprecedented interest, it behoves the author to say a few words to his readers upon the completion of his labours....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3276","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
