{"id":71452,"no":20,"title":"Page 20","content":"When the shift siren blew, Rana rose from her chair stiffly, hands shaking. The muscles of her legs felt weak. Anxiety had built over the long shift, stealing into every tissue of her body. Rana knew that she needed the surety of Herd\u0027s drugs. Soon.\\n\\n She wished now that she\u0027d eaten something today. But she\u0027d wanted desperately to finish her work in a single shift and never return here.\\n\\n Calming herself by imagining the strip-heater glow that lit the prefab, Rana joined the other militia workers jostling their way toward the facility exit. The six work shifts of the long Legis day overlapped to prevent this sort of rush-hour crowding, but the narrow corridors of the overstaffed station were always crowded, even in peacetime. Rana found herself swept along in a human flow, and the scent of tired workers became overwhelming.\\n\\n Strange, how humanity repulsed her now. The empty chatter, the profusion of colors and body types, the clumsiness of the crowd\u0027s movement around her. Without trying, Rana still walked with the avian grace of her captor; the imitation had somehow insinuated itself into her bones. She longed to shuck the wig and its pointless, decorative excess of hair. Rana closed her eyes, and saw the clean lines of Alexander\u0027s airscreen charts, the scimitar curves of Herd\u0027s weapons, the flavor of Rix. Biting her lip, she made her way through the halls.\\n\\n Soon, she would be back home.\\n\\n The crowd\u0027s progress slowed to a crawl as she reached the exit. Bodies pressed in closer. The overwhelming human smell made Rana\u0027s hands begin to shake. The scent seemed to leach all oxygen from the air. Meaningless conversations surrounded and battered her, a hail of empty words. She distracted herself by reading the sniffer\u0027s warning signs: Declare Any Volatiles, Nanos, or Facility Property.\\n\\n With a start, Rana remembered that the sniffer could detect stolen equipment.\\n\\n She shook her head to drive away paranoia. The memory strip in her pocket was insignificant, the sort of cheap media that came free with disposable phones and cameras. Surely it wasn\u0027t marked with pheros. But among the signs, her nervously darting eyes now found the words: Sign Out ALL Data Storage Devices.\\n\\n Rana swallowed, remembering the data she\u0027d put on the strip. A map of the facility, the repeater schematics, the specs for the lethal wire. From those three files, her intent couldn\u0027t be more obvious. The sniffer was only a few meters ahead of her now. She planted her feet to resist the bodies pressing her forward.\\n\\n Rana fingered the memory strip in her pocket. It was too small to hold a phero patch. But what if they\u0027d sprayed it with pheros as a matter of course? Security was tight here, but that tight?\\n\\n Frantic thoughts crowded her mind. The overstaffed facility seemed utterly disorganized; such a subtle measure didn\u0027t seem likely. But she remembered an old rumor about a creeper security nano that Imperials unleashed on top secret bases. Something that propagated slowly, phero-marking each machine and human it came into contact with, so that everything could be tracked from a central station. The idea had seemed fantastic at the time, the paranoia of low-level workers.\\n\\n But now it seemed just barely possible.\\n\\n The crowd was pressing her impatiently from behind. One of the guards at the sniffer, a marine in Imperial black, was looking at Rana with vague interest as the other workers flowed around her. She ordered herself to move forward; there was no escaping the sniffer without calling attention to herself.\\n\\n But her feet would not move. She was too afraid, too tired. It was too much to ask.\\n\\n She remembered boarding the maglev on the way here, her hesitation before climbing the stairs. That old paralysis--the old Rana Harter--had returned with a vengeance.\\n\\n The marine rose from his stool, eyeing her suspiciously.\\n\\n Move! Rana commanded herself. But she remained put.\\n\\n Then a glint of metal caught her eye. Down the sniffer hallway before her, Rana saw the flash of an officer\u0027s badge.\\n\\n It was Herd, wearing her militia colonel\u0027s uniform, beckoning her forward.\\n\\n At that sight, the panic that had held Rana fast was suddenly broken. She moved toward the sniffer, knowing Herd would protect her, would return her to happiness.\\n\\n Rana Harter stepped into the sniffer, and was for a moment alone, separated from the press of bodies. The updraft took away the rancid smell of the crowd.\\n\\n Then a siren began to scream, so loud that in Rana\u0027s synesthesia it became a towering cage of fire around her, as blinding as the sun on lidless eyes.\\n\\n EXECUTIVE OFFICER\\n\\n The conspirators met in one of the zero-gee courts that surrounded sickbay. The courts were empty, of course, being unusable under high acceleration. The mere notion of playing rackets or dribblehoop in this unstable gravity made Hobbes\u0027s knee ligaments ache.\\n\\n There were only five conspirators present, including herself. Hobbes had expected more, actually. Five didn\u0027t seem enough of a critical mass to warrant plotting a mutiny. There must be more, but Thompson wasn\u0027t tipping his hand yet. No doubt some of his cards were in reserve.\\n\\n She knew all those present: the ringleader Second Gunner Thompson; Yen Hu, another young officer from gunnery; Third Pilot Magus, her face sour and strained; and one of the communications ensigns, Daren King. Apparently, this was no crewman\u0027s mutiny. Everyone here had stars on their uniform.\\n\\n They all seemed relieved when she walked in. Perhaps as the ship\u0027s second-in-command, Hobbes somehow validated the enterprise.\\n\\n But Thompson took charge for the moment. He closed the door of the rackets court, which sealed itself seamlessly, and leaned against the small window in its center to block his small handlight from spilling into the hall. The precautions were hardly necessary, Hobbes thought. Under the current cruel regime of high acceleration, the crew moved about the ship as little as possible. She doubted security was monitoring the ship\u0027s listening devices very carefully, though Ensign King or other conspirators unknown to Hobbes must be jiggering any bugs in the zero-gee court in case they were queried later.\\n\\n This was to be a silent coup.\\n\\n \"Not really a mutiny at all,\" Thompson was saying.\\n\\n \"What would you call it, then?\" Hobbes asked.\\n\\n Second Pilot Magus spoke up. \"I guess, properly speaking, it\u0027s a murder.\"\\n\\n There was an intake of breath from Yen Hu. The assembled conspirators looked at him. Hobbes was sorry to see Hu in on this. He was only two years out of academy. Gunner Thompson must have worked hard to break him down.\\n\\n \"A mercy killing,\" corrected Thompson.\\n\\n \"Mercy on...?\" Magus asked.\\n\\n \"Us,\" Thompson finished. \"The captain\u0027s dead, whatever happens. No point in the rest of us going down with him.\"\\n\\n Thompson took a step back from the rest of the group, making them his audience.\\n\\n \"The rest of the Empire may believe that pardon, but we know that Captain Zai refused the blade of error. The Emperor knows it too.\"\\n\\n Hobbes found herself nodding.\\n\\n \"This attack on the Rix battlecruiser is a pointless sacrifice of the Lynx,\" Thompson continued. \"We should be standing off and coordinating with the Legis planetary defenses. Protecting civilians against bombardment, we could save millions. Instead, we\u0027re engaged in a suicide mission.\"\\n\\n \"Do you really think the Navy would change our orders at this point?\" she asked.\\n\\n \"If the captain accepts the blade in the next day or so, they\u0027ll have time to order us back. The politicals will make up something about Zai-the-hero being the only officer who could have pulled off the attack against the battlecruiser. The Lynx can gracefully withdraw back into the system defenses. With Zai dead, it\u0027d be pointless to sacrifice us.\"\\n\\n Despite what they were plotting, it rankled Hobbes to hear the captain\u0027s name used without the honorific of rank.\\n\\n \"My math shows that we\u0027ve got twenty-five hours to make turnaround,\" Second Pilot Magus said. \"A few more, really. We could always get to twelve gees after turnaround.\"\\n\\n \"No thanks,\" Thompson said. With every gee they added, the easy gravity field would grow geometrically more unstable.\\n\\n \"Well, in any case,\" Magus said. \"Any longer than thirty hours, and we\u0027ll be committed to meeting the Rix battlecruiser outside of Legis\u0027s defenses.\"\\n\\n Hobbes wondered if Magus had taken the precaution of doing the calculations by hand. Computer use, even at trivial demand levels, was always recorded.\\n\\n \"And once it\u0027s done, we\u0027ve got to get word back to Home that the Captain\u0027s committed suicide,\" said Ensign King. \"Then they\u0027ve got to make a decision, and get word back to us. Assuming we draw from our Home-connected entanglement store, there\u0027s no com lag.\"\\n\\n \"But how long will it take for the Navy to make a decision?\" Magus asked.\\n\\n The four of them looked at Hobbes. They knew she\u0027d worked as an admiral\u0027s staff officer before being assigned to the Lynx. Hobbes frowned. She\u0027d seen complex, crucial decisions taken in minutes; she\u0027d seen days go by before consensus was reached. And the decision to save or lose the Lynx was as much political as military. The question was: Did anyone expect Zai to take the blade now? Would there be a contingency plan ready to go?\\n\\n But that was irrelevant to Hobbes. The important thing was to keep the conspirators from taking any precipitous actions. If they felt they were up against the clock, they would be harder to control.\\n\\n \"It won\u0027t matter how long it takes,\" she said flatly.\\n\\n \"Why not?\" Magus asked.\\n\\n Hobbes paced a moment, thinking furiously. Then it came to her.\\n\\n \"With Captain Zai dead, the Lynx is my ship. The moment I take command, I\u0027ll make the turnaround and ask for new orders,\" she said.\\n\\n \"Perfect,\" Thompson whispered.\\n\\n \"But you\u0027ll be disobeying direct orders,\" Yen Hu said. \"Won\u0027t you?\"\\n\\n \"If they tell us to continue the attack, there\u0027ll be time to get into some kind of position. But I don\u0027t think they will. They\u0027ll thank me for taking the decision out of their hands.\"\\n\\n Thompson laughed. \"Hobbes, you old devil. I was half certain you\u0027d throw me to the captain for even talking to you. And now you\u0027re going to take all the credit for this, aren\u0027t you?\" He put one hand on her shoulder, the touch intimate in the darkness.\\n\\n \"A subtle sort of credit,\" she said. \"Let\u0027s just say we don\u0027t have to cover our tracks too carefully.\"\\n\\n \"What do you talking about?\" Hu asked. He was completely confused now.\\n\\n Magus turned to the young ensign. \"ExO Hobbes doesn\u0027t care if the Apparatus suspects that mutiny occurred, as long as they can\u0027t prove it. She believes her initiative will be appreciated.\"\\n\\n Hu looked at her with a kind of horror. He had entered into this to save the Lynx, not advance anyone\u0027s career. He was obviously aghast that she was thinking past the current crisis of survival. Good, she thought. Hu needed to be focused on the long term. Even if this conspiracy fell apart here and now, he\u0027d already changed his life forever.\\n\\n \"So, sometime in the next twenty-five hours,\" Thompson said, \"Laurent Zai will take the blade of error.\"\\n\\n \"The later the better,\" Hobbes said. \"My decision to pull the Lynx back makes more sense if there isn\u0027t time left to get new orders from the Navy. The captain should go off his watch the day after tomorrow at 9.50, twenty-two hours from now.\"\\n\\n \"Are we all agreed then?\" Thompson asked.\\n\\n They were silent for a moment. Hobbes hoped that someone would say something. There must be some quiet, cutting remark, she thought, that would bring them all to their senses. At this point she could still imagine the conspiracy sputtering out. The right words could break the spell that Thompson had cast. Only, it couldn\u0027t be her to speak up. Hobbes couldn\u0027t let them suspect her real purpose in joining their conspiracy.\\n\\n \"There\u0027s only one thing,\" Hu said.\\n\\n They waited.\\n\\n The young ensign cleared his throat. \"This makes Captain Zai look like a coward. As if he\u0027d been pardoned, but killed himself anyway because he couldn\u0027t face the Rix.\"\\n\\n Hobbes saw the truth of this dawn on the conspirators\u0027 faces, and wondered if Hu had found the right words.\\n\\n For a few moments, no one said anything. They were all from gray families. Posthumous honor was not a thing to be trifled with. In a world ruled by the living dead, the ghosts of the past were taken very seriously.\\n\\n Of course, it was Thompson who finally spoke. \"He is a coward,\" he said bitterly. \"He couldn\u0027t face the blade. That\u0027s why we\u0027re in this mess.\"\\n\\n Magus nodded, then King, and finally Hu, and they placed their hands palm up in the center of their little circle. An old academy team ritual, enjoined to this perverted purpose. But Hobbes joined them. Thompson placed his last, palm down.\\n\\n The plan was locked.\\n\\n COMMANDO\\n\\n H_rd stood still for a moment as the siren began to wail, watching the crowd\u0027s reactions at a calm remove. She noted that the siren cycled with a two-second period between 15 and 25,000 Hertz. At both its extremes, this sine wave went beyond the range of normal human hearing. It dug down low enough to shudder in the gut like a pneumatic hammer, and high enough to shatter fine glass.\\n\\n The siren was evidently designed to paralyze anyone whose hearing was unprotected. Most of the crowd on H_rd\u0027s side of the sniffer covered their ears, their knees bending as if suddenly under high gravity--a few dropped straight to the ground. Poor brainbugged Rana Harter, for whom sounds were solid and visible, crumpled like a column of sand.\\n\\n Only the two militia guards and the Imperial marine remained effective. H_rd waited for their slow reactions to unfold. As one, they turned their backs on the Rix commando to face Rana Harter, who lay in the sniffer corridor. They pulled weapons, activated helmet displays, took up firing poses.\\n\\n Satisfied with their incompetence, H_rd sprang into action.\\n\\n In a few steps, she was behind the Imperial marine, the only real threat to a Rix commando. Her monofilament knife found the seam between helmet and breastplate. The knife was so sharp (sixteen molecules diameter) and her cut so fast that she decapitated him without a drop of blood touching her. She could feel a gurgling sound vibrate the breastplate, but the marine\u0027s death rattle was drowned out by the still-protesting siren.\\n\\n The two militia soldiers were side by side, stepping toward the ragdoll Rana Harter with exaggerated caution. H_rd leapt toward the space between them. She saw one stop, cocking his head to listen to a voice inside his helmet. Someone in tactical control had seen her on-camera, was trying to warn them. It was far too late for that.\\n\\n She stepped between the militia soldiers and laid a firm hand on their variguns, pulling the barrels away from Rana Harter and toward each other. One obliged her by firing, knocking his partner back three meters. H_rd punched him in the face--he had forgotten to lower his visor--and pulled the weapon from his grasp. She turned it on him. The varigun was set to a concussion stun, a wide-area effect meant for crowd control. At a range of ten centimeters, it burst the man\u0027s eyeballs and pushed his jawbone back far enough that it severed his jugular. H_rd reached the sniffer before his body, limbs still flailing with old, irrelevent intentions, hit the ground.\\n\\n Rana Harter was light as a bird. She draped over H_rd\u0027s shoulder like something without bones. The siren was focused here in the sniffer corridor, almost loud enough to damage even Rix hearing. Some sort of gas was drifting upward in the sniffer\u0027s draft, but H_rd hadn\u0027t breathed since the siren began sounding, and had another thirty seconds or so before she would need to.\\n\\n Her burden secured, the commando began to run at speed in a zigzag course away from the facility entrance, dropping the few standing workers in her path with the appropriated varigun\u0027s concussion effect. She was a hundred yards away when the siren cut off, leaving a staggering silence. For a few moments, static filled her ears, and H_rd thought that her hearing was damaged. But with a quick glance backward she saw the dust rising behind her and realized what the sound was.\\n\\n A pair of small flechette autocannon were raking the outer grounds of the facility, orienting on the sound of her thudding steps. According to Alexander\u0027s researches on the array facility, these cannon used listening devices in the ground to triangulate an intruder\u0027s position. But they were falling short, calibrated to hit someone running at normal human velocity. Even in the few meters between her footfalls and the listening devices, the tardy speed of sound made a difference. The incompetence of local militias here in the Spinward Reaches always amazed her; she was glad the few hundred Imperial soldiers had been stretched so thinly across the planet.\\n\\n Suddenly, the dusty arcs of flechette fire rose up in front of her. Someone was recalibrating the autocannon in realtime, trying to compensate for the Rixwoman\u0027s inhuman speed. The gun would catch her soon enough, if only by trial and error; at the moment, she was only a single-variable problem. H_rd asked her internal software for a string of random numbers, and shifted directions to irregularize her course.\\n\\n But the autocannon were spraying wildly now, their screeching reports pitched above a thousand rounds per minute. They would find her eventually. A few hits wouldn\u0027t kill her, but she didn\u0027t have time for wounds. One arm wrapped around Rana Harter, H_rd adjusted the varigun to a new setting at random with her teeth. Damn, the thing was badly designed--if only she had a spare second to pull her own weapon.\\n\\n H_rd aimed blindly, without turning her head--her eyes were a soft spot where even a mere flechette could kill her--calculating on the fly the center of an arc of impacts before her. Her weapon recoiled with a satisfying thump. Three seconds later, a sharp boom rang out and one of the cannon was silenced.\\n\\n She swung the varigun the other way, aiming at the center of the remaining arc of dust that swept toward her. Her finger closed on the firing stud.\\n\\n The gun beeped twice, with that apologetic timbre recognizable in all simple and stupid machines. The weapon had contained only one round at that setting. The stream of flechettes raced along the ground, reaching for her, and H_rd made a rare mistake.\\n\\n She timed the jump perfectly to clear the arc of fire, but didn\u0027t fully take into account the burden of Rana Harter over her shoulder. The commando\u0027s leap reached only two meters vertical, and four flechettes plunged into her.\\n\\n One struck her kneecap, flattened against the exposed hypercarbon, and slid off without leaving a scratch. Another hit a buttock, the small metal arrow tearing bloodily across a broad swath of skin as it bounced off the flexible subdermal armor that protected Rix soldiers from falls. A third passed through her abdomen, nicking the impervious spine and shattering. The shrapnel perforated her stomach, which began healing itself immediately, and destroyed two of her seven kidneys--an acceptable loss.\\n\\n The only real damage came from the round that struck her left arm. It lodged in the radial notch, wedged as tight as a doorstop in the hypercarbon. Her forearm\u0027s flexibility was suddenly reduced to zero. A workaround radius activated itself instantly, allowing the arm to move again, but the strength of the needle-thin workaround was less than ten percent normal. As they landed, Rana Harter fell from H_rd\u0027s suddenly weakened grasp, and tumbled across the tundral grasses like a lifeless body thrown from a train.\\n\\n The commando regained her footing and turned to face the still-shrieking autocannon. With the shaking hand of her damaged arm, she twisted the varigun\u0027s controls through its settings, raking the cannon\u0027s emplacement with infralaser, magnetic sniper rounds, antipersonnel explosives, a burst of tiny depleted uranium slugs, and a stream of microfoil chaff that set the air to sparkling brightly around her.\\n\\n The autocannon stuttered to a halt a few seconds before its firing arc would have found her again, either destroyed or overheated.\\n\\n H_rd\u0027s eyes spotted the thermals of more militia soldiers emerging from the array facility, now a kilometer away. They were staying low, moving forward nervously. She fired more microfoil chaff in their direction to baffle any sensors that could image Rana Harter\u0027s body heat, then emptied the rest of the chaff straight into the air. She scooped up her fallen burden. The glittering microfoil drifted along with H_rd, the wind at her back, falling like metal snow as she plunged into the tundral waste.\\n\\n She traveled twenty kilometers before she thought to check Rana Harter for wounds--another mistake.\\n\\n A host of bruises from the fall covered the woman\u0027s skin, and H_rd\u0027s thermal vision showed increased bloodflow, the body responding to a sprained wrist. Rana\u0027s lower lip was bleeding. Her eyes were starting to flutter open; only time would tell if a head injury had been sustained. Then H_rd saw, barely visible in the winter night\u0027s starlight, the fingertip-sized, dark circle of blood staining the militia fatigues.\\n\\n H_rd knelt, blinded momentarily by a wave of some strange and awful emotion. Then she gathered herself and inspected the wound more closely.\\n\\n A flechette had passed straight through Rana\u0027s chest, hardly slowed by the flimsy calcium rib cage. The projectile was meant to turn to shrapnel inside the body, but had been designed for an armored target. Nothing in the woman\u0027s chest had resisted the shell enough to shatter it. It had missed her heart and spine, but had holed one lung.\\n\\n The woman\u0027s breath was fast and shallow. H_rd put her ear to the wound and listened for the telltale whisper of tension pneumothorax, but no pressure was building in the chest cavity. The bleeding had stopped.\\n\\n H_rd sighed with relief, and something filled her, vibrant and expansive. Not the mere satisfaction of a mission parameter fulfilled, but an animal feeling like the vigor of sex or the calming scent of her home orbital\u0027s familiar air.\\n\\n The cause of this feeling, this swelling of joy: Rana Harter would live.\\n\\n SENATOR\\n\\n The war changed everything.\\n\\n The council met throughout the week, setting broad guidelines for the tumultuous shifts that would shake the Eighty Worlds for the next few decades.\\n\\n In the Spinward Reaches, the council altered the reproduction and education laws. The next generation would have to be numerous, and it would have to grow up quickly. The Expansionist senator on the council presented the proposal, using terms like \"replacement population.\" Nara Oxham found the euphemism repulsive: why not simply call them war orphans?\\n\\n But she voted with the unanimous Council, setting a generous birth dowry to be paid off in lands from the Imperial Conservancy. On twenty planets, virgin climax-stage forests were parceled into bribes, remuneration for the most productive parents. By the time the hundreds of warships from anti-spinward reached their new assignments on the Rix frontier, the babies of this demographic bulge would be old enough to become marines, ground troops, replacements for the technical personnel sucked into the war effort. This oversized generation raised in the hinterland would stand ready to repopulate smashed cities, to recolonize dead planets if necessary.\\n\\n The stately pace of the constant was a convenience in the prosecution of war, Oxham realized. Across the thirty-light-year diameter of Empire, war was slowed to a time scale in which human seed could be sown like summer crops, stacked and stored in preparation for leaner times. Even on her native Vasthold, seven light-years from the Rix frontier, Oxham was forced to accept population increases that would cut deep into the unspoiled continents of the planet: biomes that had taken centuries to stabilize razed overnight to make room for a generation of cannon fodder.\\n\\n The Empire girded itself for a bloodbath that might consume tens of billions.\\n\\n The Expansionist senator sometimes waxed ecstatic as she outlined these plans, her mind alight with partisan fever. Her faction had long called for increased birthrates. The Expansionists shared with the Secularists and Utopians a wariness of the growing power of the dead. But their motto was \"Bury the dead with the living.\" They sought to redress the balance of power through sheer numbers, an ever-expanding population (and thus, an ever-aggressive Empire) in which the dead would never predominate.\\n\\n The Utopians took the opposite, equally unpragmatic tack: they promised universal elevation, in which the symbiant would be bestowed upon every citizen of Empire upon death. Thus, the dead would represent all classes, and everyone would have a stake in immortality.\\n\\n To Senator Oxham and her Secularist Party, both these strategies were patently absurd. The great living masses of the Expansionist vision were doomed to become an underclass. As an ancient philosopher had once said, \"The poor are only poor because of their great number.\" Add the immortality of the wealthy dead to the equation, and the class divisions in the Risen Empire could only worsen. The Utopian future, in which billions were elevated every year, was equally untenable. It would choke the Eighty Worlds and bow the vital living under the weight of their ancestors. Both schemes would create population problems that could only be solved by conquest.\\n\\n The Secularists had a simpler plan. They were, as Laurent had put so long ago, simply pro-death. Universal and irrevocable, natural death leveled all members of a society. Of course, the technology of the symbiant could never be uninvented, but its effects could be ameliorated as much as possible. Elevation should be rare, its rejection celebrated. And the Secularists wanted the living to hold as much power as possible; the dead could stay in their gray enclaves and stare at their black walls, but could not use their unanimity and accumulated wealth to steer the course of Empire.\\n\\n Thus three parties, a clear majority of the Senate, stood against the Emperor, but theirs was a divided opposition.\\n\\n To bolster her case for increased population, the Expansionist senator showed recordings from the First Incursion. Eighty years before, the Rix had sought to break the Empire\u0027s will, to force acceptance of compound minds within all Imperial infostructures. The Incursion had opened with appalling terror attacks. Living cities were ruptured by chaotic gravity beams fired from space, buildings rended as if made of straw, crowds sucked into scrambled piles, in which human forms commingled with metal and plastic and clothing. Gray enclaves were decimated with special munitions, flechette cluster bombs that shredded victims beyond the symbiant\u0027s ability to repair. In rural areas not covered by nuclear dampening fields, clean bombs were used to destroy human and animal populations.\\n\\n Oxham contemplated the images: death enough for anyone.\\n\\n Perhaps that was the seductive nature of war: it gave all parties what they thought they wanted. Millions of new elevated war heroes for the Utopians, vast population increases for the Expansionists, and plenty of true death for the Secularists. And for the Emperor and Loyalty, a period of unquestioned authority.\\n\\n The dead sovereign nodded when the Expansionist finally finished. Darkness was falling, and Oxham realized that she hadn\u0027t slept for two of Home\u0027s long days. The dead needed little sleep--they seemed to drift into an internal world for short, rejuvenating meditations--but the living members of the council looked exhausted.\\n\\n \"I am glad you have chosen to prepare for the worst, Senator.\"\\n\\n \"Thank you, Your Majesty.\"\\n\\n \"Any objections?\" the sovereign asked. Nara realized that this was it. The whole package of population increases, of childhoods spent in military training, of countless virgin biomes raped, it all came down to a simple vote among a few exhausted men and women. It was all happening too fast.\\n\\n She cleared her throat. \\n\\n","sourceLink":"https://allnovel.net/the-risen-empire-succession-1/page-20.html","bookId":1752,"book":{"id":1752,"title":"The Risen Empire (Succession #1)","description":"Storyline: The Risen Empire (Succession #1) \\n Captain Laurent Zai of Imperial Frigate Lynx must rescue the Child Empress, sister of immortal Emperor worshiped by 80 human worlds for 1600 years. The forever young co-ruler has been taken hostage by Rix, machine-augmented humans who worship AI compound minds - cool relentless fanatics bent on domination. Separated by light years, bound by an unlikely love, Zai and pacifist senator Nara Oxham face the Rix and hold the fate of the empire.\\n","cover":"https://allnovel.net/images/the-risen-empire-succession-1.jpg","author":"Scott Westerfeld","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-risen-empire-succession-1.html","creation":"Oct 5, 2019 8:57:55 AM","modification":"Oct 5, 2019 10:20:16 AM"}}
