{"id":95265,"no":22,"title":"Page 22","content":"My childhood dream had come true, but it was more of a nightmare than I could have imagined. I lay awake all night, trying to make sense of it all. The guy I was in love with was really a vampire? Would I spend eternity as a cool ghoul? I didn\u0027t react to this development in the way I\u0027d always dreamed. I didn\u0027t pick up the phone to call CNN. In fact, the whole ride home with Becky I didn\u0027t say a word, only stared out the window in disbelief as she flirted with Matt. At home I locked myself in my bedroom. I scoured my vampire books for answers but found none. I rehearsed telling him that I loved him, no matter who or what he was. That his secret was safe with me. But was I prepared to leave everything I knew? Trade my world for his? Leave my parents? Becky? Even Billy Boy? I stared at my reflection in the full-length mirror, as if for the last time. I spent the next day at the cemetery, pacing in front of the baroness\u0027s monument. As soon as the sun set behind the trees, I took off for the Mansion. When I came around the hill, I noticed the gate was locked. I scaled the fence to find the Mansion even more eerie and lonely than usual. The Mercedes was gone and the lights were off. I rang the bell, over and over. I rapped on the serpent knocker. No one answered. I peered through the living room window. White sheets were draped over the furniture. I ran around back and pressed my nose against the basement window. I couldn\u0027t breathe. The crates of earth were no longer there! My heart sank. I couldn\u0027t swallow. I reached for the loose brick I had formerly used to sneak in. But when I pulled on it, an envelope with my name written across it in large letters fell out. I raced to the front gate and held the letter under the light. I saw my name clearly. I pulled out a black card. In blood-red letters were four simple words: BECAUSE I LOVE YOU. I caressed the words with my fingertips and held the letter to my heart. Tears fell from my face as I wearily slunk against the Mansion gate. It was a stake shoved into my heart. Birds chirped overhead and I looked up to see them hovering over the trees. One swooped down and landed above me on the iron gate. It was a bat. Its wings remained solemnly still as it fixed its gaze upon me. Its shadow prominent on the pavement, its breath in time with mine. Bats are blind, but this one seemed to be staring right into my soul. I slowly reached for it. \"Alexander?\" And then it flew away.","sourceLink":"https://allnovel.net/vampire-kisses-vampire-kisses-1/page-22.html","bookId":2137,"book":{"id":2137,"title":"Vampire Kisses (Vampire Kisses #1)","description":"Storyline: Vampire Kisses (Vampire Kisses #1) A new guy in town.Rumors of vampires. Dangerous first love.This is where it all begins... The mansion on top of Benson Hill has stood empty for years. But one day it seems to be occupied, and its mysterious, handsome inhabitant Alexander Sterling becomes the source of much talk around town. Raven, a vampire-obsessed Goth-girl who has always considered herself an outsider in \"Dullsville,\" is determined to uncover the truth surrounding the secretive Alexander. As she gets to know him, and their spark intensifies, Raven finds herself in some unanticipated situations. Can Alexander make her lifelong dream come true? But love always has its complications - especially when it can only be awakened at nightfall.The first three books in Ellen Schreiber\u0027s bestselling Vampire Kisses series capture the thrill of a most unusual romance.","cover":"https://allnovel.net/images/vampire-kisses-vampire-kisses-1.jpg","author":"Ellen Schreiber","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/vampire-kisses-vampire-kisses-1.html","creation":"Oct 5, 2019 8:58:22 AM","modification":"Oct 5, 2019 6:13:28 PM"}}
