{"id":103628,"no":68,"title":"Page 68","content":"“I don’t understand any of this,” Liz said. “Shhh, honey,” Dave told her. “Don’t shush me,” she said. “A criminal points a gun at me for two hours and you shush me?” “We’re all criminals,” Josie said. “I’m not.” Jill opened her mouth as if she were going to say something only to slowly close it again without speaking. “What’s your plan?” Jimmy wanted to know. “Do you have a plan?” “I’m going to drink one of the old man’s cheap beers—” I said. “Cheap?” he said. “Then go to bed. The rest of you can do whatever you want.” “But what about the plan?” Jimmy asked. “I have some details to work out. We’ll talk in a couple of days.” I looked Claire de Lune directly in the eye. “We’ll talk after we get the guns.” Jimmy’s head swiveled from me to her and back again. “What are you talking to her for?” he asked. “Dyson doesn’t trust me,” Claire answered. “She’s my girl,” Jimmy told me. “She’s Fenelon’s girl,” Josie said. “Is not.” Jimmy turned to Claire for confirmation. “Is not,” he said again. “I love you, not him,” she said. “Oh, puhleez,” the old man said. I remembered the family feud the old man described the day earlier and decided this was the beginning of round two and quite honestly, I wasn’t in the mood. I had phone calls to make. “You kids work it out on your own,” I said. “Preferably somewhere else.” “But—” Josie said. “But nothing. I’m tired, Josie. In the words of a very wise and wonderful bar owner of my acquaintance—you don’t have to go home, but you can’t stay here.” “Must you always call so late?” Bullert asked. “I forgot. Government work is strictly nine-to-five.” “You’re a funny guy, McKenzie.” “You know what, you’re the second person who told me that tonight.” “Talk to me.” “We’re getting close.” “How close.” My explanation included an almost verbatim account of my conversation with John Brand. “I can get my people in place in just a few hours,” Bullert said. “The fewer hours the better. When this happens, I think it’ll happen in a hurry.” Bullert explained exactly what he wanted me to do once I received the call from Brand. “No problem,” I said. “Except…” “Except what?” “Brand can’t be trusted.” “Kinda goes without saying, doesn’t it?” “What I mean is, we should have a Plan B.” “What do you have in mind?” “You’re not going to like it.” “Tell me.” I did—in glorious detail. I was right. He didn’t like it. “Not a chance,” Bullert asked. “Before you say no, talk to Finny.” “Who?” “Assistant U.S. Attorney James R. Finnegan.” “You and your nicknames. Fine. I’ll talk to him in the morning. I guarantee, he’s not going to like it any more than I do.” “You’re probably right.” “Just for argument’s sake, though—what will you need from us to make this happen?” “Besides immunity? You’re not going to like that, either.” TWELVE My eyes snapped open the way they do when you hear a noise that shouldn’t be there, and I reached under the pillow for the SIG Sauer. My hands were closing around the butt when I heard her voice. “I’m sorry, did I startle you?” I released the gun. “Dammit, Josie. What are you doing here?” Josie sat on the foot of the bed. I rolled on my back and looked up at her. After I had shooed everyone out of the cabin the previous night, I retired to the master bedroom. Now a bright sun was shining through the window, giving her face a near-beatific aura, and it occurred to me that when we first met I didn’t think she was particularly attractive. You must have caught her in the wrong light, my inner voice said. “We need to talk,” she said. I grabbed a fistful of sheet and blanket and pulled them up around my chest. “What time is it?” I asked. “Little before eight.” “In the morning? Josie, one of the reasons a guy might turn to a life of crime is so he doesn’t have to get up early.” “Eight o’clock is early?” “What do you want?” “I’m worried.” “Suddenly you’re worried…” “Are you awake?” “What? Yes, I’m awake.” “You sound cranky.” “JoEllen…” “I like that you call me that. Almost no one ever does.” “I have a gun. I will shoot you.” “Are you one of those people that need a cup of coffee before they can start the day? I’ll make it.” “No, no, no,” I said. “I’ll make it.” I swung my legs off the edge of the bed even while gathering the sheet and blanket around my waist. “Give me a minute to take a shower and get dressed.” “If you’re going to do that, I’m going to go jump in the lake.”","sourceLink":"https://allnovel.net/the-last-kind-word-mac-mckenzie-10/page-68.html","bookId":2217,"book":{"id":2217,"title":"The Last Kind Word (Mac McKenzie #10)","description":"Storyline: ABOUT DAVID HOUSEWRIGHT A reformed newspaper reporter and ad man, Housewright\u0027s book \"Penance\" (Foul Play Press) earned the 1996 Edgar Award for Best First Novel from the Mystery Writers of America and was nominated for a Shamus in the same category by the Private Eye Writers of America. \"Practice to Deceive\" won the 1998 Minnesota Book Award (it is currently being developed as a feature film) and \"Jelly\u0027s Gold\" won the same prize in 2010. His 11th novel -- \"Highway 61\" -- was published in June 2011. Housewright\u0027s short stories have appeared in several anthologies including \"Silence of the Loons,\" \"Twin Cities Noir,\" \"Resort to Murder,\" and \"Once Upon A Crime\" and publications as diverse as Ellery Queen\u0027s Mystery Magazine and True Romance. He has a line of books featuring Rushmore McKenzie -- a former cop turned millionaire. He has another line of books featuring Holland Taylor -- a former cop turned private detective.","cover":"https://allnovel.net/images/the-last-kind-word-mac-mckenzie-10.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/the-last-kind-word-mac-mckenzie-10.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:25:50 PM"}}
