{"id":80653,"no":1,"title":"Page 1","content":"The Scopuli had been taken eight days ago, and Julie Mao was finally ready to be shot.\n It had taken all eight days trapped in a storage locker for her to get to that point. For the first two she\u0027d remained motionless, sure that the armored men who\u0027d put her there had been serious. For the first hours, the ship she\u0027d been taken aboard wasn\u0027t under thrust, so she floated in the locker, using gentle touches to keep herself from bumping into the walls or the atmosphere suit she shared the space with. When the ship began to move, thrust giving her weight, she\u0027d stood silently until her legs cramped, then sat down slowly into a fetal position. She\u0027d peed in her jumpsuit, not caring about the warm itchy wetness, or the smell, worrying only that she might slip and fall in the wet spot it left on the floor. She couldn\u0027t make noise. They\u0027d shoot her.\n On the third day, thirst had forced her into action. The noise of the ship was all around her. The faint subsonic rumble of the reactor and drive. The constant hiss and thud of hydraulics and steel bolts as the pressure doors between decks opened and closed. The clump of heavy boots walking on metal decking. She waited until all the noise she could hear sounded distant, then pulled the environment suit off its hooks and onto the locker floor. Listening for any approaching sound, she slowly disassembled the suit and took out the water supply. It was old and stale; the suit obviously hadn\u0027t been used or serviced in ages. But she hadn\u0027t had a sip in two days, and the warm loamy water in the suit\u0027s reservoir bag was the best thing she had ever tasted. She had to work hard not to gulp it down and make herself vomit.\n When the urge to urinate returned, she pulled the catheter bag out of the suit and relieved herself into it. She sat on the floor, now cushioned by the padded suit and almost comfortable, and wondered who her captors were - Coalition Navy, pirates, something worse. Sometimes she slept.\n On day four, isolation, hunger, boredom, and the diminishing number of places to store her piss finally pushed her to make contact with them. She\u0027d heard muffled cries of pain. Somewhere nearby, her shipmates were being beaten or tortured. If she got the attention of the kidnappers, maybe they would just take her to the others. That was okay. Beatings, she could handle. It seemed like a small price to pay if it meant seeing people again.\n The locker sat beside the inner airlock door. During flight, that usually wasn\u0027t a high-traffic area, though she didn\u0027t know anything about the layout of this particular ship. She thought about what to say, how to present herself. When she finally heard someone moving toward her, she just tried to yell that she wanted out. The dry rasp that came out of her throat surprised her. She swallowed, working her tongue to try to create some saliva, and tried again. Another faint rattle in the throat.\n The people were right outside her locker door. A voice was talking quietly. Julie had pulled back a fist to bang on the door when she heard what it was saying.\n No. Please no. Please don\u0027t.\n Dave. Her ship\u0027s mechanic. Dave, who collected clips from old cartoons and knew a million jokes, begging in a small broken voice.\n No, please no, please don\u0027t, he said.\n Hydraulics and locking bolts clicked as the inner airlock door opened. A meaty thud as something was thrown inside. Another click as the airlock closed. A hiss of evacuating air.\n When the airlock cycle had finished, the people outside her door walked away. She didn\u0027t bang to get their attention.\n They\u0027d scrubbed the ship. Detainment by the inner planets navies was a bad scenario, but they\u0027d all trained on how to deal with it. Sensitive OPA data was scrubbed and overwritten with innocuous-looking logs with false time stamps. Anything too sensitive to trust to a computer, the captain destroyed. When the attackers came aboard, they could play innocent.\n It hadn\u0027t mattered.\n There weren\u0027t the questions about cargo or permits. The invaders had come in like they owned the place, and Captain Darren had rolled over like a dog. Everyone else - Mike, Dave, Wan Li - they\u0027d all just thrown up their hands and gone along quietly. The pirates or slavers or whatever they were had dragged them off the little transport ship that had been her home, and down a docking tube without even minimal environment suits. The tube\u0027s thin layer of Mylar was the only thing between them and hard nothing: hope it didn\u0027t rip; goodbye lungs if it did.\n Julie had gone along too, but then the bastards had tried to lay their hands on her, strip her clothes off.\n Five years of low-gravity jui jitsu training and them in a confined space with no gravity. She\u0027d done a lot of damage. She\u0027d almost started to think she might win when from nowhere a gauntleted fist smashed into her face. Things got fuzzy after that. Then the locker, and Shoot her if she makes a noise. Four days of not making noise while they beat her friends down below and then threw one of them out an airlock.\n After six days, everything went quiet.\n Shifting between bouts of consciousness and fragmented dreams, she was only vaguely aware as the sounds of walking, talking, and pressure doors and the subsonic rumble of the reactor and the drive faded away a little at a time. When the drive stopped, so did gravity, and Julie woke from a dream of racing her old pinnace to find herself floating while her muscles screamed in protest and then slowly relaxed.\n She pulled herself to the door and pressed her ear to the cold metal. Panic shot through her until she caught the quiet sound of the air recyclers. The ship still had power and air, but the drive wasn\u0027t on and no one was opening a door or walking or talking. Maybe it was a crew meeting. Or a party on another deck. Or everyone was in engineering, fixing a serious problem.\n She spent a day listening and waiting.\n By day seven, her last sip of water was gone. No one on the ship had moved within range of her hearing for twenty-four hours. She sucked on a plastic tab she\u0027d ripped off the environment suit until she worked up some saliva; then she started yelling. She yelled herself hoarse.\n No one came.\n By day eight, she was ready to be shot. She\u0027d been out of water for two days, and her waste bag had been full for four. She put her shoulders against the back wall of the locker and planted her hands against the side walls. Then she kicked out with both legs as hard as she could. The cramps that followed the first kick almost made her pass out. She screamed instead.\n Stupid girl, she told herself. She was dehydrated. Eight days without activity was more than enough to start atrophy. At least she should have stretched out.\n She massaged her stiff muscles until the knots were gone, then stretched, focusing her mind like she was back in dojo. When she was in control of her body, she kicked again. And again. And again, until light started to show through the edges of the locker. And again, until the door was so bent that the three hinges and the locking bolt were the only points of contact between it and the frame.\n And one last time, so that it bent far enough that the bolt was no longer seated in the hasp and the door swung free.\n Julie shot from the locker, hands half raised and ready to look either threatening or terrified, depending on which seemed more useful.\n There was no one on the whole deck level: the airlock, the suit storage room where she\u0027d spent the last eight days, a half dozen other storage rooms. All empty. She plucked a magnetized pipe wrench of suitable size for skull cracking out of an EVA kit, then went down the crew ladder to the deck below.\n And then the one below that, and then the one below that. Personnel cabins in crisp, almost military order. Commissary, where there were signs of a struggle. Medical bay, empty. Torpedo bay. No one. The comm station was unmanned, powered down, and locked. The few sensor logs that still streamed showed no sign of the Scopuli. A new dread knotted her gut. Deck after deck and room after room empty of life. Something had happened. A radiation leak. Poison in the air. Something that had forced an evacuation. She wondered if she\u0027d be able to fly the ship by herself.\n But if they\u0027d evacuated, she\u0027d have heard them going out the airlock, wouldn\u0027t she?\n She reached the final deck hatch, the one that led into engineering, and stopped when the hatch didn\u0027t open automatically. A red light on the lock panel showed that the room had been sealed from the inside. She thought again about radiation and major failures. But if either of those was the case, why lock the door from the inside? And she had passed wall panel after wall panel. None of them had been flashing warnings of any kind. No, not radiation, something else.\n There was more disruption here. Blood. Tools and containers in disarray. Whatever had happened, it had happened here. No, it had started here. And it had eneded behind that locked door.\n It took two hours with a torch and prying tools from the machine shop to cut through the hatch to engineering. With the hydraulics compromised, she had to crank it open by hand. A gust of warm wet air blew out, carrying a hospital scent without the antiseptic. A coppery, nauseating smell. The torture chamber, then. Her friends would be inside, beaten or cut to pieces. Julie hefted her wrench and prepared to bust open at least one head before they killed her. She floated down.\n The engineering deck was huge, vaulted like a cathedral. The fusion reactor dominated the central space. Something was wrong with it. Where she expected to see readouts, shielding, and monitors, a layer of something like mud seemed to flow over the reactor core. Slowly, Julie floated toward it, one hand still on the ladder. The strange smell became overpowering.\n The mud caked around the reactor had structure to it like nothing she\u0027d seen before. Tubes ran through it like veins or airways. Parts of it pulsed. Not mud, then.\n Flesh.\n An outcropping of the thing shifted toward her. Compared to the whole, it seemed no larger than a toe, a little finger. It was Captain Darren\u0027s head.\n \"Help me,\" it said. \n","sourceLink":"https://allnovel.net/leviathan-wakes-expanse-1/page-1.html","bookId":2454,"book":{"id":2454,"title":"Leviathan Wakes (Expanse #1)","description":"Storyline: \n Leviathan Wakes is a 2011 science fiction novel by James S. A. Corey (pen name of Daniel Abraham and Ty Franck) \n Humanity has colonized the solar system - Mars, the Moon, the Asteroid Belt and beyond - but the stars are still out of our reach. \n Jim Holden is XO of an ice miner making runs from the rings of Saturn to the mining stations of the Belt. When he and his crew stumble upon a derelict ship, \"The Scopuli,\" they find themselves in possession of a secret they never wanted. A secret that someone is willing to kill for - and kill on a scale unfathomable to Jim and his crew. War is brewing in the system unless he can find out who left the ship and why. \n Detective Miller is looking for a girl. One girl in a system of billions, but her parents have money and money talks. When the trail leads him to \"The Scopuli\" and rebel sympathizer Holden, he realizes that this girl may be the key to everything. \n Holden and Miller must thread the needle between the Earth government, the Outer Planet revolutionaries, and secretive corporations - and the odds are against them. But out in the Belt, the rules are different, and one small ship can change the fate of the universe.\n \n","cover":"https://allnovel.net/images/leviathan-wakes-expanse-1.jpg","author":"James S.A. Corey","type":"Horror","source":"allnovel","link":"https://allnovel.net/leviathan-wakes-expanse-1.html","creation":"Oct 5, 2019 8:58:44 AM","modification":"Oct 5, 2019 4:26:48 PM"}}
