{"id":80665,"no":13,"title":"Page 13","content":"For twelve years, Miller had worked security. Violence and death were familiar companions to him. Men, women. Animals. Kids. Once he\u0027d held a woman\u0027s hand while she bled to death. He\u0027d killed two people, could still see them die if he closed his eyes and thought about it. If anyone had asked him, he\u0027d have said there wasn\u0027t much left that would shake him.\n But he\u0027d never watched a war start before.\n The Distinguished Hyacinth Lounge was in the shift-change rush. Men and women in security uniforms - mostly from Star Helix, but a few smaller companies too - were either drinking their after-work liquor and winding down or making trips to the breakfast buffet for coffee, textured fungi in sugar sauce, sausage with meat maybe one part in a thousand. Miller chewed the sausage and watched the display monitor on the wall. A Star Helix external relations head looked sincerely out, his demeanor radiating calm and certainty as he explained how everything was going to hell.\n \"Preliminary scans suggest that the explosion was the result of a failed attempt to connect a nuclear device to the docking station. Officials from the Martian government have referred to the incident only as an \u0027alleged terrorist action\u0027 and refused comment pending further investigation.\"\n \"Another one,\" Havelock said from behind him. \"You know, eventually, one of those assholes is going to get it right.\"\n Miller turned in his seat, then nodded to the chair beside him. Havelock sat.\n \"That\u0027ll be an interesting day,\" Miller said. \"I was about to call you.\"\n \"Yeah, sorry,\" his partner said. \"I was up kind of late.\"\n \"Any word on the transfer?\"\n \"No,\" Havelock said. \"Figure my paperwork\u0027s hung on a desk someplace in Olympus. What about you? Any word on your special-project girl?\"\n \"Not yet,\" Miller said. \"Look, the reason I wanted to meet up before we went in... I need to take a couple days, try to run down some leads on Julie. With all this other shit going on, Shaddid doesn\u0027t want me doing much more than phoning this one in.\"\n \"But you\u0027re ignoring that,\" Havelock said. It wasn\u0027t a question.\n \"I\u0027ve got a feeling about this one.\"\n \"So how can I help?\"\n \"I need you to cover for me.\"\n \"How am I going to do that?\" Havelock asked. \"It\u0027s not like I can tell them you\u0027re sick. They\u0027ve got access to your medical records same as everyone else\u0027s.\"\n \"Tell \u0027em I\u0027ve been getting drunk a lot,\" Miller said. \"That Candace came by. She\u0027s my ex-wife.\"\n Havelock chewed his sausage, brow furrowed. The Earther shook his head slowly - not a refusal, but the prelude to a question. Miller waited.\n \"You\u0027re telling me you\u0027d rather have the boss think you\u0027re missing work because you\u0027re on a dysfunctional, heartbroken bender than that you\u0027re doing the work she assigned you? I don\u0027t get it.\"\n Miller licked his lips and leaned forward, elbows on the smooth off-white table. Someone had scratched a design into the plastic. A split circle. And this was a cop bar.\n \"I don\u0027t know what I\u0027m looking at,\" Miller said. \"There\u0027s a bunch of things that belong together somehow, and I\u0027m not sure yet what it is. Until I know more, I need to stay low. A guy has a fling with his ex, hits the bottle for a few days? That\u0027s not going to light up anyone\u0027s panels.\"\n Havelock shook his head again, this time in mild disbelief. If he\u0027d been a Belter, he\u0027d have made the gesture with his hands, so you could see it when he had an environment suit on. Another of the hundred small ways someone who hadn\u0027t grown up on the Belt betrayed himself. The wall monitor cut to the image of a blond woman in a severe uniform. The external relations head was talking about the Martian navy\u0027s tactical response and whether the OPA was behind the increased vandalism. That was what he called fumbling an overloaded fusion reactor while setting up a ship-killing booby trap: vandalism.\n \"That shit just doesn\u0027t follow,\" Havelock said, and for a moment Miller didn\u0027t know if he meant the Belter guerrilla actions, the Martian response, or the favor he\u0027d asked. \"Seriously. Where\u0027s Earth? All this shit\u0027s going on, and we don\u0027t hear a damn thing from them.\"\n \"Why would we?\" Miller asked. \"It\u0027s Mars and the Belt going at it.\"\n \"When was the last time Earth let anything major happen without them in the middle of it?\" Havelock said, then sighed. \"Okay. You\u0027re too drunk to come in. Your love life\u0027s a mess. I\u0027m trying to cover for you.\"\n \"Just for a couple days.\"\n \"Make sure you get back before someone decides it\u0027s the perfect chance for a random shooting to take out the Earther cop.\"\n \"I\u0027ll do that,\" Miller said, rising from the table. \"You watch your back.\"\n \"Don\u0027t need to tell me twice,\" Havelock said.\n The Ceres Center for Jiu Jitsu was down near the port, where the spin gravity was strongest. The hole was a converted storage space from before the big spin. A cylinder flattened where flooring had been set in about a third of the way from the bottom. Racks bearing various lengths of staffs, bamboo swords, and dull plastic practice knives hung from the vaulted ceiling. The polished stone echoed with the grunting of men working a line of resistance machines and the soft thud of a woman at the back punishing a heavy bag. Three students stood on the central mat, speaking in low voices.\n Pictures filled the front wall on either side of the door. Soldiers in uniform. Security agents for half a dozen Belter corporations. Not many inner planet types, but a few. Plaques commemorating placements in competitions. A page of small type outlining the history of the studio.\n One of the students shouted and collapsed, carrying one of the others to the mat with her. The one still standing applauded and helped them back up. Miller searched through the wall of pictures, hoping to find Julie.\n \"Can I help you?\"\n The man was half a head shorter than Miller and easily twice as broad. It should have made him look like an Earther, but everything else about him said Belt. He wore pale sweats that made his skin seem even darker. His smile was curious and as serene as a well-fed predator. Miller nodded.\n \"Detective Miller,\" he said. \"I\u0027m with station security. There\u0027s one of your students I wanted to get some background on.\"\n \"This is an official investigation?\" the man asked.\n \"Yeah,\" Miller said. \"I\u0027m afraid it is.\"\n \"Then you\u0027ll have a warrant.\"\n Miller smiled. The man smiled back.\n \"We don\u0027t give out any information on our students without a warrant,\" he said. \"Studio policy.\"\n \"I respect that,\" Miller said. \"No, I really do. It\u0027s just that... parts of this particular investigation are maybe a little more official than others. The girl\u0027s not in trouble. She didn\u0027t do anything. But she has family on Luna who want her found.\"\n \"A kidnap job,\" the man said, folding his arms. The serene face had gone cool without any apparent movement.\n \"Only the official part,\" Miller said. \"I can get a warrant, and we can do the whole thing through channels. But then I have to tell my boss. The more she knows, the less room I have to move.\"\n The man didn\u0027t react. His stillness was unnerving. Miller struggled not to fidget. The woman working the heavy bag at the far end of the studio went through a flurry of strikes, shouting out with each one.\n \"Who?\" the man asked.\n \"Julie Mao,\" Miller said. He could have said he was looking for the Buddha\u0027s mother for all the reaction he got. \"I think she\u0027s in trouble.\"\n \"Why do you care if she is?\"\n \"I don\u0027t know the answer to that one,\" Miller said. \"I just do. If you don\u0027t want to help me, then you don\u0027t.\"\n \"And you\u0027ll go get your warrant. Do this through channels.\"\n Miller took off his hat, rubbed a long, thin hand across his head, and put the hat back in place.\n \"Probably not,\" he said.\n \"Let me see your ID,\" the man said. Miller pulled up his terminal and let the man confirm who he was. The man handed it back and pointed to a small door behind the heavy bags. Miller did as he was told.\n The office was cramped. A small laminate desk with a soft sphere behind it in lieu of a chair. Two stools that looked like they\u0027d come out of a bar. A filing cabinet with a small fabricator that stank of ozone and oil that was probably where the plaques and certificates were made.\n \"Why does the family want her?\" the man asked, lowering himself onto the sphere. It acted like a chair but required constant balance. A place to rest without actually resting.\n \"They think she\u0027s in harm\u0027s way. At least, that\u0027s what they\u0027re saying, and I don\u0027t have reason to disbelieve them yet.\"\n \"What kind of harm?\"\n \"Don\u0027t know,\" Miller said. \"I know she was on station. I know she shipped out for Tycho, and after that, I\u0027ve got nothing.\"\n \"Her family want her back on their station?\"\n The man knew who her family was. Miller filed the information away without missing a beat.\n \"I don\u0027t think so,\" Miller said. \"The last message she got from them routed through Luna.\"\n \"Down the well.\" The way he said it made it sound like a disease.\n \"I\u0027m looking for anyone who knows who she was shipping with. If she\u0027s on a run, where she was going and when she was planning to get there. If she\u0027s in range of a tightbeam.\"\n \"I don\u0027t know any of that,\" the man said.\n \"You know anyone I should ask?\"\n There was a pause.\n \"Maybe. I\u0027ll find what I can for you.\"\n \"Anything else you can tell me about her?\"\n \"She started at the studio five years ago. She was... angry when she first came. Undisciplined.\"\n \"She got better,\" Miller said. \"Brown belt, right?\"\n The man\u0027s eyebrows rose.\n \"I\u0027m a cop,\" Miller said. \"I find things out.\"\n \"She improved,\" her teacher said. \"She\u0027d been attacked. Just after she came to the Belt. She was seeing that it didn\u0027t happen twice.\"\n \"Attacked,\" Miller said, parsing the man\u0027s tone of voice. \"Raped?\"\n \"I didn\u0027t ask. She trained hard, even when she was off station. You can tell when people let it slide. They come back weaker. She never did.\"\n \"Tough girl,\" Miller said. \"Good for her. Did she have friends? People she sparred with?\"\n \"A few. No lovers that I know of, since that\u0027s the next question.\"\n \"That\u0027s strange. Girl like that.\"\n \"Like what, Detective?\"\n \"Pretty girl,\" Miller said. \"Competent. Smart. Dedicated. Who wouldn\u0027t want to be with someone like that?\"\n \"Perhaps she hadn\u0027t met the right person.\"\n Something in the way he said it hinted at amusement. Miller shrugged, uncomfortable in his skin.\n \"What kind of work did she do?\" he asked.\n \"Light freighter. I don\u0027t know of any particular cargo. I had the impression that she shipped wherever there was a need.\"\n \"Not a regular route, then?\"\n \"That was my impression.\"\n \"Whose ships did she work? One particular freighter, or whatever came to hand? A particular company?\"\n \"I\u0027ll find what I can for you,\" the man said.\n \"Courier for the OPA?\"\n \"I\u0027ll find out,\" the man said, \"what I can.\"\n The news that afternoon was all about Phoebe. The science station there - the one that Belters weren\u0027t allowed even to dock at - had been hit. The official report stated that half the inhabitants of the base were dead, the other half missing. No one had claimed responsibility yet, but the common wisdom was that some Belter group - maybe the OPA, maybe someone else - had finally managed an act of \"vandalism\" with a body count. Miller sat in his hole, watching the broadcast feed and drinking.\n It was all going to hell. The pirate casts from the OPA calling for war. The burgeoning guerrilla actions. All of it. The time was coming that Mars wasn\u0027t going to ignore them anymore. And when Mars took action, it wouldn\u0027t matter if Earth followed suit. It would be the first real war in the Belt. The catastrophe was coming, and neither side seemed to understand how vulnerable they were. And there was nothing - not one single goddamned thing - that he could do to stop it. He couldn\u0027t even slow it down.\n Julie Mao grinned at him from the still frame, her pinnace behind her. Attacked, the man had said. There was nothing about it in her record. Might have been a mugging. Might have been something worse. Miller had known a lot of victims, and he put them into three categories. First there were the ones who pretended nothing had happened, or that whatever it was didn\u0027t really matter. That was well over half the people he talked to. Then there were the professionals, people who took their victimization as permission to act out any way they saw fit. That ate most of the rest.\n Maybe 5 percent, maybe less, were the ones who sucked it up, learned the lesson, and moved on. The Julies. The good ones.\n His door chimed three hours after his official shift was over. Miller stood up, less steady on his feet than he\u0027d expected. He counted the bottles on the table. There were more than he\u0027d thought. He hesitated for a moment, torn between answering the door and throwing the bottles into the recycler. The door chimed again. He went to open it. If it was someone from the station, they expected him to be drunk, anyway. No reason to disappoint.\n The face was familiar. Acne-pocked, controlled. The OPA armband from the bar. The one who\u0027d had Mateo Judd killed.\n The cop.\n \"Evening,\" Miller said.\n \"Detective Miller,\" the pocked man said. \"I think we\u0027ve gotten off on the wrong foot. I was hoping we could try again.\"\n \"Right.\"\n \"May I come in?\"\n \"I try not to take strange men home,\" Miller said. \"I don\u0027t even know your name.\"\n \"Anderson Dawes,\" the pocked man said. \"I\u0027m the Ceres liaison for the Outer Planets Alliance. I think we can help each other. May I come in?\"\n Miller stood back, and the pocked man - Dawes - stepped inside. Dawes took in the hole for the space of two slow breaths, then sat as if the bottles and the stink of old beer were nothing to comment on. Silently cursing himself and willing a sobriety he didn\u0027t feel, Miller sat across from him.\n \"I need a favor from you,\" Dawes said. \"I\u0027m willing to pay for it. Not money, of course. Information.\"\n \"What do you want?\" Miller asked.\n \"Stop looking for Juliette Mao.\"\n \"No sale.\"\n \"I\u0027m trying to keep the peace, Detective,\" Dawes said. \"You should hear me out.\"\n Miller leaned forward, elbows on the table. Mr. Serene Jiu Jitsu Instructor was working for the OPA? The timing of Dawes\u0027 visit seemed to be saying so. Miller filed that possibility away but said nothing.\n \"Mao worked for us,\" Dawes said. \"But you\u0027d guessed that.\"\n \"More or less. You know where she is?\"\n \"We don\u0027t. We are looking for her. And we need to be the ones to find her. Not you.\"\n Miller shook his head. There was a response, the right thing to say. It was rattling in the back of his head, and if he just didn\u0027t feel quite so fuzzy...\n \"You\u0027re one of them, Detective. You may have lived your whole life out here, but your salary is paid by an inner planet corporation. No, wait. I don\u0027t blame you. I understand how it is. They were hiring and you needed the work. But... we\u0027re walking on a bubble right now. The Canterbury. The fringe elements in the Belt calling for war.\"\n \"Phoebe Station.\"\n \"Yes, they\u0027ll blame us for that too. Add a Luna corporation\u0027s prodigal daughter... \"\n \"You think something\u0027s happened to her.\"\n \"She was on the Scopuli,\" Dawes said, and when Miller didn\u0027t immediately respond, he added, \"The freighter that Mars used as bait when they killed the Canterbury.\"\n Miller thought about that for a long moment, then whistled low.\n \"We don\u0027t know what happened,\" Dawes said. \"Until we do, I can\u0027t have you stirring up the water. It\u0027s muddy enough now.\"\n \"And what information are you offering?\" Miller asked. \"That\u0027s the trade, right?\"\n \"I\u0027ll tell you what we find. After we find her,\" Dawes said. Miller chuckled, and the OPA man went on. \"It\u0027s a generous offer, considering who you are. Employee of Mars. Partner of an Earther. Some people would think that was enough to make you the enemy too.\"\n \"But not you,\" Miller said.\n \"I think we\u0027ve got the same basic goals, you and I. Stability. Safety. Strange times make for strange alliances.\"\n \"Two questions.\"\n Dawes spread his arms, welcoming them.\n \"Who took the riot gear?\" Miller asked.\n \"Riot gear?\"\n \"Before the Canterbury died, someone took our riot gear. Maybe they wanted to arm soldiers for crowd control. Maybe they didn\u0027t want our crowds controlled. Who took it? Why?\"\n \"It wasn\u0027t us,\" Dawes said.\n \"That\u0027s not an answer. Try this one. What happened to the Golden Bough Society?\"\n Dawes looked blank.\n \"Loca Greiga?\" Miller asked. \"Sohiro?\"\n Dawes opened his mouth, closed it. Miller dropped his beer bottle into the recycler.\n \"Nothing personal, friend,\" he said, \"but your investigative techniques aren\u0027t impressing me. What makes you think you can find her?\"\n \"It\u0027s not a fair test,\" Dawes said. \"Give me a few days, I\u0027ll get answers for you.\"\n \"Talk to me then. I\u0027ll try not to start an all-out war while you do, but I\u0027m not letting go of Julie. You can go now.\"\n Dawes rose. He looked sour.\n \"You\u0027re making a mistake,\" he said.\n \"Won\u0027t be my first.\"\n After the man left, Miller sat at his table. He\u0027d been stupid. Worse, he\u0027d been self-indulgent. Drinking himself into a stupor instead of doing the work. Instead of finding Julie. But he knew more now. The Scopuli. The Canterbury. More lines between the dots.\n He cleaned away his bottles, took a shower, and pulled up his terminal, searching what there was about Julie\u0027s ship. After an hour, a new thought occurred to him, a small fear that grew the more he looked at it. Near midnight, he put a call through to Havelock\u0027s hole.\n His partner took two full minutes to answer. When he did, his image was wild-haired and bleary-eyed.\n \"Miller?\"\n \"Havelock. You have any vacation time saved up?\"\n \"A little.\"\n \"Sick leave?\"\n \"Sure,\" Havelock said.\n \"Take it,\" Miller said. \"Take it now. Get off station. Someplace safe if you can find it. Someplace they\u0027re not going to start killing Earthers for shits and giggles if things go pear-shaped.\"\n \"I don\u0027t understand. What are you talking about?\"\n \"I had a little visit with an OPA agent tonight. He was trying to talk me into dropping my kidnap job. I think... I think he\u0027s nervous. I think he\u0027s scared.\"\n Havelock was silent for a moment while the words filtered into his sleep-drunk mind.\n \"Jesus,\" he said. \"What scares the OPA?\" \n","sourceLink":"https://allnovel.net/leviathan-wakes-expanse-1/page-13.html","bookId":2454,"book":{"id":2454,"title":"Leviathan Wakes (Expanse #1)","description":"Storyline: \n Leviathan Wakes is a 2011 science fiction novel by James S. A. Corey (pen name of Daniel Abraham and Ty Franck) \n Humanity has colonized the solar system - Mars, the Moon, the Asteroid Belt and beyond - but the stars are still out of our reach. \n Jim Holden is XO of an ice miner making runs from the rings of Saturn to the mining stations of the Belt. When he and his crew stumble upon a derelict ship, \"The Scopuli,\" they find themselves in possession of a secret they never wanted. A secret that someone is willing to kill for - and kill on a scale unfathomable to Jim and his crew. War is brewing in the system unless he can find out who left the ship and why. \n Detective Miller is looking for a girl. One girl in a system of billions, but her parents have money and money talks. When the trail leads him to \"The Scopuli\" and rebel sympathizer Holden, he realizes that this girl may be the key to everything. \n Holden and Miller must thread the needle between the Earth government, the Outer Planet revolutionaries, and secretive corporations - and the odds are against them. But out in the Belt, the rules are different, and one small ship can change the fate of the universe.\n \n","cover":"https://allnovel.net/images/leviathan-wakes-expanse-1.jpg","author":"James S.A. Corey","type":"Horror","source":"allnovel","link":"https://allnovel.net/leviathan-wakes-expanse-1.html","creation":"Oct 5, 2019 8:58:44 AM","modification":"Oct 5, 2019 4:26:48 PM"}}
