{"id":80682,"no":30,"title":"Page 30","content":"Fuck me,\" Holden said. And a moment later: \"They left us.\"\\n\\n No. She had left him. Naomi had said she would, but confronted with the reality of it, Holden realized that he hadn\u0027t really believed her. But here it was - the proof. The empty space where she used to be. His heart hammered and his throat tightened, breath coming in gasps. The sick feeling in his gut was either despair or his colon sloughing off its lining. He was going to die sitting outside a cheap hotel on Eros because Naomi had done exactly what she\u0027d said she would. What he himself had ordered her to do. His resentment refused to listen to reason.\\n\\n \"We\u0027re dead,\" he said, and sat down on the edge of a fern-filled planter.\\n\\n \"How long do we have?\" Miller asked, looking up and down the corridor while he fidgeted with his gun.\\n\\n \"No idea,\" Holden replied, gesturing vaguely at his terminal\u0027s flashing red radiation symbol. \"Hours before we really start to feel it, I think, but I don\u0027t know. God, I wish Shed was still here.\"\\n\\n \"Shed?\"\\n\\n \"Friend of mine,\" Holden said, not feeling up to elaborating. \"Good med tech.\"\\n\\n \"Call her,\" Miller said.\\n\\n Holden looked at his terminal and tapped the screen a few times.\\n\\n \"Network\u0027s still down,\" he said.\\n\\n \"All right,\" Miller said. \"Let\u0027s go to your ship. See if it\u0027s still in dock.\"\\n\\n \"They\u0027ll be gone. Naomi\u0027s keeping the crew alive. She warned me, but I - \"\\n\\n \"So let\u0027s go anyway,\" Miller said. He was shifting from one foot to the other and looking down the corridor as he spoke.\\n\\n \"Miller,\" Holden said, then stopped. Miller was clearly on edge, and he\u0027d shot four people. Holden was increasingly frightened of the former cop. As if reading his mind, Miller stepped close, the two-meter man towering over him where he sat. Miller smiled ruefully, his eyes unnervingly gentle. Holden would almost have preferred they be threatening.\\n\\n \"Way I see it, there\u0027s three ways this can go,\" Miller said. \"One, we find your ship still in dock, get the meds we need, and maybe we live. Two, we try to get to the ship, and along the way we run into a bunch of mafia thugs. Die gloriously in a hail of bullets. Three, we sit here and leak out of our eyes and assholes.\"\\n\\n Holden said nothing; he just stared up at the cop and frowned.\\n\\n \"I\u0027m liking the first two better than the last one,\" Miller said. His voice made it sound like an apology. \"How about you come with?\"\\n\\n Holden laughed before he could catch himself, but Miller didn\u0027t look like he was taking offense.\\n\\n \"Sure,\" Holden said. \"I just needed to feel sorry for myself for a minute. Let\u0027s go get killed by the mafia.\"\\n\\n He said it with much more bravado than he felt. The truth was he didn\u0027t want to die. Even during his time in the navy, the idea of dying in the line of duty had always seemed distant and unreal. His ship would never be destroyed, and if it was, he would make it to the escape shuttle. The universe without him in it didn\u0027t make any sense at all. He\u0027d taken risks; he\u0027d seen other people die. Even people he loved. Now, for the first time, his own death was a real thing.\\n\\n He looked at the cop. He\u0027d known the man less than a day, didn\u0027t trust him, and wasn\u0027t sure he much liked him. And this was who he\u0027d die with. Holden shuddered and stood up, pulling his gun out of his waistband. Under the panic and fear, there was a deep feeling of calm. He hoped it would last.\\n\\n \"After you,\" Holden said. \"If we make it, remind me to call my mothers.\"\\n\\n The casinos were a powder keg waiting for a match. If the evacuation sweeps had been even moderately successful, there were probably a million or more people crammed into three levels of the station. Hard-looking men in riot gear moved through the crowds, telling everyone to stay put until they were taken to the radiation shelters, keeping the crowd frightened. Every now and then, a small group of citizens would be led away. Knowing where they were going made Holden\u0027s stomach burn. He wanted to yell out that cops were fake, that they were killing people. But a riot with this many people in such a confined space would be a meat grinder. Maybe that was inevitable but he wasn\u0027t going to be the one to start it.\\n\\n Someone else did.\\n\\n Holden could hear raised voices, the angry rumble of the mob, followed by the electronically amplified voice of someone in a riot helmet yelling for people to get back. And then a gunshot, a brief pause, then a fusillade. People screamed. The entire crowd around Holden and Miller surged in two opposing directions, some of the people rushing toward the sound of the conflict, but many more of them running away from it. Holden spun in the current of bodies; Miller reached out and grabbed the back of his shirt, gripping it in his fist and yelling for Holden to stay close.\\n\\n About a dozen meters down the corridor, in a coffee shop seating area separated by a waist-high black iron fence, one of the mafia thugs had been cut off from his group by a dozen citizens. Gun drawn, he was backing up and yelling at them to move aside. They kept advancing, their faces wild with the drunken frenzy of mob violence.\\n\\n The mafia thug fired once, and one small body staggered forward, then fell to the ground at the thug\u0027s feet. Holden couldn\u0027t tell if it was a boy or a girl, but they couldn\u0027t be more than thirteen or fourteen years old. The thug moved forward, looking down at the small thin figure at his feet, and pointed his gun at them again.\\n\\n It was too much.\\n\\n Holden found himself running down the corridor toward the thug, gun drawn and screaming for people to get out of the way. When he was about seven meters away, the crowd split apart enough for him to begin firing. Half his shots went wild, hitting the coffee shop counter and walls, one round blowing a stack of ceramic plates into the air. But a few of them hit the thug, staggering him back.\\n\\n Holden vaulted the waist-high metal fence and came to a sliding halt about three meters from the fake cop and his victim. Holden\u0027s gun fired one last time and then the slide locked in the open position to let him know it was empty.\\n\\n The thug didn\u0027t fall down. He straightened up, looked down at his torso, and then looked up and pointed his gun at Holden\u0027s face. Holden had time to count the three bullets that were smashed against the heavy chest armor of the thug\u0027s riot gear. Die gloriously in a hail of bullets, he thought.\\n\\n The thug said, \"Stupid mother fu - \" and his head snapped back in a spray of red. He slumped to the floor.\\n\\n \"Gap at the neck, remember?\" Miller said from behind him. \"Chest armor\u0027s too thick for a pistol.\"\\n\\n Suddenly dizzy, Holden bent over at the waist, gasping for air. He tasted lemon at the back of his throat and swallowed twice to stop himself from throwing up. He was afraid it would be full of blood and stomach lining. He didn\u0027t need to see that.\\n\\n \"Thanks,\" he gasped out, turning his head toward Miller.\\n\\n Miller just nodded vaguely in his direction, then walked over to the guard and nudged him with one foot. Holden stood up and looked around the corridor, waiting for the inevitable wave of vengeful mafia enforcers to come crashing down on them. He didn\u0027t see any. He and Miller were standing in a quiet island of calm in the midst of Armageddon. All around them, tendrils of violence were whipping into high gear. People were running in every direction; the mafia goons were yelling in booming amplified voices and punctuating the threats with periodic gunfire. But there were only hundreds of them, and there were many thousands of angry and panicked civilians. Miller gestured at the chaos.\\n\\n \"This is what happens,\" he said. \"Give a bunch of yahoos the equipment, and they think they know what they\u0027re doing.\"\\n\\n Holden crouched beside the fallen child. It was a boy, maybe thirteen, with Asian features and dark hair. His chest had a gaping wound in it, blood trickling out instead of gushing. He didn\u0027t have a pulse that Holden could find. Holden picked him up anyway, looking around for someplace to take him.\\n\\n \"He\u0027s dead,\" Miller said as he replaced the cartridge he\u0027d fired.\\n\\n \"Go to hell. We don\u0027t know. If we can get him to the ship, maybe... \"\\n\\n Miller shook his head, a sad but distant expression on his face as he looked at the child in Holden\u0027s arms.\\n\\n \"He took high-caliber round to the center of mass,\" Miller said. \"He\u0027s gone.\"\\n\\n \"Fuck me,\" Holden said.\\n\\n \"You keep saying that.\"\\n\\n A bright neon sign flashed above the corridor that led out of the casino levels and onto the ramps down to the docks. THANK YOU FOR PLAYING, it read. And YOU\u0027RE ALWAYS A WINNER ON EROS. Below it, two ranks of men in heavy combat armor blocked the way. They might have given up on crowd control in the casinos, but they weren\u0027t letting anyone go.\\n\\n Holden and Miller crouched behind an overturned coffee cart a hundred meters from the soldiers. As they watched, a dozen or so people made a dash toward the guards and were summarily mowed down by machine gun fire, then fell to the deck beside those who had tried before.\\n\\n \"I count thirty-four of them,\" Miller said. \"How many can you handle?\"\\n\\n Holden spun to look at him in surprise, but Miller\u0027s face told him the former cop was joking.\\n\\n \"Kidding aside, how do we get past that?\" Holden said.\\n\\n \"Thirty men with machine guns and a clear line of sight. No cover to speak of for the last twenty meters or so,\" Miller said. \"We don\u0027t get past that.\" \\n\\n","sourceLink":"https://allnovel.net/leviathan-wakes-expanse-1/page-30.html","bookId":2454,"book":{"id":2454,"title":"Leviathan Wakes (Expanse #1)","description":"Storyline: Leviathan Wakes is a 2011 science fiction novel by James S. A. Corey (pen name of Daniel Abraham and Ty Franck) \\n Humanity has colonized the solar system - Mars, the Moon, the Asteroid Belt and beyond - but the stars are still out of our reach. \\n Jim Holden is XO of an ice miner making runs from the rings of Saturn to the mining stations of the Belt. When he and his crew stumble upon a derelict ship, \"The Scopuli,\" they find themselves in possession of a secret they never wanted. A secret that someone is willing to kill for - and kill on a scale unfathomable to Jim and his crew. War is brewing in the system unless he can find out who left the ship and why. \\n Detective Miller is looking for a girl. One girl in a system of billions, but her parents have money and money talks. When the trail leads him to \"The Scopuli\" and rebel sympathizer Holden, he realizes that this girl may be the key to everything. \\n Holden and Miller must thread the needle between the Earth government, the Outer Planet revolutionaries, and secretive corporations - and the odds are against them. But out in the Belt, the rules are different, and one small ship can change the fate of the universe.\\n","cover":"https://allnovel.net/images/leviathan-wakes-expanse-1.jpg","author":"James S.A. Corey","type":"Horror","source":"allnovel","link":"https://allnovel.net/leviathan-wakes-expanse-1.html","creation":"Oct 5, 2019 8:58:44 AM","modification":"Oct 5, 2019 4:26:48 PM"}}
