{"id":69986,"no":29,"title":"Page 29","content":"The question seemed to hang between them, heavy with implication. It was the “all right” that told her he was referring to something beyond the state of her car. “Okay,” she said almost flippantly, feeling more than a little light-headed. “So, tell me about this man who brings color back to my little girl’s cheeks,” Angelina Pasquale said to Carol as she carried a steaming plate of spaghetti to the table. Carol’s mother didn’t know how to cook for three or four; it was twelve or fifteen servings for each and every Sunday dinner. Her two older sisters lived in California now, and only Tony and Carol and their families came religiously for Sunday dinner. Her mother, however, continued to cook as if two or three additional families might walk in unannounced for the evening meal. “Mama, Alex Preston and I just met last week.” “That’s not what Peter said.” The older woman wiped her hands on the large apron tied around her thick waist. Her dark hair, streaked with gray, was tucked into a neat bun. She wore a small gold crucifix that had been given to her by Carol’s father forty-two years earlier. Carol brought the long loaves of hot bread from the oven. “Alex is Jim’s father. You remember Peter’s friend, don’t you?” “He’s not Italian.” “I don’t know what he is. Preston might be an English name.” “English,” Angelina said as if she was spitting out dirty dishwater. “You gonna marry a non-Italian again?” “Mama,” Carol said, silently laughing, “Alex helped me when my car broke down. I owe him dinner, and I insisted on taking him out to repay him. We’re not stopping off at the church to get married on the way.” “I bet he’s not even Catholic.” “Mama,” Carol cried. “I haven’t the faintest clue where he attends church.” “You taking a man to dinner instead of cooking for him is bad enough. But not even knowing if he’s Catholic is asking for trouble.” She raised her eyes as if pleading for patience in dealing with her youngest daughter; when she lowered her gaze, they fell to Carol’s feet. She folded her hands in prayerlike fashion. “You wear pointed-toe shoes for this man?” “I didn’t wear these for Alex. I happen to like them—they’re in style.” “They’re gonna deform your feet. One day, you’ll trip and end up facedown in the gutter like your cousin Celeste.” “Mama, I’m not going to end up in a gutter.” “Your cousin Celeste told her mother the same thing, and we both know what happened to her. She had to marry a foot doctor.” “Mama, please don’t worry about my shoes.” “Okay, but don’t let anyone say your mama didn’t warn you.” Carol had to leave the room to keep from laughing. Her mother was the delight of her life. She drove Carol crazy with her loony advice, but Carol knew it was deeply rooted in love. “Carol,” Angelina said, surveying the table, “tell everyone dinner’s ready.” Peter was in the living room with his younger cousins, who were watching the Dodgers play Kansas City in a hotly contested baseball game. “Dinner’s on the table, guys.” “Just a minute, Mom. It’s the bottom of the eighth, with two out.” Peter’s intense gaze didn’t waver from the screen. “Besides, Uncle Tony and Aunt Paula aren’t back from shopping yet.” “They’ll eat later.” Carol’s brother Tony and his wife had escaped for the afternoon to Clackamas Town Center, a large shopping mall south of Portland, and they weren’t expected back until much later. “Just a few more minutes,” Peter pleaded. “Mama made zabaglione,” Carol said. The television went off in a flash, and four children rushed into the dining room, taking their places at the table like a rampaging herd of buffalo. Peter was the oldest by six years, which gave him an air of superiority over his cousins. Sunday dinner at her mother’s was tradition. They were a close-knit family and helped one another without question. Her brother had lent her his second car while hers was being repaired. Carol didn’t know what she’d do without him. She’d have her own car back in a few days, but Tony’s generosity had certainly made her life easier. Mama treasured these times with her children and grandchildren, generously offering her love, her support and her pasta. Being close to her family was what had gotten Carol through the difficult years following Bruce’s death. Her parents had been wonderful, helping her while she worked her way through college and the nursing program, caring for Peter when she couldn’t and introducing her to a long list of nice Italian men. But after three years of dealing with Bruce’s mental and physical abuse, she wasn’t interested. The scars from her marriage ran deep. “I’ll say grace now,” Angelina said. They all bowed their heads and closed their eyes. No one needed any encouragement to dig into the spaghetti drenched in a sauce that was like no other. Carol’s mother was a fabulous cook. She insisted on making everything from scratch, and she’d personally trained each one of her three daughters. “So, Peter,” his grandmother said, tearing off a thick piece from the loaf of hot bread. “What do you think of your mother marrying this Englishman?” “Aw, Grandma, it’s not like that. Mr. Preston called and Mom’s treating him to dinner ’cause he gave her a ride home. I don’t think it’s any big deal.” “That was what she said when she met your father. ‘Ma,’ she told me, ‘it’s just dinner.’ The next thing I know, she’s standing at the altar with this non-Italian and six months later the priest was baptizing you.” “Ma! Please,” Carol cried, embarrassed at the way her mother spoke so freely—although by now she should be used to it. “Preston.” Her mother muttered the name again, chewing it along with her bread. “I could accept the man if he had a name like Prestoni. Carol Prestoni has a good Italian ring to it…but Preston. Bah.” Peter and Carol exchanged smiles. “He’s real nice, Grandma.” Angelina expertly wove the long strands of spaghetti around the tines of her fork. “Your mama deserves to meet a nice man. If you say he’s okay, then I have to take your word for it.” “Mama, it’s only one dinner.” Carol wished she’d never said anything to her mother. Alex had called the night before, and although he sounded a little disappointed that she wouldn’t be making the meal herself, he’d agreed to let her repay the favor with dinner at a local restaurant Monday night. Her big mistake was mentioning it to her mother. Carol usually didn’t say anything to her family when she was going out on a date. But for some reason, unknown even to herself, she’d mentioned Alex as soon as she’d walked in the door after church Sunday morning. “What color eyes does this man have?” “Gray,” Carol answered and poured herself a glass of ice water. Peter turned to his mother. “How’d you remember that?” “I…I just recall they were…that color.” Carol felt her cheeks flush. She concentrated on her meal, but when she looked up, she saw her mother watching her closely. “His eyes are sort of striking,” she said, mildly irritated by the attention her mother and her son were lavishing on her. “I never noticed,” Peter said. “A boy wouldn’t,” Angelina told him, “but your mother, well, she looks at such things.” That wasn’t entirely true, but Carol wasn’t about to claim otherwise. As soon as they were finished with the meal, Carol’s mother brought out the zabaglione, a rich sherry-flavored Italian custard thick with eggs. Angelina promptly dished up six bowls. “Mama, zabaglione’s high in fat and filled with cholesterol.” Since her father’s death from a heart attack five years earlier, Carol worried about her mother’s health, although she wasn’t sure her concern was appreciated. “So zabaglione’s got cholesterol.” “But, Mama, cholesterol clogs the veins. It could kill you.” “If I can’t eat zabaglione, then I might as well be dead.” Smiling wasn’t what Carol should have done, but she couldn’t help it. When the dishes were washed and the kitchen counters cleaned, Carol and her mother sat in the living room. Angelina rocked in the chair her mother’s mother had brought from Italy seventy years earlier. Never one for idle hands, she picked up her crocheting. It was a rare treat to have these moments alone with her mother, and Carol sat on the sofa, feet tucked under her, head back and eyes closed. “When am I gonna meet this Englishman of yours?” “Mama,” Carol said with a sigh, opening her eyes, “you’re making me sorry I ever mentioned Alex.” “You didn’t need to tell me about him. I would have asked because the minute you walked in the house I could see a look in your eyes. It’s time, my bambina. Peter is growing and soon you’ll be alone.” “I…I’m looking forward to that.” Her mother discredited that comment with a shake of her head. “You need a husband, one who will give you more children and bring a sparkle to your eyes.” Carol’s heart started thundering inside her chest. “I…I don’t think I’ll ever remarry, Mama.” “Bah!” the older woman said. A few minutes later, she murmured something in Italian that Carol could only partially understand, but it was enough to make her blush hotly. Her mother was telling her there were things about a man that she shouldn’t be so quick to forget. The soft Italian words brought a vivid image to Carol’s mind—an image of Alex holding her in his arms, gazing down at her, making love to her. It shocked her so much that she quickly made her excuses, collected Peter and drove home. Her pulse rate hadn’t decreased by the time she arrived back at her own small house. Her mother was putting too much emphasis on her dinner date with Alex…far more than necessary or appropriate. As soon as Peter went over to a neighbor’s to play video games, Carol reached for the phone. When voice mail kicked in on the fourth ring, she immediately hung up. On second thought, this was better, she decided, and dialed again, planning to leave a message. “You’re a coward,” she muttered as she pushed down the buttons. Once more the recorded message acknowledged her call. She waited for the greeting, followed by a long beep. “Hello…Alex, this is Carol…Carol Sommars. About our dinner date Monday night…I’m sorry, but I’m going to have to cancel. Something…has come up. I apologize that thisissuchshortnotice. Bye.” The last words tumbled together in her haste to finish. Her face was flushed, and sweat had beaded on her upper lip as she hung up the phone. With her hand on the receiver, she slowly expelled her breath.","sourceLink":"https://allnovel.net/right-next-door/page-29.html","bookId":1962,"book":{"id":1962,"title":"Right Next Door","description":"Storyline: Right Next Door (The Courtship of Carol Sommars \u0026 Father\u0027s Day) The Courtship of Carol Sommars Peter Sommars is fifteen, and what he needs is a little more independence. Which is why he\u0027d like his mom, Carol, to start dating. He even knows the perfect man Alex Preston, his best friend\u0027s dad. As it turns out, Alex is interested, but Carol\u0027s doing everything she can to sidestep his pursuit. Which only makes Alex and the boys more determined! Father\u0027s Day Robin Masterson\u0027s ten-year-old son, Jeff, figures he needs a dog more than anything in the world. And there just happens to be one right next door! But the friendly black Lab belongs to Cole Camden, the unfriendliest man in the neighborhood. Still, Jeff persists…and soon his mom and Cole are looking at each other in a whole new way.","cover":"https://allnovel.net/images/right-next-door.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/right-next-door.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:14:22 AM"}}
