{"id":69998,"no":41,"title":"Page 41","content":"“Alex.” She tore her lips from his. “Alex,” she breathed again, almost panting. “Something’s wrong….” She could feel his breath against her neck and his fingers in her hair, directing her mouth back to his, kissing her with such heat, Carol thought she’d disintegrate. Her tears came in earnest then, a great profusion that had been building inside her for years. Long, lonely, barren years. With the tears came pain, pain so intense she could hardly breathe. Agony spilled from her heart. The trauma that had been buried within her stormed out in a torrent of tears that she could no more stop than she could control. Huge sobs shook her shoulders, giant hiccupping sobs that she felt all the way to her toes. Sobs that depleted her strength. Her breathing was ragged as she stumbled toward the edge of hysteria. Alex was speaking to her in soft, reassuring whispers, but Carol couldn’t hear him. It didn’t matter what he said. Nothing mattered. She clutched his shirt tighter and tighter. Soon there were no more tears to shed, no more emotion to be spent. Alex continued to hold her. He slid his arms all the way around her, and although she couldn’t understand what he was saying, his voice was gentle. Once the desperate crying had started to subside, Carol drew in giant gulps of air in a futile effort to gain control of herself. Slowly Alex guided her to the sofa and sat her down, then gathered her in his arms and held her tenderly. Time lost meaning to Carol until she heard the clock chime midnight. Until then she was satisfied with being held in Alex’s arms. He asked no questions, demanded no explanations. He simply held her, offering comfort and consolation. This newfound contentment in his arms was all too short-lived, however. Acute embarrassment stole through the stillness, and fresh tears stung Carol’s eyes. Her mind, her thoughts, her memories were steeped in emotions too strong to bear. “I…I’ll make some coffee,” she whispered, unwinding her arms from him, feeling she had to escape. “Forget the coffee.” She broke away and got shakily to her feet. Before he could stop her, she hurried into the kitchen and supported herself against the counter, not sure if she could perform the uncomplicated task of making a pot of coffee. Alex followed her into the darkened room. He placed one hand on her shoulder and gently turned her around, so she had no choice but to face him. “I want to talk about what happened.” “No…please.” She leveled her eyes at the floor. “We need to talk.” “No.” She shook her head emphatically. “Not now. Please not now.” A long, desperate moment passed before he gently kissed the crown of her head. “Fine,” he whispered. “Not now. But soon. Very soon.” Carol doubted she could ever discuss what had happened between them, but she didn’t have the strength or the courage to say so. That would only have invited argument. “I…I think you should go.” His nod was reluctant. “Will you be all right?” “Yes.” A bold-faced lie if ever there was one. She would never be the same again. She was mortified to the very marrow of her bones by her behavior. How could she ever see him again? And then the pain, the memories came rushing back… No, she wouldn’t be all right, but she’d pretend she was, the same way she’d been pretending from the moment she married Bruce. The message waiting for Alex when he returned to his office the following afternoon didn’t come as any surprise. His secretary handed him the yellow slip, and the instant he saw Carol’s name, he knew. She was working late that evening and asked if he could pick up Peter from track and drop him off at the house. The little coward! He sat at his desk, leaned back in his chair and frowned. He hadn’t wanted to leave her the night before. Hadn’t wanted to walk out of her kitchen without being assured she was all right. Carol, however, had made it clear that she wanted him to leave. Equally apparent was the fact that his being there had only added to her distress. Whatever Carol was facing, whatever ghost she’d encountered, was ugly and traumatic. So he’d left. But he hadn’t stopped thinking about her all day. The thought of her had filled every waking minute. Even now, hours later, he could remember in vivid detail the way she’d started to unfold and blossom right before his eyes. Because of him. For him. His frown deepened. She’d never talked about her marriage. Alex assumed it had to be the source of her anguish, but he didn’t know why. He didn’t even know her late husband’s name. Questions bombarded him, and he cursed the lack of answers. And now, his sweet coward had gone into hiding. “Will you talk to her, Mr. Preston?” Peter begged as he climbed inside the van in the school parking lot. “Mom’s never gone camping, and I think she’d probably like it if she gave it half a chance.” “I’ll talk to her,” Alex promised. Peter sighed with relief. “Good.” Sounding both confident and proud, James said, “My dad can be persuasive when he wants to be.” Alex intended to be very persuasive. “I tried to reason with Mom this morning, and you know what she said?” Peter’s changing voice pitched between two octaves. “What?” “She said she didn’t want to talk about it. Doesn’t that sound just like a woman? And I thought Melody Wohlford was hard to understand.” Alex stifled a chuckle. “I’ll tell you boys what I’m going to do. We’ll pick up hamburgers on the way home, and I’ll drop you both off at my house. Then I’ll drive over to your place, Peter, and wait for your mother there.” “Great idea,” James said, nodding his approval. “But while I’m gone, I want you boys to do your homework.” “Sure.” “Yeah, sure,” James echoed. “Just do whatever it takes to convince Mrs. Sommars to come on our camping trip.” “I’ll do everything I can,” Alex said. Carol let herself in the front door, drained from a long, taxing day at the hospital and exhausted from the sleepless night that had preceded it. That morning, she’d been tempted to phone in sick, but with two nurses already out due to illness, there wasn’t anyone to replace her. So she’d gone to work feeling emotionally and physically hungover. “Peter, I’m home,” she called. “Peter?” Silence. Walking into the kitchen, she deposited her purse on the counter and hurried toward her son’s bedroom. She’d contacted Alex and asked that he bring Peter home, with instructions to phone back if he couldn’t. She hadn’t heard from him, so she’d assumed he’d pick up her son and drop him off at the house. Peter’s room was empty, his bed unmade. An array of clean and dirty clothes littered his floor. Everything was normal there. This was what she got for trying to avoid Alex, Carol mused, chastising herself. Peter was probably still waiting at the high school track, wondering where she could possibly be. Sighing, she hurried back into the kitchen and reached for her purse. She had to get him his own cell phone, she decided—it would help in situations like this. The doorbell rang as she walked through the living room. Impatiently she jerked open the door and her eyes collided with Alex’s. She gasped. “Hello again,” he said in the warm, husky way that never failed to affect her. “I didn’t mean to startle you.” “You didn’t.” He had, but she wasn’t about to admit it. “Apparently you didn’t get my message…. Peter must still be at the school.” “No. He’s at my house with James.” “Oh.” That hardly expressed the instant dread she felt. They were alone, and there was no escape, at least not by the most convenient means—Peter. Alex stepped into the house and for the first time, she noticed he was carrying a white paper bag. Her gaze settled on it and she frowned. “Two Big Macs, fries and shakes,” he explained. “For whom?” Alex arched his eyebrows. “Us.” “Oh…” He honestly expected her to sit down and eat with him? It would be impossible. “I’m not hungry.” “I am—very hungry. If you don’t want to eat, that’s fine. I will, and while I’m downing my dinner, we can talk.” It wouldn’t do any good to argue, and Carol knew it. Without another word, she turned and walked to the kitchen. Alex followed her, and his movements, as smooth and agile as always, sounded thunderous behind her. She was aware of everything about him. When he walked, when he breathed, when he moved. His eyes seemed to bore holes in her back, but she ignored the impulse to turn and face him. She couldn’t bear to look him in the eye. The memory of what had happened the night before made her cheeks flame. “How are you?” he asked in that husky, caring way of his. “Fine,” she answered cheerfully. “And you?” “Not so good.” “Oh.” Her heart was pounding, clamoring in her ears. “I’m…sorry to hear that.” “You should be, since you’re the cause.” “Me? I’m…sure you’re mistaken.” She got two plates from the cupboard and set them on the table. As she stepped past him, Alex grabbed her hand. “I don’t want to play word games with you. We’ve come too far for that…and we’re going a lot further.” Unable to listen to his words, she closed her eyes. “Look at me, Carol.” She couldn’t do it. She lowered her head, eyes still shut. “There’s no need to be embarrassed.” Naturally he could afford to be generous. He wasn’t the one who’d dissolved in a frenzy of violent tears and emotion. She was just grateful that Peter had slept through the whole episode. “We need to talk.” “No…” she cried and broke away. “Couldn’t you have ignored what happened? Why do you have to drag it up now?” she demanded. “Do you enjoy embarrassing me like this? Do you get a kick out of seeing me miserable?” She paused, breathless, her chest heaving. “Please, just go away and leave me alone.” Her fierce words gave birth to a brief, tense silence. Grasping her chin between his thumb and forefinger, Alex lifted her head. Fresh emotion filled her chest, knotting in her throat as her eyes slid reluctantly to his. “I don’t know what happened last night,” he said. “At least not entirely.” His voice was gruff, angry, emotional. “All I know is that I’ve never felt closer to anyone than I did to you—and I’ve never felt more helpless. But we’ve got something special, Carol, and I refuse to let you throw it away. Understand?” She bit her lower lip, sniffled, then slowly nodded. The tension eased from Alex, and he reached for her, gently taking her in his arms. She went without question, hiding her face against his neck.","sourceLink":"https://allnovel.net/right-next-door/page-41.html","bookId":1962,"book":{"id":1962,"title":"Right Next Door","description":"Storyline: Right Next Door (The Courtship of Carol Sommars \u0026 Father\u0027s Day) The Courtship of Carol Sommars Peter Sommars is fifteen, and what he needs is a little more independence. Which is why he\u0027d like his mom, Carol, to start dating. He even knows the perfect man Alex Preston, his best friend\u0027s dad. As it turns out, Alex is interested, but Carol\u0027s doing everything she can to sidestep his pursuit. Which only makes Alex and the boys more determined! Father\u0027s Day Robin Masterson\u0027s ten-year-old son, Jeff, figures he needs a dog more than anything in the world. And there just happens to be one right next door! But the friendly black Lab belongs to Cole Camden, the unfriendliest man in the neighborhood. Still, Jeff persists…and soon his mom and Cole are looking at each other in a whole new way.","cover":"https://allnovel.net/images/right-next-door.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/right-next-door.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:14:22 AM"}}
