{"id":103280,"no":6,"title":"Page 6","content":"“I know you did!” he said, almost crying. “I need your help! He tied my feet together, all tangled up–and I think he’s trying to hurt Dr. Smeeks!” “Tangled, did he? Oh, that vicious little changeling,” she said, almost wheezing with exertion. She let go of whatever was holding her up, and Edwin heard her feet land back on the floor with a thump. She said through the door’s frame, beside its hinges, “You must let me out, little boy. If you let me out, I’ll come and help your doctor. I know what to do with changelings.” It was a bad thought, and a bad plan. It was a bad thing to consider and Edwin knew it all too well; but when he looked back over his shoulder at the nurse’s station with the old lady snoring within, and when he thought of the clattering automaton roaming the laboratory darkness with his dear Dr. Smeeks, he leaped at the prospect of aid. He reached for the lever to open the door and hung from it, letting it hold his full weight while he reached up to undo the lock. Edwin no sooner heard the click of the fastener unlatching then the door burst open in a quick swing that knocked him off his hobbled feet. With a smarting head and bruised elbow he fought to stand again but Madeline grabbed him by the shoulder. She lifted him up as if he were as light as a doll, and she lugged him down the hallway. Her cotton shift billowed dirtily behind her, and her hair slapped Edwin in the eyes as she ran. Edwin squeezed at her arm, trying to hold himself out of the way of the displaced gurneys and medical trays that clogged the hall; but his airborne feet smacked the window of the nurse’s station as Madeline swiftly hauled him past it, awakening the nurse and startling her into motion. If Madeline noticed, she did not stop to comment. She reached the top of the stairs and flung herself down them, her feet battering an alternating time so fast that her descent sounded like firecrackers. Edwin banged along behind her, twisted in her grip and unable to move quickly even if she were to set him down. He wondered if he hadn’t made an awful mistake when she all but cast him aside. His body flopped gracelessly against a wall. But he was back on his feet in a moment and there was light in the laboratory–a flickering, uncertain light that was moving like mad. Dr. Smeeks was holding it; he’d found his light after all, and he’d raised the wick on the hurricane lamp. The glass-jarred lantern gleamed and flashed as he swung it back and forth, sweeping the floor for something Edwin couldn’t see. The doctor cried out, “Parker? Parker? Something’s here, something’s in the laboratory!” And Edwin answered, “I know, sir! But I’ve brought help!” The light shifted, the hurricane lamp swung, and Madeline was standing in front of the doctor–a blazing figure doused in gold and red, and black-edged shadows. She said nothing, but held out her hand and took the doctor’s wrist; she shoved his wrist up, forcing the lamp higher. The illumination increased accordingly and Edwin started to cry. The laboratory was in a disarray so complete that it might never be restored to order. Glass glimmered in piles of dust, shattered tubes and broken beakers were smeared with the shining residue of the blue-green substance that lived and glowed in the dark. It spilled and died, losing its luminescence with every passing second–and there was the doctor, his hand held aloft and his lamp bathing the chaos with revelation. Madeline turned away from him, standing close enough beneath the lamp so that her shadow did not temper its light. Her feet twisted on the glass-littered floor, cutting her toes and leaving smears of blood. She demanded, “Where are you?” She was answered by the tapping of marching feet, but it was a sound that came from all directions at once. And with it came a whisper, accompanied by the grinding discourse of a metal jaw. “Tan…gles. Tan…gles…feet. Tanglefoot.” “That’s your name then? Little changeling–little Tanglefoot? Come out here!” she fired the command into the corners of the room and let it echo there. “Come out here, and I’ll send you back to where you came from! Shame on you, taking a boy’s friend. Shame on you, binding his feet and tormenting his master!” Tanglefoot replied, “Can…op…en…er” as if it explained everything, and Edwin thought that it might–but that it was no excuse. “Ted, where are you?” he pleaded, tearing his eyes away from Madeline and scanning the room. Upstairs he could hear the thunder of footsteps–of orderlies and doctors, no doubt, freshly roused by the night nurse in her chamber. Edwin said with a sob, “Madeline, they’re coming for you.” She growled, “And I’m coming for him.” She spied the automaton in the same second that Edwin saw it–not on the ground, marching its little legs in bumping patterns, but overhead, on a ledge where the doctor kept books. Tanglefoot was marching, yes, but it was marching towards them both with the doctor’s enormous scissors clutched between its clamping fingers. “Ted!” Edwin screamed, and the machine hesitated.The boy did not know why, but there was much he did not know and there were many things he’d never understand…including how Madeline, fierce and barefoot, could move so quickly through the glass. The madwoman seized the doctor’s hurricane lamp by its scalding cover, and Edwin could hear the sizzle of her skin as her fingers touched, and held, and then flung the oil-filled lamp at the oncoming machine with the glittering badger eyes. The lamp shattered and the room was flooded with brilliance and burning. Dr. Smeeks shrieked as splatters of flame sprinkled his hair and his nightshirt, but Edwin was there–shuffling fast into the doctor’s sleeping nook. The boy grabbed the top blanket and threw it at the doctor, then he joined the blanket and covered the old man, patting him down. When the last spark had been extinguished he left the doctor covered and held him in the corner, hugging the frail, quivering shape against himself while Madeline went to war. Flames were licking along the books and Madeline’s hair was singed. Her shift was pocked with black-edged holes, and she had grabbed the gloves Dr. Smeeks used when he held his crucibles. They were made of asbestos, and they would help her hands. Tanglefoot was spinning in place, howling above their heads from his fiery perch on the book ledge. It was the loudest sound Edwin had ever heard his improvised friend create, and it horrified him down to his bones. Someone in a uniform reached the bottom of the stairs and was repulsed, repelled by the blast of fire. He shouted about it, hollering for water. He demanded it as he retreated, and Madeline didn’t pay him a fragment of attention. Tanglefoot’s scissors fell to the ground, flung from its distracted hands. The smoldering handles were melting on the floor, making a black, sticky puddle where they settled. With her gloved hands she scooped them up and stabbed, shoving the blades down into the body of the mobile inferno once named Ted. She withdrew the blades and shoved them down again because the clockwork boy still kicked, and the third time she jammed the scissors into the little body she jerked Ted down off the ledge and flung it to the floor. The sound of breaking gears and splitting seams joined the popping gasp of the fire as it ate the books and gnawed at the ends of the tables. “A blanket!” Madeline yelled. “Bring me a blanket!” Reluctantly, Edwin uncovered the shrouded doctor and wadded the blanket between his hands. He threw the blanket to Madeline. She caught it, and unwrapped it enough to flap it down atop the hissing machine, and she beat it again and again, smothering the fire as she struck the mechanical boy. Something broke beneath the sheet, and the chewing tongues of flame devoured the cloth that covered Tanglefoot’s joints–leaving only a tragic frame beneath the smoldering covers. Suddenly and harshly, a bucket of water doused Madeline from behind. Seconds later she was seized. Edwin tried to intervene. He divided his attention between the doctor, who cowered against the wall, and the madwoman with the bleeding feet and hair that reeked like cooking trash. He held up his hands and said, “Don’t! No, you can’t! No, she was only trying to help!” And he tripped over his own feet, and the pile of steaming clockwork parts on the floor. “No,” he cried, because he couldn’t speak without choking. “No, you can’t take her away. Don’t hurt her, please. It’s my fault.” Dr. Williams was there, and Edwin didn’t know when he’d arrived. The smoke was stinging his eyes and the whimpers of Dr. Smeeks were distracting his ears, but there was Dr. Williams, preparing to administer a washcloth soaked in ether to Madeline’s face. Dr. Williams said to his colleague, a burly man who held Madeline’s arms behind her back, “I don’t know how she escaped this time.” Edwin insisted, “I did it!” But Madeline gave him a glare and said, “The boy’s as daft as his mother. The clockwork boy, it called me, and I destroyed it. I let myself out, like the witch I am and the fiend you think I must be–” And she might’ve said more, but the drug slipped up her nostrils and down her chest, and she sagged as she was dragged away. “No,” Edwin gulped. “It isn’t fair. Don’t hurt her.” No one was listening to him. Not Dr. Smeeks, huddled in a corner. Not Madeline, unconscious and leaving. And not the bundle of burned and smashed parts in a pile beneath the book ledge, under a woolen covering. Edwin tried to lift the burned-up blanket but pieces of Ted came with it, fused to the charred fabric. Nothing moved, and nothing grumbled with malice in the disassembled stack of ash-smeared plates, gears, and screws. Edwin returned to the doctor and climbed up against him, shuddering and moaning until Dr. Smeeks wrapped his arms around the boy to say, “There, there. Parker it’s only a little fire. I must’ve let the crucible heat too long, but look. They’re putting it out now. We’ll be fine.” The boy’s chest seized up tight, and he bit his lips, and he sobbed.","sourceLink":"https://allnovel.net/tanglefoot-the-clockwork-century-1-2/page-6.html","bookId":1673,"book":{"id":1673,"title":"Tanglefoot (The Clockwork Century #1.2)","description":"Storyline: Tanglefoot (The Clockwork Century #1.2) Stonewall Jackson survived Chancellorsville. England broke the Union’s naval blockade, and formally recognized the Confederate States of America. Atlanta never burned. It is 1880. The American Civil War has raged for nearly two decades, driving technology in strange and terrible directions. Combat dirigibles skulk across the sky and armored vehicles crawl along the land. Military scientists twist the laws of man and nature, and barter their souls for weapons powered by light, fire, and steam. But life struggles forward for soldiers and ordinary citizens. The fractured nation is dotted with stricken towns and epic scenes of devastation–some manmade, and some more mysterious. In the western territories cities are swallowed by gas and walled away to rot while the frontiers are strip-mined for resources. On the borders between North and South, spies scour and scheme, and smugglers build economies more stable than their governments. This is the Clockwork Century. It is dark here, and different.","cover":"https://allnovel.net/images/tanglefoot-the-clockwork-century-1-2.jpg","author":"Cherie Priest","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/tanglefoot-the-clockwork-century-1-2.html","creation":"Oct 5, 2019 8:57:51 AM","modification":"Oct 5, 2019 10:23:03 PM"}}
