{"id":87816,"no":18,"title":"Page 18","content":"\n \"Boys suck,\" Trish whispered when he turned away.\n \"Truth,\" I said, grateful for her support.\n We weren\u0027t as successful at scoring as the opposing team, thankfully through no fault of mine at least. Dean\u0027s team scored again on their next handoff. This time it was Travis who scored. Pete was practically foaming at the mouth as he barked out orders to us.\n \"Take a chill pill, Pete,\" Dean said as we lined up at the line of scrimmage.\n \"Worry about your own team, dickwad,\" Pete retorted, obviously taking the game way more seriously than needed.\n I watched as Trish and Dean exchanged a look, making it clear I wasn\u0027t the only one who thought he was acting like an asshole.\n Our team continued to falter as the game progressed. For the most part, the rest of my team didn\u0027t care as they horsed around. Pete\u0027s mood, on the other hand, continued to deteriorate as we fell further behind. My earlier assumption of him proved to be accurate as he tried to embellish the rules as the game progressed. He griped about penalties, even though it was just for fun, and claimed to be farther down the field than he actually was whenever he got tackled. The mean person in me was secretly pleased that we were losing since his condescending tone was enough to set me teeth on edge.\n \"It\u0027s about time to eat, guys,\" a petite round woman called from the front of the house.\n \"One more play, Mom,\" one of the guys on my team yelled back.\n \"This is it. We can\u0027t win, but we can come out of this without looking like complete pussies,\" Pete said when we were huddled together. \"I think we should hand the ball off to Madison. They won\u0027t expect her to have it since she\u0027s done nothing but stand around the whole game,\" he said sarcastically.\n How \u0027bout I just kick you in the face? I thought. It probably wouldn\u0027t be the best thing to knock his teeth down his throat in front of so many witnesses. Trish, though, didn\u0027t have the same qualms as me as she reached over and socked him hard in the arm.\n \"You\u0027re a prick, Pete,\" she said after she hit him.\n \"And you\u0027re a bitch,\" he shot back, glaring at her as he rubbed the spot where she had punched him.\n \"All right, can we get along for one more play,\" the guy from earlier said. \"Even though he has as much tact as a jackass, Pete\u0027s got a point. If we hand the ball off to Madison, we might have a chance of scoring a touchdown. You up for that?\" he asked.\n \"Sure, it\u0027s at least worth a try,\" I lied.\n \"All right then, let\u0027s go out as the losers who didn\u0027t give up,\" he said, slapping me on the back.\n Gnashing my teeth together, I didn\u0027t allow myself to react to his touch. They were the touchiest freaking people I\u0027d ever met. Was it too much to ask for a germaphobe in the group?\n Lining back up at the line of scrimmage for the last time, I immediately saw that our plan would be a bust when Dean lined up directly across from me. He grinned knowingly.\n I arched my eyebrows at him, returning his taunt. His eyes never left mine, making my heart thump just a little faster in my chest. I could hear Pete counting down the play off to my left, but the words were more of a nuisance as Dean\u0027s eyes continued to suck me in.\n I was jerked back to the game when a ball was thrust in my hands and Pete was hissing in my ear to run. Darting around Dean, I took off running with the ball tucked tightly against my chest. Seeing the end zone free of defensive players, I ran full out as exhilaration shot through me. Victory was mine for the taking as I crossed into the end zone.\n My triumph was cut short when I was tackled from behind by Dean. Together we crashed to the ground. Dean kept his arms around me to cushion the fall, but the air was still knocked out of me as we landed in a heap.\n \"You okay?\" Dean asked concerned as I gasped slightly for air.\n I nodded as air finally made its way into my chest.\n \"Sorry, Mads. I didn\u0027t mean to knock you down so hard. You were going a little faster than I thought,\" he said, reaching out to softly stroke my cheek. Concentrating on breathing became even more difficult as I realized that he was sprawled on top of me. For the briefest moment, it felt good to feel the weight of his body on mine as I studied his lips, silently wishing they would touch mine. Seeing the acceptance in my eyes, he leaned in closer, letting all his weight rest on me. Then suddenly, with a flip of some kind of inner switch, his weight no longer felt good as it pinned me against the ground, making it impossible to move. I panicked, pushing and shoving at him to try and dislodge his weight from mine. My ears were filled with a weird whining noise that only added to my hysteria.\n Confusion clouded Dean\u0027s eyes as he lifted himself off me. I wanted to tell him I was okay. I needed to tell him it wasn\u0027t him, it was me. Any words I could have uttered were drowned out by the strange sound ricocheting through my ears. I tried to remember if I hit my head when we had crashed to the ground.\n \"Madison, it\u0027s okay,\" he said, kneeling beside me.\n I wondered if he was hearing the buzzing noise also.\n \"Madison, it\u0027s okay,\" he repeated, looking panic stricken over his shoulder.\n Understanding slowly dawned on me. The strange noise was coming from my own throat. Clamping my hand over my mouth, I stifled the noise with the palm of my hand. Instantly, the buzzing in my ears ceased.\n \"Is she okay, D?\" I heard Trish ask as she came up behind Dean.\n Oh, here we go, I thought. This was when my inner freak would shine through.\n \"Yeah, just got the wind knocked out of her,\" Dean answered, covering for me. \"Go ahead and wash up. We\u0027ll be inside in a minute.\"\n \"Way to go, dip,\" Trish chastised him. \"Good job, Madison,\" she added, beaming down at me.\n I nodded, not trusting myself to try actual speech yet.\n \"You okay?\" Dean asked for the third time after she walked away.\n \"Just trying to give your family the full freak show,\" I mumbled, slowly sitting up.\n \"Here, let me help you,\" he said, reaching out a hand to pull me to my feet. \"What happened?\" he finally asked when I was standing in front of him.\n \"I don\u0027t know, Sport-o. Could it be that you knocked the air out of me, and then proceeded to crush my lungs with your weight?\" I retorted, going for the defensive as anger swirled up inside me. I had nothing to apologize for. He was the one that was changing the rules midway in. It wasn\u0027t my fault.\n \"Cut the shit,\" he said, grabbing my shoulders so I couldn\u0027t walk away. \"What. Happened?\" he asked, emphasizing his words.\n All fight went out of me as my shoulders drooped underneath his hands. \"I don\u0027t know,\" I answered honestly. I didn\u0027t understand my panic. I thought I was adjusting to his touch, at least enough where I didn\u0027t freak if his skin touched mine.\n \"What happened to you?\" he asked quietly, stepping closer to me.\n \"It\u0027s not what happened to me, it\u0027s what I did,\" I said, pulling away from him.\n \"Madison, are you okay, dear?\" Sarah asked, coming around the house to join us.\n \"Yeah, I just go the air knocked out of me,\" I answered, not looking at Dean.\n \"You poor thing. That\u0027s the worst feeling ever,\" she said, putting an arm around my shoulder. \"I\u0027m sure my son is to blame,\" she said knowingly.\n I nodded as she led me around the house.\n \"Men, they always like to use brute force,\" she ridiculed, glaring at her son.\n \"Hey, it was an accident,\" Dean defended himself.\n Chapter seventeen\n So far, Thanksgiving with the Jackson clan was different than anything I had ever experienced, and dinner was no exception. It was every bit as loud and chaotic as Dean had predicted, but I couldn\u0027t help responding to it like a flower in the sun. All of the laughter, cheer and obviously genuine love had me forgetting my anxiety from earlier.\n Dozens of conversations went on at the same time around me as I soaked it all in. The food was mouthwatering, and I was surprised to learn that Dean was responsible for the deep fried turkeys that made up the main course. He was a guy of many talents.\n \"What do you think?\" Dean asked, leaning over so I could hear him over the noise.\n \"It\u0027s crazy,\" I said, relieved he was willing to forget about my meltdown. \"But in a good way,\" I added. \"There\u0027s so many conversations going on, I feel like my head is spinning.\"\n \"Yep, this is us. For the most part, we all get along and enjoy spending time together, with the exception of a few,\" he said.\n \"Pete?\" I asked, smiling at him.\n \"Yeah. Every family\u0027s got one. Pete definitely pushes the limits of \u0027blood is thicker than water.\u0027 As my papaw would say, \u0027the apple doesn\u0027t fall far from the tree.\u0027 With Pete, that\u0027s dead-on, his mom is a piece of work too. No get-together is complete until she adds a dose of her drama to it. Needless to say, we were all glad when she ran off with her trainer, including my uncle Phil, who had been looking for an out for years. Pete\u0027s had a chip on his shoulder since she left, which is why we all cut him a little slack, even though I know my Papaw is itching to take a switch to him like he used to when we were younger.\"\n I couldn\u0027t help laughing at the mental picture of the tiny old man at the head of our long table chasing Pete around to give him a beat down. \"I think your Papaw would have a tough time with that.\"\n \"Oh, don\u0027t be fooled by his stature. Papaw is a tough old bird. I heard he brought a man a quarter of his age to the ground when he ran his grocery cart into the back of my Nana\u0027s legs, knocking her down. According to my uncle John, who had to pick Papaw up at the police station after the incident, Papaw knocked the guy down by pegging him in the head with a can of green beans. Knocked the guy out flat.\"\n \"What?\" I gasped, looking down the table at the innocent-looking old man who was regaling everyone at his end of the table with some story. Everyone was listening to him with rapt attention. Watching his animated face while he talked, I couldn\u0027t believe he\u0027d hurt a fly, let alone peg someone with a canned good.\n \"Yep, I guess after the guy knocked Nana down to her knees, he kept walking like it was no big deal, even though my Papaw yelled after him. The guy flipped him the bird and kept walking, so Papaw grabbed a can of beans out of their cart and chucked it right at the back of the guy\u0027s head. They say he dropped like a sniper had taken him out,\" Dean said, chuckling.\n \"Did the guy press charges?\" I asked worriedly.\n \"Nah, he was too embarrassed that a man three times his age took him out. Plus, there were tons of witnesses who saw him knock my nana down. Uncle John said if Papaw wouldn\u0027t have taken him out, several bag boys and the assistant manager were more than willing to step in and do it. My grandparents are quite popular in this area. I guess that\u0027s what happens when your family practically started the town. Papaw says even if he would have wound up in jail, it would have still been worth it. He says no one messes with his family, especially his lady,\" Dean said, looking toward his grandparents affectionately.\n \"That\u0027s freaking hilarious. Your papaw is old-school,\" I said smiling. \"It\u0027s got to be an amazing feeling to have someone stand up for you without a thought about the consequences.\"\n \"That\u0027s family, Mads. Everyone here would have done the same. They\u0027d do the same for you.\"\n \"They don\u0027t even know me,\" I said, feeling uncomfortable at being included in his analogy.\n \"Yeah, but they know you\u0027re important to me,\" he said as he took a bite of his sweet potato casserole.\n Questions bubbled up inside of me. How did they know I was so \"important\" to him, as he put it? Why did I intrigue him so much? Let\u0027s face it. Any girl at our school would die to be sitting where I was at the moment.\n \"You sure take your friend status seriously,\" I finally said, making light of his comment.\n \"Whatever helps you sleep at night, Mads,\" he replied, eating another forkful of food.\n I ignored his dig and concentrated on eating my own meal as Dean started up a conversation with Travis on his other side. I scanned the table while I ate, soaking in the multiple conversations around me. My eyes met Trish\u0027s, who was sitting directly across from me. She was studying me intently and I couldn\u0027t help wondering if she\u0027d heard our exchange. It seemed impossible with the noise level surrounding us, but I couldn\u0027t shake the feeling that I was being scrutinized. Dropping my eyes back to my plate, I focused on eating.\n The rest of the meal passed uneventfully and when everyone was done they all pitched in to clean. One of the rows of tables was folded up and stored away in the barn behind the house. All the mismatched chairs were dragged into groups where the adults could sit and chat while the kids played on the lawn. Someone wheeled a large TV out to the porch while others carried chairs up to the porch and set them up in rows.\n \"Football,\" Dean said as an explanation when he saw me looking confused.\n \"Like on TV?\" I asked.\n \"Of course, the Detroit Lions and the Dallas Cowboys always play on Thanksgiving Day. It\u0027s a tradition for all of us to watch the game together. Papaw\u0027s living room isn\u0027t big enough for all of us, so all my uncles pitched in a couple years ago and purchased the TV and stand. They made sure the stand had wheels so we could wheel it out.\"\n \"Yeah, but we live in Florida. I don\u0027t know a lot about football, but aren\u0027t you supposed to support your home team?\"\n \"I\u0027ve been a Cowboys fan since birth,\" Dean boasted. \"Besides, the Florida teams suck,\" he said loudly.\n \"How about I give you a whipped cream face mask for that blasphemous statement,\" one of his uncles growled, making a move toward Dean.\n \"You and what army, old man,\" Dean mocked, dancing out of reach. Not looking where he was going, he put himself within reaching distance of one of his other uncles who grabbed Dean\u0027s arms from behind, holding him captive.\n \"Give him the pie,\" Travis hooted, helping his uncle hold Dean in place. All the rest of the relatives joined in Travis\u0027s hooting and chanting.\n \"What\u0027s going on?\" I asked Trish as she came over to stand next to me, laughing.\n \"First person to criticize Uncle John\u0027s favorite team gets a whipped cream pie in the face. Dean must have said something,\" she said laughing as we watched Dean break away and make a run for it. He was detoured when Travis took a dive and grabbed him around the ankles.\n Travis and John manhandled Dean back to his feet as he kicked and thrashed trying to get loose again. Entranced by the spectacle in front of me, I watched with fascination as his sweet, innocent-looking nana came out of the house carrying a pie pan towered high with whipped cream. The pie looked like something you would find on a cooking contest. The edges of the whipped cream were browned to a golden brown while a cherry sat perfectly on the top. It looked way too pretty to be going in someone\u0027s face. I couldn\u0027t help wondering why his nana was in charge of the pie until I looked at Dean and saw that all fight had gone out of him as his nana approached. \n","sourceLink":"https://allnovel.net/miss-me-not/page-18.html","bookId":2782,"book":{"id":2782,"title":"Miss Me Not","description":"Storyline: \n Miss Me Not is a beautiful story of self-discovery, forgiveness, caring, and love. \n Madison Hanson\u0027s past demons have given her a shadow of an existence with little hope. With the sudden tragic death of a fellow student, Madison questions her own life choices, and is now forced to evaluate everything she thought she believed in. \n When fate intervenes and partners her with Dean Jackson, a popular \"all around good guy\" from school, Madison gets a glimpse of a life that is filled with sunshine that has the power to break through the darkness she has cloaked herself in. \n With Dean\u0027s help, Madison discovers a desire to finally step out of the shadows, and embrace life and all its gifts.\n \n","cover":"https://allnovel.net/images/miss-me-not.jpg","author":"Tiffany King","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/miss-me-not.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:24:08 PM"}}
