{"id":87823,"no":25,"title":"Page 25","content":"\\n\\n Donna refused to attend counseling with us, which wasn\u0027t a surprise. I had accepted the fact that she would never forgive me.\\n\\n The line of students slowly began to move as we walked down the middle aisle of the arena where our graduation was being held. Scanning the crowds, I found who I was looking for immediately. Sarah. She waved frantically after spotting me and blew me a kiss. She wasn\u0027t my mom, but her easy acceptance and kindness made my heart ache with love for her. Sarah had been my rock over the last six months as I learned to adjust to a life with my dad. She lent an ear when things were uncomfortable between us and gave me insight to helping the adjustment. She was never too busy for me and always found time to spend time with me. She taught me about love and gave me the confidence to share my love with Dean.\\n\\n Dean. Just thinking his name made me feel all gooey and sappy. If Sarah was my rock, Dean was my foundation. His constant caring and love kept me grounded. With his help, I was able to get into the community college near UCF where he would be attending so we could be close to each other. We\u0027d decided to spend the summer on his grandparents’ property, working together on the house he planned on restoring. Our relationship hadn\u0027t taken the intimate step yet, but I foresaw it happening soon. I knew I was ready. He evoked feelings inside me I never thought possible, and made me want more. He made me feel cherished and for that, I gave him my heart.\\n\\n Glancing back up at the Jackson clan, I smiled when I saw the twins jumping up and down with excitement as Sarah pointed out my and Dean\u0027s locations to them. Sweeping my eyes past them, my eyes met my dad\u0027s as he smiled proudly at me. His girlfriend, Andrea sat by his side, also smiling at me. I liked Andrea, she was good to my dad, and that\u0027s all that mattered to me. Through our joint counseling, I had gotten a glimpse into how miserable my dad\u0027s life had been with Donna. Church at the time had been an escape for him. A place where he could ignore the bleakness of being married to a woman he didn\u0027t love. Seeing him happy now made me happy.\\n\\n Mr. Wilson snagged my attention as he began his speech at the podium. My heart pinched when he announced a moment of silence for the two students we had lost that year. A picture of Mitch flashed across the screen behind him. I studied the face of the boy who had started my long journey to recovery. I owed him my life. Tears leaked down my cheeks as a picture of James filled the screen next. Not a day went by that I didn\u0027t think about him. Beth was helping me to forgive myself for letting him slip away. She and I talked about suicide a lot. She made me fill out weekly journal entries, reminding myself of everything I had to live for. She warned me that she would not let me become a statistic. I tried to tell her death was the furthest thing from my head now, but she said she\u0027d rather be safe than sorry. For that, I loved her.\\n\\n Mr. Wilson ended his speech, and before I knew it, the rows in front of me emptied one at a time as the diplomas were handed out. Rising to my feet when my row was signaled, I slowly followed the students to the far side of the stage.\\n\\n Nervous energy coursed through me as the name of the girl in front of me was called, and then it was my turn.\\n\\n \"Madison Hanson,\" Mr. Wilson announced, smiling broadly at me. I returned his smile as I accepted my diploma. Maybe he wasn\u0027t a douche bag after all.\\n\\n Walking off the stage, I waited on the side for Dean. My eyes met his moments before his own name was called. He winked at me and flashed a victory sign. If you can believe it, I had made it to graduation. I had survived. Death had nothing on me. \\n\\n","sourceLink":"https://allnovel.net/miss-me-not/page-25.html","bookId":2782,"book":{"id":2782,"title":"Miss Me Not","description":"Storyline: Miss Me Not is a beautiful story of self-discovery, forgiveness, caring, and love. \\n Madison Hanson\u0027s past demons have given her a shadow of an existence with little hope. With the sudden tragic death of a fellow student, Madison questions her own life choices, and is now forced to evaluate everything she thought she believed in. \\n When fate intervenes and partners her with Dean Jackson, a popular \"all around good guy\" from school, Madison gets a glimpse of a life that is filled with sunshine that has the power to break through the darkness she has cloaked herself in. \\n With Dean\u0027s help, Madison discovers a desire to finally step out of the shadows, and embrace life and all its gifts.\\n","cover":"https://allnovel.net/images/miss-me-not.jpg","author":"Tiffany King","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/miss-me-not.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:24:08 PM"}}
