{"id":66906,"no":13,"title":"Page 13","content":"Chapter Twenty-five\n Parents of the deceased are always difficult calls, and this one was no different. Over the phone, I explained to Edna Clarke, Willie\u0027s mother, who I was. She was confused at first, but eventually agreed to meet with me.\n An hour later, I parked in front of a stylish Tudor revival in the Fullerton Hills. I turned my wheels into the curb, as any good car owner should.\n At the door, I knocked firmly. As I waited, I admired the door. Cut glass, brass trim, heavy oak. Hell, my knuckles were still smarting from the firm knock.\n Footsteps creaked. A murky figure appeared in the opaque glass. The deadbolt clicked, and the door swung open. An elderly woman smiled at me. She was wearing reading glasses. Behind the narrow glasses, her amplified eyes were red. I smiled back. She asked if I was Jim Knighthorse and I said the one and only. She invited me in, and in I went.\n I followed her into a living room bigger than my apartment, and we sat across from each other on red leather sofas. A mohair throw rug connected the two couches. Behind me was a black Steinway piano.\n \"Would you like something to drink, Mr. Knighthorse?\"\n \"No thank you, ma\u0027am. I just have a few questions.\"\n She nodded. Her eyes were dull. She didn\u0027t gesture. She just sat there with her hands clasped in her considerable lap. Was probably a hell of a comfortable lap.\n \"First off, I\u0027m terribly sorry for your loss. I know it\u0027s difficult. I\u0027ve dealt, and am still dealing with, a family loss of my own.\"\n The dullness in her eyes faded, to be replaced by legitimate concern. \"Who did you lose, dear?\"\n \"My mother.\"\n Her eyes watered up. \"I\u0027m so sorry, dear.\"\n \"You keep calling me dear,\" I said. \"And I am liable to cry.\"\n I don\u0027t know why I said that. Perhaps because she reminded me of my own mother. Or perhaps she was a mother who had lost her only son, and I was a son who had lost his only mother. We were a good match.\n \"You can cry, Mr. Knighthorse. I won\u0027t mind.\"\n \"Someday,\" I said. \"I might take you up on that offer.\" A very fat black cat walked into the living room. Along the way he rubbed up against anything he could, and finally rubbed up against me. Good choice. I scratched him heartily behind his ears. He seemed to enjoy it, if the purring was any indication. \"I understand your son lived here with you, Ms. Clarke.\"\n \"Yes.\"\n \"Did he own any credit cards?\"\n \"Yes, but they were in my name.\"\n \"Have you received the latest credit card statement?\"\n She frowned a little and bit her lower lip. \"No, not yet.\"\n \"Can you do me a favor, Ms. Clarke, and call the credit card company and see what charges your son made prior to his death.\"\n She looked at me and sat for a moment, thinking. Then she got up and crossed the room and stepped through a doorway. She returned with a credit card and a cordless phone. She sat back down again and dialed the number on the back of the card. She waited, her round knees bouncing nervously. Next, Ms. Clarke punched in the credit card number.\n \"The last charge was at a Chevron station in Barstow,\" she reported. \"Thirty-eight dollars.\"\n \"Enough for a full tank of gas,\" I said. \"What day was it?\"\n She clicked off the phone. \"The last day I saw him alive.\"\n She was rubbing her upper arms with her hands. Tears were in her eyes. I got up from my couch and slid next to her and hugged her tightly. Her shoulders were soft but strong. She was all mother.\n \"But I don\u0027t understand, Mr. Knighthorse.\"\n \"Neither do I.\"\n \"Did someone make sure he ran out of gas that day? Is that what you are implying?\"\n I waited a moment, breathed deeply. I filled my lungs with the soft perfumed scent of her.\n \"Yes,\" I said, \"that\u0027s what I\u0027m implying.\"\n \"But the police - \"\n \"The police are good, but they are overworked. It\u0027s not their job to look for a murder where one doesn\u0027t appear to exist. Makes for less paperwork that way.\"\n \"But you - \"\n \"I am not the police. And it is my job to look deeper into this. And since I run my own agency, I don\u0027t believe in paperwork.\"\n I told her about the shootout in the desert, about how someone had wanted me dead as well. How I thought the attack on me was related to her son\u0027s death. As I talked, she covered her mouth with her palm, and wept silently.\n \"I\u0027m going to find answers for you,\" I said, \"I promise.\"\n Chapter Twenty-six\n They were waiting for us on the practice field, laughing and joking, butting heads like young rams, stretching, generally relaxing and conserving their energy for the grueling practice that was sure to come.\n I approached with the other coaches through a gate in the chain link fence. Earlier, I had been introduced to the rest of the staff, and now I was wearing a maroon polo shirt, polyester shorts and a whistle. The shirts and shorts were too small. I looked like a pro basketball player from the eighties, if basketball players had shoulders like a bull. But at least I had a whistle, and sometimes that\u0027s all that matters.\n As we approached, all eyes shifted to me, the new guy. The white new guy. The players were all wearing their generic practice jerseys, which made distinguishing them from one another nearly impossible. Yet I knew Coach Samson knew them all by shape, size and probably smell.\n The team was 1-4. One win and four losses. This might be Coach Samson\u0027s first losing season in 27 years.\n Unless, of course, I could do something about it.\n The fall afternoon was bright - and hot. The kids were already sweating under their football pads. In heat like this, I did not miss the extra twenty pounds of equipment strapped to my back.\n Coach Samson blew his whistle and the players fell in, forming seven remarkably straight rows.\n I stood before the team with the other coaches. The faces behind the face masks were all black. I could feel their eyes on me. Sizing me up. Watching me, the Whitey. Probably wondering who the hell I was and why I was here.\n They were too young to remember me.\n And now they would never forget me.\n Coach Samson stepped before them; his massive shadow fell across the practice field. Hell, one of the biggest shadows I\u0027d ever seen. The others stood with their hands casually behind their backs, inspecting the integrity of the seven lines of young men.\n As Coach Samson spoke, his deep voice boomed easily to the back of the columns, and no doubt to the apartments far behind the field. \"The man you see before you is white, in case you haven\u0027t noticed.\" There were some chuckles. I smiled, too. \"Despite this liability, he went on to become one of the biggest badasses I have ever had the pleasure to coach. Hell, he single-handedly filled that trophy case you see in our gymnasium.\"\n I tried not to blush.\n \"This man went on to play at UCLA, and if not for one hell of a disgusting injury to his leg he would probably still be in the pros.\" He paused, his eyes sweeping his team. \"So, can any of you tell me who this man is?\"\n Half the hands went up.\n \"Anderson.\"\n A voice spoke up from the middle of row three. \"He be Knighthorse, coach. He hold every record here.\"\n Samson looked at me and grinned, but didn\u0027t hold the grin too long, as that would be uncoachlike. \"They know you, Knighthorse.\"\n \"As well they should.\"\n Samson shook his head and seemed to hold back a smile of amusement. \"He\u0027s here because I asked him to help us. And, brothers, we need all the help we can get. Coach Knighthorse would you like to say a few words?\"\n The sun angled down into my face. I\u0027m sure my cheeks had a pinkish hue to them. I never felt whiter in my life.\n I inhaled, filling my chest. Screw the speech.\n \"Who wants to hit the Whitey?\" I asked them. Hitting, as in tackling drills, or recklessly hurling one\u0027s body into another. Reckless only if you didn\u0027t know what you were doing. And most high school football players didn\u0027t know what the hell they were doing.\n Samson looked at me and raised an eyebrow. Some of the players laughed. One kid in the front said, \"But you ain\u0027t wearing any pads,\" he said, then added, \"coach.\"\n \"I graduated from pads long ago.\"\n More laughter.\n \"I\u0027ll hit the Whitey,\" said a big kid from the back.\n \"Come on up,\" I said.\n He came up and stood before me, face sweating profusely behind the facemask. Skin so dark it looked purple. A big boy, he outweighed me by about a hundred pounds.\n \"I don\u0027t want to hurt you,\" he said.\n \"I promise I won\u0027t cry,\" I said. \"Now get down in your stance.\"\n He squatted down as sweat dribbled off the narrow bars of his facemask. He reached forward and knuckled the grass in front of him with his right hand, a classic three-point stance. Most of his weight was on his hand.\n I assumed a similar position about seven feet in front of him, but my weight was more evenly distributed.\n I nodded to Samson.\n The coach blew his whistle.\n And the kid burst forward, charging recklessly headfirst. With my arm and shoulder, and a lot of proper technique, I absorbed his considerable bulk and used my legs to thrust upward. He went careening off to the side. Landed hard, but unhurt.\n Some gasps from the players. I think I had just brushed aside their best athlete. I helped him to his feet and patted him on his shoulder pads. He was embarrassed.\n To help him save face, I said, \"I got lucky.\"\n He grinned and shook his head in what might have been amazement and went back to his place in line. I looked out at the other players. Others were smiling, laughing. Maybe, just maybe, Whitey wasn\u0027t so bad after all.\n \"It\u0027s mostly about technique and heart, and some skill,\" I said. \"But you can make up for lack of skill with heart and hours in the weight room.\" I surveyed them. \"So who wants to hit like that?\"\n All hands shot up.\n I grinned. \"So who else wants to hit the Whitey?\"\n The hands stayed up. Despite himself, Coach Samson threw back his head and laughed. \n","sourceLink":"https://allnovel.net/the-mummy-case-jim-knighthorse-2/page-13.html","bookId":2352,"book":{"id":2352,"title":"The Mummy Case (Jim Knighthorse #2)","description":"Storyline: \n The Mummy Case (Jim Knighthorse #2) \n Private investigator Jim Knighthorse (from DARK HORSE) takes on a very, very cold case. When historian Willie Clarke dies of mysteriously of dehydration in the California deserts, ex-football hero Jim Knighthorse is hired to dig a little deeper--and discovers a shocking connection to one of the West\u0027s oldest mysteries. \n Over a hundred years ago, an unnamed cowboy was murdered in the California desert and, due to freak weather conditions, would become mummified within twenty-four hours. Now known to the world as Sylvester the Mummy and displayed in a creepy curiosity shop, Sylvester and historian Willie Clarke will be forever linked in mystery. That is, unless private investigator Jim Knighthorse can survive long enough to untangle one of the West\u0027s greatest unsolved murders.\n \n","cover":"https://allnovel.net/images/the-mummy-case-jim-knighthorse-2.jpg","author":"J.R. Rain","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-mummy-case-jim-knighthorse-2.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:02:30 AM"}}
