{"id":66917,"no":24,"title":"Page 24","content":"Chapter Forty-seven\n Cindy spent the next few minutes flinching spasmodically into sleep. When she was snoring softly, I eased out of bed and padded quietly into the kitchen and opened the fridge door and removed a cold can of the thing that had been obsessively raging through my thoughts for the last hour. And it wasn\u0027t a Diet Coke.\n Cindy allowed me to keep a case of beer at her house, as long as I didn\u0027t go through it too quickly.\n That, of course, was the challenge.\n So I was sitting in the darkness at the kitchen table working on my third Miller Light, contemplating a fourth, when I heard the familiar rumble of the muffler. I parted the curtains and looked down onto the street below as the same older model BMW pulled up along the curb, stopping in the shadows just outside a splash of lamplight.\n I sipped from the can, stared down. I forgot about wanting a fourth beer.\n The driver killed the engine and the lights. The tinted window rolled down and a man\u0027s pale face appeared. If I wasn\u0027t mistaken, as his jawline caught some of the diluted street light, he was looking up at Cindy\u0027s condo.\n I finished the beer and spent the next ten minutes staring down into the small squarish window three floors below, staring so hard that sometimes the window blurred into a hazy black amorphous mass. Luckily, blinking remedied this problem.\n I watched it some more, and decided it was time for a chat. I pulled on a light jacket, because even I get cold, and stepped out of the condo and into the cool night air. I worked my way between the rows of condos, through a security gate and out toward the street.\n Once there, I saw that the driver had stepped out of the car and was now rummaging through the trunk. The trunk lid blocked his face. Below the corner of the rear fender, and glowing slightly in the diluted street light, I could see a pair of dirty sneakers. Whoever he was withdrew something from his trunk and set it by his feet.\n Light reflecting dully off its plastic surface, it looked vaguely like a slightly deflated football, if footballs had handles and spouts.\n Gas can.\n Pale hands reached up for trunk lid. Shut it softly.\n And I found myself looking into the face of a very shocked, very heavy-set middle-aged man with a thick head of receding hair. Sort of the Roger Staubach look. He was wearing a black Members Only jacket and black sweats, as any good stalker should. He couldn\u0027t have looked more startled, eyes bulging and mouth working.\n \"Run out of gas?\" I asked.\n The look of astonishment quickly turned into something ugly. He bared his teeth and reached inside his jacket, shouting: \"Darwin is the devil.\"\n But before he could remove his hand, I pushed off the fender and punched him full in the face. His arms windmilled, flinging what appeared to be a gun into the nearby bushes. He collapsed straight to the ground.\n \"Only in the bedroom,\" I said. \"A devil only in the bedroom.\"\n He held his face and moaned and bled. I rolled him over and removed his wallet from his back pocket, hoping against hope I had gotten the right man. And I had. Chad Schwendinger. Hell of a name.\n No wonder he turned out bad.\n Chapter Forty-eight\n Yesterday, in a small desert town called Apple Valley, ol\u0027 Boonie was finally put to rest amid much fanfare. Jones T. Jones was there. He even shed a tear, which may or may not have been legit. Anyway, I thought he was going to miss his mummy. They had gotten along so well together.\n I was still drinking too much, but that was not insurmountable. That was fixable, and someday when I had put my own mother\u0027s murder to rest, I would put my drinking to rest, too. And then I would ask a certain someone to marry me.\n But first things first.\n A door to my right opened and a bespectacled young man with no chin poked his head out. He was dressed in a white lab coat. \"It\u0027s ready, Mr. Knighthorse.\"\n \"How did it turn out?\"\n \"Great, I think. You can thank the marvels of modern technology.\"\n So I followed him in. Took a seat next to a flat-screen computer monitor that was turned away from me.\n \"Here you go,\" he said. And turned the monitor toward me. \"Twenty years, just like you asked.\"\n On the screen before me was the headshot of a white Caucasian male of about forty. I leaned a little closer, aware that my beating heart had increased in tempo, thudding dully in my skull. The man on the screen had not aged well. His face was weathered from too many years in the sun and surf. His blond hair was turning a dirty blond, almost gray. Blue eyes and white teeth.\n It\u0027s called age progression technology, and it\u0027s used to identify runaways and kidnap victims. The man on the screen before me was the eighteen-year-old kid from the pier, the kid who had taken an interest in my mother. Except in the age progression photograph, he wasn\u0027t a kid anymore. He was a man. An older man who clearly loved to surf and still lived in Huntington Beach. An older man with three adorable kids who loved their grandfather. An older man who was the son of the homicide detective who investigated my mother\u0027s murder.\n \"I hope this helps,\" said the technician.\n I was finding breathing difficult.\n \"Are you okay?\" asked the technician.\n The room was turning slowly. From somewhere very far away, I heard the technician ask again if I was okay.\n I felt sick and stumbled out of the small room and found the nearest bathroom and threw up my lunch and breakfast. I flushed the toilet and sat on the seat and wiped my mouth with the back of my hand and tried to control my breathing.\n I sat like that for a very long time.\n The End \n","sourceLink":"https://allnovel.net/the-mummy-case-jim-knighthorse-2/page-24.html","bookId":2352,"book":{"id":2352,"title":"The Mummy Case (Jim Knighthorse #2)","description":"Storyline: \n The Mummy Case (Jim Knighthorse #2) \n Private investigator Jim Knighthorse (from DARK HORSE) takes on a very, very cold case. When historian Willie Clarke dies of mysteriously of dehydration in the California deserts, ex-football hero Jim Knighthorse is hired to dig a little deeper--and discovers a shocking connection to one of the West\u0027s oldest mysteries. \n Over a hundred years ago, an unnamed cowboy was murdered in the California desert and, due to freak weather conditions, would become mummified within twenty-four hours. Now known to the world as Sylvester the Mummy and displayed in a creepy curiosity shop, Sylvester and historian Willie Clarke will be forever linked in mystery. That is, unless private investigator Jim Knighthorse can survive long enough to untangle one of the West\u0027s greatest unsolved murders.\n \n","cover":"https://allnovel.net/images/the-mummy-case-jim-knighthorse-2.jpg","author":"J.R. Rain","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-mummy-case-jim-knighthorse-2.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:02:30 AM"}}
