{"id":79315,"no":14,"title":"Page 14","content":"Alengthy silence followed my accusations. Nobody knew what to say or think. If Kurda had vehemently denied the claims made against him, perhaps the Generals would have rallied to his side. But he just stood there, downcast, suffering their questioning stares without reply.\\n\\n Finally, Paris Skyle cleared his throat. \"These are grave charges to bring against any vampire,\" he said. \"To level them at a Prince-to-be while he stands on the point of investiture...\" He shook his head. \"You understand what the consequences will be if you are lying?\"\\n\\n \"Why would I lie?\" I retorted. Turning, I faced the ranks of vampires. \"Everyone knows I failed my Trials of Initiation and fled before I could be killed. By returning, I\u0027ve condemned myself to execution. Do you think I\u0027d do that for no good reason?\" Nobody answered. \"Kurda betrayed you! He\u0027s in league with the vampaneze. I think he plans on letting them into the Hall of Princes once he\u0027s been invested, to seize control of the Stone of Blood.\"\\n\\n There were cries of astonishment at that.\\n\\n \"How do you know this?\" Arrow yelled over the noise. The bald prince hated the vampaneze more than most, because one of them had killed his wife many years ago.\\n\\n \"I\u0027m only guessing about the Stone of Blood,\" I replied, \"but I\u0027ve seen the vampaneze. Gavner saw them too. That\u0027s why Kurda murdered him. He\u0027d have spared my life, but I threw myself into the stream in the Hall of Final Voyage. I was sure I\u0027d die, but I survived. Once I\u0027d recovered, I came back here to warn you.\"\\n\\n \"How many vampaneze are down there?\" Arrow asked, eyes blazing.\\n\\n \"At least thirty - possibly more.\"\\n\\n The three Princes glanced at each other uneasily.\\n\\n \"This makes no sense,\" Mika muttered.\\n\\n \"I agree,\" Arrow said. \"But a lie this outlandish would be simple to disprove. If he wished to fool us, he would have chosen a less fantastic story.\"\\n\\n \"Besides,\" Paris sighed, \"look in the boy\u0027s eyes - there is nothing but truth in them.\"\\n\\n A roar disrupted the conversation. One of Kurda\u0027s accomplices had broken free and grabbed a knife from a General. Before he could get away, the guards closed ranks and encircled him. He prepared to fight to the death.\\n\\n \"No, Cyrus!\" Kurda bellowed, his first words since I\u0027d disrupted the procession. The vampire\u0027s hand dropped, and he looked to Kurda for guidance. \"It\u0027s over,\" Kurda said softly. \"Don\u0027t spill blood unnecessarily. That was never our aim.\"\\n\\n The vampire named Cyrus nodded obediently. Then, before the circle of guards could close in on him, he put the tip of the knife to his heart and made a swift, fatal stab. As the dead traitor fell to the floor, all eyes turned once again to Kurda, and this time the faces of the vampires were grim.\\n\\n \"What have you to say in rebuttal of Darren\u0027s claims?\" Mika asked, his voice thick with emotion.\\n\\n \"At this moment - nothing,\" Kurda responded coolly.\\n\\n \"You don\u0027t deny the charge?\" Arrow shouted.\\n\\n \"I do not,\" Kurda said.\\n\\n A horrified moan swept through the cave at Kurda\u0027s admission of guilt.\\n\\n \"Let\u0027s kill him now!\" Arrow growled, to a huge cheer of approval.\\n\\n \"With respect, sires,\" Seba interceded, \"would it not make more sense to focus on the vampaneze before we execute our own? Kurda can wait - we should deal with the intruders first.\"\\n\\n \"Seba is right,\" Paris said. \"The vampaneze must be put to the sword. There will be time for traitors later.\"\\n\\n Turning to a handful of guards, he told them to take Kurda and the other traitor away and hold them captive. \"And under no circumstances let them take their own lives,\" he warned. \"That would be the easy way out. Keep them alive until we have time to interrogate them.\"\\n\\n Beckoning me forward, he addressed the massed vampires. \"We will retire to the Hall of Princes with Darren. I ask the rest of you to remain here while we discuss the ramifications of this horrific turn of events. When we have decided on an immediate course of action, we shall inform you. There will be open talks later, when the present danger has been dealt with.\"\\n\\n \"And see that no one leaves the cave,\" Mika barked. \"We don\u0027t know how deep this conspiracy runs. I don\u0027t want word of this reaching the ears of those who stand opposed to the welfare of our clan.\"\\n\\n With that, the four of us entered the Hall of Princes, followed by several of the more senior Generals, as well as Seba, Arra Sails, and Mr. Crepsley.\\n\\n Some of the tension seeped out of the air when the doors closed behind us. Paris hurried off to check on the Stone of Blood, while Mika and Arrow trudged disconsolately to their thrones. Seba thrust some clothes into my hands and told me to slip them on. I did so quickly, then let the quartermaster lead me forward to speak with the Princes. I still hadn\u0027t had a chance to have a word with Mr. Crepsley, though I smiled at him to show that I was thinking about him.\\n\\n I started by telling the Princes about my flight through the tunnels with Kurda, Gavner coming after us, changing direction, running into the vampaneze, Gavner making his stand, and Kurda\u0027s betrayal. When I got to the part about the stream, Paris clapped his hands loudly and grinned.\\n\\n \"I never would have believed it,\" the one-eared Prince chuckled admiringly. \"Young vampires overeager to prove themselves used to go down it in barrels hundreds of years ago, but none ever tried -?\\n\\n \"Please, Paris,\" Mika complained. \"Let\u0027s leave the reminiscences till later.\"\\n\\n \"Of course.\" Paris coughed meekly. \"Do continue.\"\\n\\n I told them about washing up on a bank far away from Vampire Mountain, being found by the wolves and nursed back to health.\\n\\n \"That is not so extraordinary,\" Mr. Crepsley interrupted. \"Wolves have often taken care of abandoned children.\"\\n\\n I described how I\u0027d seen Mr. Crepsley and Arra searching for me, but had kept my head down because of Kurda and the sword-wielding vampires.\\n\\n \"These two traitors,\" Mika said darkly. \"Did you spot them in the cave?\"\\n\\n \"Yes,\" I said. \"They were two of the three who tried to kill me. The vampire stopped by the wolves was one. The other was captured and taken away with Kurda.\"\\n\\n \"I wonder how many more were part of this,\" Mika mused.\\n\\n \"In my estimation - none,\" Paris said.\\n\\n \"You think there were only four of them?\" Mika asked.\\n\\n Paris nodded. \"Vampires are not easily turned against their own. The three with Kurda were young, and if I remember correctly, all were blooded by him - the only three he ever blooded. Also, it is logical to assume that anyone conspiring with him would have been in the cave to witness his investiture. They would surely have acted along with the others to silence Darren before he could speak.\\n\\n \"I do not suggest we dismiss the possibility that there are one or two more we should be wary of,\" Paris concluded, \"but it would be unhelpful to believe the rot is widespread. This is a time to pull together as one, not set in motion a series of unsettling witch hunts.\"\\n\\n \"I agree with Paris,\" Arrow said. \"The suspicion must be stamped out before it has a chance to take hold. If we fail to reestablish trust quickly, no vampire will be able to place faith in another, and anarchy will be rampant.\"\\n\\n I hurried through the rest of my story, bringing them up to date, telling them about Magda, my climb through the tunnels, how I contacted Seba to make sure word of Kurda\u0027s treachery wouldn\u0027t die with me if I was killed. I also mentioned the Guardians of the Blood, how one had failed to help when I cried out to him in the Hall of Final Voyage, but how another had come to my rescue during my climb up the mountain.\\n\\n \"The Guardians of the Blood keep their own counsel,\" Seba said - he knew more about the Guardians than most. \"They are loath to interfere directly in our affairs, which is why they would not have reported to us when they learned about the vampaneze. But indirect interference - such as hiding you when danger loomed - is permitted. Their neutrality is exasperating but in keeping with their ways and customs. We should not hold it against them.\"\\n\\n There was a long, thoughtful silence when I finished, broken eventually by Mika Ver Leth, who smiled wryly and said, \"You put the clan\u0027s interests before your own. We cannot overlook your Trials of Initiation failure, or the fact that you ran from sentencing - but any dishonor you incurred has been canceled out by this act of selfless dedication. You are a true vampire, Darren Shan, as worthy to walk the night as any I know.\"\\n\\n I bowed my head to hide my shy smile.\\n\\n \"Enough of the praise,\" Arrow grunted. \"There are vampaneze to kill. I won\u0027t rest until every last one has been hung over the stakes in the Hall of Death and dropped a dozen times. Let\u0027s storm down there and -?\\n\\n \"Easy, my friend,\" Paris said, laying a calming hand on the Prince\u0027s arm. \"We must not rush into this. Our best trackers followed Darren\u0027s trail through the tunnels, passing close to the caves where the vampaneze were camped. Kurda would have thought of this and relocated them, so they would not be discovered. Our first priority must be to find them. Even after that, we must tread carefully, for fear they hear us coming and get away.\"\\n\\n \"Very well,\" Arrow groaned. \"But I\u0027m leading the first wave against them!\"\\n\\n \"I have no objection to that,\" Paris said. \"Mika?\"\\n\\n \"Arrow may lead the first wave,\" Mika agreed, \"as long as I can lead the second, and he leaves enough for me to whet my blade on.\"\\n\\n \"It\u0027s a deal.\" Arrow laughed, the glint of battle lust in his eyes.\\n\\n \"So young and bloodthirsty,\" Paris sighed. \"I suppose that means I have to stay behind and guard the Hall.\"\\n\\n \"One of us will relieve you before the end,\" Mika promised. \"We\u0027ll let you mop up the stragglers.\"\\n\\n \"You are too kind.\" Paris grinned, then grew serious. \"But that comes later. First, let us summon our best trackers. Darren will go with them to show them the inhabited caves. Once we -?\\n\\n \"Sires,\" Seba interrupted. \"Darren has not eaten since leaving the pack of wolves and has not partaken of human blood since departing Vampire Mountain. May I feed him before you send him off on so important a mission?\"\\n\\n \"Of course,\" Paris said. \"Take him to the Hall of Khledon Lurt and give him whatever he wants. We will send for him presently.\"\\n\\n Though I\u0027d have rather stayed and discussed the situation with the Princes, I was starving, and offered no protest as Seba led me away, through the cave of vampires, down to the Hall of Khledon Lurt. In the Hall, I tucked into one of the most satisfying meals of my life, not forgetting to offer up a prayer of silent thanks to the gods of the vampires for helping me through my great ordeal - while asking them to guide all of us safely through the hardships still to come.\\n\\n \\n\\n","sourceLink":"https://allnovel.net/the-vampire-prince-the-saga-of-darren-shan-6/page-14.html","bookId":2442,"book":{"id":2442,"title":"The Vampire Prince (The Saga of Darren Shan #6)","description":"Storyline: The Saga of Darren Shan #6: The Vampire Prince \\n The book carries on from when Darren Shan was falling down a huge waterfall in Trials of Death, and he must make his way back to Vampire Mountain, while avoiding Kurda Smahlt and his accomplices. He runs into a pack of wolves, Streak and Rudi - the two wolves he knew from an earlier encounter. These wolves help him make his way back to Vampire Mountain safely. He must find a way to inform the Vampire Princes (the leaders of the vampires) of Kurda\u0027s treachery before they crown him a fellow Prince. Kurda\u0027s treason includes hiding Vampaneze inside the mountain, preparing to murder the Princes and attempting to gain control of the Stone of Blood (a powerful stone that can be used to locate any vampire who has touched it) with which he would force the vampires to join the Vampaneze and become a single clan once more.\\n","cover":"https://allnovel.net/images/the-vampire-prince-the-saga-of-darren-shan-6.jpg","author":"Darren Shan","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-vampire-prince-the-saga-of-darren-shan-6.html","creation":"Oct 5, 2019 8:58:43 AM","modification":"Oct 5, 2019 4:15:41 PM"}}
