{"id":79303,"no":2,"title":"Page 2","content":"Darkness-cold - churning water - roaring, like a thousand lions - spinning around and around - bashing into rocks - arms wrapped around my face to protect it - tucking up my legs to make myself smaller, less of a target.\n Wash up against a clump of roots - grab hold - slippery - the wet roots feel like dead fingers clutching at me - a space between the water and the roof of the tunnel - I draw quick gasps of breath - current takes hold again - try fighting it - roots break off in my hands - swept away.\n Tumbling over and over - hit my head hard on a rock - see stars - almost black out - struggle to keep head up - spit water out of my mouth, but more gushes in - feels like I\u0027m swallowing half the stream.\n The current drags me against a wall - sharp rocks cut deeply into my thighs and hips - freezing-cold water numbs the pain - stops the flow of blood - a sudden drop - plummet into a deep pool - down, down, down - held under by force of the falling water - panicking - can\u0027t find my way up - drowning - if I don\u0027t break free soon, I\u0027ll...\n My feet strike a wall and propel me forward - drift slowly up and away from the pool - flow is gentle here - lots of space between water and the top of the tunnel - able to bob along and breathe - air\u0027s cold, and it stings my lungs, but I gulp it down thankfully.\n The stream opens out into what sounds like a large cave. Roars from the opposite end: the water must drop sharply again there. I let myself drift to one side before facing the drop. I need to rest and fill my lungs with air. As I tread water near the wall in the dark, something clutches at my bald head. It feels like twigs. I grab at them to steady myself, then realize they\u0027re not twigs - they\u0027re bones!\n Too exhausted to be scared, I grasp the bones as though they were part of a life buoy. Taking long, deep breaths, I explore the bones with my fingers. They connect to a wrist, an arm, a body, and a head: a full skeleton. This stream was used to dispose of dead vampires in the past. This one must have washed up here and rotted away over the decades. I search blindly for other skeletons but find none. I wonder who the vampire was, when he lived, how long he\u0027s been here. It must be horrible, trapped in a cave like this, no proper burial, no final resting place.\n I shake the skeleton, hoping to free it. The cave erupts with high-pitched screeches and flapping sounds. Wings! Dozens or hundreds of pairs of wings! Something crashes into my face and catches on my left ear. It scratches and bites. I yelp, tear it loose, and slap it away.\n I can\u0027t see anything, but I sense a flurry of objects flying over and around me. Another collides with me. This time I hold on and feel around it - a bat! The cave\u0027s full of bats. They must nest here, in the roof. The sound of me shaking the skeleton disturbed them, and they\u0027ve taken flight.\n I don\u0027t panic. They won\u0027t attack me. They\u0027re just frightened and will settle down soon. I release the one I\u0027ve caught and let it join the rush above me. The noise dies down after a few minutes, and the bats return to their perches. Silence.\n I wonder how they get in and out of the cave. There must be a crack in the roof. For a few seconds I dream about finding it and climbing to safety, but my numb fingers and toes quickly put an end to thoughts like that. I couldn\u0027t climb, even if I could find the crack and it was big enough for me to fit through.\n I start thinking about the skeleton again. I don\u0027t want to leave it here. I tug at it, careful this time not to make too much noise. It doesn\u0027t budge at first - it\u0027s wedged firmly. I get a stronger grip and pull again. It comes loose, all at once, and falls on top of me, driving me under. Water gushes down my throat. Now I panic! The skeleton is heavy on top of me, weighing me down. I\u0027m going to drown! I\u0027m going to drown! I\u0027m going to -\n No! Stop panicking. Use my brain. I wrap my arms around the skeleton and slowly roll over. It works! Now the skeleton\u0027s underneath and I\u0027m on top. The air tastes good. My heart stops pounding. A few of the bats are circling again, but most are still.\n Releasing the skeleton, I guide it out toward the middle of the cave, using my feet. I feel the current take it, then it\u0027s gone. I hang on to the wall, treading water, giving the skeleton time to wash ahead of me. I begin thinking while I wait: was it a good idea to free the skeleton? A nice gesture, but if the bones catch on a rock further along and block my way...\n Too late to worry now. Should have thought of that before.\n My situation\u0027s as desperate as ever. Crazy to think I might get out of this alive. But I force myself to think positively: I\u0027ve made it this far, and the stream must open up sooner or later. Who\u0027s to say I can\u0027t make it to the end? Believe, Darren, believe.\n I\u0027d like to hang here forever - easier to cling on and die of the cold - but I have to try for freedom. In the end, I force my fingers to unclench and let go of the bank. I drift out into the middle of the stream. The current bites at me and takes hold. Speeding up - the exit - roaring grows furiously - flowing fast - angling sharply downward - gone. \n","sourceLink":"https://allnovel.net/the-vampire-prince-the-saga-of-darren-shan-6/page-2.html","bookId":2442,"book":{"id":2442,"title":"The Vampire Prince (The Saga of Darren Shan #6)","description":"Storyline: \n The Saga of Darren Shan #6: The Vampire Prince \n The book carries on from when Darren Shan was falling down a huge waterfall in Trials of Death, and he must make his way back to Vampire Mountain, while avoiding Kurda Smahlt and his accomplices. He runs into a pack of wolves, Streak and Rudi - the two wolves he knew from an earlier encounter. These wolves help him make his way back to Vampire Mountain safely. He must find a way to inform the Vampire Princes (the leaders of the vampires) of Kurda\u0027s treachery before they crown him a fellow Prince. Kurda\u0027s treason includes hiding Vampaneze inside the mountain, preparing to murder the Princes and attempting to gain control of the Stone of Blood (a powerful stone that can be used to locate any vampire who has touched it) with which he would force the vampires to join the Vampaneze and become a single clan once more.\n \n","cover":"https://allnovel.net/images/the-vampire-prince-the-saga-of-darren-shan-6.jpg","author":"Darren Shan","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-vampire-prince-the-saga-of-darren-shan-6.html","creation":"Oct 5, 2019 8:58:43 AM","modification":"Oct 5, 2019 4:15:41 PM"}}
