{"id":80108,"no":2,"title":"Page 2","content":"NOW...\\n\\n Zombies, my arse! I\u0027ve got a real problem on my hands. Dad\u0027s been drinking and I can tell by his beady eyes that he\u0027s close to tipping over the edge.\\n\\n We\u0027ve been watching the news, a report about the alleged zombie attack in Ireland. Dad takes a swig of beer, then snorts and switches channels.\\n\\n \"I was watching that,\" Mum complains.\\n\\n \"You\u0027re not anymore,\" Dad grunts.\\n\\n \"But it\u0027s important,\" Mum presses. \"They might attack here. We need to know what to do, Todd.\"\\n\\n \"B knows what to do, don\u0027t you?\" Dad says, winking at me, and it\u0027s a relief to see he\u0027s still at the stage where he can crack a joke.\\n\\n \"Of course,\" I grin. \"Put my head between my legs and kiss my arse good-bye!\"\\n\\n We crack up laughing. Mum tuts and makes a face. She doesn\u0027t like it when we swear. She thinks foul language is a sign of ill breeding. I don\u0027t know how she ended up with Dad - he could swear for a living.\\n\\n \"Don\u0027t be silly, Daisy,\" Dad says. \"It\u0027s all a con. Zombies? The dead returning to life to feast on the living? Give me a break.\"\\n\\n \"But it\u0027s on the news,\" Mum says. \"They showed pictures.\"\\n\\n \"They can do anything with computers these days,\" Dad says. \"I bet B could knock up something just as realistic on our laptop. Am I right, B?\"\\n\\n \"Dead on,\" I nod. \"With a few apps, I could out-zombie George Romero.\"\\n\\n \"Who\u0027s that?\" Mum frowns.\\n\\n \"The president of South Africa,\" Dad says seriously and we both howl at her bewildered expression.\\n\\n \"It\u0027s all very well for the pair of you to laugh like hyenas,\" Mum snaps, face reddening. \"But what happens if zombies attack us here? You won\u0027t be laughing if they kill me and B.\"\\n\\n \"I\u0027ll happily chuck you to them if you keep on moaning,\" Dad says, and there\u0027s an edge to his voice now, one I\u0027m all too familiar with.\\n\\n Dad stares at Mum, his eyes hard. I tense, waiting for him to roar, or maybe just throw a punch at her without warning. If he does, I\u0027ll hurl myself at him, the way I have countless times in the past. I love him, but I love Mum too, and I can never stand by and let him lay into her. The trouble is, there\u0027s not much I can do to stop him. We could both be in for some serious battering tonight.\\n\\n But instead, after a dangerous pause, Dad smirks and switches back to the news. That\u0027s Dad all over - unpredictable as the weather.\\n\\n I scratch the back of my head - I had it shaved tight over the weekend and it\u0027s always itchy for a few days when I do that - and watch the footage from Ireland. It\u0027s a helicopter shot. They\u0027re flying over Pallaskenry, the small village where zombies apparently ran wild on Sunday.\\n\\n The village is in ruins. Buildings are being burned to the ground by soldiers with cool-looking flamethrowers. Corpses all over the place. At least they look like corpses. Dad reckons they\u0027re dummies. \"That\u0027s a waste of good ketchup,\" he said when Mum challenged him about the blood.\\n\\n \"I mean,\" Dad says as we watch, \"if it had happened in London, fair enough, I might believe it. But bloody Ireland? It\u0027s one of their Paddy jokes. There was an Englishman, an Irishman and a zombie...\"\\n\\n \"But they\u0027ve shown dead people,\" Mum persists. \"They\u0027ve interviewed some of the survivors who got out.\"\\n\\n \"Never heard of actors?\" Dad says witheringly, then turns to me. \"You don\u0027t buy any of this, do you?\"\\n\\n \"Not a word.\" I point at the TV. They\u0027re showing a clip that\u0027s already passed into legend on YouTube. One of the zombies is biting into a woman\u0027s head. He\u0027s a guy in pajamas. His eyes are crazy and he\u0027s covered in blood, but apart from that you wouldn\u0027t look at him twice in a crowd. The woman screams as he chews off a chunk of her skull and digs his fingers into her brain. As he pulls out a handful and stuffs it into his mouth, the camera pans away and, if you listen closely, you can hear the cameraman vomiting.\\n\\n The clip had gone viral on the Web by Monday morning, but they first showed it on TV that evening. There was an uproar the next day, papers saying it shouldn\u0027t have been aired, people getting their knickers in a right old twist. It gave me a fright when I first saw it. Dad too, even if he won\u0027t admit it. Now it\u0027s just a bit of fun. Like when you see a horror film more than once - scary the first time, but the more you watch it, the lamer it gets.\\n\\n \"He should have dipped that bit of brain in curry sauce,\" I joke.\\n\\n \"B!\" Mum gasps. \"Don\u0027t joke about it!\"\\n\\n \"Why not?\" I retort. \"None of it\u0027s real. I reckon it\u0027s a trailer for a new movie. You wait, another few days and they\u0027ll admit it was a publicity stunt. Anyone who fell for it will look a right idiot, won\u0027t they?\"\\n\\n \"But the police and soldiers...\" On the TV, a tank fires at a church, blasting holes out of the walls, exposing zombies who were sheltering inside - these guys are like vampires, they don\u0027t come out much in the day.\\n\\n \"They\u0027re part of the campaign,\" I insist. \"They\u0027ve been paid to go along with the act.\"\\n\\n Mum frowns. \"Surely they\u0027d get in trouble if they lied to the public like that.\"\\n\\n \"Trouble\u0027s like a bad stink,\" Dad says. \"Throw enough money at it and nobody cares. Any lawyers who go after these guys will be given a big fat check and that\u0027ll be the end of that.\"\\n\\n \"I dunno,\" Mum says, shaking her head. \"They\u0027re talking about a curfew here.\"\\n\\n \"Course they are,\" Dad sneers, knocking back another slug of beer. \"The government would love that. Get everyone off the streets, terrify us into holing up like rats. It\u0027d leave them free to do whatever they wanted at night. They\u0027d ship in more immigrants while we weren\u0027t watching. That might be what the whole thing\u0027s about, a plot to make us look away while they sneak in a load of scabs who\u0027ll work for peanuts and steal our jobs.\"\\n\\n Mum looks dubious. \"You can\u0027t be serious, Todd.\"\\n\\n \"I\u0027d bet my crown jewels on it,\" he says firmly.\\n\\n She stares at him, maybe wondering how she ended up marrying such a paranoid nutter. Or maybe she\u0027s trying to convince herself that he\u0027s right, to avoid any arguments and associated beatings.\\n\\n The worst thing about this zombie scare is talk of a curfew. I\u0027d go mad if I had to stay home every night, locked in with Mum and Dad. I mean, most nights I stay in anyway, watching TV, surfing the Web, playing computer games, listening to music. But I know that I can go out, any time I please. Take that choice away and I\u0027d be no better off than a prisoner.\\n\\n I shiver at the thought of being caged up and get to my feet. \"I\u0027ve had enough of zombies. They\u0027re boring me. I\u0027m heading out.\"\\n\\n \"I\u0027m not sure that\u0027s a good idea,\" Mum says. \"What if there\u0027s an attack?\"\\n\\n \"Don\u0027t be daft,\" I laugh.\\n\\n \"But if they struck there, they could strike here. We\u0027re not that far from Ireland.\" She looks like she\u0027s about to cry. \"They come out at night, the reporters all say so. If they attack London and catch you on the street...\"\\n\\n \"Dad?\" I look to him for support.\\n\\n \"I dunno...\" he mutters, and for the first time I see that he\u0027s not so sure that this is the work of sneaky liberals.\\n\\n \"Don\u0027t tell me you\u0027re gonna start too,\" I groan.\\n\\n Dad chews the inside of his cheek, the way he does when he\u0027s thinking hard.\\n\\n \"Put your foot down, Todd,\" Mum says. \"It\u0027s dangerous out there. You can\u0027t - \"\\n\\n \"I can do whatever the bloody hell I want!\" Dad shouts. \"Don\u0027t tell me what I can and can\u0027t do.\"\\n\\n \"I\u0027m not,\" Mum squeaks. \"I was only - \"\\n\\n \"Shut it,\" Dad says quietly and Mum zips up immediately. She knows that tone. We both do. I gulp as Dad sits forward, putting down the can of beer. He cracks his fingers, eyeballing Mum. She\u0027s trembling. She\u0027s not the sharpest tool in the box. She missed the earlier warning signs, his expression, the clip to his words. But now she\u0027s up to speed. Dad\u0027s in a foul mood. There could be some thuggery in the cards tonight.\\n\\n I start to edge towards Mum, to do my best to protect her. I hate it when Dad hits me. But I hate it even more when he hits her. Mum\u0027s soft. I\u0027m more like Dad, a tough little nut. I\u0027ll distract him if I can, draw his attention away from Mum. If I\u0027m lucky he\u0027ll only slap me. If not, and he starts punching and kicking, I\u0027ll curl up into a ball and take it. Won\u0027t be the first time. Won\u0027t be the last. Better he does it to me than Mum.\\n\\n \"B!\" Dad barks, making me jump.\\n\\n \"Yeah?\" I croak, trying not to shake.\\n\\n He glares at me - then snorts, picks up the can of beer and settles back again. \"Go do whatever the hell you feel like.\"\\n\\n \"Sure thing, boss,\" I smile and tip him a stupid salute.\\n\\n Dad smirks. \"You\u0027re an idiot,\" he says.\\n\\n \"I know where I get it from,\" I chuck back at him, feeling safe enough to wind him up a bit. I can do that to Dad when he\u0027s in the right mood. He\u0027s a great laugh when he wants to be.\\n\\n \"Oi!\" he roars and throws a cushion at me.\\n\\n I laugh and duck out, knowing Mum will be fine now, delighted at this unexpected swing, feeling on top of the world. There\u0027s nothing sweeter than a narrow escape. I don\u0027t know why Dad laid off at the last moment, and I don\u0027t try to figure it out. I gave up trying to read his mind years ago.\\n\\n The last thing I see is Mum getting up to retrieve the cushion. Dad doesn\u0027t like it if she leaves stuff lying around. Doesn\u0027t matter if he left it there. Cleaning up is her job. \\n\\n","sourceLink":"https://allnovel.net/zom-b-zom-b-1/page-2.html","bookId":2450,"book":{"id":2450,"title":"Zom-B (Zom-B #1)","description":"Storyline: Zom-B (Zom-B #1) \\n Zom-B is a radical new series about a zombie apocalypse, told in the first person by one of its victims. The series combines classic Shan action with a fiendishly twisting plot and hard-hitting and thought-provoking moral questions dealing with racism, abuse of power and more. This is challenging material, which will captivate existing Shan fans and bring in many new ones. As Darren says, \"It\u0027s a big, sprawling, vicious tale...a grisly piece of escapism, and a barbed look at the world in which we live. Each book in the series is short, fast-paced and bloody. A high body-count is guaranteed!\"\\n","cover":"https://allnovel.net/images/zom-b-zom-b-1.jpg","author":"Darren Shan","type":"Horror","source":"allnovel","link":"https://allnovel.net/zom-b-zom-b-1.html","creation":"Oct 5, 2019 8:58:44 AM","modification":"Oct 5, 2019 4:22:23 PM"}}
