{"id":34420,"no":10,"title":"CHAPTER X. DAN AS A DETECTIVE.","content":"Dan quickly decided that if Mike had been going to Brooklyn, he would not have announced it under the circumstances. \"He meant to send me there on a wild-goose chase,\" he reflected. \"I am not quite so green as he takes me to be.\" Dan could not decide as easily where Mike had gone. Hood says in his poem of \"The Lost Heir,\" \"A boy as is lost in London streets is like a needle in a bundle of hay.\" A hunt for a boy in the streets of New York is about equally hopeless. But Dan did not despair. \"I\u0027ll just stroll round a little,\" he said to himself. \"Maybe I\u0027ll find him.\" Dan bent his steps toward the Courtlandt-street Ferry. \"Perhaps Mike has gone to Jersey City,\" he said to himself. \"Anyway, I\u0027ll go over there.\" It was not an expensive journey. Six cents would defray Dan\u0027s expenses both ways, and he was willing[Pg 78] to incur this expense. He meant to look about him, as something might turn up by which he could turn an honest penny. Something did turn up. Near him in the cabin of the ferry-boat sat a gentleman of middle age, who seemed overloaded with baggage. He had two heavy carpet-bags, a satchel, and a bundle, at which he looked from time to time with a nervous and uncomfortable glance. When the boat touched shore he tried to gather his various pieces of luggage, but with indifferent success. Noticing his look of perplexity, Dan approached him, and said, respectfully: \"Can\u0027t I assist you, sir?\" \"I wish you would, my boy,\" said the gentleman, relieved. \"All right, sir. I\u0027ll take one of the carpet-bags and the satchel, if you like.\" \"Thank you; that will do nicely.\" So the two left the boat together. \"Where are you going, sir?\" asked Dan. \"Do you know the wharf of the Cunard steamers?\" asked the gentleman. \"Yes, sir.\" \"Is it far off?\" \"Not more than five or six minutes\u0027 walk,\" answered Dan. [Pg 79] \"Can you help me as far as that with my luggage?\" \"Yes, sir.\" \"I will make it worth your while, and you will be doing me a great favor besides. I was brought down to the ferry, but the rascally hackman demanded five dollars more to carry me across and land me at the Cunard pier. He thought I would have to submit to this imposition, but I was so indignant that I tried to handle all my luggage myself. I don\u0027t know how I should have managed without you.\" \"I won\u0027t charge you so much, sir,\" said Dan, smiling. \"It isn\u0027t for the money I cared so much as for the imposition. I would rather pay you ten dollars than the hackman five.\" \"Be careful, sir,\" said Dan, smiling, \"or I may take advantage of your liberal offer.\" The gentleman smiled in turn. \"You don\u0027t look like a boy that would take advantage of a traveler.\" \"You can\u0027t judge from appearances, sir. I have been robbed of six dollars to-day, and I might try to make it up that way.\" \"You have been robbed! How?\" Dan briefly related the circumstances. \"Was it all the money your mother had?\" \"Yes, sir.\" [Pg 80] \"How did you happen to be coming across the ferry?\" \"I thought Mike might be here somewhere.\" By this time they were in sight of the Cunard wharf. \"Were you ever on a Cunard steamer?\" asked the gentleman. \"No, sir.\" \"Help me on board with my luggage, and I will show you about.\" \"I thought the steamers generally left in the morning,\" said Dan. \"So they do; but to-day the tide did not serve till later.\" Dan helped Mr. Stevens down below with his luggage, and assisted him in storing them in his stateroom. He surveyed with interest the cabin, the deck, the dining-saloon, and the various arrangements. \"Well,\" said the gentleman, smiling, \"how do you like it?\" \"First-rate, sir.\" \"Do you think you would like to be going with me?\" \"Yes, sir, but for my mother.\" \"Of course, it won\u0027t do to desert her; otherwise I might be tempted to make you an offer. I am sure you would be very useful to me.\" [Pg 81] \"I should like it very much, if mother did not need me.\" Dan went up stairs with Mr. Stevens, and remained till visitors were warned that it was time to go ashore. \"I must go, sir,\" he said. Mr. Stevens drew a five-dollar bill from his vest pocket and handed it to Dan. \"I haven\u0027t any change, sir,\" said Dan. \"None is required,\" said the gentleman, smiling. \"Do you really mean to give me five dollars, sir?\" \"That is what the hackman wanted to charge me.\" \"But it was too much.\" \"It was too much for him; it is not too much for you, if I am willing to give it to you.\" \"You are very kind, sir,\" said Dan, almost doubting the reality of his good fortune. \"It will prove that I spoke truly when I said I didn\u0027t care for the amount of money, only for the imposition. I am really very glad to give it to you. Good-by, my boy.\" He offered his hand. Dan shook it heartily, and, wishing him a pleasant voyage, descended the gangplank. \"That is almost as much as Mike robbed me of,\" he said to himself. \"How lucky I came over to Jersey City! Now, if I could only get back part of[Pg 82] the money Mike robbed me of, I should be the better off for his mean trick.\" Dan did not immediately return to New York. He had been so fortunate that he decided to spend the rest of the afternoon as he liked. He walked on for ten minutes, Mike being temporarily out of his mind, when his attention was suddenly drawn to him. Just in front of him he saw Mike himself swaggering along, with a ten-cent cigar in his mouth, and both hands thrust deep in his trousers pockets. He was strolling along in fancied security, not dreaming of the near presence of the boy whom he had so meanly robbed. Dan\u0027s eyes sparkled when he recognized his enemy, and hastening his pace, he put his hand on Mike\u0027s shoulder. Mike turned quickly, and his countenance changed when he saw Dan. \"Has he found it out?\" suggested his guilty conscience. \"Anyway, he can\u0027t prove anything. I\u0027ll bluff him off.\" \"Hallo, Dan!\" he said, in affected cordiality. \"What brings you over here?\" \"What brings you over here, Mike?\" asked Dan, significantly. \"I\u0027m looking for a job,\" said Mike. \"You look like it,\" retorted Dan, \"with both[Pg 83] hands in your pockets and a cigar in your mouth! Times seem to be good with you. How much did that cigar cost?\" \"I don\u0027t know,\" answered Mike, with unblushing falsehood. \"A man gave it to me for holdin\u0027 his hoss.\" Mike was never at a loss for a plausible lie. \"I thought you bought it.\" \"I haven\u0027t got any money.\" \"Did they let you over the ferry free, then?\" \"Oh, I had money enough for that.\" \"I guess you have got more.\" \"No, I haven\u0027t. Ten cents was all I had.\" \"Then how are you going to take Terence Quinn to the theater to-night?\" asked Dan. Even Mike\u0027s brazen effrontery was hardly prepared to meet this unexpected question. \"What do you mane?\" he stammered. \"Terence told me you had invited him.\" \"Then he lies!\" said Mike, his self-assurance returning. \"He invited me.\" \"Look here, Mike Rafferty,\" said Dan, out of patience; \"that won\u0027t go down! Terence told the truth. I know where you got the money you were going to treat him with.\" \"Where, then?\" \"From my mother\u0027s pocket-book.\" [Pg 84] \"It\u0027s a lie!\" blustered Mike. \"It\u0027s the truth, and if you don\u0027t hand over what\u0027s left without making any more trouble, I\u0027ll have you arrested.\" \"You can\u0027t. We\u0027re in Jersey——\" \"I shall have you arrested as soon as you get home.\" \"I didn\u0027t take the money,\" said Mike, sullenly. \"You did, and you know it,\" said Dan, firmly. \"Give me what you have left, and I\u0027ll make no trouble about it. If you don\u0027t, you\u0027re booked for another term at the island.\" Mike tried to save his ill-gotten gains, but Dan was persistent, and finally extracted from him four dollars and a half. The rest Mike pretended he had spent. He was sly enough, however, to have saved enough to take him to the Old Bowery. On the whole, Dan was satisfied, considering the five dollars he had received on the Cunard steamer, but he could not forbear giving Mike a farewell shot. \"How did it happen, Mike, that you took the Jersey Ferry to Brooklyn?\" Mike did not deign a reply. \"That is my first appearance as a detective,\" thought Dan. \"It seems to pay.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/2960/81434.html","bookId":429,"book":{"id":429,"title":"Dan, The Newsboy","description":"简介： Evening Telegram! Only one left. Going for two cents, and worth double the money. Buy one, sir?...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2960","creation":"Aug 1, 2019 12:18:46 AM","modification":"Aug 1, 2019 12:18:46 AM"}}
