{"id":34429,"no":19,"title":"CHAPTER XIX. DAN AS A GOOD SAMARITAN.","content":"\"What made your husband treat you so badly?\" asked Dan. \"Rum!\" answered the woman. \"Rum has been sinking him lower and lower, and it\u0027s easy to see the end.\" \"What will be the end?\" \"The prison—perhaps the gallows.\" \"You are taking too dark a view of your husband,\" said Dan, soothingly. \"He won\u0027t go as far as that.\" The woman shook her head. \"I know him only too well,\" she said. \"This very evening he has been planning a burglary.\" Dan started, and a sudden suspicion entered his mind. \"Did you hear him doing it?\" he asked. \"Yes.\" \"Do you know where it is?\" he asked, eagerly. \"Yes; it is a store on Pearl street.\" Dan felt that he was on the track of a discovery.[Pg 151] He was likely to be repaid at last for the hours he had spent in detective service. \"Who put him up to it?\" he asked, fixing his eyes intently on the woman. \"I don\u0027t know his name; he is a well-dressed man. I think he is in the store.\" \"Was it a man who came to your rooms this evening?\" \"Yes.\" \"Is this the way he looked?\" Here Dan gave a rapid description of Talbot. \"That is the man. Do you know him?\" \"Yes, I know him. He is the book-keeper of the firm.\" \"He is a bad man. He is to pay a thousand dollars for the job. Bill is to have half of it.\" \"Bill, I suppose, is your husband?\" \"Yes.\" Dan looked thoughtful. Here was a most important discovery. He must consider what to do. By this time they had reached a small public-house, of humble exterior, but likely to afford his companion better accommodations than she had at home. \"Come in,\" said Dan. The woman followed him, with the child in her arms. A stout German, who appeared to be the proprietor of the establishment, was sitting in an[Pg 152] arm-chair, smoking a pipe. He scanned the party phlegmatically. \"What you wants?\" he asked. \"Can you give this lady a room?\" asked Dan. \"Is she your vife?\" asked the German, with a broad grin. \"No; she is an acquaintance of mine. Her husband has driven her out of his house in a fit of drunkenness. Can she sleep here?\" \"Has she got any money?\" asked the Dutchman, shrewdly. \"I will pay for her lodging.\" \"That\u0027s all right. She shall stay here.\" \"What will you charge?\" \"Fifty cents a night for the lodging.\" \"Here it is.\" \"Will the lady go up now?\" asked the landlord, upon whom the silver half-dollar produced a visible impression. \"Yes,\" said the woman; \"my poor baby is tired.\" \"You had better stay here two nights,\" said Dan. \"Don\u0027t let your husband know where you are just yet. Here is money to pay for another night\u0027s lodging, and enough to buy food besides.\" \"God bless you, boy!\" she said, gratefully. \"But for you I should have had to stay out all night.\" \"Oh, no; some one would have taken you in.\" [Pg 153] \"You don\u0027t know this neighborhood; the policeman would have found me, and taken me to the station-house. For myself I care little; but my poor babe, who is worse than fatherless——\" and she burst into tears. \"Keep up your courage, madam. Brighter days may be in store,\" said Dan, cheerfully. \"I will come and see you day after to-morrow,\" said Dan. \"Good-night.\" Our hero must not be awarded too great credit for his generosity. He knew that Mr. Rogers would willingly defray all expenses connected with the discovery, and that the money he had advanced to his unfortunate companion would be repaid. Had it been otherwise, however, his generous heart would have prompted him to relieve the woman\u0027s suffering.","sourceLink":"http://novel.tingroom.com/ertong/2960/81443.html","bookId":429,"book":{"id":429,"title":"Dan, The Newsboy","description":"简介： Evening Telegram! Only one left. Going for two cents, and worth double the money. Buy one, sir?...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2960","creation":"Aug 1, 2019 12:18:46 AM","modification":"Aug 1, 2019 12:18:46 AM"}}
