{"id":34437,"no":27,"title":"CHAPTER XXVII. IN THE DRESSING-ROOM.","content":"Mr. Rogers lived in a handsome brown-stone-front house up town. As Dan approached, he saw the entire house brilliantly lighted. He passed beneath a canopy, over carpeted steps, to the front door, and rang the bell. The door was opened by a stylish-looking colored man, whose grand air showed that he felt the importance and dignity of his position. As Dan passed in he said: \"Gentlemen\u0027s dressing-room third floor back.\" With a single glance through the open door at the lighted parlors, where several guests were already assembled, Dan followed directions, and went up stairs. Entering the dressing-room, he saw a boy carefully arranging his hair before the glass. \"That\u0027s my friend, Tom Carver,\" said Dan to himself. Tom was so busily engaged at his toilet that he didn\u0027t at once look at the new guest. When he had[Pg 196] leisure to look up, he seemed surprised, and remarked, superciliously: \"I didn\u0027t expect to see you here.\" \"Why not?\" demanded Dan, who understood his meaning. \"Are you engaged to look after this room? If so, just brush me.\" \"With all my heart, if you\u0027ll brush me,\" answered Dan, partly offended and partly amused. \"What do you mean?\" demanded Tom, haughtily. \"Just what I say. One good turn deserves another.\" \"Our positions are rather different, I think.\" \"How so? You are a guest of Miss Rogers, and so am I.\" \"You don\u0027t mean to say that you are going down into the parlor?\" \"Why not?\" \"A boy who sells papers in front of the Astor House is not a suitable guest at a fashionable party.\" \"That is not your affair,\" said Dan, coldly. \"But it is not true that I sell papers anywhere.\" \"Oh, I forgot. You\u0027re a shop-boy now. You used to sell papers, though.\" \"And I will again, if necessary,\" answered Dan, as he took Tom\u0027s place in front of the glass and began to arrange his toilet. [Pg 197] Then, for the first time, Tom took notice that Dan was dressed as well as himself, in a style with which the most captious critic could not find fault. Tom was both surprised and disappointed. He would have liked to see Dan in awkward, ill-fitting, or shabby clothes. It seemed to him that an ex-newsboy had no right to dress so well, and he was greatly puzzled to understand how he could afford it. \"Where did you borrow those clothes?\" he asked, impudently. \"Where did you borrow yours?\" retorted Dan. \"Don\u0027t be saucy.\" \"You set me the example.\" \"It is not remarkable that I should be well dressed. I can afford it.\" \"So can I,\" answered Dan, laconically. \"Do you mean to say that you bought that suit and paid for it?\" \"I do.\" \"It must have taken all your money.\" \"You are very kind to take so much interest in me. It may relieve your mind to see this.\" Dan took a roll of bills from his pocket, and displayed them to the astonished Tom. \"I don\u0027t see where you got so much money,\" said Tom, mystified. \"I\u0027ve got more in the bank,\" said Dan. \"I [Pg 198]mention it to you that you needn\u0027t feel bad about my extravagance in buying a party suit.\" \"I wouldn\u0027t have come to this party if I had been you,\" said Tom, changing his tone. \"Why not?\" \"You\u0027ll be so awkward, you know. You don\u0027t know any one except Miss Rogers, who, of course, invited you out of pity, not expecting you would accept.\" \"Did she tell you so?\" asked Dan, smiling. \"No, but it stands to reason.\" \"You forget I know you,\" said Dan, smiling again. \"I beg you won\u0027t presume upon our former slight acquaintance,\" said Tom, hastily. \"I shall be so busily occupied that I really can\u0027t give you any attention.\" \"Then I must shift for myself, I suppose,\" said Dan, good-humoredly. \"Shall we go down?\" \"Go first, if you like,\" said Tom, superciliously. \"I will follow directly.\" \"He doesn\u0027t want to go down with me,\" thought Dan. \"Perhaps I shall surprise him a little;\" and he made his way down stairs.","sourceLink":"http://novel.tingroom.com/ertong/2960/81451.html","bookId":429,"book":{"id":429,"title":"Dan, The Newsboy","description":"简介： Evening Telegram! Only one left. Going for two cents, and worth double the money. Buy one, sir?...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2960","creation":"Aug 1, 2019 12:18:46 AM","modification":"Aug 1, 2019 12:18:46 AM"}}
