{"id":93365,"no":11,"title":"Page 11","content":"\"Last call, guys,\" the waitress informed them \"Another Campari?\" she asked Oliver.\\n\\n He rattled the ice cubes and emptied his cocktail glass in one gulp. \"Sure.\"\\n\\n \"Anything for you?\"\\n\\n Schuyler considered another glass of Johnnie Walker Black. She used to hate the taste of whiskey but lately had developed a liking for it. It was fiery and sweet and succulent - the closest thing you could get to the taste of blood. Oliver had once asked her to describe what it tasted like, since he didn\u0027t see the appeal. To him, blood tasted metallic and faintly sweet. Schuyler explained that vampires tasted blood with a different sense - it was like drinking fire.\\n\\n Hence, her newfound love of whiskey.\\n\\n \"Sure, why not,\" she told the waitress. It wasn\u0027t like it was going to get her drunk. Although Oliver looked like he was well on his way. He\u0027d come into the habit of fortifying himself with alcohol whenever they got together. Sure, he wasn\u0027t drunk when they were together at school - but those abrupt reunions were so brief it didn\u0027t matter. But she noticed whenever they spent a substantial amount of time together, he was always a little buzzed.\\n\\n The waitress returned with two cocktail glasses filled to the brim. It was way past midnight, and the only people left in the place were groggy-eyed clubkids getting breakfast after a late night spent at velvet-rope champagnalias, or groggy-eyed clubkids getting breakfast before an early-morning stint at after-hours lounges where no alcohol was served and the clientele preferred their highs to be chemical ones.\\n\\n Oliver sipped his cocktail through a red straw. She found it endearing how he liked sweet things. Oliver hated beer and all the usual trappings of what he called \"el jocko-Americano.\" Somehow the girly drinks made him more manly, in Schuyler\u0027s eyes. He wasn\u0027t afraid to be himself.\\n\\n It was so nice to finally hang out with Oliver in public. She couldn\u0027t very well sink her fangs into him with other people around. Lately, whenever they were alone, it hovered in the air, an expectation on his part, and Schuyler had missed their easy friendship. She relaxed in his company.\\n\\n \"Why do you drink so much around me?\" she asked, trying to keep her voice light.\\n\\n \"I\u0027m offended. You think I\u0027m a lush?\"\\n\\n \"A little.\"\\n\\n \"I don\u0027t know.\" He looked up at the ceiling instead of looking at her directly. \"Dude, you scare me sometimes.\"\\n\\n Schuyler wanted to laugh. \"I scare you?\"\\n\\n \"Yeah, you\u0027re all - vampire superwoman. You could have really done some damage to him, you know.\" Oliver grinned, although Schuyler knew he was more troubled than he let on.\\n\\n \"He\u0027s fine,\" she snapped. She didn\u0027t really want to dwell on what could have happened back there. She had had Dylan in her grasp. She had felt his mind bowing to hers. Had felt all his memories screaming to be let free. And she had wanted nothing more than to crush all of them - silence all their voices. She\u0027d had it in her power to do so. It was a sobering thought, so she took another sip of her drink.\\n\\n \"He\u0027s not fine,\" Oliver said. \"You know we have to tell Lawrence about him, don\u0027t you? They\u0027ll have to do something about it. He\u0027s showing classic signs of corruption. Delusions, hysteria, mania.\"\\n\\n A busboy cleared their table and gave them the eye. Schuyler knew they should leave, the staff was ready to go home. But she wanted to linger with Oliver just a while longer. \"How do you know all this?\"\\n\\n \"I did my reading. You know, the stuff Lawrence told us to look up?\"\\n\\n Right. Schuyler felt guilty. She had been remiss on her vampire lessons. Lawrence had been using Oliver to keep her abreast on her studies. She should be concentrating on refining her strengths, on sharpening her skills, but instead she\u0027d been distracted. The Perry Street apartment...\\n\\n \"Do you think Dylan was lying to us?\" she asked.\\n\\n \"No, I think he thought he was telling us the truth, as much as he knew. But he\u0027s obviously been manipulated.\" Oliver cracked ice cubes in his mouth. \"I don\u0027t know if I believe he ever really got away from them. I think they let him go.\"\\n\\n Schuyler became silent. They had let him go so that he could finish the job he\u0027d failed at before. Dylan had attacked her - twice - before he\u0027d suddenly disappeared. They\u0027d chosen him because he was close to her, was one of her best friends. She couldn\u0027t deny it: someone wanted her killed. She wanted to share this realization with Oliver, but kept it to herself. He worried about her enough.\\n\\n Oliver glanced at the bill and put down his credit card. \"So, how are things over at the Death Star?\"\\n\\n \"The same.\" Schuyler smiled, although she felt sick enough to throw up. It was hard to see Oliver and not hate herself because of what she was doing to him.\\n\\n \"So...\" Oliver sighed. Schuyler knew where this was going and wished once again that she hadn\u0027t made him her familiar.\\n\\n \"So?\"\\n\\n The waitress returned with the credit-card slip and hinted that if they stayed any longer they\u0027d have to leave through the back entrance.\\n\\n Oliver pocketed his card and tried to take another gulp of his already empty drink. \"I was on my way to meet you at the Mercer when Bliss called. She said you were down here, on Perry Street. I thought that was kind of odd, since we\u0027d agreed we\u0027d meet at the Mercer, as usual, but she said she was positive you\u0027d be there. What were you doing in that building anyway?\"\\n\\n Schuyler wouldn\u0027t look him in the eye. \"Modeling thing. Linda Farnsworth has a place for the models to crash there. Bliss and I go there sometimes to hang out with a couple other girls. I didn\u0027t realize the time. I\u0027m sorry I kept you waiting.\"\\n\\n \"Well, um, since we didn\u0027t get to meet like we\u0027d planned, do you want to...\"\\n\\n It was easier to rebuff him this time, since she\u0027d already made her decision earlier. Schuyler shook her head. \"No, I\u0027ve got to be back for the curfew. I\u0027m late enough as it is, and if Charles finds out - \"\\n\\n \"Fuck Charles.\" Oliver flicked a toothpick across the table so it landed on the floor. \"I mean, God, sometimes I\u0027m so tired of all this shit.\"\\n\\n \"Ollie - \"\\n\\n \"I just want us to be together,\" he said, looking at the ceiling again. \"I mean, I know it\u0027s not possible. But why not? Why should we follow the old laws? Why should anyone care anyway?\" he railed. \"Don\u0027t you want us to be together?\" he challenged, an edge to his voice.\\n\\n Schuyler was moved to take his hand in hers. \"I do, Ollie, you know I do.\" He was her ally, her partner-in-crime, her conscience and her comfort.\\n\\n Oliver\u0027s face transformed into a look of utmost happiness and satisfaction. He smiled at her then, and Schuyler hoped with all her heart that he would never find out the truth. \\n\\n","sourceLink":"https://allnovel.net/revelations-blue-bloods-3/page-11.html","bookId":2121,"book":{"id":2121,"title":"Revelations (Blue Bloods #3)","description":"Storyline: Revelations (Blue Bloods #3) \\n Have you ever wondered what secrets lurk behind the closed doors of New York City’s wealthiest families? They\u0027re powerful, they\u0027re famous... they\u0027re undead. \\n Schuyler Van Alen’s blood legacy has just been called into question—is the young vampire in fact a Blue Blood, or is it the sinister Silver Blood that runs through her veins? As controversy swirls, Schuyler is left stranded in the Force household, trapped under the same roof as her cunning nemesis, Mimi Force, and her forbidden crush, Jack Force. \\n When one of the Gates of Hell is breached by Silver Bloods in Rio de Janeiro, however, the Blue Bloods will need Schuyler on their side. The stakes are high; the battle is bloody; and through it all, Carnavale rages on. And in the end, one vampire’s secret identity will be exposed in a revelation that shocks everyone.\\n","cover":"https://allnovel.net/images/revelations-blue-bloods-3.jpg","author":"Melissa de la Cruz","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/revelations-blue-bloods-3.html","creation":"Oct 5, 2019 8:58:21 AM","modification":"Oct 5, 2019 6:01:06 PM"}}
