{"id":7707,"no":13,"title":"Chapter 13","content":"He who loves his body more thandominion over the empirecan be given custody of the empire. \\n\\n \\n\\n —LAO TZU, Tao Te ChingDR. JOE VIGIL, a sixty-five-year-old army of one, warmed his hands around his coffee as hewaited for the first flashlight beams to come stabbing toward him through the woods. \\n\\n \\n\\n No other elite coach in the world was anywhere near Leadville, because no other elite coach couldgive a hoot what was going on at that giant outdoor insane asylum in the Rockies. Self-mutilators,mean mothermuckers or whatever they called themselves—what did they have to do with realrunning? With Olympic running? As a sport, most track coaches ranked ultras somewhere betweencompetitive eating and recreational S\u0026M. \\n\\n \\n\\n Super, Vigil thought, as he stomped his feet against the chill. Go ahead and sleep, and leave thefreaks to me—because he knew the freaks were onto something. \\n\\n \\n\\n The secret to Vigil’s success was spelled out right in his name: no other coach was more vigilantabout detecting the crucial little details that everyone else missed. He’d been that way his entirecompetitive life, ever since he was a puny Latino kid trying to play high-school football in aconference that didn’t have many Latinos, let alone puny ones. Joey Vigil couldn’t outmuscle themeat slabs on the other side of the line, so he out-scienced them; he studied the tricks of leverage,propulsion, and timing, figuring out ways to position his feet so he popped up from a crouch like aspring-loaded anvil. By the time he graduated from college, the puny Latino kid was a first-teamAll-Conference guard. He then turned to track, and used that tireless bloodhound nose to becomethe greatest distance-running mind America has ever seen. \\n\\n \\n\\n Besides his Ph.D. and two master’s degrees, Vigil’s pursuit of the lost art of distance running hadtaken him deep into the Russian outback, high into the mountains of Peru, and far across Kenya’sRift Valley highlands. He’d wanted to learn why Russian sprinters are forbidden to run a singlestep in training until they can jump off a twenty-foot ladder in their bare feet, and how sixty-yearoldgoatherds at Machu Picchu can possibly scale the Andes on a starvation diet of yogurt andherbs, and how Japanese runners trained by Suzuki-san and Koide-san could mysteriouslyalchemize slow walking into fast marathons. He’d tracked down the old masters and picked theirbrains, vacuuming up their secrets before they disappeared into the grave. His head was a Libraryof Congress of running lore, much of it vanished from every place on the planet except hismemory. \\n\\n \\n\\n His research paid off sensationally. At his alma mater, Adams State College in Alamosa, Colorado,Vigil took over the dying cross-country program and engineered it into an absolute terror. AdamsState harriers won twenty-six national titles in thirty-three years, including the most awe-inspiringshow of strength ever displayed in a national championship race: in 1992, Vigil’s runners took thefirst five places in the NCAA Division II Championship meet, scoring the only shutout everachieved at a national championship. Vigil also guided Pat Porter to eight U.S.A. Cross Countrytitles (twice as many as Olympic marathon gold medalist Frank Shorter, four times as many assilver medalist Meb Keflezighi), and was named College National Coach of the Year a recordfourteen times. In 1988, Vigil was appointed the distance coach for American runners heading tothe Seoul Olympics. \\n\\n \\n\\n And that explained why, at that moment, old Joe Vigil was the only coach in America shivering ina freezing forest at four in the morning, waiting for a glimpse of a community-college scienceteacher and seven men in dresses. See, nothing about ultrarunning added up; and when Vigilcouldn’t do the math, he knew he was missing something big. \\n\\n \\n\\n Take this equation: how come nearly all the women finish Leadville and fewer than half the mendo? Every year, more than 90 percent of the female runners come home with a buckle, while 50percent of the men come up with an excuse. Not even Ken Chlouber can explain the sky-highfemale finishing rate, but he can damn well exploit it: “All my pacers are women,” Chlouber says. \\n\\n \\n\\n “They get the job done.” \\n\\n \\n\\n Or try this word problem: subtract the Tarahumara from last year’s race, and what do you get? \\n\\n \\n\\n Answer: a woman lunging for the tape. \\n\\n \\n\\n In all the hubbub over the Tarahumara, few besides Vigil paid much attention to the remarkablefact that Christine Gibbons was just nosed out for third place. If Rick Fisher’s van had blown a fanbelt in Arizona, a woman would have been thirty-one seconds from winning the whole show. \\n\\n \\n\\n How was that possible? No woman ranked among the top fifty in the world in the mile (the femaleworld record for the mile, 4:12, was achieved a century ago by men and rather routinely now byhigh school boys). A woman might sneak into the top twenty in a marathon (in 2003, PaulaRadcliffe’s world-best 2:15:25 was just ten minutes off Paul Tergat’s 2:04:55 men’s record). Butin ultras, women were taking home the hardware. Why, Vigil wondered, did the gap between maleand female champions get smaller as the race got longer— shouldn’t it be the other way around? \\n\\n \\n\\n Ultrarunning seemed to be an alternative universe where none of planet Earth’s rules applied: \\n\\n \\n\\n women were stronger than men; old men were stronger than youngsters; Stone Age guys in sandalswere stronger than everybody. And the mileage! The sheer stress on their legs was off the charts. \\n\\n \\n\\n Running one hundred miles a week was supposed to be a straight shot to a stress injury, yet theultrafreaks were doing one hundred miles in a day. Some of them were doing double that everyweek in training and still not getting hurt. Was ultra-running self-selective, Vigil wondered—did itattract only runners with unbreakable bodies? Or had ultrarunners discovered the secret tomegamileage? \\n\\n \\n\\n So Joe Vigil had hauled himself stiffly out of bed, tossed a thermos of coffee in his car, and driventhrough the night to watch the body geniuses do their thing. The best ultrarunners in the world, hesuspected, were on the verge of rediscovering secrets that the Tarahumara had never forgotten. \\n\\n \\n\\n Vigil’s theory had brought him to the brink of a very important decision, one that would changehis life and, he hoped, millions of others. He just needed to see the Tarahumara in person to verifyone thing. It wasn’t their speed; he probably knew more about their legs than they did. What Vigilwas dying for was a look inside their heads. \\n\\n \\n\\n Suddenly, he caught his breath. Something had just come floating out of the trees. Something thatlooked like ghosts … or magicians, appearing from a puff of smoke. \\n\\n \\n\\n Right from the gun, Team Tarahumara caught everyone by surprise. Instead of hanging back asthey had the last two years, they surged in a pack, hopping up on the Sixth Street sidewalk to patteraround the crowd and take command of the front-running positions. \\n\\n \\n\\n They were moving out fast—Much too fast, it seemed, thought Don Kardong, the 1976 Olympicmarathoner and veteran Runner’s World writer watching from the sidelines. Last year, Victorianohad shown shrewd restraint by steadily climbing along from last to first, gradually getting faster ashe got closer to the finish line. That’s how you run one hundred miles. \\n\\n \\n\\n But Manuel Luna had spent a year reflecting on gringo-style racing, and he’d done a nice job ofbriefing his new teammates. The course is wide open under the streetlights, he told them, thensuddenly funnels onto a dark single-track trail as it enters the woods. If you’re not up front, you hita solid wall of bodies as runners pause to fumble with flashlights and then caterpillar along insingle file. Better to move out early and avoid the jam-up, Luna advised them, then ease back later. \\n\\n \\n\\n Despite the dangerous pace, Johnny Sandoval of nearby Gypsum, Colorado, stuck tight withMartimano Cervantes and Juan Herrera. Let everyone go nuts over Ann and the Tarahumara, hethought, while I stealth myself to a trophy. After finishing ninth the previous year in 21:45,Sandoval had the best training year of his life. Quietly, he’d been coming to Leadville throughoutthe summer, running each segment of the course over and over until he’d memorized every twist,quirk, and creek crossing. A nineteen-hour run should win it, Sandoval figured, and he was readyto run one. \\n\\n \\n\\n Ann Trason had expected to be in front, but an eight-minute mile right out of the box was just nuts. \\n\\n \\n\\n So she contented herself with staying within sight of Team Tarahumara’s bobbing flashlights asthey entered the woods around Turquoise Lake, confident she’d reel them in soon enough. Thetrail ahead was dark and knotted with rocks and roots, and that played to one of Ann’s peculiarstrengths: she absolutely loved night runs. Even back in college, midnight was her favorite time tograb a flashlight and a friend and trot through the silent campus, the world reduced to glitters andsparkles in a tiny orb of light. If anyone could make up time running blindly on a treacherous trail,it was Ann. \\n\\n \\n\\n But by the first aid station, Sandoval and the Tarahumara had opened a good half-mile lead. \\n\\n \\n\\n Sandoval checked in, got his split— about 1:55 for 13.5 miles—and shot right back on the trail. \\n\\n \\n\\n The Tarahumara, however, veered into the parking lot and ran over to Rick Fisher’s van. Theybegan kicking off their yellow Rockports like they were crawling with fire ants. Rick and Kitty, asplanned, were already standing by with their huaraches. So much for product endorsement. \\n\\n \\n\\n The Tarahumara knelt, looping the leather thong around and around their ankles and high up ontheir calves, adjusting the tautness as carefully as you’d tune a guitar string. It’s a fine art, custom-fitting a strip of rubber to the bottom of your foot with a single lash of leather so it doesn’t shift orflop for eighty-seven miles of gritty, rocky trail. Then they were up and gone, hard on JohnnySandoval’s heels. By the time Ann Trason arrived at the aid station, Martimano Cervantes andJuan Herrera were out of sight. \\n\\n \\n\\n Sick pace, Sandoval thought, as he shot a glance over his shoulder. Anyone tell these guys it hadbeen raining here for the past two weeks? Sandoval knew they were heading straight into a worldof slop around the Twin Lakes marshes and down the muddy back end of Hope Pass. TheArkansas River would be a roaring mess; they’d have to haul themselves hand over hand along asafety rope to cross, and then claw their way two thousand feet to the top of Hope Pass. Then spinaround and do the same again coming home. \\n\\n \\n\\n Okay, this is suicide, Sandoval decided after he came through mile 23.5 in three hours and twentyminutes. I’ll save my strength and cream those guys when their tires go flat. He let MartimanoCervantes and Juan Herrera go—and almost immediately, he was passed by Ann Trason. Wherethe hell did she come from? Ann should know better; this was crash-and-burn speed. \\n\\n \\n\\n At the thirty-mile mark in Half Moon campground, Martimano and Juan were ready for breakfast. \\n\\n \\n\\n Kitty Williams slapped thin bean burritos into their hands. They ran on, chomping contentedly, andwere soon swallowed up by the thick woods around Mount Elbert. \\n\\n \\n\\n Ann raced in a few minutes later, pissed off and shouting. “Where’s Carl? Where the hell is he?” Itwas now 8:20 in the morning and she was ready to shuck weight by dumping her headlamp andjacket. But she was so far under record pace, her husband hadn’t yet made it to the aid station. \\n\\n \\n\\n To hell with him; Ann kept her night gear, and disappeared on the trail of the invisibleTarahumara. \\n\\n \\n\\n At mile 40, the crowd milled around the ancient wood firehouse in the tiny cabin village of TwinLakes, checking their watches. The first runners probably wouldn’t show up for another, oh, about—“There she is!” \\n\\n \\n\\n Ann had just crested the hill. Last year, it took Victoriano seven hours and twelve minutes to getthis far; Ann had done it in less than six. “No woman has ever led at this point in the race before,” \\n\\n \\n\\n said an incredulous Scott Tinley, the two-time world champion Ironman triathlete who was doingTV commentary for ABC’s Wide World of Sports. “We’re witnessing the most incredibledemonstration of raw courage in sports today.” \\n\\n \\n\\n Less than a minute later, Martimano and Juan popped out of the woods and came scrambling downthe hill behind her. Tony Post of Rockport was so swept up in the drama, he didn’t care for themoment that his boys were not only losing but had also shit-canned the shoes he was paying themto wear. “It was the most amazing thing,” said Post, once a nationally ranked marathoner himself,with times in the low 2:20s. “We were just flipping out, watching this woman take control.” \\n\\n \\n\\n Luckily, Ann’s husband was in position this time. He got a banana into Ann’s hands, then usheredher into the little firehouse for her medical exam. All Leadville runners need to have their pulseand weight checked at the forty-mile mark, because shedding pounds too quickly is an earlywarning sign of dangerous dehydration. Only with Doc Perna’s okay are they cleared to plungeinto the meat grinder ahead: there, looming across the marsh, was the twenty-six-hundred-footclimb to the top of Hope Pass. \\n\\n \\n\\n Ann munched the banana while a nurse named Cindy Corbin adjusted the scale. A moment later,Martimano stepped up on the scale beside Ann. \\n\\n \\n\\n “.Cómo estás?” Kitty Williams asked Martimano, laying an encouraging hand on his back. Howare you feeling after nearly six straight hours of high-altitude hill running at impossibly fast speed? \\n\\n \\n\\n “Ask him how it feels to get beat by a woman,” Ann called out. Nervous laughter rippled throughthe room, but Ann wasn’t smiling; she glared at Martimano as if she were a black belt and he was astack of bricks. Kitty shot her an appalled look, but Ann ignored it and kept her eyes locked onMartimano. Martimano turned questioningly toward Kitty, but Kitty chose not to translate. In allher years of running ultras and pacing them for her dad, it was the first time Kitty had ever heardone runner taunt another. \\n\\n \\n\\n Despite what most people in the room heard, a video of the incident would later suggest that whatAnn actually said was, “Ask him how it feels to compete with a woman.” But while her exactwords were debatable, her attitude was unmistakable: Ann didn’t just win by running hard; shewon by racing hard. This thing was going to be a death match. \\n\\n \\n\\n As Martimano got off the scale, Ann pushed past him and hurried out the door. She slung on herfanny pack—freshly loaded with carbohydrate gel, gloves, and a slicker in case she hit sleet orfreezing winds above the timberline—and began trotting down the road toward the snow-cappedmountain. She was outa there so fast, Martimano and Juan were still biting into slices of orangewhile Ann was heading around the corner and out of sight. \\n\\n \\n\\n What was wrong with her? The trash talk, the hasty exit—Ann didn’t even take time to slip on adry shirt and socks, or get a few more calories down her neck. And why was she even in the lead atall? Mile 40 was only round one of a very long fight. Once you jump ahead, you’re vulnerable;you surrender all element of surprise, and become a prisoner of your own pace. Even middle-school milers know that the smart tactic is to sit on the leader’s shoulder, go only as fast as youhave to, then jam ’er into gear and blow past on the bell lap. \\n\\n \\n\\n Classic example: Steve Prefontaine. Pre came out too quickly twice in the same race in the ’72Olympics; both times, he was chased down. By the home stretch, Pre had nothing left and fadedout of the medals to fourth. That historic defeat pounded home the lesson: nobody gives up thepursuit position if they don’t have to. Not unless you’re foolish, or reckless—or Garry Kasparov. \\n\\n \\n\\n In the 1990 World Chess Championship, Kasparov made a horrible mistake and lost his queenright at the start of a decisive game. Chess grand masters around the world let out a pained groan;the bad boy of the chessboard was now road kill (a less-gracious observer for The New YorkTimes visibly sneered). Except it wasn’t a mistake; Kasparov had deliberately sacrificed his mostpowerful piece in exchange for an even more powerful psychological advantage. He was deadliestwhen swashbuckling, when he was chased into a corner and had to slash, scramble, and improvisehis way out. Anatoly Karpov, his by-the-book opponent, was too conservative to pressureKasparov early in the game, so Kasparov put the pressure on himself with a Queen’s Gambit—andwon. \\n\\n \\n\\n That’s what Ann was doing. Instead of hunting the Tarahumara, she’d hit on the risky, inspiredstrategy of letting the Tarahumara hunt her. Who’s more committed to winning, after all: predatoror prey? The lion can lose and come back to hunt another day, but the antelope gets only onemistake. To defeat the Tarahumara, Ann knew she needed more than willpower: she needed fear. \\n\\n \\n\\n Once she was out front, every cracking twig would spur her toward the finish. \\n\\n \\n\\n “To into the lead making an act requiring fierceness and confidence,” Roger Bannistero(move) ncenoted.“Butfearm(means) ust play some part… no relaxation is possible, and all discretionis thrown to the wind.” \\n\\n \\n\\n Ann had fierceness and confidence to burn. Now she was deep-sixing discretion and letting fearplay its part. Ultrarunning was about to see its first Queen’s Gambit. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/lizhi/931/28246.html","bookId":254,"book":{"id":254,"title":"Born to Run 天生就会跑","description":"简介： 每天清晨，羚羊都知道，它必须跑得比最快的狮子快；狮子知道，它必须跑得比最慢的羚羊快。不管是狮子还是羚羊，太阳升起时，都要...","cover":"http://novel.tingroom.com/file/upload/201311/25/13-41-00-47-1.jpg","type":"Inspirational","link":"http://novel.tingroom.com/lizhi/931","creation":"Aug 1, 2019 12:18:27 AM","modification":"Aug 1, 2019 12:18:27 AM"}}
