{"id":65572,"no":39,"title":"Page 39","content":"I help her guide the end of the ladder through the classroom window and across the gap between buildings. Marcus helps us steady it. Fernando whoops when the ladder hits the Erudite window across the alley. “Time to break the glass,” I say. Fernando takes the glass-breaking device from his pocket and offers it to me. “You probably have the best aim.” “I wouldn’t count on it,” I say. “My right arm is out of commission. I’d have to throw with my left.” “I’ll do it,” says Christina. She presses the button on the side of the device and tosses it across the alley, underhand. I clench my hands as I wait for it to land. It bounces onto the windowsill and rolls into the glass. An orange light flashes, and all at once the window—and the windows above, below, and next to it—shatters into hundreds of tiny pebbles that shower over the Candor below. At the same time, the Candor twist and fire up into the sky. Everyone else drops to the ground, but I stay on my feet, part of me marveling at the perfect synchronicity of it, and the other part disgusted at how Jeanine Matthews has turned yet another faction from human beings into parts of a machine. None of the bullets even hit the classroom windows, let alone penetrate the room. When the Candor do not fire another round, I peer down at them. They have returned to their original position, half facing Madison Avenue and half facing Washington Street. “They respond to movement only, so . . . don’t fall off the ladder,” I say. “Whoever goes first will secure the ladder on the other side.” I notice that Marcus, who is supposed to selflessly offer himself up for every task, does not volunteer. “Not feeling very Stiff today, Marcus?” says Christina. “If I were you, I would be careful who you insult,” he says. “I am still the only person here who can find what we’re looking for.” “Is that a threat?” “I’ll go,” I say, before Marcus can answer. “I’m part Stiff too, right?” I shove the stunner under the waistband of my jeans and climb onto a desk to get a better angle on the window. Christina holds the ladder from the side as I clamber on top of it and start forward. Once I’m through the window, I position my feet on the narrow edges of the ladder and my hands on the rungs. The ladder feels about as solid and stable as an aluminum can. It creaks and sags beneath my weight. I try not to look down at the Candor; try not to think about their guns lifting and firing at me. Taking quick breaths, I stare at my destination, the Erudite window. Just a few rungs left. A breeze blows through the alley, pushing me to one side, and I think of scaling the Ferris wheel with Tobias. He kept me steady then. There is no one left to keep me steady now. I catch a glimpse of the ground, three stories down, the bricks smaller than they should be, the lines of Candor Jeanine enslaved. My arms—especially my right arm—ache as I inch my way across the gap. The ladder shifts, moving closer to the edge of the window frame on the other side. Christina is holding one side steady, but she can’t keep the ladder from slipping off the other windowsill. I grit my teeth and try not to move it too much, but I can’t move both legs at the same time. I have to let the ladder sway a little. Just four more rungs to go. The ladder jerks to the left, and then, as I move my right foot forward, I miss the edge of the rung. I yell as my body shifts to the side, my arms wrapping around the ladder and my leg dangling in space. “Are you okay?” Christina calls from behind me. I don’t answer. I bring my leg up and wedge it beneath my body. My fall made the ladder slip even farther off the windowsill. It is now supported by just a millimeter of concrete. I decide to move fast. I lurch toward the opposite windowsill just as the ladder slips off. My hands catch the sill and concrete scrapes my fingertips as they bear my body weight. Several voices behind me scream. I grit my teeth as I pull myself up, my right shoulder shrieking with pain. I kick at the brick building, hoping it will give me traction, but it doesn’t help. I scream into my teeth as I pull myself up and over the windowsill, half my body in the building and the other half still dangling. Thankfully Christina didn’t let the ladder drop too far. None of the Candor shoot me. I pull myself into the Erudite room across the alley. It is a bathroom. I collapse to the floor on my left shoulder, and try to breathe through the pain. Sweat trickles down my forehead. An Erudite woman comes out of a stall, and I scramble to my feet, draw the stunner, and point it at her, all without thinking. She freezes, her arms up, toilet paper stuck to her shoe. “Don’t shoot!” Her eyes bulge from her head. I remember, then, that I am dressed like the Erudite. I set the stunner on the edge of a sink. “My apologies,” I say. I try to adopt the formal speech common to the Erudite. “I am slightly edgy, with everything that’s occurring. We are reentering in order to retrieve some of our test results from . . . Laboratory 4-A.” “Oh,” the woman says. “That seems rather unwise.” “The data is of the utmost importance,” I say, trying to sound as arrogant as some of the Erudite I’ve met. “I would rather not leave it to get riddled with bullets.” “It’s hardly my place to prevent you from trying to recover it,” she says. “Now if you’ll excuse me, I’m going to wash my hands and take cover.” “Sounds good,” I say. I decide not to tell her she has toilet paper on her shoe. I turn back to the window. Across the alley, Christina and Fernando are trying to lift the ladder back onto the windowsill. Though my arms and hands ache, I lean out the window and grab the other end of the ladder, lifting it back onto the windowsill. Then I hold it in place as Christina crawls across. This time the ladder is more stable, and Christina makes it across the gap without trouble. She takes my place holding it as I shove the trash can in front of the door so no one else can come in. I then run my fingers under cool water to soothe them. “This is pretty smart, Tris,” she says. “You don’t have to sound so surprised.” “It’s just . . .” She pauses. “You had aptitude for Erudite, didn’t you?” “Does it matter?” I say too sharply. “The factions are destroyed, and it was all stupid to begin with.” I have never said anything like that before. I have never even thought it. But I’m surprised to find that I believe it—surprised to find that I agree with Tobias. “I wasn’t trying to insult you,” says Christina. “Having aptitude for Erudite isn’t a bad thing. Especially right now.” “Sorry. I’m just . . . tense. That’s all.” Marcus comes through the window and drops to the tile floor. Cara is surprisingly nimble—she moves over the rungs like she’s plucking banjo strings, touching each one only briefly before she moves to the next one. Fernando will be last, and he will be in the same position I was in, with the ladder secured from only one side. I move closer to the window so I can tell him to stop if I see the ladder slip. Fernando, who I didn’t think would have trouble, moves more awkwardly than anyone else. He has probably spent his entire life behind a computer or a book. He shuffles forward, his face bright red, and holds the rungs so tightly that his hands turn blotchy and purple. Halfway across the alley, I see something slip out of his pocket. It is his spectacles. I scream, “Fernan—” But I am too late. The spectacles fall, hit the edge of the ladder, and topple to the pavement. In a wave, the Candor below twist and fire upward. Fernando yells, and collapses against the ladder. One bullet hit his leg. I didn’t see where the others went, but I know when I see blood drip between the rungs of the ladder that it was not a good place. Fernando stares at Christina, his face ashen. Christina surges forward, through the window, about to reach for him. “Don’t be an idiot!” he says, his voice weak. “Leave me.” It is the last thing he says. CHAPTER FORTY-THREE CHRISTINA STEPS BACK into the room. We are all still. “I don’t mean to be insensitive,” says Marcus, “but we have to go before the Dauntless and factionless enter this building. If they haven’t already.” I hear tapping against the window and jerk my head to the side, for a split second believing that it is Fernando, trying to get in. But it’s just rain. We follow Cara out of the bathroom. She is our leader now. She knows Erudite headquarters best. Christina follows, then Marcus, then me. We leave the bathroom, and we are in an Erudite hallway like every other Erudite hallway: pale, bright, sterile. But this hallway is more active than I have ever seen it. People in Erudite blue sprint back and forth, in groups and alone, shouting things at each other like, “They’re at the front doors! Go as high as you can!” and “They’ve disabled the elevators! Run for the stairs!” It’s only there, in the midst of chaos, that I realize I forgot the stunner in the bathroom. I am unarmed again. Dauntless traitors also run past us, though they are less frantic than the Erudite. I wonder what Johanna, the Amity, and the Abnegation are doing in this chaos. Are they tending to the wounded? Or are they standing between Dauntless guns and Erudite innocents, taking bullets for the sake of peace? I shudder. Cara leads us to a back staircase, and we join a group of terrified Erudite as we run up one, two, three flights of stairs. Then Cara shoves her shoulder into a door next to the landing, holding her gun close to her chest. I recognize this floor. It is my floor. My thoughts become sluggish. I almost died here. I craved death here. I slow down and fall behind. I can’t break out of the daze, though people keep rushing past me, and Marcus shouts something at me, but his voice is muffled. Christina doubles back and grabs me, dragging me toward Control-A. Inside the control room, I see rows of computers but I don’t really see them; there is a film covering my eyes. I try to blink it away. Marcus sits at one of the computers, and Cara sits at another. They will send all the data from the Erudite computers to the other faction computers. Behind me, the door opens. And I hear Caleb say, “What are you doing here?” His voice wakes me. I turn and stare right at his gun. His eyes are my mother’s eyes—a dull green, almost gray, though his blue shirt makes their color appear more potent. “Caleb,” I say. “What do you think you’re doing?” “I’m here to stop whatever you’re doing!” His voice trembles. The gun wavers in his hands. “We’re here to save the Erudite data that the factionless want to destroy,” I say. “I don’t think you want to stop us.” “That’s not true,” he says. He jerks his head toward Marcus. “Why would you bring him if you weren’t trying to find something else? Something more important to him than all the Erudite data combined?” “She told you about it?” Marcus says. “You, a child?” “She didn’t tell me at first,” Caleb says. “But she didn’t want me to choose a side without knowing the facts!” “The facts,” says Marcus, “are that she is terrified of reality, and the Abnegation were not. Are not. And neither is your sister. To her credit.” I scowl. Even when he is complimenting me, I want to smack him. “My sister,” says Caleb gently, looking at me again, “doesn’t know what she’s getting into. Doesn’t know what it is that you want to show everyone . . . doesn’t know it will ruin everything!” “We are here to serve a purpose!” Marcus is almost yelling now. “We have completed our mission, and it is time for us to do what we were sent here to do!” I don’t know the purpose or the mission that Marcus is referring to, but Caleb doesn’t look confused. “We were not sent here,” Caleb says. “We have no responsibility to anyone but ourselves.” “That kind of self-interested thinking is what I have come to expect from those who have spent too much time with Jeanine Matthews. You are so unwilling to relinquish your comfort that your selfishness drains you of humanity!” I don’t care to hear more. While Caleb stares down Marcus, I turn and kick hard at Caleb’s wrist. The impact shocks him, and his gun topples from his hands. I slide it across the floor with my toes. “You need to trust me, Beatrice,” he says, chin wobbling. “After you helped her torture me? After you let her almost kill me?” “I didn’t help her tort—” “You certainly didn’t stop her! You were right there, and you just watched—” “What could I have done? What—” “You could have tried, you coward!” I scream so loud my face gets hot and tears jump into my eyes. “Tried, and failed, because you love me!” I gasp, just to take in enough air. All I hear is the click of keys as Cara works on the task at hand. Caleb doesn’t seem to have a response. His pleading look slowly disappears, replaced by a blank stare. “You won’t find what you’re looking for here,” he says. “She wouldn’t keep such important files on public computers. That would be illogical.” “So she hasn’t destroyed it?” Marcus says. Caleb shakes his head. “She does not believe in the destruction of information. Only its containment.” “Well, thank God for that,” says Marcus. “Where is she keeping it?” “I’m not going to tell you,” Caleb says. “I think I know,” I say. Caleb said she wouldn’t keep the information on a public computer. So he must mean she is keeping it on a private one: either the one in her office or the one in the laboratory Tori told me about.","sourceLink":"https://allnovel.net/insurgent-divergent-2/page-39.html","bookId":1699,"book":{"id":1699,"title":"Insurgent (Divergent #2)","description":"Storyline: Insurgent (Divergent #2) One choice can transform you—or it can destroy you. But every choice has consequences, and as unrest surges in the factions all around her, Tris Prior must continue trying to save those she loves—and herself—while grappling with haunting questions of grief and forgiveness, identity and loyalty, politics and love. Tris\u0027s initiation day should have been marked by celebration and victory with her chosen faction; instead, the day ended with unspeakable horrors. War now looms as conflict between the factions and their ideologies grows. And in times of war, sides must be chosen, secrets will emerge, and choices will become even more irrevocable—and even more powerful. Transformed by her own decisions but also by haunting grief and guilt, radical new discoveries, and shifting relationships, Tris must fully embrace her Divergence, even if she does not know what she may lose by doing so.","cover":"https://allnovel.net/images/insurgent-divergent-2.jpg","author":"Veronica Roth","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/insurgent-divergent-2.html","creation":"Oct 5, 2019 8:57:52 AM","modification":"Oct 5, 2019 9:57:44 AM"}}
