{"id":108377,"no":4,"title":"Page 4","content":"Madeleine had jumped on the bed in the middle of the night. She was there, curled in a large golden ball, when I woke up. Madeleine was an older cat now; she\u0027d been at least six when I\u0027d inherited her, and Jane Engle, her first owner, had now been dead for about three years. Madeleine still managed to catch the occasional mouse or bird, but she sometimes missed her jumps, and her facial fur seemed whiter to me. The vet gave her high marks on her annual checkups, and since everyone at his office would have loved to find an excuse to put Madeleine to sleep, I had to accept his verdict.\\n\\n Now she purred in a rusty way as I scratched behind her ears. Martin hated Madeleine getting on the bed, so she only got to stay there when he was gone; I vacuumed or washed the bedspread before he came home. As my fingers tickled lower on her neck, they encountered something unfamiliar.\\n\\n I sat up and really looked at Madeleine for the first time. In addition to her brown leather collar to which were attached her rabies disc and her name-and-address tag, something else had been tied around the cat\u0027s neck. It was a ribbon, a fresh-looking pink satin ribbon, tied in a precise, perky bow.\\n\\n I tried to come up with a reasonable explanation for the bow. It was ludicrous that something as pretty as a pink bow could frighten me.\\n\\n I looked at the clock. The Youngbloods would be up. I punched in their number on the bed- table phone.\\n\\n \"Yep,\" said Shelby flatly.\\n\\n \"I\u0027m sorry to call you this early in the morning. But unless you or Angel did this, and frankly I can\u0027t see how or why you would, someone caught Madeleine and got her to hold still while he tied a ribbon around her neck.\"\\n\\n \"Run that by again.\"\\n\\n \"A man or woman. Got hold of Madeleine the cat. And tied a pink ribbon. Around Madeleine\u0027s neck.\"\\n\\n \"Why the hell would anyone do that? That cat would as soon dismember you as look at you.\"\\n\\n \"Did Angel tell you about the flowers?\"\\n\\n \"No.\"\\n\\n Then I remembered they\u0027d had more important things to talk about the night before.\\n\\n \"Someone ordered flowers delivered to this address yesterday. The card was unsigned.\" I told Shelby what the card had said. \"Either your wife or I have an unknown admirer. This is unsettling.\"\\n\\n \"I\u0027ll be over there soon.\"\\n\\n \"To do what? Look at the ribbon? What good would that do?\"\\n\\n Shelby was silent for a minute.\\n\\n \"I\u0027ll take the cat to the vet this morning,\" he said. \"He needs to draw some blood to find out if she was drugged. And I do want a look at the ribbon. We need to keep it, in case we have to call the police.\"\\n\\n \"Okay. I\u0027ll cut it off with scissors.\"\\n\\n \"Then I\u0027ll come to get her in about ten minutes.\"\\n\\n Very casually, so as not to alert Madeleine, I got my fingernail scissors from my vanity table. I began scratching her gently behind the ears again, and she stretched her neck and purred. Then I scratched her forehead, so she\u0027d shut her eyes. Gently, gently, I slid the thin blade of the scissors under the pink band, and just as gently I closed the blades together. Of course, the little snick of the scissors and the feeling of release brought Madeleine\u0027s head up with a snap and she bit the hell out of me. I\u0027d expected it; Madeleine had never been a cat who\u0027d known tolerance or temperance, and most often she was a sorry pet indeed.\\n\\n After I\u0027d sworn a little and put antiseptic on my wound, I wrapped my robe around me and retrieved the cat carrier from its storage in a downstairs closet. Right on time, Shelby knocked on the kitchen door.\\n\\n I punched in the code to deactivate the alarm and let Shelby in. Shelby, so tall and pockmarked and grim, can be intimidating. I had come to be at ease with Angel, but Shelby still made me a little anxious.\\n\\n This morning was different.\\n\\n \"Roe, you got time to talk?\" he asked quietly.\\n\\n I glanced at the clock. I didn\u0027t have to be at the library for an hour.\\n\\n \"Sure,\" I said. \"Want some coffee?\"\\n\\n He shook his head. \"Roe,\" he said directly while I poured a cup of my own, \"have you ever seen anyone out here when I was gone?\"\\n\\n I set my coffee down with a thunk, walked over to Shelby Youngblood, and slapped the tar out of him. I was so mad I couldn\u0027t talk for a second.\\n\\n \"Don\u0027t you ever ever imply that your wife has been unfaithful to you!\" I told him. \"If you had been there in that doctor\u0027s office yesterday and seen how upset she was, if you had seen how scared she was you wouldn\u0027t believe her, you would never say a stupid thing like that.\"\\n\\n And then I realized Shelby wasn\u0027t the only one saying and doing stupid things. I had just slapped someone who could snap my neck quicker than I could picture him doing it.\\n\\n \"So you believe what this doctor says?\" Shelby asked in a controlled, reasonable voice.\\n\\n \"Sure I do. You know Angel. You and she are just like male and female halves of the same thing.\"\\n\\n \"But that female half is pregnant and that male half had a vasectomy.\"\\n\\n \"So go get tested,\" I challenged him. \"Would you rather go\"--and here I was stuck for a moment over how to put it--\"put a specimen in a jar at the doctor\u0027s, or would you rather believe your wife cheated on you?\"\\n\\n \"Put that way ...\" he said, and to my amazement he hugged me.\\n\\n It was then that I learned a lesson about the vagaries of chemistry. I loved Martin, and Shelby loved Angel. But for a moment, something crackled in my quiet morning kitchen, and I was very conscious that my breasts were not tucked in a bra. I looked up at Shelby and saw his eyes darken, before the current of electricity reversed and we flew apart.\\n\\n If we didn\u0027t acknowledge it, it would be even worse.\\n\\n \"We\u0027d better not do that again,\" I said weakly, and found I needed to clear my throat. I turned away and took a swallow of coffee.\\n\\n Shelby was silent. I peeked at him and saw he was still in the same spot, his arms still out a little. \"Shelby?\" I said anxiously.\\n\\n He jumped. \"Right,\" he said, doing a little swallowing of his own. \"Martin would kill you and Angel would sure kill me, and we\u0027d deserve it.\"\\n\\n I drew my cloak of niceness back around me. I had never wanted to be one of those people I\u0027d secretly scorned, people who could not keep their promises.\\n\\n \"We\u0027d better hurry,\" I said briskly. \"I\u0027ve got to get to work and you know how long it can take to catch Madeleine.\"\\n\\n The decoration of Madeleine proved to be a strange start to a strange day. Every staff member at the library had gotten out of bed on the wrong side, even Sam Clerrick. As Sam hopped all over Lillian Schmidt for speaking sharply to a patron the day before--we could hear his voice in his office as we put our things away in the lockers--I raised my eyebrows significantly at Perry Allison. He rolled his eyes in the direction of the office, in a what-are-you-gonna-do gesture.\\n\\n Perry, the only child of Sally Allison, had worked at the library before, about three years ago. Overwhelming emotional problems and some substance abuse had put him in a hospital and then an outpatient home in Atlanta, where he\u0027d flourished. After long thought and much negotiation, Sam had agreed to rehire Perry on a provisional basis.\\n\\n Perry had terrified me before, but now I tended to think his time in the hospital and in the home had been time well spent. Perry, who was my age, seemed to be on an even keel and well in control of himself. Perry had dark hair, which he wore in a fashionable brush cut on top and rather longer on the sides and back. He had brown eyes, like his mother, and they were magnified by the aviator-style wire-rims he affected. Though he was weedy in build, Perry always looked good in the starched shirts and bright silk ties he regarded as his work uniform.\\n\\n As we both shut our lockers and tried not to listen too obviously to Sam\u0027s high voice, I realized that I\u0027d accepted Perry with few reservations. At first it\u0027d been hard, working with someone I used to be frightened of; I\u0027d been tense every day. Now, I almost took him for granted.\\n\\n \"Who\u0027d Lillian offend?\" I whispered.\\n\\n \"Cile Vernon. You didn\u0027t hear?\"\\n\\n I shook my head, pouring myself a cup of coffee from the staff pot. It had been Lillian\u0027s morning to make it, and whatever her other faults, she made good coffee.\\n\\n \"Cile wanted to check out one of Anne Rice\u0027s witch books, and Lillian told her she wouldn\u0027t like them, they were full of witchcraft and sex, and Cile said she was sixty-two, she ought to be able to read whatever the hell she wanted.\"\\n\\n \"She did not!\"\\n\\n \"Yep, she did. And then she marched into Sam\u0027s office and said for a librarian to comment on what a reader checked out was tantamount to censorship.\"\\n\\n \"Sam waited all this time to talk to Lillian about it?\"\\n\\n \"He had to go yesterday afternoon, after you got off work. He and Marva went to help Bess Burns pick out Jack\u0027s coffin.\"\\n\\n \"The kids haven\u0027t gotten in yet?\"\\n\\n \"They\u0027d just gotten in, they were wiped out. I hear they\u0027re furious someone killed Jack, but not exactly devastated with grief that he\u0027s gone. I hear he\u0027d been drinking a lot.\"\\n\\n I thought about the mooshy feelings I\u0027d been having over Angel\u0027s pregnancy, and I realized I was seeing the flip side of the coin. Children and parents didn\u0027t always have close and loving relationships. Like marriages, the pairing of parents and offspring sometimes didn\u0027t work out.\\n\\n As I went to my desk in the children\u0027s area, I reminded myself forcefully that bearing a healthy child didn\u0027t mean you lived happily ever after.\\n\\n Then I saw my aide Beverly, remembered this was the morning we worked together, and felt my day take another downturn. Fixing a pleasant smile on my face, I sat at my desk.\\n\\n Beverly was shelving books and muttering to herself. This was one of Beverly\u0027s most irritating habits, especially since I was almost sure she was saying unflattering things about me just low enough for me to miss. Despite my mental recital of her good qualities only the day before, I felt my heart sink at the prospect of trying to deal with the woman. That chip on her shoulder was the size of Stone Mountain, and everything you asked of her, everything you said or did, had to be filtered through Beverly\u0027s resentment.\\n\\n Feeling the familiar twinges of guilt, I recited my comforting mantra to myself: I was as glad to see black library patrons as white, I thought black kids were as cute as white kids, I worked as well with black librarians as white. Except Beverly Rillington.\\n\\n Still, there were days when Beverly would just do her work and I\u0027d just do mine, and I\u0027d hoped fervently this would be one of those days.\\n\\n But it wasn\u0027t.\\n\\n I could hear the book cart slamming into corners as she rolled it along from shelf to shelf. The muttering faded and grew stronger as she turned from the cart to the shelf, then back to the cart. I couldn\u0027t quite make it out, of course, but I had a stronger-than-ever feeling it had to do with my faults.\\n\\n I sighed and unlocked the desk to get out my scheduling notebook. I had two telephone message slips waiting on the blotter, and they both contained requests for special storytelling times for a couple of day-care centers. WeeOnes had asked for the time I\u0027d slotted for another group; I searched the appointment book and made a note of two different times it would be convenient for them to come. Kid Kare Korner wanted to come in the afternoon; that would be feasible only if I stayed late or if Beverly were willing to do the story hour.\\n\\n I sighed again. Getting to be a habit.\\n\\n It would almost be better to work late without getting paid for it than to ask Beverly to do a story time. She violently resented being asked to do it, but she was offended if you didn\u0027t ask. In a cowardly way, I put off making a decision, and began to work on the list of suggested books one of the kindergarten teachers had asked me to prepare. I\u0027d gone over the list compiled by the previous children\u0027s librarian and taken a dislike to a few of the books she routinely recommended, so when a new list had become necessary I\u0027d found myself combing the shelves. I had a pile on the table in front of me I\u0027d been reading, and I picked up the top one to whittle down my stack still further. \"Some of us have to come in here and really work, not just sit at a damn desk,\" the muttering resumed, suddenly quite clear.\\n\\n I clenched my hands. I read another page. If the children\u0027s area had been a real room, instead of a corner of the ground floor, I would have shut the door and had a discussion with Beverly. As it was, I could just hope to ignore her until I could talk to her away from the patrons. There weren\u0027t many, but there were some; I saw Arthur Smith waiting impatiently at the checkout desk while Lillian put a pile of children\u0027s videos into a bag, and Sally had come in and was talking to Perry in a hushed tone by the water fountain. A youngish man I didn\u0027t know was browsing through the new books shelved close to the entrance, and it occurred to me that he\u0027d been there an awfully long time.\\n\\n To my surprise, Angel came in the double front doors, dressed quietly in blue jeans and a striped T-shirt. She was carrying a shopping bag from Marcus Hatfield and a gift-wrapped box. I didn\u0027t recall Angel ever coming all the way inside the library before, and she was looking around now curiously, her head turning smoothly from side to side like a large cat surveying a new territory.\\n\\n She spied me and came toward me just as the volcano that was Beverly Rillington erupted.\\n\\n \"Does just one of us work here?\" Beverly asked venomously, approaching me from the left side.\\n\\n \"What?\" I could not believe I was hearing her correctly, and her stance was even more threatening. Beverly was too close, her hands clenched, leaning forward, aggression in every line of her body. Beverly had never been pleasant, but she was obviously under a stress so extreme she had lost all judgment.\\n\\n I was afraid that if I stood up Beverly would actually hit me, so I stayed in my chair at the low desk with the open book in one hand. Angel, who was approaching Beverly from the side, had quietly put down the bag and box. I suddenly knew I couldn\u0027t bear it if Angel defended me here in the library, my own stomping ground.\\n\\n \"Beverly,\" I said very quietly, aware that Perry and Sally had looked over curiously. Well, just about everyone was looking over. \"Beverly, you are mad at me, but let\u0027s not work it out here. We can go in the staff room or Sam\u0027s office.\"\\n\\n \"All you have to do is do your damn job,\" Beverly hissed. \"You\u0027re sitting on your butt doing nothing, I\u0027m doing all the work.\"\\n\\n There\u0027s very little point carrying on a conversation with someone who is absolutely convinced you are wrong and bad. Instead of thinking of strategies I found myself speculating, not for the first time, on Beverly\u0027s mental health. But I had to defuse the situation somehow; Angel\u0027s face had gone blank and she was concentrating on Beverly as a target. If Beverly took one step closer to me, Angel would hit her. And then where would we be?\\n\\n \"Maybe you\u0027re right,\" I said. \"Maybe you\u0027ve been doing too much of the work and I haven\u0027t been pulling my share. Why don\u0027t we talk to Sam about it?\"\\n\\n \"He\u0027ll just side with you,\" Beverly said, but there wasn\u0027t quite as much repressed fury in her voice as before.\\n\\n \"I\u0027ll call him right now,\" I said, and lifted the phone and punched in the correct numbers.\\n\\n \"Sam,\" I said briskly when he picked up the receiver, \"Beverly and I are having some problems working together. Beverly feels she\u0027s carrying too heavy a load.\"\\n\\n \"She does,\" Sam said thoughtfully. I heard his chair creak as he leaned back. \"It has been more work for her, not having a full-time librarian in that section.\"\\n\\n \"We\u0027d better make an appointment to meet with you and discuss it,\" I said very evenly. \"In your office.\"\\n\\n \"Roe, do you have a situation out there?\"\\n\\n \"As soon as possible,\" I said, so calmly I could have been discussing spraying the roses for aphids.\\n\\n \"Right. I gotcha. Okay, then, one o\u0027clock today when you get off.\"\\n\\n \"That\u0027s fine. I\u0027ll tell her.\"\\n\\n \"We\u0027re to meet in his office at one o\u0027clock,\" I told Beverly, putting the phone down very gently. To my relief, her posture was less aggressive. Sally had gone back to talking to her son, but Perry\u0027s eyes remained on us watchfully. Arthur was browsing through the new books, though he\u0027d completed checking out the videos. A couple of other patrons who had tried to listen without showing overt attention, courteous Southerners that they were, went back to their activities with some relief.\\n\\n Beverly turned to resume work, I thought, and spotted Angel. \"Whatchu lookin\u0027 at?\" Beverly snarled, in an exaggerated street drawl. The two women stared at each other for a long minute. But even Beverly had to concede defeat against Angel, and with a \"Humph!\" to show contempt and save face, Beverly returned to her book cart.\\n\\n I bent back over the book on my desk and put my hands down in my lap to hide their shaking. Tears stung my eyes. Things happening in public were so much worse than things happening in private, and if anything had happened in the library ... if it had come to blows between Angel and Beverly ... in the library!\\n\\n Oh, I just hated for people to see me cry. And of course there weren\u0027t any Kleenex in my desk drawer. A crying child had used the last one two days ago and I\u0027d forgotten to restock. Hellfire and damnation.\\n\\n A hand appeared under my nose, a white cotton handkerchief in it. The hand dropped the handkerchief on the desk, and I swooped it up gratefully and applied it to my dripping eyes and nose.\\n\\n \"Thanks, Arthur,\" I said in the clogged voice that is one of the more attractive features of crying.\\n\\n \"Don\u0027t mention it,\" he said. \"How\u0027d you know it was me?\"\\n\\n \"I remember your hands,\" I said without thinking.\\n\\n I looked up in horror when I realized what I\u0027d said, and saw that Arthur\u0027s face was slowly flushing red, as it always had when he ... well, when we had personal moments.\\n\\n If today got any better, I\u0027d just spend tomorrow locked in the attic of my house. It\u0027d be a safer place.\\n\\n Angel was standing at a discreet distance, her eyes on Beverly, who had gone back to shelving books. At the front desk, Lillian was now eyeing Arthur and me with avid curiosity. Sally was gone, and Perry was watering the large, ugly potted plant (I am not an indoor plant person) that flanked the double main doors.\\n\\n Arthur slowly returned to his normal coloring, said \"Good-bye\" in a rough voice, and left. The water in the plant overflowed into the large dish the pot sits in. Lillian bent down to get a book from below the counter to hand to the young man, and Angel handed me the gift-wrapped package.\\n\\n It was as if someone had changed channels on a television. Suddenly, everything was back to normal. The Beverly incident might not have happened.\\n\\n \"It\u0027s for you, for taking me to the doctor yesterday. And I don\u0027t know what you said to Shelby, but suddenly he seems okay about this. Who\u0027s the bitch over there?\"\\n\\n \"Thanks for the gift. Shelby loves you. Beverly Rillington.\"\\n\\n \"What\u0027s her problem?\"\\n\\n \"I\u0027ll tell you later,\" I said quietly, hoping Beverly wasn\u0027t listening. \"Can I open my present now?\" I tried to scrape up a smile that would pass for normal.\\n\\n \"Sure,\" Angel said. \"Guess what I\u0027ve got in my shopping bag.\"\\n\\n Angel was being a will-o`-the-wisp today. Generally, I\u0027d found Angel to be a very thorough, slow worker, unless you were in her professional field, martial arts and protection services. Then she was quick and lethal.\\n\\n Now, this quick, lethal woman had bought me a golden brown silk blouse that I thought was perfectly lovely.\\n\\n I told her so.\\n\\n \"It looked like something you would wear,\" she said shyly. \"Is that the right size?\"\\n\\n \"Yes,\" I said happily. \"Thanks a lot, Angel. I hope you bought yourself something?\"\\n\\n Angel looked proudly embarrassed. From her Marcus Hatfield bag she pulled a maternity T- shirt in white and blue, a white maternity blouse, and a black jumper.\\n\\n \"Oh, they\u0027re pretty. Are pants going to be a problem?\"\\n\\n \"Sure are,\" she said, perching on the edge of my desk and refolding her purchases. \"I\u0027m too tall for all the pants and about four fifths of the dresses I tried on. This jumper\u0027ll have to do.\"\\n\\n \"You need a dress soon?\" I asked. I\u0027d never known Angel to wear a dress.\\n\\n \"Yes. The funeral,\" she explained. \"Jack Burns. You know?\" And she made a graphic tumbling motion with her long thin hand, culminating in a splat on the surface of my desk.\\n\\n \"When is it?\"\\n\\n \"Within a week. They\u0027ll have the body back by then.\"\\n\\n \"And you\u0027re going?\"\\n\\n \"I feel like I ought to, somehow,\" Angel said. \"I knew him, too. You know, besides the ticket thing.\"\\n\\n I tried not to stare. \"No. I didn\u0027t know that.\" \"He had started coming to the Athletic Club in the evenings, getting on the treadmill. He knew I lived out by you.\"\\n\\n \"He talked about me?\"\\n\\n \"Yeah,\" she said casually, slipping her hand through the plastic grips of the shopping bag. \"He had a bee in his bonnet about you, Roe. Well, see ya later.\" And she strode out, golden and tall and lean, and for the first time since I\u0027d met her, radiantly happy. \\n\\n","sourceLink":"https://allnovel.net/dead-over-heels-aurora-teagarden-5/page-4.html","bookId":2240,"book":{"id":2240,"title":"Dead Over Heels (Aurora Teagarden #5)","description":"Storyline: Dead Over Heels (Aurora Teagarden Mysteries #5) \\n What\u0027s the world coming to - when you can\u0027t relax with an ice-cold beverage in your own backyard without a body falling from the sky and landing in your garden? Part-time librarian and frequent amateur investigator Roe Teagarden has good reason to ask herself this question when the remains of one of the Lawrenceton, Georgia police department\u0027s finest catapults into her flower bed one beautiful sunny morning. Roe\u0027s friend and bodyguard, the long-legged, bikini-clad Angel Youngblood, is mowing the grass and Roe is reclining on a lounger when a small red-and-white plane flies low overhead and drops its unlikely debris more or less at Roe\u0027s feet. Roe\u0027s husband of two years, wealthy businessman Martin Bartell, immediately wonders if the killer chose his dumping place to send some kind of message to Roe. And the mystery deepens when two federal agents arrive in town to investigate the murder. It\u0027s only when Madeleine the cat provides a clue that Roe and Martin realize Roe herself may be in danger and that using Roe\u0027s yard as a temporary landfill for dead bodies was no accident.\\n","cover":"https://allnovel.net/images/dead-over-heels-aurora-teagarden-5.jpg","author":"Charlaine Harris","type":"Mystery","source":"allnovel","link":"https://allnovel.net/dead-over-heels-aurora-teagarden-5.html","creation":"Oct 5, 2019 8:58:30 AM","modification":"Oct 5, 2019 11:19:29 PM"}}
