{"id":35055,"no":33,"title":"Chapter 33","content":"`I am going to Richmond,\u0027 she told me. `Our lesson is, that there are two Richmonds, one in Surrey and one Yorkshire, and that mine is the Surrey Richmond. The distance is ten miles. I am to have a carriage, and you are to take me. This is my purse, and you are to pay my charges out of it. Oh, you must take the purse! We have no choice, you and I, but to obey our instructions. We are not free to follow our own devices, you and I.\u0027 As she looked at me in giving me the purse, I hoped there was an inner meaning in her words. She said them slightingly, but not with displeasure. `A carriage will have to be sent for, Estella. Will you rest here a little?\u0027 `Yes, I am to rest here a little, and I am to drink some tea, and you are to take care of me the while.\u0027 She drew her arm through mine, as if it must be done, and I requested a waiter who had been staring at the coach like a man who had never seen such a thing in his life, to show us a private sitting-room. Upon that, he pulled out a napkin, as if it were a magic clue without which he couldn\u0027t find the way up-stairs, and led us to the black hole of the establishment: fitted up with a diminishing mirror (quite a superfluous article considering the hole\u0027s proportions), an anchovy sauce-cruet, and somebody\u0027s pattens. On my objecting to this retreat, he took us into another room with a dinner-table for thirty, and in the grate a scorched leaf of a copy-book under a bushel of coal-dust. Having looked at this extinct conflagration and shaken his head, he took my order: which, proving to be merely `Some tea for the lady,\u0027 sent him out of the room in a very low state of mind. I was, and I am, sensible that the air of this chamber, in its strong combination of stable with soup-stock, might have led one to infer that the coaching department was not doing well, and that the enterprising proprietor was boiling down the horses for the refreshment department. Yet the room was all in all to me, Estella being in it. I thought that with her I could have been happy there for life. (I was not at all happy there at the time, observe, and I knew it well.) `Where are you going to, at Richmond?\u0027 I asked Estella. `I am going to live,\u0027 said she, `at a great expense, with a lady there, who has the power - or says she has - of taking me about, and introducing me, and showing people to me and showing me to people.\u0027 `I suppose you will be glad of variety and admiration?\u0027 `Yes, I suppose so.\u0027 She answered so carelessly, that I said, `You speak of yourself as if you were some one else.\u0027 `Where did you learn how I speak of others? Come, come,\u0027 said Estella, smiling delightfully, `you must not expect me to go to school to you; I must talk in my own way. How do you thrive with Mr Pocket?\u0027 `I live quite pleasantly there; at least--\u0027 It appeared to me that I was losing a chance. `At least?\u0027 repeated Estella. `As pleasantly as I could anywhere, away from you.\u0027 `You silly boy,\u0027 said Estella, quite composedly, `how can you talk such nonsense? Your friend Mr Matthew, I believe, is superior to the rest of his family?\u0027 `Very superior indeed. He is nobody\u0027s enemy--\u0027 `Don\u0027t add but his own,\u0027 interposed Estella, `for I hate that class of man. But he really is disinterested, and above small jealousy and spite, I have heard?\u0027 `I am sure I have every reason to say so.\u0027 `You have not every reason to say so of the rest of his people,\u0027 said Estella, nodding at me with an expression of face that was at once grave and rallying, `for they beset Miss Havisham with reports and insinuations to your disadvantage. They watch you, misrepresent you, write letters about you (anonymous sometimes), and you are the torment and the occupation of their lives. You can scarcely realize to yourself the hatred those people feel for you.\u0027 `They do me no harm, I hope?\u0027 Instead of answering, Estella burst out laughing. This was very singular to me, and I looked at her in considerable perplexity. When she left off - and she had not laughed languidly, but with real enjoyment - I said, in my diffident way with her: `I hope I may suppose that you would not be amused if they did me any harm.\u0027 `No, no you may be sure of that,\u0027 said Estella. `You may be certain that I laugh because they fail. Oh, those people with Miss Havisham, and the tortures they undergo!\u0027 She laughed again, and even now when she had told me why, her laughter was very singular to me, for I could not doubt its being genuine, and yet it seemed too much for the occasion. I thought there must really be something more here than I knew; she saw the thought in my mind, and answered it. `It is not easy for even you.\u0027 said Estella, `to know what satisfaction it gives me to see those people thwarted, or what an enjoyable sense of the ridiculous I have when they are made ridiculous. For you were not brought up in that strange house from a mere baby. - I was. You had not your little wits sharpened by their intriguing against you, suppressed and defenceless, under the mask of sympathy and pity and what not that is soft and soothing. - I had. You did not gradually open your round childish eyes wider and wider to the discovery of that impostor of a woman who calculates her stores of peace of mind for when she wakes up in the night. - I did.\u0027 I was no laughing matter with Estella now, nor was she summoning these remembrances from any shallow place. I would not have been the cause of that look of hers, for all my expectations in a heap. `Two things I can tell you,\u0027 said Estella. `First, notwithstanding the proverb that constant dropping will wear away a stone, you may set your mind at rest that these people never will - never would, in hundred years - impair your ground with Miss Havisham, in any particular, great or small. Second, I am beholden to you as the cause of their being so busy and so mean in vain, and there is my hand upon it.\u0027 As she gave it me playfully - for her darker mood had been but momentary - I held it and put it to my lips. `You ridiculous boy,\u0027 said Estella, `will you never take warning? Or do you kiss my hand in the same spirit in which I once let you kiss my cheek?\u0027 `What spirit was that?\u0027 said I. `I must think a moment A spirit of contempt for the fawners and plotters.\u0027 `If I say yes, may I kiss the cheek again?\u0027 `You should have asked before you touched the hand. But, yes, if you like.\u0027 I leaned down, and her calm face was like a statue\u0027s. `Now,\u0027 said Estella, gliding away the instant I touched her cheek, `you are to take care that I have some tea, and you are to take me to Richmond.\u0027 Her reverting to this tone as if our association were forced upon us and we were mere puppets, gave me pain; but everything in our intercourse did give me pain. Whatever her tone with me happened to be, I could put no trust in it, and build no hope on it; and yet I went on against trust and against hope. Why repeat it a thousand times? So it always was. I rang for the tea, and the waiter, reappearing with his magic clue, brought in by degrees some fifty adjuncts to that refreshment but of tea not a glimpse. A teaboard, cups and saucers, plates, knives and forks (including carvers), spoons (various), saltcellars, a meek little muffin confined with the utmost precaution under a strong iron cover, Moses in the bullrushes typified by a soft bit of butter in a quantity of parsley, a pale loaf with a powdered head, two proof impressions of the bars of the kitchen fire-place on triangular bits of bread, and ultimately a fat family urn: which the waiter staggered in with, expressing in his countenance burden and suffering. After a prolonged absence at this stage of the entertainment, he at length came back with a casket of precious appearance containing twigs. These I steeped in hot water, and so from the whole of these appliances extracted one cup of I don\u0027t know what, for Estella. The bill paid, and the waiter remembered, and the ostler not forgotten, and the chambermaid taken into consideration - in a word, the whole house bribed into a state of contempt and animosity, and Estella\u0027s purse much lightened - we got into our post-coach and drove away. Turning into Cheapside and rattling up Newgate-street, we were soon under the walls of which I was so ashamed. `What place is that?\u0027 Estella asked me. I made a foolish pretence of not at first recognizing it, and then told her. As she looked at it, and drew in her head again, murmuring `Wretches!\u0027 I would not have confessed to my visit for any consideration. `Mr Jaggers,\u0027 said I, by way of putting it neatly on somebody else, `has the reputation of being more in the secrets of that dismal place than any man in London.\u0027 `He is more in the secrets of every place, I think,\u0027 said Estella, in a low voice. `You have been accustomed to see him often, I suppose?\u0027 `I have been accustomed to see him at uncertain intervals, ever since I can remember. But I know him no better now, that I did before I could speak plainly. What is your own experience of him? Do you advance with him?\u0027 `Once habituated to his distrustful manner,\u0027 said I, `I have done very well.\u0027 `Are you intimate?\u0027 `I have dined with him at his private house.\u0027 `I fancy,\u0027 said Estella, shrinking `that must be a curious place.\u0027 `It is a curious place.\u0027 I should have been chary of discussing my guardian too freely even with her; but I should have gone on with the subject so far as to describe the dinner in Gerrard-street, if we had not then come into a sudden glare of gas. It seemed, while it lasted, to be all alight and alive with that inexplicable feeling I had had before; and when we were out of it, I was as much dazed for a few moments as if I had been in Lightning. So, we fell into other talk, and it was principally about the way by which we were travelling, and about what parts of London lay on this side of it, and what on that. The great city was almost new to her, she told me, for she had never left Miss Havisham\u0027s neighbourhood until she had gone to France, and she had merely passed through London then in going and returning. I asked her if my guardian had any charge of her while she remained here? To that she emphatically said `God forbid!\u0027 and no more. It was impossible for me to avoid seeing that she cared to attract me; that she made herself winning; and would have won me even if the task had needed pains. Yet this made me none the happier, for, even if she had not taken that tone of our being disposed of by others, I should have felt that she held my heart in her hand because she wilfully chose to do it, and not because it would have wrung any tenderness in her, to crush it and throw it away. When we passed through Hammersmith, I showed her where Mr Matthew Pocket lived, and said it was no great way from Richmond, and that I hoped I should see her sometimes. `Oh yes, you are see me; you are to come when you think proper; you are to be mentioned to the family; indeed you are already mentioned.\u0027 I inquired was it a large household she was going to be a member of? `No; there are only two; mother and daughter. The mother is a lady of some station, though not averse to increasing her income.\u0027 `I wonder Miss Havisham could part with you again so soon.\u0027 `It is a part of Miss Havisham\u0027s plans for me, Pip,\u0027said Estella, with a sigh, as if she were tired; `I am to write to her constantly and see her regularly and report how I go on - I and the jewels - for they are nearly all mine now.\u0027 It was the first time she had ever called me by my name. Of course she did so, purposely, and knew that I should treasure it up. We came to Richmond all too soon, and our destination there, was a house by the Green; a staid old house, where hoops and powder and patches, embroidered coats rolled stockings ruffles and swords, had had their court days many a time. Some ancient trees before the house were still cut into fashions as formal and unnatural as the hoops and wigs and stiff skirts; but their own allotted places in the great procession of the dead were not far off, and they would soon drop into them and go the silent way of the rest. A bell with an old voice - which I dare say in its time had often said to the house, Here is the green farthingale, Here is the diamondhilted sword, Here are the shoes with red heels and the blue solitaire, - sounded gravely in the moonlight, and two cherrycoloured maids came fluttering out to receive Estella. The doorway soon absorbed her boxes, and she gave me her hand and a smile, and said good night, and was absorbed likewise. And still I stood looking at the house, thinking how happy I should be if I lived there with her, and knowing that I never was happy with her, but always miserable. I got into the carriage to be taken back to Hammersmith, and I got in with a bad heart-ache, and I got out with a worse heart-ache. At our own door, I found little Jane Pocket coming home from a little party escorted by her little lover; and I envied her little lover, in spite of his being subject to Flopson. Mr Pocket was out lecturing; for, he was a most delightful lecturer on domestic economy, and his treatises on the management of children and servants were considered the very best text-books on those themes. But, Mrs Pocket was at home, and was in a little difficulty, on account of the baby\u0027s having been accommodated with a needle-case to keep him quiet during the unaccountable absence (with a relative in the Foot Guards) of Millers. And more needles were missing, than it could be regarded as quite wholesome for a patient of such tender years either to apply externally or to take as a tonic Mr Pocket being justly celebrated for giving most excellent practical advice, and for having a clear and sound perception of things and a highly judicious mind, I had some notion in my heartache of begging him to accept my confidence. But, happening to look up at Mrs Pocket as she sat reading her book of dignities after prescribing Bed as a sovereign remedy for baby, I thought - Well - No, I wouldn\u0027t. 在我看来，埃斯苔娜今天比以往任何时候都更加风雅秀美。她穿了一件毛皮的旅行大衣，仪表也更加楚楚动人，比以往任何时候都更富于吸引力，使我对她倾倒。我看得出是郝维仙小姐对她施加的影响，她才有今天的变化。 我们来到旅馆，走进院子时，她就指给我看她带来的行李。待把行李整顿到一起，我这才想起还不知道她的去向，因为除了她本身外，我把一切早已忘得干干净净。 “我要到雷溪梦去。”她告诉我，“我知道有两个雷溪梦，一个在苏利，另一个在约克郡，我要去的是苏利的雷溪梦，离这儿有十英里。我得去雇一辆马车，然后你把我送过去。这是我的钱袋，你从里面拿钱出来付车费。噢，你必须拿着这钱袋！无论是你还是我都不能选择，只有服从命令。无论是你还是我都不能想干什么就干什么。” 她在把钱袋递到我手上时望着我，我希望能悟出她的话中之话。她说话时虽有些儿轻蔑意思，但没有看出有什么不愉快。 “埃斯苔娜，马车得找人去叫，你是不是在这儿休息一会儿？” “好吧，我在这儿先休息一会儿，我还想喝点茶，你这会儿要陪陪我。” 她把她的手臂伸过来挽住我的手臂，好像她非得这样做不可。我告诉一个茶房给我们找一间安静的屋子，他这时正睁大了眼睛看着那辆驿车，真好像在他一辈子中从来没有见过这东西似的。他听到我的话后便拿出一条餐巾，好像这是一条神秘线索，不带上它就不可能上楼似的。他把我们领到楼上一间黑洞洞的屋子里，里面有一面没有框架的镜子（就这间小黑屋子的大小来看，这面镜子实在是件多余的物品）、一个盛着(鱼是)鱼汁的佐料瓶和一双不知是谁穿的木拖鞋。由于我不喜欢这一处，他便领我们到了另一个房间，里面摆了一张可供三十个人用餐的大餐桌，壁炉里有一蒲式耳的煤灰，煤灰下面有一页烧焦了的抄本纸。这个茶房看了一眼这一堆已经熄灭的死灰，摇了摇头，便来听我点饭菜，可我只叫他为这位小姐沏茶，他于是垂头丧气地走了出去。 我一闻这个房间里的空气，是一股强烈的马厩和马肉汤混合气味，至今难忘。这便不得已使我想到是否驿站的生意不佳，老板便把马宰了用肉煮汤在饮食服务部出售。不过，只要埃斯苔娜在这里，我就心满意足，其他一切也就顾不到了。我思忖着，只要和她在一起，我一生便会幸福，其实，我心中非常明白，就在当时，我也一点儿也不幸福。 “你到雷溪梦的什么地方呢？”我问埃斯苔娜。 “我到雷溪梦，”她答道，“和一位夫人住在那里，过一种豪华的生活。她有能力让我见世面，领我出人上流社会，让我见识名流，也让名流见识见识我。” “我想你也很高兴经历环境的变化，博得更多人的崇拜吧？” “对了，我想是这样的。” 她那么极其随便地回答，我便又问道：“你看你谈自己的事就好像谈别人的事一样。” “你从什么地方知道我是怎么样讲别人的？得啦，别这么说，”埃斯苔娜得意地笑着说道，“你不要期望我来接受你的教训。我有我自己的谈话方式。我倒要问问你，你和鄱凯特先生相处得怎样？” “我生活在那里很愉快，至少——”我感到我又失去了一次机会。 “至少？”埃斯苔娜问道。 “不和你在一起，就是愉快，也只是一般性的愉快。” “你这个傻孩子，”埃斯苔娜非常沉静地说道，“你怎么谈这种无意义的话？我们谈谈你的朋友马休先生吧，我想他一定比他家其余的人都好吧？” “他确实比其余人更好，不和别人为仇——” “还要加上他也不和自己作对，”埃斯苔娜打断我的话头说，“我最恨专门和自己作对的人。不过，我听说他倒是真的不贪图私利，妒忌。怨恨这一类的恶性他是没有的。” “我也这样看，一点不假。” “你就不能说他家其余的人也像他那样一点不假了，”埃斯苔娜说着，对我点点头，脸上现出严肃的神情，又带些嘲笑的意味，“他们总是围在郝维仙小姐左右，缠着不放，一方面巧妙巴结，一方面打你的小报告，把你讲得一无是处。他们监视你，造你的谣，写信说你的坏话，甚至于写匿名信，说他们一辈子被你坑害了，他们也要一辈子恨你，而你一点也不知道他们是怎么样地恨你。” “我希望，他们不至于伤害我吧？” 埃斯苔娜没有答复，反而笑了起来。我想这可有些叫人纳闷，便带着非常迷惑不解的神情看着她。她这笑不是没精打采的，而是充满了快意。一直等她笑完了，我才有些羞怯地对她说道： “他们要是真对我有所伤害，我想你不至于幸灾乐祸吧？” “我不会的，你可以放心好了，”埃斯苔娜说道，“你该相信我笑是因为他们伤害不了你。哦，那些围住郝维仙小姐纠缠不放的人，结果害人反害己，自己倒霉！” 说着她又大笑起来。虽然她告诉了我笑的原因，我还是感到纳闷。我相信她的笑是出自内心的真情，可是又觉得她的笑过了分。我思索着，是不是其中还有别的我尚未知晓的原因。她看出了我心中的疑窦，于是便解答式地说道： “我看到这些人受折腾，心中多么地高兴，你自然是一下子难以明白的。这些人的愚蠢可笑行为使我多么开心想笑呵。因为你不是从婴儿起就被关在这所怪房子里长大的，而我是在这怪房子中长大的。这些人表面上同情你，可怜你，暗地里布下阴谋诡计陷害你，因为你忍气吞声，无人帮助，所以听起来句句是甜言蜜语。你没有把脑子磨炼得聪明起来，我的脑子却给磨炼得聪明起来了。你那双孩子气的幼稚眼睛没有慢慢地睁大起来，所以也就没有看见那种女骗子专门睁眼说瞎话的行为，她们从来不关心别人，偏偏说由于关心别人夜里睡不着觉。你看不清楚这些，我可是看得一清二楚。” 埃斯苔娜说到这里，可以看出，她重提旧事并不是把它作为笑料的，也不是从她个人的浅见出发。她的这副样子不会是由于我的大笔遗产而造成的。 “有两件事我可以告诉你，”埃斯苔娜说道，“第一件，虽然俗语说滴水穿石，但你可以不去理会它；你可以放心，这般人即使花上一百年时间也不会得逞，无论在大事或小事上都不会破坏郝维仙小姐对你的看法；第二件，正因为这些人疲于奔命，尽其卑鄙之能事来反对你而忽视了我，我倒要感谢你，这我可以发誓。” 这时，她满脸的愁云在霎时间内完全消逝了。她风趣地把一只手伸给我，我捧住它在嘴边吻了一下。“你这个可笑的孩子，”埃斯苔娜说道，“你真是不接受我的劝告。也许你现在吻我的手和当年我让你吻我的脸是同一个意思？” “那是什么意思？”我问道。 “我得想一下，是一种对拍马屁和搞阴谋的轻视。” “要是我说是，我可以再吻一下你的脸吗？” “在你吻我的手之前你就该问了。不过，只要你高兴，我答应你。” 于是我俯下身子。她的面孔安详得像一尊雕像，简直是毫无情感。我的嘴唇刚接触到她的脸，她便躲闪开来，说道：“现在你叫人把茶水给我送来，你还得马上送我到雷溪梦去。” 她的语调又恢复到老样子，好像我们之间的来往都是被人强迫的，而我们只不过是傀儡而已，这使我内心十分痛苦。其实，我们之间来往的哪一件事不使我痛苦呢？无论她用什么语气对待我，我都不能对它信以为真，或对它怀抱希望；同时也不能绝对不信，或者绝对失望。反正事情就是如此，何必去重复一千次一万次呢？ 我打铃要茶，那位茶房又带着他那条神秘线索的餐巾来了，并且一次一次地搬进五十多件餐具，就是看不见茶。他拿进来的有茶盘、茶杯、盆子、茶碟、刀叉，包括大切刀，还有各式调羹、盐瓶；一块柔软的小松饼，上面盖着紧紧的铁盖；一块松软的奶油，下面垫着为数不少的荷兰芹，看上去真像《圣经》中躺在蒲草箱中的胖娃娃摩西；一块面包，上面撒了粉状的东西；另外还有两块三角形的面包，上面留着烤箱铁格的烙印；最后才是一把肥胖的家用茶壶。茶房拖着脚步走进走出，面孔上表现出疲倦和受苦的样子，拖延了好半天才把东西放好，然后才拿来一只外表精致的小盒子，里面放的是小树枝一般的茶叶。我这才冲开水沏茶，又随手从这一大堆餐具中拿了一只茶杯，倒了一杯给埃斯苔娜。 喝完茶后随即付账，自然没有忘记给茶房小费，给马车夫小费，连女侍者也没有忽视。总之，整个旅馆的人都得到了好处，结果弄得他们好像受了污辱，甚至射来敌视的眼光。埃斯苔娜的钱袋变轻了。我们登上马车后即刻离去。马车一转弯便驶进了齐普塞德，叮叮当当地在新门街上前进，两旁是高高的围墙。我一看到这围墙便感到羞愧。 “这儿是什么地方？”埃斯苔娜问我。 起先我愚蠢地装作没有认出是什么地方，然后才告诉她是什么地方。她伸出头望了望，又把头缩回来，低低说了一声：“全都是坏蛋！”当然我一定不会告诉她刚才我还来过这里呢。 我这时轻而易举地把话题引到了别人身上，说：“贾格斯先生在这个鬼地方可有名望呢，他掌握了许多秘密，在伦敦是没有人可以和他相比的。” “在我看来，无论什么地方他掌握的秘密都比别人多。”埃斯苔娜低低地说。 “我猜，你常和他见面吧，对他的一套已经习惯了。” “自从我能记事开始，和他见面确是习以为常，不过见面的时间是不定的。至今我还是对他了解不深，了解的程度和我刚刚学话时对他的了解差不多。你和他打交道，觉得他怎么样？你和他相处还好吗？” “我习惯了他那种对一切怀疑的神气后，”我对她说道，“和他相处倒是蛮好的。” “你们来往亲密无间吗？” “我只到他家中吃过饭。” 埃斯苔娜犹豫了一下，说道：“我想他住的房子也是个古怪希奇的地方。” “是个古怪希奇的所在。” 我本该小心谨慎地谈论我的监护人，结果却自由地和她谈了起来；如果当时我们没有突然被煤气灯的亮光照射得头昏眼花，我就会详细告诉她那次在吉拉德街吃饭的情况。亮光持续着，好像四周全被照得通亮，我心头出现一种从来没遇到过的、难以言说的感觉。一直走过了这一地段，我还感到眼花了几分钟，就好像身处于闪电之中。 我们的话题由此而改变，主要谈论着我们马车所经过的这条路，如这条路左边是伦敦的什么地方，右边又是伦敦的什么地方。对她来说，这座大城市也是陌生的。她告诉我，在她去法国之前一直未离郝维仙小姐左右，即使到法国也只是来去两次经过伦敦而已。我又问她，她现在住在伦敦，是否也受我的监护人监管。听了这句话，她斩钉截铁地答道：“但愿不受他监管！”只说了这一句，其他的话就没有了。 她一心专注于吸引我，想战胜我。只要达到令我倾心于她，她可以不惜任何代价。我想逃避这点是绝对不可能的。然而，这并不能使我愉快，因为即使她没有表现出我们之间的来往全由别人一手安排的意思，我也意识到她把我的心紧紧地抓在她的手中，无非是出于她自己的任性而已，而不是因为她对我有任何柔情蜜意，舍不得把我的心捏碎，然后再把捏碎的心抛掉。 我们的马车经过汉莫史密斯时，我把马休·鄱凯特先生的住房指给她看，并且告诉她这里离雷溪梦不太远，我表示希望以后有机会到雷溪梦去看她。 “噢，那当然了，你要来看我；你觉得什么时候合适，就什么时候来看我。我会把你的名字告诉那家人，其实早就提到过你的名字了。” 我问她，她现在去的那一家是不是有很多人的大家庭？ “不是大家庭，只有两个人，也就是母女两人。母亲是个贵妇人，很有社会影响，我想，但对于增加收入来说，她是不会反对的。” “我真想知道为什么你刚回来，郝维仙小姐却又愿意和你分开。” “皮普，这是郝维仙小姐培养我的一项计划，”埃斯苔娜叹了口气，好像带有十分的倦意，说道，“现在我要常给她写信，定期回去看她，向她汇报我的情况，包括我的珠宝情况，因为那些珠宝现在几乎全都归我所有了。” 这是她第一次用“皮普”称呼我。当然，她如此称呼是故意的，因为她知道我很珍视这种称呼。 我们很快便抵达雷溪梦，在那绿色如茵的草地上矗立着一座庄严而古老的宅邸，这便是我们的目的地。很久以前，这里是宫廷所在地。当年每逢朝觐之日，曾有无数宫娥身着丽裙，面敷暗粉，脸贴美人斑；而英雄骑士们则身穿锦绣外衣，双腿外罩长袜，头上羽毛飞扬，手中刀剑生辉。这所宅邸前有几棵古老树木，仍然修剪得整整齐齐，但是看上去就和那些丽裙假发一样，和四周很不相称。可是这些树木和业已逝去的当年主人相距不远，看来不久也将加入他们的亡魂行列，进入永恒的寂。 苍老的门铃声响起。一听这铃声我不由在想这座宅邸的往昔，铃声不时通报着：身着鲸骨箍撑起的华贵绿裙的王妃到；手执钻石镶成的佩剑的骑士到；脚蹬红色后跟镶蓝宝石鞋的夫人到。而现在正当门铃声肃穆地在月光下回荡时，两位身穿樱桃红衣服的侍女飘然而出，来迎接埃斯苔娜。随即，她的箱子行李在那扇门后面消失了。她把手伸给我，微笑着向我道过晚安，然后也在那扇门后面消失了。而我仍旧痴呆地站在那里，傻乎乎地默望看房子，心想，假如我和她一起住在这里将会多么幸福！然而我明明知道，如果和她在一起我将永远得不到幸福，得到的永远只是不幸。 我重上马车，由它把我带回到汉莫史密斯。上车时我感到心情苦闷，下车时心情更加苦闷。在门口，我看到小珍妮·鄱凯特刚从一个小型舞会上回来，由她的小情人陪着。尽管这位小情人受到芙萝普莘的管制，但我对他倒是挺羡慕的。 鄱凯特先生出外讲学去了，在家庭管理方面他是最出色的教师，他写的关于如何管理儿童和仆役方面的论文被一致认为是这一领域最优秀的教科书。不过，鄱凯特夫人正在家中，她遇上了麻烦事，因为米耐丝不告而出（她有个亲戚在近卫步兵团里），鄱凯特夫人只好拿了一个针盒子给小宝宝玩，让它乖乖地不吵，结果针盒子中的针少了好多；就是拿这些针给小宝宝打针治病，像这样幼小的孩子怎么能经受得住，如果再把它当作补药吃进去，那可更不得了。 鄱凯特先生在家庭管理方面的献计献策是出了名的，而且既实用又有效，合情合理，条理分明，准确无误。我正打算把我的伤心事全盘向他倾诉，以求获得他的指点，但是抬起头，只看到鄱凯特夫人坐在那儿看她的贵族谱，小宝贝已被放到了床上，好像床是治病的神灵。于是，我刚才的念头全被打消了，心想，算了，我不必倾诉了。","sourceLink":"http://novel.tingroom.com/jingdian/78/4541.html","bookId":540,"book":{"id":540,"title":"Great Expectations远大前程","description":"简介： Great Expectations is a novel by Charles Dickens. It was first published in serial form in the publication All the Year Round from 1 December 1860 to August 1861. It has been adapted for stage and screen over 250 times. Great ...","cover":"http://novel.tingroom.com/uploads/allimg/101230/12888310603d944.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/78","creation":"Aug 1, 2019 12:18:56 AM","modification":"Aug 1, 2019 12:18:56 AM"}}
