{"id":35080,"no":58,"title":"Chapter 58","content":"Early in the morning while my breakfast was getting ready, I strolled round by Satis House. There were printed bills on the gate, and on bits of carpet hanging out of the windows, announcing a sale by auction of the Household Furniture and Effects, next week. The House itself was to be sold as old building materials and pulled down. LOT1 was marked in whitewashed knock-knee letters on the brew house; LOT2 on that part of the main building which had been so long shut up. Other lots were marked off on other parts of the structure, and the ivy had been torn down to make room for the inscriptions, and much of it trailed low in the dust and was withered already. Stepping in for a moment at the open gate and looking around me with the uncomfortable air of a stranger who had no business there, I saw the auctioneer\u0027s clerk walking on the casks and telling them off for the information of a catalogue compiler, pen in hand, who made a temporary desk of the wheeled chair I had so often pushed along to the tune of Old Clem.\n When I got back to my breakfast in the Boar\u0027s coffee-room, I found Mr Pumblechook conversing with the landlord. Mr Pumblechook (not improved in appearance by his late nocturnal adventure) was waiting for me, and addressed me in the following terms.\n `Young man, I am sorry to see you brought low. But what else could be expected! What else could be expected!\u0027\n As he extended his hand with a magnificently forgiving air, and as I was broken by illness and unfit to quarrel, I took it.\n `William,\u0027 said Mr Pumblechook to the waiter, `put a muffin on table. And has it come to this! Has it come to this!\u0027\n I frowningly sat down t my breakfast. Mr Pumblechook stood over me and poured out my tea - before I could touch the teapot - with the air of a benefactor who was resolved to be true to the last.\n `William,\u0027 said Mr Pumblechook, mournfully, `put the salt on. In happier times,\u0027 addressing me, `I think you too sugar. And did you take milk? You did. Sugar and milk. William, bring a watercress.\u0027\n `Thank you,\u0027 said I, shortly, `but I don\u0027t eat watercresses.\u0027\n `You don\u0027t eat \u0027em,\u0027 returned Mr Pumblechook, sighing and nodding his head several times, as if he might have expected that, and as if abstinence from watercresses were consistent with my downfall. `True. The simple fruits of the earth. No. You needn\u0027t bring any, William.\u0027\n I went on with my breakfast, and Mr Pumblechook continued to stand over me, staring fishily and breathing noisily, as he always did.\n `Little more than skin and bone!\u0027 mused Mr Pumblechook, aloud. `And yet when he went from here (I may say with my blessing), and I spread afore him my humble store, like the Bee, he was as plump as a Peach!\u0027\n This reminded me of the wonderful difference between the servile manner in which he had offered his hand in my new prosperity, saying, `May I?\u0027 and the ostentatious clemency with which he had just now exhibited the same fat five fingers.\n `Hah!\u0027 he went on, handing me the bread-and-butter. `And air you a going to Joseph?\u0027\n `In heaven\u0027s name,\u0027 said I, firing in spite of myself, `what does it matter to you where I am going? Leave that teapot alone.\u0027\n It was the worst course I could have taken, because it gave Pumblechook the opportunity he wanted.\n `Yes, young man,\u0027 said he, releasing the handle of the article in question, retiring a step or two from my table, and speaking for the behoof of the landlord and waiter at the door, `I will leave that teapot alone. You are right, young man. For once, you are right. I forgit myself when I take such an interest in your breakfast, as to wish your frame, exhausted by the debilitating effects of prodigygality, to be stimilated by the \u0027olesome nourishment of your forefathers. And yet,\u0027 said Pumblechook, turning to the landlord and waiter, and pointing me out at arm\u0027s length, `this is him as I ever sported with in his days of happy infancy! Tell me not it cannot be; I tell you this is him!\u0027\n A low murmur from the two replied. The waiter appeared to be particularly affected.\n `This is him,\u0027 said Pumblechook, `as I have rode in my shaycart. This is him as I have seen brought up by hand. This is him untoe the sister of which I was uncle by marriage, as her name was Georgiana M\u0027ria from her own mother, let him deny it if he can!\u0027\n The waiter seemed convinced that I could not deny it, and that it gave the case a black look.\n `Young man,\u0027 said Pumblechook, screwing his head at me in the old fashion, `you air a going to Joseph. What does it matter to me, you ask me, where you air going? I say to you, Sir, you air a going to Joseph.\u0027\n The waiter coughed, as if he modestly invited to get over that.\n `Now,\u0027 said Pumblechook, and all this with a most exasperating air of saying in the cause of virtue what was perfectly convincing and conclusive, `I will tell you what to say to Joseph. Here is Squires of the Boar present, known and respected in this town, and here is William, which his father\u0027s name was Potkins if I do not deceive myself.\u0027\n `You do not, sir,\u0027 said William.\n `In their presence,\u0027 pursued Pumblechook, `I will tell you, young man, what to say to Joseph. Says you, \"Joseph, I have this day seen my earliest benefactor and the founder of my fortun\u0027s. I will name no names, Joseph, but so they are pleased to call him up-town, and I have seen that man.\"\n `I swear I don\u0027t see him here,\u0027 said I.\n `Say that likewise,\u0027 retorted Pumblechook. `Say you said that, and even Joseph will probably betray surprise.\u0027\n `There you quite mistake him,\u0027 said I. `I know better.\u0027\n `Says you,\u0027 Pumblechook went on, `\"Joseph, I have seen that man, and that man bears you no malice and bears me no malice. He knows your character, Joseph, and is well acquainted with your pig-headedness and ignorance; and he knows my character, Joseph, and he knows my want of gratitoode. Yes, Joseph,\" says you,\u0027 here Pumblechook shook his head and hand at me, `\"he knows my total deficiency of common human gratitoode. He knows it, Joseph, as none can. You do not know it, Joseph, having no call to know it, but that man do.\"\u0027\n Windy donkey as he was, it really amazed me that he could have the face to talk thus to mine.\n `Says you, \"Joseph, he gave me a little message, which I will now repeat. It was, that in my being brought low, he saw the finger of Providence. He knowed that finger when he saw it, Joseph, and he saw it plain. It pinted out this writing, Joseph. Reward of ingratitoode to his earliest benefactor, and founder of fortun\u0027s. But that man said he did not repent of what he had done, Joseph. Not at all. It was right to do it, it was kind to do it, it was benevolent to do it, and he would do it again.\"\u0027\n `It\u0027s pity,\u0027 said I, scornfully, as I finished my interrupted breakfast, `that the man did not say what he had done and would do again.\u0027\n `Squires of the Boar!\u0027 Pumblechook was now addressing the landlord, `and William! I have no objections to your mentioning, either up-town or down-town, if such should be your wishes, that it was right to do it, kind to do it, benevolent to do it, and that I would do it again.\u0027\n With those words the Impostor shook them both by the hand, with an air, and left the house; leaving me much more astonished than delighted by the virtues of that same indefinite `it.\u0027 `I was not long after him in leaving the house too, and when I went down the High-street I saw him holding forth (no doubt to the same effect) at his shop door to a select group, who honoured me with very unfavourable glances as I passed on the opposite side of the way.\n But, it was only the pleasanter to turn to Biddy and to Joe, whose great forbearance shone more brightly than before, if that could be, contrasted with this brazen pretender. I went towards them slowly, for my limbs were weak, but with a sense of increasing relief as I drew nearer to them, and a sense of leaving arrogance and untruthfulness further and further behind.\n The June weather was delicious. The sky was blue, the larks were soaring high over the green corn, I thought all that country-side more beautiful and peaceful by far than I had ever known it to be yet. Many pleasant pictures of the life that I would lead there, and of the change for the better that would come over my character when I had a guiding spirit at my side whose simple faith and clear home-wisdom I had proved, beguiled my way. They awakened a tender emotion in me; for, my heart was softened by my return, and such a change had come to pass, that I felt like one who was toiling home barefoot from distant travel, and whose wanderings had lasted many years.\n The schoolhouse where Biddy was mistress, I had never seen; but, the little roundabout lane by which I entered the village for quietness\u0027 sake, took me past it. I was disappointed to find that the day was a holiday; no children were there, and Biddy\u0027s house was closed. Some hopeful notion of seeing her busily engaged in her daily duties, before she saw me, had been in my mind and was defeated.\n But, the forge was a very short distance off, and I went towards it under the sweet green limes, listening for the clink of Joe\u0027s hammer. Long after I ought to have heard it, and long after I had fancied I heard it and found it but a fancy, all was still. The limes were there, and the white thorns were there, and the chestnut-trees were there, and their leaves rustled harmoniously when I stopped to listen; but, the clink of Joe\u0027s hammer was not in the midsummer wind.\n Almost fearing, without knowing why, to come in view of the forge, I saw it at last, and saw that it was closed. No gleam of fire, no glittering shower of sparks, no roar of bellows; all shut up, and still.\n But, the house was not deserted, and the best parlour seemed to be in use, for there were white curtains fluttering in its window, and the window was open and gay with flowers. I went softly towards it, meaning to peep over the flowers, when Joe and Biddy stood before me, arm in arm.\n At first Biddy gave a cry, as if she thought it was my apparition, but in another moment she was in my embrace. I wept to see her, and she wept to see me; I, because she looked so fresh and pleasant; she, because I looked so worn and white.\n `But dear Biddy, how smart you are!\u0027\n `Yes, dear Pip.\u0027\n `And Joe, how smart you are!\u0027\n `Yes, dear old Pip, old chap.\u0027\n I looked at both of them, from one to the other, and then--\n `It\u0027s my wedding-day,\u0027 cried Biddy, in a burst of happiness, `and I am married to Joe!\u0027\n They had taken me into the kitchen, and I had laid my head down on the old deal table. Biddy held one of my hands to her lips, and Joe\u0027s restoring touch was on my shoulder. `Which he warn\u0027t strong enough, my dear, fur to be surprised,\u0027 said Joe. And Biddy said, `I ought to have thought of it, dear Joe, but I was too happy.\u0027 They were both so overjoyed to see me, so proud to see me, so touched by my coming to them, so delighted that I should have come by accident to make their day complete!\n My first thought was one of great thankfulness that I had never breathed this last baffled hope to Joe. How often, while he was with me in my illness, had it risen to my lips. How irrevocable would have been his knowledge of it, if he had remained with me but another hour!\n `Dear Biddy,\u0027 said I, `you have the best husband in the whole world, and if you could have seen him by my bed you would have - But no, you couldn\u0027t love him better than you do.\u0027\n `No, I couldn\u0027t indeed,\u0027 said Biddy.\n `And, dear Joe, you have the best wife in the whole world, and she will make you as happy as even you deserve to be, you dear, good, noble Joe!\u0027\n Joe looked at me with a quivering lip, and fairly put his sleeve before his eyes.\n `And Joe and Biddy both, as you have been to church to-day, and are in charity and love with all mankind, receive my humble thanks for all you have done for me and all I have so ill repaid!And when I say that I am going away within the hour, for I am soon going abroad, and that I shall never rest until I have worked for the money with which you have kept me out of prison, and have sent it to you, don\u0027t think, dear Joe and Biddy, that if I could repay it a thousand times over, I suppose I could cancel a farthing of the debt I owe you, or that I would do so if I could!\u0027\n They were both melted by these words, and both entreated me to say no more.\n `But I must say more. Dear Joe, I hope you will have children to love, and that some little fellow will sit in this chimney corner of a winter night, who may remind you of another little fellow gone out of it for ever. Don\u0027t tell him, Joe, that I was thankless; don\u0027t tell him, Biddy, that I was ungenerous and unjust; only tell him that I honoured you both, because you were both so good and true, and that, as your child, I said it would natural to him to grow up a much better man than I did.\u0027\n `I ain\u0027t a going,\u0027 said Joe, from behind his sleeve, `to tell him nothink o\u0027 that natur, Pip. Nor Biddy ain\u0027t. Nor yet no one ain\u0027t.\u0027\n `And now, though I know you have already done it in your own kind hearts, pray tell me, both, that you forgive me! Pray let me hear you say the words, that I may carry the sound of them away with me, and then I shall be able to believe that you can trust me, and think better of me, in the time to come!\u0027\n `O dear old Pip, old chap,\u0027 said Joe. `God knows as I forgive you, if I have anythink to forgive!\u0027\n `Amen! And God knows I do!\u0027 echoed Biddy.\n Now let me go and look at my old little room, and rest there a few minutes by myself, and then when I have eaten and drunk with you, go with me as far as the finger-post, dear Joe and Biddy, before we say good-bye!\u0027\n I sold all I had, and put aside as much as I could, for a composition with my creditors - who gave me ample time to pay them in full - and I went out and joined Herbert. Within a month, I had quitted England, and within two months I was clerk to Clarriker and Co., and within four months I assumed my first undivided responsibility. For, the beam across the parlour ceiling at Mill Pond Bank, had then ceased to tremble under old Bill Barley\u0027s growls and was at peace, and Herbert had gone away to marry Clara, and I was left in sole charge of the Eastern Branch until he brought her back.\n Many a year went round, before I was a partner in the House; but, Iived happily with Herbert and his wife, and lived frugally, and paid my debts, and maintained a constant correspondence with Biddy and Joe. It was not until I become third in the Firm, that Clarriker betrayed me to Herbert; but, he then declared that the secret of Herbert\u0027s partnership had been long enough upon his conscience, and he must tell it. So, he told it, and Herbert was as much moved as amazed, and the dear fellow and I were not the worse friends for the long concealment. I must not leave it to be supposed that we were ever a great house, or that we made mints of money. We were not in a grand way of business, but we had a good name, and worked for our profits, and did very well. We owed so much to Herbert\u0027s ever cheerful industry and readiness, that I often wondered how I had conceived that old idea of his inaptitude, until I was one day enlightened by the reflection, that perhaps the inaptitude had never been in him at all, but had been in me.\n \n 我还没有回到故土，关于我幸福扫地、走投无路的传闻已传遍了故乡各地。我看出蓝野猪饭店也获得了这一信息，我看到这头野猪对我的态度也大大改变，和以往不能相比。在我青云直上财运亨通的时候，这头野猪对我热情备至，极力关怀，奉承拍马，什么事都做得到；如今我黄鹤已去，正在走下坡路时，这头野猪对我一转而异常冷酷，置之不理。\n 那日的傍晚时分我才抵达蓝野猪饭店，虽然往昔我来往此间轻松自如，而今天却已疲惫不堪。这头野猪再不让我住进往昔的那间豪华居室，说是已有人住（一定是让给另外一位有大笔遗产的人了），把我塞进一间非常不起眼的屋子中住。这间房靠在院子那头，旁边养着鸽子和拖车的马。然而在这间屋子里我却睡去了一个香甜的夜，和在豪华房间里没有两样；我在这间屋子里也做了美好的梦，不比住在美好房间中所做的美好的梦差。\n 次日一早趁饭店正在准备早餐的时候，我去到沙提斯庄园，在旁边转了一圈。大门上面和挂在窗子上的挂毯上面都贴了招租广告，说明这所宅邸的一切家具等物都将于下个星期进行公开拍卖。至于房屋本身会全部拆毁以后当建筑材料卖出。在制酒作坊的墙上用石灰水刷上了一号地区字样，字是东斜西歪的；那所长久封闭不开门窗的主宅标明是二号地区。这所宅邸的其他地方标明了不同的号码，为了方便在墙上写号码，常春藤从上面被拉扯下来，拖挂在泥地上，并且已经枯黄。我顺着敞开的大门漫步而人，在里面逗留片刻，放眼观望四周景物，好比是一个无事可干的陌生人，怀着不自在的神情冷眼看着这一切。我看到拍卖行的职员正在啤酒桶上面踱着步子，并数着桶的数目，以便编人目录，笔拿在手上。这里放着的临时用办公桌就是当年我时常一面推一面唱着《老克莱门之歌》时的轮椅。\n 然后我回到蓝野猪饭店的餐厅吃早饭，一回来便看到彭波契克先生正和老板谈话。尽管上次夜里被盗使他吃惊不小，而表面上并没有什么两样。彭波契克先生分明在等着我，所以一看到我他便用下面的话招呼我。\n “年轻人，看到你从半空摔下来我心里很难受。可是，你又怎么会不掉下来呢！你又怎么会不摔下来呢！”\n 他带着一副威严的神态，宽洪大量地伸出了手，我因为生病身体衰弱，不宜和他争论，便也伸手给他。\n “威廉，”彭波契克先生对茶房说道，“拿一盘松饼来。竟然搞得这么糟，竟然搞得这么糟！”\n 我坐在那里紧锁着双眉吃早餐，彭波契克先生站在我旁边，我正准备去拿茶杯，他却为我倒了一杯。他摆出一副恩主的样子，并下定决心把恩主这个角色扮演到底。\n “威廉，”彭波契克先生又以一副忧伤的神情说道，“来撒点盐在上面。”然后又转身对我说：“在你走运的时候你是撒糖的吧？还加牛奶吗？你会的。糖和牛奶都要加。威廉，拿点儿水芹菜来。”\n “谢谢你，”我简短地说道，”可是我不吃水芹菜。”\n “你不吃水芹菜。”彭波契克先生答道，又是叹气，又是点头，这么叹气点头了几次，好像他早就意料到了，正是不吃水芹菜才使得我走下坡路的。“是嘛，水芹菜是地上生的贫贱菜。威廉，你就不要拿了。”\n 我继续吃着我的早餐，而彭波契克先生也仍然站在我旁边，用鱼一样的眼睛盯着我望，鼻子呼吸时发出的响声，声声可闻。这是他的生性，历来如此。\n “瘦得只剩下皮和骨头了！”彭波契克先生在思考着，却又把思考的话大声地说了出来。“记得你离开这里的时候（我当时还为之祝福呢），我把我用蜜蜂的勤劳所积攒的一点儿微不足道的东西放在你的餐桌上呢，那时你长得多丰满，和一只桃子一样。”\n 这一说倒提醒了我一件事。记得在我刚交好运的时候，他曾奴颜婢膝地把手伸给我，总是说，“我能否？”而现在他又伸出同样的五根胖指头，却招摇过市地摆出长者宽厚的风度，这两者之间的差别是多么悬殊啊。\n “嘿！”他一面把奶油面包递给我，一面继续说道，“你到约瑟夫那里去吗？”\n 我不禁生起一腔怒火，“老实告诉你，我到哪里去和你毫无关系，和你有关系吗？不要动我的茶壶。”\n 我的这一句话是最坏的下策，反而给了彭波契克一个机会来表演他正想做的事。\n “是的，年轻人，”他说着把茶壶丢了下来，并且从我桌边向后退了一两步，便开始来奚落我，然而他实际上是说给站在门口的老板和茶房听的。“我不动你的茶壶。你很对，年轻人。也仅此一次你说得对，年轻人。我忘了自己身份，我想你在外面花天酒地，弄得一贫如洗，才叫了一份你祖宗喜欢吃的营养品作为你的早餐，对你的身体有好处。”彭波契克转身向着门口的老板和茶房伸直了他的臂膀，却指着我说道：“你们看就是这个人，我在他幼小时就陪他度过幸福的童年。你们不要以为这不可能，我告诉你们的是事实，就是这个人。”\n 店主和茶房都低低地不知说了什么附和的话。茶房显得特别感兴趣。\n “就是这个人，”彭波契克说道，“我让他一直乘坐我的马车。就是这个人，我亲眼看到由他姐姐一手拉扯大的。就是这个人，我就是他姐姐丈夫的舅舅，她姐姐的名字是乔其雅娜·马丽娅，沿用了她母亲的名字，这是事实，就让他不承认吧！”\n 这个茶房似乎相信我是否认不了了的，正因此我才摆出了这副面孔。\n “年轻人，”彭波契克用他的老方法又把头转向我说道，“你到约瑟夫家去。你问我，你到约瑟夫那里去和我有什么关系？我告诉你，先生，要知道你是到约瑟夫那里去。”\n 这个茶房咳了一声，这意思仿佛是客气地要我讲讲理由。\n 彭波契克摆出一副令人气愤的神情，满嘴的仁义道德，仿佛都是颠扑不破的真理，说道：“现在，我会告诉你，你该对约瑟夫说些什么。看这里有蓝野猪饭店的老板，他是这个镇上的知名人士，很受人尊敬，还有，威廉也在这里，如果我记忆力不坏的话，他的父姓是鲍特金。”\n “你没有记错，先生。”威廉说道。\n 彭波契克继续说道：“今天就当着他们两人的面，年轻人，我就告诉你该对约瑟夫怎么说吧。你就说：‘约瑟夫，今天我见到了我最早的恩主和幸福的奠基人。约瑟夫，我用不着点名道姓你也知道，反正镇上的人们都会这么说，我今天见到了这个人。’”\n “我一定不说在这里看到了这个人。”我说道。\n “你就按你想的说吧，”彭波契克反驳道，“你只要这么说，我看约瑟夫也会表现出惊奇呢。”\n “约瑟夫根本不是你说的那种人，我了解得很清楚。”我说道。\n 彭波契克继续说道：“你对他说：‘约瑟夫，我看到了那个人，那个人对你没有恶意，也对我没有恶意。他对你性格了解得一清二楚，约瑟夫，他说你猪头猪脑，一窍不通；他对我的性格也了解得一清二楚，约瑟夫，他说我只晓得忘恩负义。’”彭波契克摇着头挥着手对我说：“你就说：‘是的，约瑟夫，他认为我根本就没有感恩报德的人性，而这种人性是人皆有之的。约瑟夫，你不了解这件事，你也不必去了解，不过他了解得很清楚。’”\n 虽然他是一头喜欢乱吹的驴子，不过我感到奇怪的是他竟然敢当着我的面这样胡说。\n “你可以对他说：‘约瑟夫，他要我给你捎来一个口信，现在我来告诉你听。他说在我走下坡路时，他见到过上帝的手指。他一看到就知道这是上帝的手指，约瑟夫，他看得很清楚。上帝的手指的动作表明上帝写的是：凡对最早的恩主及幸福奠基人忘恩负义者必得此报。不过这个人却认为，他决不懊悔他做过的事，约瑟夫，他一点儿也不懊悔。他认为这样做是正确的，这样做是符合善行的，这样做是符合仁义的，他今后还要这样做。’”\n 我断断续续地吃早饭。在吃完时，我以轻蔑的口吻说道：“这简直太可惜了，这个人根本就没有说他过去做了什么，今后又将做些什么。”\n 彭波契克这时干脆对饭店老板大讲特讲：“蓝野猪饭店的老板，还有你威廉！你们可以任意到无论镇上的什么地方去说，我所做的事是正确的，是符合善行的，是符合仁义的，我今后还要这样做。随你们怎样说，我是不会反对的。”\n 这个骗子说完了那几句话后，便装出那副傲慢的样子和他们两人一一握手，然后离开了饭店。他刚才所说的那么多好处，我听了后并不感到有什么高兴，只觉得十分惊讶。在他走后不久我也离开了饭店。我走到大街上就看到他正站在店门口对着一群上流人土高谈阔论，想来是同一内容无疑。我从对面街上走过时，他们还给了我几个不友好的白眼，为此我该感到荣幸才是。\n 也正因此，我到毕蒂和乔那里去就更感到心情愉悦了。他们过去对我就非常宽容，如今他们对我一定更加宽容，那个无赖骗子手是无法相比的。我缓慢地向他们家走去，因为四肢仍然感到吃力，但是我知道走一步便靠近了他们一步，而离开那个傲慢无理、心怀奸诈的小人又远了一步，我的心情也愈来愈放松而感到宽慰。\n 六月的天气十分爽心说目，万分宜人。蓝蓝的天空，云雀在绿色的谷地上空翱翔，噢，如今的乡间比以往我曾生活过的乡间更加美丽，更加，更加平静。我构想出多少美丽的生活图景来消磨我寂寞的旅途，这些都是对生活有意义的美景。我将会住在这乡间，那位单纯善良、治家精明的人儿就会成为我的生命向导，一切都会变化改善。这些在我的心间唤起了温馨的情绪；我这次归来，我的心已经柔和许多；我经历了人世间的一切变化，这才感到自己仿佛游子，赤着双脚，历尽多年的跋涉、艰险，才从远方归来。\n 毕蒂正在执教的那所学校我过去从未见过。我为了不让人知道而静静地从小路穿过进入村子，一定是要经过学校的。令人失望的是这天正是假日，孩子们都不在学校里，毕蒂住的屋子也锁着。本来我希望在她尚未看到我时我就先看到她，看着她忙于每天的事务。可是这一希望落了空。\n 离这里不远便是乔的铁匠铺，于是我一面奔走在芳香的菩提树下，一面注意倾听乔的铁锤声音，快步向前赶着。我想我应该听到他的打铁声，我想我似乎已经听到打铁声了，而事实上这是一个幻觉，四周一切都很寂静。菩提树仍然在那里，山楂树仍然在那里，毛栗子树仍然在那里。当我停止脚步在注意倾听时，只听见和谐的树叶沙沙声，仲夏的和风没有传来乔的铁锤声。\n 这时我不知道为什么反而害怕见到铁匠铺了，而就在这时我来到了铁匠铺门前，发现门关着，没有一点火光，没有一丝闪耀的火星，没有风箱的吼声，一片寂静。\n 然而这所屋子也并未废弃不用，那间最好的客厅似乎还有人住，那白色的窗帘正在窗前飘舞着，窗户打开着，还装饰着花朵。我轻手轻脚地向前走去，想从花朵的上方窥探一下房里的情况，一眼便见到乔和毕蒂正手臂挽着手臂地站在面前。\n 毕蒂一见到我先是惊呼一声，仿佛她看到的不是我，而是我的灵魂，然后她便冲过来抱住了我。我见到她便哭了起来，她见到我也哭了起来；我哭，是因为看到她出落得如此美丽动人；她哭，是因为我变得如此消瘦苍白。\n “亲爱的毕蒂，你多么漂亮啊！”\n “是吗，亲爱的皮普？”\n “还有你，乔，你今天也这么漂亮！”\n “是吗，亲爱的皮普，我的老弟。”\n 我打量着他们两人，从他看到她，又从她看到他——\n 毕蒂突然幸福地大声叫道：“今天是我结婚的日子，我嫁给了乔！”\n 他们把我领进了厨房，于是我坐下来把头靠在那张昔日的松木桌子上。毕蒂拉着我的一只手放在她的嘴唇上，乔又在我肩头上拍了拍。乔说：“我亲爱的，他的身体还不够好，不要惊动他。”毕蒂说：“亲爱的乔，我是太高兴了，我忘记了这件事。”他们两人见到我都非常高兴，都非常得意，由于我的归来他们特别感动，因为我偶然回来庆祝他们大好的日子，使事情显得顺利圆满，而且快乐非凡。\n 我见到他们的第一个想法，就是我幸亏没有对乔露出一丝儿我那最后一个馊主意。而就在他于我病中服侍我的时候，我多次让这个主意溜到了舌边，不过没有说出口又咽了回去。只要他在我那儿再多等一个小时，他就会知道我的想法，一切都将无可挽回！\n “亲爱的毕蒂，”我说道，“你得到了这个世界上最优秀的丈夫；要是你看到过他守在我病榻旁边的样子，你会——噢，你爱他已经是够深的了。”\n “的确，我真的如此。”\n “亲爱的乔，你得到了这个世界上最优秀的妻子，她会使你享受到应该享受到的幸福，噢，你是亲爱的、善良的和高尚的乔！”\n 乔望着我，嘴唇有些抖动，又用衣服的袖口擦了擦他的眼睛。\n “乔和毕蒂，你们今天已去过教堂，现在已回到人类的怀抱，相亲相爱，所以我请你们接受我一丁点儿谢意。你们为我做了许多，而我却一点也没有回报。现在我得告诉你们，我只能在此耽搁一个小时，然后就离开，准备到国外去。我只有赚到一笔钱后拿来还给你们，否则，我永远不会安心。因为你们替我还债，使我免于进入监狱。乔和毕蒂我亲爱的，我即使还给你们一千倍的钱，我也还不清你们对我的思情，所以我要尽最大的努力来报答你们！”\n 他们两人听了我的话，两颗心都融化了，两人都恳求我不要再说了。\n “但是我还有话说。亲爱的乔，我希望你们生一个孩子，你们可以爱他；在冬日的夜晚，这个小家伙可以坐在火炉的旁边，这便提醒你想到曾经有过另外一个小家伙也在这儿坐过，虽然这已永远成为过去。乔，你千万不要告诉他说我是忘恩之辈；毕蒂，你千万不要告诉他我是那么不宽宏大量，不仁不义；请你们告诉他我崇敬你们两位，因为你们是那么善良，那么诚恳。他是你们的孩子，自然你们要使他成长起来，你们告诉他，我说过他一定会比我好，比我强。”\n 乔用他的衣袖挡住自己，说道：“皮普，我不会告诉他这些话。毕蒂也不会告诉他这些话。我们谁都不会这样说。”\n “我知道你们现在都已原谅了我，你们有善良的心肠，不过我还是请你们对我说，你们原谅我！请你们说出这几个字，让我亲耳听到，我就可以把你们的话带在身边，带到国外。那么我心中就相信你们仍然信任我，仍然会想到我，将来不会忘记我。”\n “噢，我亲爱的老弟皮普，”乔说道，“如果真有要我原谅你的事，在天之主知道我已原谅你了。”\n “阿门！在天之主知道我原谅你了！”毕蒂也说道。\n “好吧，我现在上楼看看我昔日居住的小卧室，并且独自在那儿休息片刻。然后我下来和你们共一顿餐共一次饮，然后请你们陪我一起去到指路牌，亲爱的乔，亲爱的毕蒂，我们就在那儿说一声再见！”\n 我卖掉了我所有的东西，尽可能还债，没有还清的部分，我的债主也给了我充分的期限，以后一次付清。然后，我便启程到赫伯特那里去了。不到一个月我便离开了英格兰；不到两个月我就成了克拉利柯公司的职员了；不到四个月我便第一次负起整个公司的重任。因为，磨坊河滨那间房屋客厅的天花板不再被比尔·巴莱老头的咆哮声震得发抖，他已平静地死去，赫伯特回到故里同克拉娜举行了婚礼，东方分公司由我独自管理，直到赫伯特回来为止。\n 许多年之后，我也是这家公司的合伙人了，和赫伯特及他的妻子生活在一起，颇感幸福。因为我生活节约俭朴，所以还清了一切债务。我还和毕蒂以及乔之间保持着经常的通信。后来我在这家公司成为第三号人物，克拉利柯才把我的秘密告诉了赫伯特。克拉利柯说赫伯特本人对自己股份的秘密长期以来一直抱有疑心，所以非告诉他不可。赫伯特知道真相之后深受感动，而且惊讶不已。虽然这件事长期地隐瞒着他，而我们之间的友谊却并未因此遭受到破坏。我得说清我们的公司不是大公司，我们也没有赚到巨额钞票。我们没有做大生意，但我们有良好的信誉，获利不大，但很有起色。应该承认，赫伯特为此作出了贡献。他勤劳刻苦，灵活机智，我时常在思索，过去我为什么以为他笨拙而无才干，直到有一天我脑海中突然掠过一道智慧之光，发现他并不笨拙而无才干，笨拙而无才干的恰恰是我自己。\n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/78/4566.html","bookId":540,"book":{"id":540,"title":"Great Expectations远大前程","description":"简介： Great Expectations is a novel by Charles Dickens. It was first published in serial form in the publication All the Year Round from 1 December 1860 to August 1861. It has been adapted for stage and screen over 250 times. Great ...","cover":"http://novel.tingroom.com/uploads/allimg/101230/12888310603d944.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/78","creation":"Aug 1, 2019 12:18:56 AM","modification":"Aug 1, 2019 12:18:56 AM"}}
