{"id":90903,"no":21,"title":"Page 21","content":"I nearly yelled as my head broke the surface. The pool room was filled with dozens of vampires, all waiting patiently. I treaded water and tried to think about where I\u0027d get some clothes. And about what they must have seen.\n Tina must have read the look on my face; she knelt by the pool and held up a robe she\u0027d grabbed from somewhere. I swam to her and got out, let her help me into the robe, and got it belted in about half a nanosecond. Sinclair, that shameless hussy, had no problems with modesty; he simply lifted himself from the pool and stood before our audience, splendidly naked. While I stared, the teethmarks on his throat and shoulders healed.\n \"Behold,\" Tina said loudly, \"your Queen and her consort!\"\n \"Uh...\" I raised a finger.\n \"Nostro is no more,\" Sinclair said sternly (and nudely). \"The Fiends are under my Queen\u0027s command. As are all of you.\"\n \"Uh...Eric?\"\n \"Any who do not wish to swear allegiance may leave now, tonight. We will not force your hand. But any who remain, and swear loyalty to her Majesty the Queen, will be under Our protection so long as We live.\"\n Consort?\n \"Consort?\" I asked. I was having a hard time catching Tina\u0027s eye, all of a sudden, and why should that be? \"Tina? Consort? What?\"\n Vampires all over the room were kneeling, were brushing their foreheads against the tile, but I had no eyes for them. \"What\u0027s going on?\"\n She coughed, while Sinclair turned to give me a thoughtful look. He smiled at me. Why should his smile be scary now, of all times?\n Tina coughed again. \"We-ah-didn\u0027t get a chance to finish explaining the prophesies from the book of the dead. Because Donald-and we just didn\u0027t. But you were foretold, and Nostro\u0027s downfall was foretold, and Eric being-uh-being your King was also-\"\n \"What?\" I could actually feel my eyes bulge.\n \"And the first who shall noe the Queen as a husband noes his Wyfe after the fall of the usurper shall be the Queen\u0027s Consort and shall rule at her side for a thousand yeares. At least,\" she added, \"that\u0027s as close as I can recall.\"\n \"What?\" I actually swayed on my feet. Sinclair steadied me. \"I\u0027m the queen and Sink Lair is the king? Why didn\u0027t either of you tell me? Why didn\u0027t you warn me? For a thousand years? What?\"\n \"Well,\" he-who-was-a-dead-man said reasonably, \"if I said, \u0027Elizabeth, I want to make love to you, but just so you know, I\u0027ll come to the crown right after I come in you\u0027, then I wouldn\u0027t have gotten to see you naked.\"\n Tina accurately read the look on my face, because she quickly stepped in front of Sinclair. \"That\u0027s not why, Majesty. You\u0027ve touched him deeply, which is why he\u0027s being flip. It was foretold, that\u0027s all. Just like your ascension to the throne. There\u0027s nothing any of us can do about it.\"\n \"Want to bet?\"\n Sinclair spread his arms wide. \"Sweetest, you sound so cross. We have a coronation to plan, so put on a smile. Also, as soon as I rebuild my home, you\u0027ll move in, of course.\"\n \"Want to bet?\"\n \"Well, perhaps later, then. After the...happy surprise has worn off.\"\n \"You said!\" I jabbed a finger toward Tina\u0027s chest. She flinched, but held her ground. \"You said if I became queen I could get rid of Sinclair!\"\n \"You wanted to get rid of me?\" The asshole had the audacity to sound hurt.\n \"I didn\u0027t think Sinclair would end up being your consort,\" she said weakly, but I knew she was lying. She might consider me her queen, but Erik was her sun and moon, closer than any brother. What he wanted, she would get for him. She revered me, but she loved him.\n \"I\u0027m going home!\" I said loudly. I tightened the robe\u0027s belt. \"Both of you stay the hell away from me-I mean it!\"\n Tina bit her lip and stared at the floor, but Finklair smiled at me. \"Impossible, my Queen. You and I have a kingdom to run.\" \n","sourceLink":"https://allnovel.net/undead-and-unwed-undead-1/page-21.html","bookId":2807,"book":{"id":2807,"title":"Undead and Unwed (Undead #1)","description":"Storyline: \n Undead and Unwed (Undead #1) \n It\u0027a been a helluva week for Betsy Taylor. First, she loses her job. Then, to top things off, she\u0027s killed in a car accident. But what really bites (besides waking up in the morgue dressed in a pink suit and cheap shoes courtesy of her stepmother) is that she can\u0027t seem to stay dead. Every night she rises with a horrible craving for blood. She\u0027s not taking too well to a liquid diet. \n Worst of all, her new friends have the ridiculous idea that Betsy is the prophesied vampire queen, and they want her help in overthrowing the most obnoxious, power-hungry vampire in five centuries - a badly dressed Bela Lugosi wannabe, natch. Frankly, Betsy couldn\u0027t care less about vamp politics, but they have a powerful weapon of persuasion: designer shoes. How can any self-respecting girl say no? But a collection of Ferragamos isn\u0027t the only temptation for Betsy. It\u0027s just a lot safer than the scrumptious Sinclair - a seductive bloodsucker whose sexy gaze seems as dangerous as a stake through the heart...\n \n","cover":"https://allnovel.net/images/undead-and-unwed-undead-1.jpg","author":"MaryJanice Davidson","type":"Humorous","source":"allnovel","link":"https://allnovel.net/undead-and-unwed-undead-1.html","creation":"Oct 5, 2019 9:01:31 AM","modification":"Oct 5, 2019 5:45:19 PM"}}
