{"id":90889,"no":7,"title":"Page 7","content":"After some argument, Jessica and I parted ways, and I drove to my mother\u0027s house. Now that I had decided to make a new life for myself (not that I had any idea how), I couldn\u0027t let another minute go by with Mama thinking I was still dead. \"That\u0027s fine,\" Jessica had said, \"but you might have explained to Papa and Mrs. Taylor that the reason you\u0027re walking around is because you\u0027re a vampire.\" Her voice broke on \u0027vampire\u0027 and she smothered a giggle. I couldn\u0027t blame her. It did sound ludicrous. \"You saw them,\" I retorted. \"Did they look like they were up for any explanations? Dad wouldn\u0027t even come out to say goodbye.\" \"Good point.\" I had asked Jessica to share the news with whomever she thought needed to hear it, but she was horrified by the idea. \"In the movies, the vampire always goes underground,\" she argued. \"Stays dead to their friends and family.\" \"A) This isn\u0027t the movies, and b) I\u0027m not having my friends and family think I\u0027m dead when I\u0027m walking around. This is not a secret! I\u0027m not skulking around in the shadows like some anemic idiot for the next two hundred years.\" \"What about the government? Scientists? What if they want to capture you or study you? Plus, you\u0027ve got a death certificate. So your social security number doesn\u0027t work, your credit\u0027s no good...you can\u0027t just pick up where you left off. Betsy, think it over.\" Those thoughts hadn\u0027t occurred to me. How was I going to make a living? Maybe I could be a clerk on the night shift at a motel, or something. \"Tell or don\u0027t tell, it\u0027s all the same to me. I\u0027m just saying, I\u0027m not keeping it a deep dark secret. How\u0027d you like it if I hadn\u0027t told you?\" \"That\u0027s different. We\u0027re practically sisters.\" \"People can tell,\" I said brightly, \"by the close family resemblance.\" Jessica rolled her eyes. \"I\u0027m just saying, you don\u0027t have to tell everybody. Your family and me, I think. Maybe Officer Nick. You could invite him over...have seductive music playing-something awful by Sade, maybe-and then pounce! He could be your first meal.\" I shied away from the thought, even while part of me surged hungrily at the mental image of Officer Nick being my first. \"You\u0027re ill,\" I told her. \"Go home and get some sleep.\" \"I\u0027m not ill, I\u0027m freaked out. Which is a good problem to have, given the alternative. Say hi to Mama Taylor for me. And think it over, blabbermouth. The movies can\u0027t be wrong about everything.\" Which just goes to show, Jessica hardly ever goes to the movies. I was parked outside my mom\u0027s small, two-story house in Hastings, a suburb of St. Paul. Although it was almost midnight, all the lights on the lower level were blazing. My mom suffered from insomnia at the best of times. Which this certainly wasn\u0027t. I bounded up the porch steps, knocked twice, then turned the knob. Unlocked-one of the things I loved about Hastings. I stepped into the living room and saw an old woman sitting in my mother\u0027s chair. She had my mother\u0027s curly white hair (Mom had started going gray in high school), and was wearing my mom\u0027s black suit, and my mom\u0027s pearls-a wedding gift from her parents. \"Who-?\" \u0027-are you\u0027, I almost asked, but of course it was my mother. Shock and grief had put twenty years on her face. She\u0027d gotten pregnant with me one month out of high school, and we\u0027d often been mistaken for sisters. Not today. She stared. She tried to speak but her mouth trembled and made speech impossible. She gripped the arms of her rocking chair so hard I heard the bones creak. I rushed across the room and threw myself at the foot of her chair. She looked so dreadful I was terrified. \"Mom, it\u0027s me-it\u0027s okay! I\u0027m okay!\" \"This is the worst dream I\u0027ve ever had,\" she remarked to no one in particular. I felt her hand come up and gently touch the top of my head. \"Yes indeed.\" \"It\u0027s not a dream, Mom.\" I grabbed her hand, pressed it to my cheek. \"See? It\u0027s real.\" I pinched her leg through the skirt, hard enough to make her yelp. \"See?\" \"You wretched child, I\u0027m going to have a bruise the size of a plum.\" I felt her tears dripping down on my face. \"You awful, awful child. Such a burden. Such a-\" She started to cry in earnest and couldn\u0027t finish the familiar, well-loved fake complaints. We held each other for a long time. \"Don\u0027t be scared,\" I said about half an hour later, \"but I\u0027m a vampire.\" \"As Jessica would say, \u0027I don\u0027t give a shit.\u0027 Also, you move faster than the human eye can track. Did you know?\" \"What?\" Mom tossed a handful of freshly grated Parmesan into the risotto and stirred. \"When you ran to me. I blinked and you were at my feet. You moved faster than I could follow. Either you\u0027ve been involved in some sort of secret scientific government-sponsored experiment and never mentioned it-\" \"No, but that\u0027s a good one. I\u0027ll have to remember it.\" \"Or there\u0027s a supernatural explanation.\" I blinked. Mom had always had a strong practical streak, but she was adjusting to my undead status with unbelievable aplomb. She must have read my expression, because she said, \"Sweetie, you were dead. I was at the morgue. I saw.\" I was silent, picturing her agony. The long walk down the sterile-smelling hallway-sterile, with a faint whiff of death underneath. Burning fluorescent lights. A professionally sympathetic doctor. Then, the identification: \"Yes, that\u0027s my daughter. What\u0027s left of her.\" \"Just about every culture has legends about vampires. I\u0027ve often thought there must be some truth in the stories...else why would there be so many of them?\" \"By that logic,\" I said, \"I can assume the Easter Bunny will be stopping by this month?\" \"Funny girl. Risotto?\" \"Please.\" Mom had stopped crying, washed her face, changed out of the suit she wore to my funeral, and cooked my favorite meal: pork loin with risotto. Like Jessica, she couldn\u0027t stop touching me. Like I minded! \"I\u0027m so hungry, and that smells terrific.\" I wolfed it down in about thirty seconds. Then I spent five minutes in the bathroom throwing it all up. Mom held my hair back from my face and, when I finished and slumped dispiritedly on the bathroom tile, she handed me a damp washcloth. I started to cry, that weird tearless crying that was now my specialty. \"I can\u0027t have regular food anymore! No more risotto, shrimp cocktail, lobster, prime rib-\" \"Cancer, AIDS, death-by-mugging, rape, homicide.\" I looked up. Mom looked down at me with the compassion/practicality combo that was her trademark. I\u0027d seen that look when I told her I was going to flunk out of college. \"I\u0027d like to be more sympathetic,\" she said, \"but I\u0027m so happy to have you back, Elizabeth. As awful as it\u0027s been for you, you have no idea what the last three days have been like for me, for your father and your friends-I thought Jessica was going to collapse at the funeral home. I didn\u0027t think the girl could cry, but she practically melted today. Your father didn\u0027t even recognize me, he was in such a daze.\" \"Oh...Mom.\" \"But I never have to worry about going to the morgue again, unless you trip on a stake on the way home. As to the rest of it: we\u0027ll deal.\" I scowled. \"I don\u0027t think people who can eat risotto should have an opinion.\" \"Silly child. It\u0027s just fuel. Brush your fangs, and then we\u0027ll talk some more.\" \"Very funny!\" I yelled after her.","sourceLink":"https://allnovel.net/undead-and-unwed-undead-1/page-7.html","bookId":2807,"book":{"id":2807,"title":"Undead and Unwed (Undead #1)","description":"Storyline: Undead and Unwed (Undead #1) It\u0027a been a helluva week for Betsy Taylor. First, she loses her job. Then, to top things off, she\u0027s killed in a car accident. But what really bites (besides waking up in the morgue dressed in a pink suit and cheap shoes courtesy of her stepmother) is that she can\u0027t seem to stay dead. Every night she rises with a horrible craving for blood. She\u0027s not taking too well to a liquid diet. Worst of all, her new friends have the ridiculous idea that Betsy is the prophesied vampire queen, and they want her help in overthrowing the most obnoxious, power-hungry vampire in five centuries - a badly dressed Bela Lugosi wannabe, natch. Frankly, Betsy couldn\u0027t care less about vamp politics, but they have a powerful weapon of persuasion: designer shoes. How can any self-respecting girl say no? But a collection of Ferragamos isn\u0027t the only temptation for Betsy. It\u0027s just a lot safer than the scrumptious Sinclair - a seductive bloodsucker whose sexy gaze seems as dangerous as a stake through the heart...","cover":"https://allnovel.net/images/undead-and-unwed-undead-1.jpg","author":"MaryJanice Davidson","type":"Humorous","source":"allnovel","link":"https://allnovel.net/undead-and-unwed-undead-1.html","creation":"Oct 5, 2019 9:01:31 AM","modification":"Oct 5, 2019 5:45:19 PM"}}
