{"id":90933,"no":29,"title":"Page 29","content":"\\n\\n But wait.\\n\\n I didn’t have to put out or even fend him off. Just play nice for a few minutes and feed, then use the sleeping powder. They’d sent up room service that paid for itself.\\n\\n I grinned. “On the bed, monsieur,” I cooed.\\n\\n A red-faced elderly man appeared around the screen, cane in hand. I patted the bed.\\n\\n “Mon dieu, but you are even prettier up close, ma chérie. Can you believe I’ve never met a Bludman before? I’ve long waited to make your acquaintance.”\\n\\n I stood and draped an arm around his neck. “And I yours,” I whispered into his ear.\\n\\n It was too easy. Far too easy. One caress, and he had what he needed, while I earned a full belly. I sprinkled a few grains of sleeping powder over his head, and soon he was snoring softly on the bed, fully dressed and cheeks enflamed with imagined passion. With a grimace of distaste, I gave him a thorough pat-down but found nothing useful. A wallet, several nice handkerchiefs, a horribly creepy-looking condom that looked as if it had been used before stuffed in a small book of Saint Ermenegilda’s better quotes. There wasn’t a whiff of Bludman about him or the stench of magic and catacombs.\\n\\n Before descending the stairs, I slipped a calling card from his wallet and used his handkerchief to dab the blood away from the little rip in his neck. I would add his name to the “Innocent” column of my spreadsheet. He said he’d never met a Bludman before, and oddly enough, I believed him. In six years among Crim, Tish, and the people of the caravan, I’d learned to read faces, and as far as I could tell, he hadn’t lied.\\n\\n I slipped off my boots so I could take the metal stairs silently. Pebbles bit into my stockinged feet as I fled across the uneven cobbles to the back door of Paradis. With one ear against the door, I made certain that it was quiet inside. The only thing I wanted less than to further entertain the old man was to encounter the other girls doing the walk of shame and have to answer questions about why I was so quick at my work. The hallway seemed empty, and I turned the doorknob as slowly as I could, knowing after last night that it had an unfortunate tendency to squeak.\\n\\n “You work fast, bébé.”\\n\\n I bit back a scream and spun, hands curled into claws. Vale’s amused and skeptical calm made me even more likely to rake out his eyeballs.\\n\\n “So—what, Vale? You’re following me now?”\\n\\n “Don’t flatter yourself. Stargazing in the courtyard of the—” He chuckled and rubbed the back of his head. “Yes, I’m following you. But only because I have something that I thought you’d want to see, as soon as you were done . . . entertaining the great artist.”\\n\\n Rage shot up my spine, making me clench my teeth with a click that rang in the night. “First of all, entertainment is my job. Second, entertaining is not code for sex. Third, I just assumed you’d kissed half the daimons here, and I’ve never thrown that in your face. So how dare you judge me?”\\n\\n He stepped closer, reaching for my hands. I jerked them back, feeling all too inhuman.\\n\\n “Simmer down, bébé. I didn’t come here to start a fight.”\\n\\n “Then keep your meaningful, judgmental pauses to yourself.” He tried to take my hand, and I smacked his wrist. “Keep your paws to yourself, too. I’ve had enough of being grabbed at.”\\n\\n Hands in the air, he stepped backward, and I shook myself like a dog shedding water, feeling tightly wound and unpredictable in my anger. It was true, what I’d told him. Except when I was in my own bed, I spent a lot of time being touched against my will. Whether Charline was placing my hands on the hoop or Blue was dressing me or Mel and Bea were fixing my hair and makeup, I was sick to death of being touched like an object.\\n\\n “Fair enough, bébé. I don’t want to make you unhappy. But look.”\\n\\n The thing between his fingers was so small that I couldn’t see it without stepping close. Duh—he’d been trying to hand it to me.\\n\\n It was a tooth. A fang, actually.\\n\\n I took it with shaking fingers, holding it up to the meager orange glow of the gaslight.\\n\\n “I know there is no way to know if it belongs to your Cherie, and I know it’s unsettling, but . . .”\\n\\n “But if you’re using a Bludman as a slave or a concubine, she’d be less dangerous without her fangs.”\\n\\n “That’s what I was thinking.”\\n\\n The fang matched mine, bright white and smooth, with a long, two-pronged root. I had a sudden curiosity regarding whether little Bludmen lost their fangs and hid them under their pillows for a creepy, blud-spattered Tooth Fairy.\\n\\n “Where did you find it?”\\n\\n I held it out to him reluctantly, but he shook his head and crossed his arms. It felt good in my hand, curled within my fingers. Macabre as it might be, he was right; this was actually a good sign. After all, it could have been a fanged skull.\\n\\n “Well, you see . . .”\\n\\n “Stop acting cagey, brigand.”\\n\\n “Being a brigand involves a certain amount of smuggling and trading, and from time to time, unusual objects come into my possession. Dragon claws, unicorn hairs, mysterious valises covered with stamps—”\\n\\n “The Freesian Tsarina’s bloodwine?”\\n\\n “That, too. Francs and silvers aren’t the only form of payment, after all, and I know the sort of folk who need certain things and the sort of folk who pay with certain things, and I connect them.”\\n\\n “All very legal, I’m sure. Totally aboveboard.”\\n\\n He chuckled into his fist. “Believe whatever you wish, bébé. But it just so happens that tonight’s bounty included a handful of glittery little trinkets, and that was among them. I asked for some background—which is all part of the game—and the gentleman in question got very nervous and would only say again and again that it was very fresh and he’d won it at cards. Which means, if it’s hers, that she is in Paris.”\\n\\n My hand stole to my own fangs, which felt foreign even after six years in Sang. I still remembered the strange, searing pain as the old canines had fallen out, the tips of the new fangs pushing through right behind them with a dull ache in my jaw. I’d been terrified. But back then, everything had been terrifying. Now I was mostly angry. When I found who had done this to my best friend, who had torn off part of her body just to make her weaker and more helpless, I would sink my claws into the bastard. And I would bleed him dry in some very choice, very painful spots, withholding the magic that gave the feeding any sort of pleasantness. I would teach him what a Bludman truly was.\\n\\n But that made me think again of Lenoir’s secret.\\n\\n “Wait. Aren’t there any Bludmen in Paris at all?”\\n\\n “There are a couple in Paris but not Mortmartre. As it’s the pleasure district and gentlemen can’t spend money or unlace their breeches if they’re scared, the gendarmes guard the wall very carefully. Only humans, daimons, and a few harmless freaks like myself are allowed in.” He rubbed his head again, a nervous habit that I found endearing in spite of myself, like a little kid rubbing his nose. “Technically, I’m not allowed in, thanks to some rather choice warrants, but I stay far away from the walls and the billy clubs.”\\n\\n “Then why haven’t they come for me?”\\n\\n His eyes went tender-soft with pity. “Oh, bébé. You’re so very naïve. They did come for you. That night after your fall, after your first show, where you took over Limone’s act and sent the crowd mad. Limone must’ve tipped off the local gendarmes.”\\n\\n I felt cold all over, synapses firing uselessly. “Why didn’t I know? Why didn’t they take me away?”\\n\\n “Because Charline met them at the door and paid them a very large sum to let you stay.” His gaze was kindly, fond, almost parental. “And they wouldn’t have taken you away. They would have killed you.”\\n\\n “I’m hard to kill.”\\n\\n This time, when he reached to stroke my cheek, I let him. Cold as I was in the early spring night and filled as I was with rage and fear, his touch seared me.\\n\\n “Good,” was all he said.\\n\\n I stood up on my tiptoes to kiss his cheek, the fang wrapped in my fist where it lay on his shoulder. “Thank you.”\\n\\n “De rien, bébé. Pay me back later.”\\n\\n His playful grin was back, and my wobbling smile joined it as I pulled away and turned to go. I slipped through the door and up to my room, never meeting a single soul. My cheeks were red, my eyes bright with unshed tears. I wasn’t sure what to do with the fang, so I tied it up in a piece of lace and tucked it into the armoire drawer next to the remains of Vale’s pendant and Cherie’s lost fascinator.\\n\\n I’d put my life and my friend back together piece by piece, if I had to. At least now I knew she was nearby.\\n\\n As I fought wakefulness, knowing that Lenoir wanted me early and fresh, I couldn’t help wondering exactly how much Charline had paid for my life. And exactly how much interest she would charge me. For as I was learning, everything in Paris came with a price.\\n\\n And an expiration date.\\n\\n I had to find Cherie before she lost more than a fang.\\n\\n 16\\n\\n I awoke in a panic. Without alarm clocks or school or a nine-to-five job, it had been years since I’d worried about a wake-up call. Everyone slept past noon in the caravan. But my window was tinted lavender with early dawn, and I breathed a sigh of relief. Angering Lenoir would be dangerous in more ways than one. I still had time.\\n\\n The hallway was empty, but the animal part of my Bludman nature could sense wakefulness somewhere beyond the closed doors. I was right—as I passed, one opened to reveal Mel and Bea. Their eyes were bright, their lips turned down. They’d been waiting for me, then.\\n\\n “Oh, la, chérie. You’re going to Lenoir, aren’t you?” Mel asked, arranging a curl over my shoulder with a kind but sad smile.\\n\\n Bea’s fingers flew excitedly, her eyes wide.\\n\\n “She says to be careful,” Mel supplied.\\n\\n “Be careful? Why?”\\n\\n We both stared at Bea, who blanched ice-white and fidgeted, her eyes darting back and forth. She signed slowly, as if trying to find the words, and Mel translated. \\n\\n","sourceLink":"https://allnovel.net/wicked-after-midnight-blud-3/page-29.html","bookId":1599,"book":{"id":1599,"title":"Wicked After Midnight (Blud #3)","description":"Storyline: Wicked After Midnight (Blud #3) \\n Life as a contortionist in Criminy’s Clockwork Caravan should be the height of exotic adventure, but for Demi Ward, it’s total dullsville. Until her best friend, Cherie, is stolen by slavers outside of Paris, and Demi is determined to find her. \\n On the run from his own past, Vale Hildebrand, a dashing rogue of a highwayman, hides Demi from the slavers…but why? He pledges to help her explore the glittering cabarets of Paris to find her friend, but much to Vale’s frustration, Demi soon attracts a host of wealthy admirers. The pleasures of music, blood, and absinthe could turn anyone’s head, and it would be all too easy to accept Cherie’s disappearance as inevitable—but with Vale’s ferocious will and Demi’s drive to find her friend, they soon have a lead on a depraved society of Parisian notables with a taste for beautiful lost girls. Can Demi wind her way through the seedy underbelly of Paris and save her best friend before she, too, is lost?\\n","cover":"https://allnovel.net/images/wicked-after-midnight-blud-3.jpg","author":"Delilah S. Dawson","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/wicked-after-midnight-blud-3.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:44:04 PM"}}
