{"id":95426,"no":21,"title":"Page 21","content":"‘Um. Look,’ said Rincewind. ‘Yes?’ said Abrim. ‘Well, if you put it like that …’ ‘You wish to make a point?’ ‘It’s the Archchancellor’s hat, if you must know,’ said Rincewind. ‘The symbol of wizardry.’ ‘Powerful?’ Rincewind shivered. ‘Very,’ he said. ‘Why is it called the Archchancellor’s hat?’ ‘The Archchancellor is the most senior wizard, you see. The leader. But, look - Abrim picked up the hat and turned it around and around in his hands. ‘It is, you might say, the symbol of office?’ ‘Absolutely, but look, if you put it on, I’d better warn you-’ Shut up. Abrim leapt back, the hat dropping to the floor. The wizard knows nothing. Send him away. We must negotiate. The vizier stared down at the glittering octarines around the hat. ‘I negotiate? With an item of apparel?’ I have much to offer, on the right head. Rincewind was appalled. It has already been indicated that he had the kind of instinct for danger usually found only in certain small rodents, and it was currently battering on the side of his skull in an attempt to run away and hide somewhere. ‘Don’t listen!’ he shouted. Put me on, said the hat beguilingly, in an ancient voice that sounded as though the speaker had a mouthful of felt. If there really was a school for viziers, Abrim had come top of the class. ‘We’ll talk first,’ he said. He nodded at the guards, and pointed to Rincewind. ‘Take him away and throw him in the spider tank,’ he said. ‘No, not spiders, on top of everything else!’ moaned Rincewind. The captain of the guard stepped forward and knuckled his forehead respectfully. ‘Run out of spiders, master,’ he said. ‘Oh.’ The vizier looked momentarily blank. ‘In that case, lock him in the tiger cage.’ The guard hesitated, trying to ignore the sudden outburst of whimpering beside him. ‘The tiger’s been ill, master. Backwards and forwards all night.’ ‘Then throw this snivelling coward down the shaft of eternal fire!’ A couple of the guards exchanged glances over the head of Rincewind, who had sunk to his knees. ‘Ah. We’ll need a bit of notice of that, master-’ ‘- to get it going again, like.’ The vizier’s fist came down hard on the table. The captain of the guard brightened up horribly. ‘There’s the snake pit, master,’ he said. The other guards nodded. There was always the snake pit. Four heads turned towards Rincewind, who stood up and brushed the sand off his knees. ‘How do you feel about snakes?’ said one of the guards. ‘Snakes? I don’t like snakes much-’ ‘The snake pit,’ said Abrim. ‘Right. The snake pit,’ agreed the guards. - I mean, some snakes are okay-’ Rincewind continued, as two guards grabbed him by the elbows. In fact there was only one very cautious snake, which remained obstinately curled up in a corner of the shadowy pit watching Rincewind suspiciously, possibly because he reminded it of a mongoose. ‘Hi,’ it said eventually. ‘Are you a wizard?’ As a line of snake dialogue this was a considerable improvement on the normal string of esses, but Rincewind was sufficiently despondent not to waste time wondering and simply replied, ‘It’s on my hat, can’t you read?’ ‘In seventeen languages, actually. I taught myself.’ ‘Really?’ ‘I sent off for courses. But I try not to read, of course. It’s not in character.’ ‘I suppose it wouldn’t be.’ It was certainly the most cultured snake voice that Rincewind had ever heard. ‘It’s the same with the voice, I’m afraid,’ the snake added. ‘I shouldn’t really be talking to you now. Not like this, anyway. I suppose I could grunt a bit. I rather think I should be trying to kill you, in fact.’ ‘I have curious and unusual powers,’ said Rincewind. Fair enough, he thought, an almost total inability to master any form of magic is pretty unusual for a wizard and anyway, it doesn’t matter about lying to a snake. ‘Gosh. Well, I expect you won’t be in here long, then.’ ‘Hmm?’ ‘I expect you’ll be levitating out of here like a shot, any minute.’ Rincewind looked up at the fifteen-foot-deep walls of the snake pit, and rubbed his bruises. ‘I might,’ he said cautiously. ‘In that case, you wouldn’t mind taking me with you, would you?’ ‘Eh?’ ‘It’s a lot to ask, I know, but this pit is, well, it’s the pits.’ ‘Take you? But you’re a snake, it’s your pit. The idea is that you stay here and people come to you. I mean, I know about these things.’ A shadow behind the snake unfolded itself and stood up. ‘That’s a pretty unpleasant thing to say about anyone,’ it said. The figure stepped forward, into the pool of light. It was a young man, taller than Rincewind. That is to say, Rincewind was sitting down, but the boy would have been taller than him even if he was standing up. To say that he was lean would be to miss a perfect opportunity to use the word ‘emaciated’. He looked as though toast racks and deckchairs had figured in his ancestry, and the reason it was so obvious was his clothes. Rincewind looked again. He had been right the first time. The lank-haired figure in front of him was wearing the practically traditional garb for barbarian heroes - a few studded leather thongs, big furry boots, a little leather holdall and goosepimples. There was nothing unusual about that, youd see a score of similarly-dressed adventurers in any street of Ankh-Morpork, except that you’d never see another one wearing - The young man followed his gaze, looked down, and shrugged. ‘I can’t help it,’ he said. ‘I promised my mother.’ ‘Woolly underwear?’ Strange things were happening in Al Khali that night. There was a certain silveriness rolling in from the sea, which baffled the city’s astronomers, but that wasn’t the strangest thing. There were little flashes of raw magic discharging off sharp edges, like static electricity, but that wasn’t the strangest thing. The strangest thing walked into a tavern on the edge of the city, where the everlasting wind blew the smell of the desert through every unglazed window, and sat down in the middle of the floor. The occupants watched it for some time, sipping their coffee laced with desert orakh. This drink, made from cacti sap and scorpion venom, is one of the most virulent alcoholic beverages in the universe, but the desert nomads don’t drink it for its intoxicating effects. They use it because they need something to mitigate the effect of Klatchian coffee. Not because you could use the coffee to waterproof roofs. Not because it went through the untrained stomach lining like a hot ball bearing through runny butter. What it did was worse. It made you knurd.[17] The sons of the desert glanced suspiciously into their thimble-sized coffee-cups, and wondered whether they had overdone the orakh. Were they all seeing the same thing? Would it be foolish to pass a remark? These are the sort of things you need to worry about if you want to retain any credibility as a steely-eyed son of the deep desert. Pointing a shaking finger and saying, ‘Hey, look, a box just walked in here on hundreds of little legs, isn’t that extraordinary!’ would show a terrible and possibly fatal lack of machismo. The drinkers tried not to catch one another’s eye, even when the Luggage slid up to the row of orakh jars against the far wall. The Luggage had a way of standing still that was somehow even more terrible than watching it move about. Finally one of them said, ‘I think it wants a drink.’ There was a long silence, and then one of the others said, with the precision of a chess Grand Master making a killing move, ‘What does?’ The rest of the drinkers gazed impassively into their glasses. There was no sound for a while other than the plop-plopping of a gecko’s footsteps across the sweating ceiling. The first drinker said, ‘The demon that’s Just moved up behind you is what I was referring to, O brother of the sands.’ The current holder of the All-Wadi Imperturbability Championship smiled glassily until he felt a tugging on his robe. The smile stayed where it was but the rest of his face didn’t seem to want to be associated with it. The Luggage was feeling crossed in love and was doing what any sensible person would do in these circumstances, which was get drunk. It had no money and no way of asking for what it wanted, but the Luggage somehow never had much difficulty in making itself understood. The tavern keeper spent a very long lonely night filling a saucer with orakh, before the Luggage rather unsteadily walked out through one of the walls. The desert was silent. It wasn’t normally silent. It was normally alive with the chirruping of crickets, the buzz of mosquitoes, the hiss and whisper of hunting wings skimming across the cooling sands. But tonight it was silent with the thick, busy silence of dozens of nomads folding their tents and getting the hell out of it. ‘I promised my mother,’ said the boy. ‘I get these colds, you see.’ ‘Perhaps you should try wearing, well, a bit more clothing?’ ‘Oh, I couldn’t do that. You’ve got to wear all this leather stuff.’ ‘I wouldn’t call it all,’ said Rincewind. ‘There’s not enough of it to call it all. Why have you got to wear it?’ ‘So people know I’m a barbarian hero, of course.’ Rincewind leaned his back against the fetid walls of the snake pit and stared at the boy. He looked at two eyes like boiled grapes, a shock of ginger hair, and a face that was a battleground between its native freckles and the dreadful invading forces of acne. Rincewind rather enjoyed times like this. They convinced him that he wasn’t mad because, if he was mad, that left no word at all to describe some of the people he met. ‘Barbarian hero,’ he murmured. ‘It’s all right, isn’t it? All this leather stuff was very expensive.’ ‘Yes, but, look - what’s your name, lad?’ ‘Nijel-’ ‘You see, Nijel ‘Nijel the Destroyer,’ Nijel added. ‘You see, Nijel ‘- the Destroyer-’ ‘All right, the Destroyer-’ said Rincewind desperately. ‘- son of Harebut the Provision Merchant-’ ‘What?’ ‘You’ve got to be the son of someone,’ Nijel explained. ‘It says it here somewhere-’ He half-turned and fumbled inside a grubby fur bag, eventually bringing out a thin, torn and grubby book. ‘There’s a bit in here about selecting your name,’ he muttered. ‘How come you ended up in this pit, then?’ ‘I was intending to steal from Creosote’s treasury, but I had an asthma attack,’ said Nijel, still fumbling through the crackling pages.","sourceLink":"https://allnovel.net/sourcery-discworld-5/page-21.html","bookId":1624,"book":{"id":1624,"title":"Sourcery (Discworld #5)","description":"Storyline: Sourcery (Discworld #5) When last seen, the singularly inept wizard Rincewind had fallen off the edge of the world. Now magically, he\u0027s turned up again, and this time he\u0027s brought the Luggage. But that\u0027s not all.... Once upon a time, there was an eighth son of an eighth son who was, of course, a wizard. As if that wasn\u0027t complicated enough, said wizard then had seven sons. And then he had an eighth son -- a wizard squared (that\u0027s all the math, really). Who of course, was a source of magic -- a sorcerer.","cover":"https://allnovel.net/images/sourcery-discworld-5.jpg","author":"Terry Pratchett","type":"Humorous","source":"allnovel","link":"https://allnovel.net/sourcery-discworld-5.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:14:06 PM"}}
