{"id":95428,"no":23,"title":"Page 23","content":"\n ‘Yes, well, you’ll be all right then,’ muttered Nijel.\n It wasn’t a heavy blow, because even in a rage Rincewind still had muscles like tapioca, but it caught the side of Nijel’s head and knocked him down more by the weight of surprise than its intrinsic energy.\n ‘Yes, I’m a wizard all right,’ Rincewind hissed. ‘A wizard who isn’t much good at magic! I’ve managed to survive up till now by not being important enough to die! And when all wizards are hated and feared, exactly how long do you think I’ll last?’\n ‘That’s ridiculous!’\n Rincewind couldn’t have been more taken aback if Nijel had struck him.\n ‘What?’\n ‘Idiot! All you have to do is stop wearing that silly robe and get rid of that daft hat and no one will even know you’re a wizard!’\n Rincewind’s mouth opened and shut a few times as he gave a very lifelike impression of a goldfish trying to grasp the concept of tap-dancing.\n ‘Stop wearing the robe?’ he said.\n ‘Sure. All those tatty sequins and things, it’s a total giveaway,’ said Nijel, struggling to his feet.\n ‘Get rid of the hat?’\n ‘You’ve got to admit that going around with “wizzard” written on it is a bit of a heavy hint.’\n Rincewind gave him a worried grin.\n ‘Sorry,’ he said, ‘I don’t quite follow you-’\n ‘Just get rid of them. It’s easy enough, isn’t it? Just drop them somewhere and then you could be a, a, well, whatever. Something that isn’t a wizard.’\n There was a pause, broken only by the distant sounds of fighting.\n ‘Er,’ said Rincewind, and shook his head. ‘You’ve lost me there …’\n ‘Good grief, it’s perfectly simple to understand!’\n ‘… not sure I quite catch your drift…’ murmured Rincewind, his face ghastly with sweat.\n ‘You can just stop being a wizard.’\n Rincewind’s lips moved soundlessly as he replayed every word, one at a time, then all at once.\n ‘What?’ he said, and then he said, ‘Oh.’\n ‘Got it? Want to try it one more time?’\n Rincewind nodded gloomily.\n ‘I don’t think you understand. A wizard isn’t what you do, it’s what you are. If I wasn’t a wizard, I wouldn’t be anything.’ He took off his hat and twiddled nervously with the loose star on its point, causing a few more cheap sequins to part company.\n ‘I mean, it’s got wizard written on my hat,’ he said. ‘It’s very important -’\n He stopped and stared at the hat.\n ‘Hat,’ he said vaguely, aware of some importunate memory pressing its nose up against the windows of his mind.\n ‘It’s a good hat,’ said Nijel, who felt that something was expected of him.\n ‘Hat,’ said Rincewind again, and then added, ‘the hat! We’ve got to get the hat!’\n ‘You’ve got the hat,’ Nijel pointed out.\n ‘Not this hat, the other hat. And Conina!’\n He took a few random steps along a passageway, and then sidled back.\n ‘Where do you suppose they are?’ he said.\n ‘Who?’\n ‘There’s a magic hat I’ve got to find. And a girl.’\n ,Why?,\n ‘It might be rather difficult to explain. I think there might be screaming involved somewhere.’\n Nijel didn’t have much of a jaw but, such as it was, he stuck it out.\n ‘There’s a girl needs rescuing?’ he said grimly.\n Rincewind hesitated. ‘Someone will probably need rescuing,’ he admitted. ‘It might possibly be her. Or at least in her vicinity.’\n ‘Why didn’t you say so? This is more like it, this is what I was expecting. This is what heroism is all about. Let’s go!’\n There was another crash, and the sound of people yelling.\n ‘Where?’ said Rincewind.\n Anywhere!’\n Heroes usually have an ability to rush madly around crumbling palaces they hardly know, save everyone and get out just before the whole place blows up or sinks into the swamp. In fact Nijel and Rincewind visited the kitchens, assorted throne rooms, the stables (twice) and what seemed to Rincewind like several miles of corridor.\n Occasionally groups of black-clad guards would scurry past them, without so much as a second glance.\n ‘This is ridiculous,’ said Nijel. ‘Why don’t we ask someone? Are you all right?’\n Rincewind leaned against a pillar decorated with embarrassing sculpture and wheezed.\n ‘You could grab a guard and torture the information out of him,’ he said, gulping air. Nijel gave him an odd look.\n ‘Wait here,’ he said, and wandered off until he found a servant industriously ransacking a cupboard.\n ‘Excuse me,’ he said, ‘which way to the harem?’\n ‘Turn left three doors down,’ said the man, without looking around.\n ‘Right.’\n He wandered back again and told Rincewind.\n ‘Yes, but did you torture him?’\n ‘No.’\n ‘That wasn’t very barbaric of you, was it?’\n ‘Well, I’m working up to it,’ said Nijel. ‘I mean, I didn’t say “thank you”.’\n Thirty seconds later they pushed aside a heavy bead curtain and entered the seraglio of the Seriph of Al Khali.\n There were gorgeous songbirds in cages of gold filigree. There were tinkling fountains. There were pots of rare orchids through which humming-birds skimmed like tiny, brilliant jewels. There were about twenty young women wearing enough clothes for, say, about half a dozen, huddled together in a silent crowd.\n Rincewind had eyes for none of this. That is not to say that the sight of several dozen square yards of hip and thigh in every shade from pink to midnight black didn’t start certain tides flowing deep in the crevasses of his libido, but they were swamped by the considerably bigger flood of panic at the sight of four guards turning towards him with scimitars in their hands and the light of murder in their eyes.\n Without hesitation, Rincewind took a step backwards.\n ‘Over to you, friend,’ he said.\n ‘Right!’\n Nijel drew his sword and held it out in front of him, his arms trembling at the effort.\n There were a few seconds of total silence as everyone waited to see what would happen next. And then Nijel uttered the battle cry that Rincewind would never quite forget to the end of his life.\n ‘Erm,’ he said, ‘excuse me…’\n ‘It seems a shame,’ said a small wizard.\n The others didn’t speak. It was a shame, and there wasn’t a man among them who couldn’t hear the hot whine of guilt all down their backbones. But, as so often happens by that strange alchemy of the soul, the guilt made them arrogant and reckless.\n ‘Just shut up, will you?’ said the temporary leader. He was called Benado Sconner, but there is something in the air tonight that suggests that it is not worth committing his name to memory. The air is dark and heavy and full of ghosts.\n The Unseen University isn’t empty, there just aren’t any people there.\n But of course the six wizards sent to burn down the Library aren’t afraid of ghosts, because they’re so charged with magic that they practically buzz as they walk, they’re wearing robes more splendid than any Archchancellor has worn, their pointy hats are more pointed than any hats have hitherto been, and the reason they’re standing so close together is entirely coincidental.\n ‘It’s awfully dark in here,’ said the smallest of the wizards.\n ‘It’s midnight,’ said Sconner sharply, ‘and the only dangerous things in here are us. Isn’t that right, boys?’\n There was a chorus of vague murmurs. They were all in awe of Sconner, who was rumoured to do positive-thinking exercises.\n ‘And we’re not scared of a few old books, are we, lads?’ He glowered at the smallest wizard. ‘You’re not, are you?’ he added sharply.\n ‘Me? Oh. No. Of course not. They’re just paper, like he said,’ said the wizard quickly.\n ‘Well, then.’\n ‘There’s ninety thousand of them, mind,’ said another wizard.\n ‘I always heard there was no end to ‘em,’ said another. ‘It’s all down to dimensions, I heard, like what we see is only the tip of the whatever, you know, the thing that is mostly underwater-’\n ‘Hippopotamus?’\n Alligator?’\n ‘Ocean?’\n ‘Look, just shut up, all of you!’ shouted Sconner. He hesitated. The darkness seemed to suck at the sound of his voice. It packed the air like feathers.\n He pulled himself together a bit.\n ‘Right then,’ he said, and turned towards the forbidding doors of the Library.\n He raised his hands, made a few complicated gestures in which his fingers, in some eye-watering way, appeared to pass through each other, and shattered the doors into sawdust.\n The waves of silence poured back again, strangling the sound of falling woodchips.\n There was no doubt that the doors were smashed. Four forlorn hinges hung trembling from the frame, and a litter of broken benches and shelves lay in the wreckage. Even Sconner was a little surprised.\n ‘There,’ he said. ‘It’s as easy as that. You see? Nothing happened to me. Right?’\n There was a shuffling of curly-toed boots. The darkness beyond the doorway was limned with the indistinct, eye-aching glow of thaumaturgic radiation as possibility particles exceeded the speed of reality in a strong magical field.\n ‘Now then,’ said Sconner, brightly, ‘who would like the honour of setting the fire?’\n Ten silent seconds later he said, ‘In that case I will do it myself. Honestly, I might as well be talking to the wall.’\n He strode through the doorway and hurried across the floor to the little patch of starlight that lanced down from the glass dome high above the centre of the Library (although, of course, there has always been considerable debate about the precise geography of the place; heavy concentrations of magic distort time and space, and it is possible that the Library doesn’t even have an edge, never mind a centre).\n He stretched out his arms.\n ‘There. See? Absolutely nothing has happened. Now come on in.’\n The other wizards did so, with great reluctance and a tendency to duck as they passed through the ravished arch.\n ‘Okay,’ said Sconner, with some satisfaction. ‘Now, has everyone got their matches as instructed? Magical fire won’t work, not on these books, so I want everyone to\n ‘Something moved up there,’ said the smallest wizard.\n Sconner blinked.\n ‘What?’\n ‘Something moved up by the dome,’ said the wizard, adding by way of explanation, ‘I saw it.’\n Sconner squinted upwards into the bewildering shadows, and decided to exert a bit of authority.\n ‘Nonsense,’ he said briskly. He pulled out a bundle of foul-smelling yellow matches, and said, ‘Now, I want you all to pile\n ‘I did see it, you know,’ said the small wizard, sulkily. \n","sourceLink":"https://allnovel.net/sourcery-discworld-5/page-23.html","bookId":1624,"book":{"id":1624,"title":"Sourcery (Discworld #5)","description":"Storyline: \n Sourcery (Discworld #5) \n When last seen, the singularly inept wizard Rincewind had fallen off the edge of the world. Now magically, he\u0027s turned up again, and this time he\u0027s brought the Luggage. \n But that\u0027s not all.... \n Once upon a time, there was an eighth son of an eighth son who was, of course, a wizard. As if that wasn\u0027t complicated enough, said wizard then had seven sons. And then he had an eighth son -- a wizard squared (that\u0027s all the math, really). Who of course, was a source of magic -- a sorcerer.\n \n","cover":"https://allnovel.net/images/sourcery-discworld-5.jpg","author":"Terry Pratchett","type":"Humorous","source":"allnovel","link":"https://allnovel.net/sourcery-discworld-5.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:14:06 PM"}}
