{"id":95444,"no":39,"title":"Page 39","content":"\\n\\n ‘Yes. That’s right. You’ve got it exactly.’\\n\\n Conina and Creosote exchanged glances. Nijel remained sitting proudly in the saddle, a faint smile on his face.\\n\\n ‘Is your geese giving you trouble?’ said the Seriph.\\n\\n ‘Geas,’ said Nijel calmly. ‘It’s not giving me trouble, it’s just that I must do something brave before I die.’\\n\\n ‘That’s it though,’ said Creosote. ‘That’s the whole rather sad point. You’ll do something brave, and then you’ll die.’\\n\\n ‘What alternative have we got?’ said Nijel.\\n\\n They considered this.\\n\\n ‘I don’t think I’m much good at explaining,’ said Conina, in a small voice.\\n\\n ‘I am,’ said Nijel, firmly. ‘I’m always having to explain.’\\n\\n The scattered particles of what had been Rincewind’s mind pulled themselves together and drifted up through the layers of dark unconsciousness like a three-day corpse rising to the surface.\\n\\n It probed its most recent memories, in much the same way that one might scratch a fresh scab.\\n\\n He could recall something about a staff, and a pain so intense that it appeared to insert a chisel between every cell in his body and hammer on it repeatedly.\\n\\n He remembered the staff fleeing, dragging him after it. And then there had been that dreadful bit where Death had appeared and reached past him, and the staff had twisted and become suddenly alive and Death had said, IPSLORE THE RED, I HAVE YOU NOW.\\n\\n And now there was this.\\n\\n By the feel of it Rincewind was lying on sand. It was very cold.\\n\\n He took the risk of seeing something horrible and opened his eyes.\\n\\n The first thing he saw was his left arm and, surprisingly, his hand. It was its normal grubby self. He had expected to see a stump.\\n\\n It seemed to be night-time. The beach, or whatever it was, stretched on towards a line of distant low mountains, under night sky frosted with a million white stars.\\n\\n A little closer to him there was a rough line in the silvery sand. He lifted his head slightly and saw the scatter of molten droplets. They were octiron, a metal so intrinsically magical that no forge on the Disc could even warm it up.\\n\\n ‘Oh,’ he said. ‘We won, then.’\\n\\n He flopped down again.\\n\\n After a while his right hand came up automatically and patted the top of his head. Then it patted the sides of his head. Then it began to grope, with increasing urgency, in the sand around him.\\n\\n Eventually it must have communicated its concern to the rest of Rincewind, because he pulled himself upright and said, ‘Oh, bugger.’\\n\\n There seemed to be no hat anywhere. But he could see a small white shape lying very still in the sand a little way away and, further off -\\n\\n A column of daylight.\\n\\n It hummed and swayed in the air, a three-dimensional hole into somewhere else. Occasional flurries of snow blew out of it. He could see skewed images in the light, that might be buildings or landscapes warped by the weird curvature. But he couldn’t see them very clearly, because of the tall, brooding shadows that surrounded it.\\n\\n The human mind is an astonishing thing. It can operate on several levels at once. And, in fact, while Rincewind had been wasting his intellect in groaning and looking for his hat, an inner part of his brain had been observing, assessing, analysing and comparing.\\n\\n Now it crept up to his cerebellum, tapped it on the shoulder, thrust a message into its hand and ran for it.\\n\\n The message ran something like this: I hope I find me well. The last trial of magic has been too much for the tortured fabric of reality. It has opened a hole. I am in the Dungeon Dimensions. And the things in front of me are … the Things. It has been nice knowing me.\\n\\n The particular thing nearest Rincewind was at least twenty feet high. It looked like a dead horse that had been dug up after three months and then introduced to a range of new experiences, at least one of which had included an octopus.\\n\\n It hadn’t noticed Rincewind. It was too busy concentrating on the light.\\n\\n Rincewind crawled back to the still body of Coin and nudged it gently.\\n\\n ‘Are you alive?’ he said. ‘If you’re not, I’d prefer it if you didn’t answer.’\\n\\n Coin rolled over and stared up at him with puzzled eyes. After a while he said, ‘I remember-’\\n\\n ‘Best not to,’ said Rincewind.\\n\\n The boy’s hand groped vaguely in the sand beside him.\\n\\n ‘It isn’t here any more,’ said Rincewind, quietly. The hand stopped its searching.\\n\\n Rincewind helped Coin to sit up. He looked blankly at the cold silver sand, then at the sky, then at the distant Things, and then at Rincewind.\\n\\n ‘I don’t know what to do,’ he said.\\n\\n ‘No harm in that. I’ve never known what to do,’ said Rincewind with hollow cheerfulness. ‘Been completely at a loss my whole life.’ He hesitated. ‘I think it’s called being human, or something.’\\n\\n ‘But I’ve always known what to do!’\\n\\n Rincewind opened his mouth to say that he’d seen some of it, but changed his mind. Instead he said, ‘Chin up. Look on the bright side. It could be worse.’\\n\\n Coin took another look around.\\n\\n ‘In what respect, exactly?’ he said, his voice a shade more normal.\\n\\n Um.’\\n\\n ‘What is this place?’\\n\\n ‘It’s a sort of other dimension. The magic broke through and we went with it, I think.’\\n\\n ‘And those things?’\\n\\n They regarded the Things.\\n\\n ‘I think they’re Things. They’re trying to get back through the hole,’ said Rincewind. ‘It isn’t easy. Energy levels, or something. I remember we had a lecture on them once. Er.’\\n\\n Coin nodded, and reached out a thin pale hand towards Rincewind’s forehead.\\n\\n ‘Do you mind-?’ he began.\\n\\n Rincewind shuddered at the touch. ‘Mind what?’ he said.\\n\\n - if I have a look in your head?\\n\\n ‘Aargh.’\\n\\n It’s rather a mess in here. No wonder you can’t find things.\\n\\n ‘Ergh.’\\n\\n You ought to have a clear out.\\n\\n ‘Oogh.’\\n\\n Ah.’\\n\\n Rincewind felt the presence retreat. Coin frowned.\\n\\n ‘We can’t let them get through,’ he announced. ‘They have horrible powers. They’re trying to will the hole bigger, and they can do it. They’ve been waiting to break into our world for-’ he frowned -’ians?’\\n\\n ‘Aeons,’ said Rincewind.\\n\\n Coin opened his other hand, which had been tightly clenched, and showed Rincewind the small grey pearl.\\n\\n ‘Do you know what this is?’ he said.\\n\\n ‘No. What is it?’\\n\\n ‘I–can’t remember. But we should put it back.’\\n\\n ‘Okay. Just use sourcery. Blow them to bits and let’s go home.’\\n\\n ‘No. They live on magic. It’d only make them worse. I can’t use magic.’\\n\\n ‘Are you sure?’ said Rincewind.\\n\\n ‘I’m afraid your memory was very clear on the subject.’\\n\\n ‘Then what shall we do?’\\n\\n ‘I don’t know!’\\n\\n Rincewind thought about this and then, with an air of finality, started to take off his last sock.\\n\\n ‘No half-bricks,’ he said, to no-one in particular. ‘Have to use sand.’\\n\\n ‘You’re going to attack them with a sockful of sand?’\\n\\n ‘No. I’m going to run away from them. The sockful of sand is for when they follow.’\\n\\n People were returning to Al Khali, where the ruined tower was a smoking heap of stones. A few brave souls turned their attention to the wreckage, on the basis that there might be survivors who could be rescued or looted or both.\\n\\n And, among the rubble, the following conversation might have been heard:\\n\\n ‘There’s something moving under here!’\\n\\n ‘Under that? By the two beards of Imtal, you are mishearing. It must weigh a ton.’\\n\\n ‘Over here, brothers!’\\n\\n And then sounds of much heaving would have been heard, and then:\\n\\n ‘It’s a box!’\\n\\n ‘It could be treasure, do you think?’\\n\\n ‘It’s growing legs, by the Seven Moons of Nasreem!’\\n\\n ‘Five moons-’\\n\\n ‘Where’d it go? Where’d it go?’\\n\\n ‘Never mind about that, it’s not important. Let’s get this straight, according to the legend it was five moons-’\\n\\n In Klatch they take their mythology seriously. It’s only real life they don’t believe.\\n\\n The three horsepersons sensed the change as they descended through the heavy snowclouds at the Hub end of the Sto Plain. There was a sharp scent in the air.\\n\\n ‘Can’t you smell it?’ said Nijel, ‘I remember it when I was a boy, when you lay in bed on that first morning in winter, and you could sort of taste it in the air and-’\\n\\n The clouds parted below them and there, filling the high plains country from end to end, were the herds of the Ice Giants.\\n\\n They stretched for miles in every direction, and the thunder of their stampede filled the air.\\n\\n The bull glaciers were in the lead, bellowing their vast creaky calls and throwing up great sheets of earth as they ploughed relentlessly forward. Behind them pressed the great mass of cows and their calves, skimming over land already ground down to the bedrock by the leaders.\\n\\n They bore as much resemblance to the familiar glaciers the world thought it knew as a lion dozing in the shade bears to three hundred pounds of wickedly coordinated muscle bounding towards you with its mouth open.\\n\\n ‘… and … and … when you went to the window,’ Nijel’s mouth, lacking any further input from his brain, ran down.\\n\\n Moving, jostling ice packed the plain, roaring forward under a great cloud of clammy steam. The ground shook as the leaders passed below, and it was obvious to the onlookers that whoever was going to stop this would need more than a couple of pounds of rock salt and a shovel.\\n\\n ‘Go on, then,’ said Conina, ‘explain. I think you’d better shout.\\n\\n Nijel looked distractedly at the herd.\\n\\n ‘I think I can see some figures,’ said Creosote helpfully. ‘Look, on top of the leading … things.’\\n\\n Nijel peered through the snow. There were indeed beings moving around on the backs of the glaciers. They were human, or humanoid, or at least humanish. They didn’t look very big.\\n\\n That turned out to be because the glaciers themselves were very big, and Nijel wasn’t very good at perspective. As the horses flew lower over the leading glacier, a huge bull heavily crevassed and scarred by moraine, it became apparent that one reason why the Ice Giants were known as the Ice Giants was because they were, well, giants.\\n\\n The other was that they were made of ice.\\n\\n A figure the size of a large house was crouched at the crest of the bull, urging it to greater efforts by means of a spike on a long pole. It was craggy, in fact it was more nearly faceted, and glinted green and blue in the light; there was a thin band of silver in its snowy locks, and its eyes were tiny and black and deep set, like lumps of coal.[24]\\n\\n There was a splintering crash ahead as the leading glaciers smacked into a forest. Birds rattled up in panic. Snow and splinters rained down around Nijel as he galloped on the air alongside the giant. \\n\\n","sourceLink":"https://allnovel.net/sourcery-discworld-5/page-39.html","bookId":1624,"book":{"id":1624,"title":"Sourcery (Discworld #5)","description":"Storyline: Sourcery (Discworld #5) \\n When last seen, the singularly inept wizard Rincewind had fallen off the edge of the world. Now magically, he\u0027s turned up again, and this time he\u0027s brought the Luggage. \\n But that\u0027s not all.... \\n Once upon a time, there was an eighth son of an eighth son who was, of course, a wizard. As if that wasn\u0027t complicated enough, said wizard then had seven sons. And then he had an eighth son -- a wizard squared (that\u0027s all the math, really). Who of course, was a source of magic -- a sorcerer.\\n","cover":"https://allnovel.net/images/sourcery-discworld-5.jpg","author":"Terry Pratchett","type":"Humorous","source":"allnovel","link":"https://allnovel.net/sourcery-discworld-5.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:14:06 PM"}}
