{"id":95445,"no":40,"title":"Page 40","content":"\n He cleared his throat.\n ‘Erm,’ he said, ‘excuse me?’\n Ahead of the boiling surf of earth, snow and smashed timber a herd of caribou was running in blind panic, their rear hooves a few feet from the tumbling mess.\n Nijel tried again.\n ‘I say?’ he shouted.\n The giant’s head turned towards him.\n ‘Vot you want?’ it said. ‘Go avay, hot person.’\n ‘Sorry, but is this really necessary?’\n The giant looked at him in frozen astonishment. It turned around slowly and regarded the rest of the herd, which seemed to stretch all the way to the Hub. It looked at Nijel again.\n ‘Yarss,’ it said, ‘I tink so. Otherwise, why ve do it?’\n ‘Only there’s a lot of people out there who would prefer you not to, you see’, said Nijel, desperately. A rock spire loomed briefly ahead of the glacier, rocked for a second and then vanished.\n He added, Also children and small furry animals.’\n ‘They vill suffer in the cause of progress. Now is the time ve reclaim the world,’ rumbled the giant. ‘Whole vorld of ice. According to inevitability of history and triumph of thermodynamics.’\n ‘Yes, but you don’t have to,’ said Nijel.\n ‘Ve vant to,’ said the giant. ‘The gods are gone, ve throw off shackles of outmoded superstition.’\n ‘Freezing the whole world solid doesn’t sound very progressive to me,’ said Nijel.\n ‘Ve like it.’\n ‘Yes, yes,’ said Nijel, in the maniacally glazed tones of one who is trying to see all sides of the issue and is certain that a solution will be found if people of goodwill will only sit around a table and discuss things rationally like sensible human beings. ‘But is this the right time? Is the world ready for the triumph of ice?’\n ‘It bloody veil better be,’ said the giant, and swung his glacier prod at Nijel. It missed the horse but caught him full in the chest, lifting him clean out of the saddle and flicking him on to the glacier itself. He spun, spreadeagled, down its freezing flanks, was carried some way by the boil of debris, and rolled into the slush of ice and mud between the speeding walls.\n He staggered to his feet, and peered hopelessly into the freezing fog. Another glacier bore down directly on him.\n So did Conina. She leaned over as her horse swept down out of the fog, caught Nijel by his leather barbarian harness, and swung him up in front of her.\n As they rose again he wheezed, ‘Cold-hearted bastard. I really thought I was getting somewhere for a moment there. You just can’t talk to some people.’\n The herd breasted another hill, scraping off quite a lot of it, and the Sto Plain, studded with cities, lay helpless before it.\n Rincewind sidled towards the nearest Thing, holding Coin with one hand and swinging the loaded sock in the other.\n ‘No magic, right?’ he said.\n ‘Yes,’ said the boy.\n ‘Whatever happens, you musn’t use magic?’\n ‘That’s it. Not here. They haven’t got much power here, if you don’t use magic. Once they break through, though …’\n His voice trailed away.\n ‘Pretty awful,’ Rincewind nodded.\n ‘Terrible,’ said Coin.\n Rincewind sighed. He wished he still had his hat. He’d just have to do without it.\n All right,’ he said. ‘When I shout, you make a run for the light. Do you understand? No looking back or anything. No matter what happens.’\n ‘No matter what?’ said Coin uncertainly.\n ‘No matter what.’ Rincewind gave a brave little smile. ‘Especially no matter what you hear.’\n He was vaguely cheered to see Coin’s mouth become an ‘O’ of terror.\n ‘And then,’ he continued, ‘when you get back to the other side-’\n ‘What shall I do?’\n Rincewind hesitated. ‘I don’t know,’ he said. ‘Anything you can. As much magic as you like. Anything. Just stop them. And … um …’\n ‘Yes?’\n Rincewind gazed up at the Thing, which was still staring into the light.\n ‘If it … you know … if anyone gets out of this, you know, and everything is all right after all, sort of thing, Id like you to sort of tell people I sort of stayed here. Perhaps they could sort of write it down somewhere. I mean, I wouldn’t want a statue or anything,’ he added virtuously.\n After a while he added, ‘I think you ought to blow your nose.’\n Coin did so, on the hem of his robe, and then shook Rincewind’s hand solemnly.\n ‘If ever you …’ he began, ‘that is, you’re the first … it’s been a great … you see, I never really …’ His voice trailed off, and then he said, ‘I just wanted you to know that.’\n ‘There was something else I was trying to say,’ said Rincewind, letting go of the hand. He looked blank for a moment, and then added, ‘Oh, yes. It’s vital to remember who you really are. It’s very important. It isn’t a good idea to rely on other people or things to do it for you, you see. They always get it wrong.’\n ‘I’ll try and remember,’ said Coin.\n ‘It’s very important,’ Rincewind repeated, almost to himself. ‘And now I think you’d better run.’\n Rincewind crept closer to the Thing. This particular one had chicken legs, but most of the rest of it was mercifully hidden in what looked like folded wings.\n It was, he thought, time for a few last words. What he said now was likely to be very important. Perhaps they would be words that would be remembered, and handed down, and maybe even carved deeply in slabs of granite.\n Words without too many curly letters in, therefore.\n ‘I really wish I wasn’t here,’ he muttered.\n He hefted the sock, whirled it once or twice, and smashed the Thing on what he hoped was its kneecap.\n It gave a shrill buzz, spun wildly with its wings creaking open, lunged vaguely at Rincewind with its vulture head and got another sockful of sand on the upswing.\n Rincewind looked around desperately as the Thing staggered back, and saw Coin still standing where he had left him. To his horror he saw the boy begin to walk towards him, hands raised instinctively to fire the magic which, here, would doom both of them.\n ‘Run away, you idiot!’ he screamed, as the Thing began to gather itself for a counter-attack. From out of nowhere he found the words, ‘You know what happens to boys who are bad!’\n Coin went pale, turned and ran towards the light. He moved as though through treacle, fighting against the entropy slope. The distorted image of the world turned inside out hovered a few feet away, then inches, wavering uncertainly …\n A tentacle curled around his leg, tumbling him forward.\n He flung his hands out as he fell, and one of them touched snow. It was immediately grabbed by something else that felt like a warm, soft leather glove, but under the gentle touch was a grip as tough as tempered steel and it tugged him forward, also dragging whatever it was that had caught him.\n Light and grainy dark flicked around him and suddenly he was sliding over cobbles slicked with ice.\n The Librarian let go his hold and stood over Coin with a length of heavy wooden beam in his hand. For a moment the ape reared against the darkness, the shoulder, elbow and wrist of his right arm unfolding in a poem of applied leverage, and in a movement as unstoppable as the dawn of intelligence brought it down very heavily. There was a squashy noise and an offended screech, and the burning pressure on Coin’s leg vanished.\n The dark column wavered. There were squeals and thumps coming from it, distorted by distance.\n Coin struggled to his feet and started to run back into the dark, but this time the Librarian’s arm blocked his path.\n ‘We can’t just leave him in there!’\n The ape shrugged.\n There was another crackle from the dark, and then a moment of almost complete silence.\n But only almost complete. Both of them thought they heard, a long way off but very distinct, the sound of running feet fading into the distance.\n They found an echo in the outside world. The ape glanced around, and then pushed Coin hurriedly to one side as something squat and battered and with hundreds of little legs barrelled across the stricken courtyard and, without so much as pausing in its stride, leapt into the disappearing darkness, which flickered for one last time and vanished.\n There was a sudden flurry of snow across the air where it had been.\n Coin wrenched free of the Librarian’s grip and ran into the circle, which was already turning white. His feet scuffed up a sprinkle of fine sand.\n ‘He didn’t come out!’ he said.\n ‘Oook,’ said the Librarian, in a philosophic manner.\n ‘I thought he’d come out. You know, just at the last minute.’\n ‘Oook?’\n Coin looked closely at the cobbles, as if by mere concentration he could change what he saw. ‘Is he dead?’\n ‘Gook,’ observed the Librarian, contriving to imply that Rincewind was in a region where even things like time and space were a bit iffy, and that it was probably not very useful to speculate as to his exact state at this point in time, if indeed he was at any point in time at all, and that, all in all, he might even turn up tomorrow or, for that matter, yesterday, and finally that if there was any chance at all of surviving then Rincewind almost certainly would.\n ‘Oh,’ said Coin.\n He watched the Librarian shuffle around and head back for the Tower of Art, and a desperate loneliness overcame him.\n ‘I say!’ he yelled.\n ‘Gook?’\n ‘What should I do now?’\n ‘Gook?’\n Coin waved vaguely at the desolation.\n ‘You know, perhaps I could do something about all this?’, he said in a voice tilting on the edge of terror. ‘Do you think that would be a good idea? I mean, I could help people. I’m sure you’d like to be human again, wouldn’t you?’\n The Librarian’s everlasting smile hoisted itself a little further up his face, just enough to reveal his teeth.\n ‘Okay, perhaps not,’ said Coin hurriedly, ‘but there’s other things I could do, isn’t there?’\n The Librarian gazed at him for some time, then dropped his eyes to the boy’s hand. Coin gave a guilty start, and opened his fingers.\n The ape caught the little silver ball neatly before it hit the ground and held it up to one eye. He sniffed it, shook it gently, and listened to it for a while.\n Then he wound up his arm and flung it away as hard as possible.\n ‘What-’ Coin began, and landed full length in the snow when the Librarian pushed him over and dived on top of him.\n The ball curved over at the top of its arc and tumbled down, its perfect path interrupted suddenly by the ground. There was a sound like a harp string breaking, a brief babble of incomprehensible voices, a rush of hot wind, and the gods of the Disc were free.\n They were very angry.\n ‘There is nothing we can do, is there?’ said Creosote.\n ‘No,’ said Conina.\n ‘The ice is going to win, isn’t it?’ said Creosote.\n ‘Yes,’ said Conina. \n","sourceLink":"https://allnovel.net/sourcery-discworld-5/page-40.html","bookId":1624,"book":{"id":1624,"title":"Sourcery (Discworld #5)","description":"Storyline: \n Sourcery (Discworld #5) \n When last seen, the singularly inept wizard Rincewind had fallen off the edge of the world. Now magically, he\u0027s turned up again, and this time he\u0027s brought the Luggage. \n But that\u0027s not all.... \n Once upon a time, there was an eighth son of an eighth son who was, of course, a wizard. As if that wasn\u0027t complicated enough, said wizard then had seven sons. And then he had an eighth son -- a wizard squared (that\u0027s all the math, really). Who of course, was a source of magic -- a sorcerer.\n \n","cover":"https://allnovel.net/images/sourcery-discworld-5.jpg","author":"Terry Pratchett","type":"Humorous","source":"allnovel","link":"https://allnovel.net/sourcery-discworld-5.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:14:06 PM"}}
