{"id":21460,"no":15,"title":"Chapter XIV The Welcome Message","content":"One day Gudrun stood with Hildburg on the shore watching the sun sink like a fiery ball into the shining sea, when suddenly something rose above the crimson surface of the water that looked like a white swan. But when it came nearer, Gudrun saw that it was a beautiful mermaid; and as both the damsels gazed in wonder at this apparition, it spoke to them and said: “If ye seek for comfort, then ask of me what ye would know!” So Gudrun asked first of all if her mother yet lived and if all was well with her. The mermaid answered: “Gladly will I tell thee what ’twill rejoice thy heart to hear. Queen Hilda lives and ever hopes to see thy safe return. To that end hath she made ready such a mighty fleet as seldom hath sailed the waves.” Again Gudrun asked: “How fares it with my brother Ortwin? and tell me, O gentle spirit, is Herwig, my betrothed, alive?” Gudrun on the Strand 79 In silvery tones the mermaid replied: “Well are they both, and now upon the sea. Soon shalt thou have proof that thou art not forgotten.” Then Gudrun’s face shone, and tears of joy glistened in her eyes. “Truly,” she said, “these are joyous tidings thou dost bring me. Yet tell me further if thou canst—do Irolt and Morung come hither also?” “Soon shall many a Norman helm be shattered by their swords!” answered the maiden, and so saying she disappeared beneath the crimson flood. Then the maidens lamented that they could question her no further, and Gudrun said: “Come forth to us once more, sweet messenger!” whereat the water parted and again the mermaid arose. “Ask what thou wouldst know!” she said, and Gudrun continued eagerly: “Hartmut and Ludwig are well armed and have many a valiant knight to aid them, wherefore I would know if Horant too is with my kin. ’Twould grieve me much did we lack his sword in battle!” 80 “He is among the heroes on the fleet,” the mermaid answered; “when they shall engage in battle to deliver thee and avenge the death of the King and his followers, ’tis Horant that will bear thy mother’s banner in the fight.” Once more Gudrun asked: “And Frute and Wate—are they too with our knights?” “In truth,” replied the mermaid, “thou hast no truer friends than those same heroes. Frute is on that ship whose helm Count Wate’s mighty arm directs.” Again she was about to vanish, but Gudrun cried beseechingly: “Tell me, I pray thee, when shall the first messenger from my mother appear to me?” And the mermaid answered as she slowly sank beneath the waves: “To-morrow morn two messengers will come to thee—warriors are they both, on whom thou mayst rely.” Gudrun and Hildburg were now so full of joy and hope that they only half completed their allotted tasks, and they talked of nothing but the beloved friends they were so soon to see. On their return in the evening they were received by the wicked Gerlinda with bitter abuse because they had accomplished so little work. 81 Hildburg pleaded: “Be patient with us, madam, for indeed we work as much as we are able. Were it not for the biting winds that blow upon the shore we could do better.” But the Queen replied harshly: “What care I for the cold winds! See to it ye are at your work betimes upon the morrow, for there is much to be made ready for the feast, and if all be not finished by nightfall, in truth ye shall suffer for it more dearly than ever did servants of a King!” After their scanty meal of bread and water, they sought the chamber where two hard benches without pillows of any sort served them as beds; but little sleep was there for them, so eagerly they watched for the first glimmer of dawn. At last a faint ray of light penetrated the chamber, and Hildburg arose and looked out of the window. “Alas!” she cried, “what shall we do? Snow has fallen in the night. If we are forced to wash to-day in those piercing winds, by sunset they will surely find us dead upon the shore!” Gudrun, too, shuddered at the thought, but she reminded Hildburg it was there they were to see the messengers, and this gave them courage. Also she said to her: “Go thou to the Queen and beseech her to give us shoes to wear to-day. If I ask it she will certainly refuse, so great is her hatred for me.” 82 So Hildburg sought the Queen, who still lay in her luxurious bed, but the maiden dared not awaken her and returned sadly to her companion. Gerlinda soon appeared, however, and berated them roughly for not being already at their work. “Snow has fallen, O Queen,” said Hildburg; “give us shoes to wear, we pray thee, else shall we surely freeze!” But Gerlinda only laughed, and cried scornfully: “Let your pride keep you warm, forsooth! No shoes shall you have from me. And beware if your work be not finished by nightfall! What would your deaths matter to me, fool?” Weeping bitterly, Gudrun exclaimed: “It may be God’s will that I shall one day remind thee of this!” And in their bare feet the poor maidens made their way through the March snows to the seashore and began their painful task. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3223/87868.html","bookId":703,"book":{"id":703,"title":"Gudrun","description":"简介： There once lived in Denmark a mighty King named Hetel, whose fame spread far and wide. His wife Hilda bore him two children, a son and a daughter called Ortwin and Gudrun, who were endowed with such surpassing strength and beauty that as they grew to...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3223","creation":"Aug 1, 2019 12:19:11 AM","modification":"Aug 1, 2019 12:19:11 AM"}}
