{"id":21462,"no":17,"title":"Chapter XVI Danger and Stratagem","content":"Now it chanced that Heregart, the damsel who was wedded to Hartmut’s cup-bearer, had spied the two knights with Gudrun and Hildburg on the shore, and supposing them to be fishermen, she told the Queen how Gudrun had kissed and embraced them. Hastening to the window, Gerlinda saw the maidens standing idle and seeming by their motions to be talking eagerly together. So indeed they were, for they could think of nothing but their happiness and the good fortune that was in store for them the next day. “Two great and noble Kings have this day held me in their arms,” said Gudrun, “and no longer will I degrade myself with these shameful tasks Gerlinda hath imposed on me.” But Hildburg replied: “Methinks ’twere better we did finish what was given us, for that wicked wretch will make us suffer yet more cruelly if she find it left undone.” 94 “Nay, let come what will,” cried Gudrun, proudly, “for me, I care not!” and therewith she flung all the garments into the sea. For a time they floated on the surface, then sank, and were seen no more. By this time it was growing dark, and the maidens took their way back to the castle, where the Queen met them with angry abuse. “Wherefore tarriest thou so late?” she cried to Gudrun. “The love of mighty Kings thou dost despise forsooth, yet thou stoopest to bandy words, aye, and kisses, too, with low knaves upon the shore. Deny it not, for Heregart with her own eyes hath seen it! Methinks thy boasted pride should keep thee from such deeds as this!” Gudrun raised her head, and her cheeks flamed, as she retorted: “’Tis shameful falsehood thou dost speak! Never have I held speech with any man in all this land save he were of my friends or kindred!” “Ha!” cried Gerlinda, choking with rage, “thou darest to give me the lie! Dearly shalt thou atone for this, thou spiteful jade!” “Take heed how thou dost do me further wrong!” said Gudrun. “Of nobler blood am I than thou; and thy whole house and thou may one day have to reckon for your sins!” 95 Suddenly Gerlinda discovered the empty baskets and asked where the garments were. “At the bottom of the sea!” replied Gudrun, “where they may remain, for aught of me!” “Now shall it fare ill with you for this!” shrieked the Queen, and trembling with passion she ordered thorns to be brought with which to scourge Gudrun’s back, and bade two of her retainers bind the maiden to a post with hempen cords. At this a great weeping and wailing arose among the women; but Gudrun in her extremity resorted to an artifice. “Gerlinda,” she said, “thou hast been greatly deceived. Yet bethink thee—how can it be that I should ever wear the crown of Normandy, if I have once been bound and scourged by knaves here in thy land?” In speechless astonishment the Queen gazed at Gudrun as if she had not heard her words aright. But the maiden continued: “It is even as I say. If it be still his wish I will consent to wed thy son and be Queen of Normandy.” 96 Forthwith some knights who heard these words hastened to Hartmut with the news, hoping for a reward. That hero was seated in his chamber with his comrades, listening to the tale of some aged warrior’s heroic deeds, when the door flew open and a knight burst in exclaiming: “Good news, good news, most noble King! The lady Gudrun’s heart hath softened, and she consents to be thy wife!” “Nay, surely thou art mad!” said Hartmut. “How can it be, when all these years she hath remained deaf to my entreaties? Yet, by my faith, an thy words prove true thou shalt have three castles with all the lands thereto, aye, and sixty rings of gold moreover, for thy news. Ah, then indeed would my life be blest!” Therewith came a second knight and said: “The Queen desires thy presence, my lord, for Gudrun agrees to accept thee as her husband.” Then Hartmut sprang up joyfully and hastened to Gudrun, whom he found still in her dripping garments. The tears started to her eyes at sight of him, for although necessity had forced her to this stratagem, it grieved her sorely that she must deceive him. He was about to clasp her to his heart, but she stepped back, saying: “Nay, my lord Hartmut, that may not be as yet. Ill would it become a mighty King to stoop to a lowly serving maid as I am now; but when I stand before thee crowned and clad in royal robes, then mayst thou embrace me before all thy knights.” 97 “Most noble maiden,” replied Hartmut, “since thou art now to be my wife, gladly will I do thy will in all things.” “If this be true and I may here indeed command,” said Gudrun, “then do I desire a bath to be prepared at once, and let my damsels be restored to me.” “Thy wishes shall be obeyed forthwith,” replied Hartmut, and he ordered the maidens to be summoned thither from their labors. Soon they appeared, clad in soiled and ragged garments, their hair hanging in disorder about their faces. “Behold, O King, the plight of these poor maids!” said Gudrun, pointing to them. “Methinks ’tis little to thy honor they should meet with such mistreatment.” “All shall be changed now, I promise thee, fair maid,” replied the King. “See then that those who have been made to suffer for me be provided with such apparel as befits their rank, for all are of noble birth,” demanded Gudrun. 98 After Hartmut had issued these commands he left the hall; and the tirewomen, hoping thereby to win Gudrun’s favor, performed their tasks with such zeal and despatch that soon the maidens blossomed out fair and beautiful once more in their costly attire. But before Gudrun they all paled as do the stars before the sun. Then Hartmut had rich viands laid before them, with wine and mead; and sending for his sister Ortrun, he made known to her that what they so long had prayed for at last had come to pass. Ortrun hastened at once to Gudrun and the two maidens wept in each other’s arms. Once more they sat joyfully side by side, yet each had a different cause for happiness; Ortrun rejoicing that she was to have Gudrun as a sister, while Gudrun’s thoughts were of her friends and the deliverance that was to come to her through them. “Already had it been agreed,” said Ortrun, “that I should wear the crown of the kingdom; for since thou didst scorn Hartmut, he would always have remained unwedded. But to thee, dear Gudrun, I gladly yield both crown and royal honors.” 99 Her loving words brought tears to Gudrun’s eyes, and she replied softly: “Never hast thou shown me aught but kindness. May God reward thee for it! Nor will I forget how oft my sufferings have caused thee grief.” Then turning to Hartmut, she said: “Do thou send messengers to all thy friends and summon them to court without delay. Not till these have shown themselves loyal to me may I wear the crown of thy kingdom in peace and safety.” So Hartmut went forthwith and chose an hundred knights to ride forth with messages that very night—much to Gudrun’s secret joy, for she knew these warriors would be far from the battlefield by the next morning. Then she begged to be left alone with her damsels after their long separation, and Gerlinda and Hartmut yielded willingly to her desire. Ortrun, too, kissed her friend and departed, while Hartmut sent cup-bearers and servers, who once more loaded the tables with food and drink. One of the maidens cried woefully: “My heart is like to break, for now we shall see home no more, but ever abide here with those who brought us hither to our sorrow.” And she began to weep as did all the rest. 100 Gudrun dared not speak now of the news which had brought her such comfort, but her joy was so great that she laughed aloud. Word of this was brought to Gerlinda, who told Ludwig of it and then sought Hartmut. “My son,” she said, “believe me, some dire evil threatens us! Gudrun, whose lips have never smiled in all these years, hath just laughed aloud, so that the sound of it was heard in the hall without. Some secret message must have reached her with good news. Be on thy guard, I say, and see that thy comrades are well armed!” But Hartmut was too full of joy to harbor any thought of ill. “Begrudge not her happiness to the maid!” was his reply. “Her friends are much too far away ever to come hither to seek her!” After their repast, Gudrun asked the servitors if beds had been prepared for her and her women; whereupon, taking lights, they led them to a hall in which stood thirty beds, with pillows of gayly colored Arabian stuffs, and decked with coverlets of silk cunningly interwoven with threads of gold which gleamed like fire. Gudrun dismissed them, saying: “We would fain seek rest such as has long been denied us; wherefore depart and leave us to ourselves.” 101 When they were alone, the doors were made fast and all seated themselves to partake of the rare wines that had been placed upon the table. Then Gudrun said in a low voice: “At last, dear maidens, I may make known what cause we have for rejoicing. All have remained true to me and to the fatherland save one, Heregart, who will sorely rue her infidelity, I fear. This very day my brother Ortwin, and Herwig, my betrothed, came to me bringing good tidings. To-morrow you yourselves shall see them before the castle with all their host. Hearken now and mark my words! She who with morning’s light shall first discover the banners of our friends and tell me of it will have rich reward.” Now the joy of the maidens knew no bounds; but Gudrun, fearing there were listeners without the door, bade them repress all expression thereof that might betray them. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3223/87870.html","bookId":703,"book":{"id":703,"title":"Gudrun","description":"简介： There once lived in Denmark a mighty King named Hetel, whose fame spread far and wide. His wife Hilda bore him two children, a son and a daughter called Ortwin and Gudrun, who were endowed with such surpassing strength and beauty that as they grew to...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3223","creation":"Aug 1, 2019 12:19:11 AM","modification":"Aug 1, 2019 12:19:11 AM"}}
